[
    {
        "title": "I should be able to just understand",
        "author": "nintendo_d_s",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6tr7/i_should_be_able_to_just_understand/",
        "text": "I really can't seem to understand timezone differences. No matter what I do or what other people do to accommodate me, I just can't get it into my head. \n\nI moderate a gaming community on Discord, and the team has meetings a couple of times per month. Most of the staff are in the CSR timezone, while I am in MST. I can never seem to remember if they are an hour ahead of me or behind me. Because of this, I am an hour late to about 20% of the meetings.\n\nThey have tried using the widget that shows the time in the same timezone of the person viewing it, but that still doesn't seem to help me.\nLast night, there was a meeting at 8pm CST, and I told myself to remember to be there at 7 my time. \n\nWell, I forgot to put it in my calendar. I even forgot to check Discord for the entire day. I opened Discord at 8:25 and saw everyone was in a call. I joined the meeting, and everyone was saying their goodbyes. I had to ask them if I was really late, and they said \"yeah we just finished.\" I asked what I missed, and one of the admins just said, \"I don't want to have to go through everything again.\" I was so embarrassed that I just immediately left the call after that.\n\nThis has happened to me several times before, and I get so angry with myself every time. Why can't I just understand the time zone thing? No one else on the team has this problem. \n\nI am taking 40mg Vyvanse, but by the time I have these meetings, the medication has worn off. My brain just feels so foggy any time I try to think about the time zones, even during the day when my meds are working. \n\nDoes anyone else have this problem?",
        "created_utc": 1678213157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall question",
        "author": "Kinukles1024",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6qpm/adderall_question/",
        "text": "So for a while now I’ve been feeling like my meds aren’t working. But recently I’ve started drinking WAY more water and now I can feel the effects I was feeling when I first started taking them. Yesterday I thought the mania had hit before I was able to take my meds, but now I’m feeling it again and it’s definitely 30 minutes after I took them. Is this connected at all??",
        "created_utc": 1678212968,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I went to the doctor to get a diagnosis a year ago and she gave me tasks to complete which I never got around to and remain undiagnosed... Seems kinda flawed or is that the test?",
        "author": "phillyg31",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6q7h/so_i_went_to_the_doctor_to_get_a_diagnosis_a_year/",
        "text": "[removed]",
        "created_utc": 1678212934,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm probably just in a coma",
        "author": "drpepper2litre",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6o5u/im_probably_just_in_a_coma/",
        "text": "[removed]",
        "created_utc": 1678212809,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did good work today. My house is a horrible mess.",
        "author": "danja",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6lmo/i_did_good_work_today_my_house_is_a_horrible_mess/",
        "text": "[removed]",
        "created_utc": 1678212650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never understood the importance of truly knowing you're not alone until recently",
        "author": "MrFluffPants1349",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6kjr/never_understood_the_importance_of_truly_knowing/",
        "text": "[removed]",
        "created_utc": 1678212581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall question",
        "author": "Kinukles1024",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6jhh/adderall_question/",
        "text": "[removed]",
        "created_utc": 1678212509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do children with ADHD cry more compared to children without ADHD?",
        "author": "Longjumping_End8283",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6jdk/do_children_with_adhd_cry_more_compared_to/",
        "text": "[removed]",
        "created_utc": 1678212501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a major difference between aderall and vyvanse ?",
        "author": "Fun2loseand2pretendd",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6iqm/is_there_a_major_difference_between_aderall_and/",
        "text": "[removed]",
        "created_utc": 1678212461,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need legit ADHD studying tips",
        "author": "Beau_siv",
        "url": "https://www.reddit.com/r/ADHD/comments/11l6heo/i_need_legit_adhd_studying_tips/",
        "text": "What’re your personal studying habits? Please explain it like I’m a 4 year old. Do you have a schedule? What’s your max study time? \n\nI study often (about 40 hours a week, to include in class time) but definitely don’t feel like my input is getting a reasonable output. \n\nGoogling hasn’t really given any useful information. Searching that exact question always results in buzzfeed-esque articles with the number one tip being “remove all distractions”. Trust me buzzfeed, I know…..",
        "created_utc": 1678212381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling dismissed and frustrated by professionals",
        "author": "CookieComet",
        "url": "https://www.reddit.com/r/ADHD/comments/11l63xa/feeling_dismissed_and_frustrated_by_professionals/",
        "text": "[removed]",
        "created_utc": 1678211573,
        "upvote_ratio": 1.0
    },
    {
        "title": "I would like to block out music entirely so my wife can joyfully listen to hers",
        "author": "slusho_",
        "url": "https://www.reddit.com/r/ADHD/comments/11l63qe/i_would_like_to_block_out_music_entirely_so_my/",
        "text": "[removed]",
        "created_utc": 1678211562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone struggle with weird vision problems?",
        "author": "SirSpooglenogs",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5yd0/anyone_struggle_with_weird_vision_problems/",
        "text": "I got my eyes checked, physically everything seems okay. I know that when I drift away with my thoughts or dissociate that my vision goes blurry and when I come back it's normal again. \nThe thing is that I noticed my vision kind of flicker sometimes? So it just randomly goes in and out of focus really quick for a few seconds and then goes back to normal. \nI wondered if anyone herenhas similar experiences or any ideas why it happens? \nFor context I have an ADHD diagnosis, trauma and probably autistic but not officially diagnosed yet.",
        "created_utc": 1678211226,
        "upvote_ratio": 1.0
    },
    {
        "title": "SHORT survey :) for research on ADHD and food",
        "author": "ResearchOnADHD",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5uvf/short_survey_for_research_on_adhd_and_food/",
        "text": "[removed]",
        "created_utc": 1678211003,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so tired",
        "author": "Salty-Strain-7322",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5s6e/im_so_tired/",
        "text": "Every hour of my life is spent obsessing over my work and grades.I love learning and I try to work as hard as I can but I think perfectionism will kill me one day. It doesn’t even make me happy or proud of myself. It’s just a checkbox I have to keep ticking forever and if I don’t tick it, I feel like a worthless human being. I’m grateful for the opportunity to learn and work but I feel so inadequate as a person. All I can see are flaws.",
        "created_utc": 1678210831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationships &amp; ADHD",
        "author": "Bayzz22",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5rdl/relationships_adhd/",
        "text": "I don’t know if anyone relates but I don’t even pursue relationships because I feel like a burden. I have pretty severe adhd and I recognize I can be a lot to be around. Not just due to symptoms but also my ridiculous requirements in a serious relationship. I go through burnout and I completely socially isolate, even from family. So if I were to be living with a partner I would want my own room, and to be left alone possibly up to a week, which I understand is ridiculous. It’s also hard for me to tell if I’m hyper focusing/ obsessing over someone or if I like them, in fact, it’s impossible for me to tell, this has led to issues before. I’m happy being single honestly but I don’t think I want to live alone forever so I do worry about never finding someone.",
        "created_utc": 1678210780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources/ tests for ADHD",
        "author": "PebblesNoBammBamm",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5ied/resources_tests_for_adhd/",
        "text": "[removed]",
        "created_utc": 1678210209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lactic Acid Buildup and Vyvanse",
        "author": "Sad_Drama_6796",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5epk/lactic_acid_buildup_and_vyvanse/",
        "text": "Might be a dumb question here, but will lactic acid buildup affect Vyvanse absorption/excretion? Did a lot of physical work yesterday and woke up pretty sore and not feeling great. I took my Vyvanse this morning as usual and it doesn’t feel like it ever really kicked in. Feeling better now but now is it possible the Vyvanse already got excreted?",
        "created_utc": 1678209965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences with Vyvanse?",
        "author": "Jamie7Keller",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5edr/experiences_with_vyvanse/",
        "text": "So I was given 40 of Vyvanse and had good emotional Al regulation help but no impulse/distractability/executive distinction/“styertypical adhd” help at all. \n\nHas anyone had experiences with higher/changed doses of Vyvanse?\n\nOr experiences of it with another med at  the same time?\n\n(Of course I’m not looking for medical\nAdvice but hearing what worked for others good or bad helps me know what to talk to my doctor about and what to be careful of)",
        "created_utc": 1678209944,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kinds of worksheets would help you organize your life?",
        "author": "micheller1555",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5d7x/what_kinds_of_worksheets_would_help_you_organize/",
        "text": "[removed]",
        "created_utc": 1678209867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever regret telling new people that you have adhd?",
        "author": "mutatedpuzzle",
        "url": "https://www.reddit.com/r/ADHD/comments/11l5d08/do_you_ever_regret_telling_new_people_that_you/",
        "text": "I never know how anyone is going to react when I tell them about my diagnosis, so it’s become a guessing game. But recently, there have been a few people that make me wish I’d never said anything. A few people have started talking to me like a child, or someone with low intelligence. I know the stigma around adhd has improved a lot in recent years, but I guess assholes will always exist. Now I’m realizing I need to be more selective about who I confide in irl. \n\nIt could be worse, but I was wondering if anyone else has similar stories?",
        "created_utc": 1678209852,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kinds of worksheets would help you organize your life?",
        "author": "micheller1555",
        "url": "https://www.reddit.com/r/ADHD/comments/11l59am/what_kinds_of_worksheets_would_help_you_organize/",
        "text": "[removed]",
        "created_utc": 1678209613,
        "upvote_ratio": 1.0
    },
    {
        "title": "combining strattera + stimulant dangerous?",
        "author": "Garlic_On_Everything",
        "url": "https://www.reddit.com/r/ADHD/comments/11l55dw/combining_strattera_stimulant_dangerous/",
        "text": "[removed]",
        "created_utc": 1678209361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently diagnosed in Mid-30's. Ignorance was bliss, now more frustrated than ever.",
        "author": "DPH_NS",
        "url": "https://www.reddit.com/r/ADHD/comments/11l545w/recently_diagnosed_in_mid30s_ignorance_was_bliss/",
        "text": "I consider myself a fairly successful person, however in the last year I've had someone close to me get diagnosed as an adult and I found myself a couple of months ago very curious on how they experienced life and wanting to learn more about it. This quickly turned to me realizing I've been dealing with the almost all of the exact same issues. Over the years I had just intuitively developed my own coping mechanisms without realizing other people don't need these in their daily lives. \n\nThe biggest thing I realized recently is just how often I experience the issues that come up with ADHD. I remember shortly after accepting the fact I probably have ADHD I went to go get something from another room, got to that room and could not for the life of me remember what it was going to get. I had to go back to this room 2 more times before I got the thing and all of a sudden it just clicked. This was me experiencing executive disfunction, and this realization has kinda messed with me ever since.\n\nOnce I realized that's what I was experiencing, I started to notice it more often, and they became so much harder to excuse. I always knew I tended to procrastinate, could \"be a bit lazy\" but when it really mattered I always made sure I got done what  needed to be done, or at least thought I did. \n\nThere are so many things I really need to do on a more regular basis that I've always excused as just being a bit lazy. But I'm really not a lazy person, I want to do these things, I plan on doing these things, I'll set time aside for doing these things but they just don't happen. Now that I'm keeping stock with just how often this is the case I'm feeling more frustrated than ever. When the time comes that I planned on doing the thing, I still just can't do it and I fucking hate it.\n\nI will mention that I've since found a clinic and have been formally diagnosed and have started a very low dose of medication. Meds aren't making any noticeable difference yet, however I'm hopeful that once I get onto a proper dosage I can better deal with these issues.\n\nAnyways I just wanted to share my experience, I really should be working right now but no pressing deadlines with work so here I am.",
        "created_utc": 1678209289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone feel like the adderall they get filled isn't the right dose? as in a possible manufacturing or distribution error",
        "author": "ddddaikon",
        "url": "https://www.reddit.com/r/ADHD/comments/11l541i/does_anyone_feel_like_the_adderall_they_get/",
        "text": "[removed]",
        "created_utc": 1678209280,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like such an underachieving human",
        "author": "jayvee5021",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4xvx/i_feel_like_such_an_underachieving_human/",
        "text": "[removed]",
        "created_utc": 1678208887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you notice decreased uptake while sleeping?",
        "author": "david_ca1226",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4vi8/do_you_notice_decreased_uptake_while_sleeping/",
        "text": " I'm taking Jornay, and have noticed that it seems to wear off sooner in the day if I'm sleeping when it would normally start kicking in. Has anyone else noticed this? Not sure if it's a placebo or something. \n\nTo add a bit more detail - when looking at the FDA data, it seems like it hits peak effectiveness 15ish hours after taking it. If I'm sleeping at that time, it feels like I'm not getting it's effects when I wake up (not even the decreased effects I would usually experience at that time had I not been sleeping).",
        "created_utc": 1678208744,
        "upvote_ratio": 1.0
    },
    {
        "title": "wondering if this is just a \"me\" thing or an \"us\" thing",
        "author": "xCloudfire",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4v8y/wondering_if_this_is_just_a_me_thing_or_an_us/",
        "text": "I'm curious if this happens with anyone else, and if so, any way to help\n\nI overshare. Alot. I'm not ashamed of who I am and I would consider myself very confident and comfortable with myself. But I feel like that is to my detriment more times than not. \n\nI have had multiple times where I've been drinking with people or just hanging out and have talked, but my talking apparently always amounts to saying too much. And then I get extremely anxious at the thought of seeing those people/talking to those people again.\n\nI feel like I push myself out of friendships because I scare people off but then they talk to me again like nothing happened, but the cycle continues. Overshare, get anxious, distance, reconnect, repeat.\n\nThe part that is the hardest for me is the days after. When I'm worried if I said too much this time, will they want to hang out again? Or talk to me? Or even be around me?\n\nI have a friend coming over this Friday, but the last time we hung out, I hadn't spoken to him in years. So I talked. About everything since I last saw him. I don't want to do the same thing again but I know how I am.\n\nIs this a \"me\" issue? \n\nAlso, when I say I overshare, I always keep what I'm saying at the level of conversation. I let the conversation flow naturally wherever it goes and never try to force topics that are out of the bounds of conversation. But when in the bounds of the conversation, I say everything at that level of conversation...",
        "created_utc": 1678208726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any pharmacy has methylphenidate in NYC?",
        "author": "Remarkable_Win8929",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4rki/any_pharmacy_has_methylphenidate_in_nyc/",
        "text": "Hi\n\n&amp;#x200B;\n\nI've been taking methylphenidate 27 (morning) / 18 mg (afternoon) a day. About one and half month ago, the pharmacy just said 27mg is backordered, so I had 18mg twice a day. All my med was gone 10 days ago and had a though time.\n\n&amp;#x200B;\n\nSo I transferred my prescription to CVS, Duane Reade, but all of them completely have no stocks. I think riteaid will be same. My doc told me to find small pharmacies, but I coudn't find from first 10 pharmacies, and feel no hope. \n\n&amp;#x200B;\n\nAnyone getting Concerta or other methylphenidate generic in NYC? I may try NJ soon.",
        "created_utc": 1678208507,
        "upvote_ratio": 1.0
    },
    {
        "title": "am i wrong for feeling like this?",
        "author": "kjvpl",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4qop/am_i_wrong_for_feeling_like_this/",
        "text": " \n\nfor context: im 14\n\ni dont want you to adjust for me just because i have a mental disorder. i dont want you to tolerate me just because i have a mental disorder.\n\ni keep hearing the same things. \"oh let her be she has adhd\" \"leave it alone, you know she has adhd\" like????\n\nNO! TELL ME IF IM IN THE WRONG. TELL ME IF I MADE A MISTAKE. I DONT WANT TO BE PUT ON PEDESTAL JUST BECAUSE I HAVE A MENTAL DISORDER.\n\nmy parents keep doing this. they scold my younger sister instead of me when i make a mistake. its like im an idiot who doesnt have the ability to think for my own.\n\ni feel weird. i dont feel like a normal human.",
        "created_utc": 1678208458,
        "upvote_ratio": 0.99
    },
    {
        "title": "Help: 90 day prescription delivery in Texas.",
        "author": "Game_On__",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4qda/help_90_day_prescription_delivery_in_texas/",
        "text": "I am leaving the country and I spoke with my psychiatrist to prescribe me a 90 day supply, my insurance seemed to have a partnership with Pillpack by Amazon, so we went with that. But I just learned that Pillpack doesn't dispense more than 30 day supply at a time for controlled substances. \n\nI contacted my Dr's office and they said \"go find a pharmacy that would dispense a 90 day supply\", how the hell am I supposed to do that? \n\nAny suggestions? Especially people living in Texas, what's your experience and which pharmacy worked for you for 90 day supply?\n\nI take Vyvanse.",
        "created_utc": 1678208441,
        "upvote_ratio": 1.0
    },
    {
        "title": "am i the only one who feels like this?",
        "author": "kjvpl",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4p0l/am_i_the_only_one_who_feels_like_this/",
        "text": "[removed]",
        "created_utc": 1678208368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the Adderall shortage a regional problem in the US?",
        "author": "ASchorr92",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4kxo/is_the_adderall_shortage_a_regional_problem_in/",
        "text": "I see a lot of posts about the Adderall shortage but I have not dealt with this issue where I live (AZ). I am moving to the Twin Cities area in a few months and am wondering if I should plan on going without for a bit.\n\nThe only time I had an issue was when Walgreens somehow had 58 out of my 60 monthly Rx (a little sus) and was told I could get the 58 that day but would need another Rx to pick up the last 2 when they got more- didn't even bother.",
        "created_utc": 1678208108,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Sounds like it hasn’t impacted your life much…’",
        "author": "TheosophyKnight",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4isa/sounds_like_it_hasnt_impacted_your_life_much/",
        "text": "So, I just spoke with my doctor about being referred for formal ADHD diagnosis. But am I missing something? \n\nI gave an overview of my school troubles (much like many of you experienced), how I work a part-time low income job (despite my qualifications) so to avoid stress I can’t cope with, am estranged from my child, fell into relationship with narcissistic personality, spend most of time trying to sleep in recovery from emotional exhaustion, thoughts exploding, and fighting depression etc.\n\nThe doctor replied, “Sounds like it hasn’t impacted your life much. Since you’ve made it to [age], you must have some coping strategy.”\n\nUh… so (irrespective of whether I have ADHD or am just anxious and depressed), am I crying over nothing and this is a completely ‘coping’ way  to be!?",
        "created_utc": 1678207968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderal and welbutrin?",
        "author": "Category_Kooky",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4fmk/adderal_and_welbutrin/",
        "text": "Does anyone here also take adderall IR and welbutrin??\nI started welbutrin about 4 months ago and have been on adderall for almost 5 years. \nCurios what other people’s thoughts are….\nMy psychologist kinda scared me about the mix and also said I should NEVER be drinking. But I’ve had other doctors say it’s fine. \nShe also seems to hate adderall and prefers other medications…",
        "created_utc": 1678207777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Videos describing what ADHD is",
        "author": "bamariani",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4e0c/videos_describing_what_adhd_is/",
        "text": "I'm looking for a video that can help my parents understand what Adhd is. They cant seem to understand why I'm struggling the way that I am, and even though I tell them its because of my problems with ADHD-C, that explanation doesn't seem to reach them in any meaningful way. The worst part about it is that they dont seem to have any real desire to understand it. I've asked them mulitple times to learn about it and how it has effected me, and how it helps to explain so many of our family struggles throughout the generations, but they just dont seem to care. So I'm looking for a video that goes into what ADHD is beyond just the surface level but is still easy and short enough to understand. Thanks",
        "created_utc": 1678207675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orange juice",
        "author": "lil-darkko",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4a8s/orange_juice/",
        "text": "[removed]",
        "created_utc": 1678207439,
        "upvote_ratio": 1.0
    },
    {
        "title": "does this happen to other adhd peeps?",
        "author": "brossd85210",
        "url": "https://www.reddit.com/r/ADHD/comments/11l48hd/does_this_happen_to_other_adhd_peeps/",
        "text": "I had all the dopamine I needed to start cleaning and doing things today but a relative told me to do something  while I was already going to do and now lost all motivation to finish. I have tried multiple times to explain this to people in my life and they don't understand it. How would you make them see it? Am I just being extra for no reason? Thankyou in advance.",
        "created_utc": 1678207326,
        "upvote_ratio": 1.0
    },
    {
        "title": "do other adhd people have this issue",
        "author": "brossd85210",
        "url": "https://www.reddit.com/r/ADHD/comments/11l43p0/do_other_adhd_people_have_this_issue/",
        "text": "[removed]",
        "created_utc": 1678207020,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve had a message from my boss because I keep missing simple mistakes in my work",
        "author": "Phil-Mitchell",
        "url": "https://www.reddit.com/r/ADHD/comments/11l42bz/ive_had_a_message_from_my_boss_because_i_keep/",
        "text": "I really like my job so this is bumming me out a bit, I never used to make these errors but apparently now they’re happening all the time and people across my department have noticed. This isn’t through lack of trying I think I’m just panicking and not being able to digest a proof read properly to even notice an error because I am checking them thoroughly (I thought at least).\n\nI think I’m going to speak to my doctor about this, does this sound familiar to your own adhd at all? Is speaking to the doctor the first right step? I don’t really know what to say to them I think I’ll just mention that I can’t focus and it’s affecting my work and see what they do from there or prescribe me.\n\nShould I say anything different to them? I’m in the UK for reference",
        "created_utc": 1678206931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I get anxious when they cant remember details from memories?",
        "author": "Atticus_152",
        "url": "https://www.reddit.com/r/ADHD/comments/11l4287/why_do_i_get_anxious_when_they_cant_remember/",
        "text": " \n\nFirst time posting after lurking for a while. Hope I'm not breaking any rules.\n\nI  was recently diagnosed with ADHD (And GAD) at 29, and recalling  memories and details from my memories has been a challenge for as long  as I can remember. The more I research, the more sense I can make of my feelings. One of these is the feeling of anxiety I get when I try to  recall a memory I know I experienced, but cant remember. It's a weird  feeling, like I feel someone is sitting on my chest and I need to go get some air or walk around. I absolutely hate this feeling.\n\nIs this something anyone else experiences? If so, what have you found to help improve your memory?",
        "created_utc": 1678206925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old Dr. vs New Dr.",
        "author": "WigglyNut",
        "url": "https://www.reddit.com/r/ADHD/comments/11l41zr/old_dr_vs_new_dr/",
        "text": "-Florida area-\n\nI updated the post, it wouldn’t show on my phone for some reason. \n\nIf I get a copy of my medical records from my old doctor, will it show everything that is given to my new doctor? Like negative comments and red flags? \n\nCan an old doctor call my pharmacy and red flag me or make it impossible or very difficult for me to get my meds filled by a new doctor? \n\nCan or will the pharmacy call my old doctor to let him know I am trying to fill medication with a new doctor? \n\nDoes information that an old doctor includes in your medical history, stay on a general report that any new doctor has access to? \n\nOr is everything started fresh with a new Doctor, unless they contact the old doctor? \n\nI’m worried that my medical records with my old asshole doctor might be tainted and ruin my chances with getting Adderall with my new doctor. How should I move forward?\n\nI’ll stop with the many questions after this I promise lol \n\nThanks a bunch",
        "created_utc": 1678206910,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I keep up with work while constantly in meeting’s?",
        "author": "tyski88",
        "url": "https://www.reddit.com/r/ADHD/comments/11l41p1/how_do_i_keep_up_with_work_while_constantly_in/",
        "text": "Hi everyone first time poster here and was diagnosed with ADHD roughly 2 years ago. \nI’ve been working in my first major corporate job for a little over a year now but I’m struggling to keep up with the work load due to being pulled into multiple zoom meetings throughout the day that I don’t necessarily need to be apart of. I try to complete work during meetings where I’m not part of the conversation but it’s extremely hard to stay focused for more than a minute. \n\nAsking to be excluded from these meetings isn’t my first choice as I’m interested in hearing the discussions, but sometimes I need to be working during them just to keep up with my tasks. \n\nDoes anyone have any advice on how I can manage this?\n\nP.s. some extra background in case people start recommending looking into medication. I am already taking medication to help.",
        "created_utc": 1678206892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone get anxious when they cant remember details from memories?",
        "author": "Atticus_152",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3xlp/does_anyone_get_anxious_when_they_cant_remember/",
        "text": "[removed]",
        "created_utc": 1678206638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent ADHD diagnosis. What I've learnt so far with overcoming the traits...",
        "author": "Glittering-Ad-6690",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3wps/recent_adhd_diagnosis_what_ive_learnt_so_far_with/",
        "text": "I am a 32M, husband, new father and self employed with my own business. Recently, got a diagnosis and my life has made so much more sense now. My traits have been debilitating from procrastinating with important tasks, some subtle difficulties engaging with some individuals, staying engaged with work in previous employment as well as just being somewhat \"different\" and \"neuroatypical\" with how I see things compared to the majority of people. I'm not here to seek empathy, but just share my thoughts with what I would have wanted to know or hear earlier on. These are my own anecdotes, not everyone may agree, but I hope some of these reflections may be of use for someone...  \n\n\n**1) Never ever use the response of \"because I have ADHD\" - ever...** especially when you struggle with something or failed to do something. I realise the deep motivation for wanting to say this is to solve the sense of loneliness from being misunderstood. It's also not nice to know that someone else has been impatient with you. I realise being misunderstood is an inevitable part of life. A part of being understood normally stems from knowing that the other person probably had similar experiences. Not everyone will ever understand you but thats okay, because you will probably not fully understand other peoples experiences.   \n\n\nThe moment I stopped using that phrase. My mind has shifted towards an outcome of figuring out \"how I can overcome X\" or \"how can I do X better\". This was a game changer for me. It moved me out of the victim mindset. The reason why I never want to excuse my behaviour, is because I do not want to be complacent with being able to develop myself personally so that I can be an asset to friends, family or colleagues. People will notice if you try hard. This has helped me both on the work and social side of life.  \n\n\n**2) It does not matter that you find it harder to achieve the same thing compared to others.** What matters is that I achieve the improvements in the areas that I value. I went through a phase of resenting the fact that I needed a life and business coach who specialises in coaching ADHD and ASD individuals, a psychiatrist and a therapist. I've invested so much money into these areas, and resented the fact that other people did not need to. After speaking to a friend about ideas from stoicism, I realised it is always better to make yourself more competent than to ask the world to give you less challenge. After discovering how I was able to manage some of these ADHD related difficulties I had, I inadvertently found myself being valued more as a friend to other people who had ADHD too.  \n\n\n3) Take ultimate personal responsibility. It is not your fault that you have ADHD, but it's your responsibility to manage your traits and behaviours.  \n\n\n4) Proactive gratitude and apologies when appropriate. It helps with interpersonal relationships. People don't have to be patient with you, but it helps if you show gratitude and apologise when needed.  \n\n\n5) Seek help. No one is born with a pre-installed manual to fix everything problem related to how we are. Don't allow yourself to be arrogant - seek help. Carol Dweck's fixed vs growth mindset helps plenty with this.   \n\n\n6) Small habits E.g. impulsive buying, shiny object syndrome, gaming etc. are more influential in life than the occasional ADHD influenced incident. Probably worth evaluating these vices. Probably worth checking out Atomic Habits by James Clear.  \n\n\n  \nThese are things I wish I would know thought of earlier, would be good to hear what other lessons or thoughts other ADHD peeps wish they learnt earlier...",
        "created_utc": 1678206590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions?",
        "author": "ThreeGoblinCats",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3v3n/suggestions/",
        "text": "One of the few ways I can consistently get school stuff (and homework in particular) done is if I am not supposed to be doing it at that time. \n\nFor example, during a boring lecture, my brain will cave and let me do homework I find agonizingly difficult to do at home because doing homework is doing something and it lets me tune out the boring lecture.\n\nThe drawback of doing this is that I am sometimes called upon to answer questions my brain tuned out because it wanted to focus on homework instead of the lecture. \n\nI know I should be paying attention, but I also need to get my homework done.\n\nHow do I recreate this at home so I can do my homework outside of class? Are there any lecture-style videos you can suggest that you find easy to tune out?",
        "created_utc": 1678206485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quit music for a few weeks to that become more enjoyable",
        "author": "Warm-Hour4132",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3tfn/quit_music_for_a_few_weeks_to_that_become_more/",
        "text": "About more that one or one and half years ago i bought my new earbuds and bc of this i started to listen to music every moment i can put them in my ears\nThat wa awsome, i was really became to the world of that music\nIn that time music maked my life completely to the diffrent level\nBut since a few month ago it's bacome more like a routine\nI can day im a addict to music, but i can't enjoy it like before\nI want that feeling, i mean, sometimes i feel that feeling is back but just in special mood or places, like very chill or sad nights or traveling\n\nI think maybe i can revice her with quit music for a few weeks\nIt's make my mind clear from that and maybe when i started again that makes me more dopamine\nDo anyone have any experience about this",
        "created_utc": 1678206376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you find it easier to pay attention to instructions when they are given in your second language and not your first language?",
        "author": "Low-Philosophy1072",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3ntb/do_you_find_it_easier_to_pay_attention_to/",
        "text": "[removed]",
        "created_utc": 1678206020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Odd? Side effect",
        "author": "GingerBeek",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3m42/odd_side_effect/",
        "text": "[removed]",
        "created_utc": 1678205915,
        "upvote_ratio": 1.0
    },
    {
        "title": "So how do I make professionals realize I need the diagnosis?",
        "author": "howbigtheace",
        "url": "https://www.reddit.com/r/ADHD/comments/11l3e7d/so_how_do_i_make_professionals_realize_i_need_the/",
        "text": "I've been diagnosed with depression for ten years now. Depression, Borderline, Dysthymia, all have been on my record so far. I'm pretty certain it's ADHD.\n\nNow, through a very lucky coincidence I got a therapist - we had our very first appointment today. I've learned from my last \"ADHD specialist\" psychiatrist experience (shut me down and never even tested me, led to another depression diagnosis) and didn't press much on this.\n\nThe therapist asked me why I dropped out of school. \"Because I was not challenged enough. Even new topics I was able to learn immediately, so going to school was six hours of sitting there, doing assignments and then going after another hobby, in the meanwhile learning exactly nothing.\"  \n\\- \"But why did you drop out?\"  \nThat repeated about three times, me insisting every time that I was not challenged enough and going to school made me lose sight of my long-term goal (as if that's a big motivator, amirite), and I dropped out.\n\n&amp;#x200B;\n\nSo yeah, in these ten years that I've been diagnosed with depression I couldn't do much, really. I had education programs, coachings, therapy - I dropped all of it at some point. Most of the time I got tired/ understimulated/ realized it doesn't help me in any shape or form.\n\nI mostly feel depressed *because* I don't have the diagnosis, which leads to me not getting the treatment I actually need. I'm aware that my history is anything but easy (trauma etc.), so I also consider C-PTSD a possibility, but I'm also aware of the usual other diagnoses that present similarly, if not the same, to ADHD. Not getting the treatment also means I can't move on, go to school and finish it and then go to university. So I've basically been frustrated for at least five years because I just want to move on. But my ADHD has stopped me when I tried.\n\nThe therapist kept reiterating that it's necessary for me to go back to school, basically saying that I need to \"tough it out\". I'm aware of that! And I tried. I really tried. I talked to the teachers, I was transparent about my issues. It didn't do shit. And I can't keep my long-term goal in mind to motivate me, as much as I wish I could.\n\n&amp;#x200B;\n\nSo yeah, how do I make professionals realize I should at least be considered for ADHD? That I'm not \"just depressed\", and that the diagnosis would help me in more ways than one. Without looking like I'm just drug-seeking. It's such a slippery slope, but I also want to advocate for myself and fight for this.\n\nOr maybe I'm going at this from a completely wrong angle, who knows. I know I can be *very* stubborn, and it's basically my way or the highway.\n\nFor now I just hope the therapist doesn't turn out to be complete shit. I don't need another therapist yelling at me haha",
        "created_utc": 1678205408,
        "upvote_ratio": 1.0
    },
    {
        "title": "advise- partner with adhd not doing his share",
        "author": "unwisesunshine",
        "url": "https://www.reddit.com/r/ADHD/comments/11l38dt/advise_partner_with_adhd_not_doing_his_share/",
        "text": "Looking for some advise/ insight so I can approach him in a empathetic and understanding way because I am tired of being upset and exhausted from having the same conversations and having to constantly hold him accountable for not doing his share of the house work, groceries and cooking. I have my own business to manage, I'm working part time, and trying to get a second one to afford a major expense to support my career and I feel like I cant rely on him to step up never mind do his share. \nWe've been living together for just over a year, weve both beenn living with our parents until now and his mom was leaving for a few months possibly semi permanent work position so we agreed to look after her house and the cat instead of finding our own place.\n\nprior to we had discussions about how I dont like having to manage people and hold them accountable to do housework, and he agreed that ikinda thing wasnt fair.\nHe works in a small company and his boss can trust him to be left on his own all day with a list of things to do so idk why it's so different when it's at home.\nThe last time we talked I made it extremely clear that things need to change, and suggested that perhaps he needs to see somebody to help him manage his adhd better;  -because idk how he would have manged on his own for that long- and he didnt seem very open to the idea because he had seen somebody when he was diagnosed as a kid. \nI really like him and we've been together a long time, but I don't know how to help himand I know I cant if hes not willing to work on himself. \nI know there isnt any one perfect 1 size fits all solution but any help is appreciated.",
        "created_utc": 1678205042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you notice people treating you differently once you tell them you have adhd?",
        "author": "mutatedpuzzle",
        "url": "https://www.reddit.com/r/ADHD/comments/11l37a7/do_you_notice_people_treating_you_differently/",
        "text": "[removed]",
        "created_utc": 1678204973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse sometimes works perfectly but when I’m more anxious it gives me brain fog and I feel jittery/heart racing. Anyone know how to resolve this? I’ve been taking for 2 years and it has been a life saver mostly!",
        "author": "GreenAwareness",
        "url": "https://www.reddit.com/r/ADHD/comments/11l337w/vyvanse_sometimes_works_perfectly_but_when_im/",
        "text": "I’ve been more anxious this past few weeks and Vyvanse has been hitting hard specially in the morning when I first take it. My habits have not changed in 2 years - the only thing that did change is my anxiety level as I’m going through a difficult few weeks. \n\nMy dose is also 30mg but post pregnancy it got upped because of the normal weight gain. I’ve lost most of the weight so can this be that I’m ready to go down to 30mg again? \n\nShould I just ride these few weeks off and see if with the anxiety improving this symptom will improve? \n\nIt definitely improves throughout the day and specially if I do exercise. Still would like to go back to it not having this affect.\n\nThank you for any and all advice!",
        "created_utc": 1678204734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking notes slowly - feel stupid",
        "author": "KookyFlamingo235",
        "url": "https://www.reddit.com/r/ADHD/comments/11l315p/taking_notes_slowly_feel_stupid/",
        "text": "I’m attending a conference with my boss. I’m supposed to take handwritten notes from the meetings that we attend. I feel so so stupid. My brain doesn’t work fast enough to be able to take any notes and I can’t follow what is going on in meetings. I don’t have any useable notes and I don’t know what I’m going to do. Why am\nI so stupid that I can’t do a simple task such as take notes? Is this ADHD or am I just stupid? It’s like my brain doesn’t work fast/well enough.",
        "created_utc": 1678204598,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you all find a place that feels safe and comfortable?",
        "author": "Complete-Hedgehog481",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2y0i/how_do_you_all_find_a_place_that_feels_safe_and/",
        "text": "[removed]",
        "created_utc": 1678204397,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate getting sleepy when I need to study",
        "author": "goroubestboy",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2xvs/i_hate_getting_sleepy_when_i_need_to_study/",
        "text": "[removed]",
        "created_utc": 1678204388,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I have a meeting coming up, what are some quick ways I can get my mind to focus for an hour?",
        "author": "pavpatel",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2wks/if_i_have_a_meeting_coming_up_what_are_some_quick/",
        "text": "[removed]",
        "created_utc": 1678204302,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD &amp; Autism - should I get reevaluated",
        "author": "Itstimefordancing",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2tut/adhd_autism_should_i_get_reevaluated/",
        "text": "I have had recent confirmation that I have ADHD, but during the two assessments I received, the psychiatrist was making me realise that many of the struggles I’ve had since childhood could have been autism as well as ADHD. \n\nI’m assuming that it would be another lengthy (and/or potentially costly) process to get evaluated, so I’m wondering if there would be any point? \n\nI feel like knowing I definitely have ADHD is worthwhile. I can access coping strategies and medication to help me in my day to day life. But knowing that I’m autistic, I don’t suppose will help me in the same way? \n\nCan anyone provide any advice?",
        "created_utc": 1678204132,
        "upvote_ratio": 1.0
    },
    {
        "title": "1st Visit [HELP I'M QUESTIONING EVERYTHING]",
        "author": "Rotten_Eyeballs",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2tba/1st_visit_help_im_questioning_everything/",
        "text": "Ok so the day finally came to talk to my primary doctor about my adhd suspicions I've had for months now even going back into last year and we had a 5 or 10 min conversation I couldn't get everything out correctly because I was nervous ya know? So all of my evidence poof *gone* honestly idk how to word it but he said that what I said sounds like general depression and...that just doesn't sit right with me everything I've gone through and built up all of the struggling, non focus, being unorganized, mood swinging, mind racing, forgetfulness, and everything else in between just felt like wow- well then what's wrong with me then!? WE DIDN'T EVEN TALK ABOUT ANYTHING I can't say it was surface level bc were still in the atmosphere OK OK all I'm asking is that should I take that to heart? Or should I start taking things to heart when I see the actual psychiatrist??... (gonna delete later I just need some advice bc this just isn't sitting right with me and I'm kinda freaking out 😅)",
        "created_utc": 1678204096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medicine is great and all, but I think the potential benefits AI will bring to neurodivergent individuals will be life-changing. I'm already dependent on timers and schedules to stay on track, imagine if those tools were automatic and proactive customized to your weaknesses. [Discussion]",
        "author": "Brilliant_Agent_1427",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2sny/medicine_is_great_and_all_but_i_think_the/",
        "text": "[removed]",
        "created_utc": 1678204053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily task app/ organiser",
        "author": "nancyboi96",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2qs6/daily_task_app_organiser/",
        "text": "I am looking after my partner who has just had surgery, so will need to be more on it than usual. However as I will need to be able to keep more tasks in my head than usual, I am looking for something which will remind me to do daily things like wash dishes, bins etc. Have tried to use things like reminders etc but they generally are pretty crap and also things like whiteboards on fridge aren’t the best either. Looking for something ideally that would be on my phone and be an eye catching whole screen alarm or maybe have multiple signs around the house haha.",
        "created_utc": 1678203932,
        "upvote_ratio": 1.0
    },
    {
        "title": "reminder app for Android",
        "author": "danielmerwinslayer",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2q2x/reminder_app_for_android/",
        "text": "[removed]",
        "created_utc": 1678203891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone notice that when you eat kind of bad for you food like Chick-fil-A you end up spiraling or being overly emotional?",
        "author": "PopularOpOnionEyes",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2n29/does_anyone_notice_that_when_you_eat_kind_of_bad/",
        "text": "[removed]",
        "created_utc": 1678203692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling useless….",
        "author": "NostolgicBarbie13",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2jkh/feeling_useless/",
        "text": "What do you guys do when you can’t be medicated? \n\nI mean I’m pregnant too so there is that but I hate that the world we live in requires us to work like dogs with barely any reward. We barely make ends meet so me not working is not an option. But when I get home after 8 hours of work I don’t want to do anything. I have no energy. I have terrible executive dysfunction and now I’m pregnant (planned and ecstatic) but I hate that I have the tv on for my son the entire time after I get home and my husband is still at work for 4.5 hours. He’s got toys to play with but today I sat on my chair while I heard him pulling out marshmallow mateys and scattering them on the floor to get to the marshmallows and I let him do that for 20 minutes when he decided to be done. \n\nBut I don’t play with my son because when I do I get heart burn/acid burps and/or nausea to the point of running to the bathroom and puking or I get SUPER out of breath… I know pregnancy is hard on the body but I just have so much mom guilt that I don’t really spend time with my son. I barely have the motivation even make him food sometimes but I do it because he has to eat too…. But I want to just lay down the rest of the day after. \n\nI wish I could be a stay at home mom. I hate missing out on being with my son. I wish I could stay at home but we for sure couldn’t afford that… we would end up homeless. We barely make it by with both of us having one job…. But I hate that I have to drain myself completely at work only to come home and not want to do anything. \n\nMy days off I feel great! I’m playful and the tv is only on before nap time and around dinner time. But then on work days I go back to being a shell. I hate it. And I’m bringing another god damn child into the world. What if I still have a hard time with being present after? Everything is just so overwhelming with being a mom and doing chores (husband does his part, it’s me that’s slacking lately) and it’s getting to the point where I hate myself for it but it feels like my body or my brain won’t let me do anything.",
        "created_utc": 1678203473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dr thinks I might not really have ADHD because I didn't respond a certain way to ritalin",
        "author": "Classicgotmegiddy",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2iwh/dr_thinks_i_might_not_really_have_adhd_because_i/",
        "text": "[removed]",
        "created_utc": 1678203428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychiatrist ignores me",
        "author": "Sleipnir_Art_Forge",
        "url": "https://www.reddit.com/r/ADHD/comments/11l2945/psychiatrist_ignores_me/",
        "text": "I wrote a few days ago about my doctors quote, but now it escalated xD.\n\nI sent a message to  my psychiatrist 5 days ago that I need new recipe for my meds, cuz I had meds only for a 5 days. Today is hers official work hours and still she didn't even answered my message(usually she would answer me within a day at max).Now I have no meds, I am in the middle of university course and have tasks at work.I'm literally about to have a breakdown... 😣\n\nIs there a way to feel at least a bit of motivation, cuz I have absolutely non?",
        "created_utc": 1678202818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse/Elvanse Saving Card - UK?",
        "author": "Mxre-1535",
        "url": "https://www.reddit.com/r/ADHD/comments/11l28kn/vyvanseelvanse_saving_card_uk/",
        "text": "[removed]",
        "created_utc": 1678202784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with ADHD who found their dreams. How did you do it?",
        "author": "Easly_Distracted",
        "url": "https://www.reddit.com/r/ADHD/comments/11l288d/anyone_with_adhd_who_found_their_dreams_how_did/",
        "text": "Anyone with ADHD who found their dreams. How did you do it? I have ADHD and I want to be a chemist but the school is just so hard. I like it and I find it interesting but the homework is very hard. Everyday my will is tested and I often wander if school is right for me. I know college is really hard for people with adhd. To anyone who was able to persevere how did you do it?",
        "created_utc": 1678202763,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no clue where to start, and quite frankly i am scared",
        "author": "angeyyyy",
        "url": "https://www.reddit.com/r/ADHD/comments/11l26lq/i_have_no_clue_where_to_start_and_quite_frankly_i/",
        "text": "I’ve been concerned for a while now that i have adhd but i’ve been putting off doing anything about it because i don’t know where to start and i almost feel ashamed/scared reaching out for help or even going in somewhere to talk about it. At this point though it’s effecting my life so bad that i have to do something because i can barely function but i don’t know what to do. Who do i call? Do i need a referral, can i just schedule an appointment with a psychiatrist? Are there special psychiatrists that i need to go to or are they all the same? Any advice is appreciated",
        "created_utc": 1678202660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Venting about Medication!",
        "author": "spookyloric",
        "url": "https://www.reddit.com/r/ADHD/comments/11l262o/venting_about_medication/",
        "text": "Hi guys,\n\n(I've never made a post before so I'm sorry if I don't format right.)\n\nBasically I've been on and off stimulants and anti depressants for about a year and half and I feel like no ones listening to me. I initially was put on a variety of non stims which gave me really increased heart rate and I thought I was dying and my psych was like okay what do you want me to do about that? \n\n&amp;#x200B;\n\nAfter bothering her for a few months she eventually put me on a combination of prozac and 20 mg vyvanse and refused to increase my dose after I said I don't think its doing anything and increased the amount of times a day I take it. I told her again its not doing anything and asked for an increased dose and she told me anything above 20 mg is an abnormal and excessive amount, but a simple google search told me the usual starting dose for adults is 30 mg????? \n\n&amp;#x200B;\n\nAfter that I felt weird and switched over to a nurse practitioner because she works in combination with my therapist and initially I thought it would be better because they'd have more insight. She put me on 40 mg of vyvanse which DOES work GREAT, but the symptoms are HELL. Even after months of taking it the nausea is so unbearable I can barely eat, and its usually difficult for me to sleep without something like melatonin which I can't take long term because it gives me nightmares. \n\n&amp;#x200B;\n\nSo basically I can function MOSTLY like a normal human except for the fact I can't eat or sleep which ends up taking its toll after about a week. And when I tell my nurse practitioner she tells me nausea should not be an effect of vyvanse and there's no reason for me to have it????? When I'm pretty sure that just isn't true??? Unless I'm wrong, but I have a history of doctors (particularly gynecologists) not listening to me so I usually end up doing a lot of my own research and even the medication itself comes with a pamphlet talking about its side effects, a big one of which is mentioned is NASEUA???? \n\n&amp;#x200B;\n\nAt this point I want to switch psychs again but at the same time I'm very much feeling like whats the point, all doctors are the same. It's so exhausting to me that I can either live life sleep deprived and starved but have my homework done and my room clean or just live the rest of my life rotting in bed.\n\n&amp;#x200B;\n\nMy nurse practitioner did switch me over to adderall for a few weeks, starting at 5m and slowly dosed up to 20 mg and it worked a LOT better than vyvanse in terms of allowing me to focus without all the side effects, but the issue with adderall is I usually take my medication around 5-6 am, and adderall puts me to sleep, so by noon I end up passing out. I started taking my medication later in the day, but I need it for my classes which start around 8-9am depending on the day and I always ended up passing out by 3pm latest. At least vyvanse lasted me the day .\n\n&amp;#x200B;\n\nI just want to scream and scream and scream, I feel like nobody believes me or is listening to me and I don't know if I want to just shut up and keep it pushing or look for new doctors that I know will once again just be like okay what do you want me to do about that? I get there might not be any perfect medication, and that side effects are inevitable but its beyond an inconvenience, I end up losing a ridiculous amount of weight and am constantly exhausted I can't function with it but I also can't function without medication. I literally cry on vyvanse it gets to a point where I'm gagging in class despite not having eaten in days. I get so so hungry but throw up anytime I think about eating I hate it so much I'm literally starving right now. I feel so stuck and I genuinely can't tell if I'm being dramatic or not because that's how everyones making me feel.\n\n&amp;#x200B;\n\nI literally just want to function like a normal human!!!!!!!!!!!! Just writing this out helped me a little, thanks to anyone who read all the way through. Any advice is welcome !",
        "created_utc": 1678202626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Randomized drug testing?",
        "author": "namastay919",
        "url": "https://www.reddit.com/r/ADHD/comments/11l25gq/randomized_drug_testing/",
        "text": "My husband went in today to a new doc (we moved across the country) to restart adderall. He has been struggling at work with testing and works in a environment that requires extreme attention to detail. After a year, he decided this was best.\n\nHe went in to get the prescription, was given a few paper tests and then told that in order to receive AND maintain his prescription he will be required to submit to ongoing randomized drug testing. For sleep he has used low dose THC for a few years, and his doctor said this would disqualify him from being able to get his prescription. He needs to quit and also abstain completely in order for the doctor to be willing to continue the prescription. He said “regulations would prevent me from allowing you to have adderall if at any point you test positive for any other substance”\n\nIs this normal practice? Does anyone else also have randomized ongoing drug testing?",
        "created_utc": 1678202585,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I'm struggling a lot in college",
        "author": "sonic0097",
        "url": "https://www.reddit.com/r/ADHD/comments/11l24qr/i_feel_like_im_struggling_a_lot_in_college/",
        "text": "I honestly feel like I'm struggling a lot in college right now. I am not able to read/pay attention to things for long periods of time, I seem to struggle with proper time management, and overall day-day I feel like a mess. I don't know if I need to start using a schedule or what, but something needs to change I guess. Does anyone here have any tips?",
        "created_utc": 1678202537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick vent about medication!!",
        "author": "spookyloric",
        "url": "https://www.reddit.com/r/ADHD/comments/11l23bk/quick_vent_about_medication/",
        "text": "[removed]",
        "created_utc": 1678202440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse life changing but side effect advice?",
        "author": "adhdred5555",
        "url": "https://www.reddit.com/r/ADHD/comments/11l22vq/vyvanse_life_changing_but_side_effect_advice/",
        "text": "Hi there,\n\n&amp;#x200B;\n\nI was recently diagnosed with ADHD and co-morbid moderate depression and limited anxiety. Work with my psychologist and psychiatrist and my own intuition do point to ADHD being behind some of this.\n\n&amp;#x200B;\n\nI have been on 30mg of vyvanse for a couple weeks with some days off and it has been life changing:\n\n* my focus and concentration is much better\n* my mind is much calmer and I can actually relax and chill\n* I enjoy conversations a lot more because I can be more present and engaged\n* I can read\n* I am sleeping better and getting up in the mornings rather than afternoons\n* I am getting myself to the gym and out and about\n* My emotions are so much better regulated.. I am feeling emotions I had not felt in a long time and can sit and feel negative emotions rather than seeing them play out in my behavior and thought\n* I can do the things I want to do\n\n&amp;#x200B;\n\nI know meds have their limitations and am using this newfound strength to go to therapy and work on routines so that they are not my only tool. I want to find a baseline with them and use them as a springboard.\n\nHOWEVER...\n\nI find that if I take them on an empty stomach, straight after eating something small or followed by a decent breakfast (I have not yet managed to eat something substantial first --- mornings have always been tough for me but I am getting there -- had hoped I could use the meds hour before wakeup/when I wakeup to help with this --- dont want to take them too late in the day and have them affect my sleep) I get nausea, diarrhea, some racing thoughts, an anxious feeling like my stomach is tight and compressed and a heart rate of 100-120 (vs 80-100 in the afternoon and 75 normal resting) about 1:30h after taking the pill to 3-4 hours and then it subsides quickly and I am left with the positive effects listed above. This is not totally unbearable but is a definite concern. \n\n&amp;#x200B;\n\nI don't crash any harder than I would expect just out of general tiredness from getting stuff done in the afternoon but equally I don't experience any sort of euphoria or really kind of energized feeling that would make me concerned the dose is too high but the side effects make me worry I should be taking less. I have been drinking loaddssss of water.\n\n&amp;#x200B;\n\nI will of course talk this over with my psych but wanted to hear how your experiences differed and if you had any pointers...\n\n* Might my body just still be getting used to it?\n* Does this indicate I should be on lower or higher dose? my psych said I could try 20 or 40 myself by mixing with water to save money\n* Is this all about needing breakfast first? How much sooner? Any tips?\n* Does this indicate I should try different meds? My psych felt vyvanse/elvanse would be best and after 1pm when the nausea and tightness is gone it is brilliant and I am told other meds may not help regulate my emotions in the same way and the long release is a positive for me",
        "created_utc": 1678202413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with ADHD who found their dreams. How did you do it?",
        "author": "Easly_Distracted",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1zqq/anyone_with_adhd_who_found_their_dreams_how_did/",
        "text": "[removed]",
        "created_utc": 1678202211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bionic Reader - the Patented tech soon to be locked behind a paywall.",
        "author": "thebarbican19",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1ymf/bionic_reader_the_patented_tech_soon_to_be_locked/",
        "text": "Yesterday, ‘Bionic Reading’ - the concept of bolding the first half of a word and greying out the last half, went viral across Reddit at Twitter alike. And rightly so, because with people like us who struggle with reading or focus while reading this can be a complete game changer.\n\nI stopped what I was doing as soon as I saw the post on Reddit and went to install the iOS app on my phone and the chrome extension - a Classic ADHD distraction right there. But to my disappointment, the iOS was completely non-functional and the browser extension worked some of the time.  \n\nSo in the spirit of getting massively distracted from my actual work, I figured I would look into it and see if I could quickly engineer a simple reader that could open an article from any page and format it in this style. My developer's brain lit up at the idea. \n\nBut to get an understanding of how it worked, which, unless I'm missing something is to simply divide the word length by 2, and round that number (up). Then apply bolding to the first half. Easy! Yet, what I found was a bunch of parents and aggressive legal disclaimers locking the tech down so they and they alone can develop it, and we know what comes next - lock it behind a paywall for those that can afford it. \n\nThis technique is not open source like it should be, like it needs to be. It's a private entity disguised as a forward-thinking think-tank simply motivated by profiteering on this tech that should be rightly and freely available to all. \n\nWhat you all saw go viral yesterday was an incredibly useful way to digest readable content for those of us who can't. But it was also an advert for a company that's gonna kill this simple tech by locking it down. Such a shame.\n\nFYI - because I'm a 'criminal' and I did go ahead and develop my reader. It uses the very basic math for myself and does not use the 'complex patented algorithm' Bionic Reader uses, thus it does not violate any patent... maybe. Here it is if you're curious. \n\n[Video Demo](https://twitter.com/mistermeenr/status/1633029630230683650?s=46&amp;t=6SVC-_qcWeyk6pEdDg8WKw)",
        "created_utc": 1678202134,
        "upvote_ratio": 1.0
    },
    {
        "title": "the magic 5 minute window after taking adderrall",
        "author": "ArkhamResident",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1prq/the_magic_5_minute_window_after_taking_adderrall/",
        "text": "I have seen it discussed but not really sure what to sure for about that magic 5 minute window where you feel amazing and focused after taking Adderall. it seems to be erratic and some times it doesn't happen at all. I really love it though and I was wondering if someone could explain it and if its possible to make it last longer? \n\nI don't know if that's how you're supposed to feel on Adderall the entire time. I'm not saying I don't focus with Adderall but my mood varies greatly and whenever I get that 5 minute window I just don't want it to end.",
        "created_utc": 1678201533,
        "upvote_ratio": 1.0
    },
    {
        "title": "can childhood environments affect how adhd presents itself in adulthood?",
        "author": "mellow_admirer",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1n9x/can_childhood_environments_affect_how_adhd/",
        "text": "I wonder if certain factors such as cultural, environmental, situational, etc affect how adhd looks when a child with adhd (especially undiagnosed) grows up.\n\nAn example that struck this thought process is what adhd would look like to a child that may have grown up in a strict and disciplinary family. They may have been raised with a good routine, good life skills and on the face of it look high functioning but internally have all of the adhd symptoms that end up presenting themselves much more severely once in adulthood?\n\nDoes anyone have any experiences or insights/studies?",
        "created_utc": 1678201364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychiatrist ignoring me",
        "author": "Sleipnir_Art_Forge",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1j6s/psychiatrist_ignoring_me/",
        "text": "[removed]",
        "created_utc": 1678201116,
        "upvote_ratio": 0.99
    },
    {
        "title": "Ordering medication into the UK",
        "author": "ilovestyrofoam",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1guq/ordering_medication_into_the_uk/",
        "text": "[removed]",
        "created_utc": 1678200952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heat &amp; meds",
        "author": "DumpsterJuice2023",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1es0/heat_meds/",
        "text": "Morning all, quick question on how to deal with something? My wife keeps turning the heat on as soon as we wake up which is when I take my meds &amp; vitamins which make me really hot for the first couple of hours. Every time I try to work with her saying we should put on the air but at an agreeable temp, she always gets angry and rants about how she is cold but won’t put on socks, shirt, or a cardigan to add a little bit of warmth. She does this when it’s blasting ass hot out too in the summer.. especially in the early afternoons, which especially kills me when taking the stim meds. I try voicing my concerns bc of how that interacts when I take my meds but she just always shrugs her shoulders &amp; says “maybe you should just quit taking the meds if they have that side effect” pretty infuriating bc when I tried the herbal supplement approach before going to a doctor and this same thing would happen, she would do this same thing and respond the same way. It’s feeling like she wants me to suffer and not get help bc when I used to just try to live with it before seeking help, we would fight all the time bc of how my symptoms would show their nasty selves. Now that I’ve started actually taking meds from a doctor and getting help, it has helped me with not engaging when she gets in her moods &amp; starts picking fights like we used to when I was unmedicated. I used to get into moods and do the same before finally doing herbal supplements &amp; now medication from a doctor as well as therapy *Disclaimer: I’m sorry for the long post, I’m really hot &amp; the ceiling fan does not work in my office, causing my meds to go into overdrive as I drip sweat everywhere &amp; ramble",
        "created_utc": 1678200810,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD or narcissism?",
        "author": "Traditional-Ad-6922",
        "url": "https://www.reddit.com/r/ADHD/comments/11l18df/adhd_or_narcissism/",
        "text": "[removed]",
        "created_utc": 1678200368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall shortage getting better for anyone?",
        "author": "lhurley0",
        "url": "https://www.reddit.com/r/ADHD/comments/11l1873/adderall_shortage_getting_better_for_anyone/",
        "text": "I live in a pretty populated area, where the shortage has been affecting for what seems like a year now. At first it was only impacting IRs, then it became XRs (my preferred) that were out of stock. It got to the point where I wasn’t able to find XRs anywhere, forcing me to take multiple days off a week just to get by. When IRs started to become a little more available again, my doctor switched me over to them….but I don’t love them (maybe it’s just the manufacturer?)\n\nI still have a script for XRs I haven’t been able to fill for months, though I’ll be honest I haven’t looked around for a while because I just don’t have hope and hate spending hours calling around/getting rejected at pharmacies. \n\nHas the availability of adderall gotten any better for anyone recently? I have my next appointment with my doctor this afternoon and am wondering if I should consider switching to an alternative like Vyvanse (recently learned my insurance covers it) if it is any more available.",
        "created_utc": 1678200358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lower dose with birth control?",
        "author": "InfiniteWhole",
        "url": "https://www.reddit.com/r/ADHD/comments/11l13tn/lower_dose_with_birth_control/",
        "text": "I'm on 40mg Vyvanse, with the option to take it twice a day instead of two pills in the morning if I want to. It's relevant to the story.\n\nA month back I've been on a mini pill releasing a low dose of progestin (desogestrel), which results in no ovulation and less of a fluctuation in hormone levels. On top of having a low fever for 3 weeks (may or may not be connected), I've also been stuck coloring for hours at the time, forgetting to go pee, not going to bed on time. It's been a fight against my brain, basically.\n\nThis could be a coincidence because at this particular day I wasn't at home and that can increase productivity levels. However, because I had to get up early I decided to break up my dose in two, 20mg in the morning and 20 during lunch. This morning is my most productive morning I've had in over a month. It was wonderful!\n\nBut all the research I've done is telling me that minipills make adhd symptoms worse. But could it be that with the addition of birth control, 40mg is just too much? I tried to talk to my doctor about this when I first decided to go on birth control, but he didn't seem to know much about the combination of the two.",
        "created_utc": 1678200055,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop picking fights?",
        "author": "brehaorbust",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0uka/how_to_stop_picking_fights/",
        "text": "I’ve realized a pattern. When I’m feeling particularly depressed or low, and my ability to function and regulate is worse, I start to fixate on things about my partner that I’m annoyed about until I convince myself I hate him and then pick a huge fight about something tiny which then blows into a days-long argument. And after the fight I feel way better, because I got attention and my brain has received the stimulation it wanted. Obviously this is horrible and scary and I don’t want to destroy my relationships doing it, but I can’t seem to help myself. What are some other ways to scratch that itch or to stop the negativity spirals in the first place? When I’m in the spiral, I’m so mad at him that regular positive attention does nothing for me and in fact just annoys me because I’m convinced I hate him. How do I get the same adrenaline/stimulation/attention/validation hit as a fight without needing to fight?",
        "created_utc": 1678199446,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and Music Processing Difficulties?",
        "author": "-cgriffy-",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0sll/adhd_and_music_processing_difficulties/",
        "text": "Hello! This is my first time posting in here, so forgive me if I’m not doing it right. Wanted to see if anyone else experiences this:\nI’ve been a singer all my life and I’ve noticed that when I get really stressed/overwhelmed, like in a sensory overload situation or high pressure solo moment, it feels like my brain shuts down its music center - I have a much harder time recalling a song, hitting the right notes, understanding rhythm, tone matching, etc. I can hear my mistakes, but my brain just can’t process how to get back on track until I’ve calmed down or am out of the spotlight (hence why I’ve mostly stuck to choir singing). A similar thing happens when I drink - any alcohol and it’s like I’ve gone tone deaf. Which I thought was normal until I started working concerts and noticed that live musicians will drink plenty onstage and off and still sound great and improv well.\n\nWill note that my brain has never quite clicked with music theory; I can read music but it feels like I’m solving a math problem. I’ve gotten by through learning by ear, pitch matching, and memorizing. I could never do a spontaneous performance like so many other musicians can. \n\nDoes anyone else experience any of this? For me the only thing that’s worked is to just practice a million times more than normal people would need to, and even then I still feel pretty limited in my abilities. Thanks for any input!",
        "created_utc": 1678199315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Synonyms for ADHD",
        "author": "CookiePersonal3684",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0sdv/synonyms_for_adhd/",
        "text": "[removed]",
        "created_utc": 1678199302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me hack my home life",
        "author": "MatsonW",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0s5v/help_me_hack_my_home_life/",
        "text": "I'm failing at adulting.\n\nAnd I feel a little bit ridiculous that at over 40 years old, with a high flying professional job, I just can't function at home.\n\nI'm always forgetting important things. Buying things. Leaving shit everywhere (I've been through three sets of ear buds in 6m as I just keep losing them! I don't even listen to music that often).\n\nI fear I'm being that shitty spouse that leaves all the mental load to her wife. And then most of the physical/home load too.\n\nNoone says thank you for emptying the dishwasher. I shouldn't need to be thanked. Who am I doing it for? I live here. I want the dishwasher to be emptied. Who do I expect to thank me?\n\nAnd yet .... I want to be thanked! I want praise. I want to be treated like a child. Because without it, I have no desire to do... Well.... anything!\n\nI don't want to be that person.\n\nBut I honestly don't know how/ what to change.\n\nAny tips?\n\nAre there ways to gamify existing?",
        "created_utc": 1678199287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctor making me jump through hoops to get meds - Canada",
        "author": "pancakesbaby",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0rup/doctor_making_me_jump_through_hoops_to_get_meds/",
        "text": "Hey everyone, I'm very new here but I'm at a complete loss and no longer know how to handle this. I figured I'd ask a community that has a lot more experience with ADHD and hopefully get some advice or tips on how to handle this correctly. \n\nI was very recently diagnosed AuDHD - done through a private route and it took over a year to get everything completed. I went in originally for an ASD diagnosis but was also diagnosed with Moderate Inattentive ADHD during the process - something I was not expecting. \n\nFor some background info - I'm located near Montreal, Quebec and have been followed by my GP for over 10 years now, she knows my medical history as well as my mental health issues. She's aware that I've been in weekly therapy for 2 years now. I was previously diagnosed with Major Depressive Disorder and General Anxiety Disorder, but now with the new diagnoses, I'm pretty sure those were just symptoms of my untreated and undiagnosed AuDHD. \n\nI was officially diagnosed on January 23rd 2023, and made an appointment with my doctor to discuss these diagnoses with her (done though private services, so it's not logged into my chart until she's made aware) and to discuss the possibility of trying ADHD meds to help manage my symptoms/traits. \n\nI had forwarded her the entire diagnostic evaluation document ahead of my appointment so this wasn't just sprung on her. When we finally met, she took the ASD diagnosis at face value but as soon as I mentioned the ADHD, she started pushing back - hard. She first started off saying I never mentioned these symptoms before and that why is it suddenly an issue (i literally didn't know i had this?) and when I pushed back on that, she spun it on my anxiety and said the meds could possibly make it much worse. I told her that's why I want to try something, we won't know unless we try. If my anxiety gets worse, I'm obviously not going to keep taking them.\n\nThen she started using my weight as an excuse. \"You're already too thin, I don't know if this is a good idea\" and started asking me questions that are obviously related to eating disorders. I know she's covering her ass with these, but she KNOWS I have a hard time keeping on weight - if she looked at my charts over the past years, I fluctuate between the same 15lbs and always have. Pretty sure she's flagged me as having an eating disorder now and has requested I see a nutritionist before anything else is done. \n\nAnd then, after all that, she had me RETAKE the ADHD tests I had already done to confirm my diagnosis (because somehow my ASD diagnosis is okay, but my ADHD one isn't despite being done by the same professional). She has me leave without meds and told me she'd speak to me again in 6 weeks. \n\nI recently changed to a much more demanding job and I'm struggling. I really was hoping to get something that might help, but I'm at a loss. Now I have to pay over 500$ out of pocket to speak to a nutritionist to prove that I don't have an eating disorder, get some blood tests done, again, out of pocket (this is fine, i just wish i didn't have to go private because she wants the results back quickly) AND she still doesn't want to give me anything. \n\nHas anyone else ever dealt with this? Are there other ways to do this? I'm tired and worn out and I honestly just want to start functioning (more) normally and every time it seems like it might happen, something like this happens again. \n\nSorry this is so long! I figured I give as much detail upfront.  \nTL:DR: Doctor didn't believe my ADHD diagnosis and is refusing to give me meds - thinks I have an eating disorder instead and is making me do all these extra things to MAYBE get a prescription.",
        "created_utc": 1678199263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it safe to take both a 20mg XR and a 15 mg IR at the same time? (Adderall)",
        "author": "Hey-StopIt",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0r4z/is_it_safe_to_take_both_a_20mg_xr_and_a_15_mg_ir/",
        "text": "[removed]",
        "created_utc": 1678199212,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Response to Any Medication?",
        "author": "archaeborxteryx",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0p4u/no_response_to_any_medication/",
        "text": "Hey guys, I'm wondering if any of you have experienced this?\n\nI'm on my third medication now and am having no reaction at all.\nI was first put on methylphenidate and had no positive change, the only thing that happened was extreme anxiety and a dry mouth\nAfter that I was given lisedexamphetamine which again made no noticeable difference\nnow I'm taking amoxetine and while my prescriber has told me it can take up to 12 weeks to take effect, I'm again not seeing any change at all (I've been using it for a little over a month)\n\nI feel really disappointed as people always talk about how life changing this stuff is. I've never had much of a response to stimulants in general (even coffee, I've always felt 'immune' to it) but since amoxetine isn't a stimulant I had higher hopes for it.\n\nI'm told this medication is the last option they're going to try. I don't know why I'm not responding to anything and I feel so defeated. apart from with methylphenidate I'm not even getting the negative side effects that people talk about lol, it feels like I'm not taking anything at all\n\nhas this happened to anyone else or is it even that common?",
        "created_utc": 1678199076,
        "upvote_ratio": 1.0
    },
    {
        "title": "sick of hearing \"everyone does that\"",
        "author": "nichesecond",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0jw4/sick_of_hearing_everyone_does_that/",
        "text": "I feel like when i describe a symptom i struggle with people often say \"oh but everyone does that\" like thank you but if everyone did that to the same extent as i did the world would crash and burn in utter chaos. Im sooo sick of people downplaying my struggles because they \"forget things every once in a while\" :l",
        "created_utc": 1678198708,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m not mad at myself",
        "author": "Necessary-Diamond615",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0hwe/im_not_mad_at_myself/",
        "text": "I had an exam scheduled for today at 9.30am. I’ve been preparing for this exam for over a month and I have been working very hard. Yesterday I was hit with a wave of tiredness, and decided that there is no more work I can do in 24hrs. It felt like I should be doing something, so i got a little anxious but then decided it’s fair to just relax now.\n\nMy exam was online, so I believed I had a window of two hours to login to start the paper. I woke up around 9am. I ate, relaxed, literally did everything until that window was nearly closed. Then I logged on and the paper was gone. Called exam support and they said it was only a 1hr window, and why was I so late?\n\nThis isn’t the first time.\n\nSince being diagnosed I’ve come to understand that there is likely a reason (though I don’t understand it fully) why I wait until a window is about to close before moving. \n\nI used to hate myself for this, condemn every past and future decision I’ve made/yet to make. Used to tell myself that I wasted so much time preparing, and I didn’t even make it- ‘what a waste of my time!’\n\nI’m even medicated. All though my menstrual cycle is making it a lot less effective. I could beat on myself about that- that there is no excuse since I’m on medication and this is due to a lack of urgency -but I’m not. \n\nI feel very calm. Not happy, sad, angry- just calm. I’ve even got plans to prepare for my next exam, like I didn’t just miss this one.\n\nI’m starting to wonder why I feel like I should be talking so negatively to myself- why is being calm after this SUPPOSED to be a bad thing? \n\nI think it might be because I overshare a bit, tell people every ‘failure’-I rarely tell my wins. I act very nonchalant when they condemn me to hell for it too. They aren’t villains btw they just think they are helping- but I think I’ve internalised that a bit too much.\n\nNot today. And I’m not gonna tell anyone- except Reddit because I can’t keep my mouth shut 🤣- but nobody is gonna make me feel like this is a big deal, like it’s the end of the world and I have no future. \n\nMaybe I’m slowly beginning to disassociate, maybe I’ll panic later but who cares!\n\nI’m calm now, I feel good-peaceful. \n\nCharge it to the game 🫡",
        "created_utc": 1678198572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bluetooth sleep mask",
        "author": "Joto7000",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0hbf/bluetooth_sleep_mask/",
        "text": "[removed]",
        "created_utc": 1678198530,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD M*sl*ms",
        "author": "Beginning-Stage-634",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0ey8/adhd_mslms/",
        "text": "[removed]",
        "created_utc": 1678198369,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Musl*ms",
        "author": "Beginning-Stage-634",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0e1m/adhd_muslms/",
        "text": "[removed]",
        "created_utc": 1678198306,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and religious concerns",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678198254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post for Muslim ADHDers and auDHD",
        "author": "Beginning-Stage-634",
        "url": "https://www.reddit.com/r/ADHD/comments/11l0cgy/post_for_muslim_adhders_and_audhd/",
        "text": "[removed]",
        "created_utc": 1678198199,
        "upvote_ratio": 1.0
    }
]