[
    {
        "title": "did stimulants help your anxiety?",
        "author": "skyecozmo",
        "url": "https://www.reddit.com/r/ADHD/comments/11okjo1/did_stimulants_help_your_anxiety/",
        "text": "I took vyvanse for a few months a while back and i feel like it basically eradicated my social anxiety. when im in social situations i get easily overwhelmed and overthink everything and the meds helped calm those thoughts a lot. just wondering if thats common. i want to bring it up with my psych n see if she’ll let me take them again",
        "created_utc": 1678542240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall ineffective since shortage/fake adderall article",
        "author": "Ok-Procedure-8227",
        "url": "https://www.reddit.com/r/ADHD/comments/11okctu/adderall_ineffective_since_shortagefake_adderall/",
        "text": "It is fucking crushing me. How can I take 30-40mg and legit go back to bed at 830am!?\nSome one fucking pls fix this issue.\nThis is just gotten to the point where it's so noticeable and like .. people are struggling so badly. SO sick of struggling thru every fill I get. Can't take much more. Dumb world\n\nAlso has anyone seen this article!? \nIf shots fake then what even is it? Every refill is worse and worse. \n\n'For many individuals with attention deficit hyperactivity disorder (ADHD), Adderall has been a lifesaver, helping them focus and manage their symptoms. However, for nearly half a year, many of these patients have been struggling to obtain their medication due to a nationwide shortage. What's more, some individuals have claimed that the Adderall they have been receiving is \"fake\" and no longer effective in treating their symptoms.'\n\nhttps://www.disbandable.com/article/fake-adderall-investigating-claims-of-ineffectiveness-amid-nationwide-shortage",
        "created_utc": 1678541710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short (!) survey on food choices, ADHD and self-control",
        "author": "ResearchOnADHD",
        "url": "https://www.reddit.com/r/ADHD/comments/11okajp/short_survey_on_food_choices_adhd_and_selfcontrol/",
        "text": "[removed]",
        "created_utc": 1678541533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research Opportunity: ADHD and the Menstrual Cycle (Uk Residents, 18-45, ADHD diagnosis, no ADHD medication, menstruating, any gender)",
        "author": "Fthump",
        "url": "https://www.reddit.com/r/ADHD/comments/11ok5ea/research_opportunity_adhd_and_the_menstrual_cycle/",
        "text": "[removed]",
        "created_utc": 1678541133,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate relying on meds but I can't stand to be who I used to be.",
        "author": "Warm-Sympathy-4089",
        "url": "https://www.reddit.com/r/ADHD/comments/11oj65s/i_hate_relying_on_meds_but_i_cant_stand_to_be_who/",
        "text": "[removed]",
        "created_utc": 1678538244,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Wellbutrin Script + Adderall",
        "author": "QualitySpirited9564",
        "url": "https://www.reddit.com/r/ADHD/comments/11oj5m0/new_wellbutrin_script_adderall/",
        "text": "I’ve been on adderall for a few years now. Life changing. But lately I’ve been unable to shake depression symptoms. I’m no stranger to the darkness of depression,  but I can usually tie the episodes to something situational, and it eases when the circumstances improve. \n\nRecently I’ve experienced the apathetic variety of depression, which is a new one for me. If there’s anything I do consistently and abundantly-it’s CARE. Not caring about literally anything has concerned me, so I brought it up to my doctor. He prescribed 150 mg Wellbutrin XL. My first dose will be in a few hours.\n\nMy main question is for those taking adderall &amp; have experience with Wellbutrin, how would you compare the stimulate effects-if you have/had them. Did they last?\n\nAlso looking for any experience/reports/tips/suggestions on ideally the combo but also just Wellbutrin in general.\n\nI’m currently affected by the adderall shortage, and wondering if Wellbutrin will make any difference with the symptoms alleviated by adderall during times I may run out. I have a lot of anxiety about going without due to being a full time student on scholarship (performance crucial for funding) and being a single mom. Hoping to be able to alleviate that with the added support.\n\nI realize everyone reacts differently and advice here is anecdotal, but welcome input.\n\nPlease include dosage/time used in any medication review. \n\nThanks!!",
        "created_utc": 1678538195,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stay stimulated while studying",
        "author": "aqev_m",
        "url": "https://www.reddit.com/r/ADHD/comments/11oivoh/how_to_stay_stimulated_while_studying/",
        "text": "I always find focusing while studying extremely hard even on meds, so I usually play music or watch a show in the background to keep me entertained. This is really distracting though and I find myself not remembering information well. \n\nI was wondering if there are other ways to stay on task without dying of boredom or distracting myself. Anything would be helpful!",
        "created_utc": 1678537362,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stay stimulated while studying",
        "author": "aqev_m",
        "url": "https://www.reddit.com/r/ADHD/comments/11oirkp/how_to_stay_stimulated_while_studying/",
        "text": "[removed]",
        "created_utc": 1678537014,
        "upvote_ratio": 1.0
    },
    {
        "title": "What medication is used when someone has both adhd and depression?",
        "author": "unalivement",
        "url": "https://www.reddit.com/r/ADHD/comments/11oiqgz/what_medication_is_used_when_someone_has_both/",
        "text": "[removed]",
        "created_utc": 1678536917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse Muscle Relaxation",
        "author": "corin_is_great",
        "url": "https://www.reddit.com/r/ADHD/comments/11oigew/vyvanse_muscle_relaxation/",
        "text": "[removed]",
        "created_utc": 1678536078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about medication",
        "author": "Sahmen_",
        "url": "https://www.reddit.com/r/ADHD/comments/11oid81/question_about_medication/",
        "text": "I started taking 10mg Ritalin LA one month ago and it helps so much with studying but also with social situations. It's insane how quiet the brain can be and how relaxed you can feel for a longer period of time. Anyway my question is if I can take Ritalin LA in the late afternoon (4 or 5pm) instead of taking it in the morning, because I want to go clubbing today and with Ritalin crowds are not as overwhelming. I should add that I dont have trouble sleeping since I took Ritalin. So is there any reason why I shouldnt take it so late in the afternoon except that it could interfer with my sleep? (Obviously I wont drink alcohol).",
        "created_utc": 1678535807,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have undiagnosed ADHD, any advices",
        "author": "Emi_2712",
        "url": "https://www.reddit.com/r/ADHD/comments/11oi08f/i_have_undiagnosed_adhd_any_advices/",
        "text": "Im 35F quite successful at my career but have been suspecting that i have adhd for a while now but never took it too seriously until recently where i started suffering from forgetting words, being extra annoyed at work, unable to focus. I did plenty of research and quite sure i have it and have a doctor appointment next week for a formal diagnosis.\n\nIts like being the biggest revelation of my life, like i walked down a timeline of my life, a lot of things makes sense now, tuning out, low music tolerance, my tendency to talk over others, my impulse reactions, constant feeling of under achievement, easily distracted, never actually putting enough hard work into anything, never being able to have a long term relationship with anyone, being always bored and disengaged with people.\n\nI will definitely wait for the formal diagnosis but i would like to ask the people out there what is your coping strategies? How do you manage it assuming a medication free life ?",
        "created_utc": 1678534617,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some things that are signs of ADHD that you only realised recently?",
        "author": "unikmari",
        "url": "https://www.reddit.com/r/ADHD/comments/11ohtxd/what_are_some_things_that_are_signs_of_adhd_that/",
        "text": "This is my first post here as I haven't actually been diagnosed yet (on a waiting list) but I was curious to know some symptoms that you didn't realise were a sign of ADHD?  I'm trying to learn more about parts of myself that may be linked to ADHD and it interests me hearing people with similar experiences or even different ones.\n\nI only recently acknowledged to myself that I have always had a lack of safety awareness like my brain will tell me \"this is dangerous\" but I ignore those warnings and do it anyway and then later realise how stupid that was. A random example would be when I was installing my fire alarm and I needed to use a chair and the closest one was this really old, frail looking chair that didn't look like it would hold my weight and I just used it anyway despite my brain being like \"Get off this, you could fall!!!!\" I know it's not like I'm out there bungee jumping or rock climbing but I still should be more careful yet I ignore my brains signals to keep me safe in many instances like the one above. Is this impulsivity?\n\n I also say yes to things when people are enthusiastic about something even when my brain is screaming \"say no, you do not want to go to this\" and I thought I was just a people pleaser but its like my mouth reacts before my brain. I then stress about how I can let them know I actually don't want to go despite agreeing earlier with masked enthusiasm.\n\nI'm curious to know some other symptoms that don't actually impede your life but do make things difficult nonetheless?",
        "created_utc": 1678534046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living with someone for support?",
        "author": "Obvious_Two_3901",
        "url": "https://www.reddit.com/r/ADHD/comments/11ohn5g/living_with_someone_for_support/",
        "text": "I’ve been living alone for around 2-3 years now and it’s been great. I’m able to manage myself okay. Unfortunately as time goes on, it gets harder and harder especially since I’m taking on several jobs. My partner and I have long talked about moving in together, but sometime in the future. I honestly want to move in soon (maybe within the next few months or next year) just so he could help me be more accountable and be my support/someone to depend on as honestly I’m very tired being one of those ‘never needs anyone’ type of people. I’ve always been like that my whole life, even living with family back at home. But I’m worried it’ll lead into some kind of codependency situation. Would it? Should I get a grip with myself first before ever actually living together? Or is it actually gonna be better for me to have someone’s support living together?",
        "created_utc": 1678533419,
        "upvote_ratio": 1.0
    },
    {
        "title": "I messed up at work and I am so embarrassed and I feel awful.",
        "author": "Ok_Ganache4842",
        "url": "https://www.reddit.com/r/ADHD/comments/11oh5jn/i_messed_up_at_work_and_i_am_so_embarrassed_and_i/",
        "text": "[removed]",
        "created_utc": 1678531697,
        "upvote_ratio": 1.0
    },
    {
        "title": "I messed up at work and I am so embarrassed and I feel awful.",
        "author": "Ok_Ganache4842",
        "url": "https://www.reddit.com/r/ADHD/comments/11ogvds/i_messed_up_at_work_and_i_am_so_embarrassed_and_i/",
        "text": "[removed]",
        "created_utc": 1678530653,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you study when your brain is foggy?",
        "author": "Tsukmiblue",
        "url": "https://www.reddit.com/r/ADHD/comments/11ogmgr/how_do_you_study_when_your_brain_is_foggy/",
        "text": "I have been studying for my exams since a few weeks ago, I have noticed somedays I do extremely well but somedays (the brain fog days) even if I somehow get myself motivated enough to start studying nothing actually goes inside my head. I do Anki as I am a medical student and it feels like I am just doing it as a part of a routine and its like muscle memory but for my brain, if that makes sense. This is even with taking meds and coffee. \n\nHow do you guys deal with this?",
        "created_utc": 1678529734,
        "upvote_ratio": 1.0
    },
    {
        "title": "adhd’s perfectionism or full blown ocpd?",
        "author": "polarbearsunnydays1",
        "url": "https://www.reddit.com/r/ADHD/comments/11ogkm0/adhds_perfectionism_or_full_blown_ocpd/",
        "text": "hi! i’ve noticed that severals of us on this subreddit chronically struggle with perfectionistic tendencies: how do you personally differentiate between maladaptive perfectionism and full blown ocpd? \n\ni have ocd, maladaptive daydreaming and adhd; both adhd and ocd trigger perfectionism in me and i can rarely finish my homework because of this…\n\nany suggestions on how to cope?",
        "created_utc": 1678529553,
        "upvote_ratio": 1.0
    },
    {
        "title": "adhd’s perfectionism or full blown ocpd?",
        "author": "polarbearsunnydays1",
        "url": "https://www.reddit.com/r/ADHD/comments/11oghs1/adhds_perfectionism_or_full_blown_ocpd/",
        "text": "[removed]",
        "created_utc": 1678529276,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's being a security guard like with ADHD?",
        "author": "Suspisciouspillhead",
        "url": "https://www.reddit.com/r/ADHD/comments/11ofxur/whats_being_a_security_guard_like_with_adhd/",
        "text": "I've been out of work for a while and to be honest, I never could picture myself working more than a few hours a week. But now that I'm medicated, my world seems so much bigger and I can picture myself going back to a job, just not in my old field. Security pays better and there are a lot of options in my city.\n\nDoes anyone here have experience? How do you cope?",
        "created_utc": 1678527323,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I'm a drug addict because I haven't been able to function as an adult without stimulants for the past 4 months. :(",
        "author": "AkwardlyAlive",
        "url": "https://www.reddit.com/r/ADHD/comments/11ofnrh/i_feel_like_im_a_drug_addict_because_i_havent/",
        "text": "[removed]",
        "created_utc": 1678526295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random thought (tolerance list in shows and media)",
        "author": "Escape2052",
        "url": "https://www.reddit.com/r/ADHD/comments/11of8mz/random_thought_tolerance_list_in_shows_and_media/",
        "text": "I am not sure where to post this but I do refer this sub reddits opinions.\n\nLong story short I think a friend is a little Squamish and I wanted to make a list so they can see where they stand.\n\nI would like anyone to edit it and for us to discuss and get it close to how these categories range in intensity. \n\nWithout further ado\n\nMy unofficial tolerance bar made from experience of media and life.\n\n1. Bad mouthing like, someone saying mean words\n2. Swearing\n3.Puking\n4.Small bruises like a black eye or swollen finger \n5. Small cuts or scratches, like paper cuts. Very little or no blood shown .\n6. Nose bleeds\n7. Bigger bruises, like someone mildly beat up or bullied\n8. Big injuries like people limping or not using a limb cause of injury(no blood)\n9. Limbs bending opposite directions or the wrong way.\n10. Big cuts like someone getting cut by a knife\n11. Stabs or people getting stabbed or shot\n12. Limbs cut off(blood may be clear or yhings can be censored)\n13. People cut up(gore-y)",
        "created_utc": 1678524775,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can finally put into words why work is so hard for me. It’s 8 consecutive hours. I can’t do that. I can do 8 hours but not in a row.",
        "author": "jhertz14",
        "url": "https://www.reddit.com/r/ADHD/comments/11oea9x/i_can_finally_put_into_words_why_work_is_so_hard/",
        "text": "That’s what made college more bearable. There’s classes. Then a break. Then study time. Then maybe another break. Then a class.\n\nYes, in college there is always a deadline looming over you. An assignment or project. But it’s more self paced. Work is just…nonstop. I’ve seen so many posts lately about the incompatibility of ADHD and full time work. And I have to agree with the sentiment of so many others. It’s…just not possible.",
        "created_utc": 1678521403,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've found no evidence that orange juice reduces the effectiveness of Vyvanse",
        "author": "RealDaveRubin",
        "url": "https://www.reddit.com/r/ADHD/comments/11oe87p/ive_found_no_evidence_that_orange_juice_reduces/",
        "text": "I've been avoiding citrus and vitamin c prior to taking my meds because of claim on the internet that it reduces the effectiveness of the drug. Today I tried to find studies confirming this, but found only the opposite.  \n\n\n&gt;similar values of *d*\\-amphetamine *C* max and AUC0–96h were  seen when oral LDX 70 mg was administered to healthy adults as capsules,  or capsule contents were dissolved in orange juice or mixed into  vanilla yogurt \\[[27](https://link.springer.com/article/10.1007/s40261-015-0354-y#ref-CR27)\\] \n\n[https://link.springer.com/article/10.1007/s40261-015-0354-y](https://link.springer.com/article/10.1007/s40261-015-0354-y)\n\nMany medical websites also recommend mixing Vyvanse with orange juice if you have a hard time swallowing the content.  \n\n\nI also found a study with a graph showing that breaking up the Vyvanse and mixing it with orange juice affected peak LDX plasma concentration, but not d-amphetamine (the active component of Vyvanse). I can't imagine it's worse when it's intact.  \n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5158093/figure/F1/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5158093/figure/F1/)",
        "created_utc": 1678521196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse Stopped Working",
        "author": "Naive_Conversation97",
        "url": "https://www.reddit.com/r/ADHD/comments/11oe05m/vyvanse_stopped_working/",
        "text": "I’m trying to figure out what’s going on but my vyvanse straight up isn’t working. \nI’ve been on dosages too high and low and this doesn’t feel like that. I’m not taking any vitamin c around the time I take my meds and it doesn’t feel like it’s too low of a dosage. Out of nowhere it’s just not working. \nI was in a very low place last year and I’m still recovering so for a while I chocked it up to depression/anxiety but I’m doing better now and it’s not working at all. Even at my lowest I could distinctly tell when it entered my system and now nothing. \nIm back to being hungry all the time and never feeling full and my inattentive adhd is present in full force. I just have no idea what’s going on. The biggest tool for my ADHD is suddenly useless. \nIm in college and school feels exactly how it did before I got diagnosed. I typically earn straight As and now it’s back to finding long classes unbearable and even attending classes is a struggle. Is anybody experiencing anything like this? \nAny and all help or advice that’s worked best for you would be so greatly appreciated.",
        "created_utc": 1678520389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would I be wasting the doctor's time?",
        "author": "TheLongRoadToRuin",
        "url": "https://www.reddit.com/r/ADHD/comments/11odxtz/would_i_be_wasting_the_doctors_time/",
        "text": "I've done some light reading around ADHD, but I figure I'd ask here to see if my experiences are in anyway consistent with other peoples, or whether I'm just being some sort of melodramatic hypochondriac. I'm not looking for any non-professional diagnosis or self-diagnosis, more a space to get feedback on whether I'd be wasting a drs time, and also a place to spill out my guts.\n\n&amp;#x200B;\n\nGrowing up I was quite a shy and quiet kid up until maybe the age of 13 where I did a complete u-turn and became quite (unintentionally) loud and extroverted. I've always had struggles with being organised, time-management and being tidy. I don't think I've had more than a day in my life where my room hasn't been strewn with objects, for whatever reason trying to do any tidying, or organisation of objects just doesn't happen. I can sit there for hours trying to gain the strength to do it, and if I do start I normally have almost a mental fog to continuing after a short period of time.\n\n&amp;#x200B;\n\nThis drawn out avoidance always manifested itself in school work. I was always a gifted kid, I could pick things up just like that, formulate good arguments, top set/ 8 in maths etc. I was largely a good student in school, rarely getting into trouble - except for homework. I never did homework, the same sort of mental fog procrastination would take over, and I'd feel absolutely shit about, but for whatever reason it was like there was a block to doing it. Same when it came to revision, I somehow managed good GCSEs with no revision whatsoever. When it came to A Levels I ended up skipping school quite a bit, and basically dropped out after the first year. I redid them a year later (after a year of nothing) and went to university to study History. I should have done a maths/science based subject, but knew I didn't have it in me to commit to the application of it. I struggled badly to meet deadlines, had a bunch of essays to submit at the end of the year from where I'd basically not done it the first time around. Every essay I did was done the night before, every exam I sat involved only reading my notes the night before, then heading to the exam with a can of red bull. I did my dissertation start to finish in three days, and somehow managed a 2.1 out of it.\n\n&amp;#x200B;\n\nAs much as I talk about the wild procrastination, I can also get insanely involved in things - largely tv shows and video games. I can also wildly get carried away with things, to my immense shame I've probably spent close to £10,000 on Fifa lootbox items over the years (no, I don't touch that game anymore). It almost feels like everything is all or nothing really. This includes drinking, when I start I literally can not stop, often blacking out fairly quickly. This causes me tremendous anxiety. For example I know I've had multiple drunken breakdowns (which largely resulted around my dad's death and where I'd repressed emotions). But I've also had wild anxiety rides from them where I always think of myself doing unforgivable things. Last Friday night I was pretty drunk in a pub with my friend. We've had an email at work where it's come out someone has leaked stuff, and I'm petrified I said something to my mate and people nearby overheard and I'm the source of it. (I have 0 evidence to suggest this is anywhere near accurate). I rarely drink, only with friends, but as I say, when I do I physically can't stop myself.\n\n&amp;#x200B;\n\nWorking life I interned at a solicitors and they told me if I did a law conversion I'd have a training contract there, but I knew that I didn't have it in me to dedicate my focus to the job. I worked in local government for several years, first year they were really happy with me despite what I felt like was nowhere near a good enough effort. Second year was where it really fell apart. I had a job with a private company working in local government and I was working from home for this. I had the same mental fog procrastination trying to do this. I'd have emails that I'd put off doing anything with. There was a whole part of my job I sort of forgot about? Which sounds absolutely stupid. It was a year of hell, so much so I almost killed myself over it. I did my best, but there was just a barrier there stopping me from doing what I could. I was so committed to it, and it was immensely frustrating to me it wasn't working out. Sometimes I'd do like a weeks worth of work in a day, othertimes I'd just do nothing. I quit after a year because I was so unhappy with how I was doing, and I felt like they deserved someone better. \n\n&amp;#x200B;\n\nMy next job was in QA for a technology company, and is still my current job. I've been promoted, but I feel like I'm not working anywhere near my capacity. Sometimes I'll just be sitting there for multiple hours trying to function. Othertimes I'll be insanely on it. But it's stressing me out the times I'm not on it, I feel like I'm falling back into the suicidal thought process I had with the local government job.\n\n&amp;#x200B;\n\nEducation wise I do have a masters degree from about 9 years ago. It was really similar to my undergraduate in terms of work - every assignment was the night before, never did the readings until I was doing an assignment. Allowed slightly more for my dissertation, two weeks this time. I've since tried to do an Economics conversion, this was because of my ability at maths as a kid, and trying to claw back what I feel like is massively unfulfilled potential. Unsurprisingly it fell apart, ended up deferring year 1 (this was an evening course, did it whilst working in local government), year 2 somehow passed with the same patterns of falling behind studying, and then having to do a Herculean effort at the end. Year 3 was the start of covid, which ended up with home exams. Same pattern, except the exam I flunked pretty much. Afterwards I was on the phone to a close friend asking why I was like this. I've now picked up a Physics degree via the Open University (again, chasing that unfulfilled potential), and, shockingly, my old ways are back. I hate being like this, I can literally procrastinate by wanting to just be in bed, or researching some entirely unrelated stuff. And it stresses me out doing it, but I can't bring myself to do anything productive until I feel the pressure. I used to tell people I work well under pressure. Truth is, I just work under pressure. I know I could be so much better, but yeah, I just have this block. \n\n&amp;#x200B;\n\nI'm also obese, it was actually a post on lose it about the correlation between obesity and ADHD that made me start asking serious questions. I can put in an all or nothing effort for several weeks to lose weight, before it invariably falls apart and I end up on a binge. I always tell myself tomorrow will be better, inevitably it often isn't. The sad thing is I'm putting so much effort into it, but it just doesn't work out. In general, I have all these plans to make my life better, but it just doesn't happen. I've been single for 11 years now, and I think body image problems are a massive chunk of this. I can form bonds well with people, and I know people have been into me within that time, I'm just really crap at picking up those sort of social hints. I'm also rubbish at reading body language, but really sharp at picking up different tonal expressions etc. \n\n&amp;#x200B;\n\nI'm also really good at losing things. For example, I've currently got three sets of air pods in my house somewhere, and I have no idea where. My bedroom and room I use for WFH are absolute tips. I find basic chores hard to follow through with and I can never form a habitual pattern. For example brushing my teeth - I often just don't get around to doing it much to my detriment, had a wild dental infection last year with four teeth being taken out. Washing I normally leave until a few hours before I'm going out, then chuck it on quick spin. I'm always late for things - I was once an hour late meeting a friend and I felt so so bad about that. \n\n&amp;#x200B;\n\nI'm 33 now, and feel like time is running out for me to fix myself. I've always put a lot of stuff down to me being lazy, but, it's a lot more than that. I genuinely have such a burning desire to do well, to upskill, to lose weight, to succeed at work, but it just doesn't happen.\n\n&amp;#x200B;\n\nTl:dr;\n\n\\- Not looking for any diagnosis etc, more a guidance on whether I'd be wasting my drs time approaching and if my experiences are in anyway consistent with ADHD sufferers. \n\n\\- Wildly procrastinate everything to my detriment, including having work and study fail because of it\n\n\\- Struggle with chores and menial tasks\n\n\\- Have massive ideas and plans to improve my life, which I never ever do well on following through with\n\n\\- Can get super into stuff, where all my attention goes on that for days in a row\n\n\\- Minimal self control, for example when drinking I don't have the control to stop myself when I'm feeling tipsy\n\n\\- Obese, much to my self loathing I often go on binges after being good\n\n\\- Terrible time management\n\n\\- Horrifically messy\n\n\\- Get on well with people and come across as socially competent, but often struggle to read some of the more subtle social clues, particularly around hints and body language",
        "created_utc": 1678520145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jornay stomach issues?",
        "author": "imissyou____",
        "url": "https://www.reddit.com/r/ADHD/comments/11odslv/jornay_stomach_issues/",
        "text": "Hi, i used to take 5mg Ritalin and it worked but I needed something long lasting that I could take at night. I got switched to 20mg of jornay. It’s made with the same stuff as Ritalin. I had stomach cramps that were the worst pains I think I’ve ever felt, extreme nausea that my zofran didn’t even touch, crazy loud sounds from my stomach, and diarrhea. (Tmi sorry). I don’t know what to do. Without this medication my depression is worse and im asleep 17+ hrs a day. Any tips for getting my stomach to stop doing this.",
        "created_utc": 1678519632,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s your hyperfixation food lately?",
        "author": "rittrat",
        "url": "https://www.reddit.com/r/ADHD/comments/11odpmb/whats_your_hyperfixation_food_lately/",
        "text": "[removed]",
        "created_utc": 1678519314,
        "upvote_ratio": 1.0
    },
    {
        "title": "I physically can’t finish a whole book",
        "author": "hhvcfty",
        "url": "https://www.reddit.com/r/ADHD/comments/11odhay/i_physically_cant_finish_a_whole_book/",
        "text": "I (25f) just recently realized I can count on one hand how many times I’ve finished a whole entire book in all my years. I usually get half way through and think “okay yeah I’ve got the gist of this”, set the book aside and never pick it up again, even if I was really enjoying it I just get to a point where I physically can’t stand to read it anymore. I have at least 15-20 books around my house that I’ve done this to. I’m not sure if this is my ADHD or if it’s just me not being a good reader, please tell me I’m not alone in this horrible habit",
        "created_utc": 1678518477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bit confused - traveling to UK &amp; bringing prescription meds",
        "author": "carminibus",
        "url": "https://www.reddit.com/r/ADHD/comments/11ocw1k/bit_confused_traveling_to_uk_bringing/",
        "text": "I am prescribed (generic) Adderall XR and am going to the UK for two weeks to visit family. \n\nFrom the website (https://www.gov.uk/travelling-controlled-drugs), I think I need to bring a letter signed by my doctor. But on the controlled drugs list linked to the site, it lists amphetamine but not dextroamphetamine (my prescription says amphet/dextr)\n\nI know Adderall XR isn’t prescribed in the UK, but is it still a schedule 2 drug or is it classified differently and/or do I need something else than the letter signed by my doctor?\n\nI also have a layover in Amsterdam (won’t be leaving airport while there) - if anyone knows - Will I be okay with the letter there too or if there’s something else I should look at?\n\nAlso, I am traveling from the US with US passport if relevant",
        "created_utc": 1678516384,
        "upvote_ratio": 1.0
    },
    {
        "title": "My kid with ADHD is doing something odd????",
        "author": "EmployCorp",
        "url": "https://www.reddit.com/r/ADHD/comments/11ocva0/my_kid_with_adhd_is_doing_something_odd/",
        "text": "It’s an odd habit. We all have ADHD in my household. I had my fair shares of funny habits as a kiddo. My daughter used to make a funny noise and couldn’t control it. For me, I got bullied in school for it so I found a way to control it or hide it. (I used to flicker my eyes or blink really hard repeatedly as a teen) Sadly the same thing with my kid, bullying stopped that noise she made pretty quickly. The problem is that she replaced it with a forced exhale. Like 5-10 times at a single time on short breathes. She can breathe fine, she has asthma and knows what it feels like to not be able to breathe. She’ll definitely tell me if she couldn’t breathe. This is more uncontrollable then the noises she made. The bullying has begun already with it at her current school. Kids mock her forced breathe and she gets pretty embarrassed. She is starting a new school here soon, we bought a house, and I fear that she’ll get bullied worse because she’s new. She’s 8 and has been on Adderall for 6 months now. Ritalin isn’t an option, it made her feel “carsick”. Her words, so I switched her to my meds since I respond well with it. The doctor agreed and we went with it. So far it’s been so well with the meds she stopped wetting the bed. She got student of the month shortly after starting medication. Her noises she made was before medication. Way before the noises, she used to flick her fingers together repeatedly. (I currently do that sometimes still, probably learning from me.) Could this be more then just ADHD? Autism and other mental disorders run in my side of the family. Has anyone experienced this and how did you stop it?",
        "created_utc": 1678516303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting super anxious after my Concerta wears off. Is this a thing? What can I do to calm down a little?",
        "author": "GlitteringAd9869",
        "url": "https://www.reddit.com/r/ADHD/comments/11oco4k/getting_super_anxious_after_my_concerta_wears_off/",
        "text": "I used to take Concerta 27mg XR up until a couple months ago when my psychiatrist left the practice and my prescription expired. I only got a new psychiatrist recently and because of the shortage I had to switch to Methylphenidate 20mg XR. I was fine and happy all day until the 11 hour mark when I got super anxious. I was having a conversation with my roommates and I wasn’t able to follow the conversation properly and I was overthinking everything I was saying. Like everything. I also smoked a little so that might change things, but I have never gotten this anxious before and I didn’t smoke any more than I normally do. Anyways, my anxiety got so bad that my mind was racing and I had a headache and I had to take some deep breaths to calm down. This has never happened to me while taking the 27mg Concerta and this is a lower dosage so I’m wondering whether it’s the combination of smoking + a come down or if this is just a normal side effect? Any suggestions for how to avoid this?",
        "created_utc": 1678515605,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD: Telehealth options (Texas)",
        "author": "Sum-Online-Rando",
        "url": "https://www.reddit.com/r/ADHD/comments/11oclah/adhd_telehealth_options_texas/",
        "text": "I was diagnosed and started taking Adderall 2 years ago. The ONLY reason I was able to do so was because of the newfound telehealth options—it offered a lifeline I desperately needed\n(I know there’s much conjecture about telehealth &amp; ADHD. I’ll withhold my opinions—that’s not what this post is about).\n\nThat telehealth service is THE company—the one that’s mentioned in every article about over-prescribing stimulants. \nDealing with them has been a bit of a roller coaster, but they’ve been easy to deal with more frequently than they’ve been a PITA. ….. until recently.\nThe last 4-6 months has been a nightmare. The diagnosis and meds—which were originally a source of relief and stability—are now a constant source of anxiety. Without going too much into detail, I’ll just say that I’m DONE with them.\n\nTelehealth is my only practical option. Please recommend a telehealth provider that’s easy to deal with, consistent, and can prescribe stimulants. \n\n*I’m in Texas",
        "created_utc": 1678515326,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't learn from a wall of text",
        "author": "DarthMaren",
        "url": "https://www.reddit.com/r/ADHD/comments/11ocfs8/i_cant_learn_from_a_wall_of_text/",
        "text": "Taking an online class right now, half of it is videos, while the other half is HUGE wall of texts that detail what and how we are supposed to do our assignments, and I'm just struggling so hard. The words blur together, I get sidetracked, I literally start thinking about other things, and realize I don't remember the last 10 sentences. I love online classes, I have anxiety, and depression and they help so much, but this one is just kicking me in the face so hard.",
        "created_utc": 1678514779,
        "upvote_ratio": 1.0
    },
    {
        "title": "University/college students, how do you do it?",
        "author": "alstcause",
        "url": "https://www.reddit.com/r/ADHD/comments/11occ4s/universitycollege_students_how_do_you_do_it/",
        "text": "I’m 21 and in my third year of university. I’ve been struggling with the workload since my first semester but I just figured it was my poor organizational skills and I just need to try harder. I got diagnosed with ADHD last August, and at first I was really relieved because I knew what was going on. I have an amazing accessibility advisor who got me some accommodations, but the things that the university is allowing me to do just aren’t helping.\n\nMy coursework piles up constantly, and it feels like no matter how hard I try, I can’t get a handle on things. I struggle with understanding the content and I can’t focus long enough to get through my lectures, ESPECIALLY online ones, even though I consistently take my meds (I’m on Concerta, and it helps in every other area except school). \n\nI’m kind of in the existential spiral of doom right now, and it’s exhausting to try and manage my daily life while going to school and working. I don’t want to blame everything on my ADHD, but since getting diagnosed I’m acutely aware of every way that my ADHD gets in the way, especially because school just isn’t set up for the ADHD brain. It’s even harder because I did really really well all through grade school and never really had to try so I have no idea where to even start when it comes to studying and managing everything school related.\n\nDoes anyone have any good study tips or ways to manage their course load? Anything helps at this point. \n\nTLDR: how do other university/college students deal with having to manage ADHD and post-secondary education?",
        "created_utc": 1678514442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dehydration from stimulants?",
        "author": "12_Ton_Brick_of_Weed",
        "url": "https://www.reddit.com/r/ADHD/comments/11oc7ij/dehydration_from_stimulants/",
        "text": "I was off Vyvanse for a month while I found a new doc, but I’m back on it day three and I just feel like I can’t get enough water. Yesterday I drank 3 quarts of water.\n\nToday I’ve drank a gallon and a half, and I still feel effects of dehydration. Cramps, the way my throat feels when I drink water, and my urine is pretty yellow still. \n\nI know this stuff dehydrates you but I’m not sure if this extent is normal. I had ramen noodles for lunch so I’d assume I have enough sodium.",
        "created_utc": 1678514004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about developing tolerance.",
        "author": "TTI_Gremlin",
        "url": "https://www.reddit.com/r/ADHD/comments/11oc6li/question_about_developing_tolerance/",
        "text": "[removed]",
        "created_utc": 1678513920,
        "upvote_ratio": 1.0
    },
    {
        "title": "5th year of college, still feels impossible",
        "author": "smokeytheboar6",
        "url": "https://www.reddit.com/r/ADHD/comments/11oc6hi/5th_year_of_college_still_feels_impossible/",
        "text": "So this is my first post here and it might be long but I’ve REALLY been struggling lately. I (22M) have been in college since I graduated high school. Diagnosed at 5 and I’ve been on meds basically my whole life. I’m smart but I have never had an easy time in college. Struggling with substance abuse and over partying my first year, getting sent home for the pandemic my second year, and then just barely getting by in the third and fourth year because of awful mental health. My poor grades and everything forced me to stay an extra year and I was so motivated to just get out once that happened. \nThen, my first semester of my 5th year - I fail 2 classes (they were both stupid elective fillers I never got interested in). This was bad because it put me on academic probation which meant I had 1 semester to do really well or I’d lose my scholarship. Still, I was on track to get out in May so I took my required classes and was doing great. I had a plan to get an internship in the summer after I walked at graduation because I need one to officially graduate. \nNow, in the “last semester” of my last year and I’m doing really well, I find out I had to have done my internship before graduation to be able to walk. So I take on an internship at my school for the marketing team, along with doing classes. \nThat’s where it went downhill. They said I had till May 1 (so about 10 weeks) to get my 200 hours in. I start putting in the time while trying to manage schoolwork as well. I start getting stressed because it’s really tough for me to do that especially with such an unstructured “internship”. A few weeks later and I’m just unable to focus on anything. I forgot to hand in a midterm worth 25% of my final grade, I’m behind on intern hours by like 30 hours, and I’m missing assignments because I just never did them. I scheduled out my whole day today and ended up staying in bed the whole day with no motivation to do my stuff. \nIf I can’t graduate in May then I have to switch colleges or drop out due to the loss of my scholarship after this semester.  \n\nIt seems so hopeless now and my family just keeps telling me to push through, “it’s only another 2 months”\nI’m just so stressed and upset. I lost all my drive from the beginning of the semester, and really just need some motivation or advice.",
        "created_utc": 1678513909,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your \"ADHD go hard\" moment today?",
        "author": "ihavecloroxwipes",
        "url": "https://www.reddit.com/r/ADHD/comments/11oc1zv/whats_your_adhd_go_hard_moment_today/",
        "text": "Here's mine.... and I'm still laughing about it just thinking back to it. \n\nCame into work this morning. Went (apparently) into my bag to fish out my work phone. Went to talk to a doctor I was assigned to for that day. Came back to my desk a few minutes later. Went into my bag again to find my work phone. Couldn't find my work phone. Thought I probably threw it on my bed instead of into my bag and so I left it at home because I did remember grabbing it before I left for work. Had to grab one of the spare/extra work phones we have in our clinic that's designated for floats/reliefs. \n\nTHREE hours into work, I opened one of my desk drawers, and... lo and behold... there was my work phone. Do I recall taking it out and putting it in my drawer? Nope.",
        "created_utc": 1678513486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I lose everything?",
        "author": "Beautiful_Device_866",
        "url": "https://www.reddit.com/r/ADHD/comments/11obofd/why_do_i_lose_everything/",
        "text": "This may not be an ADHD thing but I think it may be worsened by adhd but I loose everything (EVERYTHING!!!!!). Just now I couldn’t figure out where I left my wine glass and I thought “how do you loose a wine glass” (because you can’t exactly put it in a drawer when it has wine in it). Also the reason I’m drinking wine is because I couldn’t find my shot glass because yes I lost that too. I’ve lost my phone once today already which is good number because I was running errands so it was safely tucked in my purse for the majority of the day. I also lose my train of thought way too often… I’m a college student and consistently losing your train of thought when your speaking in class is a bit embarrassing. So if anyone get want to reminisce, share similar stories or even give me some much needed advice I would love to hear it Reddit!",
        "created_utc": 1678512204,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started treating my ADHD around this time last year. Since then for the first time In my life I feel like an adult.",
        "author": "Juicecalculator",
        "url": "https://www.reddit.com/r/ADHD/comments/11obmew/i_started_treating_my_adhd_around_this_time_last/",
        "text": "I always thought “oh you never actually feel like an adult everyone is just pretending” I finally feel like a normal adult or dad that I envisioned as a child.  I feel somewhat competent and knowledgeable about a variety of things, I manage several parts of my life well, I have good kids and a life I never felt like I deserved.  I finally feel like maybe I do deserve it.  I have worked hard for many years to get here.  I stayed up late so many nights studying, or working to try to climb that mountain.  First the first time I feel like I can look back at what I have accomplished and say I fucking climbed all this way to get this high.  You can never make it, but I finally acknowledge that I am making it",
        "created_utc": 1678512014,
        "upvote_ratio": 1.0
    },
    {
        "title": "general question",
        "author": "unidentified123_",
        "url": "https://www.reddit.com/r/ADHD/comments/11obkwu/general_question/",
        "text": "So i’m getting evaluated for ADHD and learning disabilities through my university. (evaluated by a PHD Student who is being overseen by a licensed psychiatrist) anyways my last session is on the 21st and on the 28th i’ll have my debrief of what comes back. I’m pretty certain i have ADHD and possibly dyslexia. \n\nIf diagnose i would like to start on medications. does anybody have a similar experience? Would i just be able to take my diagnosis/evaluation results to a psychiatrist to start treatment? \n\nThank you in advance for all your answers",
        "created_utc": 1678511881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Messing up at work",
        "author": "Major_Objective603",
        "url": "https://www.reddit.com/r/ADHD/comments/11obdbn/messing_up_at_work/",
        "text": "[removed]",
        "created_utc": 1678511186,
        "upvote_ratio": 1.0
    },
    {
        "title": "May regret this",
        "author": "26MausMel",
        "url": "https://www.reddit.com/r/ADHD/comments/11oba3a/may_regret_this/",
        "text": "Will probably regret asking strangers on the internet but here goes \nFirstly I am not diagnosed but I believe I have many traits. I have a question and I don't know if it's ADHD related..\n\nDoes anyone else have periods where you 'disconnect' from reality. Sometimes I feel like I'm in a movie. \nOther times, if I see a picture or video of another country I feel like I've been there and I have these *memories* that are JUST out of reach from actually remembering them \nIt's not all the time probably once or twice a fortnight. And varying *strengths* of feeling.\nOriginally I thought it was a coping mechanism and I would do it when at stressful times in my life, but recently it seems to be totally random.\nFor example if I go to a city and there's lots of advertisements and bright lights, I feel like I'm in a movie and the very fabric of reality is just a veil",
        "created_utc": 1678510896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to get something off your chest? Rant, vent, get it out here!",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob99y/need_to_get_something_off_your_chest_rant_vent/",
        "text": "Get those hard feelings off your chest here. Please remember that /r/adhd is for peer support. If you just want to shout into the void and don't want any feedback, please head to /r/screamintothevoid. You don't have to, but it would be really appreciated if you could share some encouraging words with the others commenting in this thread.\n\nWe are not equipped or qualified to assist in crisis situations. **If you or someone you know is experiencing a crisis, please contact a local crisis hotline or emergency services.** \n\n* [Wikipedia's List of Emergency Telephone Numbers](https://en.wikipedia.org/wiki/List_of_emergency_telephone_numbers)\n* [Wikipedia's List of Suicide Crisis Lines](https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines)",
        "created_utc": 1678510834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got something to say, but the bot tells you it's not long enough? Post it in this thread!",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob96j/got_something_to_say_but_the_bot_tells_you_its/",
        "text": "Please remember that all sub rules still apply here. This thread isn't for memes, jokes, or low-effort content.",
        "created_utc": 1678510827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you just begun treatment?",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob911/have_you_just_begun_treatment/",
        "text": "Talk about it here. Please remember that we don't allow asking for or giving medical advice.",
        "created_utc": 1678510816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you just get diagnosed?",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob90s/did_you_just_get_diagnosed/",
        "text": "Feel free to discuss your new diagnosis and what it means for you here!",
        "created_utc": 1678510816,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite executive function hack?",
        "author": "Ambitious-Ad-3688",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob7eq/what_is_your_favorite_executive_function_hack/",
        "text": "Mine is keeping a small garbage can in every room of my house, and having a large garbage can in my bedroom. I no longer leave trash around my house because there’s always a garbage can within 8-10 steps or so. \n\nI do struggle very much with other daily tasks, especially with doing laundry and keeping my room reasonably clean.\n\nCan we make this post a list of ADHD exec function success stories? I would love to hear what works for everyone else here.",
        "created_utc": 1678510670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little tricks to get started being productive?",
        "author": "Neanderthal888",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob4hy/little_tricks_to_get_started_being_productive/",
        "text": "I find that once I’m started, I can do productive things. Like cleaning, gym, life admin etc.\nBut getting started is incredibly difficult.\n\nThe only trick I can think of that helps me atm is just doing something small that’s productive oh my phone where I’m sitting/laying. Then it seems to be easier to get up and do things after I feel a little bit of accomplishment already.\n\nWhat other tricks do you find help you to get started?",
        "created_utc": 1678510396,
        "upvote_ratio": 1.0
    },
    {
        "title": "God my balls hurt",
        "author": "Nearlanderedits",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob273/god_my_balls_hurt/",
        "text": "[removed]",
        "created_utc": 1678510194,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am chronically ill and I feel that ADHD makes taking care of myself so much harder than it should be",
        "author": "donttreaderonme",
        "url": "https://www.reddit.com/r/ADHD/comments/11ob008/i_am_chronically_ill_and_i_feel_that_adhd_makes/",
        "text": "My health problems just keep piling up, and since most of them are caused by lifestyle choices I feel like there's a ton of judgement around this.....\n\nI'm not saying it's not my responsibility to do better and that I shouldn't TRY to do better. I feel that my ADHD and possible autism and struggles with executive dysfunction are explanations - but not an absolution of responsibility.\n\nBut I do wish that people would give grace and understand that ADHD is literally a mental disability. Even if not a severe one, this still impacts my ability to care for myself. Making good lifestyle choices is incredibly difficult for anyone, but especially for those of us who struggle with day-to-day functioning as it IS.",
        "created_utc": 1678509992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing pharmacies constantly.. will I be flagged?",
        "author": "stairwaker2109",
        "url": "https://www.reddit.com/r/ADHD/comments/11oawga/changing_pharmacies_constantly_will_i_be_flagged/",
        "text": "I know we’re all in the same boat with the shortage. Before every refill I call around to different pharmacies to see who has Adderall 20 mg in stock and then tell my doctor to send it there. I don’t want him to issue it to my regular one just for them to be out and then have to wait another day or 2 for him to reissue it to another one (not being able to transfer controlled on your own sucks!). \n\nAt this point I’ve used 4 or 5 different pharmacies since September-ish. Will I be flagged? Is there some kind of DEA watchlist? The scripts are never overlapping and I take as prescribed. I’m just trying to survive out here like the rest of us.",
        "created_utc": 1678509669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cost of Meds",
        "author": "j_rabbit_472",
        "url": "https://www.reddit.com/r/ADHD/comments/11oap82/cost_of_meds/",
        "text": "[removed]",
        "created_utc": 1678509029,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked a ChatGPT bot to write a poem about ADHD!",
        "author": "One_Cash_6493",
        "url": "https://www.reddit.com/r/ADHD/comments/11oajn6/i_asked_a_chatgpt_bot_to_write_a_poem_about_adhd/",
        "text": "ADHD, a mind so free,\nRacing thoughts and energy.\nAn endless stream of ideas flow,\nBut focus is hard to keep in tow.\n\nIn a world that moves so fast,\nADHD can be an asset, not a task.\nHyperactivity and impulsivity,\nCan lead to creativity and ingenuity.\n\nBut with its highs come the lows,\nDistraction and forgetfulness, woes.\nThe struggle to stay on track,\nA constant battle, not just a knack.\n\nSo we learn to adapt and cope,\nHarnessing our strengths and hope.\nFinding tools to stay on task,\nAnd never letting ourselves be asked.\n\nFor ADHD is just a part of us,\nA unique brain, without a fuss.\nWith all its quirks and eccentricities,\nWe're just a little bit more zestful than our identities.",
        "created_utc": 1678508534,
        "upvote_ratio": 1.0
    },
    {
        "title": "extreme excitement makes me mentally/emotionally drained in the end?",
        "author": "Wisteriapetshops",
        "url": "https://www.reddit.com/r/ADHD/comments/11oac6m/extreme_excitement_makes_me_mentallyemotionally/",
        "text": "Okay. long story short I got obsessed with this kids book series I never even liked in elementary to the point it literally makes me bounce off the walls. \n\nIt’s very rare for me to have this much passion in something, and whenever I do, It’d only be a matter of time until I get severely mentally drained. in fact, it took me awhile to push myself to write this because of that. is this an Adhd-centric problem or? cause’ I’ve seen a similar question asked 3 months ago but never answered. My guess is that some of our brains get and use energy very quickly with enough dopamine, and the result of speedy usage results in feeling drained.",
        "created_utc": 1678507852,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop being jealous of my cousin?",
        "author": "ShineHistorical1930",
        "url": "https://www.reddit.com/r/ADHD/comments/11oaas0/how_to_stop_being_jealous_of_my_cousin/",
        "text": "[removed]",
        "created_utc": 1678507735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions on how to control your ADHD",
        "author": "Difficult-Avocado752",
        "url": "https://www.reddit.com/r/ADHD/comments/11oaa0f/suggestions_on_how_to_control_your_adhd/",
        "text": "[removed]",
        "created_utc": 1678507666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got my work review today.",
        "author": "yairina",
        "url": "https://www.reddit.com/r/ADHD/comments/11oa1kw/got_my_work_review_today/",
        "text": "Honestly it was pretty funny because my boss made many points that she made just scream adhd, mainly that i over explain myself to make sure I'm covering my bases and have a tendency to focus too deeply on one thing and ignore other things.\n\nMy manager is pretty understanding (doesn't know my diagnosis) but I had a good laugh telling her it was a fair assessment.\n\nStill got a raise 😎",
        "created_utc": 1678506921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental Health is so difficult for those who need help...",
        "author": "Bendilin",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9yyv/mental_health_is_so_difficult_for_those_who_need/",
        "text": "[removed]",
        "created_utc": 1678506697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Public school",
        "author": "UnwantedElephant2300",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9ud9/public_school/",
        "text": "[removed]",
        "created_utc": 1678506308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone here outgrown ADHD ?",
        "author": "EveCane",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9qef/has_anyone_here_outgrown_adhd/",
        "text": "[removed]",
        "created_utc": 1678505960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for other peoples thoughts, please response would help!!",
        "author": "Spirited-Food-7470",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9qbz/looking_for_other_peoples_thoughts_please/",
        "text": " \n\nI was diagnosed with ADHD later in life at the age of 20. When I was a young kid I got caught up in drugs and any substance I could find to abuse, I battled this for a very long time. I went back to get my high school diploma at the age of 19, during that time I was given Ritalin. It has been a great help in my life, although I am my spouse to take them everyday and I don’t like taking them on my days off. Is this a safe thing to be doing?? Thanks for your help and love!",
        "created_utc": 1678505954,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and other life stuff",
        "author": "absurdironies",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9n7n/adhd_and_other_life_stuff/",
        "text": "My wife (and I) started a podcast. It's mostly hers, but I got to have an open discussion about my life and living with ADHD. I'm pretty proud of us. https://spotify.link/UCHZhpRk4xb\nIt's also available on other platforms. It's been a journey to get to the point where I accepted my diagnosis, learned about it, instead of fully committing to coping mechanisms. And am actively watching God show me who I really am.",
        "created_utc": 1678505685,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Couple Game - Winner or Loser?",
        "author": "Flimsy-Feedback8656",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9lx9/adhd_couple_game_winner_or_loser/",
        "text": "I struggle with being motivated and doing daily tasks regularly. This makes me feel guilty because I’m not pulling the same weight as my husband with house chores. This happens more often during the evenings after coming home from work. He has never complained and has always been unbelievably patient with me.\n\n\nThis may sound silly, especially for couples in their early 30’s, but we will do “rock, paper, scissors” to determine who is going to conduct the unwanted house chore. It’s been pretty fun and has made me more motivated. I highly encourage doing this for individuals with similar struggles. \n\n\nI decided to try a new method by purchasing a coin off of Etsy with his name on one side and mine on the other. I felt this would be fun and similar to our other method. I had the mindset, during the purchase, that whatever name the coin landed on would essentially be the loser. I purchased this without mentioning the idea to him. My husband compares this “coin toss” to heads or tails and said this would make them the winner and the other person would be the one conducting the chore. Since we cannot agree, I decided to make a post to receive other people’s mindsets on this determination. \n\n\nAdditionally, has anyone found different methods that encourage you to be more  motivated?",
        "created_utc": 1678505574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are psychometric test usual for an adhd assessment and what are they?",
        "author": "Flat_Cod_747",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9izl/are_psychometric_test_usual_for_an_adhd/",
        "text": "A doctor referred me to a psychologist for an assessment (I’m showing signs of adhd, autism, anxiety, etc.)\n\nI spent 10 sessions with them, talking and I filled plenty of forms/tests.\n\nNow I’m being told that the next step is a psychometric test. I’ve never heard of this word before and when I searched it up google only returned what is essentially personally test sold by private companies for HR people to use as some sort of trendy/sketchy hiring process fad.\n\nDid anyone of you had to do a psychometric test as part of your diagnostic process? Can you tell me more about what they are, how the testing goes and if there’s any scientific worth to them? Like, what do you learn from that sort of test?\n\nI’ve just been doubting that I’ve been referred to someone who is right for me as they doesn’t seems to really understand my struggles or my reality.\n\nThanks for any information you can give me, this is highly appreciated! 🙏",
        "created_utc": 1678505317,
        "upvote_ratio": 1.0
    },
    {
        "title": "lisdexamphetamine + weeing",
        "author": "caicAi-9",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9hl1/lisdexamphetamine_weeing/",
        "text": "[removed]",
        "created_utc": 1678505190,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with emotional numbness?",
        "author": "Think_Leadership_411",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9hjq/how_do_you_deal_with_emotional_numbness/",
        "text": "[removed]",
        "created_utc": 1678505186,
        "upvote_ratio": 1.0
    },
    {
        "title": "mind awake, body shutting down",
        "author": "leedsdaggers",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9fj1/mind_awake_body_shutting_down/",
        "text": "\nPrescribed 30 mg XR Adderall for about 2 years. Started at 15 mg IR.\n\nMy body feels like its shutting down, but my mind is wide awake. it feels like this 24/7. I drink caffeine and it hardly helps.\n\nI can also hardly focus on my schoolwork for longer than an hour a day. But with simple tasks, I can do it for hours. I literally hyperfixate on stupid shit on my phone, but cant get myself to do any work. \n\nHalf of it is because im literally in pure pain everytime in out of bed. I am completely exhausted.\n\nIm so tired. Idk if it has to do with having a bad generic (probably), but the shortage is making it impossible to find a normal prescription.\n\nWhat life style changes can I make? Is my dose too high? What do i do",
        "created_utc": 1678505005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with high stress life",
        "author": "Few_Ad_5103",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9cog/struggling_with_high_stress_life/",
        "text": "So I'm not new to reddit, but I've never posted before. I'm already scared I'm gonna sound attention seeking and pretentious. I'm 23M, with a management role in retail in the UK. Been recently diagnosed through a private consultation (wasn't cheap at all 🤮🤮) I'm really struggling with alcohol at the moment, it's become a terrible habit to get drunk most nights and have a drink or 2 before shifts just to calm myself down a bit. I have an amazing girlfriend and a loving family but I've kept this habit hidden from them because I feel they're never going to understand it and just see me as a junkie mess. This might not be the right subreddit to post this in but I just need to really cast the net out to the other people who can't ever turn that voice in their head off in the hopes someone understands. Any help would be greatly appreciated,  love to all x",
        "created_utc": 1678504762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Depression + Adhd + Anxiety",
        "author": "Avacado-panda",
        "url": "https://www.reddit.com/r/ADHD/comments/11o99yw/depression_adhd_anxiety/",
        "text": "I need to hear your experience with managing life and/or medications if you have any of these combined conditions. Thanks in advance for your time. \nSo back in the day when I was a kid I got diagnose by a child psychiatrist in my school (1st grade) for having adhd (I was referred to school psychiatrist by my teacher for either being in lala land/not paying attention or blurping answers/talking non-stop.) Next year (second grade) I got diagnosed with anxiety by a regular general physician as I complained having “stomachaches” right before going to school every day during weekdays. \nMy mom decided to not even try any medications as she thought those conditions were not real and constantly nagged me every single day for being messy.\nLater, in my mid 20s I got severe depression. I’m 28 now and I feel like I have 0 motivation to do anything!!! Like regular everyday things feel like a day of work for me! Like showering is a hugeeee task. I didn’t brush my hair for so long it got so tangled I had to cut it!!! I feel a lot better now but I’m still struggling! \nI am on max dose of adderal but I feel like it does nothing!!! I still lack motivation if that makes sense! Since I started adhd medication later in my life (it was after I got depressed) Idk if adderal is just not doing it for me!\nI told my psychiatrist if she heard of combination therapy to combine stimulants with non-stimulants she flipped out saying if I want that many medications I should change doctors! She didn’t even ask why I brought it up or what I meant. Unfortunately, she’s the only available doc in my area that accepts my insurance. \n\nSo at this point I can:\n\n1) just be ok with out of pocket cost of a new doc (around 700-800 dollars/visit in my area)\n\nOr\n\n2) first have the psychiatrist just prescribe a non-stimulate first (like wellbutin) while getting off of addrral to see if it actually helps, then switch docs for combination therapy.\n\nIdk!!! what are your thoughts? I feel like the psychiatrist is such an ass for not even listening to me! Funny thing is I told her I have depression and she said everyone with adhd has it and once I take adderal long term I’ll be good!!!! But I know adderal effects should not take months to see!! \nShe also made bunch of abelist and racist comments bunch of times that I went wth in my head! \n\nI have anxiety as well! \n\nHow do you manage these 3 conditions together? Any experience with life and/or medication management?",
        "created_utc": 1678504530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mind is wide awake, body is shutting down",
        "author": "leedsdaggers",
        "url": "https://www.reddit.com/r/ADHD/comments/11o92lf/mind_is_wide_awake_body_is_shutting_down/",
        "text": "[removed]",
        "created_utc": 1678503911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just realised I probably have adhd",
        "author": "its_beddy",
        "url": "https://www.reddit.com/r/ADHD/comments/11o9003/just_realised_i_probably_have_adhd/",
        "text": "Hey guys i recently discovered that I might have adhd, and the deeper i go into it the more i am convinced. Before this i did know I am a bit weird but i thought I was a sociopath even though i didnt check all the criteria. Now that i know about adhd though, I understand I misunderstood being a sociopath becoz of object permanence and was a adhd person instead all the time. anyways, as i just got to know this, anything you think that might be useful .",
        "created_utc": 1678503691,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and other life stuff",
        "author": "absurdironies",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8y2f/adhd_and_other_life_stuff/",
        "text": "[removed]",
        "created_utc": 1678503552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking career advice",
        "author": "Otherwise-Peak-8336",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8t24/seeking_career_advice/",
        "text": "I'm an engineer in early of my career. I'm trying to decide wether or not if switching to a smaller company from large corporations would be beneficial or not. \n\nI feel like I am being ignored by others and not getting enough support when comes to the fundamentals with no clear direction. It's been driving me crazy.\n\nPlease advise",
        "created_utc": 1678503121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Insurance Companies Not Authorizing Adderall XR?",
        "author": "Healthy_Owl7758",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8mwe/are_insurance_companies_not_authorizing_adderall/",
        "text": "When I went to pick up my Adderall XR the pharmacy told me my Adderall XR wouldn't be covered without my doctor calling my insurance company to authorize the prescription.\n\nI contacted my Psych and he wrote back: \"Insurance companies are not authorizing Adderall XR these days unless you’ve tried many other medications. You may need to go back to the regular Adderall.\"\n\nIs this true?\n\nCVS will sell my the XR for $72 with a pharmacy discount.",
        "created_utc": 1678502604,
        "upvote_ratio": 1.0
    },
    {
        "title": "omfg I am sick of picking skin but I can't stop",
        "author": "_ficklelilpickle",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8fwm/omfg_i_am_sick_of_picking_skin_but_i_cant_stop/",
        "text": "I don't really know the underlying cause but I have always picked at my skin. Mostly around the edges of my thumbs, index fingers and inside edges of some of my other fingers. But I also find that if I find any other little imperfections I will fixate on them as well. I have a dry left elbow at the moment, I guess because I lean on it more at my desk - yep I pick at that dry skin too. My two big toes got roughed up after walking on concrete for an extended period without shoes or thongs - both of those are quite sore at the moment from my constant picking at the edge of those. \n\nI trim it all back, but as soon as it starts to get a little bit better I just find myself doing it again.\n\nIt's at the point where I am today forcing myself to wear shoes inside the house just so I leave my fkn toes alone.\n\nAnyone got any tips? I used to chew my fingernails and pick my toenails though I managed to stop both of those habits - I wish I knew what I did though. This just feels beyond me.",
        "created_utc": 1678502007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some support from my online family",
        "author": "MeanWorldliness749",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8fwt/need_some_support_from_my_online_family/",
        "text": "Was diagnosed about 8 months ago, and no one was surprised! I started Vyvanse which was such a game changer for me. I had never felt “normal” before. But it started to give me really terrible intrusive (and suicidal) thoughts. So I had to stop until I can see my psychiatrist again. I’m currently trying to pack, paint, plaster, find a renter, and a new place to live…among so many other things…and my executive function has been overwhelming. I’m trying to fight as hard as I can, but don’t think anyone else understands, and I’m just trying my best to keep my head above water. I’m living in a province where I have no family or friend support…I’m hoping my community here can offer some words of encouragement and support. Maybe even some helpful tips. Thanks in advance ADHD fam💕",
        "created_utc": 1678502007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally medicated again after two months!",
        "author": "MurderfaceMudzz",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8fg0/finally_medicated_again_after_two_months/",
        "text": "[removed]",
        "created_utc": 1678501969,
        "upvote_ratio": 1.0
    },
    {
        "title": "i lost my ring.",
        "author": "khjking",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8azz/i_lost_my_ring/",
        "text": "while i was eating i realized i had lost the ring i wear on my thumb, and i am just so incredibly frustrated. i was supposed to follow my routine: as soon as i get home i take my rings off in order to not lose them, but today i didn't do that. the ring isn't a special design or anything, but i bought in it lima (where my dad is currently living) so i held it close to me. i know it's gonna seem stupid to some but now i feel incredibly down and disappointed in myself for losing such a dear thing to me.",
        "created_utc": 1678501603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone else taking strattera and dexamphetamine together?",
        "author": "stairwaytokvn",
        "url": "https://www.reddit.com/r/ADHD/comments/11o8a7t/is_anyone_else_taking_strattera_and/",
        "text": "[removed]",
        "created_utc": 1678501532,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I try to get into colleges?",
        "author": "nah_69_420",
        "url": "https://www.reddit.com/r/ADHD/comments/11o89gc/how_do_i_try_to_get_into_colleges/",
        "text": "Hi all, I'm 16M and almost finished with my Junior year in High school, and I'm feeling pretty fucked up by my situation.  I go to a pretty high-up high school in my country and have averaged around a 3.0 GPA without diagnosis since my freshman year.  I only recently was able to finally get diagnosed, and I started meds around the beginning of February and haven't been on a stable/good plan until maybe 3 weeks ago.  That said, I know my GPA is gonna look pretty rocky this semester, and I genuinely have no idea how to try to get into good colleges from here.  All of elementary/middle school I was a \"gifted kid\" and now I'm looking at a likely failing grade in history and a number of other mediocre to poor grades in some/most other classes.  And while I'm figuring everything out (more or less completely on my own right now, with the benefit of meds) I strongly doubt that I'll be able to magically turn my GPA into the magic number that will get me into the colleges of my dreams.  I feel like that's probably already been robbed from me.  So that said, what do I do?  I know I'm not destined for Harvard (and to be blunt I wouldn't want to go to a school like that anyways) but a lot of the school's I'm actively interested/excited over have acceptance rates around the 20s and I don't know if I can manage that.\n\nAlso how do you guys manage to study for the SATs.  I know that getting a good score (especially one around 1400-1500, which I know I'm smart enough to get) would make my application look a hell of a lot better, but how do I force myself to study? What strategies and schedules and stuff do you guys use in order to manage this?  I strongly appreciate any and all responses.",
        "created_utc": 1678501473,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some help, ASAP",
        "author": "shallowpleb",
        "url": "https://www.reddit.com/r/ADHD/comments/11o88v7/i_need_some_help_asap/",
        "text": "I’m a 17 YO 6’3” male who CONSTANTLY bounces my leg. I know for a fact it’s adhd, because I only do it when I’m trying to focus. My family, specifically my sister, has recently started slapping my legs to get me to stop. I have talked to them, and they are saying that it’s distracting them from anything and everything. I want to compromise, but I can’t stop no matter how hard I try. They can’t ignore it, I’m too heavy now and my legs have started to shake the “entire floor” at this point. What can I do to stop this?",
        "created_utc": 1678501426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently diagnosed, very recently on meds.",
        "author": "OhhMyGoshJosh",
        "url": "https://www.reddit.com/r/ADHD/comments/11o885s/recently_diagnosed_very_recently_on_meds/",
        "text": "Hi everyone!!\n\n\nSo I got diagnosed around 2 years ago at 30 years old. Those of us diagnosed at a later stage know the relief and anger and every other emotion after finding out their diagnosis. We can't dwell on the what if this happened sooner. Life might be better, life might have gotten worse somehow, there's no way of knowing. Anyway, back to the point.\n\nOn Monday I finally got in to see my psychiatrist and we went straight to meds. I'm on \"dexies\" not sure what your countries call them, but that's the Aussie slang for it. Now I know everyone's dosage is different and whatnot but I was told to take daily when needed. I don't exactly know what that means. When we discussed it it was for study purposes because I've recently started uni, for the first time and have never studied never known and always struggled to attempt it (now we know why). But I work full time and can only study in the arvo/weekends. So obviously this shit keeps you up at night. Since Monday it's been 11:30 earliest sleep, and tbh that's not really stressing me too much. Kind of just realised that I'm just word vomiting at the moment and cbf erasing it all because my question has nothing to do with the sleep part of meds.\n\nWhat I DO want to ask is, the people who take dexies, do you still struggle to focus? Or is my focus just on another thing? I just can't seem to get into my studies today.\n\nP.s. Sorry for middle paragraph, guess I wanted to talk to people who understand that part of it.",
        "created_utc": 1678501367,
        "upvote_ratio": 1.0
    },
    {
        "title": "i don’t know if my meds are helping",
        "author": "chance188",
        "url": "https://www.reddit.com/r/ADHD/comments/11o860r/i_dont_know_if_my_meds_are_helping/",
        "text": "hello, everybody. i am kinda conflicted because i don’t know if my medication is helping me pay attention. when i think i am paying attention at work and following my steps to a task i get told by others “your not paying attention.” this hurts me so much because i am paying attention! i’m paying attention to my task at hand! this is like telling a homeless guy to just buy a house! what is worse in my opinion is how i am positive i am doing something right and it’s wrong they say”we do this everyday or all day!” GOD it’s so frustrating to me. i am on vyanse 50 mg. do you guys have any ideas on what i should do medication wise? lastly sorry for going a little into detail i have to meet a character limit",
        "created_utc": 1678501199,
        "upvote_ratio": 0.99
    },
    {
        "title": "My therapist seems to keep going back to anxiety, depression or childhood trauma - I feel like I’m not making progress",
        "author": "Exotic-Start-5039",
        "url": "https://www.reddit.com/r/ADHD/comments/11o84ii/my_therapist_seems_to_keep_going_back_to_anxiety/",
        "text": "I found out about adhd about two years ago, officially diagnosed about 18 months ago. Been in therapy for about that time. I tried a few different medications and found none helped so I gave up.\n\nMy therapist is a nice guy but sometimes I struggle to keep up when he’s explaining things. It’s like he’s talking like a competent adult and I feel like a child struggling to keep my attention on what he’s saying, digesting it and responding. \n\nI’ve noticed that I can ask a question, he’ll explain and I ask another and he’s able to bring the conversation back to the original question. I sometimes have to ask him to repeat a question ten seconds after he asked it.\n\nI don’t deny that I struggle with depression and anxiety and have some childhood trauma but I don’t feel like talk therapy is working for me.",
        "created_utc": 1678501071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Didn't Include My Roommate--She's Sad, I'm Kinda Exhausted (Both w/ ADHD)",
        "author": "thisisme12341",
        "url": "https://www.reddit.com/r/ADHD/comments/11o802m/didnt_include_my_roommateshes_sad_im_kinda/",
        "text": "[removed]",
        "created_utc": 1678500708,
        "upvote_ratio": 1.0
    },
    {
        "title": "XR feels really inconsistent",
        "author": "schindewolforch",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7yuw/xr_feels_really_inconsistent/",
        "text": "Day 3 of XR after switching from IR. \n\n20MG once a day from 7.5MG twice a day. \n\nI made sure to get all 8 hours of sleep, eat my fruit and vegetables and exercised too. \n\nSo far, every day for the past 3 days the XR has kicked in at really weird times!!!\n\nI felt tired, apathetic, and otherwise gloomy all day. Procrastinated a lot, but thankfully still got the essentials done. \n\nThen suddenly at 4PM it felt like the XR released all at once and I got hit with a crazy sensation of \"focus\" which sucked because I had already finished my work by then. \n\nNow at 6 it's kind of waning but I still feel that wired feeling a little unnecessarily.",
        "created_utc": 1678500615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experimented with 30mg Ritalin and I feel more relaxed than ever. ADHD?",
        "author": "mcmelonhead",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7yd8/experimented_with_30mg_ritalin_and_i_feel_more/",
        "text": "3 of my kids have been diagnosed with ADHD. I've had life long anxiety and am on a daily routine of anti-anxiety meds. \n\nTook 30mg of my kids Ritalin today to see what it does. It feels like the first time I had valium. I just feel relaxed. Ordinarily on a Saturday I struggle without the routine of work. \n\nI am pretty tired still though, I was hoping the Ritalin would give me pep. Feel like I need a nap (which is normal for me to be tired). \n\nAdvice? Getting a diagnosis as an adult where I live is hard which is why I'm asking here. I will talk to my doctor as well",
        "created_utc": 1678500580,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when words become fuzzy?",
        "author": "nah_69_420",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7y9l/what_do_you_do_when_words_become_fuzzy/",
        "text": "[removed]",
        "created_utc": 1678500571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have Vyvanse success story? Especially if you’re also dx with anxiety.",
        "author": "peyton_montana",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7xgt/anyone_have_vyvanse_success_story_especially_if/",
        "text": "[removed]",
        "created_utc": 1678500502,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fiancé has ADHD and it’s effecting our relationship. I am considering leaving him.",
        "author": "n_kryeziu",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7tfg/my_fiancé_has_adhd_and_its_effecting_our/",
        "text": "We have been together for 4 years and recently got engaged. In those 4 years we broke up 3 times. His false promises is what leads to our break ups. It starts off with small promises that make me lose trust in him. Than it turns into big ones like moving out and bailing last minute. He lied to me and tells me he’s saving money and fixing his credit to only find out the day that we are supposed to meet with a Relator that he has nothing. Of course I do the honorable thing and leave.\n\nThis only last for a month. He all of sudden can do everything and says he learned his lesson and will do better. \n\nBesides his false promises we get along and I do love him.\n\nHe had a lot of red flags that would have me not interested in the first place. He is a 38 year old male who lived with his mom and failed out of college. \n\nLast year we finally went to couples therapy. During that time he magically was able to move out and keep his promises. We did so well we ended up finally living together. We stopped going to therapy for financial reasons. A few months later we even got engaged.\n\nDuring therapy she told me he might have “Peter pan syndrome “ a few months later he was diagnosed with adhd by another provider.\n\nAdhd made sense to us. He’s a procrastinator, bad with money and has time blindness. \n\nNow, a year after therapy he is back to his old behaviors that lead to our break ups. He had his car towed for non payment. I have to remind him about his bills EVERY month. We both had Covid when he purposed and had to cancel dinner reservations. He promised he would make it up to me and propose the right way. It’s been three months and nothing yet. Two months ago was my birthday and I have yet to receive the gift that he promised me. This man works two jobs and some how NEVER has money.\n\nI have tried helping him with his finances but he gets upset. I have even suggested couples therapy again. He turns that down. I recommend he go get help for his adhd finds ever excuse to not get help.\n\nI usually would leave by this point but we live together now. I also go to school full time and can’t afford rent alone. We haven’t slept in the same bed in over 3 months. \n\nApart of me loves him and can’t give up on the work we have done. But another part of me is so sick of this. I’m always frustrated and don’t want to play mommy anymore. It’s really turning me off and it’s becoming hard to desire him sexually. HELP!",
        "created_utc": 1678500182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't find a doctor willing to treat my ADHD, I'm desperate and not sure what to do at this point.",
        "author": "Princess_Coldheart",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7qhd/cant_find_a_doctor_willing_to_treat_my_adhd_im/",
        "text": "[removed]",
        "created_utc": 1678499971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Better way to take medication…?",
        "author": "JackfruitShot",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7ok2/better_way_to_take_medication/",
        "text": "Unfortunately I stopped taking my meds because of insurance and the price was too high. But I kept a little stash for emergencies. \nI used to take 20 mg of aderall and I didn’t like the come down so I took 5 mg in the evening. Since I wanted the stash of 5mg to last, I started mixing in a water bottle and sip on it through the day. It helps me “take the edge off” and the comedown is almost non existent. It also ensures that I’m hydrated.",
        "created_utc": 1678499808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctor surrendered his license",
        "author": "Immediate-Bug3079",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7mzc/doctor_surrendered_his_license/",
        "text": "So my doctor surrendered his license to the DEA.  I was on vyvanse 70 mg in the morning and adderall 20 mg booster in the afternoon.  Got cut off cold Turkey, pharmacy refused my refills.  Have been to 2 different doctors and so far have only been offered Qellbree 200 mg.   Need help or advice from someone who’s been through this.  Struggling to keep my job, I work in a very high energy, high volume restaurant as a server and I’m struggling to get out of bed, my family doesn’t understand.  Any suggestions, I don’t even have to have a booster nor do I demand adderall.  The vyvanse worked just as well for me.  I’m 2 days in on qellbree as I refused to fill it for several weeks waiting to see a couple different doctors.  I am a recovering addict and this medication has saved my life and I need my medication.  Idk what do to",
        "created_utc": 1678499685,
        "upvote_ratio": 1.0
    },
    {
        "title": "I left my fucking meds behind and I have so much to do",
        "author": "RefrigeratorFair6212",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7mql/i_left_my_fucking_meds_behind_and_i_have_so_much/",
        "text": "I haven’t ever been able to function without my god damn meds, and now I’m stuck with a fuck ton of college work that’s due on Sunday and a personal essay for college transfer and I left my fucking Adderall in another state. I can’t get it until Sunday afternoon, but I can’t take it because I’ll never sleep. I’m just so fucked and I’m panicking and idk what to do. \n\nI just feel like I’m screwed. I don’t feel functional at all. Idk. I just need to talk about it and I don’t have anyone who’s going to understand it. I’m fucked. I’m so fucked. Im just god damn stressed. \n\nIdk. How do you guys make it work when you don’t have your meds, cause I haven’t had to for a long time, and I don’t know what to do.",
        "created_utc": 1678499668,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get evaluated and can I choose which medication I'd like to try?",
        "author": "Jolly-Trick-9861",
        "url": "https://www.reddit.com/r/ADHD/comments/11o7m0t/how_to_get_evaluated_and_can_i_choose_which/",
        "text": "This is a long one. My apologies in advance and thank you if you actually keep reading.\n\nI HIGHLY suspect I have inattentive adhd and probably a little autistic too. I've always felt so out of place and uncomfortable for as long as I can remember.  As a kid I'd immerse myself in playing by myself and books, to the point of not hearing a family member trying to get my attention. I had horrible, debilitating anxiety as a kid. I couldn't go to school or even just to the store without completely panicking and NEEDING to go home. I was diagnosed with anxiety and depression in middle school and put on Paxil. I couldn't regulate my emotions for shit. Lots of fights with my family, lots of broken doors and walls. I was a rage filled kid bc I just wanted to be normal but I didn't even know what normal was.\n\nAdult me isn't much different I just know how to fake my way (barely) through life. I've been in therapy for years, I like my therapist but she insists this is all trauma/ptsd. I don't 100% disagree but I think the root to my anxiety, depression and actions that lead me into trauma inducing situations might be adhd. I've asked her for an evaluation, got one and was diagnosed adhd and ocd during a phone appointment with a psychiatrist during lockdown. She prescribed me a blood pressure med with off label use to treat adhd. I wasn't happy about that and told her so. She refused to prescribe stimulants. I never even tried the BP meds bc the side effects sounded horrible. Never followed up with that dr.\n\nI'm struggling now. I have ZERO motivation to do anything anymore. I want to things like function at a basic level and go to the gym but I simply just can't. All I can do these days is sleep. When I do muster up the energy to see friends or go to the gym I feel nothing. I'm numb. I HATE this. I'm so pissed off at myself for doing nothing all the time. I'm either rage filled but still unable to move or wet blanket on head fog of disassociation can't move. I have a therapy appt Monday and I'm going to insist on another evaluation. I can't live like this anymore. I'm not even living. I have taken Adderall (unprescibed) in the past and it definitely helps. Should I mention this to any Dr's?",
        "created_utc": 1678499606,
        "upvote_ratio": 1.0
    }
]