[
    {
        "title": "I might‘ve messed up a lot at work",
        "author": "Free-_-thinker",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3uu1/i_mightve_messed_up_a_lot_at_work/",
        "text": "So I work at a concert hall, where I give out drinks. I don‘t like to do the cash check, cuz I‘m too anxious to handle all the money, and it‘s just too stressful. The other day I didn‘t really have a choice, it was all so messy, and a lot of my colleagues couldn‘t make it, so I had to take care of it. I would‘ve never agreed to working that day, if I had known the event is like a bar tour and will go to 3-4am, but then I couldn‘t back out of it, cuz we were already missing people. I then had to work 8-9 hours straight, cuz the people just kept on coming, and it didn‘t stop. There were a bunch of loud noises, blinking lights, and everyone screaming around me, while I had to do math, and talk to people, so I got a panic attack after short time, but had to remain calm on the outside. Now a bunch of money is missing. It for sure wasn‘t all my fault, cuz some other things went wrong, it was the biggest event there ever (which no one expected), and I switched with someone a few times, but my anxiety is going through the roof, and I‘m thinking bout quitting, since I feel like everyone is mad at me now. I told them all, I don‘t wanna do this job, and that I know my concentration will fail, I wish I just called in sick now, cuz all I can think about it how I messed up",
        "created_utc": 1678695303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this normal for adhd testing?",
        "author": "Kiram_OW",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3oej/is_this_normal_for_adhd_testing/",
        "text": "[removed]",
        "created_utc": 1678694619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calm on 60mg Ritalin",
        "author": "Right-Structure-6251",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3f9f/calm_on_60mg_ritalin/",
        "text": "[removed]",
        "created_utc": 1678693686,
        "upvote_ratio": 1.0
    },
    {
        "title": "20mg stopped working but I get stuck on 30mg",
        "author": "Mundane_Werewolf7945",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3f6r/20mg_stopped_working_but_i_get_stuck_on_30mg/",
        "text": "As the title says, this pertaining s to my vyvanse dosage. Recently noticed my 20mg stopped working. I had been taking it for over a year. And it stopped. I thought maybe I built a tolerance for it. So I was bumped up to 30mg.\n\nIt's not good. I get distracted by my phone and get stuck. I was never addicted to my phone. I try to focus on other tasks, but I can't align to the tasks I need to do.\nThis dosage is making me do the opposite of my 20mg. \n\nI'm going to ask my doctor to switch me back. Is there something I am doing wrong for my 20mg to not help? I looked online and read it could be what I'm eating or stress related.",
        "created_utc": 1678693678,
        "upvote_ratio": 1.0
    },
    {
        "title": "lions mane together with medication",
        "author": "Mysterea101",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3eoi/lions_mane_together_with_medication/",
        "text": "Found out about lions mane and wanted to give it a try with the Adderall IR.  \ndid anyone try and can tell how they work together or if should be taken separately   \nI couldn't find too much information about the combo   \nmaybe even taking adderall in the morning and lions mane at night   \n\n\nalso did you feel anything in the long run in terms of affecting adhd ?",
        "created_utc": 1678693623,
        "upvote_ratio": 1.0
    },
    {
        "title": "lions mane with medication",
        "author": "Mysterea101",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3c7o/lions_mane_with_medication/",
        "text": "[removed]",
        "created_utc": 1678693363,
        "upvote_ratio": 1.0
    },
    {
        "title": "lions mane with medication",
        "author": "Mysterea101",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3a6i/lions_mane_with_medication/",
        "text": "[removed]",
        "created_utc": 1678693155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey there😏 Anyone Else Experience Paralysis every night before Sleep?",
        "author": "Ericha-Cook",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2wug/hey_there_anyone_else_experience_paralysis_every/",
        "text": "[removed]",
        "created_utc": 1678691772,
        "upvote_ratio": 1.0
    },
    {
        "title": "I actually did it",
        "author": "TheHappyCamper1979",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2w07/i_actually_did_it/",
        "text": "[removed]",
        "created_utc": 1678691689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calm on 60mg Ritalin",
        "author": "Right-Structure-6251",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2s5h/calm_on_60mg_ritalin/",
        "text": "[removed]",
        "created_utc": 1678691288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another way to learn words and definitions without flashcards?",
        "author": "lilloticko",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2nza/another_way_to_learn_words_and_definitions/",
        "text": "I'm studying human bioscience and there's over 50 words I have to learn the definition of. \n\nA lot of them I know what they are but don't know how to actually define them, for example nueron, I know what it is but not enough to define it. \n\nThe only advice they have given the class is to use flash cards but I cannot force myself to spend the time to actually make them. \n\nAny ways to learn definitions that don't involve time and focus to prepare?",
        "created_utc": 1678690881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overthinking is ruining me",
        "author": "BugggyBrain",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2lta/overthinking_is_ruining_me/",
        "text": "[removed]",
        "created_utc": 1678690669,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to study &amp; concentrate without the overwhelming fear of dread",
        "author": "essredux",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2jd9/how_to_study_concentrate_without_the_overwhelming/",
        "text": "My exams are a month away and I’ve already studied quite a bit for it (though I still have alot left) but whenever I sit to study I literally cannot continue because my heart starts fluttering thinking about the volume I have left to study/revise and my chest physically starts to hurt. \n\nThis is me currently I feel like I’m frozen I know I should study and I’m sitting with my pen in hand, lecture video and notebook open but whenever I start watching the video I start panicking for no presumable reason I feel really helpless.",
        "created_utc": 1678690409,
        "upvote_ratio": 1.0
    },
    {
        "title": "it feels so draining",
        "author": "NotMyMainRedditAcc__",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2gxe/it_feels_so_draining/",
        "text": "I’m struggling in grades and I’m barely managing to keep up in studies. I slept at 6:30am yesterday because I spent hours trying to do a piece of work. Spoiler: I got nothing done. I’ve been staying up late for god knows how many weeks/months just to barely keep up with deadlines, with some deadlines having been already passed, and have shit grades. It’s so mentally taxing, and at the rate I’m going, I feel like I may have to stay back a year. Which I really don’t want to do. I want to graduate at the same time as my friends.\n\nI really don’t want to be deadweight to my family, friends, and gf. At the rate I’m going at, i may become an academic failure. In the the end, what will I be worth? You can only love/like someone so much for their character right? I feel so hopeless at the moment. And I feel like I won’t be able to make it. Doesn’t matter if I manage to graduate. What’s the point of graduating if you have shit grades? You most likely won’t be able to get anywhere good.\n\nI recently went for a psychological assessment for a re-diagnosis so that I could possibly get some exam accommodations for my final exam. I’ve had constant worries that my diagnosis will turn out to be ‘No ADHD’. If that happens, then would I have been lazy this entire time? Would I have been believing something wrong this entire time? Would have my first diagnosis been a false one? Would I have been some lazy, excuses-making, good-for-nothing?\n\nIt’s not recommended for me to take medication either, I have epilepsy and ADHD meds will lower the seizure thresh hold. Making me more prone to seizures. Staying up late isn’t good either, as it’s a big trigger for my epilepsy. I feel like I’m taking my life for granted with how late I stay up everyday. But it’s so hard not to do that when you have to dedicate an entire day to work, and make little to no progress.\n\nDoes it even  matter how many people believe in me, or tell me it’s going to be okay? When at the pace I’m at, every belief that they have had in me has been disproven, or barely met. I feel so hopeless and every thought I’ve had about the future and myself has been a negative one.\n\nSorry if this post breaks the rules or something, or better fits in the mega thread. Just felt like I needed to get this off my chest or someone to tell me that I’m going to be okay or something. I don’t want to burden any of my irls with this.\n\n\n\nUnrelated but: is it me or does Reddit mobile kinda suck? keyboard lags whenever I’m making a text post.",
        "created_utc": 1678690156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to get a diagnosis online?",
        "author": "LavishDaydream",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2gmn/is_there_any_way_to_get_a_diagnosis_online/",
        "text": " Hello everyone, I live in a South East Asia, there is hardly any place to get a diagnosis, especially when you are an adult (none as far as I know). \n\nI want to have an official diagnosis to know whether I have mental disorder or I just imagine it so I could start to get my life together \n\nRight now my options are giving up or saving up to travel aboard to get a diagnosis\n\nI just want to ask is there any way to get a diagnosis online and where to have one?",
        "created_utc": 1678690121,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the defining things that made you decide to seek a diagnosis?",
        "author": "Mountain-Sea-6974",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2g74/what_are_the_defining_things_that_made_you_decide/",
        "text": "[removed]",
        "created_utc": 1678690073,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the defining things that made you decide to seek a diagnosis?",
        "author": "Mountain-Sea-6974",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2fwn/what_are_the_defining_things_that_made_you_decide/",
        "text": "[removed]",
        "created_utc": 1678690041,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm sick of having ADHD. I just want to be able to do homework.",
        "author": "orangemelodie",
        "url": "https://www.reddit.com/r/ADHD/comments/11q2ac9/im_sick_of_having_adhd_i_just_want_to_be_able_to/",
        "text": "I'm falling behind again. I have a lot of backlogs and I'm struggling to make myself do any of them; they all just feel so... big and terrifying, like these tasks are horrifying monsters out to eat me. I don't know what to do. \n\nI know I need to act fast and get my shit together quickly so that I can keep myself from falling even more behind, but it's so difficult. It's so scary. I don't know what to do to make things less overwhelming and scary for me to actually face and just do.\n\nI don't know what I'm expecting from posting this... But it feels nice to get it out there somewhere. I'm trying to focus on staying calm and even just *alive*, but god I feel like everyone is running a race I can't even seem to start.",
        "created_utc": 1678689469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can ritalin (or lack of it) make me wake up earlier than usual?",
        "author": "Aspirini27",
        "url": "https://www.reddit.com/r/ADHD/comments/11q29a3/can_ritalin_or_lack_of_it_make_me_wake_up_earlier/",
        "text": "I am on ritalin for 5-6 days (10 mg in the morning and 10 in early afternoon). I feel no side effect and no significant improvement either. I don't think it's causing me to fall asleep later (I do fall asleep with difficulty, but this happened before ritalin too). But I have noticed the past 2 days that I wake up earlier than my alarm, much earlier, today for example I slept at 2:30 in the morning (cause I was online before) and woke up at 7, 2 hours earlier than my alarm. 4 and a half hours of sleep. Now, I happen to be extremely stressed out by the diagnosis procedure. For example, the day that I wanted to started taking ritalin, I also woke up extremely early for no reason (and I wasn't on ritalin yet, obviously). So is it possible that now the fact that I wake up earlier is related on ritalin in any way? It has been 15 hours since I last took it. I think it is probably the stress?",
        "created_utc": 1678689356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time blocking/boxing—how do you make this work with ADHD?",
        "author": "AnonymousOnReddit99",
        "url": "https://www.reddit.com/r/ADHD/comments/11q27sa/time_blockingboxinghow_do_you_make_this_work_with/",
        "text": "I’m struggling with this method, badly. I was hoping that Cal Newport’s method would help me to be realistic about how much I can actually do in one day. But there’s so many permutations/combinations for unstructured time that I get overwhelmed. I have drawn mine into columns, A, B, C, D, of different combinations because I don’t know which way is the best/which one I’ll do. Like if I try to set an order, my brain will rebel and laugh at it. For example, I will have an ideal day where I run in the morning before work, then go to work and have that option as A. But knowing myself, I will sleep in and won’t drag my ass out to run before work, and so then will need to have a Plan B where I have run after work. Or a plan C where today is going to not be a day where I run. And that’s just one example of exercise, but that’s how it is for all the things that I would put. \n\nOr if I get on a roll with a certain project, then I want to surf that wave and keep going and let myself hyper focus on it. Not stop it after a certain set time because my schedule says I would switch to a different task. The few times I’ve tried to time block/box, I have not been able to adhere to it, and so have given up. Not sure if there’s an ADHD friendly way to modify this strategy or not.",
        "created_utc": 1678689204,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no motivation.",
        "author": "NamingDifficulty",
        "url": "https://www.reddit.com/r/ADHD/comments/11q23q1/i_have_no_motivation/",
        "text": "[removed]",
        "created_utc": 1678688790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental health startup Cerebral shared private patient data with Google, Meta and TikTok",
        "author": "executivefunction404",
        "url": "https://www.reddit.com/r/ADHD/comments/11q21zv/mental_health_startup_cerebral_shared_private/",
        "text": "For those who have used cerebral, I just came across this article. I know they have had other issues in the past with the medical staff being pressured to dx adhd and prescribe meds. However, this is regarding personal data, protected by HIPAA, going to very large corporations whom you may not want to have possession of your mental health information.\n\nI'm not sure if there's any recourse, but it's good information to know, I guess. I think you can ask Google to delete your data, but idk if that relates to their harvested data or just the data provided by you on their platforms.\n\nExcerpts:\n\n&gt;Cerebral, a telehealth startup that gained popularity during the early days of the pandemic, disclosed this week that it shared the personal data of more than 3.1 million US patients with social media companies and advertisers, including Google, Meta and TikTok.\n\n&gt;Following a recent review of its software, Cerebral “determined that it had disclosed certain information that may be regulated as protected health information under [the Health Insurance Portability and Accountability Act].” Among the data Cerebral shared are names, phone numbers, birth dates and insurance information. In some instances, the company may have also exposed information it collected through the mental health self-assessment patients completed to schedule counseling appointments and access other services.\n\nSource: https://www.engadget.com/mental-health-startup-cerebral-shared-private-patient-data-with-google-meta-and-tiktok-223806251.html",
        "created_utc": 1678688612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to get a diagnosis online?",
        "author": "LavishDaydream",
        "url": "https://www.reddit.com/r/ADHD/comments/11q1xj4/is_there_any_way_to_get_a_diagnosis_online/",
        "text": "[removed]",
        "created_utc": 1678688173,
        "upvote_ratio": 1.0
    },
    {
        "title": "does longterm strattera use build up resistance?",
        "author": "mischief7manager",
        "url": "https://www.reddit.com/r/ADHD/comments/11q1t5e/does_longterm_strattera_use_build_up_resistance/",
        "text": "i've been on 60 mg/day of strattera (well, generic atomoxetine, i'm poor) since 2017. when i first started taking it, i vaguely remember the psychiatrist i saw mentioning something about building up a resistance to it over time that meant it could become less effective longterm, but i've been searching online and haven't found anything to corroborate it. \n\nhas anyone had this experience? i feel like i've really been struggling with executive function and sleep regulating these past \\~six months or so, in a way i haven't for a long time, and i'm wondering if i should talk to my doctor about increasing my dosage, but i changed insurance at the beginning of the year and i've only met with this doctor a couple of times. i'm not sure if they'll be open to upping my dose. (i'm in the US, i've changed health insurance 5 times in the past 7 years, it's a nightmare.)",
        "created_utc": 1678687748,
        "upvote_ratio": 1.0
    },
    {
        "title": "career troubles",
        "author": "Campuskween3333",
        "url": "https://www.reddit.com/r/ADHD/comments/11q1pwk/career_troubles/",
        "text": "[removed]",
        "created_utc": 1678687423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Chaos",
        "author": "Campuskween3333",
        "url": "https://www.reddit.com/r/ADHD/comments/11q1il0/career_chaos/",
        "text": "[removed]",
        "created_utc": 1678686701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking with hands",
        "author": "IndividualBusiness42",
        "url": "https://www.reddit.com/r/ADHD/comments/11q1c7e/talking_with_hands/",
        "text": "[removed]",
        "created_utc": 1678686058,
        "upvote_ratio": 1.0
    },
    {
        "title": "jumble of thoughts",
        "author": "Affectionate-Top4563",
        "url": "https://www.reddit.com/r/ADHD/comments/11q1bj6/jumble_of_thoughts/",
        "text": "[removed]",
        "created_utc": 1678685998,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Rookie is the only show I can watch unmedicated and not have to be doing something else while I watch",
        "author": "coojies",
        "url": "https://www.reddit.com/r/ADHD/comments/11q16r0/the_rookie_is_the_only_show_i_can_watch/",
        "text": "[removed]",
        "created_utc": 1678685515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most informative video on ADHD I’ve ever seen.",
        "author": "Glittering-Arm-3527",
        "url": "https://www.reddit.com/r/ADHD/comments/11q0um6/most_informative_video_on_adhd_ive_ever_seen/",
        "text": "[removed]",
        "created_utc": 1678684331,
        "upvote_ratio": 1.0
    },
    {
        "title": "life hacks for people without stimulants?",
        "author": "Suspicious_Force_890",
        "url": "https://www.reddit.com/r/ADHD/comments/11q0ugm/life_hacks_for_people_without_stimulants/",
        "text": "long story short, i have anorexia and recent weight loss has meant my elvanse prescription is being taken away. i’ve been without it for about 2 weeks now (not sure, i’ve lost all sense of time again lol) and i’m really struggling. it’s so hard going back to a life without meds when i’ve had six beautiful months playing life on a lower difficulty setting\n\nthose of you without stimulants, have you got any tips/tricks for coping with adhd symptoms? If meds are like glasses for your brain, then caffeine is like squinting - it barely helps, and I need enough to take down a small horse to feel any effect anyway\n\nif anyone has any ideas i would be immensely grateful",
        "created_utc": 1678684316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homework is literally the only reason my grades suck",
        "author": "712588Kf",
        "url": "https://www.reddit.com/r/ADHD/comments/11q0rsf/homework_is_literally_the_only_reason_my_grades/",
        "text": "[removed]",
        "created_utc": 1678684072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone from Sydney?",
        "author": "MobileMaleficent1009",
        "url": "https://www.reddit.com/r/ADHD/comments/11q0chz/anyone_from_sydney/",
        "text": "[removed]",
        "created_utc": 1678682709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone struggling with skin/nail/hair picking?",
        "author": "huhubels1",
        "url": "https://www.reddit.com/r/ADHD/comments/11q08nf/anyone_struggling_with_skinnailhair_picking/",
        "text": "[removed]",
        "created_utc": 1678682365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse and Excessive Bleeding?",
        "author": "my_sorrow",
        "url": "https://www.reddit.com/r/ADHD/comments/11pzpyo/vyvanse_and_excessive_bleeding/",
        "text": "maybe an odd question , but has anybody else noticed that when they take their Vyvanse they bleed more when they are injured like a cut on the skin or anything like that? trigger warning: I struggle with self harm, and I noticed during an insurance issue while I was without my meds for a bit/the times when I don’t take my vyvanse, I bleed a noticeable amount less than the days that I do take my vyvanse. like a considerable amount. additionally, I got recent tattoos, and the day I took my vyvanse, I was bleeding like crazy my poor artist was struggling. I didn’t take it as a learned experience, and I have had no bleeding issues with tattoo sessions since. does anybody else experience this issue? i’m on a considerably low dose too at 20mg. thank you!",
        "created_utc": 1678680753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it easier to live in Europe for people with ADHD / Anxiety?",
        "author": "RylanStylin57",
        "url": "https://www.reddit.com/r/ADHD/comments/11pzpij/is_it_easier_to_live_in_europe_for_people_with/",
        "text": "I (22M) was going to university, where I worked in a research center studying Artificial Intelligence.  However, during my Junior year, I developed crippling anxiety that has forced me to drop out. I live with my parents now, who are very disappointed and upset.  I'm seeking treatment for anxiety but it takes 4-6 weeks for the medicine to start working. I kind of just sit around and scroll through social media on my phone in bed. I have no interest in anything, and dont enjoy anything anyways. \n\nI read online that \\~30% of people with Adult ADHD are homeless in the United States. If it werent for my parents, I'd be homeless right now.  I'm wondering if it would be easier to live in Europe, since alot of systems are socialized, you dont have to own a car, and taxes are more straightforward.  The stress of housing, taxes, insurance, etc in the U.S. really gets to me, and I dont even have to pay for it yet.\n\nI'm planning on backpacking the Appalachian Trail starting next month, but I dont know what I'll do after that.  I'm scared to do anything at this point.  Right now I can just hope this medicine works so I can get a clear mind and make good decisions.",
        "created_utc": 1678680712,
        "upvote_ratio": 1.0
    },
    {
        "title": "My experience with a Pharmacy fornmy meds (Adderall XR 30mg)",
        "author": "Khetsu",
        "url": "https://www.reddit.com/r/ADHD/comments/11pzmjs/my_experience_with_a_pharmacy_fornmy_meds/",
        "text": "Honestly I’m not sure if I’d consider this a tip.\nBut I did get my prescription from the Pharmacy I go to, (Its in the actual general hospital) \nAnd all I did was call a 2nd time, and ask “Hey I wanted to see if my prescription was ready to pick up?” and the clerk (Bless his soul) was super nice tone and everything, said after looking up my name\n“Adderall? Yeah we got it ready for you!” \n\nBEFORE THAT THO! I called the 1st time hours earlier that day, and the clerk that picked up after I asked “I was wondering if there was any adderall in stock?”\nThe guy was rude as hell! Immediately “No. We dont have any doses.” AND EVEN ADDED MOCKINGLY “Good luck finding them.”\n\nIdk what it is. If they think we’re druggies or if they just hate their job. Idk. But i thought id share this seeing all these experiences with the shortage and all.. Best of luck guys",
        "created_utc": 1678680459,
        "upvote_ratio": 1.0
    },
    {
        "title": "weird question... involves drool",
        "author": "AlwaysTrying2bBetter",
        "url": "https://www.reddit.com/r/ADHD/comments/11pzgh9/weird_question_involves_drool/",
        "text": "So really weird question and please dont judge me, but does anyone else randomly forget to swallow and realise when you are literally about to drool on yourself? This hasn't started happening to me until recently (2ish weeks) and I've recently started taking a half dose of adderall plus 1000mg phenylalanine because I'm trying to ride out my meds being on back order for a week (or more, hopefully not). Its just weird.. never experienced it before and i feel kinda nasty about it. To note, i was drinking my 1ST alcoholic drink of the week both times. --Not sure what info is relevant, so there is all of it. Please tell me I'm not weird. What is happening to me? 🤦‍♀️",
        "created_utc": 1678679989,
        "upvote_ratio": 1.0
    },
    {
        "title": "so lost- can’t clean my room",
        "author": "maggieletvin",
        "url": "https://www.reddit.com/r/ADHD/comments/11pze5x/so_lost_cant_clean_my_room/",
        "text": "College student- have been living in piles of clothes, art supplies, etc, last clean was a couple of months ago. In my mind I have to do the laundry first but I keep being busy or the washer is full or I get distracted by the dishes or something…. spring break is coming up soon and I would really like to clean it before I leave so I come back to a clean space. Went out today to do homework I haven’t touched all weekend (only got one thing done but still a win), managed to lose my phone on my floor and took me 2 min to find it.  Lost my headphones and can’t find them and it’s making me sad. What should I do? Any advice? Feel so alone and lost.",
        "created_utc": 1678679786,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know",
        "author": "CrudestBerry",
        "url": "https://www.reddit.com/r/ADHD/comments/11pza6e/i_dont_know/",
        "text": "[removed]",
        "created_utc": 1678679441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aspiring Music Creative, trying to overcome Vinyl addiction to make music",
        "author": "MobileAcanthaceae518",
        "url": "https://www.reddit.com/r/ADHD/comments/11pyvfd/aspiring_music_creative_trying_to_overcome_vinyl/",
        "text": "Hello everyone! I am a 21M and I am a currently on the track to graduate from university, and I will spend another year in graduate school (I'm a cybersecurity major) and probably either decide if I will stay with my family or move out. I also live in a very robust city, so once I do know how to create music the opportunities to perform are quite amble, but I'll get to that later.\n\nThe problem of course, is that I am just starting out, I have a good voice and I would consider myself quite energetic as a person. Yet, I also sustain myself and my job is that I own an online record store. Not only that, I am quite obsessed with just going on my page and scrolling, while also doing nothing really important for hours at a time. On top of that, I don't have social media, and I don't have any crazy familial commitments, so I have so much potential to really focus my dreams and get to work.\n\nHowever, I am so obsessed with vinyl, and online shopping/selling I spend so much time just doing impulsive and repetitive actions that I am quite disgusted from how I am behaving. I do work a bit, but it is nothing I need to spend more than 30 minutes - 1 1/2 hours doing a day. \n\nThe climax of the problem is, I use the remaining 5-6 hours of free time I have in the day (not including eating, chores, and walking), basically just mindlessly scrolling. If I used half of that time daily to really get in on learning music production, I can definitely at least create enough within a year or even the summer to establish myself as an artist, and I really do believe that (else my dreams would feel dead to me).\n\nI rely a bit on my best friend/neighbor who is quite good at music production himself, yet I want to be more reliant on me, as I am still trying to figure out my sound and what my brand will look like. I want to be more efficient, and I don't know how busy I will be after the summer when I may potentially have school projects to work on. The impeding understanding that once I learn music production, that there will be a branch of more things to work on within that field, and then to worry about other things involving my music social media and creativity really edges me. Because of this I guess I get lots of thoughts and worries that I won't be able to achieve my goals, and that the pressure is just going to be a lot. \n\nThis is all, and I don't know how else to conclude other than to ask for any advice or help! I really would appreciate it!",
        "created_utc": 1678678216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall not aderalling anymore?",
        "author": "Ok-Cantaloupe2478",
        "url": "https://www.reddit.com/r/ADHD/comments/11pylak/adderall_not_aderalling_anymore/",
        "text": "Is anyone experiencing reduced or sometimes even no effects? I read an NYT article examining this issue but putting the entire onus on us in the name of having cognitive biases. Can anyone confirm if it's the same with them or not?\n\nHere's the article: People With A.D.H.D. Claim Adderall Is ‘Different’ Now. What’s Going On? https://nyti.ms/3JqXQpZ",
        "created_utc": 1678677401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disability due to adderall shortage?",
        "author": "doodlearm",
        "url": "https://www.reddit.com/r/ADHD/comments/11pybik/disability_due_to_adderall_shortage/",
        "text": "Has anyone gotten disability benefits due to loss of medication? I wouldn’t consider myself disabled while medicated but without it I can’t shower, clean the house, and can barely work. I don’t know what to do. My adhd comes with extreme brain fog and it’s debilitating. I also have BPD, and being medicated for adhd has helped those symptoms. It’s allowed me to take initiative and solve problems, develops hobbies and distract myself with things like cleaning or exercise. Without it Im basically mentally paralyzed. Most things become overwhelming. I remember before diagnosis in class I would turn in empty tests because the effort of attempting it was an overwhelming amount of stress. I can’t work in that state, I can barely take care of myself. How would one go about getting disability benefits for this?",
        "created_utc": 1678676648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a sub for parents with children with ADHD?",
        "author": "plumtastic",
        "url": "https://www.reddit.com/r/ADHD/comments/11py7rg/is_there_a_sub_for_parents_with_children_with_adhd/",
        "text": "[removed]",
        "created_utc": 1678676378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this allowed? (Pharmacy refill)",
        "author": "Redditaccount90909",
        "url": "https://www.reddit.com/r/ADHD/comments/11py3ge/is_this_allowed_pharmacy_refill/",
        "text": "I meet my doctor every 3 months and he gives me 3 separate paper prescriptions every time for each month’s supply. I have been going to 2 different pharmacies in my area depending on who has supply due to the national shortage and I went to the alternate pharmacy this time and filled my most recent prescription on March 5th thinking it had been 28 days since my last and paid for it with insurance covering it no problem. I realized later that it had only been 26 days.\n\nThe insurance covered the cost and the pharmacists didn’t say anything or ask any questions so I assumed it was the right time to get it filled. I went to the other pharmacy the month before so maybe they didn’t see that I didn’t fill with them the previous month.\n\nIs this allowed? I’m not sure about the exact law in my state (USA) and I don’t know if I broke some rule.",
        "created_utc": 1678676048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse is starting to give me painful muscle tension and I’m scared to go back on them",
        "author": "AutismoGizmo24",
        "url": "https://www.reddit.com/r/ADHD/comments/11pxo9n/vyvanse_is_starting_to_give_me_painful_muscle/",
        "text": "Should I tell my doctor to take me off vyvanse? \nLast week I ended up in the hospital because I was up for like 2 days unable to sleep because my neck was so tense it felt like it was about to snap and I just couldn’t take the pain anymore. \n\nI think it started happening because i stopped taking them for a few weeks and when I started taking them again my shoulders would tighten up and it just kept getting worse. I haven’t taken them for a week and I don’t plan on taking them until I can get my back fixed and figure out what the fuck is wrong with me",
        "created_utc": 1678674876,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you study? What is studying?",
        "author": "CocayneWayne",
        "url": "https://www.reddit.com/r/ADHD/comments/11pxd3z/how_do_you_study_what_is_studying/",
        "text": "[removed]",
        "created_utc": 1678674014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daily Specials? Never Heard of ‘Em",
        "author": "plant-pariah",
        "url": "https://www.reddit.com/r/ADHD/comments/11pxb4h/daily_specials_never_heard_of_em/",
        "text": "I hadn’t been to a restaurant in ages, so the following struck me when I did: I don’t think I’ve ever truly heard all the specials announced by a waiter. For some reason that’s one of my instant ADHD cut scene skips. Often, I’ve regretted not paying attention, but I can’t seem to focus until too late. Anyone relate? Any tips?",
        "created_utc": 1678673868,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you feel/cope after not taking meds?",
        "author": "Perpetulantpanda",
        "url": "https://www.reddit.com/r/ADHD/comments/11pxa0i/how_did_you_feelcope_after_not_taking_meds/",
        "text": "[removed]",
        "created_utc": 1678673783,
        "upvote_ratio": 1.0
    },
    {
        "title": "how should vyvanse feel?",
        "author": "nololnololnolol",
        "url": "https://www.reddit.com/r/ADHD/comments/11px83d/how_should_vyvanse_feel/",
        "text": "i realise it’s a lot smoother than ritalin IR so i’m not meant to feel as talkative and feel when it peaks, but it almost feels like vyvanse does nothing. i find that i’m able to do tasks slightly better but it’s not the pull into concentration and slowing of thoughts in my head that ritalin had for me. i’m on 50mg right now and will go up to 60 next week, but want to know if maybe vyvanse isn’t for me or if the higher dose may actually help?",
        "created_utc": 1678673641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best time to take ADHD medication (Vyvanse/Lisdexamfetamine)?",
        "author": "dinobea",
        "url": "https://www.reddit.com/r/ADHD/comments/11px3s3/best_time_to_take_adhd_medication/",
        "text": "Vyvanse makes me lose my appetite a bit, so I usually eat a big breakfast before taking it. But then I before the meds kick in I get really tired so sometimes I end up taking a nap even though it's literally the morning. So if I take it before breakfast, will I lose my appetite for breakfast? \n\nWhat time do you take your meds to make it the most effective? Any other tips? Thanks!",
        "created_utc": 1678673311,
        "upvote_ratio": 1.0
    },
    {
        "title": "I rely too much on my partner",
        "author": "stickykebab",
        "url": "https://www.reddit.com/r/ADHD/comments/11px2wo/i_rely_too_much_on_my_partner/",
        "text": "I’m 22F, currently getting assessed for ADHD and I live with my partner who does literally everything around the house. When I lived alone, my place was always a mess, there’d be bowls and plates in the sink that would get mouldy because I would never put them in the dishwasher, funky smells from trash not being taken out, all the fun stuff. The only time I would clean was when I had guests over and even then I would only clean the common areas. I find it hard to start any task and that includes chores but even if I did start, I’d get distracted and never finish. My partner is amazing and vacuums daily, wipes every surface, does the dishes, takes out the trash etc and I feel like i do absolutely nothing. Even with organisation, he is the one to organise everything and remind me I have things due for uni and helps me get started with assignments. I feel incredibly useless as a partner. Does anyone relate? What can I do to not rely on him so much?",
        "created_utc": 1678673243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got referral to be tested for ADHD by neurologist but now other doctors are considering I might just get micro seizures?????? I’m not zoning out I’m actually having seizures??? Wtf?",
        "author": "jongo_bongo",
        "url": "https://www.reddit.com/r/ADHD/comments/11pwx04/got_referral_to_be_tested_for_adhd_by_neurologist/",
        "text": "[removed]",
        "created_utc": 1678672813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking about others in a relationship",
        "author": "Beneficial-Ad-9555",
        "url": "https://www.reddit.com/r/ADHD/comments/11pwgl8/thinking_about_others_in_a_relationship/",
        "text": "Hi all,\n\nSo I'm currently undiagnosed but I suspect I have ADHD as a lot of the major and minor symptoms apply to my life. At the moment, I'm in the process of doing assessments with a healthcare professional to see if I can get diagnosed and the steps I need to take after that to improve my life. \n\nOne thing I'm currently struggling with is my relationship with my girlfriend. We've been together for about 5 months. I spent about a year before that speaking to a lot of different girls and getting to know them, kinda falling in love sometimes but most of them didn't work out. I have a lot of wonderful romantic memories with these people. Some situationships we just drifted away from each other and I was more interested in my current GF that I let those situationships die out. \n\nIt took us a few months to officially get into a relationship. I find it very difficult to make important decisions. I had to choose between a bunch of people who I was dating at the time to be serious about and talk about a relationship and having a future together. I eventually just jumped into the deep end and decided I should be with her. That's fine as a relationship is pretty low risk but marriage is a big commitment that is pretty life changing. Your life will change completely depending on who you marry. \n\nMy girlfriend is everything I've been looking for. She's beautiful, smart, funny, respectful, understanding and silly. She has so many quirks like catchphrases and we have so many great memories together. She scratches part of my brain that no one has ever done before. \n\nWe're both muslim and the ideal situation is that we get married as soon as possible but this is something I'm struggling with as I'm not sure I can commit to her as I'm worried I'll still be thinking and wishing I was with others even when married. \n\nOn paper I'm happy in the relationship but I also can't stop thinking about other girls I used to speak to and wonder what my life would be like if I was with them instead. It's heartbreaking and I can't seem to focus or be satisfied in the relationship I'm in. I'm not bored exactly but I think it'd be more exciting to start a new relationship with someone else.\n\nIt's sadly not a question of just *not* thinking about those previous relationships and focusing just on this current one as I can't turn it off. I daydream a lot about those relationships and if I'd be happier or more satisfied than I am now. \n\nThis is happening across all aspects of my life. I'm a freelancer and I'm more excited by the newest job that comes in than the one I'm currently working on. I was also in a relationship before that for nearly a decade and we broke up a couple of years ago. During that relationship I was also thinking about other people, having crushes, having feelings for people I got close to. So it's not exclusive to just this relationship. The difference however is I'm feeling more negative feelings now and anxiety chest pains. \n\nBack to the relationship, I'm constantly being distracted by my previous situationships, what could have been, what could be, attachments to them and nostalgia for previous dates and moments I shared. I'm in love with my GF but I have these strange anxiety chest pains whenever I think about marriage or even engagement. I'm not 100% certain she's the right person for me even though I love her, I always enjoy being with her and interacting with her, there's nothing to suggest she's wrong for me I just wish I didn't have these overthinking thoughts or chest pains that I can't ignore. \n\nThere a few other people in my life that I think about regularly who I think might be better in looks but worse in personality or connection with me but then again I know if I was with them I'd be in the same exact situation where I would be looking around, getting distracted and thinking about my life with another girl who isn't them. If I was with someone else I'd wanna be back with my GF and when I'm with my GF I wanna be with someone else. \n\nI think if there was another person that I could be 100% happy with and never think about anybody else, I would break up with my GF and try to be with them. However I don't think that person exists and the issues lie with me. \n\nI'm very indecisive and it's eating away at me. I miss the thrill of getting to know someone and dating them in real life but also I love being in a relationship with someone I deeply care about. Me and my GF have been on a lot of wonderful dates together so we're rarely ever bored. The solution isn't to go on more dates etc I'm not sure what the solution is. \n\nMy GF deserves better. It's unfair but I can't help how my brain works. She deserves someone who's certain about her. But I'm trying everything to keep her by seeking help and hopefully find a solution. We talk about breaking up if things don't get better but that's not a solution for me personally as I'll get into another relationship and end up in the same place. \n\nWhat should I consider doing in this situation? and is anyone going through / been through something similar?",
        "created_utc": 1678671568,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am kind of frustrated. Can I actually learn anything?",
        "author": "NoReason6487",
        "url": "https://www.reddit.com/r/ADHD/comments/11pwdvo/i_am_kind_of_frustrated_can_i_actually_learn/",
        "text": "So I recently have stronger symptoms, and I keep thinking that I do not have this one big thing I am so passionate about.\n\nI always hobby-hop. I don’t have anything I am passionate about and I feel worse than people that do have it.\n\nTo be honest, I am scared that it is going to be like that for my whole life. That I will lack the self discipline forever.\n\nObviously I will try my best, and Im considering therapy, but I want to hear your stories. Is there something you are extremely passionate about? Did you build self discipline to get through those difficult moments doing what you love? Or maybe you didnt need the self discipline, because you loved what you do so much? If you were/ are where I am rn, what did you do/ or you are still doing to get past that?",
        "created_utc": 1678671360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do ADHDers struggle with on-paper planning?",
        "author": "Quinlov",
        "url": "https://www.reddit.com/r/ADHD/comments/11pwbv0/why_do_adhders_struggle_with_onpaper_planning/",
        "text": "[removed]",
        "created_utc": 1678671211,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t understand what’s going on with me",
        "author": "tythevisionary",
        "url": "https://www.reddit.com/r/ADHD/comments/11pw771/i_dont_understand_whats_going_on_with_me/",
        "text": "Hey to all,\n\nI’m a 23 year old male, and within this past year I’ve noticed and come to terms with my symptoms of undiagnosed ADHD.\n\nI grew up disrupting class, getting in trouble for my lack of attention. I’d make the decision to walk in class and behave and by 12:00 I was in the principals office for something. This ideal has taken over many aspects of my life as I’ve grown and I simply want to know, how can I help myself?\n\nI’m currently 23, a college dropout (failed due to me just not doing work smh) and I’ve planned to get a job for the past 2-3 years. Never have. I’ve been paralyzed by something I don’t even understand. My parents, whom are supportive, seem to misunderstand me and think I’m lazy for advantageous reasons. “You think we’ll always pick up the slack for you”. That’s never been an idea to me. I’m starting to realize nobody cares, searching for sympathy won’t help anyhow. \n\nI’m extremely impulsive, w33d carried me as a coping mechanism for years and I’ve finally quit to be sober minded and capable. I’ve decided to do better for myself and enlist in the Air Force for more structure and discipline, but with that opportunity, ADHD diagnosed is a disqualifier. So no meds, No adderall, just my raw brain and willpower. There are many things I have a desire to do but can’t get myself up to do them.\n\nWhat is this that I’m fighting against? How do I better myself? My family is seemingly done with the ‘excuses’, and I’m tarnishing relationships with those I love due to this. How do I repair damages done? I want to take accountability and I want to do great things and great works, but how? How do I beat my brain?\n\nI am the culprit, I take all accountability and I want to fix it. Please help!\n-Tyler",
        "created_utc": 1678670868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is having bad eyesight and adhd such a terrible combo??",
        "author": "chronicallydead",
        "url": "https://www.reddit.com/r/ADHD/comments/11pw69l/why_is_having_bad_eyesight_and_adhd_such_a/",
        "text": "It’s really annoying having to wear glasses and I lose them all the time! Sometimes I don’t find them until months later after I got a new pair or I spend weeks just seeing nothing. I can’t drive without them luckily I don’t drive often anyways because I don’t have a car anymore. But I wanted to drive to the store borrowing my moms car because no one has time to drive me but no glasses and I don’t trust myself to drive “blind”. I get sensory issues with glasses so I always take them off which doesn’t help. I had contacts which worked really well for me because I couldn’t feel them most of the time and when I did It was too much of a hassle to take them out. But I can’t afford them right now. Just ranting about stupid issues.",
        "created_utc": 1678670794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dizzy on day off from medication (Concerta). Is this a thing?",
        "author": "Krypt0night",
        "url": "https://www.reddit.com/r/ADHD/comments/11pw1e6/dizzy_on_day_off_from_medication_concerta_is_this/",
        "text": "I've been on concerta for coming up on 2 weeks now. This morning was the first time I didn't take it (time change/rough night/slept in/decided I'd skip since it was later than usual.)\n\nToday, I'm so dizzy. Like off and on the entire day. Just wondering if this could be from being off it for a day and it fully getting out of my system or if it's likely not the medication and others haven't experienced that.\n\nI haven't really had any dizzy on the medication so far just nausea and that's gotten better, so it's weird being dizzy.",
        "created_utc": 1678670432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a neurotypical thing or an ADHD thing?",
        "author": "WindchimeEnthusiast",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvu82/is_this_a_neurotypical_thing_or_an_adhd_thing/",
        "text": "Sometimes there’s multiple movies/TV shows I want to watch and I can’t choose between them so I just sort of sit there and watch none of them and kind of get a little anxious even? Is that a normal thing or an ADHD thing or something else? As a side note—I’m not quite sure if I have ADHD. I think I do because I’ve been put on medication (which I haven’t taken in a while because it’s awful), but I didn’t get formally diagnosed, I don’t think. Anyway, thanks for the answers in advance.",
        "created_utc": 1678669901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this an ADHD thing or a neurotypical thing?",
        "author": "WindchimeEnthusiast",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvsnq/is_this_an_adhd_thing_or_a_neurotypical_thing/",
        "text": "[removed]",
        "created_utc": 1678669790,
        "upvote_ratio": 1.0
    },
    {
        "title": "I confirmed my Vyvanse is underdosed, now what?",
        "author": "likewut",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvpcb/i_confirmed_my_vyvanse_is_underdosed_now_what/",
        "text": "I  [posted](https://www.reddit.com/r/ADHD/comments/11nyu1z/is_there_any_way_to_test_if_your_vyvanse_is_real/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button) about my concern that my Vyvanse 50mg doesn't seem to be effective, where my previous bottle of Vyvanse 40mg did have a positive effect. So based on the advice there, I bought a mg scale to weigh the pills. The Vyvanse 40mg weighed 212mg (+/- a couple mg each time I weighed it), where my Vyvanse 50mg capsules weighed 175mg +/- 3 mg.  The Vyvanse 50mg capsule weights were too uniform to be underdosed at CVS, it had to come that way from the factory. I opened one of my 50mg capsules and it was pretty much completely full of a white powder, which probably doesn't help much.\n\nAny idea on what my next step is? Do I go to CVS? Do I reach out to Takeda? Can I contact the FDA? \n\nI understand maybe the 40mg formula has more filler or something, but I think the fact that I feel less (or no) effect from the 50mg coupled with my testing proving the 50mgs are different than expected provides strong evidence that there is something wrong. And frankly I don't trust drug companies to not underdose, especially when demand skyrocketed during the Adderall shortage.",
        "created_utc": 1678669536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I make a mistake? (pharmacy refill)",
        "author": "Redditaccount90909",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvnqh/did_i_make_a_mistake_pharmacy_refill/",
        "text": "I meet my doctor every 3 months and he gives me 3 separate paper prescriptions every time for each month’s supply. I have been going to 2 different pharmacies in my area depending on who has supply due to the national shortage and I went to the alternate pharmacy this time and filled my most recent prescription on March 5th thinking it had been 28 days since my last and paid for it with insurance covering it no problem. I realized later that it had only been 26 days. \n\n\nThe insurance covered the cost and the pharmacists didn’t say anything or ask any questions so I assumed it was the right time to get it filled. I went to the other pharmacy the month before so maybe they didn’t see that I didn’t fill with them the previous month.\n\nIs this allowed? I’m not sure about the exact law in my state (USA) and I don’t know if I broke some rule.",
        "created_utc": 1678669421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice (TW ABUSE)",
        "author": "punk-red77",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvn9i/need_advice_tw_abuse/",
        "text": "[removed]",
        "created_utc": 1678669389,
        "upvote_ratio": 1.0
    },
    {
        "title": "I once lost my phone for three days...",
        "author": "xpickles23",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvmj5/i_once_lost_my_phone_for_three_days/",
        "text": "[removed]",
        "created_utc": 1678669335,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm anxious about my next appointment with my psychiatrist",
        "author": "Tunegutten",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvijc/im_anxious_about_my_next_appointment_with_my/",
        "text": "[removed]",
        "created_utc": 1678669068,
        "upvote_ratio": 1.0
    },
    {
        "title": "First day on Vyvanse 20mg.",
        "author": "martinmaco2004",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvfyt/first_day_on_vyvanse_20mg/",
        "text": "Hey guys, I can't really tell if my vyvanse is working or not. This is my first ever stimulant so im not very sure its working or its a placebo effect type of thing. I feel more calmer and I feel like my brain is a little bit lighter but I am just confused on whether the pills are doing its thing or a placebo effect. 😂    \n\n\nDo other people feel the same in a sense? Is this normal?",
        "created_utc": 1678668877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I love working whenever it doesn’t benefit me?",
        "author": "blabbedybloobla",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvb2p/why_do_i_love_working_whenever_it_doesnt_benefit/",
        "text": "Is this an ADHD thing or was I just programmed to self-destruct? \n\nI have spent more than 5 hours of the past 24 hours learning some CS and practicing. When I was taking AP Comp Sci as a high schooler, I rarely touched the material outside of school and it showed in my grades.\n\nWhen I wasn’t a biology student, I would spend hours reading articles in bio journals. When I was a biology student, I completed about 50% of my required reading and was about a C-average student.\n\nNow, as an engineering student, I can’t get myself to work as hard as I should for school, but I still don’t rest. I spend my free time picking up some random project to waste my time and distract me from schoolwork.\n\nI also fully see the possibility of being extremely interested in somebody, them reciprocating, and then giving up.\n\nHow (or can) do I fix this? Why does it happen? I know that this will ruin my life if it continues through the entirety of it.",
        "created_utc": 1678668515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medication Side Effects",
        "author": "CivilianJoshy",
        "url": "https://www.reddit.com/r/ADHD/comments/11pvayr/medication_side_effects/",
        "text": "So I've been instructed to go back on my meds (Vyvanse) after a while by my doctor. I took it and I felt weird.\n\nI was sitting in my Study Period and I felt super dizzy, my legs felt like jelly, I wasn't working right, and just didn't feel like myself. I got up to go for a walk and fresh air which didn't help. I ended up being told to go home.\n\nIs this normal? What is it?",
        "created_utc": 1678668507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being Judged For Being Messy",
        "author": "lobersaby",
        "url": "https://www.reddit.com/r/ADHD/comments/11pv76k/being_judged_for_being_messy/",
        "text": "[removed]",
        "created_utc": 1678668222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting treatment",
        "author": "Beeandhisknees",
        "url": "https://www.reddit.com/r/ADHD/comments/11pv6c1/starting_treatment/",
        "text": "I desperately need to go on medication if I want to have any quality of life. Even just watching TV or playing a video game is nearly impossible because of my executive dysfunction. Combined with my social anxiety and depression, I am completely useless and I don’t have a source of income other than my family who does not support ADHD treatment because it “changes your personality.” I am completely stuck and I don’t know what to do. \n\nIf anyone was/is in a similar situation, and has anything at all that might be helpful for me to hear, please say it. My main concern is being able to afford medication, but because of 18 years of untreated ADHD I am failing my first year of community college and I’ll probably have to take a break until I can afford treatment. If anyone has knowledge about where to start, please let me know.",
        "created_utc": 1678668157,
        "upvote_ratio": 1.0
    },
    {
        "title": "can't watch tv shows, movies and listen to NEW music",
        "author": "artpopforlife",
        "url": "https://www.reddit.com/r/ADHD/comments/11pv4pp/cant_watch_tv_shows_movies_and_listen_to_new_music/",
        "text": "I can't watch TV shows, or watch movies, because they are all boring and it's impossible for me to sit still while watching those... I can't also listen to new music because that will somehow trigger me some \"anxiety\" and I listen to the same music every day for about ten years...\n\nCould this be ADHD signs?",
        "created_utc": 1678668036,
        "upvote_ratio": 1.0
    },
    {
        "title": "impossible to work 8 hours a day",
        "author": "artpopforlife",
        "url": "https://www.reddit.com/r/ADHD/comments/11pv2xg/impossible_to_work_8_hours_a_day/",
        "text": "my brain doesn't cope with the idea of intensely working 8 hours a day in front of a computer doing tasks, one hour is enough to end me... and I even think about not wanting to live anymore because of this condition. \n\nquestion: this rejection could be ADHD?  feeling like being on a computer for 8 hours is death?\n\non another note, when I used to be a teacher, working standing up, and walking around school, dealing with time was way easier for me.",
        "created_utc": 1678667906,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t think it should be easy to get diagnosed with ADHD",
        "author": "cparfa",
        "url": "https://www.reddit.com/r/ADHD/comments/11pv2kb/i_dont_think_it_should_be_easy_to_get_diagnosed/",
        "text": "I’ve seen a lot of posts, on a daily basis, of people diagnosed following a single interaction with a doctor. \nADHD is a mental disorder. Would you expect a doctor to diagnose you as bipolar or OCD after a single interaction? \n\nWouldn’t you want a thorough assessment to go through all the possibilities? Wouldn’t you want your doctor to take the time to accurately diagnose you? \nDoes it not alarm you that a doctor is willing to diagnose you with a mental disorder that could affect every job application, every health visit moving forward? After barely assessing any of your signs and symptoms? Or without at least suggesting behavioral therapy? \n\nAlso, I’ve seen that the day of diagnosis, they are leaving with prescriptions. That’s so insane to me, how would you not try non-pharmacological interventions first?\nI have been medicated for years, but at a last resort. I had tried to use the free academic services offered to me, I met with a school counselor, my mom paid older students to try to tutor me. I tried vitamins and natural supplements. I only started medication once these all failed. \nI was only diagnosed because of the years of documents from teachers begging my mom to get me tested. \n\nI understand feeling like a diagnosis is the answer to all the issues you’re experiencing, but I don’t think it is a diagnosis that can be accurate after just one interaction. \n\nI’m prepared to be attacked for not instantly validating every single person’s quickly diagnosis, but please disagree respectfully. I only hold this sentiment out of compassion for others, worried they aren’t exploring all the potential interventions for their mental health issues.",
        "created_utc": 1678667882,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get diagnosed",
        "author": "RE-Catlover76",
        "url": "https://www.reddit.com/r/ADHD/comments/11pv1dt/how_to_get_diagnosed/",
        "text": "I wanted to know where i should go to get diagnosed and how to bring it up. \n\nSince a kid I’ve always struggled with learning but i always thought that it was because i couldn’t see (i have astigmatism, diagnosed at age 7, never really liked to wear glasses) anyways currently I’m studying to take a placement to go back to school. As I’ve been studying and in my day to day life in general I’ve noticed that i lose focus a lot while attempting to learn, read, watch tv or talk to others, I’m constantly talking over people, and I’m very forgetful. I feel very stupid because as a kid i never paid attention in class so i never really learned much (not sure if it’s because i simply couldn’t focus or because i didn’t care, or both) and now I’m 21 trying to go back to school and I’m struggling because i can’t seem to focus. I’m not sure how i would bring this topic up to my primary doctor because i don’t want it to seem like I’m self diagnosing myself.",
        "created_utc": 1678667792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I expect my body to adjust to Focalin after a few weeks?",
        "author": "TheThinker11-1",
        "url": "https://www.reddit.com/r/ADHD/comments/11puy6w/should_i_expect_my_body_to_adjust_to_focalin/",
        "text": "[removed]",
        "created_utc": 1678667559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non stimulant or stimulant?",
        "author": "gmailuser20",
        "url": "https://www.reddit.com/r/ADHD/comments/11puu8c/non_stimulant_or_stimulant/",
        "text": "I’m currently trying a non-stimulant and have no benefits and a few bad side effects— extremely tired, dry mouth, nausea. There is one more non-stimulant I can try to see if it works better, but if not, is taking a stimulant worth it? I know there’s some side effects on those too but my lack of energy on the non stimulant is very noticeable. I’ve researched adderall and vyvanse but if there’s any other stimulants that work well with little side effects, I’d appreciate any info.",
        "created_utc": 1678667262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with my sleep routine lately &amp; taking hydroxyzine",
        "author": "NoImpact3813",
        "url": "https://www.reddit.com/r/ADHD/comments/11puspo/struggling_with_my_sleep_routine_lately_taking/",
        "text": "So I take vyvanse in the morning (along with lamictal and buproprion)… to help with my sleep, my psych doc prescribed me with 25 mg of hydroxyzine, as needed. For the most part, I think it does help to sedate me a little bit.\n\nBUT I find I will have like really vivid dreams and it’s much more challenging to wake up early, even if I get a solid 7-8 hours. I can’t shake the feeling groggy. \n\nSo if I don’t take it for those reasons, I’m stuck in a limbo. Sometimes I’ll get really exhausted at like 7PM and have to fight to stay up until a reasonable bedtime. And then if I’ve pushed myself to stay up later, I’m not tired anymore and I can’t fall asleep at all. \n\nDoes anyone else struggle with this? I’m having such a hard time finding a routine that works. If anyone else takes hydroxyzine (or something similar, like other antihistamines), how early do you end up taking it before bed so you don’t end up feeling groggy in the morning?",
        "created_utc": 1678667148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else can find themselves doing this?;",
        "author": "yer_maw22",
        "url": "https://www.reddit.com/r/ADHD/comments/11pumi1/who_else_can_find_themselves_doing_this/",
        "text": "When I’m procrastinating with something online, I often leave the tab open and just go and do other things. I feel stressed sometimes when I need to do something but have no motivated to do so, having it open makes me feel like it’s sorted and keeps reminding me of it because I’m scared I’ll forget. \nAnyone else do this specific thing?",
        "created_utc": 1678666688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Symptoms of recently prescribed medication",
        "author": "Ok-Maintenance4360",
        "url": "https://www.reddit.com/r/ADHD/comments/11puj9y/symptoms_of_recently_prescribed_medication/",
        "text": "Sorry if this is a redundant question and needs to be removed but honestly need some feed back from others while I wait for my doctors response. I started for the first time ever taking medication vyvanse 40 mg. I am having very encouraging results while medication is active however when it “wears off” or a day I don’t take it I’m having fluttering sensations in my chest. Any one else have this experience? Thanks .",
        "created_utc": 1678666452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Done (ADHD mgmt service) charging for access to medical records",
        "author": "ehmboh",
        "url": "https://www.reddit.com/r/ADHD/comments/11puaxl/done_adhd_mgmt_service_charging_for_access_to/",
        "text": "I use the online medical service Done to manage my ADHD and recently requested a digital copy of my medical records. I was told they would give them to me for $50, which I’m pretty sure is illegal. \n\nThe law provides for charging a reasonable amount to cover a cost incurred to provide physical copies but I’m asking for digital copies only. The legal code specifically mentions the example of charging $.50 per copied page or cost to mail papers. \n\nI pointed this out to them and they ghosted me.\n\nHas anyone had this problem with Done? What happened?",
        "created_utc": 1678665846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently diagnosed and feeling a bit lost",
        "author": "Ludania",
        "url": "https://www.reddit.com/r/ADHD/comments/11pu9iz/recently_diagnosed_and_feeling_a_bit_lost/",
        "text": "[removed]",
        "created_utc": 1678665744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forming better habits now that I have access to meds?",
        "author": "theoreticallyartsy",
        "url": "https://www.reddit.com/r/ADHD/comments/11pu4jj/forming_better_habits_now_that_i_have_access_to/",
        "text": "Hello! I’m a college student and was recently diagnosed with ADHD. I’ve tried a couple different meds in the past couple months, and now I’m a week into Straterra and am already seeing definite differences. Suddenly I feel much more awake and present, and every night this week I’ve had a hard time putting away my work and going to bed because I’m so hyperfocused on it. I’m excited to see the full effects in another week, when my doctor said it will have accumulated enough.\n\nOn the other hand, while it’s easier for me to get work done, my life is still built out of a precarious tower of shitty habits and dubious coping mechanisms. My room is a mess, and I cannot for the life of me get myself to do the damn dishes; I can never seem to leave on time and always end up 5-10 minutes too late to everything ever; I have zero habits built up regarding healthy eating, sleep, exercise, or self care. All of these things have been consistent problems for as long as I can remember and they have had huge negative effects on my life over the years.\n\nI know that meds aren’t an instant fix. I know I have to put in the work to re-write my habits. My question is… how do I go about doing that? Does anyone have any advice on how to break out of patterns I’ve been stuck in for nearly 2 decades? I really want to take advantage of these new meds to try to turn my life around, but I don’t even know where to start.",
        "created_utc": 1678665405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Following dreams?",
        "author": "Key_Scholar_1375",
        "url": "https://www.reddit.com/r/ADHD/comments/11pu08x/following_dreams/",
        "text": "Does anybody have any advice on how they began a new hobby or actually just took steps towards starting something new, for me it seems I have so many ambitions and things I’d like to do, it’s unclear to me what’s stopping me, I think I’m lazy, but I know I’m capable, I know if I start a new hobby I will kill it, I’ll be amazing and I’ll never stop trying, but it’s just getting started… I’m feeling really motivated lately, extremely motivated, it just seems like no matter what I do, I just find a way around starting new things.\n(Does this sound like adhd to you)\n(In the diagnosis stage)",
        "created_utc": 1678665086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the medication quiet the chatter in your head?",
        "author": "nicoleskine",
        "url": "https://www.reddit.com/r/ADHD/comments/11ptyts/did_the_medication_quiet_the_chatter_in_your_head/",
        "text": "I feel like when I first started Dex it was finally quiet in my mind. Later on after I started Sertraline I feel like it came back. I'm now on Vyvanse and it hasn't quietened down the racing and layers of thoughts in my mind. \n\nDoes anyone else have a similar experience of stimulants? I'm a bit worried that I might be on the wrong one or possibly even had a wrong diagnosis",
        "created_utc": 1678664994,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADDERALL Shortage - brand name in stock but so $$$$",
        "author": "jessbazanos",
        "url": "https://www.reddit.com/r/ADHD/comments/11ptx9e/adderall_shortage_brand_name_in_stock_but_so/",
        "text": "Anybody know how I can save money on brand name adderall from Walmart? \n\nThis shortage is so ridiculous! \n\nKind of unrelated but I’d been going to a small family pharmacy that’s been the only place that can get generic add but last month they wouldn’t accept my insurance for it any longer. Apparently the pharmacist had to start paying out of pocket for it from the manufacturer. He charged me $75 for a generic from the one manufacturer I HATE. The small white chalky melt in your mouth pills- I forget the manufacturer name atm but it’s the only one my pharmacist had on record that I cannot take. Didn’t tell me they had to get that manufacturers generic last month so I didn’t find out until I wasted $75 on it. \n\nNow I have a script ready to be filled at Walmart, where they consistently have in stock &gt; 100 brand name pills (why they keep telling me the amount they have, idk! Lol) But the cost is $125. my insurance pays half for name brands (full cost $250). I know that’s not a terrible price (for 30 30mg XRs) but I’ve been taking 45 mg per day of instant release generic for years and have never paid more than $7 for it. So frustrating. Is it worth paying the money for brand name even though it’s 15mg less per day? No pharmacy around me has instant release tablets. \n\nI’ve been completely off the medication for 15 days or so now so I’m wondering if it’s worth it to even fill this brand name script. I’m barely functioning without it but still feel better than when I took the generic add (chalky white pills). I’ll never take those again and my old pharmacist lost my business after pulling that fast one on me lol.\n\nOn a side note- anyone tried replacing an add script with modafinil??  Hear it’s much safer and more effective but my psych has never heard of it\n\nSeems like such a scam to make everyone get brand name meds knowing most insurance doesn’t cover them. I tried the lowest dose of generic Ritalin with awfully dangerous side effects &amp; vyvanse of course is $400 everywhere. Concerta has the same active ingredient as Ritalin so staying away from that one. There are literally no other alternatives! That I know of at least. Did I just get a terrible Ritalin manufacturer orrr?",
        "created_utc": 1678664878,
        "upvote_ratio": 1.0
    },
    {
        "title": "sharing some breakthroughs",
        "author": "hmwmcd",
        "url": "https://www.reddit.com/r/ADHD/comments/11ptw4i/sharing_some_breakthroughs/",
        "text": "TL;DR My theory is most hobbies that involve some kind of skill building have an easy mode and a hard mode. I want to identify what falls under both categories for my hobbies so that I can do easy mode for low energy evenings, or hard mode when I'm bored of easy mode. More details below: \n\nI feel like I may have seen this concept years ago somewhere, so hopefully I am not completely plagiarizing (to be fair to me though, I've also arrived at it independently! but feel free to share any videos etc that might have more info on this concept), but I wanted to share this is case it gets the gears turning for other people, that most of my hobbies/activities have an easy component and a difficult component; what I will now refer to as \"easy mode\" and \"hard mode\".\n\nActivities that involve learning skills to be able to do them is what I'm focusing on here. So, some examples:   \nPiano: easy mode is practicing songs I have already learned and am getting pretty good at; hard mode is learning a new song or technique.   \nPainting: easy mode is slopping colours onto the canvas/paper or palette and seeing what happens, or painting very simple shapes focusing on value; hard mode is ..... I'm new to painting, so it's anything else.   \nKnitting: easy mode is making a gauge swatch, or continuing on a simple project I've already started; hard mode is planning/calculating for a new project, actually starting said project, or continuing to work on a complex project. \n\nI won't get into details for every hobby because I have too many (lol). But this is the frame work I'm starting to look at these things with, and, moreover, writing down in a place I will see so that I remember later. \n\nI've arrived at this because I'm starting to realize that I have not been correctly identifying what boredom feels like. I think I thought that boredom was not knowing what I want to do, but I'm starting to understand that what it actually is for me, is not doing something with the right level of engagement/reward for my current energy level. \n\nWhat often happens is at the end of a work day I'm low on mental energy, and I'd like to engage in one of my hobbies but everything feels too hard, so scrolling on my phone becomes the default (sometimes with the excuse that it's \"research\"), and no progress is made, and no satisfaction is gleaned. But now I can sort of give myself permission to engage in a hobby on \"easy mode\", and I'll still get some level of reward from it! \n\nIt also seems like it will work in reverse; if I'm getting distracted while I'm on easy mode, then I am probably bored with easy and need to get into hard mode! \n\nI think I am also onto something when I think about things I see other people engage with that could fall under the category of \"easy mode\" except that the learning curve is either less steep or nil: eg puzzles, sudoku, tetris (Dr Mario for me!). I'm sure there are other examples. \n\nThe next step is how to remind myself of these concepts, haha. Also, a challenge is correctly diagnosing why I feel like I would like to do something but can't get started, meds notwithstanding or wearing off. \n\nBut I'm starting to feel like I've got this! Yay!",
        "created_utc": 1678664792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just took meds for the first time. I have a lot of mixed feelings",
        "author": "jonesbbq-footmassag",
        "url": "https://www.reddit.com/r/ADHD/comments/11ptnt8/just_took_meds_for_the_first_time_i_have_a_lot_of/",
        "text": "I’m on Focalin. It felt great. It was a lot easier to string sentences together. I didn’t feel that agitation, like someone is dragging my heels to work. I felt very, very good. Euphoric, even. It wore off around 5 hours in. Even though it has worn off, I still feel pretty energized and more lucid than I did yesterday.\n\nHere’s the thing. I’m 24 years old. I’ve been in antidepressants for years. I’ve been a neurotic, flighty, emotional, spacey mess my entire life. I feel like it’s a core part of my identity. It’s like I don’t know who I am if I am not struggling, and that is scary. It’s great to feel great, don’t get me wrong. Life was very easy this morning. I just… I don’t know. Somehow it still feels wrong to me. I’m a mess and that’s who I am. It’s very hard to not see myself as that person. I don’t know if this is making any sense. I don’t know how to feel at this point.",
        "created_utc": 1678664197,
        "upvote_ratio": 1.0
    },
    {
        "title": "my doctor switch me some ML 5 mg to vyvanse 10 mg. Any suggestions?",
        "author": "Gebashley24",
        "url": "https://www.reddit.com/r/ADHD/comments/11ptfsh/my_doctor_switch_me_some_ml_5_mg_to_vyvanse_10_mg/",
        "text": "Hi, my doctor made me switch because my unread was making me feel sleepy. I don’t know what my problem is, but I can literally take a nap a few hours after taking my Adderall, so she switched me to vyvanse 10mg. I have no idea how the switch is going to affect me. Is it possible I can open the vyvanse capsule and dump half of the medication out so that it’s around 5 mg until I know how it affects me? Has anybody had to make this switch before? thanks!",
        "created_utc": 1678663654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall vs Vyvanse?",
        "author": "Gebashley24",
        "url": "https://www.reddit.com/r/ADHD/comments/11ptdy8/adderall_vs_vyvanse/",
        "text": "[removed]",
        "created_utc": 1678663526,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can play video games, or scroll on Youtube for hours but for the life of me I can't bring myself to start a movie",
        "author": "waynefan77991",
        "url": "https://www.reddit.com/r/ADHD/comments/11pt9mi/i_can_play_video_games_or_scroll_on_youtube_for/",
        "text": "I used to watch movies quite a lot but since I started living on my own I haven't watched a movie in over 6 months. There are a lot of movies I want to watch but I just can't bring myself to commit to doing something for 2 hours straight even though I can easily spend 3 hours just scrolling on Youtube or Reddit. \n\nI can sometimes watch TV and I can usually get myself to play video games, though that was a struggle too, but because they are shorter, and or you an start/stop as you please for the most part it's easier. Has anyone else found a way to overcome this?",
        "created_utc": 1678663231,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with clammy/sweaty/grippy hands?",
        "author": "ComfortableFig6868",
        "url": "https://www.reddit.com/r/ADHD/comments/11pt68p/how_do_you_deal_with_clammysweatygrippy_hands/",
        "text": "Vyvanse makes my hands so grippy and clammy I hate it. I literally used to receive compliments about how soft my hands were lmao and now I feel like they’re rarely soft/smooth anymore, just grippy and clammy/sweaty. They are extremely annoying when I am using my laptop and the sweat builds up using the trackpad (playing games). Any cure? I haven’t thought to moisturize but feel like that wouldn’t work/ hold out?",
        "created_utc": 1678663000,
        "upvote_ratio": 1.0
    },
    {
        "title": "My financial mess (and not telling my partner about my debt...twice) may have destroyed my relationship + some major self-loathing going on tonight",
        "author": "an_anonymous_axolotl",
        "url": "https://www.reddit.com/r/ADHD/comments/11pt52f/my_financial_mess_and_not_telling_my_partner/",
        "text": "[removed]",
        "created_utc": 1678662924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wedding Planning has become my hyperfocus and I’m afraid it’ll start annoying people",
        "author": "1GirlWorld",
        "url": "https://www.reddit.com/r/ADHD/comments/11pszl6/wedding_planning_has_become_my_hyperfocus_and_im/",
        "text": "I have two years till my wedding but I can’t stop doing research and planning. I’ve read that talking about your wedding all the time with your partner is annoying. I’ve found a couple projects I’m trying to forcibly change my focus to, but it only works for a short time before I’m back to wedding planning. \n\nI’ve recently started playing Stardew Valley and that’s helped a little but I can’t always play it because I share my PS4 with my little brother. I already have started two other farms and really don’t want to start over with a whole new farm on PC or Mobile. \n\nI’m also working on a cosplay project but sometimes I’m just too exhausted mentally to work on it, even with a due date. \n\nAny techniques you’ve used to forcibly change your hyper-focus?",
        "created_utc": 1678662556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is cloudy brain part of ADHD? I can’t explain anything recently :(",
        "author": "Waywestjanestfamest",
        "url": "https://www.reddit.com/r/ADHD/comments/11psypo/is_cloudy_brain_part_of_adhd_i_cant_explain/",
        "text": "I cannot put my thoughts into words or remember basic things. I know this is normal, but recently at work I will be asked to explain a simple concept or a project I’ve just competed and I physically cannot remember what I’ve done or put the words together to string a single coherent sentence. It’s like my brain is completely muddled. I’ve always had this to some degree but in the past year it’s gotten so much worse. In a meeting, I was asked to share a single PowerPoint slide I worked on in the morning, I couldn’t explain it at all. I couldn’t even remember why I had to do it. I’m finding it difficult to explain anything or organise thoughts in my head. \n\nI can binge watch a show on Netflix and within 5 minutes of it ending, I couldn’t tell you what happened. I only remember the emotion of liking it disliking it\n\nAnytime I need to prepare a presentation at work, my brain is so cloudy now. Help!!",
        "created_utc": 1678662492,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a strong suspicion for ADHD-PI, and looking for advice/support",
        "author": "thesearcherofdawn",
        "url": "https://www.reddit.com/r/ADHD/comments/11psxez/i_have_a_strong_suspicion_for_adhdpi_and_looking/",
        "text": "I'll try to get to the point as quickly as possible. \n\nIm 16, in \"High School\" (not in US) and I have the  suspicion, that I might have ADHD-PI.\n\nCa. 1,5 Year ago I saw a YouTube video of someone talking about their ADHD-PI. Many of the symptoms the person described, felt oddly familiar to me. I just shrugged it off, because I thought, that everyone experiences these things. But since then I watch many videos about the topic and read many articles and reddit posts, and with every second I spent researching, my suspicion grew. \n\nOn the one hand, I can spend like 5 hours studying a random topic I am interested in, while on the other hand, I struggle to do an uninteresting task even for 5 minutes. I have great trouble concentrating. I often daydream, or zone out while talking to people. I forget to do stuff all the time. Chores, Deadlines, appointments...... These are just some I can list from the top of my head.\n\nI've been struggling with these things since I can remember. I always felt bad, and tried to better myself, but im stuck in a loop\n\nMaybe I am just a dumb, lazy, attention seeking kid in puberty, that's self diagnosing to feel important, maybe not. This is why I haven't told anybody in my life about my suspicion. I don't know how, or even **if** I should talk about it with my parents. I feel lost.\n\nI made this post, in hopes of getting some advice from someone out there, who might have experienced something similar like my situation, or at least tell me that I'm wrong.",
        "created_utc": 1678662399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stimulating date ideas?",
        "author": "Capable_Leaf",
        "url": "https://www.reddit.com/r/ADHD/comments/11psxd2/stimulating_date_ideas/",
        "text": "[removed]",
        "created_utc": 1678662395,
        "upvote_ratio": 1.0
    },
    {
        "title": "biting off more than you can chew",
        "author": "666itsroughouthere99",
        "url": "https://www.reddit.com/r/ADHD/comments/11psspo/biting_off_more_than_you_can_chew/",
        "text": "Sometimes when I come out of a depressive episode, I get a crazy burst of energy where everything seems possible. When I catch a wave like this, it's amazing! I feel like I can accomplish so much, and I often do! unfortunately in these moments I also have a tendency to ignore the limitations of my energy level, skill level, and overall inability to carefully plan things. I want so badly to capitalize on my momentum. This leads me to overextend myself, and impulsively take on on huge projects that I can't accomplish fully in the way I initially envisioned. Then the feelings of failure restart the cycle of anxious/depressive thoughts. \n\nI just wish I could figure out how to plan things carefully and map out tasks step by step. I try really hard to break things down into their simplest parts, but still feel overwhelmed and burdened by the looming \"big picture\" of any large task, or the task of life in general. Like what is the secret to creating a manageable set of goals ??? How do I reckon with these feelings when I can't do everything I set out to do at once??? Does anyone relate ??",
        "created_utc": 1678662088,
        "upvote_ratio": 1.0
    },
    {
        "title": "adderall afternoon booster?",
        "author": "RedditianDrew",
        "url": "https://www.reddit.com/r/ADHD/comments/11pssa5/adderall_afternoon_booster/",
        "text": "Hey guy, I 26M have ADHD and been diagnosed about 8 months ago, I was talking to my therapist and she asked me if I am able to get work done in the afternoon after my classes, I told her no, like I have class all day from 10-6pm and then take a little break and then try to focus on completing hw or project that was assigned for today and can't really seem to get it done, I think the meds I'm taking is just wearing off, I'm on adderall extended release, she suggest that I ask my doctor about getting a booster pill, which is ill take the regular medication of the extended release but then a little later after some time has passed maybe 4-6 hours I would take a booster pill to give me enough to go about and work on finishing my work and other things I wanna get done for the afternoon, does this work for you guys? How are you guys would are taking it with the booster able to get the work in the afternoon done? Are you guys able to have more time to get the things u need to do done? How is this affecting your health? Mental health, please any and all advice would be appreciated. Thank you for you time to read this of u did .",
        "created_utc": 1678662066,
        "upvote_ratio": 1.0
    },
    {
        "title": "I let my wife in on the hyperactivity",
        "author": "anonoman925",
        "url": "https://www.reddit.com/r/ADHD/comments/11psl9p/i_let_my_wife_in_on_the_hyperactivity/",
        "text": "We were talking in the car about my ADHD and I decided to demonstrate. I began just calling out all of the stuff I notice. We were passing by cars and I was like: white guy, older Hispanic guy, Ambulance three cars behind us, this turn stays green long, so I probably don’t have to slow, line at the Taco Bell on the left is 5 cars deep, oops 4, that one younger Hispanic kid just finished at the speaker….\n\nAnd I narrated what’s in my head for 3 or so minutes. \n\nI don’t know if I was right on what I was calling out, it’s not really the point. It’s just that I do this constantly behind a mellow demeanor. \n\n“Damn, you must sleep well at night.”\n\n“Babe, do I?  I can’t turn this off. Imagine at night this energy but with just thoughts”",
        "created_utc": 1678661597,
        "upvote_ratio": 1.0
    }
]