[
    {
        "title": "anyone recommend a specific portable washing machine they use?",
        "author": "AccomplishedList2122",
        "url": "https://www.reddit.com/r/ADHD/comments/11pskia/anyone_recommend_a_specific_portable_washing/",
        "text": "i moved into a place with a W/D in the basement and its turned my laundry life into a huge disaster. even though it seems ridiculous and expensive to pay for an apartment portable washer, i'm thinking i should try it because this has been a nightmare. i see reviews for some on amazon, but who can trust those anymore. i would pay up to 250 for one if it will last and work and not break in a month. i need to wash dirty outdoor work clothes. any one can recommend?\n\nthanks.",
        "created_utc": 1678661547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyperfixations tend to be active in the face of deadlines and exams?????",
        "author": "MediumAd2241",
        "url": "https://www.reddit.com/r/ADHD/comments/11psiri/hyperfixations_tend_to_be_active_in_the_face_of/",
        "text": "[removed]",
        "created_utc": 1678661436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strattera: When will sexual function return?",
        "author": "FinallyFlowering",
        "url": "https://www.reddit.com/r/ADHD/comments/11pshrx/strattera_when_will_sexual_function_return/",
        "text": "Hi everyone, started taking Strattera for ADHD, only did maybe 6-7 pills (once per day) of 18 mg and yet as soon as the sexual side effects came up I stopped (ED, retrograde ejaculation, decreased sensitivity/ability to orgasm, low libido).\n\nThe mental libido part has come back, but I still struggle with the physical sexual issues like retrograde ejaculation. How long does it take for these to go away/return to normal? Thanks",
        "created_utc": 1678661378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall makes me talk like HELL",
        "author": "meme_master_meme",
        "url": "https://www.reddit.com/r/ADHD/comments/11pseqh/adderall_makes_me_talk_like_hell/",
        "text": "I got prescribed adderal 30 xr and holy shit I don’t know if I got misdosed or what cause I’m talking a storm to everyone. My family, my friends, random strangers at the gym. I just went to the gym with my friends for 4 hours and they left within 1 hour because I had the urge to stay and talk to every one I saw. When I got back with my friends at there place I started talking about everything from the prehistoric age to every war within recent history. I am not focused at all I am the exact opposite. Every little thing about life is interesting and it’s pretty cool.",
        "created_utc": 1678661174,
        "upvote_ratio": 1.0
    },
    {
        "title": "not diagnosed, but everyone (including myself) thinks I am",
        "author": "KimJonhUnsSon",
        "url": "https://www.reddit.com/r/ADHD/comments/11psd3v/not_diagnosed_but_everyone_including_myself/",
        "text": "Hi all!\n\nAlways had difficulty focusing at school, ended up dropping out because it became so stressful. Always been a terrible procrastinator, always leaving things till last minute. I don't mean to do it, but it's affecting my everyday life.\n\nI went to my GP about it, and they made me do a test. I scored pretty high on this test, and she told me she has no doubts, and booked me in to see a psychiatrist.\n\nI completely forgot when the appointment was, but I got a call last week saying I had missed it. I couldn't go anyway, because I keep spending money on dumb things and can't save.\n\nI get so distracted all the time, people have deep and meaningful conversations with me and I end up zoning out or forgetting what they said to me. My girlfriend thinks I'm not mature because I can't take anything seriously. \n\nI always over-explain things to the point where both myself and the person I'm talking too end up confused. I'm doing a trade, and am almost a tradesman, but I feel like I can't get any job done on time because I just overthink every little aspect all the time.\n\nDoes anyone know if there is a telehealth version of a psychiatrist in Australia?",
        "created_utc": 1678661066,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I'm trying so hard and I can't help myself be even stable, let alone happy or successful",
        "author": "Draferr",
        "url": "https://www.reddit.com/r/ADHD/comments/11pscma/i_feel_like_im_trying_so_hard_and_i_cant_help/",
        "text": "[removed]",
        "created_utc": 1678661034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need ADHD friendly meal prep ideas!",
        "author": "FallyWaffles",
        "url": "https://www.reddit.com/r/ADHD/comments/11psc86/need_adhd_friendly_meal_prep_ideas/",
        "text": "I'm currently unmedicated, waiting for my pharmacy to get Elvanse back in stock, and the last week and a half I have binge-eaten myself half to death on chocolate, ice cream, crisps, and biscuits. It's awful. I've actually managed to lose 45lbs over the past couple of years and I'm terrified of it creeping back on, so I know I need to prepare - but I need help! So far I've managed to meal prep a big batch of (vegan) spaghetti bolognese that yields 4 servings, and I've been able to do that every week, but I know I need more prepared things to eat than a couple of dinners each week. So any ideas you can share with me would be great!\n\n* vegan friendly pls\n* I'm in the UK\n* overwhelmed by too many ingredients/steps\n* I'm trying to keep to 1400 cals per day (I'm only 5'2 and sedentary)",
        "created_utc": 1678661007,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate being a jack of all trades",
        "author": "sunnysideHate",
        "url": "https://www.reddit.com/r/ADHD/comments/11ps7c2/i_hate_being_a_jack_of_all_trades/",
        "text": "I don't care if the saying says being a jack of all trades and a master of none is still better than a master of one. I hate this. I hate collecting hobbies and obsessing over something for a week maybe two only to drop it for something else. I hate that I can't focus on something unless it's a feral hyperfixation. I don't just want to be good at things, I want to be ***great*** at something. I want to be able to make fantastical paintings or write a novel or make a game, I want to *do something.* But I can't. I can't because I can only focus long enough on a skill to get the very basics before I no longer want anything to do with it and completely ignore it for 6 months minimum before picking it back up again only to realize I'm back to where I started. I'm so sick of \"how to draw for beginners\" because I know I'm not a beginner! I've done this for years! So why can't I just progress past novice in anything I do?! \n\nIt's just frustrating because people around me get really good at things because they love what they do and I want that so badly. But I just can't do it.",
        "created_utc": 1678660681,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so sick of this shortage.",
        "author": "itstimetobeatbpd",
        "url": "https://www.reddit.com/r/ADHD/comments/11ps0yg/i_am_so_sick_of_this_shortage/",
        "text": "I was one of the first people to be impacted by the shortage. So I haven't had my meds in months. I have been struggling like crazy. Well last month it finally got filled and I was so happy. I finally could function and do the things I needed to do. Well guess what, they are out of stock again for this month. I dont even understand how that is possible. How can you have it for one single month and then nothing again. I feel like I was lied to and seen as an addict just because I asked. \n\nI am so beyond frustrated with this. I dont even know how to feel. I am just a huge ball of mixed emotions. I want this to be over with so that I can function like everyone else. Is that too much to ask for? Gah!",
        "created_utc": 1678660256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non prescription booster ideas",
        "author": "Expensive-Garlic-651",
        "url": "https://www.reddit.com/r/ADHD/comments/11prxbv/non_prescription_booster_ideas/",
        "text": "[removed]",
        "created_utc": 1678660019,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t think therapy is helping me and idk what to do",
        "author": "Ferocious_Kittyrose",
        "url": "https://www.reddit.com/r/ADHD/comments/11prunq/i_dont_think_therapy_is_helping_me_and_idk_what/",
        "text": "I’ve been going to therapy for over two years and I don’t see the point anymore.\n\nI go in they ask what I’ve been doing, I tell them, they ask if I’ve felt anxious, I say “yes” and explain why I felt anxious and what I did to get over it, they ask if I’ve felt focused, I say “I don’t know”, and that’s it. That’s all it’s been for years.\n\nThe only good piece of advice I got was to stop beating myself up for not going back to college because I can’t afford it anyway. But other than that I feel like I’ve been paying to give biweekly updates about my life to a brick wall.\n\nThey’re trying to teach me about mindfulness and I’m sure it works for some people, but fuck it does nothing for me and it’s pissing me off.\n\nIt’s all about acknowledging your thoughts and emotions and controlling your emotional response, but I already do all that, and it doesn’t help anything. I know how I feel, and why I’m feeling it but I’m not just gonna stop feeling it. I’m not choosing to feel it, and I can’t choose to stop.\n\nThey say shit like “you have to acknowledge that getting angry won’t help anything,” oh, no shit Sherlock, but newsflash, that doesn’t make the anger go away does it?\n\nThey say “you need to slow down and think about why you’re getting frustrated,” I know why I’m frustrated, and if I slow down and think about why I’m frustrated, it’s just going to make me more fucking frustrated.\n\nAnd wtf does it mean to “let go” of an emotion? If I could I would. If I could let go of my depression I would throw it halfway across the Pacific Ocean. But that’s not how things work. You can’t just acknowledge that you’re sad, reason out why you’re sad, and then just decide not to be sad anymore.\n\nAnd fuck meditation, it does nothing but make me bored, uncomfortable, and irritable.\n\nAll of this shit is doing nothing but making me more miserable. And the cherry on top is that I’m paying for all this shit. I’m actively paying to make my life worse.\n\nIdk what I’m supposed to do now. I’ve tried to be open minded and be willing to get better but it’s just getting worse. If therapy isn’t giving me any tools or advice I can use to help myself, then wtf am I supposed to do? Am I just stuck like this?",
        "created_utc": 1678659841,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Work in Progress Pile",
        "author": "ThisNerdsYarn",
        "url": "https://www.reddit.com/r/ADHD/comments/11prsfs/my_work_in_progress_pile/",
        "text": "[removed]",
        "created_utc": 1678659685,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is other people’s input in your diagnosis?",
        "author": "Astroadhd",
        "url": "https://www.reddit.com/r/ADHD/comments/11prmwl/how_important_is_other_peoples_input_in_your/",
        "text": "Hi, I’ve got my NHS ADHD assessment in a few weeks, and as part of that my mum had to fill in a questionnaire about what I’m like now/what I was like as a kid. I chose her because she made the most sense as someone who’s seen me at each life stage, but she’s also one of those people that thinks adhd is massively over diagnosed and she doesn’t really think I can have it (or my brother, who recently got asked to start the diagnosis process by his university after he scored really high on a questionnaire they make everyone do). She didn’t really notice me struggling as a kid, or thought it was just a lack of effort on my part when I did. I’m able to see the way she filled out my form and she didn’t tick yes for many of the questions, and when she did she didn’t go into much detail or any examples really. Is this likely to affect my chance of getting diagnosed? I obviously want an accurate diagnosis and told her to just fill in the form as truthfully as she could, but I’m now worried it could lead to me not diagnosed when I should be as she ticked no to a lot of questions I ticked yes to. Sorry if that doesn’t make sense, I’m nervous and want everything to go smoothly and be accurate.",
        "created_utc": 1678659330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Run around",
        "author": "MeowMistiDawn",
        "url": "https://www.reddit.com/r/ADHD/comments/11prmez/run_around/",
        "text": "Is it common to have to try pretty much every SSRI before any ADHD medication? \n\nI’m on my second kind in 5 years. They do nothing but make me gain weight and never move off the couch. I never feel better. I feel like I’m screaming in to space only to get bounced around dr to dr. I’m so fucking frustrated.",
        "created_utc": 1678659303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fidgeting - weight gain",
        "author": "Focus-Wrong",
        "url": "https://www.reddit.com/r/ADHD/comments/11prjt4/fidgeting_weight_gain/",
        "text": "I started 20mg Elvanse (Vyvanse) two days ago and my fidgeting has virtually ceased. It just…stopped. At first I was incredulous, now I’m slightly panicky that I’m going to start putting on weight bc I used to fidget A LOT. I would tap my foot aggressively while working, for example. Did anyone experience weight gain after stopping fidgeting? I’m aware that Elvanse should curb my appetite but so far I’m still eating a decent amount (just craving way less chocolate). 54kg/164cm.",
        "created_utc": 1678659134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a possibility that I have ADHD?",
        "author": "Lapralapso",
        "url": "https://www.reddit.com/r/ADHD/comments/11priaj/is_there_a_possibility_that_i_have_adhd/",
        "text": "I'm not expecting a professional diagnosis, I am mostly just looking for advice to see if what I am dealing with is enough to go to a professional and get *actually* diagnosed.\n\nOne thing I have a hugely hard time with is studying.\n\nWhen I study, and I solve a question and have pretty much completely understood it, a part of my brain feels clogged and there is a literal *pressure* in my head that I can feel because a small part of my brain is going \"but DO you really understand it? DO you? What if you don't?\". Sometimes it leads to me reviewing the exact same question and over and over again repeating the study of a single topic to try to appease that feeling, but the feeling doesn't go away a lot of the time and it leads to me wasting a lot of time on a topic I ALREADY DO KNOW but my brain is overthinking it and is making me self-doubt my knowledge .\n\nI honestly feel like this is a sign of a deeper issue because a lot of the time my brain feels clogged when doing work and it's like there's a literal wall not letting me move on from a topic to study the next. It's like I ignore the fact that I've done questions over and over again on the topic and have proven to myself that I *can* do it and my brain has an immense need to repeatedly and obsessively go over it again and again to \"make sure\" I really **do** understand it.\n\nAnother thing is my extreme hyper fixations. I rarely get encompassed in any hobbies or games, but when I do, my God all my self control disappears. I basically forget about my school life if I get into a good story game because I **MUST FINISH IT.** I recently picked up astrophotography as a hobby and even though I know it's wrong to go out and take photos before I finish my school work, I just ignore the school work anyway and go out, casually feeling **zero stress** about the fact that I just gave myself more work for the next day.\n\nThat zero stress thing is also another huge issue. A lot of people study because they are stressed for a test. Nope. Not me. Even an HOUR before a test, if I hadn't studied for it, I still don't feel any stress. If I do bad? I stress a little, and tell myself \"I should go study more next time\", but then next time comes and I don't feel any sense of urgency at all to study, and I don't know why. It makes actually getting up and studying so difficult.\n\nI have always had a feeling I may have ADHD due to my hyper fixations on other things as well as pretty bad self control. Is this more evidence or am I once again overthinking it?",
        "created_utc": 1678659042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Affordable ADD meds to pair with Wellbutrin?",
        "author": "zuch4n",
        "url": "https://www.reddit.com/r/ADHD/comments/11pre9q/affordable_add_meds_to_pair_with_wellbutrin/",
        "text": "I have pretty bad ADD. I've been on 300mg Wellbutrin XL for the past 5 years (primarily to treat my major depressive) and it's helped a little bit with the ADD. however, my ADD is still pretty bad. I've been prescribed Vyvanse but can't afford it. Any affordable meds y'all recommend? (Just padding my post to reach 300 chars)",
        "created_utc": 1678658792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Affordable ADD meds to pair with Wellbutrin?",
        "author": "zuch4n",
        "url": "https://www.reddit.com/r/ADHD/comments/11praei/affordable_add_meds_to_pair_with_wellbutrin/",
        "text": "[removed]",
        "created_utc": 1678658543,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i deal with the anxiety caused by vyvanse (elvanse)",
        "author": "Witty_Gate1192",
        "url": "https://www.reddit.com/r/ADHD/comments/11pr4pc/how_do_i_deal_with_the_anxiety_caused_by_vyvanse/",
        "text": "Honestly these meds do help quite a lot with focus but my gawd do they make me paranoid some times. When I'm at the gym I will think everyone is looking at me and staring at me and what not. Then I will get physical anxiety as well, like tight chest and shakyness (I don't have any heart problems, so it's diffs anxiety). \n\nIt's really fustrating because they do help me get stuff done and before now I'd just be comfortable with not doing anything and watching youtube or films all day lol. But honestly the anxiety is starting to make it feel like it isn't worth it. Like today I didn't take it and I felt fine and went gym and wasn't paranoid or being anxious, I kind of just enjoyed my adhd self lol. \n\nI've tried eating a heavy protein meal which i guess some what helps and i drink enough water. When I'm coming down I try to exercise....but being public with this stuff just makes me paranoid lol. I don't know what to do. I have general anxiety anyway, so maybe I need to deal with that? I'm not sure I want to take an antidepressant though. \n\nIf anyone has any advice or if you can relate to this at all please let me know cause I'll feel a lot less lonely about it lol.",
        "created_utc": 1678658182,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been MIA and not sure what to say to my loved ones",
        "author": "seanna_lee",
        "url": "https://www.reddit.com/r/ADHD/comments/11pr1n8/ive_been_mia_and_not_sure_what_to_say_to_my_loved/",
        "text": "[removed]",
        "created_utc": 1678657983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird Pressure in Head on Adderall IR",
        "author": "williamwitchdrdotcom",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqvfm/weird_pressure_in_head_on_adderall_ir/",
        "text": "My doctor recently prescribed Adderall IR for me. It has so many positives for me. It seems to make all the chaos that's usually in my mind finally quiet down into one easy to follow line of thinking, it seems to help with being able to regulate my emotions and of course to be able to focus at work. The only side effect I'm having though is a very uncomfortable one for me. It makes me feel an immense amount of pressure in my head that lasts for quite a long time. It almost feels like having sinusitis with how it makes my head feel heavy but the pressure feeling is all around my head, front to back. I was just wondering if anyone had an explanation for this side effect, experienced something similar or if anyone has any advice? I spoke with my doctor about this side effect and he reduced the initial dose but didn't have an explanation to offer for why this is happening. The new dose has the same effect. Thank you.",
        "created_utc": 1678657583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insomnia on Adderall XR",
        "author": "Username_for_2020",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqs49/insomnia_on_adderall_xr/",
        "text": "[removed]",
        "created_utc": 1678657366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever hyperfixate on something you hate?",
        "author": "gaanym3de",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqrvg/do_you_ever_hyperfixate_on_something_you_hate/",
        "text": "So lately I literally have been literally hyperfixating on my LEAST favorite character--I absolutely despise them, they're insanely morally corrupt, and I hate them with burning passion. But they still infect my thoughts and I ended up making a lot of content of that character I usually only do with my favorites, and I don't understand why I'm so stuck on this character even though I HATE them. It's like my brain wants me to constantly ramble and think about how disgusting they are, which is so weird because it's the opposite of what I usually do. Has anyone else ever gotten this, where they hyperfixate on someone/something they hate?",
        "created_utc": 1678657350,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel so stuck and don’t know what career path",
        "author": "Inevitable-Goal-6226",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqqmx/i_feel_so_stuck_and_dont_know_what_career_path/",
        "text": "[removed]",
        "created_utc": 1678657270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fast eating &amp; ADHD",
        "author": "AE17PROPHET",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqo8i/fast_eating_adhd/",
        "text": "[removed]",
        "created_utc": 1678657112,
        "upvote_ratio": 1.0
    },
    {
        "title": "IEP Assignment Help",
        "author": "chriscb229",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqnio/iep_assignment_help/",
        "text": "[removed]",
        "created_utc": 1678657063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fast eating &amp; ADHD",
        "author": "AE17PROPHET",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqlg0/fast_eating_adhd/",
        "text": "[removed]",
        "created_utc": 1678656925,
        "upvote_ratio": 1.0
    },
    {
        "title": "IEP Example Request",
        "author": "chriscb229",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqkn3/iep_example_request/",
        "text": "[removed]",
        "created_utc": 1678656875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wellbutrin killed my ASMR tingles",
        "author": "Able_Bug_76",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqkmh/wellbutrin_killed_my_asmr_tingles/",
        "text": "[removed]",
        "created_utc": 1678656873,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been taking adhd meds for 8 years i need help",
        "author": "JealousDinner4723",
        "url": "https://www.reddit.com/r/ADHD/comments/11pqajo/i_have_been_taking_adhd_meds_for_8_years_i_need/",
        "text": "Hello, I just found this amazing community and I didn't know the repercussion of the effects of ADHD medications, I thought that I was the problem and that there was no solution. After so much time that my doctors have been medicating me (more and more without explanation) I have been having severe anxiety problems, i need help from people that actually have been throught this. I used to take adderal but I started taking vyvanse 70mg and then my doctor prescribed me vyvanse 100mg with guanafacine 2mg, later I have also tried sertraline 150mg and equasym 30mg. For a while I was so medicated that I forgot who I was and developed a school phobia due to my high levels of anxiety (it was really bad), and I was telling my doctor my problem: insomnia, feeling really tired everytime, anxiety, having trouble to focus and he just keep giving me more and more instead of decreasing my meds.  I want to start from 0 but I don't know what to do I NEED YOUR HELP GUYS. I am a person with a very strong adhd (i dont know if i can say that lol) but i have met people with adhd and they dont have trouble with anxiety or concentrating once they start taking the meds, i also have a lot of hipeactivity and impulsiveness. I am  just 18 years old and i know that the meds dont do magic and have lots of side effects but i want to keep having them but the right ones, I WANT TO LIVE PROPERLY WITHOUT MY ADHD AFFECTING ME SM. Now I'm taking 50mg sertraline (anxiety has gone down a lot more), I've stopped taking guanafacine since I don't think it does much for me and it doesn't even help me sleep and now I'm between vyvanse or adderal. What do you recommend?",
        "created_utc": 1678656214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please check your recurring expenses quarterly!",
        "author": "Dax-Million",
        "url": "https://www.reddit.com/r/ADHD/comments/11pq4p9/please_check_your_recurring_expenses_quarterly/",
        "text": "I’m a cautionary tale today. I realized today that I’ve been paying ancestry.com $42/month since 2020 after signing up for a free trial for a project I was working on. Cost me $1k over 2 years.\n\nDon’t be like me. Set a reminder to check your statements.\n\nReally disappointed in myself bc I’m generally good (now) at keeping to a budget and paying all my bills on time.",
        "created_utc": 1678655834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overthinking is driving me crazy",
        "author": "BugggyBrain",
        "url": "https://www.reddit.com/r/ADHD/comments/11pq0mr/overthinking_is_driving_me_crazy/",
        "text": "[removed]",
        "created_utc": 1678655558,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you plan events?",
        "author": "taintedlove244",
        "url": "https://www.reddit.com/r/ADHD/comments/11pq005/how_do_you_plan_events/",
        "text": "So I've been trying to set up livestreams and patreon events, and I feel like I just can not get organized? This happens every time I want to plan something or make a schedule, I just can't it feels like.... I don't understand how people are able to be leaders or planners, I'm much better at the aesthetics part. Whats a format that would help me organize? or establish some kind of stability so I'm not a coordinator who doesn't do enough? I'f get staff or friends but non of my friends are really good at that stuff, and if they are their already extremely busy 😔",
        "created_utc": 1678655515,
        "upvote_ratio": 1.0
    },
    {
        "title": "An unorthodox way of using Focusmate",
        "author": "Pitiful-Version9265",
        "url": "https://www.reddit.com/r/ADHD/comments/11ppsod/an_unorthodox_way_of_using_focusmate/",
        "text": " Traditionally, people using Focusmate will state specific goals before each session. However, I've found an unorthodox approach that works for me. Instead of setting specific goals, I commit to doing a streak of chores or tasks, like cooking or cleaning up the apartment. This way, I allow my ADHD brain to take over and get distracted by other tasks if necessary. Of course, certain tasks like cooking require more focus, but I make sure to attend to them properly.\n\nFor work projects, I take a slightly different approach. I don't always have specific goals in mind, but I know I'm working towards a project. Currently, I use 25-minute sessions and work on deliverables, which are specific and measurable goals used in companies. I keep doing sessions until I reach a deliverable, which may emerge as I work on the project. For example, I might add a feature to a dashboard, which can take a considerable amount of time depending on the circumstances.",
        "created_utc": 1678655026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice- dating issues (rejection sensitivity dysphoria)",
        "author": "Prudent_Log1528",
        "url": "https://www.reddit.com/r/ADHD/comments/11ppruk/need_advice_dating_issues_rejection_sensitivity/",
        "text": "in short, dating or even considering dating is extremely difficult for me. I am female and even though I’ve not been rejected I have this intense fear of being, and in situations where I haven’t been rejected but feel like I have been I almost feel like I have a severe emotional reaction. \n\nThere has been 2 situations where this has happened- the first where an individual was interested in me but gave off mixed signals. Then he ended up getting into a relationship with his friend and forgot to reply to one of my messages. I felt intensely bothered by this for a long long time. \n\nThe second was more recently and even though in some ways I am processing things a little better things still get to me. There was someone I matched with ages ago, then I bumped into at work. He later messaged me when we matched again and was clearly interested. Then we both left the same company and I messaged him recently to say that I had left as well. \n\nIn short, he asked for my number and asked me out for food. All was going well, exchanging pet pics etc lol. But then it culminated that I work with his mother in one of my jobs. At first I was extremely uncomfortable by this but then a family member said as long as professional boundaries are maintained, it shouldn’t be an issue. He didn’t reply for a few days then told me he hoped I find what I’m looking for and to delete numbers etc. \n\nI got a bit shocked by this as it sort of came out of the blue so I just blocked him on everything. I was intensely paranoid that he would tell his mum (silly I know lol) then other people I worked with would find out and I felt extremely embarrassed. Obviously he felt bothered by the work connection and ended communication for this reason but I am bothered because : \n\nA) what if this isn’t the reason and it is something to do with something he has heard about me from his mother, or something to do with my physical appearance\n\nB) my intense lack of relationship experience really bothers me and for once I felt like maybe I had found something worth pursuing- what it could have been \n\nC) after reassurance from a family member that it wasn’t that big of a deal, I replied enthusiastically to date plans. I now feel even more embarrassed about my perceived rejection \n\nD) others in my workplace finding out such as his mother and judging me negatively \n\nHow can I view situations such as these differently? Would you view this as rejection? And would you feel uncomfortable if you worked with a potential dates family member? \n\nThanks",
        "created_utc": 1678654969,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do SSRIs affect someone with ADHD?",
        "author": "International-Dot-34",
        "url": "https://www.reddit.com/r/ADHD/comments/11ppcaf/how_do_ssris_affect_someone_with_adhd/",
        "text": "Hi everyone,\n\nSo I decided while I was on my medication right now that I'd get on here and do something productive and ask a pretty broad question that maybe someone on here has some experience with and can give me some insight on. I have always wondered how my SSRI use has impacted my symptoms, because I have taken it for almost 10 years at this point (Zoloft) and can't help but feel like it may actually have some influence on my symptoms due to how serotonin seems to alter dopamine, and this is especially important since people with ADHD usually have lower levels of dopamine. Could this cause my symptoms to be even worse? \n\nIn the research I have done on the topic, it appears SSRIs can aggravate ADHD symptoms, based on several studies. The reason I was put on an SSRI 10 years ago was because of my ADHD symptoms that caused poor school performance and problems with my home life, relationships, etc. This eventually (in my opinion) led to low self-esteem and eventual depression, for which I was given an SSRI. The depression did disappear, but the symptoms of ADHD did not seem to resolve, as I still heavily struggled in school and at home due to hyperfocus on things like video games. The low self esteem did not seem to fully resolve, and I think this gaming was an escape for me to be able to escape from what I had been told over the years such as \"you aren't trying enough, you aren't applying yourself, and you're smart, so act like it\". I ended up going undiagnosed for ADHD for 5 years after I was diagnosed with depression, for which I was given Adderall (which I still take today), and then grades finally began to improve consistently.\n\nSo basically, two questions: How do SSRIs interact with ADHD (especially in the absence of stimulant medication) and based on what I described, wouldn't it make sense that the depression was actually just a result of downstream untreated ADHD? I've heard this is actually very common and why ADHD is misdiagnosed as depression so often.\n\nThanks!",
        "created_utc": 1678653939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books or podcasts that were legitimately impactful for you?",
        "author": "Britt_Nikole",
        "url": "https://www.reddit.com/r/ADHD/comments/11pp61y/books_or_podcasts_that_were_legitimately/",
        "text": "[removed]",
        "created_utc": 1678653530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving My Son - Why I wrote the book and started Hello Health by Pamela Wirth - from Detox to Infections to Mood Disorders with a Happy Ending",
        "author": "hellohealth1",
        "url": "https://www.reddit.com/r/ADHD/comments/11pp39g/saving_my_son_why_i_wrote_the_book_and_started/",
        "text": "[removed]",
        "created_utc": 1678653340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is This An ADHD Symptom?",
        "author": "EmptyLevel6637",
        "url": "https://www.reddit.com/r/ADHD/comments/11pp38a/is_this_an_adhd_symptom/",
        "text": "I am trying to get my wife to finally seek treatment  for her ADHD. One thing that I feel makes it necessary is I see constant patterns in her behavior that interfere with things. One that happened today is when we have something important to do or we are going somewhere she decides that is the time she needs to do a lot of other unnecessary tasks. She will start cleaning or cooking and will say can we just wait an hour. I describe it as \"I am ready to go, but can we just do nine small things first?\" Does anyone else's have similar patterns, and what do you do about it? Thanks.",
        "created_utc": 1678653338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discord server",
        "author": "Sad-Glove3404",
        "url": "https://www.reddit.com/r/ADHD/comments/11poyag/discord_server/",
        "text": "[removed]",
        "created_utc": 1678653024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supplemental Stimulant with Vyvanse",
        "author": "jubjub89",
        "url": "https://www.reddit.com/r/ADHD/comments/11poqe2/supplemental_stimulant_with_vyvanse/",
        "text": "I have been on 40mg Vyvanse for several years now which has been great, but with my job, I sometimes have to work 16-18 hour intensely focused days.  I find a hit a crash at 2pm (I'm up at 4:30 AM) and often have 4-5 more hours to go.  Does anybody have experience with supplemental stimulants when your Vyvanse wears off?",
        "created_utc": 1678652512,
        "upvote_ratio": 1.0
    },
    {
        "title": "newly diagnosed feeling lost",
        "author": "Mr-mighty-vape",
        "url": "https://www.reddit.com/r/ADHD/comments/11poq5x/newly_diagnosed_feeling_lost/",
        "text": "[removed]",
        "created_utc": 1678652498,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a mess: I’m overwhelmed by it all.",
        "author": "butareyoumayonnaise",
        "url": "https://www.reddit.com/r/ADHD/comments/11poiu8/im_a_mess_im_overwhelmed_by_it_all/",
        "text": "[removed]",
        "created_utc": 1678652024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Child ADHD Struggles with Chinese Mother",
        "author": "ConanTheBurberrian",
        "url": "https://www.reddit.com/r/ADHD/comments/11pogdp/child_adhd_struggles_with_chinese_mother/",
        "text": "Curious what to do here. My son (9yr) has been on focalin 5mg for 2 weeks now. My Asian/Chinese wife has suddenly gone back on the decision to use medication. She thinks it’s bad for his heart and he just lacks discipline and attention from us.\n\nI take ADHD meds (Adderall) since about 21yo and it’s changed my life. She’s decided that since I’m still using it it’s a life sentence and she doesn’t want that. I don’t know what to say here.\n\nMy son has pretty poor self esteem and is socially anxious. I was like this as a child and the meds are a godsend. In fact I think my son has RSD and other meds (Intuniv/Guanfacine) would be helpful. I may even try them myself.\n\nI’m not sure what to do here. Divorce and medicating on my own is a serious consideration if I see this not improving. I know what it was like growing up with untreated adhd and it sucked.",
        "created_utc": 1678651867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always forgetting to drink water",
        "author": "passive_pepper",
        "url": "https://www.reddit.com/r/ADHD/comments/11pof9q/always_forgetting_to_drink_water/",
        "text": "I don’t know if this is common or not, but it’s something I’ve been trying to get better at since I’m on meds now. I’ve always been bad at drinking water. I generally just don’t like it much and I don’t really get thirsty so I forget. I only find myself getting thirsty while exercising. As far as daily fluid intake goes, I usually have a coffee and maybe some juice, and in pretty sure the coffee doesn’t count lol. I always have a water bottle with me and I have it on my desk when I’m working/ at school, but it’s usually still full by the end of the day minus maybe a couple sips. I guess I just forget it’s there or don’t want to bother unscrewing the kids or something.\n\nI was just wondering if anyone else has a similar experience and what might’ve helped?",
        "created_utc": 1678651799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adhd and cerebral palsy (mild)",
        "author": "Ok_Doctor5774",
        "url": "https://www.reddit.com/r/ADHD/comments/11po8gc/adhd_and_cerebral_palsy_mild/",
        "text": "[removed]",
        "created_utc": 1678651342,
        "upvote_ratio": 1.0
    },
    {
        "title": "On a roll a want to keep it going, I NEED pointers.",
        "author": "whitechocolatemama",
        "url": "https://www.reddit.com/r/ADHD/comments/11po1yp/on_a_roll_a_want_to_keep_it_going_i_need_pointers/",
        "text": "The spring cleaning bug (aka I woke up completely sick of living in piles os clutter) has bitten me and I'm making good progress but I've hit the point of things feeling tedious and I'm loosing interest and getting distracted easier and easier as time goes. Anyone have ways to help that feeling? I do have my shoes on and not taking them off til I'm done, I have music going, caffeine in me but I'm unmedicated currently SOOOOOOO yeah LMAO. \n\nAlso when you're going through and purging for trash and donations what's the best way to collect the trash and get it to the dumpster without using 6,927,225 trash bags (I know you didn't read that number). I was thinking a box and just carry and dump it whenever it's full but not sure.\n\nThanks y'all!",
        "created_utc": 1678650924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adhd and cerebral palsy",
        "author": "Ok_Doctor5774",
        "url": "https://www.reddit.com/r/ADHD/comments/11po0zh/adhd_and_cerebral_palsy/",
        "text": "[removed]",
        "created_utc": 1678650860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else always forget to drink water?",
        "author": "passive_pepper",
        "url": "https://www.reddit.com/r/ADHD/comments/11po0d8/anyone_else_always_forget_to_drink_water/",
        "text": "[removed]",
        "created_utc": 1678650820,
        "upvote_ratio": 1.0
    },
    {
        "title": "learning a new love language with ADHD",
        "author": "Number1tigra",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnzyt/learning_a_new_love_language_with_adhd/",
        "text": "My love language leans more towards physical touch and words of affirmation. I am working on building my acts or service skills along with spending more quality time. This is difficult for me because I struggle with motivation.  What are some ways you show acts of service towards a loved one? Also, what are some things you do to build quality time while also raising children and working full time? I am proud of myself today. I prepared his favorite food. Later we are going to play a family game. These things seem simple, but I have been so complacent, and I tend to withdraw and spend more time in my own world mentally .",
        "created_utc": 1678650795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shy ADHD-C people, which med and dose worked for you?",
        "author": "adhdlatebloomer7298",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnv2h/shy_adhdc_people_which_med_and_dose_worked_for_you/",
        "text": "For people who grew up quiet and shy, but were actually adhd-c, which meds worked for you? I was always able to study, but I was never able to actually learn in class, and most of my learning was growing up and now was done on my own at home. I also have trouble with emotional regulation, making decisions on impulse, and talking coherently. Does vyvanse work best for things like this?",
        "created_utc": 1678650467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guanfacine and Wellbutrin effects and effectiveness vs Dexedrine",
        "author": "Masamune_Xero",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnur4/guanfacine_and_wellbutrin_effects_and/",
        "text": "I'm taking 30mg dextroamphetamine that lasts me half a day, and the effects are fairly obvious, but I'm also on 250mg Wellbutrin and 2mg Guanfacine and I'm super sus about if they're even doing anything. Does anyone take these in a comparable dose and if so what have you noticed in their effects? I'm thinking of just being taken off of them and seeing if I see a difference, but they take so long to ween off that I'm almost just complacent and why bother if I don't notice any negative side effects, ya know?",
        "created_utc": 1678650448,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am the most indecisive person in the world and I hate it.",
        "author": "ICareAboutThings25",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnpp8/i_am_the_most_indecisive_person_in_the_world_and/",
        "text": "This is mostly venting, but if anyone has any advice, that’s welcome too. I’d just request gentleness as I’m already beating myself up for this enough. \n\nI am an indecisive nightmare. I have been my whole life. As a kid, my least favorite question in the world was “what do you want for dinner?” \n\nI was at the store yesterday. I knew I wanted yogurt. But what brand? And what flavor? \n\nThe trouble is that my brain can see every single side of everything all at once. \n\n“Hmm. This one is cheaper, but that one has fewer calories. But this other one has more protein. This one has less sugar, but more artificial sweeteners. I’ve never tried this flavor before, but that one I’m worried I might get of tired of. Though I almost never get tired of a flavor, so is that a factor?” \n\nAnd that’s just one example. I also agonized over whether I wanted ground turkey or ground chicken, mint chip Greek frozen yogurt or caramel, the spicy pico de gallo or the mild. I got out of line three times because I was agonizing over getting a specific food or not. \n\nAnd that’s just shopping. I routinely agonize over whether or not I want a dip in the hot tub at the gym, whether to start a new show or rewatch an old one, leave my lesson plans as they are or bump an activity back a day. \n\nMy brain just goes in a thousand different directions all at once. And I hate myself the whole time every time.",
        "created_utc": 1678650121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to speak a new love language while struggling with ADHD",
        "author": "Number1tigra",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnndz/trying_to_speak_a_new_love_language_while/",
        "text": "[removed]",
        "created_utc": 1678649966,
        "upvote_ratio": 1.0
    },
    {
        "title": "There is something EXTREMELY AND UNCANNILY WRONG with my reward system",
        "author": "aspenatr",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnmav/there_is_something_extremely_and_uncannily_wrong/",
        "text": "Success flair because I genuinely have no idea how to classify this\n                                                                      \nToday I didn’t feel individual nor cumulative accomplishment from showering, taking out the recycling, successfully eating breakfast AND lunch, brushing my teeth, taking care of my skin, taking garbage out of my room, reading, and completing a very overdue assignment... but just now I felt the most accomplishment that I have in a REALLY, REALLY LONG WHILE because I finally got the South Park theme down. I literally had to pause it afterward so I could sit there and feel good about myself.\n                                                                            \nGoin’ down to South Park, gonna have myself a time... friendly faces everywhere... humble folks... without... temptation...\n                                                                            \nOh, fuck. Save us all.",
        "created_utc": 1678649894,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just learned about RSD (rejection sensitivity disorder) and how that’s a major symptom of ADHD.",
        "author": "Paria_Tenebris",
        "url": "https://www.reddit.com/r/ADHD/comments/11pnf21/i_just_learned_about_rsd_rejection_sensitivity/",
        "text": "I don’t know how I didn’t realize this but I’m super sensitive to rejection and I hate it. But at least I have an explanation as to why I’m like this. I’ve been diagnosed for some time now but circumstances caused me to get off my meds for a while and it has been awful. \n\nI guess just know this about RSD gives me some peace of mind so I thought I’d share this in case anyone else didn’t know either. \n\nIf anyone has any tips how to live with RSD as a big symptom I’m all ears but I hope this post helps someone else also!",
        "created_utc": 1678649425,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do about medicine shortage",
        "author": "doodlearm",
        "url": "https://www.reddit.com/r/ADHD/comments/11pn9gr/what_to_do_about_medicine_shortage/",
        "text": "Ive been on adderall for 5 years, and I take it about 4-5 times a week with regular breaks. Ive been able to stay at a fixed 20mg XR dose for all five years, but Ive been saving my pills and am trying to stretch them. I work full time and live alone. Getting all the cleaning, cooking, errands, bills, etc while also workin done is so hard unmedicated. Quitting suddenly has also ruined my appetite and I eat uncontrollably to the point of nausea. Anyone have advice on being forced to quit cold turkey? Or on OTC alternatives to take during the shortage? I feel kind of lost and the healthcare system doesn’t seem concerned because Im not in school or a child.",
        "created_utc": 1678649068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from Ritalin IR to Concerta ER",
        "author": "BugPerfect2653",
        "url": "https://www.reddit.com/r/ADHD/comments/11pn8fl/switching_from_ritalin_ir_to_concerta_er/",
        "text": "I currently take Ritalin (methylphenidate) 5 mg twice a day, and it's the only stimulant medication I've reacted well to. I am very sensitive to basically all medications, and I found this dose is perfect for me. However, I want to switch to Concerta ER for a slightly longer effect. The lowest dose of this is 18mg, and I'm worried about the increase in dose affecting my sleep or triggering anxiety. \n\nHas anyone made this transition? Is it almost the same or will it feel like 18mg is hitting me all at once? Any insight appreciated, thank you!",
        "created_utc": 1678649000,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you guys deal with ADHD and depression?",
        "author": "SmokingBeneathStars",
        "url": "https://www.reddit.com/r/ADHD/comments/11pn640/how_do_you_guys_deal_with_adhd_and_depression/",
        "text": "The depression really makes things so much worse. I went to therapy and it didn't really help. I know exactly what to do but everything feels so meaningless to me that I don't. Only meds I get is ritalin and I barely ever take them because they mess with my appetite too much and I'm very skinny already. How do you guys cope or discipline yourselves?",
        "created_utc": 1678648849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cold hands and feet from Dexedrine",
        "author": "BankRunnyNose",
        "url": "https://www.reddit.com/r/ADHD/comments/11pn4ob/cold_hands_and_feet_from_dexedrine/",
        "text": "[removed]",
        "created_utc": 1678648762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice with vyvanse -- started two weeks ago",
        "author": "Creative_Engineer_23",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmz7m/seeking_advice_with_vyvanse_started_two_weeks_ago/",
        "text": "Hi everyone, \n\nI'm looking for some advice. I am 22M, a senior in college, recently diagnosed with ADHD and prescribed Vyvanse (about two weeks ago). For context: I've been a pretty strong academic performer throughout my life, including through college. With that said, I've always had problems with productivity and focus, with severity ranging from irritating to (seemingly) crippling. Things have gotten a fair bit worse this year.\n\nLately, I've been focused mainly on a long-form senior thesis and my post-grad job search. I've had a lot less structure than in years past -- fewer in-person classes, less engaging social life (I'm a 5th year) -- and my inability to perform academically with the regularity and consistency that I know I'm capable of is really making me miserable. Basically, I know I'm limiting myself by barely ever being able to get real work done, but I'm (mostly) unable to do anything about it.\n\nThis semester, I began seeing a psychologist -- long story short, he diagnosed me with ADHD (based on a couple of months of consultation and the TOVA test), I met with a psychiatrist, and got prescribed Vyvanse. \n\nThe medication has been helpful, but it hasn't stopped me from spending entire days sitting at my computer scrolling youtube/reddit/twitter.... basically, anything my brain can conceive of other than what I need to be doing. \n\nI guess I don't have a whole bunch of specific questions -- just looking for advice from people who might be able to relate.",
        "created_utc": 1678648406,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was your working before and after getting medications?",
        "author": "Maattaann",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmtvd/how_was_your_working_before_and_after_getting/",
        "text": "How did you endure 8 hours a day everyday before getting diagnosed with ADHD and how is it now when you have the medications? Does it make your job easier and generally can you endure entire shift without going insane? and can you stick to one job without quickly jumping to another as soon as you get bored of the current job? I can't work because of this problems but soon i will get medications... should i expect any good changes?",
        "created_utc": 1678648067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please help me. Why do I not have the energy to do ANYTHING except rot in bed?",
        "author": "Expert-Cow481",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmrhz/can_someone_please_help_me_why_do_i_not_have_the/",
        "text": "i’ve spent my weekend rotting in bed. i’m doing it right now. there are things i need to get up and do but i am so physically exhausted just thinking about it. nor do i care to take care of those things even though i know i have to. i took 60 mg of vyvanse thinking it would help but it hasn’t. what the actual fuck is wrong with me. i have a great job and i do well in school by forcing myself but weekends are so brutal because i do this every single weekend",
        "created_utc": 1678647915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loss of appetite on Ritalin",
        "author": "JakeTheCarry",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmoib/loss_of_appetite_on_ritalin/",
        "text": "[removed]",
        "created_utc": 1678647727,
        "upvote_ratio": 1.0
    },
    {
        "title": "i started a new life",
        "author": "verykick",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmnma/i_started_a_new_life/",
        "text": "Hi there! I am from Türkiye. I lost my gf on the last earthquake but this is not the news. I lost 90 pounds i started to learn a new language. And i feel good. Despite to that i am drinking 3 bottles of wines every day. This is something i know. Before that i tried to kill my self in the possible Way that i can do ehic is the easiest; drinking. But this did not work. So i am here with a new appreance. Maybe i will kill my self in the future but who knows ☺️ i feally dont want fo talk about the girl that i missed or the traffic accident that i lived 2 days ago. I lost my every bit of my life savings. I am bere i am now. I know i have adhd. ,I knew that for 6 years. I want a new life. I am a Motion designer i am working with my portfolio. I wish i will make it online in 2 moths. I have 2 cats who are definitely crazy about me. I love them i love you all. Axn i am standing here as i will not kill myself. Because i worth something.",
        "created_utc": 1678647675,
        "upvote_ratio": 1.0
    },
    {
        "title": "possibility that I don't have ADHD?",
        "author": "ShabbyCat58",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmei5/possibility_that_i_dont_have_adhd/",
        "text": "So as a kid, I got diagnosed with autism, ADHD, ODD and a few other things. But growing up I realized that ODD may have been a misdiagnosis and I heard that trauma can cause ADHD like symptoms (I have trauma). And with everything combined, is there a possibility that I actually had trauma disorders and autism instead of ADHD? I've never been on meds (ik partially cus of a medication phobia) but still, sometimes I have memory issues and ig short circuiting doing tasks (like all of a sudden quit half way or get distracted), and stuff similar to ADHD but idk. Is it possible I got misdiagnosed cus I was a kid?",
        "created_utc": 1678647092,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD causing tension in relationship?",
        "author": "Mavericks98",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmajw/adhd_causing_tension_in_relationship/",
        "text": "[removed]",
        "created_utc": 1678646846,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are my option amid the adderall shortage",
        "author": "benzitylol",
        "url": "https://www.reddit.com/r/ADHD/comments/11pmaeh/what_are_my_option_amid_the_adderall_shortage/",
        "text": "[removed]",
        "created_utc": 1678646835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with my partners ADHD",
        "author": "Mavericks98",
        "url": "https://www.reddit.com/r/ADHD/comments/11pm8ud/dealing_with_my_partners_adhd/",
        "text": "[removed]",
        "created_utc": 1678646732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suspecting he has ADHD",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678646690,
        "upvote_ratio": 1.0
    },
    {
        "title": "CBT, ChatGPT, and the Wall of Awful",
        "author": "firethornocelot",
        "url": "https://www.reddit.com/r/ADHD/comments/11pm85g/cbt_chatgpt_and_the_wall_of_awful/",
        "text": "Today I was faced with a huge wall of awful. As I was sitting there stewing in my anxiety, I remembered my CBT experiences from therapy and thought, how great would it be to be able to talk through an exercise with someone...\n\n So, since my regular therapist wasn't immediately available, I decided to try chatGPT as an alternative. While I've heard of some mixed experiences using it as a therapist, I was able to use it to guide me through a short CBT exercise. I found that it was great acting as a source of support, inspiring positive self-talk and helping me shift negative emotions to a more positive and realistic mindset. \n\nFor a bit of context, I am a small business owner. I really enjoy entrepreneurship, but as others with ADHD who are also small business owners, I'm sure the feeling of constantly fighting off overwhelm is very relatable.\n\n[Here's some of the conversation](https://imgur.com/a/tFBjw0X) if anyone is curious or wants to try similar prompts. As it is, it certainly wouldn't replace speaking to your actual therapist who you've been working with for years, but it made for a great self-therapy tool in the moment.\n\nIf anyone has been on the fence, I really encourage you to give it a try! If you have already tried using it this way, what was your experience like?",
        "created_utc": 1678646689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone help! Does my partner have ADHD?",
        "author": "Mavericks98",
        "url": "https://www.reddit.com/r/ADHD/comments/11pm6vs/someone_help_does_my_partner_have_adhd/",
        "text": "[removed]",
        "created_utc": 1678646606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can childhood trauma make ADHD worse?",
        "author": "ItzSurgeBruh",
        "url": "https://www.reddit.com/r/ADHD/comments/11pm4zy/can_childhood_trauma_make_adhd_worse/",
        "text": "Recently diagnosed with ADHD, I have been thinking about my childhood and how bad it was when I had to deal with ADHD and nobody believed my struggles.\n\nI lived half time with my mom, half with dad. My mom has ADHD and was always super accommodating, but my Dad made super strict rules to make sure I was on top of everything.\n\nMy Dad/Stepmom would search my bag every day after school for any papers or pencils out of place and make me put them in the right folder/pencil case. If they found anything out of place I wasn’t allowed any electronics for that night.\n\nI had a very strict routine I had to follow, down to the minute. If I didn’t follow it directly I would be grounded to my room for the day and wasn’t allowed to go out and see friends. (Not that I had any, having my phone taken away from me almost every day made sure I could never keep in contact)\n\nAn example of my morning routine that I remember quite vividly:\n\n7:00AM- Alarm\n7:10AM- Dressed and bed made\n7:15AM- In the kitchen eating breakfast\n7:25AM- Check school bag, take lunch\n7:30AM- Out the door to catch the bus\n**After school**\n3:45PM- Get home, backpack check\n4:00PM- Homework (If I didn’t have any, ask teacher for extra credit work)\n5:00PM- Free time (NO TV)\n5:30PM- Get table ready for dinner\n5:45PM- Dinner\n6:30PM- Dishes\n7:00PM- Make lunch for next day\n7:30PM- Shower\n8:00PM- Pajamas on, in bed reading\n9:00PM- Lights out.\n\nI was 14 years old and they still made me follow this list every day. Even on weekends! In bed at 8PM. On weekends I would have 6 hours that I was forced to go into town on my bike (7km btw) and “Find friends” but they didn’t give me my phone and only gave me $.50 to call them from a pay phone in case I got in trouble.\n\nDoes this strict rigid routine make ADHD worse? I can only assume so right? Also not asking for sympathy. I don’t live with them anymore and i’ve been much happier with my mom.",
        "created_utc": 1678646482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else have sensory issues?",
        "author": "tyranthater",
        "url": "https://www.reddit.com/r/ADHD/comments/11pm2jm/anyone_else_have_sensory_issues/",
        "text": "[removed]",
        "created_utc": 1678646326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it so hard to get my prescriptions filled?",
        "author": "spearminta",
        "url": "https://www.reddit.com/r/ADHD/comments/11plvab/why_is_it_so_hard_to_get_my_prescriptions_filled/",
        "text": "[removed]",
        "created_utc": 1678645867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with frustration",
        "author": "Liam162",
        "url": "https://www.reddit.com/r/ADHD/comments/11pls3l/struggling_with_frustration/",
        "text": "Any body else struggle with frustration when their adhd interfears with their day to day.\nNormally im ok. I was diagnosed about a year ago and before i knew i had adhd, i still struggled but found ways to cope/ do things in a way that made things easier for me. After my diagnosis i was able to get more understanding and 99% of the time im ok. \nBut for example today im doing stuff at work that is not the usual day to day stuff and requires a plan. \nIve found in situations like this that if someone breaks down what they expect me to do in steps and shows me the area im working on whilst explaining it i can crack on no problem.\nAlthough i told my manager this, she is not making it clear what i need to do. She is giving me a list of tasks and its all going in one ear and out the other.\nNobody else is struggling. Its just me, my manager and 2 other people and its pissing me off.\nI know i can do the job and i like to keep busy and crack on. But the more i dont understand, the more i get frustrated and flustered.\nI dont know what to do. Ive had meeting with her in the past and she knows i have adhd and i have told her she needs to break down tasks but she seems to have foggotten.\nIm trying my best but the frustration of knowing im capable and wanting to crack on, but also knowing because of my adhd i cant is up setting me. Especailly because everyone else seems to be doing it fine.\nI dont know what to do, i dont wanna ask for help because i should be able to do it and dont want to get laughed at for in my eyes being \"slow\".",
        "created_utc": 1678645673,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you talk, especially to new people, without searching for words / sentences? Any tips?",
        "author": "brain_lockd",
        "url": "https://www.reddit.com/r/ADHD/comments/11plokp/how_do_you_talk_especially_to_new_people_without/",
        "text": "Late adult diagnosis. \n\nThroughout my life I have learned not to talk to people. And not just to new people, but friends, family, lovers, etc.\n\nWhy?\n\nJust some a lot of you, I'm sure, I've always had a had a hard time talking to others. I'd lose words, sometimes even whole sentences, and just stand their silently, staring off into space, trying to search for the right word I've said a thousand times before. I'd switch topics on a whim. Instead of getting the point, I'd often use another point to prove the point I was trying to prove. Especially when it's a topic I know a lot about / am passionate about, I start talking in this intense, super fast kind of way that doesn't allow for anyone else to get a word in edge wise, like I'm \"hyper focusing\" on my talking and anyone who interrupts, or tries to be a part of the conversation, I get annoyed. Sometimes I'd just see a bird in a tree and just lose complete interest in what I was saying.\n\nThis is even worse in a group setting, when I'm being introduced to new people. After some rather faulty introductions, I often get quiet and listen to them talk instead. When I'm meeting my partner's friends, they often tell her they couldn't even tell if they liked me or not because I didn't talk at all.\n\nPrevious to my diagnosis, when I talked like this around my family / less close friends, I could tell the way I conversed annoyed them. A lot of times, they'd just start talking amongst themselves and ignore me, before I could even finish what I was saying.\n\nAmong those that barely know me, I often see their faces drop, as if they are worried about me, or about their friend dating an idiot, when I can barely get a word out.\n\nA big event is coming up for me and my partner, and I'm trying to figure out how exactly to converse better. How to not get super intense when I'm passionate about something, and how to not search for words / sentences TOO much, that way people can get to know me better.\n\nAs an aside, I'm generally OK, fine, and happy with, being a quiet person. I'm not trying to change who I am. But it feels like the part of me that made me TERRIFIED to talk to others, that ADHD part of me, is making it hard for me to get to know people that I WANT to know, and they want to know me.\n\nAs a second aside, meds actually seemed to make me quieter. Perhaps because it finally \"quieted\" my brain. Despite the meds, though, I still loose words constantly.\n\nTLDR: Any tips on how to not look like an idiot, or an intense stressed out person, when I'm talking to new people?",
        "created_utc": 1678645443,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired of the burnout cycle. I want to change.",
        "author": "Fit419",
        "url": "https://www.reddit.com/r/ADHD/comments/11plnc9/im_so_tired_of_the_burnout_cycle_i_want_to_change/",
        "text": "[removed]",
        "created_utc": 1678645360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wasted 20 minutes replying to a comment about theme parks &amp; ADHD on AITA… Anyone care to continue the conversation?",
        "author": "EverybodyShitsNFT",
        "url": "https://www.reddit.com/r/ADHD/comments/11plh7e/wasted_20_minutes_replying_to_a_comment_about/",
        "text": "[removed]",
        "created_utc": 1678644966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Technology researcher with ADHD hoping to get some of your feedback",
        "author": "SimilarRaccoon8946",
        "url": "https://www.reddit.com/r/ADHD/comments/11plgjs/technology_researcher_with_adhd_hoping_to_get/",
        "text": "[removed]",
        "created_utc": 1678644924,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD is rare",
        "author": "wookinpanub1",
        "url": "https://www.reddit.com/r/ADHD/comments/11plb51/adhd_is_rare/",
        "text": "Ive been working as a high school sub teacher for many months and the district puts a bunch of information about each kid next to their picture in the attendance system.  One of the icons is a medical cross listing any pertinent medical issues for students including ADHD.  Considering how much attention to overprescribing of stimulants and over diagnoses of ADHD shows up in media was surprised to see just how rare it is to have an ADD student.  The class size is usually 20-40 students and the most I’ve ever had is two in a class with ADD.  75% of the time there’s none and the other times their is one.\n\nEven rarer is to have a an add student in AP class.  So for those ADDers who think everyone but them is doing better at their ADD, almost all of us steer clear of AP classes.\n\nObviously there are many students who won’t be diagnosed until later in life (college for me) but the rarity of an ADD diagnosis in high school students paints a very different picture than certain misguided interests in media might have you believe.",
        "created_utc": 1678644570,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come I can do one thing but not the other?",
        "author": "EastofEdensgrave",
        "url": "https://www.reddit.com/r/ADHD/comments/11plawe/how_come_i_can_do_one_thing_but_not_the_other/",
        "text": "Hear me out because I think this is ADHD related in some way but I’m not sure how. \n\nWhen my bf talks about video games I have to make a physical effort to absorb the information and respond- and inevitably I will get bored and forget I was supposed to be listening and freak out about that seconds before he requests a verbal response.\n\n\nWhen a coworker talks about their large boot collection and is sharing about themselves in a new way, not only am I fascinated and paying attention; I actually can recall the details of what they’ve said. \n\nI try to pay attention to the people closest in my life; but it seems like the more distance between my emotional comfort and the person, the more I actually pay attention and thus, find them more engaging. How do I combat this? Forcing it obviously isn’t working.",
        "created_utc": 1678644554,
        "upvote_ratio": 1.0
    },
    {
        "title": "I CANT STOP GETTING DISTRACTED ON ADDERALL",
        "author": "alexaoba66",
        "url": "https://www.reddit.com/r/ADHD/comments/11pl9p5/i_cant_stop_getting_distracted_on_adderall/",
        "text": "Oh my god I get distracted usually, but when I take my aderall, I become distracted and FOCUS on the distraction for so long. Suddenly reddit becomes the most interesting thing ever, and then 2 hours pass by. I hate this happening because my medicated hours are so precious. Distractions are all around me.\n\n Oh my room is kinda messy, lemme clean that. I want study music *spends 30 minutes researching what kind of music is best for studying*. We should plan our day so we can be most productive! *spends an hour finding a Google spreadsheet best for adhd*\n\nAnd then, before I know it, my meds wear off. And i cant stop myself cause it physically hurts when i dont go through with it. Whyyyyy. How do I stop this. Why is everything so interesting?!?!?",
        "created_utc": 1678644473,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do y’all get any reading done?",
        "author": "Halaguard",
        "url": "https://www.reddit.com/r/ADHD/comments/11pl8ng/how_do_yall_get_any_reading_done/",
        "text": "[removed]",
        "created_utc": 1678644402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't tell if stimulants work because they all give me too much anxiety",
        "author": "datacadia",
        "url": "https://www.reddit.com/r/ADHD/comments/11pl7b8/cant_tell_if_stimulants_work_because_they_all/",
        "text": "I've tried multiple types of stimulants, and even on a low dose I am very jittery and anxious which stops me from being productive or able to focus. This isn't shocking because I've never been able to drink caffeine for this reason.\n\nIt's very frustrating because my ADHD symptoms effect me so much all the time and I just want to treat them, but it seems like I can't.\n\nI'm already on an SSRI for anxiety. It works well but not when I take stimulants.\n\nWhat should I do? Should I ask to be put on a second anxiety med so that I can take stimulants and really figure out if they work? I'm feeling so discouraged.",
        "created_utc": 1678644309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse Patent in Canada NOT expiring until June 2024",
        "author": "Calessalad",
        "url": "https://www.reddit.com/r/ADHD/comments/11pl6ud/vyvanse_patent_in_canada_not_expiring_until_june/",
        "text": "I'm SO happy for folks in the US hopefully getting the generic version of Vyvanse soon/this year with the patent expiry like now (or in August?), but I've been looking into the patent expiration date in Canada and it looks like we have a little while longer before it expires up north. \n\nI found info about the patent here: [https://www.lens.org/lens/patent/132-920-665-777-550/frontpage](https://www.lens.org/lens/patent/132-920-665-777-550/frontpage)\n\nAnd this info is supported by health canada website, ont gov site and takeda canada inc site.\n\nJust thought I'd put that out there cause I was getting excited until I did a bit more digging...",
        "created_utc": 1678644278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you destroyed your relationships? I need to know how to survive.",
        "author": "Cantsleepruminating",
        "url": "https://www.reddit.com/r/ADHD/comments/11pl0nd/have_you_destroyed_your_relationships_i_need_to/",
        "text": "I’m killing my husband. Literally killing him. Stress (me) is causing blood clots and it’s going to kill him.\nI don’t want to console him when we fight anymore because he doesn’t deserve to keep dealing with my bullshit. \nIf I continue to let him believe he can help me/fix me, he’ll just keep trying. As he has for 15yrs.\n\n\nI’m 41 fucking yrs old and he isn’t going to get the “good person” he thinks he’s seen in me.\nI’ve hurt him too much already and he shouldn’t have stayed and tried to fix me. \nBut he did. And it nearly killed him and it made him miserable. And I can’t live with that burden. There is no redemption.\nWhy won’t he just stand up for himself and let go? \n\n\nIve been dx’d for just over a year and I’m not getting better. Trying to deal with it is making me exponentially worse. The more I learn about myself and how I treat people, how I process emotions, the way I lie to myself, the ways I don’t even understand basic things that other people do, the less hope I have. I’m a selfish person, and I was completely oblivious. I didn’t even know how much I manipulated literally everyone in my life. \n\n\nIt’s not like I’m gonna be happy and carefree without him. I’m just not going to hurt him anymore. It’s likely I’ll make some small improvements that will keep me from being homeless and allow me to hang onto my job, but I need the weight of my survival to be on only me-as much as possible. That’s the only thing that has worked. I can’t get better knowing I’ve got something to fall back on, someone that will take care of me. I just won’t.  I can’t be responsible for anyone else, and I can’t bear the burden of someone relying on me. \n\n\nThis isn’t a pity party, I feel like I’m truly seeing things as they are. What I want is to know I’m not alone. That someone else has been through this and survived. I don’t know what to do.",
        "created_utc": 1678643892,
        "upvote_ratio": 1.0
    },
    {
        "title": "being ADHD locked down alone during the pandemic made me do this",
        "author": "GardenStack",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkzgx/being_adhd_locked_down_alone_during_the_pandemic/",
        "text": "I got obsessed with a vertical gardening product during the pandemic and haven't let it go since. I've jumped form learning about computer-assisted design to learning about 3D printers to learning about vertical farming to learning about patents to learning about shooting and editing video to learning about social media/ marketing. I had no background in any of this. Feedback appreciated!  \n\n\n(I'm pre-crowdfunding, trying to gather emails and get pointers on how to make my website look less off-putting lol)  \n\n\n[www.garden-stack.com](https://www.garden-stack.com)",
        "created_utc": 1678643814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on achieving goals without medication (No access ATM)",
        "author": "Eagleshot123",
        "url": "https://www.reddit.com/r/ADHD/comments/11pktrq/need_advice_on_achieving_goals_without_medication/",
        "text": "I'm in a weird transitional period between a string of really bad job and finally setting up a good gig/pseudo starting my own company. However I don't have access to medication ATM until this new gig starts officially and thats a little while off. I still have things for my business start up along with other various goals I want to strive for and achieve and I get super excited when thinking about them but when it comes time to act I just can't do it.  \n\nI can't stay focused or even get started. That wall of energy/focus I need to climb over is super daunting without  medication. \n\nAny advice on how to stay on track/get started without meds?",
        "created_utc": 1678643442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone feel they have large knowledge gaps in things that don't interest them?",
        "author": "MindTheKnowledgeGap",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkqs9/does_anyone_feel_they_have_large_knowledge_gaps/",
        "text": "[removed]",
        "created_utc": 1678643241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wife Is Out of Patience With Workaholism",
        "author": "Informal-Resource-14",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkomn/wife_is_out_of_patience_with_workaholism/",
        "text": "So I’m definitely one of those people who falls into the “I need to work or I’m not worthy of love,” thing. I work in music production and I work kind of tirelessly, and I enjoy it a lot. Recently work has really picked up, a lot of things I’ve been working towards for years have been coming to fruition. Like, good problem to have insomuch as I’ve been booking maybe the most stuff I’ve ever booked. But my wife has been voicing concern about this honestly for years now that I’m just so focused on work and I never have time for her or the kids. That basically I prioritize work over everything else in my life. The problem is like A) While there’s probably a great deal of fear involved in my focus on work, music production stuff (especially film and TV) seems to be the kind of thing where if you get too picky about the work you just stop getting called and B) I’m not sure who else I am besides a musician. It’s not like I could fathom ever retiring from this to pursue other passions or whatever. It’s like John Williams said “Every day spent not composing is a mistake.” I don’t have much of a social life not centered around it, I don’t have a lot of interests that don’t in some way feed into it. \n\nRecently she told me basically that it’s kind of dire, that I’m going to have to figure out what’s important to me. Essentially she’s probably going to leave me if I keep up this pace and work will probably leave me if I slow down. So what do I do?",
        "created_utc": 1678643100,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD causing tension in my family",
        "author": "comrade_frost",
        "url": "https://www.reddit.com/r/ADHD/comments/11pknyg/adhd_causing_tension_in_my_family/",
        "text": "I know there is probably a better way to word it, but I am just so truly exhausted that I don't even wanna try anymore.\n\nI recently got diagnosed and was put on medication. While going to college and following a strict routine, everything was kinda good. I was happy that my meds were working. I was putting in the effort. Hell, I even managed to score the top rank in class. \n\nBut then just before our third test, study holidays came. And procrastination set in. My therapist wasn't available.and even though I took meds, but I just ended up focusing on the wrong thing. Didn't study, got panic attack and bailed on the last day of the exam. \n\nMy parents got really angry. They said hurtful things. Things like \" you don't have any problem you are just lazy\" \" look at your sister, how can she do it and cannot? \" \" You should pity us, we do so much for you, but you won't even put an effort.\". \n\nAnd now I am drowning in guilt. Because everything they said Is true. I am just a failure. At the same time, I know I shouldn't beat myself so much over it. I feel like the walls are closing in on me. I wish I never had this.",
        "created_utc": 1678643058,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just dont know",
        "author": "Lizzykiss",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkn7n/i_just_dont_know/",
        "text": "My 5 year old was recently/ in the process of being diagnosed. Im trying to learn, trying to understand. Im not sure if the anger outburst is part of adhd, or something else? Any advice would be fantastic, i do see trying to stay calm and talk everything through and trying to maintain eye contact with him helps. He is such a cool kid, im just worried for his future.",
        "created_utc": 1678643007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meal kit delivery for one person?",
        "author": "X_Xenith",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkgx3/meal_kit_delivery_for_one_person/",
        "text": "TL;DR Suggestions for a variety of non-microwaveable meal kits and/or top tips that don't involve much care, attention, organisation or thought other than \"do I have enough money for this?\"\n\nSo food is a nightmare for my ADHD brain, I have to keep track of everything I do have, have to make lists that I never complete and are never accurate for items I don't have and even if I do manage to get to a supermarket or order online I get overwhelmed and start panic buying, spending way too much money on stuff I never use and goes out of date before I even remember I brought it.\n\nI have been getting Hello Fresh for about a year with a long-term intimate partner, both spending roughly £20/week on five meals that we didn't have to think about and changed every week so we had variety. \n\nIntimacy between me and said partner has now ended and I no longer want anything tying us monetarily, and we're not going to be cooking together anymore regardless.\n\nI could do with a meal kit delivery that is no more than £30/week at the utmost limit, that provides 5 meals/week and isn't just microwaveable as cooking does bring me joy - just finding, purchasing and storing ingredients doesn't!\nLooked at Mindful Chef as they have 1 person options, but they are &gt;£60/week!\n\nDoes anyone have any suggestions for low(ish) cost meals that require cooking, with a variety of options and requires as little thought and energy as Hello Fresh in terms of all I need to do is make sure I have enough numbers in the bank for them to take off me.\n\nAlternatively, if there isn't one, are there any ADHD top tips for food shopping and storage that require not a lot of thought, care or attention whilst also being budget-friendly for a single person and maintaining enough variety for me to not go insane?",
        "created_utc": 1678642606,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask my doc to take my meds everyday as opposed to weekend breaks?",
        "author": "Electrical-Leg7886",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkgtn/how_to_ask_my_doc_to_take_my_meds_everyday_as/",
        "text": "Im newly prescribed Concerta 36mg and wow do they give me hope and joy to complete things i always wanted to do. It feel awesome and it regulated my feelings as well.\n\nAnywho, my doc wants me to take weekend breaks even tho im still new to them. Adhd is an everyday thing not a weekday issue. \n\nWill asking to be able to take them daily look bad? Im scared he’ll say no. Also has anyone dealt with this?\n\nKeep in mind ive been waiting so long to get concerta after hoops so i just want to be able to enjoy them as they really help me a lot",
        "created_utc": 1678642599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ritalin timing for wedding day advice",
        "author": "MourtyMourtMourt",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkfjb/ritalin_timing_for_wedding_day_advice/",
        "text": "I’m getting married in a week and I need advice on how to best time taking my ritilin so I don’t have the undesirable effects during the ceremony/reception. I take 20mg three times a day normally at 7am, 11am and 2pm. Usually after the last dose I tend to get a bit “frittered” the ceremony starts at 2pm, so should I delay taking the first dose until 9am? \n\nI I’ve gotten myself into a major spin about the timings and getting them perfect. It’s a very small wedding so there will be no way of hiding if I’m feel too scattered. My doc has advised not taking a meds break for the day as I also have OCD. Any advice?",
        "created_utc": 1678642515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents coming over for a small get-together in 2 hours and I'm stressing so much about cleaning that I can't mentally organize how to go about it.",
        "author": "ughatsocialmedia",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkdq6/parents_coming_over_for_a_small_gettogether_in_2/",
        "text": "I usually do well with doing one room at a time, so that I can at least see that I'm making some kind of progress, even if it means only one or two rooms get cleaned that day. (Well, I technically have to typically force myself to focus and stick to one room at a time, but anyway...).\n\nMy usual way of cleaning to the best of my ability isn't working. My brain is scrambled because I'm legitimately nervous. And also I think because I can't get away with my usual 1-2 room success, but rather I have to get all common areas tidied up this time for people coming over.\n\nAny tips, advice, or encouragement is appreciated!",
        "created_utc": 1678642398,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD is ruining my life",
        "author": "FullMembership389",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkcnn/adhd_is_ruining_my_life/",
        "text": "I am 16 years old; I suffer from Asperger's Syndrome and ADHD (which I take 50 mg of Elvanse to help with; I have tried others but none of them worked). The lack of motivation and other symptoms involved with having ADHD is ruining my life.\n\n&amp;#x200B;\n\nI am at a very important stage in school, and my second wave of exams is just over a month away. Last year, I scraped each pass purely by cramming and relying on numerous factors that mainly apply to those with ADHD:\n\nThese include:\n\n* Urgency - I left studying until last minute, which left me with no choice but to study.\n* Novelty - There would be times when I studied (effectively) in different places - I would study in my kitchen, office, or spare room etc. just to experience a sense of novelty - this made me study. But this didn't work well as I would get bored and fall back into my bad habits.\n* Competition - In my old school, there was another boy who performed at a similar level to me in school, he didn't realise this but I would always aim to be better than him and show him what I'm really capable of. That's what made me study\n\nI know that the average person uses the reward factor as a source of motivation. For example, if you were to get a conditional offer from a university and had to meet certain requirements in your grades, you would always be thinking about meeting these requirements, thus motivating you to study. But that doesn't apply to me, and I don't know why.\n\nNow a year later, I am in a new school and I am due to take even harder exams, and I know I cannot get away with cramming and relying on these factors to give me motivation.\n\n&amp;#x200B;\n\nWhen I avoid doing a task, I know in my head that I am weak and that what I am doing will not benefit me. I can't describe how much I avoid completing a task my brain has no interest in.\n\nWhat's really bad is that over the years, it has become part of my routine. This cycle has repeated every day of my secondary school life:\n\n1. Get up and rely on coffee to recover from going to bed so late the night before\n2. Go to school. I have no close friends and nobody to talk to, so I am left with my thoughts all the time.\n3. During a class, I am in constant deep work, I hyperfocus on the tasks I particularly enjoy and still put in a good amount of effort into the ones I don't. What frustrates me is that I am aware of how much my productivity peaks and I just tell myself how I will just repeat it at home, knowing it won't happen. While I am in this mindset to learn, I feel shit thinking about the little I did the night before, this is followed by me telling myself \"today is the day I begin to study\".\n4. Then, I come home, my mindset suddenly changes completely and now my brain avoids every task I said I was going to do at school, I end up sitting on my phone literally doing nothing but swiping on the home screen or using what's left on it. At this point, anyone would rely on discipline to get a task done, but that's the problem, I have no discipline. Words cannot describe how hard it is for me to force myself to complete a task.\n5. I spend the rest of the night convincing myself that what I'm doing is productive and will benefit me. A few nights ago, I spent a number of hours watching every single Steve Jobs presentation he made while he worked for Apple, this was followed by me jailbreaking every (unused) apple device in my house, A few weeks ago, I completed 3 units of the Italian course on Duolingo, In one night. It isn't just this, I would normally spend hours tidying my room, going to the gym, and worse of all spending hours on making a 'study plan' only to not do it. I stay up for hours doing stupid things like this and go to bed at 2-3 in the morning.\n\nIt has gotten to the point where I am slowly giving up on myself. I have tried everything; I currently have no social media; I attempt to use a daily planner but fail to stay consistent; my highest streak of having a 'perfect day' of ticking every box is 3 days - the novelty has worn off and I am now bored of using it.\n\n&amp;#x200B;\n\nI also recently got diagnosed with scoliosis, which has affected me a lot. Not only has it killed my motivation even more, but I have also now become less focused in school. \n\nI wear a hidden brace to school, and I sit at the front of the class in some of my subjects. During these classes, I sit in constant worry that somebody will notice the brace or asymmetry in my back and point it out. I then begin sweating so much, worrying even more about whether or not I smell or if it's visible. During these times, my heart rate gets so high that I can feel it pounding through my chest (this is along with the increased heart rate side effects of my medication), and you can imagine how little work I get done.\n\n&amp;#x200B;\n\nI want to succeed; I really do, and I know I have the potential to do so, but so far, ADHD has only brought me down. I failed/scraped most of my preliminary exams this year because I didn't study and got too confident. All my teachers find it so strange that I perform so well in class but so poorly on homework and class tests.\n\nMy goal is to study business at university where I can be around people like myself and make friends. But I know I need to get very high grades as the course tends to be very competitive.\n\nI would like to be an entrepreneur so I can make use of these qualities that come with ADHD, which so far are proving to make my life miserable, the idea of using them for good sounds unbelievable to me.\n\n&amp;#x200B;\n\nThis is my first time using Reddit, especially to talk about personal things like this. But I would like advice, please. Has anyone else experienced something similar? If yes, how did you cope with it/what methods worked for you? I am losing hope; I've been holding this in for so long, and I just want to talk to someone who can relate to me.\n\nIf you read all this, I'd like to thank you, for taking the time to listen to my story.",
        "created_utc": 1678642330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my dx experience normal? (Kaiser)",
        "author": "PestoTomatoTime",
        "url": "https://www.reddit.com/r/ADHD/comments/11pkbu8/is_my_dx_experience_normal_kaiser/",
        "text": "I (20sF) was just diagnosed with ADHD inattentive from my NP that I was already seeing for anxiety (I’m on Zoloft and atarax) and all it took was me filling out their adhd questionnaire packet in person, taking my BP, then my NP looked at my answers and said yes you’re positive for adhd. She wants to start me on straterra after increasing my Zoloft dose to 100 (on 50 right now which isn’t working well). Do I not need to go through more assessments or interviews? Or is this it?",
        "created_utc": 1678642282,
        "upvote_ratio": 1.0
    }
]