[
    {
        "title": "Life and Employment, stuck at a crossroads",
        "author": "Mindless-Mode9410",
        "url": "https://www.reddit.com/r/ADHD/comments/11mx3kt/life_and_employment_stuck_at_a_crossroads/",
        "text": "[removed]",
        "created_utc": 1678380554,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people without ADHD who don’t have time blindness think about / see things?",
        "author": "PotatoSmuggler69",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwzum/how_do_people_without_adhd_who_dont_have_time/",
        "text": "I am struggling to understand this - and maybe rightly so. I have come to understand (or like to believe so) other aspects of adhd better, like impulsivity, emotional dysregulation, etc, but time blindness still boggles me\n\nI agree that I don’t have a way of planning future, foreseeing events, etc - is this what time blindness implies? Is adhd said to completely remove ability to see / plan for future, or can it be done a little bit?\n\nI appreciate that this topic probably can’t be conveyed using words that well, but would be grateful for any input",
        "created_utc": 1678380300,
        "upvote_ratio": 0.99
    },
    {
        "title": "Wrapping up my search for a new Psychiatrist 2022-2023",
        "author": "Radioactive_Patient",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwxdc/wrapping_up_my_search_for_a_new_psychiatrist/",
        "text": "Whew!\n\nPartly because of the shortage of ADHD medication, I think this made my search for a new shrink much more difficult. I have bipolar disorder (well-maintained) and ADHD (well-maintained) \n\nIn my last post, I talked about a nurse practitioner who wouldn't treat my ADHD because I'm not working a full-time job. I know, right? (She was referred to me by my pharmacist at the time, who said she writes plenty)\n\nNext, I accessed \"Psychology Today\" because they have a \"search for a psychiatrist\" function where you can filter for people who treat ADHD or whatever. Their \"verified\" psychiatrist are supposed to be a cut above the rest in terms of outreach, specialties, experience and education. \n\nThis brought me to a few providers who work exclusively for 100% virtual companies like Cerebral, Inc. I thought I'd reach out with a short, positive email. I certainly did not want to seem desperate or like a total drug-seeker. I also filled out an online assessment and even though it bounced back with \"Sorry, it looks like we're not a good fit for you\" message, this company hounded me with emails, links to their company's blog and phone calls to \"Meet your new psychiatrist today!\"\n\nWell, the psychiatrists I'd emailed through the Psychology Today portal, some of them got back to me, some of them didn't, and it was the Talkiatry ones who didn't. This left me with a less than thrilled impression of Tele-mentalhealth providers.\n\nI'm curious what you guys think of virtual care if you have ADHD or ADHD And something else, like what I've got. \n\nOh, and I did manage to find a good shrink, but it wasn't thru a telehealth company. I found one who takes Medicare, is comfortable with my meds, the whole shebang.\n\n I'm curious what you guys think of virtual care if you have ADHD or ADHD And something else, like what I've got.\n\nMore stigma? Or less stigma? \n\nI say More, but it's not being done on purpose. It's more like a cluelessness generation Z type thing. \n\n [https://www.youtube.com/watch?v=DfJSCG-NHKE](https://www.youtube.com/watch?v=DfJSCG-NHKE)",
        "created_utc": 1678380134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Embarrassing and expensive mistake",
        "author": "AlphaWolfDesign",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwqbs/embarrassing_and_expensive_mistake/",
        "text": "I usually consider myself good at cleaning and organizing. Well, I neglected the bathroom floor AND had some water leak after a long shower. The water went through the floor. Also our bathroom floor has mold. Our housemates discovered the crime scene and I’m to blame and currently a subject of overheard conversations 🥲 the only other thing I could blame is bad floor sealant, but also I didn’t notice the mold.",
        "created_utc": 1678379666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is ADHD just low level depression, manifesting in a different way?",
        "author": "Vanilla35",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwpi3/is_adhd_just_low_level_depression_manifesting_in/",
        "text": "Is ADHD just low level depression, manifesting in a different way?  I noticed that a lot of the characteristics overlap, and a lot of the same drugs work in many ways work for both. I’m wondering how it works on a deeper level, and if we know of a connection there.\n\nIs ADHD just low level depression, manifesting in a different way?  I noticed that a lot of the characteristics overlap, and a lot of the same drugs work in many ways work for both. I’m wondering how it works on a deeper level, and if we know of a connection there.",
        "created_utc": 1678379608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse assistance",
        "author": "BlazeOn79",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwpaj/vyvanse_assistance/",
        "text": "Hey guys. I used to be on Vyvanse and it controlled my ADHD better than anything else. Unfortunately I lost the insurance I had at the time, and with it, my ability to reasonably obtain my prescription. I switched to adderall which does not work nearly as well. I recently learned about Takeda’s Help at Hand and seem to within the income limits. I’m in the process of filling out my application, but I’m wondering…does anyone know what the discount is, exactly? Like, the amount off the script? Is it based on your income? Thank you for any input!",
        "created_utc": 1678379594,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't stop losing my cards 😭",
        "author": "notabluerose",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwovk/i_cant_stop_losing_my_cards/",
        "text": "I've replaced my cards/keys so many times but this time really hurts 😭. I got an airtag and attached it to my card holder but somehow I lost my cards again but the airtag and card holder are intact 😩. I'm so annoyed that this is such a simple thing that I'm struggling with and I've spent enough time and money on replacements. Has anyone figured out a good tip to stop losing important stuff.",
        "created_utc": 1678379565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is ADHD just low level depression, manifesting in a different way?",
        "author": "Vanilla35",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwobm/is_adhd_just_low_level_depression_manifesting_in/",
        "text": "[removed]",
        "created_utc": 1678379530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strattera( Atomoxatine) and Elvanse?",
        "author": "DragonflyD264",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwno4/strattera_atomoxatine_and_elvanse/",
        "text": "[removed]",
        "created_utc": 1678379487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse and sticky hands?",
        "author": "MultidimensionalHag",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwmx4/vyvanse_and_sticky_hands/",
        "text": "Sitting here typing this wearing gloves…\n\nI just restarted vyvanse 70mg and I’m noticing my hands get sticky shortly after taking it? I have sweaty hands already but I’m not sure why my sweaty hands get sticky now? \n\nEven after I wash them, with or without soap, Ive scrubbed tf out of my hands AND everything I touch with Clorox wipes and rubbing alcohol, I’ve used baby powder, I’ve also put sweat block on my palms and they still sweat and get sticky. You can HEAR and SEE the sticky \n\nThe only thing that works for a few minutes is coating my hands with olive oil and then washing off with minimal soap.",
        "created_utc": 1678379437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jack of all trades, Master of none",
        "author": "polyngon",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwinq/jack_of_all_trades_master_of_none/",
        "text": "Hey peeps, so i find myself struggling with something which I'm sure many others do too, and I'm wondering if anyone has some wisdom they can share regarding this.\n\nKeeping your focus and wanting to do it all (Jack of all trades, Master of none).\n\nFor example **(fictional scenario):**\n\nA labourer who works in construction. Specifically as a brick layer. But he Can, and Wants, to take his hand at every other job associated to labouring. The problem here is he becomes a Jack of all trades and master of none.\n\nNow to some, this might not be an issue for you. But being a jack of all trades doesn't necessarily mean you are good at them all. You might be ok'ish. \n\nThe problem here is lack of focus and not mastering what you're currently doing before moving on. \n\nMy question is, how do you silence that inner voice that says......i can do that and then instantly diving over into another field and wasting your time when you should be focusing on your current skillset. \n\nThanks :)",
        "created_utc": 1678379147,
        "upvote_ratio": 1.0
    },
    {
        "title": "is ADHD a trendy thing right now?",
        "author": "the_best_superpower",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwidu/is_adhd_a_trendy_thing_right_now/",
        "text": "Or like, A thing that people WANT to have? I've heard a lot about doctors not wanting to do testing because so many people come in for testing and so few actually have it. I'm not sure if I have ADHD but I show a lot of the symptoms and I've been pretty sure I have it for I while now. The thing is I don't want to go get tested because If I don't have it I'll just be wasting someone's time. Even though I know it's stupid it seems like I would rather suck it up than face the possibility that I don't have it even though that would be a good thing? It's confusing to me and I'm the one rationalizing it so I wondered if any of you could make some sense of it. I'm not one for spilling my guts over the internet but I've been pondering this for a while.",
        "created_utc": 1678379130,
        "upvote_ratio": 1.0
    },
    {
        "title": "An App that Actually helps me from doom scrolling!!",
        "author": "Robinraang",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwfr4/an_app_that_actually_helps_me_from_doom_scrolling/",
        "text": "I saw a tiktok that showed me this so credit to that creator. I don’t remember who it was now. \n\nIf you’re anything like me I can literally spend a FULL day on tiktok and not notice until it’s far too late. Or find myself on an app bc I was just waiting for something and my impatient ass couldn’t just be in stimulated for 10 seconds. \n\nI have never found an app that actually works for keeping me off apps. I don’t care if I kill a little virtual tree I want to scroll reddit! Lol\n\nBuuut, the app One Sec has been a GAME CHANGER for me in the last week or so. \n\nYou can set it up with any app or webpage. When you open the app/webpage it diverts to a 6 second loading screen that prompts you take a deep breath, and then you can decide to either continue or not go on the app. I find it has stopped me from mindlessly clicking on apps without realizing and getting stuck scrolling. \n\nYou can set different types of loading screens, and timers to remind you after 5-15 minutes that maybe you should do something else. \n\nIt tells you how much time you have saved from clicking off of the app as well! I love it and highly recommend!\n\nDo you use any apps like this? I’m always looking for new options to keep me on task. :) \nIf you try it, let me know how it works for you!",
        "created_utc": 1678378952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I supposed to notice a difference on Adderall?",
        "author": "8goblinstotheleft",
        "url": "https://www.reddit.com/r/ADHD/comments/11mwd3l/am_i_supposed_to_notice_a_difference_on_adderall/",
        "text": "A few hours ago I took my first ever dose of Adderall. Its 20mg.\n\nAm I supposed to feel a significant difference? I suppose I might feel a little more awake than usual, but I still feel rather unfocused and distractible. Could it be that the dose is too low? Do I need to give it some more time to work? Will it work better/differently after a few more doses?\n\nI don't see my doctor for another month, so I'll keep taking it until then, but I'm worried that it might not be working how it should. Maybe I'm just being anxious for no reason, I dunno.",
        "created_utc": 1678378784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is ADHD just low level depression, manifesting in a different way?",
        "author": "Vanilla35",
        "url": "https://www.reddit.com/r/ADHD/comments/11mw86b/is_adhd_just_low_level_depression_manifesting_in/",
        "text": "[removed]",
        "created_utc": 1678378455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any current advice on how to deal with the medication shortage we have going on right now?",
        "author": "tthrowaway4questions",
        "url": "https://www.reddit.com/r/ADHD/comments/11mw4s1/does_anyone_have_any_current_advice_on_how_to/",
        "text": "[removed]",
        "created_utc": 1678378222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does ADHD cause you to have strong emotional outbursts that affect your relationship? How do you control it?",
        "author": "beautifulgoddess7",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvxxt/does_adhd_cause_you_to_have_strong_emotional/",
        "text": "Hello, I personally do not have ADHD but my boyfriend recently was diagnosed with it. We are aware ADHD can cause emotional deregulation and big emotional responses. My bf and I can be having a normal conversation, and then out of nowhere he’ll go from 0 to 100, and it is taking a toll on our relationship.\n\nFor example, we can be having a normal discussion about a normal everyday topic. He will randomly start raising his voice or speaking aggressively towards me without realizing it and I’ll calmly tell him to please watch the way he speaks to me. He then takes offense because he doesn’t agree that he’s being mean, so he gets even madder because he thinks I’m attacking and criticizing him. I’ll explain to him that it hurts my feelings when he raises his voice or yells at me, and I really just want him to validate that and try to control his emotions. \n\nAll of a sudden we’re in a huge spiraling fight where I’m upset because he won’t validate that he is hurting my feelings, and he’s upset because he thinks I’m trying to argue about the random topic we were talking about. I tell him it’s not about the topic, it’s about the way he was speaking to me about the topic, but he keeps going back to the topic anyways even if we agree on the topic. It feels like he wants to fight for the sake of fighting because he’s bored and needs stimulation.\n\nLast weekend, we were out with his friends and I was having some severe stomach pain (probably IBS related). We were on the dance floor of the bar but I physically was having a hard time dancing because of the pain I was in. He got angry with me because he could tell I wasn’t having fun. He called us an Uber home and then yelled at me when we got home because the night was ruined. I told him I was willing to stay at the bar but I was having such bad stomach pain I couldn’t dance. He said it seemed like I was using my stomach issues as an excuse to not hang with his friends, and this concerned him about our relationship. I told him he was being an asshole for yelling at me over having stomach pain that I couldn’t control. He then got even madder at me because he felt like he wasn’t allowed to express a concern with me. I told him it’s okay for him to have a concern about our relationship, but it’s not right for him to yell at me and tell me I ruined the night because I was having stomach pain that I was willing to push through. If he was concerned that I was purposely avoiding spending time with his friends, he could have communicated the concern before he got explosively angry. He stormed off and slept on the couch. \n\nThe next morning, he apologized and admitted he was overreacting and he shouldn’t have treated me like that. He usually is very sweet to me while I’m not feeling well, but he was upset because I keep having stomach issues when we go out with friends, he wants us to be able to have fun, and he couldn’t control his anger. He told me he wouldn’t blow up on me again, but he says that every time something like this happens.\n\nIt feels like I’m walking on eggshells sometimes because he gets into these modes where he is super aggressively angry (not physically) and he doesn’t even realize it in the moment. He thinks he’s walking on eggshells because he doesn’t always agree that he is speaking in an aggressive way, so he just thinks I get upset at him and pick fights for no reason. \n\nHe has recently become more self aware that he gets into modes where he doesn’t realize he’s losing control of his emotions. I’ve let him know how it affects me and how it’s taking a toll on our relationship, and sometimes he validates this and acknowledges he has a hard time regulating and promises to do better.\n\nBut then when he’s in this angry mode again, he thinks I’m just criticizing him and trying to change him. He thinks our personalities clash and we’re just incompatible, and he’s considered just breaking up. He said his last relationship ended because “she was picking fights” but I genuinely feel like this is something that he’ll keep experiencing if he doesn’t learn to regulate his emotions. I see potential to grow together and learn how to maturely communicate with each other, but only if he’s willing to meet me halfway.\n\nI know I’m not perfect. I’m anxious and stubborn at times but I try to de-escalate and apologize for how I hurt his feelings. I try to be aware of my own triggers and be aware of the ways I can improve my emotional maturity. \n\nWe’ve sat down and discussed self help articles together before and it’s helped us make improvements with our communication and conflict resolution, but he only does that when I find the resource and ask him to sit down with me. He doesn’t do anything on his own, and the same stuff keeps happening even if we think we’ve made improvements. I know our relationship sounds toxic from what I’ve shared, but these bad moments are only a small snippet of what our relationship is like. Most of the time things are really great, but these are extreme lows that I really want to try to fix. I want to be patient with him because I know ADHD can have strong effects on your brain, but it can be really draining to me when it seems like he isn’t trying. How do I help him help himself and our relationship?",
        "created_utc": 1678377797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got diagnosed during my second year at University and this quote sums it up perfectly.",
        "author": "skyrimemes",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvthh/just_got_diagnosed_during_my_second_year_at/",
        "text": "[removed]",
        "created_utc": 1678377526,
        "upvote_ratio": 1.0
    },
    {
        "title": "im not sure if i have adhd",
        "author": "owenfrfr",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvske/im_not_sure_if_i_have_adhd/",
        "text": "[removed]",
        "created_utc": 1678377463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any current advice on how to deal with the medication shortage we have going on right now?",
        "author": "tthrowaway4questions",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvpuu/does_anyone_have_any_current_advice_on_how_to/",
        "text": "[removed]",
        "created_utc": 1678377283,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am mad at my mom for not taking care of my medication",
        "author": "alex_ig_idk",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvnuf/i_am_mad_at_my_mom_for_not_taking_care_of_my/",
        "text": "[removed]",
        "created_utc": 1678377146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got laid off",
        "author": "LikeCherryCola",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvm6i/just_got_laid_off/",
        "text": "They did the whole \"it's not you, it's us\" thing. Claimed it's not because of my performance, but because my position is \"no longer needed.\" Well, if that were true they could've moved me to a different team. It's a huge company. It was my first job after college. First time working full-time. I hated it, but I was proud to be able to keep it for 2 years. \n\nI'm a software engineer that has extreme anxiety over technical interviews, so the worst part of this is having to get back on the Leetcode grind. I feel like I don't even remember anything I learned in college, or basic coding stuff. It's ironic. I've been working for two years but work but I feel like if anything my skills have atrophied.\n\nI can't help but blame my ADHD, like maybe if I'd focused and produced higher quality work I would've survived this round of layoffs.",
        "created_utc": 1678377032,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for help so I can help my fiance",
        "author": "imgrowing1027",
        "url": "https://www.reddit.com/r/ADHD/comments/11mvhzr/looking_for_help_so_i_can_help_my_fiance/",
        "text": "I'm starting to feel pretty confident that my fiance struggles with ADHD. She has mentioned it before but not in any kind of serious way. She's a very busy girl running her own business and a non-profit organization as well as being a new mother.\n\nShe would not be upset if I brought this up to her, but when I do I want to have suggestions for her. Which is what brings me here.\n\nShe is very against taking medication and would much rather prefer a homeopathic treatment or cure for pretty much any ailment.\n\nWhat can I suggest to her to try and see if it helps? Thank you!",
        "created_utc": 1678376752,
        "upvote_ratio": 1.0
    },
    {
        "title": "My luck ran out; adderall shortage has hot my pharmacy | Vent/Rant",
        "author": "brinaryce",
        "url": "https://www.reddit.com/r/ADHD/comments/11mv8ir/my_luck_ran_out_adderall_shortage_has_hot_my/",
        "text": "[removed]",
        "created_utc": 1678376105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall helps me shut up",
        "author": "ibeandresgym",
        "url": "https://www.reddit.com/r/ADHD/comments/11mv4qe/adderall_helps_me_shut_up/",
        "text": "OK so been medicated for 4 years now. What I started to notice recently is that my meds help me shut up the inner voice in my head, narrating everything. I came to call this part of my personality at times. I guess it's part of the executive dysfunction that drives me to do things, or just talk to my ceiling things I should be doing. \n\nrecently, like a clockwork 5 hours after I take my meds, I get my impulsive child back, and start kicking over everything I organized while medicated. I then proceeded to laugh and spend 5 hours thinking of catchphrases. \n\nI took my meds the other day after being off them for a bit, and as soon as they hit my brain just felt so satisfied, I took a nap after siting thing multiple thoughts for weeks. \n\nOnly downside about being medicated is when I don't take a break from the meds. It's nice being productive and on top of things, but without my sober hyperactive impulsive inner voice and self I am to people, I feel lost following routines and not my inner child that zones out during a conversation only to blurt out the first thing that goes through my mind. \n\nAlso does anybody else feel like getting medicated later in life you missed out so much?",
        "created_utc": 1678375854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Formula 1 Racing+ADHD=New found sport that’s fun to watch!",
        "author": "Murky-Opportunity696",
        "url": "https://www.reddit.com/r/ADHD/comments/11mv4a1/formula_1_racingadhdnew_found_sport_thats_fun_to/",
        "text": "Roughly a couple years ago, I was in need of a new hobby or 2. I was recently divorced and most of my time went into my ex-wife. Well, I needed to start devoting time to myself and do things that I enjoyed, but I didn’t know what it all was. \n\nSince I was a little kid, I always loved racing and building cars or things that had wheels and an engine. Understanding the complexities of how an engine works and the math and the science living in harmony and working seamlessly together (unless it’s a BMW, I swear those things come from the factory with issues) but I put that hobby off to the side for awhile cause life got expensive, but then it got cheaper and more peaceful, but I don’t like too much peace cause it’ll make me go insane. Then, I went to the tire shop for my car and I seen an ad for Pirelli tires that said “Pirelli, the choice of Formula 1” so I got intrigued and did some research. \n\nHere is how F1 and ADHD go hand in hand: \n\n-Drama. There is so much drama between teams and even within the teams to the point that it’s so funny at times. \n\n-Tires. Different color tires have different effects and can cause faster lap times, but don’t last as long and forced the team to come up with various strategies all surrounded by tires. \n\n-Hyper-fixate on drivers going around the track. I love it when they show the drivers POV as they are racing and hitting the paddle shifters and hearing the engine rev up and down. \n\nI would recommend watching Drive to Survive on Netflix. Formula 1 has been so beneficial for my ADHD and it’s something that I never thought I could get into, but Formula 1 is so complex that it’s soothing for me. I get my stimulation through complexities and how much of my brain I need to use.",
        "created_utc": 1678375823,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve been using this trick to help me do tasks and chores. I’ve decided to post it here on the off-chance it helps someone else.",
        "author": "VastInevitable7130",
        "url": "https://www.reddit.com/r/ADHD/comments/11mv33w/ive_been_using_this_trick_to_help_me_do_tasks_and/",
        "text": "I call it the “Might As Well”tactic. It’s very easy and goes like this: \n\nLet’s say I’m in the kitchen and to grab a snack. I also happen to have some kitchen-related chores that I’ve been putting of, like dishes.  Welp, since I’m in the kitchen already for my snack, I “might as well” do the dishes while I’m there.\n\nThis has really helped me because one of my main barriers to doing things is getting off the couch/my phone/getting out of bed and physically transporting myself somewhere else. I’ve tried scheduling chore days, guilting myself into doing them, setting an alarm…this is the only thing that works for me.\n\nHeading out? Might as well take the trash out on my way.\n\nGoing to the bathroom to wash my face? Might as well start cleaning the bathroom after.\n\nGrabbing a snack in the kitchen at 7 pm because I’m too lazy to cook dinner? Well, I’m in the kitchen anyway. Might as well make myself a proper meal while munching on that snack.\n\nAnyone else do something similar?\n\nOn an unrelated note, everyone here is awesome and I hope you’re all having a great day!",
        "created_utc": 1678375744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does my ADHD medication make me happy?",
        "author": "thapattywagon",
        "url": "https://www.reddit.com/r/ADHD/comments/11mv2mv/why_does_my_adhd_medication_make_me_happy/",
        "text": "The title sums up my question pretty well, but I'll go into a little detail.\n\nI take my medicine right before my morning shower. Before it I'm tired, impatient, and generally just ruder because I'm not a morning person. After my 20ish minute shower, I feel like a brand new person. I'm much more outgoing, very patient, loving, just very happy. However, I'll also have a mood crash later in the day.\n\nIs this normal? Because of the whole medication crisis, I've been taking Focalin instead of my usual Adderall. Adderall used to make me feel this way, and I've spoken with my doctor about it, but I've been taking it for a while so it leveled off. I feel like Focalin takes it up a notch. \n\nNot sure if it matters but I'm 22M, formally diagnosed with ADHD and Bipolar 1. I also take lamotrigine, if that somehow changes things.",
        "created_utc": 1678375711,
        "upvote_ratio": 1.0
    },
    {
        "title": "adhd and mood swings, do you have it? what's your experience",
        "author": "applesaregoodd",
        "url": "https://www.reddit.com/r/ADHD/comments/11muyn6/adhd_and_mood_swings_do_you_have_it_whats_your/",
        "text": "i have the worst mood swings i swear. I feel good for a month then out of the blue i got a bad feeling and start an argument with my boyfriend (i can do this with any close person in my life but my closest is my boyfriend now. Before my boyfriend i was doing this to my close friend.). Worst part is, i can't be aware of my own behaviors during an argument and i act very impulsive. I go black. I break his heart. This is literally a loop i can't break. I hate this. After the monthly argument i cry for a day then bam i am fine the next day. Just like nothing has happened. Except the guilt of breaking hearts. I keep apologizing and regretting what i do but i can never break the cycle. Is this about my adhd too? Can anyone help me? \n\nAlso i am on concerta and ssri.",
        "created_utc": 1678375442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any current advice on how to deal with the med shortage?",
        "author": "tthrowaway4questions",
        "url": "https://www.reddit.com/r/ADHD/comments/11mul67/does_anyone_have_any_current_advice_on_how_to/",
        "text": "[removed]",
        "created_utc": 1678374521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elvanse 30mg",
        "author": "FormalFlimsy652",
        "url": "https://www.reddit.com/r/ADHD/comments/11muk5j/elvanse_30mg/",
        "text": "I got diagnosed last week, started elvanse yesterday, 30mg, this is my second day. I feel nothing. Nothing bad, nor good. It’s just …nothing. I’m not listening in lectures or conversations, and when I catch myself dreaming off, I try and pull myself back, but before I know it, I’m gone again. It’s tiring. I’m tired. I have big medical exams coming soon, I can’t risk daydreaming in my exam again, it’s become a serious problem the more I’ve advanced in school. From stopping or rushing through exams cuz I’m ‘over it and want to go’ to daydreaming so long that I don’t get enough time to even finish…sigh\n\nI’m supposed to start 60mg next week, which is already in my possession, but my follow up appointment is still a few weeks from now, I’m not too sure where to go from here. If I should take my week 2 dose in week 1, or if I should keep on with this and wait for week 2, or if I should contact my psych advisor earlier (not even sure that one’s too possible, cuz I’m with ADHD360)",
        "created_utc": 1678374448,
        "upvote_ratio": 1.0
    },
    {
        "title": "My experience",
        "author": "redditacular",
        "url": "https://www.reddit.com/r/ADHD/comments/11muhsn/my_experience/",
        "text": "[removed]",
        "created_utc": 1678374301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Partner has ADHD and I need advice - her life is always a slow moving train crash - don't know how to cope",
        "author": "Edge779",
        "url": "https://www.reddit.com/r/ADHD/comments/11muhlx/partner_has_adhd_and_i_need_advice_her_life_is/",
        "text": "[removed]",
        "created_utc": 1678374288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Concerta + alcool?",
        "author": "arandomname223",
        "url": "https://www.reddit.com/r/ADHD/comments/11mueey/concerta_alcool/",
        "text": "[removed]",
        "created_utc": 1678374088,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with my research!",
        "author": "Quiet_Mulberry3800",
        "url": "https://www.reddit.com/r/ADHD/comments/11mu4i3/i_need_help_with_my_research/",
        "text": "[removed]",
        "created_utc": 1678373425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing the thing before actually doing it",
        "author": "Highdef-Advertiser",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtykd/doing_the_thing_before_actually_doing_it/",
        "text": "[removed]",
        "created_utc": 1678372994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be reasonable to call out of work because I'm out of Adderall?",
        "author": "VarissianThot",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtwel/would_it_be_reasonable_to_call_out_of_work/",
        "text": "Title, basically.  This stimulant shortage is going to be the death of me.  I called every pharmacy within 25 miles of me and no one has it, not even name brand.  My doctor sent a script for something else on Tuesday, but for whatever reason it bounced, and I took my last adderall yesterday so I don't have anything to take today.   \n\nI am legitimately concerned about my ability to perform my job without it.  I'm a janitor, it shouldn't be that fucking hard but without adderall everything is overstimulating and it's so fucking hard to do anything at all.  Reasonably I don't think it'd be impossible to ever work without it, but this would be the first time I'd be asked to since I was prescribed it a year ago.  \n\nWould it be completely unreasonable to call in?  Like, these are psych meds, if someone was out of antidepressants would that be okay?  I'm terrified. Thanks in advance.",
        "created_utc": 1678372843,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve started taking my meds an hour before I’m supposed to wake up and as such have made it to work on time or early every single day for the past 2 weeks",
        "author": "JulioCesarSalad",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtvjw/ive_started_taking_my_meds_an_hour_before_im/",
        "text": "\n**point 1: I have been taking my meds at 5 am and it helps so much**. Set regular non-sleep schedule alarm for 5, take meds from the drawer in my nightstand (weekly pill organizer), drink water, fall back asleep. I never left the bed.\n\n5:30 am: house lights start turning on as a sunlight alarm, heater turns on so it’s warn at home by 6 am.\n\nReal alarm rings at 6 am, lights are on, heater is on. I wake up\n\nMeds have kicked in so I am able to just start (and also I have to do that thing that happens about an hour after taking stimulants)\n\nI even have about 30 minutes to “wake up” being on my phone and stuff. In the shower around 6:30, and then I’m dressed by 7. Gives me plenty of time to clean the kitchen from the night before, make coffee, clean the litter box, take the dog out.\n\nSo by the time 8 am rolls around I’m kinda done and ready. I can have breakfast if I want to, or I can choose not to. I kinda just have 8 am free for whatever. Which allows me to do the next point!\n\n\n**Point 2: I’ve been making it to work early/on time the past two weeks and it is such a huge relief**\n\nI don’t have the gigantic stress hanging over me of “I’m late I’m late I’m late” that constantly haunts me in my life\n\nThe key in my case has been that my gf works next to a metro station, and she goes to work at 8:30 exactly. Hitching a ride with her means I have a comfortable car ride to the metro, I hop on, and go straight to my office.\n\nEven if I didn’t do this, my walking+metro time is 30 minutes, so I would be able to walk out my door at 8:30 or earlier.\n\nSometimes I’m out the door by 8:15 walking which means I even have time to pick up coffee on my way to work and still be on time!\n\nIt feels so much better than sneaking in at 9:20 or 9:15 hoping that no one has needed anything from me in the past 20 minutes, and I feel perfectly fine leaving the instant the clock hits 4:00 pm\n\n**TL;DR I recommend taking your meds an hour before you actually have to wake up it’s so nice**",
        "created_utc": 1678372791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Useful Habit Tracker App?",
        "author": "mcm485",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtqyw/useful_habit_tracker_app/",
        "text": "[removed]",
        "created_utc": 1678372465,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do You Guys Manage Sleep?",
        "author": "characterfullofcolor",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtqib/how_do_you_guys_manage_sleep/",
        "text": "I have had my diagnosis for 5 years now. I started off on taking Ritalin, but I didn’t take it very often. About 2 years ago, my doctor switched me to vyvanse, which I like a lot more than Ritalin. \n\nWith Ritalin, my highest dose was 20mg. Like I said though, I didn’t take it very often. Then I got switched to vyvanse, started at 30mg. I like vyvanse a lot more, I feel like I can actually feel it helping me. I’m now at 50mg. \n\nBut just like with Ritalin, I don’t regularly take the vyvanse. The reason why is because it really effects me in a few ways. \n\nFirst, it minimizes my eating in a day. I am  typically very alert about how much I eat in a day after taking the vyvanse, so I end up eating at least 2 meals a day which is typical for me as a college student, but I can so easily forget as I get no appetite whatsoever and only eat of off remembering that I need to.\n\nSecond, it kills my sex drive. Now this is actually something that I like since I’m asexual, but I think it’s something to note about side effects. \n\nThird and most importantly, I can sometimes struggle with sleep. I took the 50mg pill at 7:30am yesterday morning, and it is now 6:20am and I have not slept a single bit. It’s not typical for me to stay up all night, but it’s happened a few times before, after taking the vyvanse. \n\nThese are all reasons why I rarely take the vyvanse (for a realm of measure I will say that this is the first time I have taken it since 2023 has started.) I take it when I have an important work day coming up, and yesterday I had to study for a math exam and a Japanese exam, both of which I have today. Now I have to take both of the exams in a few hours and I literally have not slept 🥲. \n\nI’m confident I’ll still do well since I studied my ass off, and I’m hoping that will account for the lack of sleep, but I would prefer if I got a full night’s worth of sleep. \n\nHow do you guys manage to sleep after taking stimulants? \n\nFor reference since I know this matters with dosage, I am 20M, 6’4” 210lbs. (193cm, 95kg for all the non-Americans).",
        "created_utc": 1678372433,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no control over procrastination",
        "author": "crbsidenigma",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtq96/i_have_no_control_over_procrastination/",
        "text": "[removed]",
        "created_utc": 1678372415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medication that improves impulse control?",
        "author": "Glambuddha",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtils/medication_that_improves_impulse_control/",
        "text": "I’ve had experienced psychosis before, so I’m leaning towards Ritalin or Concerta, since they have a lower risk of triggering a psychotic episode. Can anyone tell me if Concerta / Ritalin helps with their impulse control? This is because I really struggle with emotional regulation and impulsivity. I wonder if medication addresses such issues, or they only make it easier to focus on tasks?",
        "created_utc": 1678371887,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD problems but ADHD test came back negative",
        "author": "wurstkopf3000",
        "url": "https://www.reddit.com/r/ADHD/comments/11mthc6/adhd_problems_but_adhd_test_came_back_negative/",
        "text": "[removed]",
        "created_utc": 1678371795,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many trips to the DRs until you got your correct dosage that works for you?",
        "author": "Florida_Hottie",
        "url": "https://www.reddit.com/r/ADHD/comments/11mtcrf/how_many_trips_to_the_drs_until_you_got_your/",
        "text": " I'm laying here in my towel from the shower dreading the in person DR office visit. I love my primary, but I have a hard time saying how I feel like I go in prepared, and then I shut down. Then I leave, not discussing everything. This is my 2nd appointment in 2 weeks. Any words of encouragement are appreciated. 🙂 I'm currently on 18mg of concerta + 10mg IR booster if that matters.",
        "created_utc": 1678371477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting Rittalin next week!! (TW: eating disorder)",
        "author": "Sand_Guardian4",
        "url": "https://www.reddit.com/r/ADHD/comments/11mt78e/starting_rittalin_next_week_tw_eating_disorder/",
        "text": "I'm picking it up on Friday and I'm so excited!! My main concern is some side  and effects, mostly the worsening of appetite and anxiety, so anyone else who's been on Rittalin, do you have any tips for making sure I do eat, my diet is already not fantastic and I am worried about it becoming a serious issue, and as for the anxiety, just general anxiety advice would be well appreciated, thanks in advance!",
        "created_utc": 1678371090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting Rittalin next week!! (TW: eating disorder)",
        "author": "Sand_Guardian4",
        "url": "https://www.reddit.com/r/ADHD/comments/11mt3eb/starting_rittalin_next_week_tw_eating_disorder/",
        "text": "[removed]",
        "created_utc": 1678370827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a person with adhd “function” just like someone who doesn’t have it when medicated?",
        "author": "AspiringCellist",
        "url": "https://www.reddit.com/r/ADHD/comments/11mssli/can_a_person_with_adhd_function_just_like_someone/",
        "text": "I’ve been diagnosed quite late and recently, and I’ve currently been prescribed Ritalin and I take it all of the days I have classes in university. Thing is, although the improvement is really significant when compared to before, I still have a lot of struggles to focus in class and stuff, like as if I just had a lighter level of adhd but still not enough to properly function in society. I’ll talk to my doctor about it next appointment to see what to do, but my question is: am I just spacey regardless, is this just how stuff goes and can I ever attend class in the same “mind presence” as my non-adhd classmates do? Is it possible to get in the same head space as them for classes or is that just not how stuff works?",
        "created_utc": 1678370085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those who wake up and take meds + a snack while still in bed: what is the snack?",
        "author": "WelshTaylor",
        "url": "https://www.reddit.com/r/ADHD/comments/11mss03/those_who_wake_up_and_take_meds_a_snack_while/",
        "text": "I was recommended to try setting an earlier alarm, eat a biscuit/cookie with meds, then stay in bed an hour or so til they kick in. Then I'd be able to start the day as a medicated, more functional, person rather than having to drag myself out of bed unmedicated.\n\nHowever I really hate crumbly textures like biscuits/cookies without a hot drink (&amp; hot drink is a get-out-of-bed task), so I'm looking for alternates. Does anyone else do this and what is your snack?\n\n(I actually tried this yesterday and today, yesterday with an apple and today with 2 tangerines - only about midday today did I remember the \"no Vitamin C with meds\" rule \\*facepalm\\* - not sure if it applies to the apple but definitely applies to the tangerines, so I need a new snack.)",
        "created_utc": 1678370043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dependency on medication",
        "author": "Wonderful_Wrap3850",
        "url": "https://www.reddit.com/r/ADHD/comments/11msmlr/dependency_on_medication/",
        "text": "I think I am building a dependency to medication. It is not to the point where I am taking more than prescribed but I take it every day and don’t really ever think about not taking it. When I take it I just feel lighter, simple things like making phone calls and talking to people feel easier. I’m less easily agitated and have more stamina just to go out and enjoy life. \n\nMy question is, why is it so hard to do this unmedicated? I would say the biggest benefit I get out of the medicine is not even the focus, but the smoothness in emotion it gives me - I’m not spiralling, irritated, overthinking or anxious and I can just walk around, smile at people, engage in light chatter, and appreciate the sun and nature.",
        "created_utc": 1678369656,
        "upvote_ratio": 1.0
    },
    {
        "title": "What foods do you find easy to eat whilst on meds?",
        "author": "suckurmuddah",
        "url": "https://www.reddit.com/r/ADHD/comments/11mslxi/what_foods_do_you_find_easy_to_eat_whilst_on_meds/",
        "text": "So i’ve been on Elvanse (lisdexamfetamine) for just over 4 months now. I take 30mg and i feel like it’s a good dosage for me BUT i’m really struggling with my appetite \n\nI’m trying to compile a list of foods that don’t disgust me when i’m on my meds, does anyone have any ideas/recommendations? \n\nWeirdly I seem to be much better with 3 things - sweet foods, fried food, liquid (i.e any drinks or yoghurt) \n\n\nSimilarly to a lot of people with ADHD i get bored of food quite easily so can’t eat the same thing everyday\n\nAlso - bonus points if you have any idea that can generally be bought in the high street during a work lunch break!",
        "created_utc": 1678369604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does my boyfriend have ADHD?",
        "author": "Choice_Physics9599",
        "url": "https://www.reddit.com/r/ADHD/comments/11msl3p/does_my_boyfriend_have_adhd/",
        "text": "Hi I’m (25f) just looking for some opinions / views on whether my boyfriend (25m) displays enough traits if ADHD. I’m diagnosed with adhd and I can see a lot of traits of adhd in my boyfriend. \n\nHe’s a musician and a delivery driver, he has no issues at work and manages to get to his deliveries on time and can keep track of it pretty well, he’s been doing deliveries for years and has a good well mapped out system / route that works for him. \n\nHe’s also been making music for years and is passionate about it, he can spend hours writing music and has been quite consistent recently. \n\nI have noticed that he struggles to remember appointments and is quite chaotic when it comes to organising his errands, for example it will take him a very long time to boom appointments and even then, he frequently forgets that they are booked will miss it. He will frequently let multiple parking tickets expire even though he has the money to pay for them, this will rather be because he has forgot, or because he knows about it but feels no motivation to log onto the online portal and pay then (meaning they then double in price - paying them would take probably only 15 mins of his day). \n\nThe way he communicates also reminds me of myself and others with adhd, he almost never stays on topic or answers a question with a direct answer. He always tells 5 mini stories within a story and loses sight of what he is actually talking about. He is also a prolific interrupter and will interrupt in most conversations without realising. He has a very short attention span and is very distracted during conversations meaning that im always repeating myself. \n\nHe has tried to write in a paper diary, which hasn’t worked as he doesn’t bring it out with him. I’ve also created a shared digital diary for him, he used it once and then only used it if I reminded him to. \n\nPrior to starting a relationship with me he says he never suspected he had adhd and would always put his behaviour down to ‘not being able to multitask’. He was a high achiever and got good grades and has a degree - I know this means nothing in determining if he has adhd as I also was a high achiever but worth noting as it doesn’t seem to have impacted him academically. \n\nWe moved out and got our own place around 1 year ago and since then it seems like the traits are more prominent. Part of me feels like he may just be forgetful / easily distracted but it happens every single day and i feel like the move into our own house (and the additional pressure / responsibility) may have made the symptoms more prominent/visible than before.\n\nHe has also started smoking more cannabis over the past 2 years (maybe 3/4 times a week), I know this will have impacted on his working memory but I also know cannabis misuse can make symptoms worse. \n\nNone of his family (to our knowledge) have adhd. I take stimulants for my adhd and he’s said he will try one to see how it makes him feel. \n\nThoughts?",
        "created_utc": 1678369546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall -&gt; Vyvanse due to Supply Issues?",
        "author": "Ajlee209",
        "url": "https://www.reddit.com/r/ADHD/comments/11msijy/adderall_vyvanse_due_to_supply_issues/",
        "text": "Has anyone made a switch to Vyvanse because of supply issues as of late? My local pharmacies are bone dry of Adderall and I have 10 days left of my current refill.  Thats with taking weekend holidays too.  My next Psyche appointment coincides with that last day coincidentally so I thought about asking to switch to Vyvanse considering there are not supply issues that I am aware of.  Has anyone else made the shift? How does it work for you?",
        "created_utc": 1678369369,
        "upvote_ratio": 1.0
    },
    {
        "title": "adhd changing",
        "author": "dababy20071",
        "url": "https://www.reddit.com/r/ADHD/comments/11mscih/adhd_changing/",
        "text": "[removed]",
        "created_utc": 1678368927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sigils can be Magic (aka, here's a coping strategy that has helped me and some friends!)",
        "author": "YouGoThatWayIllGoHom",
        "url": "https://www.reddit.com/r/ADHD/comments/11ms8th/sigils_can_be_magic_aka_heres_a_coping_strategy/",
        "text": "This started as a comment on another comment (on another comment on anoth-- you get the idea) in another post but it became obvious while writing it that I should put it here, since it's helped other people.\n\nY'all ever heard of sigils? Hear me out. \n\nI don't mean actual MAGIC or whatever. They're just personal glyphs. I have them all over my apartment, in all sorts of forms. \n\nThe most obvious is the one on the inside of my front door. It's two parallel vertical lines with a diagonal across them that are made from blue painter's tape (as are most of them). \n\nThe door is white and the symbol is at eye level. I absolutely cannot walk through the door without seeing it. \n\nIt reminds me to check for my wallet, my phone, and any arbitrary third thing I may be needing for whatever I'm off to do (I don't need one to check for my keys because I lock the door immediately when I leave, so that sigil is built into the door on the other side). \n\n&amp;#x200B;\n\nThe choice for the specifics of the marking is just.... I don't know, it makes sense to me. It's like \"Look down once - do you have your wallet? OKAY, coolcoolcool, look down again, do you have your phone? OKAY coolcoolcool, do you need annnnnything else?\"\n\nAnd putting the tape on the door with my hand that way made me feel like I was Doctor Strange or something. Added bonus.\n\n&amp;#x200B;\n\nAnyway, I have them everywhere. There's even one on the fridge to remind me to take my meds, even though my meds are on the counter next to the fridge. That won't always make me remember, but to open the fridge I have to not only see but physically touch my Sigil. That one is blue tape in the shape of an hourglass. Why? Because! \n\n&amp;#x200B;\n\nYeah it's a little odd, but I'm a professional programmer on the spectrum. I automate absolutely everything I can. Kinda compulsively. I have to. \n\nIf anybody asks about my weird symbols I tell them they're arcane magic and not to worry about it, because that's funnier to me than \"My brain's broken and that helps me not decompose.\"\n\n&amp;#x200B;\n\nI definitely risk identifying myself posting this, but whatever; not that many people see the inside of my door. And if you do/did. . . . Hi! It was just arcane magic; don't worry about it. \n\n&amp;#x200B;\n\nI hope this helps someone else not decompose!",
        "created_utc": 1678368661,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any people who dont take meds here",
        "author": "im_bored2137",
        "url": "https://www.reddit.com/r/ADHD/comments/11ms5go/are_there_any_people_who_dont_take_meds_here/",
        "text": "are there any people who dont take meds and why?\n\nGoing through this subreddit i hear a lot of names for medication doses and even one post when an undiagnosed guy took meds and they helped so much.\n\nBut i want to know if any people dont take meds here\nIf they do why what could i ask my parents for. What works the best and why i felt sleepy.\n\nAre there any reasons you cant take them also how they work and what to eat or not.\n\nIm 13 if it changes anything.",
        "created_utc": 1678368408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for coming to terms with my ADHD diagnosis?",
        "author": "eve2123",
        "url": "https://www.reddit.com/r/ADHD/comments/11ms38p/any_tips_for_coming_to_terms_with_my_adhd/",
        "text": "Hi all, \n\nI have just been diagnosed with ADHD age 27. I’m finding it quite hard to come to terms with. Looking back at my life with a new perspective is hard and I feel a bit of resentment towards my parents for not picking it up earlier (It has been suggested many times in my life).\n\nAny tips for the newly diagnosed would be appreciated 😊!",
        "created_utc": 1678368235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried both Vyvanse/Elvanse and Adderall? Which one did you prefer, and how did they differ for you?",
        "author": "grotesquesque",
        "url": "https://www.reddit.com/r/ADHD/comments/11ms228/has_anyone_tried_both_vyvanseelvanse_and_adderall/",
        "text": "[removed]",
        "created_utc": 1678368138,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any people who dont take meds and why?",
        "author": "im_bored2137",
        "url": "https://www.reddit.com/r/ADHD/comments/11ms0pl/are_there_any_people_who_dont_take_meds_and_why/",
        "text": "[removed]",
        "created_utc": 1678368037,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what degree is ADHD manageable in an office environment?",
        "author": "Hiraeth73",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrwdm/to_what_degree_is_adhd_manageable_in_an_office/",
        "text": "I graduated from university last year. I studied law, which takes 5 years where I live. It was a struggle from the beginning. In the middle I was diagnosed with ADHD. It helped a lot. It explained a lot. Why I couldn't do an internship for more than a month or two before the boredom and anxiety really got to me. I was so confused for so long. I loved studying law, but working in an office always felt so overwhelming and unmanageable. So I convinced myself that law was just not for me. \n\nWell, that was last year. After graduating, I became a teacher. And I love the job. The kids like my chaotic energy, I benefit from a rigid structure without any real supervision. But... I have a good degree in a field that really interests me. And I can still find a job as a lawyer, it's only been less than a year since I graduated. But that won't last long. I have maybe a year before it becomes much harder for me to start my career as a lawyer. And I can always go back to teaching later.\n\nThe thing is, I am scared. I think I am capable enough to be a lawyer. I am afraid that I will not be able to manage my ADHD in an office environment. I have trouble staying organized. Mundane administrative tasks are a nightmare...\n\nI am determined to do my best. I am just afraid. Afraid of quitting soon after starting (again). I am afraid of finding out that I am not suited for this job that I have been preparing for for five years.\n\nIt all seems a little irrational as I type this. I just want to know...can I learn to not only survive but thrive in an office environment? Is there anyone with a similar experience?",
        "created_utc": 1678367712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people with ADHD mostly say stuff and think after?",
        "author": "Odin_Greif",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrr7y/do_people_with_adhd_mostly_say_stuff_and_think/",
        "text": "I pulled the red flag today. For some reason I thought it was ok to talk to an American about school shootings at work💀. Always remember play stupid games win stupid prizes. So does this have anything to do with my ADHD or not? If no you can remove this post or just tell me to remove it. I need serious Help",
        "created_utc": 1678367306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are good grades impossible for someone with ADD?",
        "author": "kissy-missy-no-name",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrogb/are_good_grades_impossible_for_someone_with_add/",
        "text": "I just got officially diagnosed with ADD but my mom, my nurse aunt and a different therapist (not the one I have right now) don't believe I could ever possibly have ADD because I used to have really good grades when I was younger. (20F btw)\n\nIs my diagnosis wrong? Is my mom and the people she talked to wrong? I don't know what the fuck to trust anymore and I'm fucking sick of it. I just want to know what the fuck is wrong with me and get fucking better.",
        "created_utc": 1678367092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with diagnosis from a psychologist",
        "author": "EdgieAlias",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrk19/need_help_with_diagnosis_from_a_psychologist/",
        "text": "About a month ago, I went to see a psychiatrist about getting prescribed ADHD medication. Initially they said they wouldn't be able to prescribe me anything until I got a diagnostic test from a psychologist, but at the end, they did actually give me a prescription, but under the condition that I go see a psychologist to get that test. I am in the Czech Republic, and am struggling to find ANYONE who is able to give this. Are there any keywords I could be using to help find one?",
        "created_utc": 1678366763,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you all make your mind go on leave?? (Kind of long? Felt context was relevant to question)",
        "author": "JFC-UFKM",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrinz/how_do_you_all_make_your_mind_go_on_leave_kind_of/",
        "text": "So I subbed to this subreddit ages ago with good intention of.. ya know, thinking I’ll get involved and be understood/feel better and get peer advice/do better. But anytime I see a thread pop up, I quickly scroll past it to the next bullshit post I don’t care anything about (seriously, how many anime posts can I hide.. when you filter one, 4 more pop up in their place, I swear).\n\nAnyway, for whatever reason I got into this sub tonight and read so many posts. Made many replies in support of or offering thought points to others. One thing that has really reverberated for me though are the posts about HOW DAMNED EXHAUSTING this condition is.\n\nSomeone posted a positive sentiment about realizing that the grace they extend to others should also be extended to themselves.. and how by being diagnosed with ADHD, it was even easier to offer themselves compassion (paraphrased, probably botched that summary a bit).\n\nWith good intent, I replied along the lines of, “yup, also had that experience. Be careful and practice for when that revelatory buzz wears off and now all of the sudden you’re not only responsible for yourself, but when you fuck up, you’re FAILING yourself too! Double whammy!”\n\nI’m a nurse, and I see care-giver fatigue a lot in families of sick loved ones and amongst colleagues. I also see a ton of relationship dynamics and imbalances.. specifically ones that are honestly consensual but toxic (i.e. partner A wants help improving X, partner B agrees to help them with X but some communication is broken and now partner B is associated with the negativity of goal X, cue avoidance, anger, blame, etc). \n\nAll this got me wondering.. for those of you with a strongly dominant critical mental voice that is really trying your hardest in good faith to help the sweet little adhd idiot heart.. how do you give the mental self a break? How do you force them to take time off work and go away for a bit? \n\nFor me, it’s turning in the TV, surfing Reddit, playing with the cat, texting, painting my toe nails, and doing laundry all at once. Or, honestly, drinking enough to drown the constant noise. It’s so exhausting to get that know-it-all mind to shut the fuck up. It’s so loud and logical and creative and gah!!! Outside of pulling my mind in 10 directions, or meditating for like.. 45 minutes, I cannot escape the Judge Judy that won’t clock out.\n\nAnd this is bleeding into my relationships with others. Like.. when people have a one track mind that leads to a billion different types of negative outcomes, I just can. Not. Understand. How someone doesn’t think of alternative plans to every scenario. So I feel hurt that “in all the scenarios you ran in your head, none of them included me”??\n\nI KNOW that many people don’t run through endless tangential thoughts. And I don’t want to either! I’m so tired!\n\nI’m responsibly working on med management with a ADHD specialist. My friends and family praise and admire me with unsolicited appreciation. I am successful AF on paper… but I am so fucking tired.\n\nHow do you guys give yourself a break from your mind?",
        "created_utc": 1678366648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacement for caffeine?",
        "author": "TheSinisterTacoSauce",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrh8v/replacement_for_caffeine/",
        "text": "[removed]",
        "created_utc": 1678366537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was recently prescribed guanfacine 1mg for my adhd and atomoxetine 40mg for my anxiety.",
        "author": "EscapeFacebook",
        "url": "https://www.reddit.com/r/ADHD/comments/11mrb66/was_recently_prescribed_guanfacine_1mg_for_my/",
        "text": "34 male, I haven't taken adhd medication since I was in 7th grade and I'm kind of afraid to begin again. I picked up my prescription yesterday and came home and started reading about all the side effects possible and now I've terrified myself. I went to sleep crying last night because I'm so afraid of possible side effects but also at the end of my rope dealing with my ADHD. One aspect that worries me is possible Is sexual dysfunction. Being polyamorous and a swinger, sex is a big part of my life with my wife and other partners. The thought of not being able to perform is very intimidating... Almost as intimidating as the risk of sudden death/stroke... I know that no one can answer the question of \"is it important enough\" But if anyone has had experiences that they would like to share that would help me in my decision to start I would appreciate it...",
        "created_utc": 1678366039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Replacement for caffeine?",
        "author": "TheSinisterTacoSauce",
        "url": "https://www.reddit.com/r/ADHD/comments/11mr7vt/replacement_for_caffeine/",
        "text": "[removed]",
        "created_utc": 1678365771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you talk to someone else, the way you talk to yourself? If the answer is no, you should probably stop.",
        "author": "sobrique",
        "url": "https://www.reddit.com/r/ADHD/comments/11mr7f4/would_you_talk_to_someone_else_the_way_you_talk/",
        "text": "It's not really an ADHD thing, that we are always our own worst critics. \n\nWe'll feel guilty, worthless and bad for the most minor failures. We hate to feel weak, and we're often too proud to accept help freely offered. \n\nAnd that's not at all an ADHD thing - everyone does that. \n\nBut if you have ADHD? It gets worse. Because you've got points of weakness that others don't. Places where you'll fail, that look like they they should have been easy. And not even just 'easy' - insanely trivial things, that you _just didn't do_, and you don't really understand why. \n\nI'll tell you what else is easy? Blaming yourself for that. \n\nEveryone fails. That's not weakness, that's life. \n\nYou rise again, older and wiser, and do better next time. \n\nThat's all you can _ever_ do. And sometimes the failure? Wasn't because of you at all. ADHD is one of the culprits. But it could be depression. Illness. A tragedy or a crisis of some kind. Lots of things will knock you down, and none of them were ever your _fault_. \n\nADHD is one of those things. I _will_ knock you down. You _will_ fail. And you will feel guilty. \n\nBut try and be a kind person. Try and be an accepting and compassionate person. And then apply that kindness, acceptance and compassion to yourself. \n\nForgive your failure, apologise _to yourself_ and ... do better next time. Don't just \"try harder\". Find a different way that works more reliably. And it doesn't have to be perfect here either. It doesn't even have to work. You _just have to try_ and that's enough. \n\nResist the temptation to beat yourself down for your failure, for all the reasons you wouldn't do that to a friend, or a child. Because it just doesn't do any good at all. They already know everything you have to say, and 'hammering home' the point, just causes trauma that no one deserves. \n\nNo even you.",
        "created_utc": 1678365729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Issues with my Elvanse and possible private Dr problems. looking for some clarification",
        "author": "MereImmortals",
        "url": "https://www.reddit.com/r/ADHD/comments/11mr44h/issues_with_my_elvanse_and_possible_private_dr/",
        "text": "Greetings, I'm recently diagnosed at 35 and have been doing titration with elvanse. I was on 30mg and it was fantastic but my doc said they wanted to try me on 50mg in case it did even better than the 30mg.\n\nSo, I've spent the past month on 50mg and it felt like I wasn't taking anything for my adhd, is this normal? Like I know that the side effects can get stronger as dosage increases but I have been just as scatter brained over the month as if I hadn't taken anything. \n\nAnd now to top it off, apparently, there is a shortage of Elvanse in the U.K according to my private Dr and they may need to find me an alternative. Now, I don't know if this is just me being cynical but it seems strange to me that there is suddenly a shortage when I want to finish titration and get transfered to the NHS and that they will need me to start titration on another med.\n\nCould anyone give me some insight here, am I being overly paranoid? Or are they being legit? And does going too high on the dosage have the same reaction as not taking any meds?",
        "created_utc": 1678365451,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long did you try stimulant medication before changing?",
        "author": "jfourosh",
        "url": "https://www.reddit.com/r/ADHD/comments/11mr1am/how_long_did_you_try_stimulant_medication_before/",
        "text": "Stimulants are fast acting, but I understand some people might have to go through an adjustment period before they start seeing any positive results. \n\nI'm on biphentin (similar to Concerta) on second day now and it's just made ADHD symptoms and my anxiety worse. But I'm going to give it another couple days.\n\nI'm wondering if others have noticed their stimulant medications have change of results after a few days of trial but not right away?",
        "created_utc": 1678365208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you go back to old hobbies?",
        "author": "cranerosed",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqz9i/do_you_go_back_to_old_hobbies/",
        "text": "As someone with ADHD I tend to have a certain hobby I like for weeks or months and sometimes I go back to that old hobby other times I do not. \n\nFor example: I stopped reading books altogether for several years and this year I am trying to get back into reading and let me just say it hasn't been easy to get back into. \n\nAnd for a different example: I picked up painting as a hobby this year as well and I've hardly touched the paint I bought lately.",
        "created_utc": 1678365037,
        "upvote_ratio": 0.99
    },
    {
        "title": "work, college, Dr's appts and exercise- how to fit it all?",
        "author": "lipsticknic3",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqwf6/work_college_drs_appts_and_exercise_how_to_fit_it/",
        "text": "Please help!  I work full time- MF are in the office and TWTh are remote at home. I've got cleaning pretty much handled,  no small feat with 3 pets ! But I've also automated some of the cleaning via vacuum robot which helps a ton. \n\nI am failing my second term back at college.  I never learned to be a student and still don't now how to be one now.. I'm trying.  I can manage school work on weekends but not during the work day.  I'm trying to figure out when to fit in daily exercise. \n\nHas anyone been here?  How do you do it? \n\nI'm medicated on straterra.  I can get stims if you guys anecdotally think that that would help..I just haven't graded up to the stimulant bc it would mean losing my (green prescription) ptsd medication. \n\nLove to hear any ideas or feedback, bc right now my life consists of work and cleaning.  No fun either.  Just working and chores, that's my life.",
        "created_utc": 1678364796,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm too smart to have ADHD",
        "author": "glitchybrainsos",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqtqb/im_too_smart_to_have_adhd/",
        "text": "[removed]",
        "created_utc": 1678364560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obsessed with being early?",
        "author": "ScottieScrotumScum",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqraw/obsessed_with_being_early/",
        "text": "35 male, diagnosed my entire life and non medicated. Does anyone here make it an absolute necessity to be at work before clock in? I aim to be here about 30 minutes early, sit in my truck and I dunno, contemplate life choice's. Anyone else like that or do you press it at much as you can just like we all do with everything and be consistently late?",
        "created_utc": 1678364361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally officially diagnosed with ADD",
        "author": "kissy-missy-no-name",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqr03/finally_officially_diagnosed_with_add/",
        "text": "[removed]",
        "created_utc": 1678364335,
        "upvote_ratio": 1.0
    },
    {
        "title": "It feels like my symptoms are getting worse",
        "author": "tjerryberdet",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqnef/it_feels_like_my_symptoms_are_getting_worse/",
        "text": "A couple years ago I used to be way more productive and I was more easily able to finish assignments on time, but nowadays I can hardly work half a day without being exhausted. It feels like none of my coping mechanisms work anymore. Maybe it's because I started my internships that require a much higher workload that I ran into a wall but I just don't know what to do anymore.\n\nI'm two weeks behind on one assignment and I have another deadline tomorrow for which I had 3 weeks and I'm only a quarter done.\n\nWhat do you do on bad days?",
        "created_utc": 1678364031,
        "upvote_ratio": 1.0
    },
    {
        "title": "tip: try to be productive as you can on normal days, and give yourself a break on the \"fuzz days\"",
        "author": "fugomert",
        "url": "https://www.reddit.com/r/ADHD/comments/11mqb9x/tip_try_to_be_productive_as_you_can_on_normal/",
        "text": "[removed]",
        "created_utc": 1678362968,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long does your Vyvanse take to kick in?",
        "author": "Suspisciouspillhead",
        "url": "https://www.reddit.com/r/ADHD/comments/11mq3bi/how_long_does_your_vyvanse_take_to_kick_in/",
        "text": "I've been taking Vyvanse for a few weeks now. Sometimes it takes two hours but other days it seems to take longer. I took one at 9 AM today, it's 12:30 now and I still don't think it's started working. I did sleep kind of poorly last night and am wondering if that's got anything to do with it. Or maybe just getting used to taking it. Is anyone else in the 3+ hours range for the 'come up'? Can I influence this in any way?",
        "created_utc": 1678362256,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to respond to people that say “just do it”.",
        "author": "quartzqueen44",
        "url": "https://www.reddit.com/r/ADHD/comments/11mpwtk/what_is_the_best_way_to_respond_to_people_that/",
        "text": "Hey, everyone! I am very new to my journey. I only recently realized that I have ADHD. I’ve been working with a general therapist for about five years. ADHD is not something that he is educated on and he’s encouraging me to see a therapist that specializes in ADHD when it comes to focusing on that area of my treatment. As I’m looking, I’ve asked him for advice he can provide in the meantime. He’s the type of therapist whose advice in this area is to just do the things that my body/mind is struggling to do. Be more disciplined. I hear that from other people in my life as well. I don’t know how to explain to them that my lack of motivation is different than just not being unmotivated. It’s feeling like I’m completely stuck. It’s feeling like I’m going through sensory overload. It’s exhaustion and anxiety. As somebody who also has OCD, I think I’m even harder on myself when I feel my motivation start to wane. I want to do the things that my mind and body don’t have the energy to do. Burn out has been one of the symptoms that I’ve struggled with the most in my life because it leads to me being hard on myself. I think that so many people believe that our lack of motivation is laziness when in reality, we want to do the things we’re struggling to get done, we really do. I’m wondering if there’s a way that I can properly explain this to people that they’ll understand. Also, any advice that you have on how you stay motivated, would be greatly appreciated as a newbie to this journey.",
        "created_utc": 1678361637,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found the perfect digital agenda",
        "author": "1ambient",
        "url": "https://www.reddit.com/r/ADHD/comments/11mpt1x/i_found_the_perfect_digital_agenda/",
        "text": "[removed]",
        "created_utc": 1678361281,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just visited the dentist for the first time in my 20s. I’m 29.",
        "author": "Complex_Mulberry_851",
        "url": "https://www.reddit.com/r/ADHD/comments/11mps5n/i_just_visited_the_dentist_for_the_first_time_in/",
        "text": "And it was all fine! They removed some plaque,m and told me to floss more. They weren’t angry that I haven’t seen them in a while and I booked the next appointment straight after so I don’t forget to again.\n\nI was lucky that I manage to maintain decent enough dental hygiene. The only way I was able to do this was because the dentist offers booking through the Doctolib app. For everybody else out there procrastinating booking their dentist appointment: Please go, teeth are the worst ADHD tax to pay.",
        "created_utc": 1678361189,
        "upvote_ratio": 1.0
    },
    {
        "title": "psychiatrist help",
        "author": "sadopossum",
        "url": "https://www.reddit.com/r/ADHD/comments/11mpq4j/psychiatrist_help/",
        "text": "Psychiatrist help\n\nDoes anyone know of any psychiatrists in Washington state that specialize in female adhd? I live in Olympia. I really don't want to go through the whole \"you're wrong you actually have anxiety/borderline\" thing a lot of adhd women seem to encounter :/ I'm asking about this because I decided to use \"done first\" for the first time. The psychiatrist was very patient and understanding, and I was able to get my prescription immediately. It has been life changing, the meds have made me feel so calm, collected, and organized. I truly didn't realize just how negatively my disorder had been effecting me until I tried medication. The silence was the biggest relief I've ever felt. However, in a few months, a new law will REQUIRE I see an in person doctor first. I worry about doctors accusing me of being a faker junkie, since I hide my adhd (inattentive) pretty well. So.. anyone have any recommendations? Advice?",
        "created_utc": 1678360985,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't recommend the \"Nothing Much Happens\" podcast enough",
        "author": "Cold_Independence894",
        "url": "https://www.reddit.com/r/ADHD/comments/11mpp3c/i_cant_recommend_the_nothing_much_happens_podcast/",
        "text": "Like many of you, I'm sure, I have trouble sleeping. I wake up in the middle of the night and can't fall back to sleep. \n\nI recently started listening to this podcast bc Ive been trying to not look at my phone while laying in bed, which is supposed to be horrible for sleep hygiene. \n\nThe results have been tremendous. While I still wake up occasionally, I seem to wake up closer to the time I want to get up and I am still able to fall back to sleep. It also seems to help me fall asleep faster bc I usually don't make it through the second reading of the story before dozing off. In fact, I don't even remember what the story was about last night so maybe I didn't make it through the first one either lol.\n\nI wear a sleep mask that has headphones built into it, and put my earplugs in so that nothing external can wake me up. Since the headphones are still close to my ears it's enough for me to hear the podcast.",
        "created_utc": 1678360883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling very nauseous after eating lunch today at work. Could it be the meds? NO medical advice, just opinions plz.",
        "author": "MrSwipySwipers",
        "url": "https://www.reddit.com/r/ADHD/comments/11mp8ny/feeling_very_nauseous_after_eating_lunch_today_at/",
        "text": "I've been taking Vyvanse 60mg for around 2 weeks now and I've never had this happen to me. I even titrated 70mg, which was too much so I'm now on 60mg.  \n\n\nDo you think it could be the medication or food poisoning? I had a frozen microwavable chicken carbonara with chicken chunks in it for lunch. I think it stayed in the fridge at work for around 4 hours.  \n\n\nFrom 3AM to 4AM it was night and day difference. 3AM I felt like I wanted to work and almost getting bored when not working. Then at 4AM I wasn't sure if I was having a heart attack or a panic attack. I felt like I was going to faint and my face became pale really fast.   \n\n\nNow I'm at home 1h30 earlier than usual because I couldn't keep going, it was hindering my performance and I couldn't stay alert enough.  \n\n\nPlease no medical advice unless you're a doctor, I just want opinions to calm myself a bit. Thanks.",
        "created_utc": 1678359233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for being on time",
        "author": "user59009",
        "url": "https://www.reddit.com/r/ADHD/comments/11mp5nw/suggestions_for_being_on_time/",
        "text": "I, 24 (f), am chronically late, this is a new thing that has been going on for the last, say 2 years. Since I started 6th grade (11 years old turning 12) I got out of bed on my own, made breakfast on my own and got to the bus to go to school on my own, this went on all through my school years all the way through upper secondary school (grades 10,11 and 12). My parents never had to badger me to get out of bed or hurry up to not be late. I was chronically early, and always on good time, the one time I overslept I still made it to the classroom door before the teacher did.\n\nBut since I started on medication for my ADHD (concerta for a bit over a year before switching to Vyvanse which I’ve been on for probably just over half a year) I’ve become really tardy, I’m always late for one reason or another. So I’m looking for advice, since I’m not used to being so late and can’t seem to find a way back to being early. How do I beat this chronic lateness and keep it up? I’m inconveniencing a lot of people who are helping me out by being so tardy, any suggestions are appreciated.",
        "created_utc": 1678358914,
        "upvote_ratio": 1.0
    },
    {
        "title": "are the new generic adderalls actually less effective?",
        "author": "typingwithacrylics",
        "url": "https://www.reddit.com/r/ADHD/comments/11mp4qu/are_the_new_generic_adderalls_actually_less/",
        "text": "\\- I've seen a lot of complaints about the new generic adderalls being less effective as well as claims that popular manufacturers have made changed their formula. Some people notice drastic changes in their response to meds from diff. manufacturers. Overall, it seems to be that they just don't make it 'like they used to.'\n\n\\- Personally, I'm on 20mg ir twice a day from Sandoz (people seem to love TEVA and have mixed reviews on Sandoz). I feel any loss of effectiveness is just my tolerance building, and/or lack of sleep/food that day. \n\n\\- I'm generally skeptical of these claims but also curious to know more about what changes generic adderall has undergone in the last 5-10ish years that would warrant it less clinically effective. \n\n\\- Feel free to drop articles (with links please!) showing supporting evidence for and/or against these claims :) \n\n\\- From what little I've researched so far, I understand that brand &amp; generic drugs must be bioequivalent, and can vary in their ineffective ingredients (like color, binding agents- presumably.) \n\nHere are a couple quotes straight from the fda website, lol:\n\n\"For example, a very large research study[1](https://www.fda.gov/drugs/frequently-asked-questions-popular-topics/generic-drugs-questions-answers#1) comparing generics with brand-name medicines, found that there were very small differences (approximately 3.5%) in absorption into the body between generic and brand-name medicines. Some generics were absorbed slightly more, some slightly less. This amount of difference is expected and clinically acceptable, whether for one batch of brand-name medicine tested against another batch of the same brand, or for a generic tested against a brand-name medicine\"\n\n\"Some differences, which must be shown to have no effect on how the medicine functions, are allowed between the generic and the brand-name product.\"\n\n[link](https://www.fda.gov/drugs/frequently-asked-questions-popular-topics/generic-drugs-questions-answers#q2)",
        "created_utc": 1678358813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice: How do you get over the pressure of having to explain yourself as a multipotentialite?",
        "author": "thefallenangel4321",
        "url": "https://www.reddit.com/r/ADHD/comments/11moxvl/need_advice_how_do_you_get_over_the_pressure_of/",
        "text": "So I, like many of you out here, happen to have a lot of interests and tend to pursue them at different times depending on whichever one excites me at that moment. \n\nThe problem is that I feel an immense amount of anxiety about how people perceive me and feel a strong urge to always control how I come across to other people. Some of the things that scare me are: \n\n1. Coming across as a jack of all trades. \n\n2. Coming across as a person who isn’t truly passionate in life and is simply trying to pass their time with different hobbies. \n\n3. Coming across as the stereotypical billionaire’s wife who dips her feet in almost every business out there to make herself feel worthy. Lol. \n\nI know a lot of this stuff is in my head but that’s always the annoying part about having an anxiety disorder. Do you guys also go through this mental pressure, if so how do you cope with it and how can I rationally convince myself about being comfortable with who I am without trying to control other peoples’ views about me?",
        "created_utc": 1678358087,
        "upvote_ratio": 1.0
    },
    {
        "title": "RSD medications",
        "author": "jojow77",
        "url": "https://www.reddit.com/r/ADHD/comments/11mox7l/rsd_medications/",
        "text": "First of all because of this sub I have finally realized that I’m not crazy after all these years and there are others who has the same experience as me.  Just knowing RSD is a thing and is genetic and made me feel like it’s not mine or anyone’s fault I think like this.  Now what to do to make it better.  \n\nI’ve already realize I had less of these rejection thoughts when I take my regular ADHD meds (ritalin).  But doing more research I learned there is Guanfacine that people take for RSD.  Seeing what others people experience is with it and if anyone has taken both at the same time.  I’ll take to my doc about soon as well.",
        "created_utc": 1678358019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone had success with Guanfacine for their RSD?",
        "author": "jojow77",
        "url": "https://www.reddit.com/r/ADHD/comments/11mouh7/has_anyone_had_success_with_guanfacine_for_their/",
        "text": "[removed]",
        "created_utc": 1678357750,
        "upvote_ratio": 1.0
    },
    {
        "title": "why does adhd symptom level change",
        "author": "dababy20071",
        "url": "https://www.reddit.com/r/ADHD/comments/11mou1z/why_does_adhd_symptom_level_change/",
        "text": "[removed]",
        "created_utc": 1678357707,
        "upvote_ratio": 1.0
    },
    {
        "title": "My adhd is really making it hard for me to focus and i cant get meds due to a toxic household",
        "author": "witheredartery",
        "url": "https://www.reddit.com/r/ADHD/comments/11moriu/my_adhd_is_really_making_it_hard_for_me_to_focus/",
        "text": "I am 24 m and trying to move our of house by getting a job in tech, but I am finding it hard to focus and I went to a psychiatrist in secret and they diagonosed me with adhd, but my parents are not ok with me taking meds. But I am not able to sit and study for long hours and I recently realised I use sugary stuff and masturbation as coping mechanism, as I am trying to cut both of these substances out of my life, I am feeling serious withdrawal or that's just the dopamine depletion crying. Please tell me a way too deal with all of this. I just want to move out and earn money so I can fix myself",
        "created_utc": 1678357450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall = Insomnia",
        "author": "ejchristian86",
        "url": "https://www.reddit.com/r/ADHD/comments/11mopkk/adderall_insomnia/",
        "text": "Hi, new here! I (37f) was diagnosed with ADHD at the end of last year. I started taking Adderall in mid-January, and it's been weird trying to find the right balance. 15mg in the morning is just right for getting through my day, but I can get by with 10mg if I don't have much to do. I also don't take it on weekends because otherwise it feels like it stops working after 8-10 days straight.\n\nThe problem is, even though I'm taking the immediate release formula, I am still completely wired hours after it should have worn off. I took my meds just before 8am; it is now after 2am and I CANNOT SLEEP. My damn brain just won't turn off. It hasn't been this bad since I was a kid!\n\nInsomnia is nothing new to me, but I'd figured out how to minimize it and was actually doing fairly well with falling asleep until I started the Adderall. I've had to stop taking it a few times as I've been sick, and sleep was much easier.\n\nWelcoming any advice or even just commiseration.",
        "created_utc": 1678357239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just started a new job at a restaurant/deli... and it's hell.",
        "author": "AnnoyedDuckling",
        "url": "https://www.reddit.com/r/ADHD/comments/11molr9/i_just_started_a_new_job_at_a_restaurantdeli_and/",
        "text": "[removed]",
        "created_utc": 1678356856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help in diagnosis",
        "author": "treepie-148",
        "url": "https://www.reddit.com/r/ADHD/comments/11moke6/help_in_diagnosis/",
        "text": " \n\nI'm a 15 year old and i think I have ADHD but i couldnt make sure cuz I'm not allowed to visit the doctor. Any advice on how i could get a valid diagnosis?\n\n \n\n&amp;#x200B;\n\n&gt;!this post needs to be 300 characters. so random letters it is rzhdgnjaz ehojnav ezhudjbnjarv zebudojrg nazerudfv jznebdujkgnva ezrmijkdnb nzlomijdknb hozijdkmfhn ghaolzijerkmf dnvslzkjdfm nb gedilfkjmvn  zeldjkm vnlezdjkmf vnrrulzjdnfr jklsdknr vhiljknh ovirjns rnbusrjldfnnsi rjsnvh srljns urksjnvshu rjnrs!&lt;",
        "created_utc": 1678356710,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with nausea from ADHD medication?",
        "author": "Thatwierdcousin",
        "url": "https://www.reddit.com/r/ADHD/comments/11mojr5/how_to_deal_with_nausea_from_adhd_medication/",
        "text": "[removed]",
        "created_utc": 1678356648,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s too easy to get addicted and so hard to stop",
        "author": "thrshejh",
        "url": "https://www.reddit.com/r/ADHD/comments/11modz1/its_too_easy_to_get_addicted_and_so_hard_to_stop/",
        "text": "I’m (19mkr an avid nicotine user, nicotine pouches (snus, it’s way worse than smoking for amount of nicotine).\n\nI’ve been wanting to quit basically since I started 2,5 years ago, but it’s impossible. All my classmates do it and my gf does it. It’s just a thing everyone does in Denmark, when you’re my age. \n\nThe real problem with it is that it fucks my dopamine levels up even more than they already are (ADHD-PI), and it worsens the effect of my concerta.\n\nI don’t know how to approach quitting it, and I’d love some advice.\nAlso, if anyone has advice on how to stop yanking my noodle, that’d be great as well, but it doesn’t affect me as negatively as nicotine does.",
        "created_utc": 1678356062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Advice For Dealing With Insomnia",
        "author": "jslagles",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnz4s/need_advice_for_dealing_with_insomnia/",
        "text": "Hello,\n\nI have been diagnosed with ADHD and for the last twenty years I have dealt with insomnia almost every night. I have been lucky enough to find a medication (Vyvanse - 50mg) that treats my symptoms. I usually do not take my medication on the weekends. I’m not looking to add another medication to the mix, but am hoping someone could relate to my experience and share how they have overcome insomnia successfully. \n\nThank you.",
        "created_utc": 1678354437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social anxiety and ADHD?",
        "author": "glazedpears",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnyyp/social_anxiety_and_adhd/",
        "text": "How do the two impact each other? I feel like my ADHD makes my social anxiety 1000x worse. When I take Ritalin, I feel somehow more socially confident because I can actually fully pay attention to what the other person is saying, rather than my focus being on what to do with my hands, facial expressions or eye contact. It's a vicious cycle. Is anyone else as messed up as I am with this? Haha... Honestly I've been told I hide it extremely well, I'm literally an actress at this point. I have a huge social circle, am well liked and have 'everything going for me', but my life is ruled by anxiety and of course my ADHD.\n\nWho else relates?",
        "created_utc": 1678354417,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will never sleep normally, and I resent it with all my being.",
        "author": "LuckOnEveryFinger",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnp32/i_will_never_sleep_normally_and_i_resent_it_with/",
        "text": "I take melatonin, I have good sleep hygiene, I stay away from caffeine at all times of day, I avoid blue light two hours before bed.\n\nDoes it make a difference?\n\nNo. It makes absolutely no fucking difference.\n\nEveryone around me is asleep instantly. I linger in bed for hours with my mind racing. After a while the frustration will mount to a violent anger and I have to scream into a pillow I’m so frustrated. \n\nIf someone wakes me up in the middle of the night when I’ve managed to fall asleep? That’s it, my whole nights sleep is ruined.\n\nI hate this.\nI hate this.\nHatred is not a strong enough word.\n\nI know it’s my adhd, but there has been nothing to be done about it all my life except suffer.",
        "created_utc": 1678353341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have trouble with randomly getting bored of TV shows for no reason?",
        "author": "Irish_Amber",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnmls/does_anyone_have_trouble_with_randomly_getting/",
        "text": "[removed]",
        "created_utc": 1678353076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys I took Ritalin for the first time and damn, my world changed.",
        "author": "Natural-Suspect8881",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnit3/guys_i_took_ritalin_for_the_first_time_and_damn/",
        "text": "[removed]",
        "created_utc": 1678352689,
        "upvote_ratio": 1.0
    }
]