[
    {
        "title": "Does this happen to anyone else: Headache followed by symptoms similar to a hangover…",
        "author": "DiMarcoTheGawd",
        "url": "https://www.reddit.com/r/ADHD/comments/11o03rc/does_this_happen_to_anyone_else_headache_followed/",
        "text": "[removed]",
        "created_utc": 1678480585,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Concerta shortage now too?",
        "author": "VeronicaPwns",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzxg5/a_concerta_shortage_now_too/",
        "text": "[removed]",
        "created_utc": 1678480182,
        "upvote_ratio": 1.0
    },
    {
        "title": "struggling with the medical expenses to get proper care",
        "author": "papa_moyphee",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzwi4/struggling_with_the_medical_expenses_to_get/",
        "text": "[removed]",
        "created_utc": 1678480114,
        "upvote_ratio": 1.0
    },
    {
        "title": "History &amp; geography questions during eval",
        "author": "an0nym0usgh0s1",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzrlo/history_geography_questions_during_eval/",
        "text": "[removed]",
        "created_utc": 1678479786,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Time Taking Meds — Weird Side Effects",
        "author": "TheReddister",
        "url": "https://www.reddit.com/r/ADHD/comments/11nznfv/first_time_taking_meds_weird_side_effects/",
        "text": "Hi all,\n\nI understand that any advice provided here is not medical advice but I had a more general question concerning medication. \n\nI’m 23 years old and I just got diagnosed with ADHD this week. \n\nMy doc prescribed me 18 mg Trigen generic  Concerta and told me we should follow up in 3 weeks. I picked up the meds and started them on Thursday and I’ve had some side effects that my doctor did not mention and I wasn’t sure what to make. \n\nSo Thursday I took the pill at 7:00 in the morning and I didn’t really notice any of the clarity or focus everyone else talks about. But I did notice feeling incredibly sleepy. At first I chalked it up to not sleeping well but as the day went on I felt more if not equally sleepy borderline sedated. \n\nI didn’t really have any loss of appetite and only a little nausea here and there throughout the day. The one noteworthy thing was I suddenly felt intense sadness that almost made me burst into tears and then suddenly vanished within 10 minutes of coming on. I didn’t really notice any improvement in my ADHD except for impulses being slightly easier to ignore. \n\nI slept fairly normally and woke up today and took my medicine around 8:00 am while eating breakfast. Today I didn’t really have sleepiness but again I noticed not much improvement in my ability to focus. \n\nToday I noticed feeling not just sad but overly emotional, not to a significant degree, but more than usual mainly that i felt sad throughout the whole day for no real reason and that I felt close to tears off very minor things. I noticed other side effects that are expected (heartburn, loss of appetite, nausea) but It’s 3:15 pm when I’m writing this and I still feel kinda sad but don’t really feel like I’m having an easier time focusing or anything. \n\nI sent my psych a message but I’m genuinely wondering if maybe I got misdiagnosed — is any of this normal what should I make of this?",
        "created_utc": 1678479520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Initiating morning routine/doing morning things without needing to be attentive",
        "author": "AbsurdOldham14",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzifg/initiating_morning_routinedoing_morning_things/",
        "text": "I have been struggling, especially recently, with getting out of bed in the morning, getting to class on time, eating, and getting to sleep before 1. I need to wake up at least 60 minutes before I need to leave my house in the morning to go to Community College, but I always, ALWAYS, end up snoozing my alarm until 15-20 minutes until I need to leave and my shower alone takes at least 15 minutes and I’m always 5-10 minutes late. Same thing has been happening more or less since I’ve been alive, but it’s gotten worse recently because I’ve become more independent. I have inattentive ADHD, ASD and OCD and I need some advice/personal anecdotes/random facts/jokes. Oh, and I hate alarms and schedules as well.",
        "created_utc": 1678479207,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm more emotionally stable after getting on meds!",
        "author": "ExpensiveDirt7487",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzg5r/im_more_emotionally_stable_after_getting_on_meds/",
        "text": "I feel like my whole life to this point has just been an emotional rollercoaster, actually thought I had clinical depression for a bit. I used to feel so drained and low-key depressed when I wasn't with people despite appearing aloof and spaced out when I'm around them. And when I was with people I thought they didn't actually like me due to how I perceived harmless statements/gestures.\n\nNow after being on Vyvanse for 2 months it's like I'm perfectly content being alone despite being able to interact with people better. I no longer perceive harmless statements as rejection. Feels like an absolute win but I'm kind of frustrated that I was so scared to get a diagnosis in the first place because I feel like I'd be so much further along in life. I lost two summers to depression and now it's, like, gone. I know ADHD meds aren't supposed to be an antidepressant but considering I'm an overthinker with heavy brain fog despite being a HEAVY extrovert, I think it helped with that and I welcome it.\n\nI know I'm kind of ranting but I just needed to get it out :)",
        "created_utc": 1678479060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forgetfulness in schooling",
        "author": "Klutzy_Canary_7070",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzetv/forgetfulness_in_schooling/",
        "text": "[removed]",
        "created_utc": 1678478975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meds make me more emotionally stable. Anyone else?",
        "author": "ExpensiveDirt7487",
        "url": "https://www.reddit.com/r/ADHD/comments/11nzdkl/meds_make_me_more_emotionally_stable_anyone_else/",
        "text": "[removed]",
        "created_utc": 1678478890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice with Potty Training",
        "author": "TarotxLore",
        "url": "https://www.reddit.com/r/ADHD/comments/11nz731/advice_with_potty_training/",
        "text": "My daughter is 5 years old and still poops in her pants several times a day. \n\nThe doctor has determined that she has held it for so long to avoid stopping what she is doing that she’s just constantly going to suffer with constipation.\n\nShe knows how to poop on the potty AND knows she should. She’s not scared of it, and there is no history of trauma. She simply just…hates how much time it takes. Like it’s literally hell to her. Even if she gets to play video games on the potty, she just focuses on the video games and doesn’t poop.\n\nShe told me she has given up because she “is just not like everyone else”. She’s frustrated, and so are we. She basically has no pants or underwear left and I am constantly having to buy new ones.\n\nJust to reiterate, we’ve had many heart to heart talks with her and heard her feelings on the matter. She just….doesn’t like how it takes time.\n\nShe hates waiting. She hates wiping. She’s currently screaming and crying like she’s being stabbed because she need to wipe her butt and it’s literally covered in poop.\n\nYa’ll please help. I even made a visual schedule reminding her to  poop, wipe, flush the toilet and wash her hands. She just pretends it doesn’t exist.\n\nI know this isn’t her fault or my fault, but I’m just so lost on what to do.",
        "created_utc": 1678478489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some tips with dealing with reading",
        "author": "StatusBoysenberry753",
        "url": "https://www.reddit.com/r/ADHD/comments/11nz5vu/need_some_tips_with_dealing_with_reading/",
        "text": "[removed]",
        "created_utc": 1678478423,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the extremely basic groceries you get to eat when cooking is hard?",
        "author": "babybearkoya",
        "url": "https://www.reddit.com/r/ADHD/comments/11nz2js/what_are_the_extremely_basic_groceries_you_get_to/",
        "text": "I struggle with the amount of mental effort and energy it takes to constantly be thinking about what to eat next, what ingredients to buy to eat things, what ingredients i have that i have to eat before they go bad, etc. I’m asking for everyone else’s go-to “i keep this food in stock so I don’t starve when I forget how to be a person”. Here are my current staples:\n\n-tortillas and shredded cheese for quesadills\n-lettuce &amp; dressing for salad\n-sourdough bread &amp; cheese slices for grilled cheese\n-cans of chili &amp; chicken noodle soup\n-instant ramen &amp; an assortment of delicious sauces\n\nplease let me know if you have any suggestions for food/ingredients I can buy at the grocery store (going rn) for easy but more varied meals. I do have an airfryer &amp; plenty of pots &amp; pans + the ability to cook basic dishes. I’m also welcoming literally any advice you guys have about how to get better about eating, cooking, and being a person. thank you!!",
        "created_utc": 1678478208,
        "upvote_ratio": 1.0
    },
    {
        "title": "I figured out why adhd get misdiagnosed with depression??",
        "author": "Imunique1352",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyw4p/i_figured_out_why_adhd_get_misdiagnosed_with/",
        "text": "Because people only go and seek a diagnosis when it’s really bad, and when interviewing we only talk about the depressive era that we are experiencing and not the ones that we were really active, always on the go seeking stimulation eras(often times forgotten about)?Of course it’s one of the reasons but this could be right.",
        "created_utc": 1678477791,
        "upvote_ratio": 1.0
    },
    {
        "title": "(not even) complex tasks putting me off so much",
        "author": "NearbyHost2451",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyw4t/not_even_complex_tasks_putting_me_off_so_much/",
        "text": "What is it with (relatively) complex tasks that is putting me off so much? And I don't even mean that complex.\n\nI would rather empty the bottom part of the dishwasher (plates and utensils) 5 TIMES than do the top part, where I have to dry off tupperware tops one by one with the cloth and then find where to put them if it would take me less time to do that than the 5x bottom, so it's not a question of time. It's also not procrastination by fear of failure, because this is kinda hard to fail, but it just engages more brainergy than I am willing to give to solve the stupid task. \n\nMaybe a fear of using up too much brainergy? This is screwing me in so many areas of life though.\n\nThis is very in the vein of those posts \"I put off a task for 6 months that took me 15 minutes to do and I will learn nothing from this\"\n\nBTW I stopped emptying the top part of the dishwasher to make this post",
        "created_utc": 1678477791,
        "upvote_ratio": 1.0
    },
    {
        "title": "who likes being on airplanes?",
        "author": "muggledave",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyunb/who_likes_being_on_airplanes/",
        "text": "Im out of meds so ive been having a hard time the past few days. But i have a weekend trip coming up. I just realized that im excited for going on the airplane, not because of any normal person reason, but because its a few hours where i cant do work or housework, or any of my responsibilities. Its a few hours where i can concentrate on whatever i want, or not. Its a few hours where my only task is to wait, and entertain myself. And i can sure as hell do that, sometimes a bit too well.\n\nWho else has had this feeling?",
        "created_utc": 1678477687,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so grateful for vibrators",
        "author": "veganbukakke",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyulg/im_so_grateful_for_vibrators/",
        "text": "Honestly, because I don’t watch porn, it’s very hard for me to manually stimulate myself because my mind is constantly thinking about what I did today, what I’m going to do later, what I want to eat, thinking about future plans months away, etc.\n\nNow I can think all of these thoughts and my vibrator KEEPS working to make me orgasm. 2 minutes and done. \n\nI just realized last night how grateful I am for this technology because it’s difficult staying turned on when my mind is in another realm.",
        "created_utc": 1678477684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to test if your Vyvanse is real?",
        "author": "likewut",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyu1z/is_there_any_way_to_test_if_your_vyvanse_is_real/",
        "text": "I just got bumped up to 50mg Vyvanse after a month at 40mg, but 50mg isn't working for me at all. Is there any way to test if your Vyvanse is real and the correct dose? I got it from CVS but at $400/month I just don't trust that a pharmacy tech didn't dump half the Vyvanse from the capsules or something. I tried to weigh the capsules on a gram scale but it isn't precise enough. It did sometimes show a 40mg capsule slightly heavier than the 50mg but only a couple times - the 50mg always showed 1.0 ct but the 40mg usually showed 1.0ct but sometimes would touch on 1.5ct.\n\nThere have been a lot of anecdotes in here about some months it just doesn't work, which got me thinking that we really don't know if we're getting what we're supposed to be getting, especially with the how much it's worth.",
        "created_utc": 1678477647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online learning isnt as grand as i thought it’d be",
        "author": "nonplayablejackass",
        "url": "https://www.reddit.com/r/ADHD/comments/11nytyf/online_learning_isnt_as_grand_as_i_thought_itd_be/",
        "text": "[removed]",
        "created_utc": 1678477640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing sight of my original intentions.",
        "author": "fragileego3333",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyrrk/losing_sight_of_my_original_intentions/",
        "text": "[removed]",
        "created_utc": 1678477497,
        "upvote_ratio": 1.0
    },
    {
        "title": "recently \"diagnosed\"",
        "author": "JhorvalaastiJarl",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyqdq/recently_diagnosed/",
        "text": "[removed]",
        "created_utc": 1678477400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally diagnosed!",
        "author": "tinyroomba",
        "url": "https://www.reddit.com/r/ADHD/comments/11nykos/finally_diagnosed/",
        "text": "[removed]",
        "created_utc": 1678477025,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I can’t do ONE THING, I can’t do anything",
        "author": "Necessary-Diamond615",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyjxb/if_i_cant_do_one_thing_i_cant_do_anything/",
        "text": "I’m so annoyed by this, and I don’t even know exactly what it is but I’ve sort of heard people have similar experiences, so I’m guessing it’s an ADHD thing?\n\nI’m currently in the middle of exam season, and I feel like I can’t do anything other than study for these exams. Friends wanna go out- sorry, got to study for these exams. Cooking- got to prep easy meals cause I got to study for these exams. It’s so strange! \n\nThe kicker is… I’m not even studying ALL the time, there is room to do more than one thing and I won’t fail if I take one day off. It’s such a huge mental block. \n\nIt’s not just exams, it’s literally everything. If somethings in the way- appointment/gym sesh/ day out with friends/ work-then I can’t do anything else.\n\nI feel like it’s messing with my ability to actual progress and do things in life. Also, makes my decision making soo bad- like if I wanna go gym but I wanna shower- do I shower first, then to gym or gym first then shower- but I don’t want to go outside dirty- so I need to shower. The end result is me doing NOTHING 🤦‍♀️\n\nI need some serious advice and tips guys, because it’s taking up days, months of me doing one thing- that’s did not need to take that long🤦‍♀️\n\nP.S. If anyone else is feeling like this, don’t be too stressed. We got this, just need to figure out what it is first 🤣",
        "created_utc": 1678476972,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to tell if my 12 year old son has ADHD (like I do)",
        "author": "MorBirgit",
        "url": "https://www.reddit.com/r/ADHD/comments/11nydbf/how_to_tell_if_my_12_year_old_son_has_adhd_like_i/",
        "text": "I was diagnosed at 29 years old (I’m female) and I only noticed that something was odd with me when I seemed to struggle A LOT more than my peers after starting med school. Before that I just contributed it to seasonal depression, social anxiety and a complete lack of self worth. Sure I was a handful when I was younger, but I had a horrible childhood where I was thrown from foster home to foster home, and I really acted out, but always though “what child wouldn’t act out under those circumstances”. \nBut, once I landed in a foster home with actual boundaries and adults who knew how to take a firm hand with me, I functioned more or less like any other “normal” kid. I’ve always done well in school, even though I hardly put in any effort. I just think the reason I wasn’t diagnosed was because 1. I was female and 2. I was already the problematic foster child. \n\nI have a feeling that my attention deficit disorder is caused by emotional trauma from my upbringing and NOT by genetics, even though my mom is diagnosed in adulthood too (all though I firmly believe she’s misdiagnosed).\nAfter starting meds 2 years ago (vyvanse) I realize how shitty I’ve actually felt my entire adult life. I’m so happy I got diagnosed. \n\nNow I have begun to wonder how I make sure that my son, who is 12 years old, doesn’t end up like me, having battled years of unmedicated adhd/add with great emotional damage as a result. I really want to help him as early as I can, but as of now I’m not sure exactly what signs to be watching out for in a kid.\n\nWhat did you notice in your kid that made you wonder whether or not he or she had adhd/add? No one in my child’s daycare, kindergarten or school has ever brought up the idea of him having a diagnosis, but then again so did no one ever when i was a child. \n\nI’m looking forward to reading your replies. Have a great weekend everyone",
        "created_utc": 1678476550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yesterday I got diagnosed with ADHD...... but now what?",
        "author": "Some_Ad_3129",
        "url": "https://www.reddit.com/r/ADHD/comments/11nyclw/yesterday_i_got_diagnosed_with_adhd_but_now_what/",
        "text": "[removed]",
        "created_utc": 1678476501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bupropion muscle jerks?",
        "author": "ImportantObligation2",
        "url": "https://www.reddit.com/r/ADHD/comments/11ny9w8/bupropion_muscle_jerks/",
        "text": "I know a lot of people have had not great experiences with this for ADHD treatment, but it has tremendously helped me. I’m on 150 mg of bupropion and 40 mg of Vyvanse but ever since I started the bupropion I’ve had uncontrolled muscle jerks in my legs and arms. I noticed this when I was only on Vyvanse to but it definitely got worse after adding the bupropion. \nHas anyone experienced this? Does it go away? Given the choice, I would stop taking my Vyvanse before Bupropion but I can’t deal with the jerking.",
        "created_utc": 1678476317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting treatment",
        "author": "LD-LB",
        "url": "https://www.reddit.com/r/ADHD/comments/11ny9cq/starting_treatment/",
        "text": "Finally had a chance to see a psychiatrist for the first time in my life and she prescribed me Adderall 5mg XR to start. My only problem is that it makes me extremely sleepy and feeling sluggish. I've read a couple posts from here and that doesn't seem like a normal side effect. Anyone else here experience that on Adderall?",
        "created_utc": 1678476285,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I was misdiagnosed with anxiety/depression",
        "author": "whiskeywaterss",
        "url": "https://www.reddit.com/r/ADHD/comments/11ny3er/i_feel_like_i_was_misdiagnosed_with/",
        "text": "Hi everyone. I recently just had a very thorough ADHD screening and they determined I was very close (.9 points away) from being ADHD, but instead diagnosed me with major depression, GED, panic disorder, and reading/comprehension learning disabilities. \n\nThe thing is, I’m adamant I am ADHD, I’ve always had trouble focusing since childhood and meet all of the criteria for ADHD. I believe my anxiety and depression actually stem from ADHD. \n\nIm actually really disappointed I didn’t get diagnosed, because I was hoping this would help. My therapist is diagnosed with ADHD and was convinced I am too, she’s she one who recommended the testing. \n\nI’m just lost now, wanted to see what options you all might have.",
        "created_utc": 1678475899,
        "upvote_ratio": 1.0
    },
    {
        "title": "So like... what happens when I run out of my meds??? (Concerta)",
        "author": "DesignerPumpkins",
        "url": "https://www.reddit.com/r/ADHD/comments/11ny1pf/so_like_what_happens_when_i_run_out_of_my_meds/",
        "text": "I've been on 18mg of Concerta for over a year at this point and it helps a lot and makes me feel like more like a person BUT this year when I went to fill my script at KP pharmacies (my normal) the hit me with a $438 price tag and I like literally saw stars!! \n\nObviously I couldn't pay that, they said it was because I hadn't paid my \"minimum deductible for the yr yet\" (no sh\\^t it's only March) so it was full price and that after that it would go back to being my 30% co-pay but the thing is it was only a month script and usually my scripts were for 3 months and it was only ever between $40-$60. So even at 30% of $438 it would be over $100 for ONE month... like way to change the game!! I can't afford that! \n\n&amp;#x200B;\n\nSo I looked up GoodRx online and figured out how to get it from another Pharmacy out of KP's network for way cheap ACCEPT no other pharmacy's HAVE any pills and they have NO idea when they will get more in. \n\n&amp;#x200B;\n\nI'm on my last week of pills. I started trying to sort this whole process of getting my meds filled back around Valentines day because my Physiatrist sent out a letter letting me know that they were leaving KP's network and when I tried to call to get referred to another Physiatrist in network they said it would take OVER 3 MONTHS because they had a shortage of doctors... so I said awesome but I need a refill on pill before then and now I don't have Dr. to fill it so they got like a supervising Dr to fill it in the mean time, which went how I described above when I went to pick it up... and now here I am... \n\n&amp;#x200B;\n\nSo I'm basically i am assuming there's no way I'm going to be getting my meds filled in the next 8 days and I don't see myself suddenly having a spare $400 dollars on hand so... what am I accepting? Is Concerta something that will mess you up bad if you're just cut off?? \n\n&amp;#x200B;\n\nI literally have no idea what to do and I don't have a Dr because mine just freaking quit my medical provider and they're no new ones for me to go to for months....",
        "created_utc": 1678475787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holding Myself Accountable",
        "author": "Beazfour",
        "url": "https://www.reddit.com/r/ADHD/comments/11ny03g/holding_myself_accountable/",
        "text": " Finally got an official diagnosis of ADHD at 20, and along with meds trying to figure out ways to deal with it.\n\nIs there any advice or methods people have for holding myself accountable to the goals or routines I try and set? Things like brushing my teeth, doing my laundry, or atm making the effort to learn Spanish while I work in a place where it is spoken regularly lol.",
        "created_utc": 1678475687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holding Myself Accountable",
        "author": "Beazfour",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxyoy/holding_myself_accountable/",
        "text": "[removed]",
        "created_utc": 1678475595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urine Drug Screen for Refill",
        "author": "artsyTeehee",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxy1c/urine_drug_screen_for_refill/",
        "text": "I've been with this practice for several years (Virginia) and this time when I went in, because I have to go in every so often physically to get a refill, I had to sign a contract saying they could drug test me at any time for prescription abuse and that I would pay for it.\n\nExcuse me what?? Like this seems like your office policy sir. Does your office have problems with prescription abusers? Probably there was a lot of detail about pain prescription abuse... Like I get it, you guys want to protect yourselves from your patients legally. But this can't be a thing everywhere. It just feels like a breach of privacy to treat mental health.\n\nCurious what issues you have to deal with getting prescriptions refilled.\n*There was a practice that tried to get me to go to their psychiatrist for a refill for a prescription I've been on for  years. Noped out of there",
        "created_utc": 1678475553,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some relationship advice for males with ADD",
        "author": "InfinityLord3392",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxxjx/i_need_some_relationship_advice_for_males_with_add/",
        "text": "I'm a male, 19 years old and I was diagnosed with ADD last summer and... Looking back I believe a lot of my issues from social connections might originate in my diagnosis. Idk maybe it's just an excuse I'm telling myself but now that I have a partner again, one I really care about, I want to be the best version of myself I possibly can be. \n\nI believe my ADHD/ADD Is towards the lighter end? I feel like my main problem is lack of focus, and... Too much focus on the wrong things (for example videogames and whatnot). I know everyone with ADHD experience it differently and that we are not the same, not completely, but I was wondering if there was some general advice I might benefit for in my relationship? my girlfriend knows I have it, but I still want to be a good partner. Is there any good advice you can give me? Advice from both men and women is welcome so I can learn from both ends, thank you. :)",
        "created_utc": 1678475521,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD symptom maybe? Socialization issues",
        "author": "CaptenAE",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxuug/adhd_symptom_maybe_socialization_issues/",
        "text": "So I have been diagnosed for ADD/ADHD. Tried adderall and did not help me. Made me pee a lot, made me very tired, made me focus on procrastination, and made me very short tempered and annoyed with everyone around me. I've been med free since. That aside, I'm beginning to wonder if this part of me I will describe is a symptom of ADHD or more of an issue with Anxeity or trauma of some kind. Just trying to pinpoint it and cross this off the list if others don't feel the same. \n\nIn social situations, I find I am a very talkative and outgoing person when I am around people I know very well and am fully myself around. I am also good in social situations where others are more submissive than myself in conversation. Also with those I can tell are insecure. I find it very easy to talk to these people, as long as there is dialogue going back and forth. \n\nOn the opposite end, when I am around strangers, talking to dominate personalities, or loud individuals, I find it impossible to talk. There is this weird fear if sounding dumb or being \"caught\" as if I am hiding something from them. This also happens when I am with a friend I am normally open and myself around who becomes outgoing around strangers I do not know. \n\nIt's like a switch in my brain triggers that says to be quiet and don't say anything dumb. Recently, this has been an issue at work. I am able to talk just fine if I am talked to. Unless it's my boss. I think I get this sense of imposter syndrome. Like I somehow tricked him into hiring me and now idk what to do and am extra careful with what I do and say around him to the degree that I become autisticly silent and awkward. Part of me worries it may cost me my job eventually. \n\nI seem to be on the inattentive side. I am often silent in my life unless I'm around people I work well with. With those people I am pretty hyperactive. They might even describe me as annoyingly loud. \n\nFor years now I've been trying to figure this out in my life but it's looking like I might need therapy for some answers.",
        "created_utc": 1678475351,
        "upvote_ratio": 1.0
    },
    {
        "title": "work / house work / life balance",
        "author": "jahfuckry",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxmm4/work_house_work_life_balance/",
        "text": "My mental health has been the most stable i’ve ever been in my life for the last 6ish months since i started the first job I’ve-ever been able to stick out. However now I really see what people mean when they talk about the balance. I’ve always struggled keeping on top of house work and cleaning; my long term partner and I have been wanting to move in together for a while, but he has hesitation because he doesn’t want to do more than his fair share, which is a valid concern. I want to tell him I would work better when we share the chores and do them together but I know he needs me to be able to handle things on my own when needed and he is 100% right. \nI’m basically asking for tips and tricks you use for motivation and scheduling yourself and stuff. I’ve read a lot on google but would really like any perspective I’ve not heard or have heard that I could try to incorporate\n\nThankyou",
        "created_utc": 1678474842,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't stop talking about my mental illnesses",
        "author": "SidBid6",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxmit/i_cant_stop_talking_about_my_mental_illnesses/",
        "text": "Hey there. I'm a guy fairly recently diagnosed with ADHD. Just a few years before, I was diagnosed with GAD and specific phobias. I was given medications for them (one of them was an SSRI, which obviously didn't work in light of the discovery of my new diagnosis), Anyways, the reason I pointed those out is that after I was diagnosed with anxiety, I almost immediately began telling everyone I knew and their mother that I had anxiety and I was taking medications for it. And almost immediately after, I regret every word that came out of my mouthhole because I always realize that I just dumped very personal information about myself to everyone who'd listen.\n\nFast forward, I began suspecting that anxiety just didn't cut it. Something else was doing stuff to my brain that was the underlying cause for why I had GAD or GAD-like symptoms (we're not sure which one yet). You probably figured out what it was considering I'm writing in this sub. Long story short, I had ADHD. Again, almost immediately after my ADHD diagnosis, I began spilling out to other people about my new and shiny disorder. My friends, my classmates, the security guards in my new residence, the landlord of my residence, and people I only recently met all have pretty long and winded information about me and ADHD in general that I would rather they didn't know in hindsight. After every impulsive sharing, it felt like I was using my condition to monger for attention, which did very great for my low self-esteem and imposter syndrome thank you very much. It's probably the impulsive symptoms of the disorder that's causing me to spill so much of my personal life to others, and it can be so annoying, and potentially even dangerous if the wrong people knew about the exact time I take my meds or who my therapist was.\n\nAnd yes, I'm well-aware that I'm doing it again by posting this here.",
        "created_utc": 1678474837,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and person/identity-first language",
        "author": "Specialist_Spend_357",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxlyh/adhd_and_personidentityfirst_language/",
        "text": "So I work in behavioralism. I’m still fairly new to the field and have a lot to keep learning, and in a lot of the reading/training I do a common theme is whether to use person-first language or identity-first language. As someone with ADHD, I myself don’t really like the options for either when referring to my disorder. On the one hand, “person with ADHD” feels like it separates it too much from my experience, while “ADHD person” feels like it overcorrects and makes it too central and “ADHDer” just sounds…kinda corny, and making it into kind of a verb just bothers me. So I’m curious: what do you all think about how you prefer to refer to your ADHD? Do you prefer person or identity first?",
        "created_utc": 1678474808,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you even get your prescription filled?",
        "author": "bubblebutt748",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxepl/how_do_you_even_get_your_prescription_filled/",
        "text": "I got diagnosed with ADHD months ago. I paid 300$ to take the “necessary” tests. Finally today they prescribed me the medication. I called 10 different places and none of them have concerta. What do I do?? How do you guys even get your medication?\n\nWord word word word word word word word Word word word word word word word word Word word word word word word word word Word word word word word word word word Word word word word word word word word this word count thing is horrible i just have a question",
        "created_utc": 1678474336,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you even get your prescription filled?",
        "author": "bubblebutt748",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxd4n/how_do_you_even_get_your_prescription_filled/",
        "text": "[removed]",
        "created_utc": 1678474239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people with ADHD have the need to always be right?",
        "author": "PachMeIn",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxchz/do_people_with_adhd_have_the_need_to_always_be/",
        "text": "My husband and daughter both have ADHD, I do not. My husband and daughter seem incapable of admitting mistakes or misunderstanding and moving on. They become immediately defensive and will go to great lengths to argue their point so they appear right, despite the fact they are not. It can be frustrating and exhausting, not to mention, it’s not even necessary to do the majority of times. I am curious if this is an ADHD obsessive-like behavior or a result of past shame from struggles my husband had as a child (now husband is passing habit to our daughter)?  They are both amazing people with good hearts so I don’t see this as them being difficult on purpose, but I think it’s important to be able to admit when you’re wrong, give yourself the opportunity to learn, and correct things so you can move one.\n\nA simple example is my daughter misinterpreted a math question and argued why she was right instead of just fixing it and moving on. To me, it’s not that serious and I always tell her that mistakes don’t equal lack of intelligence (she thinks everything has to be perfect). An example for my husband is he will say I said something in a text when I didn’t. He eventually goes back to the text and sees that he’s wrong, but still will argue he was right for one reason or another.  \n\nI just always feel like they keep score and it’s just exhausting to me. Just curious what you all think.",
        "created_utc": 1678474201,
        "upvote_ratio": 1.0
    },
    {
        "title": "experiences combining wellbutrin with other non-stimulants?",
        "author": "mononokke",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxbxy/experiences_combining_wellbutrin_with_other/",
        "text": "Basically title, looking for advice or experiences combining wellbutrin with other ADHD non-stimulant meds. \nbasically my psych is incredibly hesitant to prescribe me stimulants without an official diagnostic exam (I can’t afford one right now). I’m not upset about it because from my history taking stimulants in college adderal is nasty for my anxiety, and makes me irritable and jittery even on 5mg.\nso far I’ve been on wellbutrin for about 3 months. it was shaky at first and the first couple weeks I could barely eat or sleep and the increase in anxiety… was really hard. but after that, it started to even out. the next few weeks were the most myself and motivated I have felt in maybe my whole life. everything was easy, everything I wanted to do I just got up and did it, I was so happy. we’ve upped my dose to 300mg this month but now at the 3 month mark I’m noticing that the effects are much more subtle. I don’t feel like I’m on a drug anymore for one. it has done wonders for my mood and depression and I would like to keep taking it, but it leaves a lot to be desired for executive issues and focus. \nI’ve read lots of the threads on here about wellbutrin combos but it’s so much information to process from individual posts, so I’m here to ask for people’s experiences and hopefully success stories combining wellbutrin with other non stimulants (such as guanfacine, strattera, clonidine, viloxazine), how it interacted, and if it helped with executive function and focus.\nthank you in advance!!",
        "created_utc": 1678474165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does ADHD make gaming harder?",
        "author": "Alibium",
        "url": "https://www.reddit.com/r/ADHD/comments/11nxahz/does_adhd_make_gaming_harder/",
        "text": "I’ve been playing many games for many years, but no matter how hard I try I usually don’t get really good at anything. In fact I’m WAY BELOW AVERAGE! I never get better and I often die quickly in a lot of different games. I struggle getting better even when I know what to do… And trust me I’ve really tried, and when I see other people who ain’t too good get better than me cause the things I tried actually works for them, it’s quite frustrating.\n\nI also got Tourettes just FYI… so yeah the entire package \n\nAm I just destined to be trash cause I’m bad, or am I trash because of something else?",
        "created_utc": 1678474065,
        "upvote_ratio": 1.0
    },
    {
        "title": "hyper fixating on ppl i don’t like",
        "author": "concretecruncher",
        "url": "https://www.reddit.com/r/ADHD/comments/11nx252/hyper_fixating_on_ppl_i_dont_like/",
        "text": "so ever since last year started my brain has started taking a random person that i’ll admit, i kind of look down on (for valid reasons, the last person my brain used was some racist guy from high school) and it just drills their face into my brain. whenever i try to read, sleep, or sometimes even do things like watch tv, they won’t get out of my head. this has been going on for so long and it’s gotten fucking exhausting, and i’ve got enough problems to worry about without this. have any of you guys experienced this? and if so, please tell me how to stop it.",
        "created_utc": 1678473513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day one on Vyvanse!",
        "author": "Caffeinatedlawgirlx",
        "url": "https://www.reddit.com/r/ADHD/comments/11nwwl6/day_one_on_vyvanse/",
        "text": "Sure you get a lot of these posts here, but just got diagnosed and today is day one on Vyvanse! I feel so calm, like my anxiety just melted away. Did some cleaning, getting some work done now, and just having a mellow day. So glad I finally figured out what was going on with this part of myself so I can take this big step forward.",
        "created_utc": 1678473165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you tried an online pharmacy for your prescriptions?",
        "author": "eager_beaver_4_u",
        "url": "https://www.reddit.com/r/ADHD/comments/11nwgpn/have_you_tried_an_online_pharmacy_for_your/",
        "text": "I know a lot of people are struggling with getting their scripts filled. I was in the same boat for the last couple of months. And I haven’t seen anyone recommend an online pharmacy. \n\nMy doctor suggested using my online pharmacy provider for my Adderall prescription. I had always assumed filling a schedule 2 through mail order wasn’t allowed. But my online pharmacy shipped me a 90 day supply. Without any problems. And I don’t have to call every month to fill it, like I had to do with Walgreens, they just fill it if I have a script on file. And they will fill 9 days early for a 90 day script.\n\n\nThis is in California and the online pharmacy is OptumRX",
        "created_utc": 1678472156,
        "upvote_ratio": 1.0
    },
    {
        "title": "(VENT) I can't stand it. This stupid condition is ruining my life.",
        "author": "Sauber_GT2000",
        "url": "https://www.reddit.com/r/ADHD/comments/11nw9n2/vent_i_cant_stand_it_this_stupid_condition_is/",
        "text": "[removed]",
        "created_utc": 1678471701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse making me depressed",
        "author": "AdventurousReveal858",
        "url": "https://www.reddit.com/r/ADHD/comments/11nw7ne/vyvanse_making_me_depressed/",
        "text": "[removed]",
        "created_utc": 1678471578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impulse Controll",
        "author": "Feeling_Paper_2245",
        "url": "https://www.reddit.com/r/ADHD/comments/11nw14q/impulse_controll/",
        "text": "[removed]",
        "created_utc": 1678471187,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD-Friendly Web Browser, built for productivity and limiting distractions",
        "author": "cazzles",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvx62/adhdfriendly_web_browser_built_for_productivity/",
        "text": "[Sidekick](https://join.meetsidekick.com/ycj6s) is a new browser and that is continuing to grow daily with an aim to offer a distraction-free experience. I've been using it for a couple days I feel like it's really got a lot to offer. If you're anything like me and usually have 16,284 google chrome tabs open at all times, Sidekick offers some really smart ways to optimise your viewing experience and decluttering your digital space.\n\n• It's main feature is a sidebar which you can keep all your to-go apps and websites active at all times. They act completely separately from tabs so immediately clean up a lot of space. \n\n• It has a feature called 'Sessions' where you can save groups of tabs, start new sessions and come back previous ones later. \n\n• There is a built in search feature which will search through all of your opened tabs, session'd tabs, history, bookmarks and so on.\n\n• You can also restrict your access to certain websites (such as social media) during certain hours so you can stay on task.\n\n• I like that it also has this built-in 'Tasks' feature where you can write in and check off daily and weekly tasks.\n\nOn-top of all the ADHD-friendly tools, it's got a lot of other features, such as direct compatibility with Google Chrome and it's extensions, built-in ad-blocker, suspends inactive tabs to save RAM for a faster experience and split-screen viewing for multiple tabs\n\nAs a way to bring more users, they have asked their users to send an invite link to people for them to download Sidekick. You can get a free trial of [Sidekick Pro here](https://join.meetsidekick.com/ycj6s) (no payment details required). Hopefully it will continue to flourish and eventually they will be able to make the Pro features free for everyone!",
        "created_utc": 1678470930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surviving Focalin",
        "author": "Azizzio",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvukk/surviving_focalin/",
        "text": "So I was doing great on a drug called Jornay PM at 40mg paired with a low dose of Guanfacine. Unfortunately, the shortage has finally hit Jornay in my neck of the woods, and I also just left my job, so I have a gap in insurance and the Jornay coupon code doesn't work anyway until I get insurance again. \n\nSo my doctor decided to put me on generic Focalin XR, 15mg, in the meanwhile, since it's available and inexpensive. Holy crap, this stuff is horrible. Day starts with intense quivering and shaking for a few hours (not necessarily heart racing though), then I get really hot, then there's a brief window where I feel fine and can focus before in the afternoon I alternate between huge, overwhelming bouts of anxiety and bouts of irritability (which I've never felt on any meds before) where I grit my teeth and just want to punch someone. It's hard to gauge how well it's working on my executive function because I am spending most of my day just trying to fight through and manage these side effects. My doctor sent over a scrip for something else, but surprise surprise it's backordered too and we're well past what the pharmacy estimated. \n\nI think that I'm going to be stuck on this crap for a while, so can anyone offer any advice on managing the symptoms? I've found that 30 minutes of moderate intensity cardio immediately after taking my dose helps to alleviate the shakes, but I have joint issues I'm recovering from and cannot do that every day yet. I'm not really sure what could help much with the anxiety or irritability. I've heard for example that water intake influences the release of Vyvanse- would anything like that apply here?\n\nI'm a student with a heavy workload and I can't afford to have my life ruined by this horrible drug, but I'm just about useless unmedicated, so I really need this stuff to work.",
        "created_utc": 1678470751,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop speeding?!",
        "author": "squidneythedestroyer",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvt0l/how_to_stop_speeding/",
        "text": "I have a speeding problem. \n\nPersonally I don’t actually see speeding as much of a problem — I’m from Texas where people speed a lot all the time and it’s not a big deal, and lots of countries don’t have speed limits because they’re not really necessary and mostly are just a way to get money from people and give it ti the government. From what I’ve found, speeding doesn’t actually make crashes more likely to occur, but high speeds do make crashes more deadly, which is a problem. I’ve personally never had an accident or even a close call, and I never feel unsafe while driving or like I’m ever making anyone else unsafe.\n\nThe problem is I keep getting speeding tickets and I can’t stop. It’s not stubbornness, I’m not intentionally speeding. I TRY to go the speed limit, but usually when I’m paying attention to the road and to my driving, I forget to look down at the speedometer since I find it distracting. I legit feel like looking at the Speedo when I drive takes my focus off the road and makes me a worse driver. Then, when I do look down, I often realize I’m going too fast even though it FEELS like I’m driving a totally appropriate speed. It drives me crazy.\n\nI’ve read that ADHD people are way more likely to speed than others. For some people it’s more of an impulsivity thing — they just can’t stand going slow or they get annoyed at other drivers, so they speed. For others it’s more of an inattentive/hyperfocus thing — they’re focused so much on the driving that they forget to check for speed. I think I definitely fall more into the latter category.\n\nI’ve heard a lot of people say to use cruise control, the problem is my car doesn’t have that kind of like automatic/responsive cruise control and I live in the mountains now, so putting on cruise control kind of feels like begging to get in a wreck or drive off the side of a mountain around a curve.\n\nAnyone have any thoughts on this? Have y’all struggled with speeding, and how did you fix it? One of the things I’m thinking of is getting a dash cam speedometer that beeps when I go over the speed limit, that way even when I’m not paying attention I’m made aware of my speeding. Any other thoughts?",
        "created_utc": 1678470642,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Friendly Long Term Disability Insurance Companies?",
        "author": "boulder_joe",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvsd2/adhd_friendly_long_term_disability_insurance/",
        "text": "I was recently diagnosed with Combined ADHD at 42, and when applying for Disability they changed a 20 yr policy to 5 yrs physical disabilities only based on my ADHD diagnosis. Throwing out any mental disability coverage due to ADHD clearly shows they have no understanding of ADHD and likely just want me to go away. \n\nHas anyone had luck getting more favorable Long Term Disability coverage that actually looks into the history of the insured and actually understands more about ADHD?",
        "created_utc": 1678470601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could I have ADHD even with a successful life?",
        "author": "Impressive-Court-549",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvrbx/could_i_have_adhd_even_with_a_successful_life/",
        "text": "[removed]",
        "created_utc": 1678470527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deodorant suggestions?",
        "author": "dannyisaphantom_",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvnaw/deodorant_suggestions/",
        "text": "Have been on Vyvanse 70mg for the better part of 5 years now - but I’ve developed an allergy to the deodorant I’ve been using since high school because…life just finds a way I guess.   \n    \nI know it’s the metals in the product - but this is an incredibly not-great situation since ROTC dictates that I be active semi-regularly. While I love Shrek, I do not want to live in a swamp.   \n  \nAny suggestions that work for you?",
        "created_utc": 1678470252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feelings, having them",
        "author": "second-half",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvjiu/feelings_having_them/",
        "text": "I've spent my whole life with two primary feelings: happy/content and overwhelmed. Sure, sometimes I experience anger/frustration or sadness, but that was only when the event was so major it creeped on through. \n\nIt seems with medication, I am able to go slow enough so that if I have a feeling, it can do what it is supposed to do - arise in my consciousness and inform me. As the feeling informs me, I can process it, decide a course of action, and then let it pass and carry on. It feels very healthy. \n\nI'm struggling this morning because I am realizing how disenfranchised the people around me, people I interact with daily have felt as I entered a space with my energy, ideas, and took over, everywhere with everything. I can imagine they think I don't care. I do. I feel like I do nothing but care. Caring is my whole world and the reason I work so hard all the time. I'm constantly solving, communicating, keeping things on track. But what I am hearing is that people leave me thinking, \"Wow what a jerk she is!\" Man oh man, how am I gonna fix this?\n\nJust my thoughts this morning. Feel free to respond or not. After the lovingly-delivered feedback I got this morning (that I requested), I am working on reading a room these days. It's not enough to tell me to listen, because I do. I just get so excited up in my brain and it has to come out. Sheesh. I have so much to learn",
        "created_utc": 1678470011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else who tries to count letters in word and see if they're multiples of 3, 4, 5 etc ?",
        "author": "Familiar-Pen-2559",
        "url": "https://www.reddit.com/r/ADHD/comments/11nvixi/anyone_else_who_tries_to_count_letters_in_word/",
        "text": "[removed]",
        "created_utc": 1678469972,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Life is about to Change - Job",
        "author": "CharacterOpening1924",
        "url": "https://www.reddit.com/r/ADHD/comments/11nviru/my_life_is_about_to_change_job/",
        "text": "[removed]",
        "created_utc": 1678469963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else found they crashed/became irritable relatively quick on Vyvanse? Have you found something that works better for you?",
        "author": "Historical-Fall163",
        "url": "https://www.reddit.com/r/ADHD/comments/11nv9n0/has_anyone_else_found_they_crashedbecame/",
        "text": "[removed]",
        "created_utc": 1678469370,
        "upvote_ratio": 1.0
    },
    {
        "title": "weight training supplements and ADHD",
        "author": "creaturres",
        "url": "https://www.reddit.com/r/ADHD/comments/11nv9eq/weight_training_supplements_and_adhd/",
        "text": "Obviously caffeine doesn't do well for actually giving energy for people with ADHD, I'm just wondering if BCAA, L-carnatine etc all do the same and actually just make you sleepy? \nI cannot for the life of me seem to get the energy to go back to strength training.... The executive dysfunction is REAL so I'm looking for ANYTHING that might trick my brain into letting me move.",
        "created_utc": 1678469354,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it okay to disclose my ADHD to my manager or I risk discrimination at work ?",
        "author": "CuriousMind7577",
        "url": "https://www.reddit.com/r/ADHD/comments/11nv7eb/is_it_okay_to_disclose_my_adhd_to_my_manager_or_i/",
        "text": "So i am working for a standard office company and my process is extremely long, not necessary complicated but there's just tons of stuff to always remember and keep in the back on your head, returning to it for correcting something, following up with emails, chasing people for obtaining the correct sources of information, updating stuff, being present at the schedules calls, ext ext. \n\nIt just feel so fucking overwhelming and after close to a decade hiding my condition to the job world, I'm seriously wondering if I should not just talk about it before I'm drowning. The amount of stress it gives me even sometimes plays with my heart rates and stuff. I know it's completely idiot , million of people do the same as me and carry on, but it is just so exhausting to always have to \"manually\" remind yourself of being focus and that everything require attention.\n\nSo yeah if anyone has an opinion or story to know if it's a smart idea for having i don't know help or some sort of special care when it comes to tasks, \n\nOh and before you ask no i don't take any medication because I just cannot bear it, gave me some weird secondary effects when I was kid, so just kept on without it.",
        "created_utc": 1678469217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crashing after taking Vyvanse - anyone else?",
        "author": "Historical-Fall163",
        "url": "https://www.reddit.com/r/ADHD/comments/11nv3vm/crashing_after_taking_vyvanse_anyone_else/",
        "text": "[removed]",
        "created_utc": 1678468982,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I feel too excited (either good or bad) I can’t function at all",
        "author": "bewbzrcewl",
        "url": "https://www.reddit.com/r/ADHD/comments/11nv1kj/when_i_feel_too_excited_either_good_or_bad_i_cant/",
        "text": "When I’m too excited or anxious it is super hard for me to concentrate or even do simple hands on things. Previously I was taking 18 g of strattera for a month. And 5 days ago my dose got moved up to 40 i have noticed a change in being able to get up and get stuff done but not in my anxiety and how it relates to my functioning.",
        "created_utc": 1678468833,
        "upvote_ratio": 1.0
    },
    {
        "title": "abusing my meds. I really need help",
        "author": "toigalilly",
        "url": "https://www.reddit.com/r/ADHD/comments/11nv0fz/abusing_my_meds_i_really_need_help/",
        "text": "Background\n\nAbout two years ago I was diagnosed with ADHD and prescribed Ritalin (5mg). At first it was great, my anxiety dropped and had clear thoughts. But my tolerance grew and with the support of my Dr, we upped it to 10mg then again to 15.\n\nThen I made a mistake. Two weeks ago I went back into education and struggled with my assignments. I thought maybe it was my tolerance so I took more...and ended up getting high. I felt awake, driven and slightly euphoric, but also anxious, so I had a drink to chill... And loved the combination.\n\nI started abusing my meds every time I worked on my essay... 4 days a week. With alcohol to combat the anxiety.\nNow 2 weeks later, I'm taking up to 100mg within 6 hours with booze, eberytime I felt a comedown I would get anxious and take more. Then last weekend I went out and got drunk and decided to take 40 ritalin in one go to enhance the night. I just couldn't help it... As I was drinking with the ritalin for my work, it felt strange without. \n\nNow I admit how concerned I am for myself. I feel foolish and impulsive. I don't like the feeling anymore and honestly it's not helping me with my work.. But I can't seem to stop. \n\nDiring the day I'm responsable and take the 20mg which seems to be the correct dose for me. But I. Get the urge in the evenings to do it, with three excuse that I'll work on my essay and before I know it, I'm drunk, and anxious and high. \n\nI really need help, what do I do?",
        "created_utc": 1678468761,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for process, systems for everyday life",
        "author": "boloshon",
        "url": "https://www.reddit.com/r/ADHD/comments/11nuwea/looking_for_process_systems_for_everyday_life/",
        "text": "I realise that sometimes I want to do basic things that I never really learned.\n\n* P**reparing carrots.** \n   * It's been very useful for me to watch a video, \"how to prepare carrots\" from a cooking class for people willing to work in a kitchen. \n* **Mystery pick-up gam**e:\n   *  at the time it helped me by naming in which step I am in seductive process. \n* **the Fence from Geoff Thompson**\n   * It's a simple self defense stance that helps you assess if you are being attacked or not\n* **the 3 waves cleaning process**\n   * Where there is a rule to apply on what and when to clean, in which order  \n\n\nFor all theses, I find it less overwhelming to exactly know the procedure of what's been invented to just work.\n\n&amp;#x200B;\n\nWould you have some resources of examples of other processes for everyday tasks ? Like for example, I'm pretty sure there is a right way to for the process of hoovering. In a way it's like having a decision tree in my mind and I like that.",
        "created_utc": 1678468495,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and obesity/overweight correlation",
        "author": "Violinist-Novel",
        "url": "https://www.reddit.com/r/ADHD/comments/11nuvti/adhd_and_obesityoverweight_correlation/",
        "text": "People often post asking about the not-so-well-known signs of ADHD. Maybe lots of people know this already, but it was new to me. I came across a thread the other day that mentioned that there was a correlation between ADHD and obesity. I went to PubMed and found that there are a ton of studies documenting this correlation. There are even studies about the studies. One of them shows that the prevalence of obesity increases by 70% in people with ADHD and 40% in children with ADHD. There's also a strong correlation with being overweight. However, individuals who were medicated were not at a higher risk for obesity. Here's a link to the study info. [https://pubmed.ncbi.nlm.nih.gov/26315982/](https://pubmed.ncbi.nlm.nih.gov/26315982/)\n\nI thought that this was really useful info and honestly, it made me feel better about my own weight struggles. All too often people blame themselves for not having enough willpower to lose weight when there are so many other factors that affect your weight, ADHD included. I feel like I understand myself better with this new knowledge and I hope some of you do too.",
        "created_utc": 1678468457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calendar with Alarms",
        "author": "toonafishthrowaway",
        "url": "https://www.reddit.com/r/ADHD/comments/11nuula/calendar_with_alarms/",
        "text": "Hi folks, \n\nI’ve been using the app Calengoo for forever and it’s made ADHD 1000x more manageable, but it has started to shit the bed. The alarms on it repeat every minute until I turn them off (instead of disappear if I look at them) and it’s honestly the only thing I can find that works for me.  I’m having trouble finding another syncing calendar with alarms like that. I’ve been trying to search, but looking for “repeating alarms” gets me nowhere. Any ideas?  Good search terms? Good apps?  \n\nThanks y’all!",
        "created_utc": 1678468375,
        "upvote_ratio": 1.0
    },
    {
        "title": "sleep is hard",
        "author": "Forsaken-Bass-2214",
        "url": "https://www.reddit.com/r/ADHD/comments/11nutta/sleep_is_hard/",
        "text": "is it just me or can you not sleep even when you should be tired. i haven’t slept all last night, been super productive, read walked 15kms, went on a bike ride, gone swimming, exercised, i should be tired but im not, i wanna do something else. my mind is racing for the first time in a long time im happy, but i need tips on how to sleep lol, cause i don’t wanna crash.",
        "created_utc": 1678468326,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm just dumb, I guess?",
        "author": "MadelyDramatic",
        "url": "https://www.reddit.com/r/ADHD/comments/11nutkg/im_just_dumb_i_guess/",
        "text": "Once again I am at risk of failing all of my college classes, and since I'm already on probation for the first time, this may be it for me. Coming back from spring break, I skipped like 3 days worth of classes, failed my first exam ever, and bailed out on two team projects/assignments. There's still over a month left of school but I was already behind before and this, so I think I'd need all A's on my assignments going forward to not fail. There's also the fact that it feels like I don't care anymore (When I got my failed exam score back I literally shrugged it off without that typical feeling of stress you're supposed to feel) so I guess that's also coupled with no motivation? I really just don't get what's up with me (and I know it's not depression, trust me, I know what that feels like).\n\nI'm such an idiot too cause I go to such a great school free of charge. I'm so privileged and yet I'm wasting this chance cause I know if I flunk I'm just gonna go back eventually, but by then, I'll have to pay then and have fewer opportunities (also I'd probably just fail again lol). Yeah, I have ADHD but it's not like I'm in a race without legs; I have them, but it's like I don't want to use them for some reason. Even others on here with ADHD talk about how they got their PHDs (that's right, PHDs!!!) without meds. It feels like I need an assistant nurse living with me at this point. \n\nAnd no, I'm not on meds. I was when I was not in school, but based on how they worked with me, I doubt that they'd be enough. So I guess I'm just not meant for higher education? It's not like I'm here solely for money (although I'm low income, I severely detest the thought of going to school for the money) or family pressure. I actually want to learn and eventually go to grad school. So I just feel really conflicted and confused on what's up with me. Why would I not have the motivation right now? I guess I just want to go back to working on that assembly line and risk losing my hands? I guess I do love to spend every waking moment of my life on a brainless activity? Or maybe I'm just too dumb, who knows?",
        "created_utc": 1678468309,
        "upvote_ratio": 1.0
    },
    {
        "title": "My stimulant no longer lasts. (It only lasts for about 4 hours). Does anyone have any suggestions?",
        "author": "Stable_Illustrious",
        "url": "https://www.reddit.com/r/ADHD/comments/11nun7s/my_stimulant_no_longer_lasts_it_only_lasts_for/",
        "text": "[removed]",
        "created_utc": 1678467908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take care lf your mental health. You have control over it.",
        "author": "Unlikely-Structure-4",
        "url": "https://www.reddit.com/r/ADHD/comments/11nudc3/take_care_lf_your_mental_health_you_have_control/",
        "text": "[removed]",
        "created_utc": 1678467304,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm losing it",
        "author": "Clockshot_Titshitter",
        "url": "https://www.reddit.com/r/ADHD/comments/11nuc8s/im_losing_it/",
        "text": "[removed]",
        "created_utc": 1678467231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stimulant medication is making me too sleepy",
        "author": "TimidFish",
        "url": "https://www.reddit.com/r/ADHD/comments/11nu9ir/stimulant_medication_is_making_me_too_sleepy/",
        "text": "I'm currently on 300mg of Wellbutrin and 30mg of Vyvance. It works great for the first part of the day but around 2pm I just start to fall asleep and get super distracted again. It's starting to become a problem because I am just falling asleep at my desk at work every day. Coffee/tea/energy drinks make me sleepy on or off meds, so I'm not sure what to do. I'm pretty sure I've been getting enough sleep. I usually end up sleeping on the bus during my commute home (like 1.5 hours) and then taking another nap once I get home. I get maybe 2 hours to shower, have dinner, and prepare for the next day before I go to sleep for the night. I always wake up feeling well-rested, so I'm not so sure what is going on. I'd really like to not get fired for sleeping on the job, and have more functional time after work.\n\nI've had the same thing happen when I was on ritalin and concerta in the past too. Is my dose maybe too low? Has anyone else experienced the same thing? What helped?",
        "created_utc": 1678467045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self esteem &amp; medication - will there be lasting effects?",
        "author": "Born-Ear-4602",
        "url": "https://www.reddit.com/r/ADHD/comments/11nu5m0/self_esteem_medication_will_there_be_lasting/",
        "text": "Being diagnosed at 26 has meant that a lot of my negative experiences and negative feedback in life was largely a result of my ADHD. Yes, I love my ADHD now because I also see all the good it’s brought me;  my sense of humour, creativity, deep feelings and empathy. However, my self esteem still really lacks most of the time. \n\nI’ve found medication has been really helpful for this - it’s made me much less anxious and more comfortable in myself - I’m also much more able to ward of negative self talk that would usually escalate into me being frozen in time, unable to do anything/no motivation and scared of leaving the house/ being perceived. Ideally, I’d like not to be on medication forever, just my personal preference. \n\nI want to know if anything I build on medication will still be there when I’m off it? \n\nWill being less inclined to dopamine-rewarding negative thoughts patterns whilst I’m on medication make my brain learn not to do that when I eventually go off it? \n\nI find I really thrive of negative thought patterns, I think that’s genuinely where I find most of my dopamine hits, in hating myself. It’s so fucked up but if anyone has similar experience, regardless of meds it would be great to have some advice.\n\nI hate to think that I might need meds to like myself, that thought is terrifying. And I’ve had lots of therapy, it’s just the negative thoughts are almost impossible to fight off meds, like I said, my brain loves them.",
        "created_utc": 1678466789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to try and make a switch from vyvanse to dexedrine, any advice?",
        "author": "informallory",
        "url": "https://www.reddit.com/r/ADHD/comments/11nu3jk/going_to_try_and_make_a_switch_from_vyvanse_to/",
        "text": "TLDR is that I’ve been on V since Sep. and the side effects and finicky nature of it is kind of turning me off. I’ll go back to it if I have to, but interested in other options. \n\nSo for my folks that made the switch:\n\nHow did the two compare? \n\nWhich one did you like more? \n\nDid you find that Dexedrine/generic was easier/harder to find at a pharmacy? \n\nDid you stay on Dexedrine or move to something else?\n\n\nI also have a 5 mg generic adderall booster that I’m not sure if my docs going to keep me on. I’d like to try 2 doses a day of IR, but I’m open to trying to spansules too, so idk if she’s going to keep me on the booster if I go to a IR medication. \n\nI’m seeing my doc on Tuesday and we discussed switching me at my last appointment, and she wanted to me to do my own research on what looked best for me since concerta and Ritalin made me super nauseous and I’m cautious of side effects.\n\nAppreciate any input from you all",
        "created_utc": 1678466654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kind of odd question. Does your Period effect your ADHD Meds?",
        "author": "mpowell252",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntx46/kind_of_odd_question_does_your_period_effect_your/",
        "text": "Im marking this as NSFW just because I know the topic can be kind of uncomfortable anyways, I’m about a week on some new meds for my ADHD I’ve never had meds for it until now and I’m just wondering if anyone else feels like they don’t work during their period or if it’s just me being weird sense this is my first time taking them. \nBasically all day in my classes it’s felt about the same as when I’m not on meds where I can’t focus and everything’s distracting and overwhelming, but I took my medication today and the only thing I’ve done different today is the fact that my period started today. Is this a common thing or should I switch meds or something?",
        "created_utc": 1678466234,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am getting a new psychiatrist",
        "author": "nintendo_d_s",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntvob/i_am_getting_a_new_psychiatrist/",
        "text": "Yesterday I had a zoom meeting with my psychiatrist (a man( that I have been seeing for about 6 months.\n\nI have been looking forward to this appointment because I needed to ask for a dose increase for my medication. I have been on 40mg Vyvanse for about 6 weeks and I feel life 50 will be a little better. \n\nIn our last meeting he mentioned that he didn't want to do the zoom meeting for the next one, and asked that I just call him on the phone. So yesterday I did that, but he didn't immediately remember who I was. \n\nI had been contemplating switching psychiatrists for a little while now, but he said something yesterday that solidified my decision. \n\nHe said \"Oh now I remember you. I remember how beautiful you are.\" \nAll I could say was thank you, but I felt so uncomfortable. \n\nThe reason I was already contemplating switching is that he has this weird fixation with me smoking w**d and drinking alcohol. He would ask me every single appointment if I was still doing both, but never offered an explanation or even asked me further questions about it. So eventually I started saying no. \n\nBut yeah. I called the medical office and asked to talk to someone about switching, and the director of psychiatry is going to call me back today.",
        "created_utc": 1678466135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honestly whats the difference between adhd and being depressed/anxious",
        "author": "Unlikely-Structure-4",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntus4/honestly_whats_the_difference_between_adhd_and/",
        "text": "[removed]",
        "created_utc": 1678466079,
        "upvote_ratio": 1.0
    },
    {
        "title": "medication???",
        "author": "PlusMarch9696",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntt5v/medication/",
        "text": "finally diagnosed at 19!!!!! went to my primary care doctor he totally agreed i needed to be medicated for ADHD, but said that treatment for adults starts with non stimulants.  he prescribed me strattera, which is not a stimulant like adderall, vyvanse, or concerta.  wondering if anyone diagnosed with ADHD in adulthood started on strattera and if it was effective?  i fear it may not help, and worsen my condition, which can NOT happen since i am on the brink of failing out of college.  he recommended i take the supplement saffron with the strattera.  any thoughts? would love to hear some input since i am new to all of this.",
        "created_utc": 1678465972,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and shame/embarrassment",
        "author": "pmf23",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntqod/adhd_and_shameembarrassment/",
        "text": "[removed]",
        "created_utc": 1678465824,
        "upvote_ratio": 1.0
    },
    {
        "title": "A.I as an assistant - ChatGPT",
        "author": "quantum_splicer",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntmo2/ai_as_an_assistant_chatgpt/",
        "text": "Hello everyone , I have found ChatGPT to be useful in helping me organise my thoughts and ideas with minimal effort and create lists and such.\n\nHowever I have questions, would it be useable to use ChatGPT as like a daily assistant or like a secretary in some way to help me manage the mundane tasks .\n\nI ask because I have the option of paying $20 for ChatGPT premium.\n\nAdvice and guidance needed",
        "created_utc": 1678465563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best ADHD books for practical advice?",
        "author": "espressoqu33n",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntlv7/best_adhd_books_for_practical_advice/",
        "text": "I’m (25F) curious what books on ADHD folks have read that they would absolutely recommend a recently diagnosed adult (female/combined type) person read. I have a decent grasp of the medical side of ADHD (symptoms, brain chemistry, medication, etc) from months of hyper-focusing on learning everything about my brain. However, I’m starting to get curious about systems/advice/personal stories/coping mechanisms for how to actually live with the disorder. \n\nI had a therapist last year that really didn’t understand ADHD (tried to dissuade me from seeking out a diagnosis, was convinced I didn’t have it because of past academic success and kept saying I have “a task avoidance issue” rather than ADHD). Currently trying to seek out a new therapist that specializes in ADHD, but everyone has at least a 6 month waitlist and I’m not sure I’ll lock one down soon. In the meantime I would love to take helping my ADHD into my own hands. \n\nMy boyfriend also has ADHD and I just read “The ADHD Effect on Marriage,” which was very practical. Books like that would be great. What have you read that actually initiated change in your life?\n\n(FYI I have found a pretty good medication set up through working with my psych, and am looking for ways to supplement my treatment)",
        "created_utc": 1678465515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse painful hands?",
        "author": "Neither_Match_1906",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntij7/vyvanse_painful_hands/",
        "text": "[removed]",
        "created_utc": 1678465304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clean Out Your Closet",
        "author": "offonmondayz1",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntgrg/clean_out_your_closet/",
        "text": "[removed]",
        "created_utc": 1678465195,
        "upvote_ratio": 1.0
    },
    {
        "title": "functional calendar app",
        "author": "Katlee56",
        "url": "https://www.reddit.com/r/ADHD/comments/11ntf8a/functional_calendar_app/",
        "text": "I wanted to share a calendar app that I found a little over a month ago that has been working well for me. I paid a one time fee of 4 or 5 dollars for it. It's called \"Business 30\". \nFeatures I'm finding useful with it:\n- It integrates with all my Gmail calendars\n- I can set templates for repeated p places with and select colour and choose what stays in the template. \n- I can add pictures, take pic and add, and website or app links to the event\n-the month section scrolls into the next month so I don't have to switch pages while finding a date\n- Add lists to events\n-add tasks to dates \n- The week, day , month buttons are clear and easy to switch between\n- reminders for events are easy to set. \n-events are color blocked like you would see in a scheduler \n- in the month section I can choose to have text or no text with the color blocks of time. That is easy to switch between. \n-most important is it is a one time fee instead of subscription \n\nI thought I'd share about this because it's helped me a lot with keeping track of my life.",
        "created_utc": 1678465099,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long after taking meds is it safe to exercise?",
        "author": "Glutenfreelemoncake",
        "url": "https://www.reddit.com/r/ADHD/comments/11nt64v/how_long_after_taking_meds_is_it_safe_to_exercise/",
        "text": "[removed]",
        "created_utc": 1678464522,
        "upvote_ratio": 1.0
    },
    {
        "title": "My WAIS-IV result makes me feel very stupid",
        "author": "Fantastic_Wedding_95",
        "url": "https://www.reddit.com/r/ADHD/comments/11nt1xe/my_waisiv_result_makes_me_feel_very_stupid/",
        "text": "Hi! \n\nI got diagnosed with ADHD about a year ago and it explains a lot but my result in the WAIS-test has made me question whether or not I will be able to amount to anything in life. Here are my results: \n\nMy overall score: 92-104, 95% confidence intervals, 45 percentile \n\nVerbal score: 105-121, 95% confidence intervals, 82 percentile \n\nNon verbal problem solving: 86-99, 95% confidence intervals, 30 percentile. \n\nThe psychologist said after the results were done that my score isn’t a good indicator of my intelligence because of the big and unusual differences between the parts of the test. Idk, I just think she wanted to make me less sad. \n\nBecause of my result on this damn test I just feel so stupid and as if it’s impossible for me to amount to anything other than the job in retail that I’m working  at right now. I am currently studying a course in law and have a dream of becoming a lawyer but when I think of this test it just feels impossible and like a reminder of the fact that I’m incapable of succeeding in life. Btw, English isn’t my native language so I’m sorry in advance for any misspellings and such.",
        "created_utc": 1678464255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Motivation techniques",
        "author": "Expensive-Wasabi-502",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsz10/motivation_techniques/",
        "text": "Like most of us, I can only start and complete work when there is high pressure or a fast approaching deadline.  Which obviously isn't good for my mental health to push everything to the last minute and almost break myself trying to complete things on time.\n\nSo I have a project with a loose deadline, which isn't ideal because I keep pushing back when to start it. One thing I've done is have a card on the side of my screen listing all the reasons I should start this project now. For example, if I don't finish it on time, I'll disappoint my professor.  And I would rather die than disappoint someone 🤣\n\nAny other techniques I can try?\n\nI've set myself personal deadlines, but they quickly fall through. I tried bribing myself with snacks, but I just eat them anyways. 😂😂",
        "created_utc": 1678464083,
        "upvote_ratio": 0.99
    },
    {
        "title": "ED and ADHD",
        "author": "Waitiewilly",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsxc1/ed_and_adhd/",
        "text": "Hi, I’m very new to the ADHD world and one of the things i am really struggling with at the moment is binge eating; I’ve had disordered eating issues in the past and as soon as I start to feel that maybe there’s a chance I won’t binge anymore I sit down and eat and eat and eat (even mouldy food) and feel so shameful and sick and I don’t know what to do. Just wondering if anyone has had similar experiences, and how I can stop this constant cycle of binging.",
        "created_utc": 1678463986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medication resistant friend - solutions for the medication resistant",
        "author": "MurkyGrape5901",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsmmy/medication_resistant_friend_solutions_for_the/",
        "text": "My friend (it’s not me I promise 😁) has tried a lot of ADHD medication and at ramped up doses and has had no benefit at all. In most cases she didn’t feel a thing either - like maximum dose dexamphetamine - it’s like she’s taken sugar pills. \n\nShe’s tried:\n\nSlow release Ritalin. On its own. \n\nVyvanse. On its own. \n\nDexamphetamine. On its own.\n\nAtomoxetine. On its own. \n\nGuanfacine. On its own. \n\nCurrently - Guanfacine + immediate release Ritalin. \n\nFor her ADHD is the 20 streams of thought going on at once, no hyperactivity. \n\nShe’s seeing a private ADHD clinic so can try new stuff quickly. \n\nThe other thing is she has untreated sleep apnea, so has always had terrible sleep - which screws up executive functioning on its own. \n\nThe apnea is just now being investigated. \n\nWhat solutions do you guys know for medication resistant ADHD like this?\n\nThanks",
        "created_utc": 1678463288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did my meds change how i think forever?",
        "author": "bobybomb555",
        "url": "https://www.reddit.com/r/ADHD/comments/11nskd1/did_my_meds_change_how_i_think_forever/",
        "text": "I’ve been taking my meds (adderall to be exact)daily for about a year and half know and i’m starting to notice that when i’m on (and off) my meds it’s harder for me to get any sort of creativity or imagination. When i’m on my meds this is typical (the best way for me to describe it is when i’m off i normally think in pictures but when i’m on i think in words) for me to do but it’s starting to bleed over into my off life and i don’t want that to happen. I need my creativity, i cant live my life thinking only in words. And i’m afraid that if i stop taking them every day then i’m going to start failing school but if i keep taking them then i will never be able to picture anything in my head ever again.",
        "created_utc": 1678463139,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD anger or something else?",
        "author": "Magspie2",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsjsn/adhd_anger_or_something_else/",
        "text": "[removed]",
        "created_utc": 1678463107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the “Ritalin effect” real?",
        "author": "just_here_cause_done",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsi1q/is_the_ritalin_effect_real/",
        "text": "[removed]",
        "created_utc": 1678462992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally got a family doctor appointment - can I just show him symptoms on my notes app?",
        "author": "PanMan-Dan",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsgis/finally_got_a_family_doctor_appointment_can_i/",
        "text": "Hi all - so I’ve finally managed to get a doctor’s appointment (there’s a shortage where I live and I’ve been putting it off for literal years) and I know I’m absolutely terrible at advocating for myself. What’s the chance I can just show a big list of symptoms I wrote down in my notes app? I’ve got it categorised by organisation, impulsivity, fidgeting, auditory, and forgetfulness but they might just write it off. Anyone else try to do this?",
        "created_utc": 1678462889,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dream has always been to be a doctor, but now that i found out i have adhd im not sure i can do it.",
        "author": "simmasova",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsbck/my_dream_has_always_been_to_be_a_doctor_but_now/",
        "text": "so like im 14 and im supposed to be applying for a high school next year and like you know i knew for the past two years what i wanted to do. But now that i found out i have untreated adhd today and im not sure ill be able to manage it. I researched about it and i saw people from big countries like America saying that they got into med school with adhd but im really not sure if it'll go like that in my relatively small country in europe. Not that i think its impossible, i just think it would make it a lot harder and they might prioritize 'normal' people. And i dont think I'm THAT good of a student for them to be able to just look past it (not that im bad).\nBoth schools ill be applying to are medical. What if im wasting my time on something that is clear i wont get? Then what?\n \nAlso i have always been quite reckless and my mother told me that is just because i am a kid , so i thought 'yeah itll go away eventually, dont worry about it' but now im thinking it might just not go away.",
        "created_utc": 1678462549,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is the best time to start taking meds for the first time?",
        "author": "BagelBitch267",
        "url": "https://www.reddit.com/r/ADHD/comments/11nsaav/when_is_the_best_time_to_start_taking_meds_for/",
        "text": "Hi, recently got prescribed stimulants and I’m a little nervous about taking them. Not sure what side effects to expect, so I was wondering if it’s better to take them on a day like today when I don’t have much to do but won’t be home, or on a normal day for me, or on a weekend when I’ll be home all day? I’m worried because I don’t know how they’ll affect me and I don’t wanna feel uncomfortable when I can’t be home, but I also don’t know if this is something I need to be worrying about?",
        "created_utc": 1678462482,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD diagnosis doesn't really tell anything about the person",
        "author": "Unlikely-Structure-4",
        "url": "https://www.reddit.com/r/ADHD/comments/11ns61v/adhd_diagnosis_doesnt_really_tell_anything_about/",
        "text": "Adhd is not a disease its a disorder so it doesn't have to have a specific known cause.\n\nI was diagnosed with combined adhd at age 7 and i went to a special ed class in preschool. When i hear about the experiences of other people with adhd many times i cant relate to them at all.\n\nAdhd has so many different causes. Cause of my adhd is lack of oxygen during birth because my umbilical cord was tied around my neck. \n\nSome people are diagnosed because they are just depressed/anxious. Some have bad attention and hyperactivity because of genetics. Some are slightly autistic and where diagnosed with adhd instead. Some had complications during birth like me.",
        "created_utc": 1678462213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have not been diagnosed yet.",
        "author": "ksdg1214",
        "url": "https://www.reddit.com/r/ADHD/comments/11ns06j/have_not_been_diagnosed_yet/",
        "text": "[removed]",
        "created_utc": 1678461816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worst vyvanse headache",
        "author": "spud_potato",
        "url": "https://www.reddit.com/r/ADHD/comments/11ns031/worst_vyvanse_headache/",
        "text": "I had a throbbing headache at around 8pm. I took vyvanse 40mg at 7am. \n\nI recently up my dose to 40 from 20mg 4 days ago. \n\nI took tylenol to help the pain but it did not work. Hurts so bad I wanted the throw up. I went to bed and slept, woke up and my headache is gone but it was just terrible. \n\nAny advice on what is it and how to prevent it?",
        "created_utc": 1678461810,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Hyperfocus' failing, procrastination very problematic. WWYD?",
        "author": "NoDecentNicksLeft",
        "url": "https://www.reddit.com/r/ADHD/comments/11nry12/hyperfocus_failing_procrastination_very/",
        "text": "Long story short, I used to be able to make good money in my freelance job due to hyperfocus. More hours, faster tempo and still better quality than the industry average. Nowadays, however, procrastination is getting to the point I can't really control the distractions and there are more distractions than there is work. While I usually have the discipline to avoid outright gaming or reading a novel, I can't avoid ending up on Reddit or Facebook or reading something else unrelated somewhere else and the break taking 30 minutes or so rather than 5. Sometimes I can focus on not doing it, like force myself to stay in the work window on my screen, but even so, the results are limited. Got any suggestions? Is it time to see a shrink and get some pills?",
        "created_utc": 1678461673,
        "upvote_ratio": 1.0
    },
    {
        "title": "i wonder why i always regret what i buy",
        "author": "Ginger-Cat-8682",
        "url": "https://www.reddit.com/r/ADHD/comments/11nrvf3/i_wonder_why_i_always_regret_what_i_buy/",
        "text": "[removed]",
        "created_utc": 1678461510,
        "upvote_ratio": 1.0
    }
]