[
    {
        "title": "What's the most \"even\" version of LA Ritalin?",
        "author": "modernparadigm",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdwax/whats_the_most_even_version_of_la_ritalin/",
        "text": "Hi all,\n\nI'm looking for a formulation of long-acting Ritalin that has the most \"even\" dosing.\n\nI take Ritalin LA (and have been for years), but for whatever reason, I've noticed my blood pressure and heart rate has been spiking around the 4ish hour mark (second and stronger peak time I think.)\n\nI could maybe lower my dose, but I was thinking about using \"Azstarys\" since its so new and long lasting. Not sure if it's good on this side effect or not.\n\nIt looks that way with the graphs online, but idk -- they're all a little different.\n\nThanks all.",
        "created_utc": 1678723981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you break things down into too many steps?",
        "author": "mamiberry",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdsvp/do_you_break_things_down_into_too_many_steps/",
        "text": "I know that the good advice for tackling big tasks is to break it down into little steps, and I've been doing that - I've been using a kanban board and post its to keep track of everything, but for things like household tasks, I feel like there's too many steps, so then I have to organise those steps and then there's too many things to do.\n\nLike I bought new dehumidifiers, and needed to replace the old dehumidifiers - great, easy, let's do it.\n\nBut I first needed to unbox and unpackage the new ones, then I needed to gather up the old dehumidifiers and put them in the bin, then I needed to replace the old ones with the new ones in 3 rooms - so then it became, what else do I need to do in those 3 rooms? Well, I need to take printer paper to that room, and then I need to turn on the printer so I could print some stuff later. I need to put one in the kitchen and I also need to take the soy sauce back to the kitchen. And I need to put one in the bathroom but in the bathroom, I also need to replace the air freshener. And then I need to take out the bin in the bathroom. And I also need to put the rest of the new dehumidifiers under the sink in the kitchen. And I need to put the bathroom rubbish in the outside bin, and since I put the dehumidifiers in the kitchen bin its pretty much full so I should put that in the outside bin, and then I need to put the outside bin into the street for tomorrow morning. \n\nSo my one task has become far too many tasks, which involves me taking everything I might need for all of those tasks from room to room, because god forbid I have to make two trips to the kitchen or the bathroom or this that and the other. Everything has to be done at once, instead of my one task of replace old dehumidifiers with new ones - because even if I just break it down into dehumidifier specific tasks, there's all these other tasks in the same rooms, so then that feels inefficient, or if I don't get it done right now when I'm in this room, it's not going to get done.\n\nWhich is silly, I'm doing the chores and I am going to have to make multiple trips because I can't possibly carry everything and there isn't an optimal room to go to first to make the trip most efficient and so I don't forget anything. Like it isn't going to kill me to go to the kitchen and go somewhere else and then go back to the kitchen, but it feels like if I don't go to the kitchen and do every single kitchen task, then they aren't going to get done.\n\nEverything ends up having far too many steps and far too many diverging paths, and my ADHD meds wore off a couple of hours ago and my bed isn't made so there is nowhere to escape to. I'm remembering more tasks to do as I write this and the list of tasks and steps is just getting longer and longer and if I'd just written 'New sheets on bed' then that would've been too much, but now I have take off old sheets, old sheets in washing machine with towels from bathroom, put new sheets on, put new towels in bathroom, take sheets and towels out of washing machine and put in dryer, take out of dryer and fold, put away in cupboard - and that's too many steps and places to fall down on!!\n\nI suppose I'm just struggling to find a balance between breaking down tasks into manageable steps and breaking down tasks into too many bloody tasks to do.\n\nAfter hitting post, I am going to put new sheets on the bed. Then take the soy sauce through to the kitchen and put the sheets in the dryer and hang the towels to dry in the bathroom, and the kitchen is next to the bathroom, so I can get the rest of the bathroom tasks done, and then I can go back to my room and see what else needs dealing with.\n\nBasically, too many tasks, too many steps, I need to stop wasting my active medication time playing the Sims.",
        "created_utc": 1678723760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legend or nah",
        "author": "Browncoatinabox",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdso4/legend_or_nah/",
        "text": "I've heard this growing up and I'm now almost 30. Because we have ADHD (duh), it means we are less likely to be religious. So I wonder what is everyone's religion? \n\nI grew up Southern Baptist, went agnostic than atheist, then started reading Scott Cunningham now I'm agnostic leaning Wicca (but I dought I'll ever fully believe ((but who knows, I was a true believer before I left the church)).",
        "created_utc": 1678723746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loved one has ADHD. It's like they're addicted to... shortcuts??",
        "author": "HooptyDooDooMeister",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdsba/loved_one_has_adhd_its_like_theyre_addicted_to/",
        "text": "My LO has ADHD and is off meds due to financial hardships (I do not have ADHD). \n\nI'm confused about something and wondered if someone here might be able to help clarify.\n\nIt never dawned on me what addict-like behavior they have until this morning. I get the \"why\" and \"what it feels like\" for them. But why the intense addict-like behavior? Is this common?\n\nThe inciting incident:\n\nLast night, they needed to pack a lunch for the day. They do not want my reminders, because they are taken in bad faith (it's guaranteed to start an argument no matter how gently it's put).\n\nNow sometimes I splurge by stocking up on a few Lunchables as my own personal go-to for quick meals. I decided to hide them, because I figured they would forget and beg me for one. I slipped up and accidentally said I had some.\n\nSure enough, as they were leaving today, they desperately asked me for one. \n\nWhat I *wanted* to say: \"I was going to remind you last night, but you would've gotten mad again that I reminded you.\" \n\nWhat I *did* say: \"No.\"\n\nWould it be fair to say these \"quick fixes\" and \"last-minute shortcuts\" are what my LO is \"addicted\" to?\n\nThanks for any and all help! Cheers!",
        "created_utc": 1678723722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally got diagnosed and started treatment",
        "author": "TrashGorlUwU",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdrqp/finally_got_diagnosed_and_started_treatment/",
        "text": "[removed]",
        "created_utc": 1678723685,
        "upvote_ratio": 1.0
    },
    {
        "title": "BPD diagnosis and ADHD",
        "author": "Big-Mode7560",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdr83/bpd_diagnosis_and_adhd/",
        "text": "Hello everyone ,\n\nSo i wanna ask if some can relate so i use to misinterpret people talks so i'm asking you what can i do since my last psychologist who know me real he think i have BPD but he have no clue of understanding what is ADHD.\n\nI went to psychiatrist and he said i was ADHD for sure so he gave me ritalin.\n\nAnd i don't do those self harm etc as BPD would do. \n\nProblem is i do well on ritalin i do some break some times and when itake the meds back i'm like feeling more confident about what my true way is could it be misdiagnosis from BPD i also have trust issues and fear of abondment so i end up chasing people but sometimes i feel good with my self \n\nWhen i take ritalin i'm like i don't need anyone else but when it crash i end up the same guy looking for attention and else if someone can relate to that i wanna do therapy to get better but it's expansive \n\ni'm also unemployed i started ritalin but i'm still scared to be back at job and say i do mistake in the job or else i have a lots of debts due to impulse i just wanna get out of that cycle of paranoia people don't like me. \n\n&amp;#x200B;\n\nThank you for reading hope someone can help",
        "created_utc": 1678723652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad brain fog while on Adderall?",
        "author": "RedditAccount345050",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdn4o/bad_brain_fog_while_on_adderall/",
        "text": "Anyone have this problem? I’ve been taking 10mg of adderall for about 2 months now. I take it in the morning before work and after a couple hours I find myself with a bad brain fog. It feels like I’m zoning out but can break out of it. I can still function and do stuff but it’s like I’m just staring off all day.",
        "created_utc": 1678723397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else sleepy on Vyvanse?",
        "author": "4STotalLandscaping",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdjvv/anyone_else_sleepy_on_vyvanse/",
        "text": "[removed]",
        "created_utc": 1678723205,
        "upvote_ratio": 1.0
    },
    {
        "title": "the adderall back order finally hit my area. I called 31 pharmacies before I found one with name brand in stock.",
        "author": "HistoricalHeart",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdjhq/the_adderall_back_order_finally_hit_my_area_i/",
        "text": "My insurance doesn’t cover name brand and the pharmacist and my psychiatrist are trying their best to get insurance to override the need for generic. It’s $506 out of pocket and I’m probably going to have to pay it and it makes me sick that at this point I literally don’t even care about the money because I’m just happy I was able to find my medication. This is an absolute nightmare. The way I sobbed to this pharmacist on the phone when he told me my medication was in stock is honestly sad. I’m so sorry to everyone else who’s dealing with this shitshow.",
        "created_utc": 1678723180,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got my driver's license",
        "author": "Worksafe__",
        "url": "https://www.reddit.com/r/ADHD/comments/11qdbq1/i_got_my_drivers_license/",
        "text": "[removed]",
        "created_utc": 1678722667,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a mistake at work even though I double checked my work",
        "author": "SmileAndLaughrica",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcwyg/i_made_a_mistake_at_work_even_though_i_double/",
        "text": "[removed]",
        "created_utc": 1678721701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderal while breastfeeding",
        "author": "DelilahDee912",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcu1y/adderal_while_breastfeeding/",
        "text": "I just got off the phone with my psychiatrist, who flat out denied my request for stimulants, because I’m breastfeeding. I did my best to advocate for myself, by explaining that while adderal isn’t recommended while pregnant, there isn’t definitive research that concludes that it is harmful to baby while breastfeeding. I also argued that my mental health is as important as baby’s well-being, but he wouldn’t hear it. He told me that breastfeeding women shouldn’t take ANY psychiatric medications, so also refused my request for prazosin (a beta-blocker commonly used to quell nightmares. I’ve had bone-chilling nightmares since baby was born). I’m so disappointed, but also not that surprised, tbh. He’s an older man, who has always been supportive of me, but has some antiquated views on medication. I called the clinic to switch to a different provider, after hanging up with him. Does anyone have any insight? Is there a threat to baby, when taking stimulants while breastfeeding?",
        "created_utc": 1678721508,
        "upvote_ratio": 1.0
    },
    {
        "title": "are pharmacies okay in the us and canada???",
        "author": "k8zavie",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcte8/are_pharmacies_okay_in_the_us_and_canada/",
        "text": "this is not meant to come off as judgemental to anyone reading this but only to the pharmacy business in us and canada. recently i’ve read a lot of posts about the treatment in us/canadian pharmacies and how invasive the doctors can be, can someone please explain to me how picking up medication works??? \n\nthis is more of a culture shock to me since i live in europe and essentially whenever i need to pick up my medication i go to any pharmacy, tell them my public healthcare number (or give them a prescription if it’s private) and that’s it. \n\ni’m sorry to anyone who’s had to deal with the unwarranted treatment just because you need medication to function what is seen as ‘normal’.",
        "created_utc": 1678721466,
        "upvote_ratio": 1.0
    },
    {
        "title": "16years of prescribed stimulants and cardiac issues. Any better alternatives?",
        "author": "Pure-Run6234",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcs57/16years_of_prescribed_stimulants_and_cardiac/",
        "text": "[removed]",
        "created_utc": 1678721389,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many jobs have you had?",
        "author": "XGoldenSpartanX",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcprl/how_many_jobs_have_you_had/",
        "text": "Thanks to my ever-changing desires and needs, here is a list of professions I have had, in no particular order:\n\nBasically, anything in a restaurant, including a short time owner.\n\nResort VIP reservation specialist (basically a travel agent)\n\nPolice officer\n\nCasino dealer, then a Casino Manager\n\n5-star restaurant manager\n\nChef\n\nAppliance Salesman and Repairman\n\nCar Sales Manager\n\nMarketing Manager\n\nProgrammer\n\nElectrical Technician \n\n3d printing and laser cutting business owner\n\nI also use to build computers for people as a side job\n\nTravel Casino event dealer\n\nTable Games Teacher (taught new dealers how to deal)\n\nWine Sommelier \n\nI honestly cannot put everything on my resume anymore.  What are some jobs have you found that helps with your ADHD?",
        "created_utc": 1678721227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self diagnosed ADHD - Thoughts?",
        "author": "BanditSurvivalist",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcojl/self_diagnosed_adhd_thoughts/",
        "text": "27M with diagnosed ADHD here (just for reference) \n\nSo, I recently put up a post on a rather popular ADHD Support group on a certain social media platform. Needless to say the post was very divisive amoung the group. I received a hell of a lot of backlash, harsh messages and insults. \n\nMy post was me venting my frustrations about people diagnosing themselves as having ADHD. I said I found it to be a little bit insulting that I had to go through a long uphill battle to get my own diagnosis and that I felt as though People \"just deciding\" that they have ADHD sort of invalidates that process. I went on to say that in no way should someone who suspects ADHD not seek out help and support but in reality unless you have a formal diagnosis from a professional you really shouldn't be going around telling people you actually HAVE ADHD. \n\nMy opinion is that no amount of watching videos, reading articles and posting on groups qualifies someone to diagnose themselves. I mean ADHD is a disability. You wouldn't get people going around saying they have X, Y or Z different conditions without confirmation from a doctor or specialist first, so why is is appropriate to diagnose yourself with a disability? \n\nMy concern is mainly in that without a professional opinion you could very well be wrong? There could be a number of different issues at play and by saying you have ADHD when you actually don't you could be further spreading the misunderstanding of an already widely misunderstood condition. \n\nAs per usual the internet being the internet I came under fire immediately. I was told that I was disgusting. I was gatekeeping. That I was ablest and insulting. I was told I was no longer welcome in the group and that I shouldn't be allowed to voice my opinion. People were accusing me of trying to block people from getting help and that a self diagnosis was just as valid (or more valid in some people's views) \n\nI feel a bit taken aback to be honest. This wasn't the response I was expecting at all. Am I being out of order?",
        "created_utc": 1678721148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tingling sensations as vyvanse wears off",
        "author": "twenty20reddit",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcoj2/tingling_sensations_as_vyvanse_wears_off/",
        "text": "I've noticed a new side-effect to my ADHD medication. I am on 20mg lisedexamphetamine (Vyvanse / Elvanse), and once the medication starts wearing off I get tingly sensations all over my body (feet, legs, arms, back, neck). \n\nI don't think it's Raynaud phenomenon, which I know is a possibility with this medication, because I don't notice my fingers changing colour or anything. \n\nI do have poor circulation however. And my feet and hands go really cold. \n\nCurrently trialling 20mg at 7am and 20mg around 9am. I have yet to start the 2nd dose as I want my body to get used to the first 20mg dose. \n\nAnyone else *always* forget to take their meds? \n\nI've been on titration for a long time, and went all the way up to 50mg which was too much and now I'm on 20mg planning to do split-dosing (total 40mg/day). \n\nWill this side-effect go with time do you think?\nI hate it because now I'm convinced I have bugs crawling on me and it's horrible. Even if I'm under the duvet &amp; warm I feel the tingling sensations.",
        "created_utc": 1678721147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Super brain/Exhausted brain",
        "author": "SneakyChikon",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcdkv/super_brainexhausted_brain/",
        "text": "39/f with a handful of misfiring of brain issues, one being adhd. Do you ever find that you’ll have a week or two when your brain is ON IT at work (or home), and then the next two weeks it’s spent recouping because it feels like warm pudding sliding down the wall?\n\nIf you’ve experienced this, how do you balance it?",
        "created_utc": 1678720436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get in \"trouble\" with my Dr if I tell her I upped my dose, just to see?",
        "author": "MiniMooseMan",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcd2h/can_i_get_in_trouble_with_my_dr_if_i_tell_her_i/",
        "text": "I'm on adderall, it's doing nothing. I took more once or twice to see if I needed more or a different medication. It still did nothing, but I don't want to NOT tell my Dr that, and just get prescribed a slightly higher dose of the same thing for another month, just to have it do nothing. \n\nI'm not going to get myself into a mess for \"abusing prescriptions\" am I?",
        "created_utc": 1678720401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it easier for you to study when you're physically weakened?",
        "author": "Zestyclose_Habit_315",
        "url": "https://www.reddit.com/r/ADHD/comments/11qccwu/is_it_easier_for_you_to_study_when_youre/",
        "text": "[removed]",
        "created_utc": 1678720392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drug test showed positive for Adderall, Concerta, AND Folcalin?",
        "author": "fragmentedpimple",
        "url": "https://www.reddit.com/r/ADHD/comments/11qcbm5/drug_test_showed_positive_for_adderall_concerta/",
        "text": "I just had a phone call check up with one of the nurse practitioners at my psychiatrist's office. I am currently prescribed Adderall and have been for almost a year now. Before that, I was prescribed Folcalin &amp; Concerta. I have not taken both of these since i switched to Adderall.\n\nI just had a phone check up with one of the psychiatrist's there, who said my drug test came back positive for ALL 3 and said it was a bit concerning. \nI said there is absolutely no way, I haven't taken concerta or folcalin. \nHe said he is not too concerned about it, which I then responded that I AM concerned about it because I know I haven't taken these medications. \nI said I could come in today or tomorrow to retake it, which he then proceeded to say I sound honest and he is not concerned, refilled my medications, and just scheduled a follow up in a month.\n\nHow could this happen? I am genuinely concerned about this because I HAVEN'T taken these meds and feel like this makes it look like I am abusing medication. \n\nI am not sure what to do. Should I be concerned? Should I take some sort of action?",
        "created_utc": 1678720304,
        "upvote_ratio": 1.0
    },
    {
        "title": "ED and Stims",
        "author": "Recent-Ad-8737",
        "url": "https://www.reddit.com/r/ADHD/comments/11qc9kd/ed_and_stims/",
        "text": "So I was recently diagnosed with adhd again since I was “functional” in childhood and my parents didn’t want me on meds. However, in recent times I have been struggling more so I’ve been thinking of speaking to my psychiatrist about starting meds. I was wondering if any of the male population has struggled with ED after starting stimulant meds? Also is it just when you take the medication or does it even when you stop taking it?",
        "created_utc": 1678720172,
        "upvote_ratio": 1.0
    },
    {
        "title": "My psych said my drug test came back positive for Adderall, Concerta, AND Folcalin?",
        "author": "fragmentedpimple",
        "url": "https://www.reddit.com/r/ADHD/comments/11qc5xw/my_psych_said_my_drug_test_came_back_positive_for/",
        "text": "I just had a phone call check up with one of the nurse practitioners at my psychiatrist's office. I am currently prescribed Adderall and have been for almost a year now. Before that, I was prescribed Folcalin &amp; Concerta. I have not taken both of these since i switched to Adderall.\n\nI just had a phone check up with one of the psychiatrist's there, who said my drug test came back positive for ALL 3 and said it was a bit concerning. \nI said there is absolutely no way, I haven't taken concerta or folcalin. \nHe said he is not too concerned about it, which I then responded that I AM concerned about it because I know I haven't taken these medications. \nI said I could come in today or tomorrow to retake it, which he then proceeded to say I sound honest and he is not concerned, refilled my medications, and just scheduled a follow up in a month.\n\nHow could this happen? I am genuinely concerned about this because I HAVEN'T taken these meds and feel like this makes it look like I am abusing medication. \n\nI am not sure what to do. Should I be concerned? Should I take some sort of action?",
        "created_utc": 1678719934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time blindness",
        "author": "skebi69",
        "url": "https://www.reddit.com/r/ADHD/comments/11qc53d/time_blindness/",
        "text": "What coping mechanisms to you all have for time blindness? For example, I got an email early last week about some library materials I have not returned. They are still on the table by the door. I know they are late. I know that they get later each day but it seems like they are only a day or 2 late when in reality they are almost a week late. Another example is keeping in touch with friends. I want to call and I think it has not been that long since I talked to them but in reality it has been weeks/months/years. It just does not feel like it has been. I especially struggle with this at work and meeting deadlines. \"I know I have time\" and then all the sudden, I don't.",
        "created_utc": 1678719879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy food options",
        "author": "Excellent-Ad6385",
        "url": "https://www.reddit.com/r/ADHD/comments/11qc3hy/easy_food_options/",
        "text": "So… my boyfriend.. apparently a genius in the ways of people with executives functioning problems just gave me the tip of finding easier food options instead of being upset that my sort of easy food options don’t always work for me…\n\nI used to make, or have him make, hard boiled eggs every day before i went to work cause they’re nutritious and fast to eat… I’ve been struggling to get my breakfast in though because this requires me to have clean pots on hand every morning… so he was like “why not like… yogurt or something?” Omg.. duh.. so we were at the grocery store and he was like “get yogurt”.. and here i am, running late for work (making a post on Reddit for god knows why….) and i’m eating yogurt and life is good.\n\nList of easy food options (you pick what food you would eat for what meal. Idgaf who am i to judge)\nReady to eat fruits (bananas, apples, peaches, oranges, etc)\nGranola out of the bag\nYogurt\nLmao snack packs\nMicrowaveable frozen trays\nIdk.. you add more (and if someone says meal prep I’m actually going to melt in the flames of hell as i drag you down..)",
        "created_utc": 1678719765,
        "upvote_ratio": 1.0
    },
    {
        "title": "ppl who’ve had adhd coaching- what are the most useful things you’ve learned from it?",
        "author": "vegancat123",
        "url": "https://www.reddit.com/r/ADHD/comments/11qc3i2/ppl_whove_had_adhd_coaching_what_are_the_most/",
        "text": "basically what the title says, what are the most valuable things ppl have learned from adhd coaching? \n\nany tips you guys can share? any breakthroughs from something they’ve explained to you in a particular way? best advice youve had? any organisational hacks or anything else? \n\ntrying to meet the character limit lol shdhdjbdbdbdbdbdjdjjdndndnjdjdjdndndnndndn",
        "created_utc": 1678719765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could ADHD be a genetic mutation?",
        "author": "dontclickmyprofile",
        "url": "https://www.reddit.com/r/ADHD/comments/11qc2jn/could_adhd_be_a_genetic_mutation/",
        "text": "This might sound hard to follow along but I will try my best to summarize my point. I remember hearing somewhere that a lot of our traits (or tendencies to develop traits) are influenced by our genetics because of our ancestors. For example, we know that when a woman is born, she is already born with a certain number of eggs. If she undergoes significant trauma, there has been research to suggest that her eggs may carry that trauma as well. That being said, I learned that the inattentiveness of ADHD is caused by a lack of baseline levels of dopamine that are found in Neurotypical brains. This makes me wonder, since depression can be explained by a chemical imbalance of the brain, could ADHD be a genetic mutation that may occur as a result of trauma from previous generations of depression?",
        "created_utc": 1678719705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody have any experiences or anecdotes to tell concerning having ADHD and studying foreign languages?",
        "author": "blueboltertumblr",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbx0m/does_anybody_have_any_experiences_or_anecdotes_to/",
        "text": "[removed]",
        "created_utc": 1678719351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diagnosis and medication process (UK)",
        "author": "Human_Tourist4556",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbtz9/diagnosis_and_medication_process_uk/",
        "text": "Hi! We have some exciting news that my bf said he was happy to share as it may help someone else out. It's a bit of a long read, sorry! \n\nHe (38M) was diagbosed late last year and is finally starting medication next week and the process altogether took around 4-5 months (rather than the 5-10 years an NHS nurse quoted us). We are so delighted he is getting the support he needs. See below for the journey:\n\nSo last year I started a new job which offered private healthcare via salary sacrifice (free for employees, and about £30 per month for additional adults then I just cancelled once we were done with it). I looked up the cover and made sure it included ADHD assessments specifically. By this point, my partner had already been on the NHS waiting list for an ADHD assessment for about a year and chasing it up every  month to see where he was in the queue. He was told that he could be waiting between 5 to 10 years and they would get in touch when it was time for him to be seen. \n\nOnce my bf got his account set up with the private healthcare provider, he followed the healthcare provider's processes (i.e. get a GP referral and attend an ADHD assessment in person in one of their approved clinics). He had the diagnosis emailed to both him and his GP.\n\nNow we had to wait for treatment. Unfortunately, while I could afford the diagnosis, we couldn't afford treatment privately. My partner was advised that, since he has already been diagnosed, he could go straight to treatment via NHS. He did however have to keep ringing them every so often to make sure he hadn't been lost in the system. \n\nA couple more months go by and he was invited to take an ECG via the NHS prior to beginning medication. He was given various options and advice, he came home with a few leaflets for us to read.\n\nTL;DR My bf got a diagnosis privately first THEN got treatment via the NHS. Saved a LOT of waiting and chasing up the NHS, so we would recommend that anyone struggling with waiting lists maybe consider this route where possible.",
        "created_utc": 1678719143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice On Getting Meds?",
        "author": "scottsworthIII",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbrrt/advice_on_getting_meds/",
        "text": "Long story that I’ll try to keep brief: have seen several doctors and none are able to prescribe the medication they say I need. I’m now off work on medical leave for my mental health, trying to get things back in some sort of order. Feeling incredibly stuck and would appreciate any advice, please.\n\n—\nIn the fall of last year, I received my official diagnosis of ADHD from a psychologist I’d been working with for many months. As psychologists are unable to prescribe medications here (Ontario, Canada), we began trying many non-medication strategies for managing ADHD—all of which were unsuccessful, ultimately. The psychologist recommended I work with a doctor to get a stimulant medication, which they claim would make a huge difference.\n\nAs I don’t have a family doctor (and have been on a waiting list for one in my city for over 2 years), I tried a clinic doctor who had been managing all of my other medications virtually since the start of the pandemic. They were unable to prescribe a stimulant over the phone, but seconded the ADHD diagnosis and my need for a stimulant medication.\n\nI then tried a local clinic that I could visit in-person, where I saw a clinic doctor. They again confirmed the diagnosis and need for meds, but said the clinic’s policy is to not prescribe stimulant medications to walk-in patients—and that they aren’t taking new patients for their roster, so are entirely unable to help me. They gave me a referral to a psychiatrist, but said expect it to be 6 months before hearing back. They also said that an emergency room doctor might be able to prescribe it if I went to a hospital, but I run the risk of getting noted as “stimulant-seeking” and have issues in the future getting any other meds.\n\nI’d read on this group about TalkWithFrida, so started that process. However, the result of my screening was “you need to see a psychiatrist” and that they can’t help me—I assume because I admitted to having been diagnosed with a personality disorder? So they’re not an option either, it seems.\n\nI’m on a max dose of Wellbutrin for mood stabilization, and the clinic doctor said that Wellbutrin is the only non-stimulant medication they’d recommend for me (apparently already being on Wellbutrin makes the other non-stimulant meds not an option).\n\nLast week this all came to a breaking point for me, combined with massive stress from struggling at work. I’ve been diagnosed with occupational exhaustion (burnout) and given two weeks of unpaid medical leave to get myself back together.\n\nI’m feeling incredibly stuck in my situation and don’t see any options. All of these doctors are sympathetic but say there’s nothing they’re able to do given the laws/rules around stimulant medications. There must be some other avenue I can try, right? What am I missing here?\n\nThanks for any help or support.",
        "created_utc": 1678719005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daylight savings time",
        "author": "ledue87",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbnyh/daylight_savings_time/",
        "text": "Just wanted to say that I successfully ( ?) made it through and entire daylight savings stent without adjusting a single clock that needed it, the whole time doing the math in my head ( it can’t be 715, that clock is an hour fast !) type stuff .   Now they’re all correct.  Thought that was pretty funny 😄 would take probably 24 seconds to change each one",
        "created_utc": 1678718742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any of you go back to school later in life?",
        "author": "Pterodactyloid",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbl7v/any_of_you_go_back_to_school_later_in_life/",
        "text": "I started community college in 2019. I was already struggling when the pandemic hit, so that put an end to things. \n\nI was hoping to maybe hear some success stories of ADHD people going back to school after 30 (I'll be 31 in April). \n\nI have really low tolerance for frustration and difficulty, but I think that's gotten a little better in recent years. I'm also hoping that the right medication can help be the secret to success. Needless to say, I'm not one of those \"brilliant\" ADHD people, I'm just unfocused and not good at handling stress and failure.",
        "created_utc": 1678718556,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of fidget toys do you guys use?",
        "author": "z-calliger",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbkym/what_kind_of_fidget_toys_do_you_guys_use/",
        "text": "[removed]",
        "created_utc": 1678718539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with strattera",
        "author": "medusas-garden",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbi8c/struggling_with_strattera/",
        "text": "I'm sick of rotating through all these medications. So far I've tried various dosages and combinations of concerta and adderal - I realized I don't like stimulants because they make me jittery, I can't sleep, and make me hyperfocus on the wrong things even worse than before. I started taking strattera a while ago and I'm not sure if it helped or not. I'm struggling with taking it every day because it makes me so tired. I have on several occasions taken a \"nap\" around 3 or 4 pm and woken up the next day after sleeping for like 15 hours. And when I don't take a nap I'm just so exhausted. I can't get the stuff I need done if I'm asleep or too tired to do it. I've heard that's a temporary side effect and should go away after a couple weeks of consistently taking it (correct me if I'm wrong) but I'm having a hard time getting to that point at all. I see a lot of people having an \"aha\" moment with their medications and I've just never felt that. I can never tell if it's actually working. I've been trying to find a solution for almost two years now and I'm sick of it. I'm willing to try stimulants again but I'm just so lost. Has anyone else had issues with strattera or finding a good medication in general? Any tips?",
        "created_utc": 1678718355,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need a boost today, anyone want to work for 1 hour with me?",
        "author": "wedonttalkabouTB",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbhg8/i_need_a_boost_today_anyone_want_to_work_for_1/",
        "text": "[removed]",
        "created_utc": 1678718302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall Shortage",
        "author": "Curious_Patience7996",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbcr4/adderall_shortage/",
        "text": "[removed]",
        "created_utc": 1678717988,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYT: Opioid Settlement Hinders Patients’ Access to a Wide Array of Drugs",
        "author": "rmb185",
        "url": "https://www.reddit.com/r/ADHD/comments/11qbc3m/nyt_opioid_settlement_hinders_patients_access_to/",
        "text": "[removed]",
        "created_utc": 1678717945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this an ADHD symptom or should I worry??",
        "author": "PiggyIna0",
        "url": "https://www.reddit.com/r/ADHD/comments/11qb7gd/is_this_an_adhd_symptom_or_should_i_worry/",
        "text": "Sometimes when I am lying down on my bed or like just sitting doing nothing at all my heart starts beating so fast like when you finish to work out but the problem is that I don't work out.\n\nMy heart randlomy starts to beat so fast that becomes uncomfortable and makes me really tired.\n\nDo you guys relate to this? Is this an ADHD symptom? or should I worry and go see a doctor?",
        "created_utc": 1678717647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out a close friend of mine also has ADHD. I'm happy, I'm sad and I kind of hate myself.",
        "author": "iskandar-",
        "url": "https://www.reddit.com/r/ADHD/comments/11qb6mj/just_found_out_a_close_friend_of_mine_also_has/",
        "text": "[removed]",
        "created_utc": 1678717595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone had any success with an overmethylation supplement protocol?",
        "author": "Wilber187",
        "url": "https://www.reddit.com/r/ADHD/comments/11qaquo/has_anyone_had_any_success_with_an/",
        "text": "[removed]",
        "created_utc": 1678716571,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just got prescribed Ritalin, where can I find if it has interactions with supplements?",
        "author": "fux0c13ty",
        "url": "https://www.reddit.com/r/ADHD/comments/11qal65/i_just_got_prescribed_ritalin_where_can_i_find_if/",
        "text": "I found a page that shows if it interacts with other drugs but nothing about supplements. There are some vitamins/minerals/herbs that I like to take cyclically but I'm afraid to take anything now. \n\nI'm most interested about iodine, since it helps a lot against my terrible menstrual cramps (possible endometriosis). I haven't taken it last month and now the pain is back like before and I have a very hard time handling it. I read that Ritalin is not recommended for people with thyroid issues, which I don't have as far as I know, but iodine is very closely linked to thyroid so I just want to make sure this is ok.",
        "created_utc": 1678716179,
        "upvote_ratio": 1.0
    },
    {
        "title": "I may have found out why ritalin/adderall shortages are still going on. They are patenting a new relative of ritalin from a new company.",
        "author": "Successful_Writing72",
        "url": "https://www.reddit.com/r/ADHD/comments/11qafbc/i_may_have_found_out_why_ritalinadderall/",
        "text": "[removed]",
        "created_utc": 1678715797,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I’ve become much healthier despite ADHD",
        "author": "ICareAboutThings25",
        "url": "https://www.reddit.com/r/ADHD/comments/11qadpn/how_ive_become_much_healthier_despite_adhd/",
        "text": "A common theme I’ve seen from ADHD folks is that it’s hard to maintain diet/exercise for us. We often eat out of boredom or sensory seeking. We can struggle to form new habits. We can struggle with motivation. \n\nSo I thought I’d share what worked for me. I went from being a 190 pound girl with chronic back pain, no strength, winded after climbing two flights of stairs to a 133 pound gym rat who no longer has back pain and can easily run 2-3 miles. \n\nTwo quick disclaimers: 1. I am not a professional. I’m not a doctor, I’m not a dietician, I’m not a trainer. I’m just a woman who has succeeded in this area. 2. I have a lot of advantages in this area. I’m far from rich, but I have access to money. Some of what’s worked for me depends on having access to money. Some of my tips will help anyone, but some of them require money. I’m also single and childless, which are both HUGE time/freedom advantages. Again, some of my tips can apply to anyone, but I recognize not everything will work for everyone. \n\nAnyway, here’s the tips:\n\n1. Pre-cooked and/or pre-cut healthier foods are worth their weight in gold. Tyson Grilled n Ready chicken breast, frozen pre-cut fruit, frozen steam in bag veggies. Even canned veggies and fruit (look for low sodium/low sugar versions!) at least get some fruits and veggies in your diet. This reduces the need to cook and clean up, and the number of steps needed to make healthy food. Pre-washed baby spinach or carrots are also good. \n\n2. Make healthy swaps for foods you already know how to prep. This is a super lazy way to make food healthier. You don’t have to learn a whole new recipe. Just swap in extra lean ground turkey for ground beef, or frozen Greek yogurt for ice cream.  Even if it’s still not the healthiest thing in the world, it’s at least a little better for you. \n\n3. Minimize the junk you keep in your house. It is literally impossible to binge mindlessly on a food that doesn’t exist. \n\n4. Get a personal trainer if you can. Of course, this is one of those “I have access to time and money” tips. If you can, I highly recommend it. They take the mental work out of some of your workouts. \n\n5. Plan meals ahead of time with a calculator in your hand to count calories and whatever macros you’re focusing on for your goals. I plan a few days at a time so I don’t get decision fatigue or get impulsive when the time comes to make food or eat. \n\n6. Make your workouts fun and encouraging. I LOVE the stair master at the gym because I can listen to motivational speeches or (for a small chunk of it) an audiobook. My mom used to read on the stair master. I also like the high energy fast paced classes at my gym, like HIIT or kickboxing. I also highly recommend weightlifting. You can change up the movements you do, so it doesn’t get boring. It’s also super motivating to look in the mirror. Your muscles getting more defined is a visible reminder that you are a beast. You get an easy, immediate sense of achievement just by glancing in the mirror. \n\n7. Measure out single serving containers or buy pre-packaged single serve containers to combat mindless eating. \n\n8. Stop making perfect the enemy of the good. This is probably the most important thing. Sometimes I eat a protein bar with artificial sweeteners. But at least I’m getting a significant dose of protein. Sometimes I eat some Halo Top ice cream. But it’s a carefully measured amount, so it’s only 100 calories. Sometimes I eat canned veggies. But at least I’m getting some in my diet. Once a week I have a cheat day. I’m far from perfect. But I’m so much better than I was before. \n\nDon’t give up. I was a lost cause before I started.",
        "created_utc": 1678715689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else experience tingling/crawling sensations as vyvanse wears off",
        "author": "twenty20reddit",
        "url": "https://www.reddit.com/r/ADHD/comments/11qadex/anyone_else_experience_tinglingcrawling/",
        "text": "[removed]",
        "created_utc": 1678715668,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those with Adhd and managed to complete personal projects: how did you do it?",
        "author": "No-Art-8977",
        "url": "https://www.reddit.com/r/ADHD/comments/11qa8vu/for_those_with_adhd_and_managed_to_complete/",
        "text": "So I'm trying to finish a book that I started back in 2016 for my undergrad thesis. While I managed to get something along a first draft and deliver it in 2018, I was writing it in a very troubled time (depressed, adhd undiagnosed) and much of it needs to be redone — plus, I never wrote the true final chapter. \n\nSeeing as how that book was the closest I got from finishing a personal project, I organized everything and put myself to work. After two months of consistent work, I started to lose interest.\n\nThis time, I want to finish it. But with adhd, I know willpower is way less than enough. I take my meds and even though they help a lot, they won't change the fact I still get bored easily with long term projects.\n\n(TL;DR:) So, for those who managed to finish personal projects: how did you do it? And what strategies did you use to keep going when everything else seems way more interesting?",
        "created_utc": 1678715365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like I (Dx ADHD-PI, 37f) am experiencing more and more autistic traits as I get older - is that a thing?",
        "author": "GeosminHuffer",
        "url": "https://www.reddit.com/r/ADHD/comments/11qa5xm/feel_like_i_dx_adhdpi_37f_am_experiencing_more/",
        "text": "[removed]",
        "created_utc": 1678715161,
        "upvote_ratio": 1.0
    },
    {
        "title": "To those wondering why the ritalin/adderall shortage is still going on, I may have found your answer.. Re-patented re-branded ritalin by a new company, it’s already in 3rd trial studies.",
        "author": "Successful_Writing72",
        "url": "https://www.reddit.com/r/ADHD/comments/11qa47r/to_those_wondering_why_the_ritalinadderall/",
        "text": "[removed]",
        "created_utc": 1678715045,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't hate my ADHD",
        "author": "sobrique",
        "url": "https://www.reddit.com/r/ADHD/comments/11qa1uq/i_dont_hate_my_adhd/",
        "text": "When I was diagnosed with it just this year, I was 43.\n\nAnd I was truly shocked, at just how much of my life was ADHD. It was _everywhere_. \n\nThis - as it is to so many of us - was a LOT to process. Because it really has caused a load of damage. \n\nI've had depression for a long time - mostly low key, but it's not helped. I was suicidal last year, and ... well, that's what kicked all this off really. I'd probably have never been diagnosed. \n\nAnd so many mistakes. So many failures that ADHD has 'given' me. And I couldn't understand why. \n\nBut at the same time, I think I have learned by my experiences. Some of the lessons ADHD has for you will be cruel. They'll be painful. But they can still be valuable growth opportunities too.\n\nBecause ADHD made 'making friends' hard, it means I missed out on 'casual' friendships. But I got some amazingly good friends who _weren't_ just casual friendships.\n\nADHD made 'casual' relationships hard. I'd had a few 'fizzles' that were barely more than one night stands, but nothing really serious. I put that down to ADHD too. But I have finally found someone amazing, who 'gets' me, when ... I might have settled down in a 'comfortable, but not great' relationship instead. \n\nADHD made employment hard - some jobs I just couldn't do - even now, on medication, because of how they interact with my ADHD. But as a result, I've been _forced_ to find a job that I love. I couldn't do anything else really, so it's not a \"win\" of any sort. But still. I do have a job that I love. \n\nThere's _maybe_ been a few places where I've learned to be more effective/stronger as as result of ADHD. Because I've _had to_. Much like a regular wheelchair user might develop great upper body strength. Technically correct if you frame it as a 'benefit' but rather missing the point. \n\nSo if you asked me if I consider ADHD a positive in my life? I'd give you a resounding 'no'. It has been harsh, and cruel. Those lessons and personal growth have come at too high a price. \n\nBut if you ask me if I'm unhappy with where I am today? That I _regret_ having ADHD? I'd also tell you 'no'. \n\nBecause honestly, I'm happy today. I have a great life. I have a job I love, a true 'partner' to share my life with, and I have amazing friends. I've not ended up where I'd _intended_ at all. But none the less, where I am is a good place. \n\nI've walked dark roads to get there, without even the glimmer of understanding that a diagnosis would have given.  I'd spare others that if I could. \n\nBut none the less - I don't hate my ADHD. It's part of me that isn't going away. And _all_ of me is what brought me to where I am now.",
        "created_utc": 1678714877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse Help!",
        "author": "lulukins1994",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9yo8/vyvanse_help/",
        "text": "[removed]",
        "created_utc": 1678714665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late life diagnosis and I'm trying to save my marriage after years of unknowingly living in my head.",
        "author": "Azipear",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9w4o/late_life_diagnosis_and_im_trying_to_save_my/",
        "text": "I wrote a long post but realized this paragraph is enough to capture what I'm up against:\n\nI'm in a situation where my wife feels resentment about my emotional distance and lack of support. We were married for 10 years before I was diagnosed 5 years ago in my early 40s.  Her most-frequent complaints include **\"You live in your own head\"** and **\"You could solve all these problems if you could just think about other people.\"**  I struggle to even understand exactly what these mean.  I want to understand and make changes, but I just can't pin down what I'm doing wrong.\n\nAlthough getting medicated has transformed how I feel about myself, my wife points out that she hasn't noticed any improvement in how I contribute to our marriage.  We're in couples therapy and I'm in individual therapy to try to pull the marriage out of the ditch.",
        "created_utc": 1678714495,
        "upvote_ratio": 1.0
    },
    {
        "title": "When wellbutrin will finally start to work?",
        "author": "Morelnyk_Viktor",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9w1u/when_wellbutrin_will_finally_start_to_work/",
        "text": "TL;DR: no effects from wellbutrin after months of taking it. Is it common?\n\nI was diagnosed like half a year ago, at age of 28. Been on strattera, it helped quite a lot, I was more present, had easier time initiating tasks, got more room inside my head, it was quitter. But I couldn't stand side effects, horrific urinary issues in my case. Tried concerta. 18mg did nothing for me, 36 made me feel really weird. I'd be going through my day and then sometimes I would just not understand what's going on, or I would read some text, and saw only letters, couldn't understand words. And I got intrusive thoughts from it. So I decided to stop. My psych told those are all options that we have in my country. So I just gave up and went unmedicated. Recently I changed psych and turns out we also have wellbutrin. So I'm month on 150mg extended release. And I feel absolutely nothing. I had some increased thirst, a few night of bad sleep, muscle tension and some headache in first week. But now I feel nothing (maybe some tension in my jaw muscles). No positive results, not even slightest. Absolutely none. I understand it takes time, for wellbutrin to start to work, but absolutely zero effects after one month? Doc wants to up my dose to 300mg, and I'll start in a few days, but I'm already kinda losing my hope. What's your experience with Wellbutrin?",
        "created_utc": 1678714490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insomnia or ADHD",
        "author": "JobRecent530",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9sx2/insomnia_or_adhd/",
        "text": "I’m a college student full time and I find it quite hard sleeping. I’ve always had a really bad sleep schedule since I’ve been a kid. I can’t sleep unless I’m mentally exhausted which is quite rarely because I’m always hopping on so many topics and always find them intriguing and get fixated wanted to know more. I’m active and usually go to the gym and walk around campus but even if my body tired but my brain isn’t I can keep going. Most if not all days I sleep around 2am-6am or not sleep at all  while having to take my brother to school at 7:15 am and going to class at 10:55 am Monday to Thursday. I can’t tell if this is because of ADHD or because I might have severe insomnia. I’d like to note that even at night if I turn off my phone I get restless in bed for hours. I am not currently medicated but been diagnosed but don’t have insurance lol. \nI was wondering if anyone has similar sleeping habits because of it or if I just have insomnia",
        "created_utc": 1678714278,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get Vyvanse as cheap as possible?",
        "author": "angcalo",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9rx2/how_to_get_vyvanse_as_cheap_as_possible/",
        "text": "Was on Vyvanse for years but switched insurances a few years ago and got on Adderall XR with an IR booster at lunch. \n\nNow, due to the shortage, I’m heavily considering getting on Vyvanse again and my doctor is open to writing a script, but it is just so expensive. \n\nI have Aetna and Express Scripts (whatever that is) through my job but it appears to be the same price on savings websites and others. How can I get Vyvanse 30 MG for as cheap as possible?",
        "created_utc": 1678714211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Referring to ADHD without the second D",
        "author": "youkkai",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9pm6/referring_to_adhd_without_the_second_d/",
        "text": "[removed]",
        "created_utc": 1678714052,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Manifestation of Rejection Sensitivity?",
        "author": "TheReddister",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9cwg/a_manifestation_of_rejection_sensitivity/",
        "text": "I know there is limited research on rejection sensitivity/rejection sensitivity dysphoria. But I was curious if this sounds like the type  of thing that would fall into RS and RSD — also I would appreciate arguments or claims are made in response come with some sort of evidence or source please!\n\n\nLast night I was with friends and at the end of the night we got into an argument about permanent DST vs permanent standard time. \n\nI was having a lot of trouble formulating my arguments for why permanent standard time is good and I was feeling personally insulted by their disagreements and arguments (it doesn’t help I hate when it seems like nobody is listening to me — it is a huge pet peeve). \n\nThe argument didn’t really resolve it was more of a “agree to disagree” type thing but after they left I felt intensely upset and emotionally hurt and could not figure out why despite logically knowing that them not agreeing with my opinion doesn’t mean anything, it was a dumb argument, and it’s not like we have any say in whether or not it passes. \n\nI stayed up until like five am last night writing out a very thorough response that I was gonna text my friends but ended up not sending to them because I figured it wouldn’t help at all. \n\nI woke up today still obsessing over the argument and “oh if I just said this I could’ve proved them wrong” and I still legitimately feeling hurt and it makes me feel incredibly immature and I’m so confused why I’m like this because this has happened before about equally minor and stupid things. \n\nI feel like I’m broken whichever way you slice it.  \n\nIf this isn’t actually due to ADHD then I feel like I’m using ADHD to cover up a personality flaw by thinking it’s part of RSD but on the flip side if it’s RSD I feel like I’m broken because it explains why no matter how hard I try to chill out during these types of things I cannot — simply because of my neurochemistry.",
        "created_utc": 1678713182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I crazy to request a new teacher?",
        "author": "BA-in-VA",
        "url": "https://www.reddit.com/r/ADHD/comments/11q97xr/am_i_crazy_to_request_a_new_teacher/",
        "text": "Hi there! I’d love to hear your thoughts on a request I made for my 1st grader. Also, I’d love tips on how to make sure I’m taken seriously. \n\nMy child is 6, and he is suspected to have ADHD. We’re in the middle of the diagnostic process. I met with my son’s teacher, school psychologist &amp; the assistant principal at the beginning of the year to see if we could share ideas on how to help him focus better. We had several next steps. None of them included punishment. He also makes quiet repetitive sounds. The therapist said that oral fight toys aren’t nearly as effective as gum, but the teacher refused to allow gum. Fast forward 5 months, my child is acting very depressed, and withdrawn at home and at school. I find out that he’d been moved to the very back of the classroom, while very other child is in 5-person groups, and she did this for punishment because he was making noises, and some other really ridiculous infractions.\n\nI asked her to move him back , but she made him earn it with at least 1-full week of “good behavior.” Despite her deducting points for him picking his nose, looking at the wall next to his desk, etc, he earned the ability to rejoin the group. I worked hard on his self esteem, and gave him pep talks every morning before school to remind him how awesome he is. After 2 weeks of fantastic reports, he was sick, and missed a day. He came back, and before that first day was halfway through, she’d moved him back, with no plan to reintegrate him.   \n\nNow my son is afraid of stepping out of my shadow, he doesn’t want to interact much, and he even expressed thoughts of wishing he weren’t alive.  😭Again, he’s 6. \n\nI have a meeting with the principal and teacher to request they move him to another classroom. Am I going about this wrong? If not, do you have any recommendations for how I might achieve the goal of getting him into another classroom? \n\nThank you!",
        "created_utc": 1678712847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flying off the handle",
        "author": "Techyness",
        "url": "https://www.reddit.com/r/ADHD/comments/11q9576/flying_off_the_handle/",
        "text": "[removed]",
        "created_utc": 1678712655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice to study when you have adhd and major depression?",
        "author": "Throwra-Shoe1209",
        "url": "https://www.reddit.com/r/ADHD/comments/11q94q5/any_advice_to_study_when_you_have_adhd_and_major/",
        "text": "Im a college student and Ive been struggling a lot with doing homework. I take 6 classes that feel like Im punishing myself to make up for the 2 classes I failed last semester. Im constantly exhausted, overwhelmed, ashamed, and frustrated. I feel like Im walking in the ocean being pushed around in every direction. Im barely even functioning. I care very much and I want to do good, but whenever I 'finish' something, theres always more to do, always something else. I never truly get a break, which is why I feel so defeated and helpless.\n\nNone of my assignments are actually difficult imo, but it takes time, energy, mental processing, and small things add up. Ive tried so many things from planning tools, alarms and pomodoro , reducing visual clutter, 'rewards,' lofi, breaking stuff into manageable chunks, body doubling (virtual and in person), toning down perfectionism, and etc, but nothing's ever lasted more than 2 weeks. Im just so tired of trying my best and it not even being good at all. I cant bring myself to start anything. Ive been at my computer all night after a weekend of sleeping and I havent even looked at a single assignment. \n\nSo, considering not experiencing joy in anything, constant mental and physical exhaustion: How can I get myself to start an assignment and stay consistent over time?",
        "created_utc": 1678712621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I wrong for finally getting diagnosed?",
        "author": "Able_Bug_76",
        "url": "https://www.reddit.com/r/ADHD/comments/11q941f/was_i_wrong_for_finally_getting_diagnosed/",
        "text": "[removed]",
        "created_utc": 1678712573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jobu Tupaki",
        "author": "Nocturnal_Owl_Monkey",
        "url": "https://www.reddit.com/r/ADHD/comments/11q900q/jobu_tupaki/",
        "text": "Anyone obsessed with the movie everything everywhere all at once? I'm rewatching and I have nobody irl who feels this movie as deeply as I do. Anyone?????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????? obsessed with the movie everything everywhere all at once? I'm rewatching and I have nobody irl who feels this movie as deeply as I do. Anyone??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????",
        "created_utc": 1678712304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jobu Tupakiii",
        "author": "Nocturnal_Owl_Monkey",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8z74/jobu_tupakiii/",
        "text": "[removed]",
        "created_utc": 1678712241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joni Tupakiiioi",
        "author": "Nocturnal_Owl_Monkey",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8ric/joni_tupakiiioi/",
        "text": "[removed]",
        "created_utc": 1678711657,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm scared of the long term affects of Adderall, What does the research really say? Is Adderall neurotoxic?",
        "author": "MarkusRight",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8ke5/im_scared_of_the_long_term_affects_of_adderall/",
        "text": "I've been diagnosed with ADHD since I was 6 years old, for most of my life I've been on Adderall, I stopped taking Adderall around when I turned 19 back in 2012 and moved out of my moms house, it was a personal choice, I did quite well for about 4 years or so after I moved out and had a few jobs that never lasted for more than a year each. I soon began to lose all my motivation, I felt like life was hard and I struggled to have the motivation for literally everything, Im now 33 years old and the only actual job I have is freelancing on crappy sites like Amazon mechanical turk making slave wages. The thought of stretching out into other work especially outside of my home is stressful to me mentally, I have zero motivation and I feel like Im wasting away, I'm not depressed or anything, just bummed out that I lack motivation to try and do things that can better myself. The thing I'm most worried about is just getting the drive to get a real job and start making some money that can cover the bills. \n\nI want to talk to a therapist again at Pathways and see about going back on medication, But over the years I have read many studies that state that Adderall is neurotoxic and also has permanent negative effects on your cardiovascular system. Those things scare me to death and its why I have avoided going back on any sort of stimulants. What is the safest stimulant that I could possibly go back on that wont kill my brain cells or give me permanent damage to my cardiovascular system?",
        "created_utc": 1678711117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not so sure my medication is truly working... I feel different, but my ADHD symptoms are still here I think...",
        "author": "MrSwipySwipers",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8hvw/not_so_sure_my_medication_is_truly_working_i_feel/",
        "text": "**TLDR: Medication gives enthusiasm and not focus it seems. How do you guys feel on your medication and in your opinion, should I try a different medication based on my experience so far?**  \n\n\nSo I'm on Vyvanse 60mg. I've been on it for around 3 weeks now. I'm not 100% certain, but I'm pretty sure the only thing I'm actually getting from my medication is the slight euphoria and enthusiasm.  \n\n\nIf possible, I'd like you guys to tell me how you feel and how you know when the medication is really working. Not just Vyvanse of course, all medication. Not placebo either, which is probably what I'm experiencing.  \n\n\n I told my doctor that I was unsure if my medication was working. I said that I was making less mistakes at work and that my appetite decreased. I also told her that I felt happier and more enthusiastic. She said those are signs that the medication is working. What I didn't tell her though is that my actual symptoms haven't gotten any better as far as I can tell. Whenever I'm doing something, if someone next to me is speaking to someone, I won't be able to lock on the task that I need to be doing and still pay half attention to both things... It's horrible when I have to count something especially...  \n\n\nI'm primarily inattentive as my flair says, so I can't focus properly on one thing at a time and I've noticed that my medication hasn't really helped with that. I'm thinking I should ask my doctor to try a different medication. What do you guys think?",
        "created_utc": 1678710923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assessment results tomorrow",
        "author": "Sunnyday1998",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8h5t/assessment_results_tomorrow/",
        "text": "[removed]",
        "created_utc": 1678710875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science Research ADHD Survey Experiment",
        "author": "Various-Pie9627",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8fdv/science_research_adhd_survey_experiment/",
        "text": "[removed]",
        "created_utc": 1678710743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall shortage has been lessening up in my area",
        "author": "kp6615",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8a75/adderall_shortage_has_been_lessening_up_in_my_area/",
        "text": "So I live in central pa about forty min from state college pa. Anyway I had no issues getting my adderall xr 30mg for some time. Then this past December, the shortage started to hit my area so I was able to get my medication from CVS in December and then my normal mom and pop that I go to refill. My Adderall was able to get it for me in January and then last month when I really had a struggle because it didn’t they said they didn’t know when it was coming in, they switched suppliers and they are you got it so now it’s March and I have three pills left so I spoke with them yesterday and I asked to confirm that it would be able to be filled. They said since they switch suppliers. That they were able to get it for no additional problems. Because they are an independent and a really small chain they only three local pharmacies. They have access to other suppliers that CVS Rite Aid Walgreens don’t.\n\nI used to work for CVS pharmacy as a technician and a CVS. Rite Aid, Walgreens, Walmart all the big ones use the same suppliers I then did some work out independent with my ex who was a pharmacist and they use a different suppliers so I know a lot of us have been having struggles filling our medication but I suggest you use an independent pharmacy acres I need a business be because they are more apt to have it",
        "created_utc": 1678710359,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: Scheduled text messages are a thing. You're welcome.",
        "author": "Rhaski",
        "url": "https://www.reddit.com/r/ADHD/comments/11q81d7/psa_scheduled_text_messages_are_a_thing_youre/",
        "text": "Alright maybe I'm showing my age here, using actual text messages instead of tagging people with a bunch of heiroglyphics or concocting a 10 second interpretative dance on tiktok or whatever the kids are doing now. But, hear me out!\n\nI'm shitty at getting back to people, or initiating an important conversation. My brain just sort of chews on things throughout the day and then, at night, I remember all the shit I needed to reply to or talk to people about but I know it's way too late to be calling or texting lest I wake people up or it just weirds out my colleagues getting a text from me at midnight asking if they wanted me to bring in some homegrown butternut pumpkins or whatever.\n\nSo, I do it anyway. I bash out those messages during that brief window of my brain actually being able to recognise what needs to be said to who and then I *schedule the message to send in the morning like a god damn whizkid*. Literally all I do is hold the \"send\" button and it comes up with the option to do it. I have a Samsung but I'm pretty sure most all phone can do it or at the least there is a messaging app that can be installed with that feature. \n\nIt's such a simple hack but I feel like a god when I do it. It's like I have sent forth a copy of myself into the future bearing the messages I know would never be sent if I actually waited til morning.\n\nAnyway, if you're like me and remember shit when it's way too late to risk calling/messaging people, I just want you to know you can punch that message out and schedule that shit to send in the future like you're Marty McFly. Now I just gotta work out how to make a message send in the past and I'll be all sorted!",
        "created_utc": 1678709700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone told me how to emotional stable with ADHD?",
        "author": "BlacksmithRegular400",
        "url": "https://www.reddit.com/r/ADHD/comments/11q8184/can_someone_told_me_how_to_emotional_stable_with/",
        "text": "I got ADHD inattention type, not on medication because of the supplement can let me be concentrate enough for me to get by. However, being not motivated and moody all day isn't something I can deal with it. Even with venting my emotional speech to my friends aren't enough to deal with moody feeling. This is a bad habit for me to bothering people reading my depressed mood and it seems like I tried to find an excuse to escape but it was so irritated that I can't stand sitting still and doing something at all. The emotional regulation was so down that angered me in return. \n\nPls help me find way to calm myself down. I don't drink coffee because the irritated will gotten worse and drinking tea only calm me down for a while.",
        "created_utc": 1678709687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science Research ADHD Survey Experiment",
        "author": "Various-Pie9627",
        "url": "https://www.reddit.com/r/ADHD/comments/11q810s/science_research_adhd_survey_experiment/",
        "text": "[removed]",
        "created_utc": 1678709670,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just had to pay full price for my meds because ADHD can only be diagnosed on children!?",
        "author": "Good-Baker9668",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7sbk/i_just_had_to_pay_full_price_for_my_meds_because/",
        "text": "[removed]",
        "created_utc": 1678708974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work Anxiety",
        "author": "Master_Slav",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7nwo/work_anxiety/",
        "text": "[removed]",
        "created_utc": 1678708643,
        "upvote_ratio": 1.0
    },
    {
        "title": "The practice didn't notify me that they didn't receive all documents!",
        "author": "cuddlyjail",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7mfj/the_practice_didnt_notify_me_that_they_didnt/",
        "text": "[removed]",
        "created_utc": 1678708517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fatigue from stimulants.",
        "author": "nooneknowsitthis",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7cwm/fatigue_from_stimulants/",
        "text": "I'm taking 50mg Vyvanse/Elvanse, extended ones and it's already crashing during the day. I hate it so much. \n\nI'd get super sleepy some time after the medicine starts to work. I slept like 7+ hours last night and now super tired. What in the world?\n\nIs it possible to take the extended ones but the effect lasts only some hours? Holy crap. Do I have to take the immediate one as extra? \n\nSomeone told me to take the meds with protein drink. I haven't tried because I don't have anything protein powder to mix with any drinks. So... Yeah, but! \n\nHas anyone ever gone through this problem? :-(",
        "created_utc": 1678707702,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOY NUEVO , AYUDA!!! ritalin en Perú",
        "author": "Sufficient-Coast-757",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7ctp/soy_nuevo_ayuda_ritalin_en_perú/",
        "text": "Hola , soy nuevo aqui tengo 23 años , he estado buscando por mi parte informacion de mi falta de concentración constante , por ejemplo : me decido estudiar y luego busco en yt ruido blanco para concentrarme , pero me la paso como 2 horas buscandonlo y luego recien me doy cuenta de mi error , o el tambien olvidarme de las cosas por ejemplo : me idealizo cuando ando comprando en el centro ,que en casa buscare tal producto que vi recientemente e investigar un poco de ello , cuando llego a casa , ingreso al celular y se me va todo lo que tenia que buscar , y me quedo pensando por mas de 10 minutos , haciendo un recuento de todas las cosas que hice en el transcurso del dia , no he podido ir a hacerme un chequeo para que me digan que tengo TDAH , pero estoy seguro que si , investigue aun asi que el ritalin o metilfenidato son buenas opciones para la concentración pero en mi pais no encuentro farmacias confiables y tambien lei por ahi que requieren receta medica . Necesito consejos de fuentes confiables para adquirir estos productos y cuales son mejores.",
        "created_utc": 1678707694,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate long audio and/or text messages so much",
        "author": "kissy-missy-no-name",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7cm6/i_hate_long_audio_andor_text_messages_so_much/",
        "text": "My mom just sent me a 10 minutes audio someone sent to her for me to listen to as well and after 1 minute I had to restart it all over again and at 2 and a half minutes I gave up because I had to restart AGAIN :V\n\nI also have a 15 page file to read with all the results of the diagnosis I did with my therapist and I opened it, scrolled through, sighed and closed it. I have to read it I know I do, but holy fuck it's a lot of text and I really really really don't want to read all of that information ;-;\n\nI wonder if this is related to ADHD and struggling with paying attention to things",
        "created_utc": 1678707676,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD masking and internalized hyperactivity",
        "author": "GomuGomuNoKush",
        "url": "https://www.reddit.com/r/ADHD/comments/11q7c41/adhd_masking_and_internalized_hyperactivity/",
        "text": "Hi! I was thinking about the hyperactivity part of my condition and realized I've been neglecting my studies about it. I read somewhere that being physically hyperactive is a way of our brains to create some stimulation because it craves for any kind of dopamine.\n\nI was a very hyperactive child but, somewhere along the way, I became very quiet, shy and restrained. I think I was punished for talking too much, disrupting the classroom etc. I learned to mask my ADHD symptoms and my hyperactivity became mental, if that makes sense.\n\nI always felt a sort of electricity running through my body all the time, which makes me very restless, but I thought that was anxiety. \n\nBut, now, I'm wondering if that energy isn't actually my hyperactivity trying to manifest itself physically, but because I've been pushing it down for two decades, I couldn't even recognize it anymore.\n\nAfter I realized that, I relaxed myself and now I'm fidgeting all the time, shaking my legs, moving my body, walking faster, doing chores in a rush.\n\nDo you think there's any truth to that? What are your experiences with masking and internalized hyperactivity?",
        "created_utc": 1678707630,
        "upvote_ratio": 1.0
    },
    {
        "title": "If someone shames you for expressing genuine passion or excitement...",
        "author": "vengeful-chinchilla",
        "url": "https://www.reddit.com/r/ADHD/comments/11q768j/if_someone_shames_you_for_expressing_genuine/",
        "text": "You know what? Fuck that and the horse it rode in on. I would never let anyone else feel like that. I will always make a point to listen to people, to respect their passion. Even if the subject they're talking about doesn't personally interest me.  \n\n\nWhy are people so selfish and disrespectful? Is it really that hard to just honor another person's interests? To not treat them like they're a burden and/or annoying for just genuinely feeling excited about something?   \n\n\nYou are not the weak one for being 'too much'. You are not the intolerable one. If someone is really so immature and weak-willed that they;  \n\n\na. Don't respect other people enough to honor their voices / interests.  \nb. Expect the other person to be a bloody mind reader, and to just shut up whenever it best suits them. \n\nThen that is the truly intolerable thing, isn't it? \n\n&amp;#x200B;\n\n\\- If someone wants to talk about their own interests, then they can talk about their own interests! \n\n\\- If someone is tired, or they have something else to do, then they can end the freaking conversation! \n\nSeriously, am I going crazy or something? Because I'm pretty sure it's far ruder to *shame* the other person for not being a mind reader, then to actually just state what you freaking want.     \n\n\n&amp;#x200B;\n\nHonestly, people like that? They don't deserve your time. They don't deserve to hear you speak. They don't deserve us. They can have us at whatever pointless, surface level they please and quite frankly it's their loss.   \n\n\nIf someone gets their bloomers in a bunch because you want more from a conversation than just a series of inane bloody comments about the state of the weather, then seriously, that's on them. (No disrespect to meteorologists though, you guys are awesome.) \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nSo yeah, if you're beating yourself up for caring about things, for getting genuinely excited about something, please, please don't. You are not the problem. Your authenticity is one of the most beautiful things on this earth. Please don't let anyone make you believe otherwise, because honestly it's such a waste.   \n\n\nYou matter. What you care about matters. You're not 'too much'. They just aren't bloody enough.",
        "created_utc": 1678707117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to find the right mg 😭",
        "author": "ratdonation",
        "url": "https://www.reddit.com/r/ADHD/comments/11q6z1k/struggling_to_find_the_right_mg/",
        "text": "Hi all 😊 I'm 29, m, UK on Elvanse (vyvanse/lisdexamphetamine). Soon I will need to share with the doctor what mg is right for me. But I've been on a ride! Each mg feels different. My question for all of you today is when do you know your meds are working? That the meds are actually doing their job?\n\nMy experience of mg so far:\n\n30 mg }\n\nP: improvement to focus and mood\n\nN: mild to moderate improvement\n\n50 mg }\n\nP: longer focus sessions in day, lifted depression, more relaxed body, less binging\n\nN: insomnia and hyper-focus in afternoon into evening, some days with strong anger, no improvement in movement (walking etc), not eating or drinking much, racing heart (high bpm either side of peak of elvanse)\n\n40 mg\n\nP: some focus and lift in mood\n\nN: feelings of depression, strong and uncomfortable emotions, low spirits\n\n60 mg }\n\nP: positive mood, moments of silence in my brain (80ish% reduced chatter/noise), can sleep, no elevated bmp throughout day\n\nN: some spaced out moments, feeling level, some mild loss in focus, some binging, less and less long focus sessions\n\n70 mg to try soon\n\nI guess I would like to know to better understand my experience on Elvanse are:\n\n• what are the ideal affects of  elvanse as intended?\n\n• how do you know your meds are working for you?\n\n• is it meant to quieten my mind or help me focus for hours? aka my experience on 50 mg Vs 60 mg\n\n• what mg are you on/works best for you?\n\n• have you had moments of depression, low-mood, uncomfortable and/or strong emotions?\n\n• does lifestyle (diet and exercise) affect your experience on your mg?\n\n• does the high BPM reduce over time using Elvanse?\n\n• do you take breaks from Elvanse?\n\nBUT, my biggest question is is Elvanse doing the right job by making me focus for hours (with mental chatter and high BPM) or quieten my brain and relax (with very little mental chatter and normal BPM)?\n\nI hope this helps others too going through confusion with mg 🙏🏻😌💛",
        "created_utc": 1678706493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having ADHD as well as BPD, CPTSD, depression, chronic anxiety, AvPD &amp; OCD...what do I do!?",
        "author": "Footsie_Galore",
        "url": "https://www.reddit.com/r/ADHD/comments/11q6ni7/having_adhd_as_well_as_bpd_cptsd_depression/",
        "text": "I feel sick with stress. A psychiatrist diagnosed me as having ADHD in early 2019, but it was a 30 minute non-comprehensive evaluation for anxiety and depression, so I always thought it was an incorrect diagnosis. \n\nBut today, my psychologist said he thinks I might have ADHD. UGH!!!! I tried Ritalin in 2019 and it was a NIGHTMARE! A zombie, lethargic, apathetic, depressed nightmare.\n\nI mentioned this, and he said that was interesting, and that since I have anhedonia and multiple co-morbid disorders, I would need to work through certain things before even GETTING to the ADHD, and that meds probably won't work until then.\n\nSigh. I feel too broken.",
        "created_utc": 1678705431,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD podcast recommendations?",
        "author": "GreenDutchman",
        "url": "https://www.reddit.com/r/ADHD/comments/11q6j2p/adhd_podcast_recommendations/",
        "text": "I've noticed there are quite a few podcasts about ADHD. It's a topic I'm very interested in, so: does anyone have experience with any of these podcasts? Which ones would you recommend? I don't really have any specific demands regarding what exactly they're about; I'm open to anything you guys think would be worth my time. Thanks in advance!",
        "created_utc": 1678705053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supplements for ADHD in children, specifically DMG",
        "author": "Material-Passion4981",
        "url": "https://www.reddit.com/r/ADHD/comments/11q6j27/supplements_for_adhd_in_children_specifically_dmg/",
        "text": "Has anyone tried DMG (Dimethylglycine\\*\\*)\\*\\* as an alternative to ADHD meds, specifically in children? I have one son (age 8) with severe ADHD and two others (ages 9 and 11) with ADHD/odd.  They have all been taking different strengths of concerta. I knew it was bound to happen, one son's strength is on backorder, and I'm confident the other two won't be far behind. Any input is appreciated. \n\nIt might be significant to add that all 3 have health with a significant amount of trauma due to a father who struggled with addiction and passed away in 2018. I believe trauma affects the brain and how it functions, so some of their symptoms could be related to that.",
        "created_utc": 1678705052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living with ADHD means eternal pain",
        "author": "hidoyouwannaDIE",
        "url": "https://www.reddit.com/r/ADHD/comments/11q6eyu/living_with_adhd_means_eternal_pain/",
        "text": "Alright so few months ago I got diagnosed and at first it was a relief but now that I learn a lot more about it and how to cope with it I realise more and more that my life will always mean insane pressure, stress and psychological pain.\n\nSo basically the thing is that. Knowing what ADHD is we know what we need in order to function at least somewhat properly in this world. \n\nBut the thing is what makes ADHD such a huge suffer is exactly coping with it. Why? \n\nLet's look at it from a different perspective. \nLet's create a theoretical perfect life for a person with ADHD. \n\nYou don't have to go to school, work or basically do any stuff that your brain isn't interested in or focused on. So in my case the perfect life would be spending entire days playing video games, watching movies/youtube, playing guitar, walking with the dog and going out with my few friends. And literally nothing else(except from of course eating, showering etc.)\nIf I didn't have to worry about my education, job, money or future and could just do aforementioned stuff the entire time I wouldn't feel any pressure and stress and would probably feel happy. I would just be 100% true to myself and live the life that my brain would dictate. \n\nNow let's confront it with the reality. You have to make a living, you have to have a job, go to school, do your driving licence, do projects, worry about your future in general, buy/rent a home, get a career going. And at least in my case I really really don't want to end up at a low-income, low-level job for my life, I want to have a comfortable life. \nAnd to at least try to accomplish that I have to go against my own brain and my own self and use all different types of techniques to cope with how my ADHD brain works. To put pressure on myself, to give myself deadlines and force myself a lot to do something. \n\nAnd as much as it works at least to a certain degree it has a massive toll on my mental well being because my and so many other ADHD individuals consists of constant crisises, constant pressure and constant stress. And it's absolutely devastating. \n\nIf you want to(or rather have to because it's not something I could really call a choice) be able to function in this world with ADHD it comes at a cost of your own mental well-being. And there is no escape from it. It's either being yourself and not be able to function in a realistically sufficient way or go against your own self in order to function better. \n\nFrom my personal experience my entire life was, and will be going against the current, struggling, experiencing huge amounts of stress in order to function. And now it's even clearer in my mind that's just the way it is and it's extremely depressing to know that, there is no escape from it. And there's nothing I wished was possible more than the mentioned above theoretical perfect life for ADHD where one could trully feel like themself, not experience excess stress and could really feel happy. But it's simply not possible. \n\nAlso I'm medicated and currently trying out different stuff. I'm on 36mg Concerta at the moment and it seems to work. But I noticed it only ever helps to focus and not get THAT much distracted. \nStuff like planning ahead, self motivation, let's say a general sense of time are not there and meds won't replace those things. \n\nThey help but only to certain degree and they won't eliminate that awfull excess amount of pressure and stress that I feel everyday. \n\nAre there any people that found a way to live with their ADHD the way they actually can feel like themselves and not experience the overwhelming stress of having to cope with the disorder? \n\nBecause for me it's just the realisation that my life was, is and always will mean hurting my mental health in order to be able to live.",
        "created_utc": 1678704659,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ADHD Journey: An introduction into life with late-diagnosed ADHD (a guidebook with tips)",
        "author": "squatwouldjesusdo",
        "url": "https://www.reddit.com/r/ADHD/comments/11q6aw7/my_adhd_journey_an_introduction_into_life_with/",
        "text": "Last year I was diagnosed with ADHD. I always knew something was up, but receiving a diagnosis provided much relief. Since then I've spent a lot of time researching strategies to help, and finding reasons and explanations for why I do what I do - for the most part! \n\nI've put together a little booklet of my experiences and things that have helped me better take control of my life! They might not work for everyone but they certainly work for me. This is in no way a comprehensive book about ADHD, I just scratch the surface. \n\nDisclaimer: The thoughts and experiences expressed in this guidebook are my own. I am not an expert in ADHD but I am an expert in my own experience. The tips I give in this book work for me, after years of trial and error, and may not work for you. We're all unique and that's what makes having ADHD so beautiful!\n\nDisclaimer 2.0: I am currently on medication to help with the symptoms of my ADHD and while I acknowledge that not everyone has access to this, I am very grateful for my medication and for how well it works for me.",
        "created_utc": 1678704268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Share please: how do you get your brain to shut up?",
        "author": "Standard-Spend924",
        "url": "https://www.reddit.com/r/ADHD/comments/11q67y3/share_please_how_do_you_get_your_brain_to_shut_up/",
        "text": "Hello! I have no medication for my ADHD yet and I am sitting around trying to work and my brain will not shut up. By that I mean, I have about 10 thought tracks at the same time, including a song looping in the back and random onomatopoeic noises whenever I move anything. Whenever I look at work and start, one of these thoughts pops into my brain and distracts me.\n\nSo cool to finally find out at age 30 that this is actually not normal! But now, what do I do to stop it?\n\n**I know this is a state of mind that happens to a lot of us. So what works for you to get yourself back into gear?**  \n\n\nHere's a visual aid for what I mean:  \n[https://www.instagram.com/p/Co27\\_j1gjxb/](https://www.instagram.com/p/Co27_j1gjxb/)",
        "created_utc": 1678703983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone relate?",
        "author": "formincode",
        "url": "https://www.reddit.com/r/ADHD/comments/11q5xbh/can_anyone_relate/",
        "text": "I was out on Zoloft just as the pandemic started and about a year ago I was finally diagnosed and medicated for ADHD, mental health wise I started doing much much better.  Career wise it’s been pretty tumultuous I have had 3 jobs since the pandemic started all less than 1.5 years. I just got laid off from my last one which I was doing great at and now it looks like the economy is about to crash. \n\nI am freaking out … and I want to cry",
        "created_utc": 1678702940,
        "upvote_ratio": 1.0
    },
    {
        "title": "“This time it’s different”",
        "author": "Mother_Ad3692",
        "url": "https://www.reddit.com/r/ADHD/comments/11q5rc0/this_time_its_different/",
        "text": "I just picked up my little journal book that I write all my endeavours in because i got exited to start a new one but it just dawned on me, all these ideas i’ve had have faded away and i’ve always gone “this one’s different i’ll stay focused and motivated this time” but never actually do. \n\nIt’s so demoralising and hard to deal with like why can’t I just stay focused on one thing, if i stayed focused on the thing i did at the start of my journal i’d probably be a damn master at it by now.\n\nI love ADHD for my creativity, i mean i wouldn’t have had this many ideas if i didn’t have it but holy shit do i hate it when i actually look back at all the hobby’s and business ideas i’ve tried then just given up on for no apparent reason then just forgetting about it or not having any interest in it anymore.",
        "created_utc": 1678702351,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made it to the gym this morning!",
        "author": "Dalton_1980",
        "url": "https://www.reddit.com/r/ADHD/comments/11q5m3p/i_made_it_to_the_gym_this_morning/",
        "text": "Context: During lockdown I started to try and look after myself better. I had been Inconsistently going to the gym in 2022 but in October had to take a break for a hernia operation. December till now I have been walking a lot. Its like an intrusive need to do this, but not gym. In January I was determined to change that and get back into a programme. I've been 3 times in 3 months but I got there!",
        "created_utc": 1678701846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possible ADHD at uni",
        "author": "Significant_Falcon28",
        "url": "https://www.reddit.com/r/ADHD/comments/11q5lpb/possible_adhd_at_uni/",
        "text": "Hi everyone i came on here to share my story with mental health, specifically symptoms of ADHD. I don't wanna refer to my problems as ADHD bc I don't have a diagnosis so I'm just gonna call them issues. The first time I notices these issues was in middle school. I was 12 and I told my mom about it. She brushed it off without doing anything because I had good grades. I was pretty smart so I did have good grades without studying all through middle and high school. But trying to study was a nightmare. I found myself reading the same sentence over and over again, not having a clue about what i just read. I felt like there was something wrong with me, as if i was somehow different from my friends. I became depressed at 15. Didn't get help till i was 18. Doctors just told me i cant focus because od depression. I kept going to the doctor and a psychologist. At 20 i was diagnosed with bipolar disorder and i also started my first year of uni. I found myself unable to study and enjoy clasess even though i really love my degree. But I just have to sit still and concentrate on what the proffesor is saying and i just cant do that. Realizing that these issues are really affecting my life made me try to get tested for ADHD but my doctor keeps saying its depression or stress. I really like my doctor and he helped me so much in the past, but he doesn't seem to understand me right now. I feel the same as i did when i was 12, different from people around me. Telling people how i feel and them brushing it off. I am really close to failing uni and that hurts me so much because i really try so so hard but i just cant.",
        "created_utc": 1678701804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I please get advice for help with ADHD housemate? I am desperate...",
        "author": "arachnid_dancer",
        "url": "https://www.reddit.com/r/ADHD/comments/11q5gow/can_i_please_get_advice_for_help_with_adhd/",
        "text": "I live with a guy who has ADHD and is making my life awful.\n\nI want to clarify before I go on, I really do understand that ADHD makes life difficult and I have tried for months now (7 months into a locked 12 month tenancy) to be kind and patient and understanding. I have tried helping him to do tasks by encouraging and helping, I leave notes on things as I know object permenance is hard for people with ADHD, etc... but I really can't deal with it anymore and I feel like I need to resort to drastic measures\n\nExamples of his difficult behaviour:\n\n* Using up all the pots and pans in our house and hoarding them in his room\n* Not washing up his recyclables and throwing them in the clean recycling bin until they go mouldy and I have to deal with it (also never taking any bins out (or doing any shared chores...))\n* **Leaving shits in the toilet in the middle of the night because he doesn't flush then they've gone hard and I have to plunge it away in the morning** \n* Pissing all over the toilet seat which I then have to wipe clean before I use it (I'm a girl)\n* Leaving all the lights on, and leaving the oven on all night, racking up our electricity bill\n* Forgetting what food is his and eating my food and never replacing it \n* Slamming doors, blasting music in the middle of the night *literally outside my bedroom door because he will get distracted by his phone at the top of the stairs where my room is*\n\n**But the biggest issue is how loud he games all night, every night**. We both are enrolled at the same university but he never (and I mean literally never) attends. This is not my issue I understand - he can do whatever he wants with his own life - but I have 9ams on a Mon, Wed, and Fri, and I have a 9-5 job on Tue and Thu. I really need to be sleeping on a night and he is so loud that I can hear him through the endless supply of earplugs I have to buy myself. It is making me miserable and I am right at the end of my undergrauate degree which I want to do well at and he is severely affecting my ability to do this and also damaging my mental health through my lack of sleep  \n\n(I used to be an alcoholic and substance abuser who suffers with bipolar 1 and I am managing to deal with this through serious personal work and therapy and I am beginning to relapse due to tiredness induced stress (I know this is my own issue and not his and I am not using this against him I just want to explain how much this is getting to me and making me feel shameful about my relapsing))\n\nMy only option that I can see is to **take away the internet box on a night so he can't game loudly**. I would of course leave it if he is respectful, but I cant deal with it all. The lack of sleep is one thing, but combined with everything else which makes living day to day harder I dont know what to do. \n\nDoes this make me an asshole? Can anyone give me any advice that may work so I don't have to take this from him until he starts being a respectful housemate? I really don't ask for a lot - I don't even care if he doesn't wash up his plates etc just as long as he doesn't lock them in his room so I have to resort to eating off of packaging",
        "created_utc": 1678701320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice: Was my mania caused by too high of a dosage, or other substances?",
        "author": "daddyoverdomm",
        "url": "https://www.reddit.com/r/ADHD/comments/11q5cet/advice_was_my_mania_caused_by_too_high_of_a/",
        "text": "[removed]",
        "created_utc": 1678700879,
        "upvote_ratio": 1.0
    },
    {
        "title": "RSD (Rejection Sensitive dysphoria), is it common with ADHD?",
        "author": "OokySpookums",
        "url": "https://www.reddit.com/r/ADHD/comments/11q4uji/rsd_rejection_sensitive_dysphoria_is_it_common/",
        "text": "I definitely find myself experience the effects of it, even over menial things like the way someone talks to me or even looks at me and I totally misread what they're trying to say or do... but I have to wonder if it's more of a developmental thing from just having ADHD and constantly being treated like we're scatterbrain headcases (we're not obviously.)",
        "created_utc": 1678699052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are transitions so hard? What can I do to get better at transitioning?",
        "author": "LadderWonderful2450",
        "url": "https://www.reddit.com/r/ADHD/comments/11q4s3v/why_are_transitions_so_hard_what_can_i_do_to_get/",
        "text": "Why are transitions so hard? What can I do to get better at transitioning? I have heard that trouble with transitioning from one thing to another is a symptom of ADHD. Why is that? I’ve noticed that I struggle a lot with transitions. Like it’s hard to get out of bed, then it’s hard to finish breakfast, it’s hard to stop working, and then it’s hard to go to bed, and so on...it’s not so much that doing the thing is hard, it’s doing the next thing that’s hard. Does anyone have any tips or advice for this? What do you do to be able to transition smoothly?",
        "created_utc": 1678698809,
        "upvote_ratio": 1.0
    },
    {
        "title": "overthinking is ruining me",
        "author": "BugggyBrain",
        "url": "https://www.reddit.com/r/ADHD/comments/11q4nli/overthinking_is_ruining_me/",
        "text": "I just overthink everything, my brain can't rest a bit. It's just too much and can't focus on anything. It is ruining my life!! \n\nI try to kick out all these thoughts from my head, but i just tend to overthink whatever happens in my life, and oh my god i generate all possible scenarios for any situation i get into. What 's wrong with me??\n\nWhat to do about it? No meds, anything but meds.",
        "created_utc": 1678698340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laughing too much",
        "author": "animefanatic10",
        "url": "https://www.reddit.com/r/ADHD/comments/11q4kmp/laughing_too_much/",
        "text": "I was wondering if uncontrollable laughter is normal because my psychologist says it is but it's impacting my daily life and doesn't feel that normal. At first, it would just be something a little funny that would trigger me not being able to talk because I would start basically scream laughing but I would just get a couple of weird looks and it would eventually pass in a few minutes.\n\nIt's gotten to the point where my brain is confusing every emotion with funny and I can barely go through a single interaction without laughing uncontrollably with tears streaming down my face for 15 minutes straight. I'll be honest, none of it is really even that funny but for some reason, I cannot stop thinking that everything that is happening is the silliest thing that has ever happened. The people I know have gotten used to it but it's kind of embarrassing when I need to walk out of the room or leave a gathering because I can't keep it together. I'll be quivering and holding my mouth shut in the corner at any social event because I thought of the word \"chingus\" if you need to find me. \n\nAnyway, let me know if this is me overthinking or if I need to get something checked out.",
        "created_utc": 1678698060,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and a policing career",
        "author": "Isabellette",
        "url": "https://www.reddit.com/r/ADHD/comments/11q4juc/adhd_and_a_policing_career/",
        "text": "Hi! I’m looking for some advice/support. I’m based in Australia. It has always been my dream to join the police since I was little. I’m now 30 and time is running out. I was diagnosed with ADHD around 7 years ago. I went and sought advice. Like many women, I believe I went undiagnosed my entire life. \n\nI was fine off medication, but decide to try it and it changed my life. All of a sudden, I was at the top of my class at university and being offered scholarships. I only mention this because I struggled so much at school. I always thought I wasn’t smart, and this diagnosis was so validating. I’m sure many of you can relate to this feeling! \n\nNow, I have finished with study. I finally want to join the police force. I’m currently in the middle of the application process, and medical hasn’t come up yet. I’m so worried it will knock me out of contention. Can anyone offer any support or advice? Anything would be really helpful right now :(",
        "created_utc": 1678697994,
        "upvote_ratio": 1.0
    },
    {
        "title": "People with ADHD are overrepresented in software/development, essentially double what you’d expect based on % of adults with ADHD in the general population. Any ideas why this could be?",
        "author": "meeatmud",
        "url": "https://www.reddit.com/r/ADHD/comments/11q48g8/people_with_adhd_are_overrepresented_in/",
        "text": "[removed]",
        "created_utc": 1678696760,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel so dumb and lost - struggling with driving",
        "author": "trenarubz",
        "url": "https://www.reddit.com/r/ADHD/comments/11q44zf/i_feel_so_dumb_and_lost_struggling_with_driving/",
        "text": "I have no real life skills and I dropped out of school. \nI’m currently taking my driving lessons and it’s been a nightmare not to mention my instructor is a little racist but other driving instructors gave up on me and simply gave me money back cause they couldn’t “handle me”. \nAt times when i’m driving i’ll simple zone out or my instructor will tell me to go left and I’ll just go right or straight ahead or do the complete opposite. \nIt’s really hard to focus. \nI stared out doing manual - stick shift (I’m based in the UK) \nThen I changed to automatic as stick was too hard wasn’t progressing and I plan on moving to the states anyways. \nI have my test in a few months i’m struggling with concentration and roundabouts it doesn’t help when my instructor mocks me by asking - “can you count up to 3” “you are the most difficult student i’d had to teach” “ADHD is not really that deep” “Well your medication clearly isn’t working” “You don’t want to drive you aren’t even trying” \nDoes anyone struggle with driving or struggled with their driving ?????",
        "created_utc": 1678696382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this normal for ADHD testing?",
        "author": "Kiram_OW",
        "url": "https://www.reddit.com/r/ADHD/comments/11q41ys/is_this_normal_for_adhd_testing/",
        "text": "I’ve recently been going to a couple sessions for diagnosing ADHD, and am a little bit skeptical about how trustworthy the tests I’m doing are. I’m not trying to force out a diagnoses or anything, if I don’t have it then I don’t have it. The process so far has just felt kind of weird. Is this normal?\n\nIg I’ll put bullet points here and expand on it as I need to in the comments:\n\n- The doctor I’m with is quite anti-medication, and has said multiple times how she only wants to prescribe it under really extreme circumstances.\n\n- A lot of her advice for my struggles has been stuff like “eat more greens”, “use concentration oils and scents”, “cut out dairy from your diet if you’re lactose intolerant”, “go outside more”. Which I guess can help?? But I doubt that’s the ultimate answer to everything; especially since I already do a lot of those things.\n\n- Her tests didn’t really seem to be too indicative of anything. It was just a lot of solving puzzles and memory games/tests.\n\n- Her being in the room and constantly giving me quiz results created a certain pressure that forced me to focus?? I lost concentration and lost my train of thought quite often, but the pressure she created made me get back on track quickly. I’m afraid that the fact that I didn’t focus super consistently may not be picked up on well.\n\n- The tests were pretty much only about how much/how long I can focus. Nothing else. (While I do struggle with focus, it’s just one factor out of many for why im wanting to get tested).\n\n- The questionnaire had some weird-ish questions like “do you throw tantrums”. (Which I guess I do get overwhelmed pretty easily, but it’s more sensory overload than having tantrums. So for questions like that I put a lower number because I suppose it wasn’t super accurate to my experiences.)\n\nCan anyone share their own experiences if they’re comfortable? I just want to be sure that this is standard.",
        "created_utc": 1678696058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting diagnosed with adhd at the age of 23, any advice?",
        "author": "Murky_Quiet",
        "url": "https://www.reddit.com/r/ADHD/comments/11q3wr8/getting_diagnosed_with_adhd_at_the_age_of_23_any/",
        "text": "[removed]",
        "created_utc": 1678695498,
        "upvote_ratio": 1.0
    }
]