[
    {
        "title": "adhd and homework",
        "author": "FishDishFish-",
        "url": "https://www.reddit.com/r/ADHD/comments/11kjdrq/adhd_and_homework/",
        "text": "i’m in highschool and i currently have a severely low grade in my math class and language class. i know i have the ability to figure out how to do the work but i just can’t it’s like my brain won’t let me and it’s frustrating. the only way i can do work is if i do multiple assignments after another and hyperfocus but i cant do anything right now, any suggestions?",
        "created_utc": 1678148712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating about paying 500 for a highly reputable psychiatrist",
        "author": "catalanj2396",
        "url": "https://www.reddit.com/r/ADHD/comments/11kjd37/debating_about_paying_500_for_a_highly_reputable/",
        "text": "Iv used medication in the past but it’s usually been through a nurse practitioner or general doc and I never stayed on it because of issues like sleep etc. I’m just done with life right now and think I need medication again. \n\nDo you guys think it’s worth it? I want to find something that finally works for my adhd and anxiety.",
        "created_utc": 1678148665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can people with adhd take care of a pet?",
        "author": "Charmingmoca",
        "url": "https://www.reddit.com/r/ADHD/comments/11kjc8d/can_people_with_adhd_take_care_of_a_pet/",
        "text": "[removed]",
        "created_utc": 1678148608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Adderall XR Twice a Day",
        "author": "Illustrious-Self1246",
        "url": "https://www.reddit.com/r/ADHD/comments/11kjabj/question_about_adderall_xr_twice_a_day/",
        "text": "I have been taking two 10mg XR together in the morning and find that it typically wears off in the evening when I still have quite a bit of work to do. I was wondering if it is safe to take another 10mg around the time it wears off (6pm) to top off and get through the rest of my day. Are there any adverse affects/ will this keep me from sleeping? When should I space out the doses?",
        "created_utc": 1678148482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else noticed their sensory issues have gotten worse? How do you deal with it?",
        "author": "tajimma",
        "url": "https://www.reddit.com/r/ADHD/comments/11kj9ql/has_anyone_else_noticed_their_sensory_issues_have/",
        "text": "[removed]",
        "created_utc": 1678148444,
        "upvote_ratio": 1.0
    },
    {
        "title": "i feel like i’m unable to do anything regardless of how much i enjoy it",
        "author": "tragicluciddream",
        "url": "https://www.reddit.com/r/ADHD/comments/11kj6hp/i_feel_like_im_unable_to_do_anything_regardless/",
        "text": "[removed]",
        "created_utc": 1678148233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Careers where time management and short term memory issues aren't a dealbreaker?",
        "author": "StaticNocturne",
        "url": "https://www.reddit.com/r/ADHD/comments/11kj3y3/careers_where_time_management_and_short_term/",
        "text": "I know this question has been asked as nauseam but every now and then (I.e today) I find myself feeling like a hopeless case who will never be able to hold down a job let alone progress in a career and I need reminding that there are some jobs where having quite severe ADHD isn’t a death sentence. \n\nObviously we should all try manage our conditions without resigning to self pity and acceptance but the fact we're swimming against the current and in some jobs that current is far stronger than with others, and I think there are some out there which are more compatible with my naturally poor time management, lack of sustained focus and short term memory issues - maybe project based jobs where I can focus all my attention onto something without as many distractions? I tend to hate jobs that have thousands of small tasks because even when I do manage to get focused I then have to switch gears all the time, but in saying that, I do like the satisfaction of being able to complete tasks - even small ones and that can provide propulsion to keep moving. \n\nHaving a genuine interest helps too of course but I’m curious to hear which jobs or careers you’ve found that have worked well enough?\n\nOr do you not believe in orienting your career around this disorder? I'm happy to discuss that perspective as well",
        "created_utc": 1678148067,
        "upvote_ratio": 1.0
    },
    {
        "title": "The black market is surging and the DEA is responsible",
        "author": "nhomewarrior",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiywe/the_black_market_is_surging_and_the_dea_is/",
        "text": "[removed]",
        "created_utc": 1678147741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went on Adzenys cuz of the shortage and it’s improved my life",
        "author": "Stunning_Ship5313",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiyp8/went_on_adzenys_cuz_of_the_shortage_and_its/",
        "text": "Just wanted to say that I got on Adzenys after 5 years on Adderall IRs and love it. I’m in law school and was looking for a longer-acting med that wasn’t affected my the shortage. I now take 9.5mg Adzenys in the morning and 10mg in the afternoon. Filling 30 20mg is a lot easier than 60 20mg (my psych gives me enough to have extras since I don’t have insurance during the summer/the shortage). Also my side effects are lessened-I’m sleeping better, have less “come down” anxiety, and food doesn’t disgust me on adzenys like it did on adderall. Adzenys is almost the same as XRs but they changed the way it activates I believe. Also Adzenys are $35/month if you use the coupon regardless of insurance (info on website or ask provider) which is less than my adderall script.\n\nNot posting to endorse/hype up big pharma but just want to put this out here since I never hear adzenys talked about.",
        "created_utc": 1678147728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to understand myself better",
        "author": "sensible__",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiug1/trying_to_understand_myself_better/",
        "text": "I know that there are many different experiences of ADHD, and I’m not sure if I belong in that group. But it can very often feel like there’s a boulder in my brain that I’m constantly working around just to get work done. There’s an emotional component to it, but sometimes I’m calm and the boulder is just there, blocking my thoughts from flowing or from getting up and doing what I’ve set out to do. Does this experience align with anyone else’s?",
        "created_utc": 1678147456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anything valid",
        "author": "macbookaiirusr",
        "url": "https://www.reddit.com/r/ADHD/comments/11kisuc/anything_valid/",
        "text": " Hundreds of millions of people  asked me what he will do when he doesn't have a parent hopefully but the problem isn’t always that I forget,  shadow of themselves,  this with a follow up at home study my brain just wanders to do the dishes   book. Instead,  vacuum the house later unaware that they have a treatable condition.  the problem is the vacuuming is your dark side and comprehend what the person said.",
        "created_utc": 1678147356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't handle failure, or even the thought of it really.",
        "author": "LindellWiggintonFan",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiry2/cant_handle_failure_or_even_the_thought_of_it/",
        "text": "Hi All,\n\nI'm typing this out because I'm hoping that you may have strategies for overcoming this, but I'd honestly just like some support in this. \n\nToday I was sitting in my Intro to Sculpture class, and I sat there for around two hours desperately trying to figure out what I was going to sculpt. I sat and scribbled abstract shapes and real objects, trying to find something that I could actually sculpt, and all that I felt for the entirety of the class was a crushing sense of anxiety and overwhelming brain fog. I've felt terrible ever since, but it doesn't feel like there is anything that I can do.\n\nI'm a creative person. I just can't ever access it. It's like I'm afraid of being creative and I hate it. It's one of my gifts, but I can't access it because I'm too anxious to get through the walls of my brain and actually put an idea on paper. \n\nI just feel like I'm perpetually unable to struggle, and I will fall into a very intense, very dark place over pretty much nothing. I know strong emotions are an Adhd thing, but I'm getting incredibly sick of dealing with it man. I just want to be able to handle things like a normal person. I don't want to be miserable for the rest of my life and I can't help but feel like I'm forever doomed to have something wrong with me. Right now it's the fact that I can't handle failure. It used to be that I couldn't get started on anything, and god fucking knows what's next. I just want to be normal. I really, really do.   \n\nI'm too tired to really articulate how things are right now, but I just feel like a disaster waiting to happen no matter what I do, and it causes me to fail, which then makes me feel like even more of a mistake. I'm successful in pretty much everything I do, but I can't actually enjoy it because as much as I say it, I can't make myself believe it.",
        "created_utc": 1678147303,
        "upvote_ratio": 1.0
    },
    {
        "title": "a year and a half of a doctor and a therapist, changes and phases. they still want me to take meds that have already done its job.",
        "author": "Sexthedude",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiry5/a_year_and_a_half_of_a_doctor_and_a_therapist/",
        "text": "im 16 years old \nadd\ngeneralized anxiety\n\nand been put up on therapy and have a psychiatrist, cause my immigrant mom cant rely on her self to help me so she turns to professionals\n\nalmost 2 years\n\nive been put on prozac for a year and theyve been discussing about putting me on adderall for that continuous year\n\nive never understood 100% why i took prozac so i always avoided it. recently this year ive went into a anxious hell that lasted 2 months that was drug induced. i looked into my prozac meds for the first time. weeks and weeks ive been improving and now im at the state where i feel like im i can manage again, no more anxiety and depressing thoughts. so i took it upon my self to get off them.\n\nthey still order me to take them even tho they helped me improve for the lowest point of my life that im now 100% out of.\nmy mom takes note of what they say cause she has no grip on any psychology, it makes me feel so stuck, i tell her alot that i think im done with the council treatment but she just cant wrap her head around it.\n\nidk what to do. i wanna talk to psychiatrist doctor but i have no free-say in what i should or should not take!!!",
        "created_utc": 1678147303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kinda want kids one day but not sure I’m cut out for it.. would appreciate advice from adhd parents!",
        "author": "T1nyJazzHands",
        "url": "https://www.reddit.com/r/ADHD/comments/11kir3d/kinda_want_kids_one_day_but_not_sure_im_cut_out/",
        "text": "\nI (24f) love kids. I think would like to be a mother one day but I have concerns about my capacity to parent.\n\nMy brand of adhd is easily overstimulated. For a start, overstimulation and pregnancy seems like a recipe for disaster. Though I am good at entertaining kids, my stamina is limited. I burn out very quickly (learned this after a year of being a live-in nanny to two beautiful hyper young girls and being the eldest of four kids) and have little energy left for looking after myself, nor other practical household tasks. \n\nThe burnout also makes it really hard to discipline properly - I’m just too fucking tired. The kids saw me more as an older sister than as a carer with authority. Though the love was mutual, the lack of power I had scared me as I wasn’t sure I could control them in dangerous situations or get them to take me seriously. One time the youngest kid ran across the road during a tantrum and it scared me so much that I could no longer take them on walks to the park in good conscience. \n\nThis experience gave me major flashback to my own upbringing as I realised these kids looked at me very similarly to the way I looked at my own mother in terms of authority growing up. I could tell me mother tried extremely hard but for whatever reason her words never carried much weight, even when she spoke them with all her might. Overall I think I very much take after my mother in general (both parents have adhd, mum also has OCD). Though I know she loves me dearly and I’m close with both my folks, I can’t deny the toll it took on her mental health as a firsthand observer, validated by my own parenthood lite ™ experiences later in life.\n\nMy dad was much better with kids but unfortunately as the breadwinner to a family of six he just wasn’t around much so in terms of modelling how to parent I think I retained very little of his tactics.\n\nAll considering I’m just not sure I’m cut out for raising kids 😅 I want to be an attentive, loving, patient yet firm parent and that all requires a heck of a lot of energy. Energy I’m not sure I have, and even if I do manage to muster up the strength I worry the cost will be my own sanity.",
        "created_utc": 1678147255,
        "upvote_ratio": 1.0
    },
    {
        "title": "My college will cut my Financial Aid if I don't prove I have ADHD within ten days. I don't know what to do...",
        "author": "VicAndHisThoughts",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiqx0/my_college_will_cut_my_financial_aid_if_i_dont/",
        "text": "At the moment, I don't have a proper ADHD diagnosis, it's something I've been trying to work on more especially recently that I know much more about it, how it affects people, and how it's probably affecting me. \n\nSo, some background first, I now know I've had some issues with ADHD from high school, at least. I can remember being late everywhere, not showing up to class, not turning in assignments and being insanely distracted during lessons or lectures. Especially If I didn't particularly care for the subject. I'd have to use every ounce of strength to concentrate and even then it was exhausting, I would need breaks. It was worse for things like homework and things that needed self initiative. I always knew I was somewhat smart, I could think deeply and critically but somehow I could never get things done, the inside of my head was too loud and easily distracted. And that would begin this cycle of not doing things, then guilt, then self hate for being like this, over and over and over. I barely graduated high school. Just barely. \n\nSo as you can see, that does not bode well for college. I did in-person college in my hometown of LA for about 2 and a half years until I got kicked out. Terrible procrastination, not showing up to class, that did it. I got kicked out after I appealed already to promise to do better. Do you know how insane that is, I appealed once already and I STILL managed to fumble. I still procrastinated,  I just couldn't keep up with the demand. It also affected my work, I got fired from a job and switched to another office, (its a big insurance agency), then I also got fired from that office. I'm ok at my current job, my boss seems to understand me, but I have come close before to losing that as well. Not to even mention all the financial debt from credit cards, loans, payments, other stuff I don't need. \n\nThat brings us to today, I stupidly joined online college to earn a degree. Most of all I am trying to make my parents proud who said I betrayed them after dropping out of college. I've tried time and time again to explain that it's not me, it's something inside me, something I can't control. Hell when I would skip class or be late, I would beat myself up over it, I was hard on myself too. I wasn't out partying or doing drugs, I was battling myself. Recently, I've been doing terrible in my courses and was put on academic probation, I managed to mess that up as well ( surprising isn't it) and I submitted an appeal the other day explaining that I had undiagnosed ADHD and I've been struggling for a while. I couldn't even explain myself properly because the space they give you to submit your appeal only allows for a few sentences. \n\nThey replied to my appeal today saying it was denied and if I can't provide medical documentation within TEN DAYS saying I had ADHD and was unable to properly attend college online. I know it's been a long time since the symptoms and to not have a diagnosis is insane. I don't know what to do, once I asked my regular doctor if he could refer me for some mental help and he said he couldn't do anything, that I'd have to talk to my health insurance. My insurance said I had to be referred by my general doctor, and then my doctor dropped my healthcare leaving me doctor-less until I find one that accepts my insurance and that I like. I'm sure that wont be resolved in 10 days so now I'm here, feeling like a total failure once more. I do not know what to do, how to move on. I can't disappoint everyone once more and I sure as hell cant pay for college without the financial help. \n\nThis post is WAY too long so I need to wrap this up. Any advice at all helps, especially if you've been through something like this. I feel so incredibly low. Thanks so much.",
        "created_utc": 1678147246,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to tell a long story shorter?",
        "author": "GamerGurl3980",
        "url": "https://www.reddit.com/r/ADHD/comments/11kiomb/how_to_tell_a_long_story_shorter/",
        "text": "[removed]",
        "created_utc": 1678147105,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I start a habit if I’m going to hate it for the first few times I do it?",
        "author": "nobody-throwaway1",
        "url": "https://www.reddit.com/r/ADHD/comments/11kijt1/how_do_i_start_a_habit_if_im_going_to_hate_it_for/",
        "text": "Hello. I am transgender, and I’m wanting to start training my voice to change how it sounds, which is a process that requires consistent practice and experimentation. Obviously, attempting to do a female voice will be embarrassing at first. I’ve found that I tend to really quickly drop things when they don’t go my way. How do I maintain my motivation and cement it in my life as a habit?",
        "created_utc": 1678146792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adhd diagnosis questions",
        "author": "Comprehensive-Rip541",
        "url": "https://www.reddit.com/r/ADHD/comments/11kigwb/adhd_diagnosis_questions/",
        "text": "So I, (31m), recently decided to admit to the fact that ADHD is a factor in my life. Throughout my teens and early adulthood until now I’ve largely been medication uncompliant. When I approached my PCP he said he had no issues with managing symptoms but needed some kind of records proving proof of my diagnosis for legal reasons due to the medication used. He also said I could get an evaluation and provide those results. I submitted for records and also scheduled an evaluation and the doctor stated before we started that he thinks adhd is overused and was very verbal about his biases against it stating that he thinks it’s just me putting my interests above others and my obligations. He basically had his mind made up before we even started. I disagreed and went through the process and he did not rule in favor of adhd as expected but instead wanted me to keep coming back to test for all sorts of things. \n\nI recently got my records back from my childhood at age 15 for my recorded diagnosis and hit another wall. In the notes 2 separate doctors recorded issuing medication and specifically stated “for ADHD”. Also one of the doctors noted ADD symptoms during the interview. Seems like that’s all I need right? Well it’s not listed on my diagnosis sheet as a diagnosis even though I remember the diagnosis and treatment. \n\nMy question is do you think it’s still sufficient since ADHD is listed in the notes even though for whatever reason they missed placing it in my Axis 1?\n\nAlso would a diagnosis at age 15 still be valid at 31?\n\nThanks ahead of time to my Reddit family!",
        "created_utc": 1678146604,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I start a habit when it’s going to be a negative thing at first?",
        "author": "nobody-throwaway1",
        "url": "https://www.reddit.com/r/ADHD/comments/11kigv1/how_do_i_start_a_habit_when_its_going_to_be_a/",
        "text": "[removed]",
        "created_utc": 1678146602,
        "upvote_ratio": 1.0
    },
    {
        "title": "When people don't understand ADHD paralysis",
        "author": "Key-Patience-3721",
        "url": "https://www.reddit.com/r/ADHD/comments/11kig9w/when_people_dont_understand_adhd_paralysis/",
        "text": "My friends and loved ones try to be supportive but there's only so much they can understand and I know how it looks to them, I'm young and able bodied, why can't I just do my laundry or wash my dishes or even get out of bed. Now my boyfriends getting frustrated because he's trying to be supportive but he doesn't get why i'm not doing certain things even though I want to and they would improve my quality of life. I get his frustration, he tries to suggest solutions but nothing works and my negativity around it all is starting to affect him. My whole life I've struggled with low self esteem and viewing myself as lazy and it just hurts knowing other people view me that way too.",
        "created_utc": 1678146564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did medication help you?",
        "author": "vakna1337",
        "url": "https://www.reddit.com/r/ADHD/comments/11ki7di/did_medication_help_you/",
        "text": "I hate my job and I want to get an education so I can get a better job. The thing is I need to finish 2 high school math courses,idk if high school is right word but about the eqiuvalent here in Sweden,  to get into the program I want to go to. I'm 27 now and I am starting to get desperate. I've read these  courses before and always failed, not because I'm stupid but beause I always seem to fuck off and just ignore them after a while. This is why I'm thinking about trying out medication to help me finish these two courses. Anyone else been in a similar situation and did medication help you?",
        "created_utc": 1678145991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take your meds, do a guided meditation, and then get a massage. Everything is so quiet.",
        "author": "Ark_00",
        "url": "https://www.reddit.com/r/ADHD/comments/11ki3zg/take_your_meds_do_a_guided_meditation_and_then/",
        "text": "[removed]",
        "created_utc": 1678145771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychiatrists that don’t drug test",
        "author": "yungnfeenin",
        "url": "https://www.reddit.com/r/ADHD/comments/11ki2zh/psychiatrists_that_dont_drug_test/",
        "text": "[removed]",
        "created_utc": 1678145709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend has Self-diagnosed and is building a brand off ADHD",
        "author": "citrusnotvanilla",
        "url": "https://www.reddit.com/r/ADHD/comments/11khzge/friend_has_selfdiagnosed_and_is_building_a_brand/",
        "text": "[removed]",
        "created_utc": 1678145486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice for medication routine",
        "author": "Impossible-Ad-2765",
        "url": "https://www.reddit.com/r/ADHD/comments/11khupd/seeking_advice_for_medication_routine/",
        "text": "I (19m) have been recently diagnosed. I’ve been on short-release medication (dexamfetamine is the Australian name) for about two weeks. I have found it really helpful for focusing, and also found it significantly decreases my base anxiety levels and decreases the random frustration I sometimes feel towards people I’m close with. Also, it can be really helpful in getting me out of bed - I used to use caffeine quite often to do this but obviously I am not mixing the two so am currently completely off caffeine.\n\nThe thing is, I understand a benefit of short-release medication is ‘as needed’. Due to the positive effects it has on even minor things in my life, I’m not sure if I should only be taking it before work/university or before periods of necessary concentration, or if I should also take it more consistently. \n\nJust was wondering what routines or habits people with similar medications have developed? Or if there’s any specific medical advice about tolerance that I’m not aware of?",
        "created_utc": 1678145195,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I'm not suited to real life",
        "author": "Hairy-Bad4438",
        "url": "https://www.reddit.com/r/ADHD/comments/11khu11/i_feel_like_im_not_suited_to_real_life/",
        "text": "[removed]",
        "created_utc": 1678145154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has a smart watch to stay organized? I need recommendations!",
        "author": "jedify",
        "url": "https://www.reddit.com/r/ADHD/comments/11khnrk/who_has_a_smart_watch_to_stay_organized_i_need/",
        "text": "Basically, I'm considering a smart watch to stay organized with work/home/project to-do/shopping lists. Here's how I see it going - whenever I realize I need to remember something, basically dictate into the watch. I would need to be able to quickly call up the right list, and probably have the option to also add priority and time limits.\n\nI've never had a smart watch so idk if they'd all more or less do this. But I'm facing decision paralysis. Help! I have android btw. Thanks!",
        "created_utc": 1678144762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switched ADHD meds and can’t stay awake?",
        "author": "emilypad",
        "url": "https://www.reddit.com/r/ADHD/comments/11khngp/switched_adhd_meds_and_cant_stay_awake/",
        "text": "Hi everyone. I was on Adderall XR 15 mg for my ADHD for a little over a year, and I felt like it wasn’t working anymore and making my ADHD worse. My psychiatrist said I built a tolerance to it so he suggested I switch. I’m now taking Intuniv 1 mg (guanfacine ER) and I feel extremely tired. Not just a little tired but extreme exhaustion to the point where I can’t get out of bed I’m that tired. And when I do, I’m dizzy. I can focus but i feel robotic and am too tired to get anything done. I have little interest in any hobbies when I take the Intuniv, but when I don’t take it I have interest in hobbies again. Overall I feel lazy and am pretty much sleeping 24/7, it doesn’t matter the amount of caffeine I consume, I just can’t stay awake. What’s happening? Is this usual? Should I bring this up to my psychiatrist or is this going to pass? Thanks.",
        "created_utc": 1678144742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sun pharma",
        "author": "cs852",
        "url": "https://www.reddit.com/r/ADHD/comments/11khgxd/sun_pharma/",
        "text": "[removed]",
        "created_utc": 1678144338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switched from Adderall XR 15 mg to Intuniv &amp; can’t stay awake",
        "author": "emilypad",
        "url": "https://www.reddit.com/r/ADHD/comments/11khgpx/switched_from_adderall_xr_15_mg_to_intuniv_cant/",
        "text": "[removed]",
        "created_utc": 1678144324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has a smart watch to stay organized? Need recommendations!",
        "author": "jedify",
        "url": "https://www.reddit.com/r/ADHD/comments/11khg53/who_has_a_smart_watch_to_stay_organized_need/",
        "text": "[removed]",
        "created_utc": 1678144289,
        "upvote_ratio": 1.0
    },
    {
        "title": "update, getting help for my stress, and trying to reverse my mental shutdown currently.",
        "author": "Ill-Candy-4926",
        "url": "https://www.reddit.com/r/ADHD/comments/11kh93l/update_getting_help_for_my_stress_and_trying_to/",
        "text": "hi everyone,   quick update here,    im getting help from my stress of figuring myself out.    also another update,   even tho i was told to \"stop talking about my physical self love and keep it to myself by my dad,  i know he hates seeing me upset and means well,  but even though that hurt,  I'm gonna see my therapist, and get me a psychiatrist,  and hopefully get me some help before i mentally break even further from the stress of trying to figure out my life.  \n\n&amp;#x200B;\n\nim currently trying to reverse my mental shutdown,   and remind myself that everything is ok...  \n\n&amp;#x200B;\n\ni really really wanna find both inside and form a deep emotional experience with myself.",
        "created_utc": 1678143853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else can't keep their bedroom clean/neat, and always loses things?",
        "author": "SadCoconut_",
        "url": "https://www.reddit.com/r/ADHD/comments/11kh5dm/who_else_cant_keep_their_bedroom_cleanneat_and/",
        "text": "[removed]",
        "created_utc": 1678143627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Embrace your ADHD",
        "author": "Relevant_Plate_8797",
        "url": "https://www.reddit.com/r/ADHD/comments/11kh3n8/embrace_your_adhd/",
        "text": "I know that a lot of people in here get upset about the day-to-day struggles they have with ADHD. Believe me, I am one of them, and I have been diagnosed and battled ADHD, since I was eight. 20 some years later, and I have learned that once you fix one thing about ADHD, something else will take its place and while we should pay some attention to the things that you struggle with while having ADHD, it is just as important to embrace the things that make you different with The disorder. \n  I encourage everyone who struggles with ADHD to see a professional and get medication or find something that helps you battle the disorder. When you do that, you will learn that there are many strengths that come with ADHD. The people I have met with ADHD are some of the most creative and quick people I have ever met.\n\n  When you truly learn how to harness powers that come with ADHD, you will realize that you are an amazing human being every morning you get up and fight a battle that’s different from everybody else’s on planet earth. But that battle while tiring, also makes you strong as hell. Your brain works in ways that some people can only imagine and just because sometimes it’s hard or it’s different from other people does not make it useless or any lesser than anybody else’s mind. The biggest step with ADHD is being proud of who you are and not caring about what so many other people think I encourage you to stop trying to win over people who have a problem with your ADHD and let them come or go in your life as they may need. Set boundaries for yourself and get away from people who will do everything in their power not to understand what living with ADHD is like for you on a daily basis. Support yourself by putting people around you who actually love and care about you every night when you go to sleep and when you think about how exhausted you are from how much your mind has worked that day be proud of making it through that day. Be proud for handling it for how many ever years you have And wear that badge proudly. \n\nStop telling yourself that you can’t do things because of your ADHD, and start looking for reasons why you can do things with because of your ADHD. Find a creative outlet and let your ADHD run wild through it let that outlet show who you truly are inside. Do it guilt free, and do it to your fullest. Don’t worry about others. I see a lot of people in here Compare themselves with other people in the world. That’s a very normal thing to do but never feel behind because are on a different path than somebody else. Nobody else would’ve gotten as far as you have gotten with the circumstances that you have been handed. Nobody will ever do it as good as you do.\n\n   some people in here say they feel much more immature and younger than their peers. That is truly a blessing in disguise. I know so many people that feel so old and feel like they are such adults that they go through their day, just going through the motions they have forgotten what it feels like to be young and have a one track mind that leads them to a very dull life. As a person with ADHD I may feel young and slightly immature but it also makes me feel like a kid, it gives me that feeling of thinking the world is a magical place and that there are so many things to do out there that my future, even at 32 excites me.   \nI have learned to like my ADHD. I have learned to like that I’m different do I get upset when I lose track of my belongings or forget important things that I need to do. Yes but the older I get the more I realize that everything is going to be OK and that sometimes the best thing to do is just laugh about the problem rather than beat myself up about it.ADHd gives you obstacles every day in life. But those obstacles are just part of your story, and your story with ADHD can be as beautiful as anyone else is in this world. Trust me, I believe in all of you, and I hope all of us believe in ourselves. Shine bright with your ADHD, conquer your goals with your ADHD, and live your life to the fullest with your ADHD. The battles you have gone through with your ADHD make you a fucking superhero, and I am proud of all of you that battle it every day. Keep your head up.",
        "created_utc": 1678143526,
        "upvote_ratio": 1.0
    },
    {
        "title": "is screen/social media addiction smth u guys struggle with?",
        "author": "mellow_admirer",
        "url": "https://www.reddit.com/r/ADHD/comments/11kh3eq/is_screensocial_media_addiction_smth_u_guys/",
        "text": "I'm currently exploring a possibility I have adhd and I've hit a split road on whether my problems are because of adhd or because I have a phone addiction (or whether I have adhd and it creates a phone addiction 😭)\n\nIt's been a problem for longer than I've ever known. I'm 18 now and haven't slept with my phone by my side since I was 12 and its pretty embarrassing. I agree that I have bad impulse control but idk if it's cause of adhd.\n\nEven if it isn't, what's everyone's experiences?",
        "created_utc": 1678143510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Returned Library Books From 2017",
        "author": "LornaOk91",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgykb/returned_library_books_from_2017/",
        "text": "I apologised, explained I have ADHD and I’m only back because my daughter has to go with the school. \n\nThe librarian wrote that I had ADHD on the system, charged me nothing and said I didn’t need to worry and I could have extended times and no fees. \n\nI was so happy, I’d been dreading going and I was so anxious that they’d be angry at me.",
        "created_utc": 1678143206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autopay doesn’t help me",
        "author": "Sea_Catch2481",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgy8q/autopay_doesnt_help_me/",
        "text": "[removed]",
        "created_utc": 1678143188,
        "upvote_ratio": 1.0
    },
    {
        "title": "I kinda found out how to get things done",
        "author": "alsklm",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgxy4/i_kinda_found_out_how_to_get_things_done/",
        "text": "So I've been struggling with this since forever, but I'm undiagnosed, because I just couldn't be bothered going to a psychologist and also because I just found out why am I like this. Anyway, I just couldn't focus on anything I had to do and couldn't get anything done, with some quality to it at least. For example, if I had any uni assignments to do, then I would just procrastinate. I used to, like, stare into the void for 30 minutes, then browse research papers on cultural anthropology and communication, then pet my cat for an hour and beat my meat afterwards all instead of doing my work on an average day. \n\nThen, one day, me and my classmate agreed to do an essay together as for a team work. And for the whole project I could focus without having to take a break or distract myself, thanks to working with him. So i decided to ask him if he could learn some stuff for the exam and we were basically memorizing the topic together, which was also very successful. Maybe it's because of the dialogue between the two of us, because we don't interact with anything else than the material and our stream of communication.\n\nHope this tip is useful to someone",
        "created_utc": 1678143168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should dopamine be called the reward chemical? Would it be more accurate to call it the \"Success\" chemical?",
        "author": "__Nobody--",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgxad/should_dopamine_be_called_the_reward_chemical/",
        "text": "I had a very good explanation, but then I forgot it while I was typing the title. I think we've gotten carried away with the ideas of learning through reward and punishment and this has led to bad psychology leaching its way into a bad understanding of the brain. But like I said, I literally have no idea what the crux of my opinion was.",
        "created_utc": 1678143127,
        "upvote_ratio": 1.0
    },
    {
        "title": "melatonin &amp; its effects",
        "author": "fressair",
        "url": "https://www.reddit.com/r/ADHD/comments/11kguvn/melatonin_its_effects/",
        "text": "Hi all,\n\nSome questions for people who take melatonin. I have trouble sleeping and have used melatonin gummies a few times.\n\nEach time I've taken these I feel tired the next day my brain feels slow and I need to nap. \n\n I have tried very small doses also. Does the tiredness you feel the next day dissappear as you become more accustomed to the melatonin? \n\nI am thinking to start trying it again due to ongoing sleep issues which is affecting the quality of how my adhd medication works. \n\n\nThanks for reading 😊",
        "created_utc": 1678142980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Balancing all aspects of life",
        "author": "Bellla334",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgupk/balancing_all_aspects_of_life/",
        "text": "I am at university, and have an intense workload for each of my four units (a combination of weekly readings, lectures, practicals, tutorials, seminars and assessments).\n\nI live in a share-house, and have weekly house-chores to do, as well as my own chores like keeping my bedroom clean, laundry, cooking etc (being an adult has so many steps; genuinely not sure how people do this day-to-day living stuff easily/consistently).\n\nI am the president of a university club, which has thus far had all the commitments of a full-time job, but it is a volunteer role. Have been trying to cut back on this via increased delegation etc. I am passionate about the role but also aware of how much time and energy it takes up. I feel like I would be letting a lot of people down if I stepped down.\n\nI have a few hobbies which I am deeply passionate about but which have completely fallen by the wayside for about 6 months now because of general overwhelm, I don't exercise pretty much at all, need to find/get a new job, and have had hardly any time or energy for social outings. \n\nI feel like I am constantly overwhelmed and scrambling, but am not sure specifically what to change. It just feels like I am the problem. I know it is theoretically possible to do everything I want to do, and sometimes it feels possible for me personally, but lately I have just felt increasingly swamped. \n\nI am also far away from family and other support systems, which I think makes things harder.\n\nI am trying to work towards the life I want, but don't necessarily want to constantly feel overwhelmed and alone (hardly any socialising would be exacerbating this) in the meantime. I am not surely how specifically to manage my energy, time and priorities to make sure I can get done a sufficient amount per day. I frequently feel completely burnt out and depleted of all motivation. Any tips for balancing many aspects of life when I want to achieve many things would be much appreciated, please.",
        "created_utc": 1678142968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse regulated period???",
        "author": "Beautiful-Gap-3110",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgrf1/vyvanse_regulated_period/",
        "text": "[removed]",
        "created_utc": 1678142759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for short-term/working memory problems?",
        "author": "haenxnim",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgr17/any_tips_for_shorttermworking_memory_problems/",
        "text": "21F. I am not diagnosed with ADHD but I am scheduled for testing and was told by the specialist that I probably have it at the initial intake. I’ve always been pretty forgetful, but over the past few years, it has been steadily growing worse and now it’s at its peak. In the past six months, I have forgotten to pay rent and a credit card, lost my credit card and my passport, and have forgotten about several medical appointments (despite getting reminders). This does not include the countless times I’ve lost something in my apartment; I misplace my phone several times a week.\n\nI had a standard blood test done last year and everything was fine. I have mild sleep apnea but have been using a cpap for about a year and a half. I have not had any new traumas; in fact i am the most emotionally healthy I’ve been my whole life after doing a lot of treatment in high school. I have cycled through several medications from when it started, but it was a pretty steady decline. I don’t do any drugs, I drink but only two or three times a month. I lost my keys this morning. Send help.",
        "created_utc": 1678142733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking a partial prescription, early refill?",
        "author": "dingohopper1",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgqup/taking_a_partial_prescription_early_refill/",
        "text": "Sorry if this isn’t a direct ADHD related issue.\n\nI filled a script for a months worth of adderall, but only took 20 tabs because that’s all the pharmacy had on hand. Can I request my provider to provide the next refill earlier than a month’s time, or will this put them in violation of DEA rules, especially if the original script definitively was for a months worth of Addie?",
        "created_utc": 1678142722,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 'Just Don't Think' Strategy",
        "author": "DarkslayerTV",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgog9/the_just_dont_think_strategy/",
        "text": "Hello, very quick **who am I**\n\nMale, 30, diagnosed ADHD, game developer.\n\n**The Scenario:**\n\nBeing a game developer I work on a ton of big projects and often they become devoid of dopamine. As most of us know, no dopamine means ADHD paralysis and mental health issues.\n\n**The Strat:**\n\nBelieve it or not, my strategy of late is to not think. When I'm working on a task, I just say that task in my head over and over. I often even use a dopey voice 'Movin' dah light, movin' da light, movin' da light.' No idea why, but this works for me lately and I wanted to share in case some of you also find it helpful.\n\nI was also curious if anyone else does this?\n\nRemember no dopamine - dopa/means - dopa/me.  \nCodin' da game, codin' da game.",
        "created_utc": 1678142576,
        "upvote_ratio": 1.0
    },
    {
        "title": "is smoking too much releated with the adhd?",
        "author": "NefariousnessOk9636",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgmzd/is_smoking_too_much_releated_with_the_adhd/",
        "text": "Wondering other adhd smokers have the same problem.while i sit at home and doing nothing(like 7/24) always wanna smoke cigarette like every 15 min. I dont even enjoy it tates like shit and i keep smoke.on the other hand when i drink coffe or when i extremly happy i smoke 4-5 cigarette in a row.I dont really know dynamics of adhd very well too lazy to research. can someone answer it if it is releated with the adhd. Thx and sorry for shitty english :)",
        "created_utc": 1678142483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else use the 'just don't think' strat?",
        "author": "DarkslayerTV",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgmq4/anyone_else_use_the_just_dont_think_strat/",
        "text": "[removed]",
        "created_utc": 1678142467,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD in Canada question",
        "author": "Nostalgia2302",
        "url": "https://www.reddit.com/r/ADHD/comments/11kgizo/adhd_in_canada_question/",
        "text": "I (27 M) finally got a family doctor and had my first appointment today. I told him about my childhood ADHD diagnosis in Colombia, how I took Ritalin for 6 years and how I had to stop after immigrating to Canada.\n\nSo I told him after all my struggles and symptoms, and **I told him that two psychiatrists in Colombia had evaluated me**, one in 2017 and one 2 weeks ago in February 2023, with the former recommending neuropsychology testing, and the later saying that she was certain I displayed a high degree of inattentive-type ADHD. My doctor also said that I displayed a lot of symptoms (he was also taking notes and researching on his computer about ADHD)\n\n**He told me that in Canada you don't need to see a psychiatrist or a neuropsychologist to get a diagnosis and he can do it himself.  I told him I wanted an official diagnosis and he gave me a WEISS Symptom Record Form for my dad to fill, and also a signed request so I can look for a neuropsychologist for testing. He said our next appointment would be in roughly 3 months**\n\n&amp;#x200B;\n\n**QUESTION: Should I have requested a prescription from him given my past history, or was it right to ask for an official diagnosis? I feel like seeing a neuropsychologist will take a long time, or will be very expensive.**",
        "created_utc": 1678142238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tomorrow is my first day with medication.",
        "author": "oakpen",
        "url": "https://www.reddit.com/r/ADHD/comments/11kghkn/tomorrow_is_my_first_day_with_medication/",
        "text": " Hi guys I just got my medications and I will start tomorrow. its Methylphenidate 18mg. And I have some questions. I am Male 26 y/o.\n\n&amp;#x200B;\n\n1. Dexamphetamine vs Methylphenidate \n2. Breakfast or fasting, I am bit overweight\n3. Coffee, Nicotin? I am not addicted but curious.\n4. Should i think about anything before taking it. \n5. Can i double the dose if i don't feel any effect",
        "created_utc": 1678142149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall causes me tons of anxiety when I don't eat carbs?",
        "author": "hana60012",
        "url": "https://www.reddit.com/r/ADHD/comments/11kg1cn/adderall_causes_me_tons_of_anxiety_when_i_dont/",
        "text": "[removed]",
        "created_utc": 1678141136,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to apply to colleges with adhd and other “disabilities”",
        "author": "LuckyDucky13579",
        "url": "https://www.reddit.com/r/ADHD/comments/11kftkf/how_to_apply_to_colleges_with_adhd_and_other/",
        "text": "I am in 11th grade and applications start soon and I’m not sure how this works what’s the best way to apply to colleges are research which are the most accommodating and how do I tell the colleges I have adhd?\nSomeone said to use Reddit but didn’t specify how to. Is there someone I can reach out to? I want to go into stem specifically mechanical design and I am not sure if I should include my “disabilities” in my essay or somewhere else?",
        "created_utc": 1678140644,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t trust my friends?",
        "author": "LazyNoNos",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfqyv/i_cant_trust_my_friends/",
        "text": "Hey guys. I don’t know if this adhd or not and I can’t talk to my doctor(3 week wait) right now and I am freaking out. Like can you trust your friends. The only friends I feel like aren’t just pretending to be my friends are the ones who I have know for 4+ years. Like anytime my new friends hangout without if feel like they all hate me and are just pretending to be my friends. I had someone tell me to look at BPD but then that is a differential diagnose with ADHD which I have to a borderline disabling amount (my every thought and action is an adhd symptom). Is this part of adhd or like is it not and I should hurry to see a doctor.",
        "created_utc": 1678140487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some clarity on medication benefits",
        "author": "picklefingerexpress",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfp9a/need_some_clarity_on_medication_benefits/",
        "text": "It seems every time someone posts about how great their first experiences on med is, the comments are full of people saying that those effects wear off in a few weeks and it’s back to normal. \n\nSo my question is- if that’s true, where is the benefit of diagnosis?\nI’m really struggling right now and I need to figure out where to focus. \nGet diagnosed and medicated or adjust my expectations.",
        "created_utc": 1678140379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a call",
        "author": "QuantumPerspectives",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfo7d/getting_a_call/",
        "text": "My psych doc is gonna call me because my bf told him that I had a suicide attempt a day or two ago. I f*€king hate talking on the phone and what the hell am I gonna say for myself. Sweat is dripping at just the thought of the call. Please I hope he forgets and doesn’t call. Ahhhh. I am tired of mental illness.",
        "created_utc": 1678140315,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my professor has ADHD",
        "author": "adhd4thee",
        "url": "https://www.reddit.com/r/ADHD/comments/11kflr1/i_think_my_professor_has_adhd/",
        "text": "I really don't want to self-diagnose but my professor acts exactly like I did before I got my ADHD diagnosis. Maybe that's just who he is but I just kind of ponder about this. But it would be very weird to just go up to him and ask \"have you ever thought of getting an ADHD diagnosis\" kind of way lmao. I feel bad because he blames himself whenever he forgets a thing, and maybe if he does have ADHD it could give him peace of mind? I also know that it's not good to assume such things, but what if something good comes out of it? This whole thing has been clouding my mind for a while now. I'm sorry if this sounds insensitive, I know what I'm talking about is a bit touchy.",
        "created_utc": 1678140158,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Straker London. Fast appointments but at all legitimate?",
        "author": "lewis1243",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfkoh/i_straker_london_fast_appointments_but_at_all/",
        "text": "I’ve recently found a clinic in London that goes by Ishbel Straker. There website is rather vague but they have appointments very soon. I’ve spoken to an assistant on the phone who has told me I can be seen Thursday and the price is super reasonable. \n\nIn short, has anyone had any experience with them?\n\nI’m ready to spend the money but I’m concerned of how experienced they might be.",
        "created_utc": 1678140097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody else struggle with severe exhaustion around 3pm??",
        "author": "michelleroemer8",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfev5/anybody_else_struggle_with_severe_exhaustion/",
        "text": "[removed]",
        "created_utc": 1678139767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ishbel Straker, London. Any experience?",
        "author": "lewis1243",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfeou/ishbel_straker_london_any_experience/",
        "text": "[removed]",
        "created_utc": 1678139756,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD medication",
        "author": "Psychological_Pin855",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfczg/adhd_medication/",
        "text": "[removed]",
        "created_utc": 1678139650,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just found out about the wildest thing today",
        "author": "AlphaWolfDesign",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfcpq/i_just_found_out_about_the_wildest_thing_today/",
        "text": "I was fuming over a $75 prescription with insurance, when I did a quick Google. People on Reddit kept mentioning this “GoodRx” and I googled it. \n\nPrescription coupons, cool, I typed in my prescription and they gave me an estimate. That’s cool, I thought, how do I sign up for this? How much? There’s no sign up. \n\nYou don’t pay these people anything. You just tell the nice pharmacist man (or woman) “hello! Yes I’d like to use GoodRx on my prescription.” \n\nAnd they understand that this is a cheat code, and your prescriptions may cost less money after. But they don’t tell you that you can say “I want to use GoodRx.” You have to find out about it on your own. That’s why I’m here telling you nice folks about it. \n\nI am not affiliated with this company in any way, just in case this sounded like an advertisement.",
        "created_utc": 1678139635,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m on the struggle bus, and I have no idea where I’m going",
        "author": "HistoGeek96",
        "url": "https://www.reddit.com/r/ADHD/comments/11kfbm5/im_on_the_struggle_bus_and_i_have_no_idea_where/",
        "text": "TW: depression, suicidal thoughts and some trauma dumping\n\nHi,\nKnowing that the internet can be a bad place to go with your struggles, I know I can trust at least the majority of this community. That being said…\n\nI’m not okay. \n\nI’ve had some horrible weeks and my mental state is hanging on by a threat. I recently broke up with my gf of one year, after is became clear that we weren’t on the same level intimacy wise and we weren’t communicating. The break up was rough and tough but as amicable as things could’ve gone. Since then however I’ve only struggled to come to grips with my decisions. I feel lonely, unloved and ugly (body positivity is not in my lexicon, and after all, how can I be attractive if I can’t even have intimacy in my relationship(*intrusive thoughts). I keep spiralling further down even pulling my into self destructive and even suicidal thoughts (this after I’ve shed these behaviours and thoughts for years after years of therapy). I’m struggling at work and I’m having major struggles studying. I should’ve been finishing my BA thesis this year, but as it stands, I simply won’t make it. \n\nI’m glad I could write some shit down and I hope there are some kind souls out there who want to give me some encouragement. I just feel like I need to be heart. \n\nI hope anyone going through something similar knows they’re not alone. I know I’m not, even though it feels like it, crying in my room, typing this out here. \n\nI’m not okay, and that’s okay. Shit happens. \nLet’s try to get through it",
        "created_utc": 1678139568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling sad and hopeless",
        "author": "rosegold018",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf9h5/feeling_sad_and_hopeless/",
        "text": "This shortage has spiraled me into ADHD burnout. Depersonalization, lack of quality in my work, shame spiraling. The pharmacists are always so rude and dismissive. I know it’s not their fault but they say the only way to know if they’ve received shipment is to call and ask…and then they get mad at you and catty when you call to ask. Feels like as soon as we do receive stock, it’s going to immediately be sold out. And I’m also downright furious it took YEARS of tests, appointments, paperwork just to even be considered and taken seriously to get a prescription! For one of the main reasons we are in a shortage is bc telehealth was handing out scripts like candy. I KNOW it’s not the only reason but it is one of them and for someone that has struggled their whole life to be heard and finally medicated…talk about salt on the wound.  Sad hopeless and I guess going back to mediocre version of myself is the new normal.",
        "created_utc": 1678139441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse memory issues?",
        "author": "Selvane",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf98f/vyvanse_memory_issues/",
        "text": "[removed]",
        "created_utc": 1678139427,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I speak with my doctor about a dosage increase",
        "author": "MattsFace",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf8y7/how_do_i_speak_with_my_doctor_about_a_dosage/",
        "text": "Hey guys,\n\nI started Adderall XR as a treatment for Type I ADHD. I have been on 30 mg XR for the past 8 months.\n\nIt has been a godsend. My anxiety and depression have benefited from the treatment so much.\n\nCovid was a tough time for me. I ran into self-medicating issues. With that experience, my doctor has been cautious with prescribing scheduled substances. However, the 30 MG XR is just not cutting it anymore. \n\nWhat is the best strategy for me to discuss adding an IR tablet after lunch or something else that might be stronger?",
        "created_utc": 1678139412,
        "upvote_ratio": 1.0
    },
    {
        "title": "parents are really against meds because of stigma, what do I do to convince them",
        "author": "AWackyUsername",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf7lg/parents_are_really_against_meds_because_of_stigma/",
        "text": "[removed]",
        "created_utc": 1678139333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pros/Cons of the different meds",
        "author": "SVGMeij",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf5tx/proscons_of_the_different_meds/",
        "text": "I have an appointment later this week to start new meds following a hiatus after coming off vyvanse. I’d like to know about the experiences of others with the different types of meds for comparison. \n\nPlease use this as a thread to share your experiences. \n\nHere’s mine:\n\nVyvanse - 37F, about two years\n\nPros:\n-excellent focus\n-sustained energy\n-lasts most of the day\n-appetite control (for the first while)\n\nCons: \n-insomnia (have to be careful with timing)\n-lost efficacy with time, ended up climbing dosages fairly fast \n-after taking regularly a missed dose or two was awful. I was down and out. \n-felt I lost some of my creative edge. \n\nOther Stuff:\n-medical plan, cost wasn’t an issue but dr told me it was costly if not",
        "created_utc": 1678139226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meds w/ Emotional dysregulation",
        "author": "zendi_lyon",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf32f/meds_w_emotional_dysregulation/",
        "text": "Sometimes I feel like my meds work ..ok..(still observing) unless something triggers me or i'm having a bad day emotionally. \n\nThe other day I took it and felt motivated and focused and felt good about how i got on with the day...the next day I tried again but I could feel early on (before i took it) I was agitated/frustrated...and as the day progressed my frustration turned into anger, i felt depressed, and I was avoidant of the work i needed to to. I felt like I went back into paralyzed stair at computer mode. \n\nIs that strange that one day the meds are effective and the very next they aren't? I thought it would help with the emotional volatility but seems like that it created a hindrance with the efficacy of the rx itself. (the first month of the meds didn't help symptoms at all because I was moving under incredibly stressful circumstances.. but now that that stress level is a little less it still feels like its hit or miss. \n\nnot sure what to consider discussing when I see my psy' again.. Should i ask to try something else ?",
        "created_utc": 1678139066,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Seems like everyone has ADHD now\"",
        "author": "dogism",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf1mo/seems_like_everyone_has_adhd_now/",
        "text": "My friend told me this the other day after I told her about my ADHD lookings-into. Meanwhile my other friend is being investigated for ADHD and my ex was semi-recently diagnosed with ADHD.\n\nI think those TikTok trends are to blame to some extent with people going \"I'm so ADHD\" and muddying the waters now, but do you think ADHD might actually be way more widespread than it's been thought to be? My friend said basically \"1% my ass\" in relation to what she'd heard would be the presumed amount of all people with ADHD in the world. I might be inclined to agree on that but not for the same reasons. She was doubtful about all these people having ADHD, but maybe it's the other way around - perhaps we've been blind to the true extent of ADHD affecting our societies?",
        "created_utc": 1678138972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coping tips to manage emotions / stress for preteen",
        "author": "Ok-Jellyfish9225",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf1im/coping_tips_to_manage_emotions_stress_for_preteen/",
        "text": "Hi everyone,\n\nI have ADHD and an ADHD kiddo. He's 11 and school is very stressful to him. I'm trying to help him from several angles, and one of the things I'm doing is gathering tools on how to cope with situations that are high-stress to him (preferably without throwing chairs lol). Unfortunately, some situations that are pretty common in school remain very stressful to him and I want to help him find ways to calm himself when that happens.\n\nHe's allowed to leave the room for a calmer space and he has a couple of fidget/sensory toys with him. Do you have other ideas on how to deal with this?\n\nI'm also working with the teachers to reduce his exposure to triggers, but it's impossible to avoid all of it all the time.",
        "created_utc": 1678138965,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was just told it’ll be a 3-6 month wait for me to get official ADHD testing…",
        "author": "crypticsoups",
        "url": "https://www.reddit.com/r/ADHD/comments/11kf17f/i_was_just_told_itll_be_a_36_month_wait_for_me_to/",
        "text": "I’m a college student who has been slowly working to acknowledge my ADHD symptoms as actual symptoms, instead of trying to convince myself I’m fine. My therapist suggested my anxiety stems from an attempt to “override” my ADHD—if I can’t motivate myself well, maybe being incredibly anxious will be enough motivation to complete my work, etc. I was hoping to get official ADHD testing to get a diagnosis and hopefully try medication, because my anxiety is worsening, and I was hoping that addressing the ADHD symptoms would also reduce the anxiety I’ve developed. But, my college just told me they can’t refer me to a testing place, and it’ll be a 3-6 month waitlist. I didn’t realize I would feel so gutted. I’ve only just began to accept that I have ADHD symptoms, and I barely let myself understand how much I’m actually struggling. I don’t know how to stay afloat anymore without some drastic help like medication, so this waitlist length is so distressing. College with ADHD is really really hard…",
        "created_utc": 1678138948,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your go-to cleaning album?",
        "author": "LemonPigeon",
        "url": "https://www.reddit.com/r/ADHD/comments/11kezhw/whats_your_goto_cleaning_album/",
        "text": "I usually listen to records while I clean (so there are natural break times when one side is done, or the album is over), and my go-to is Discovery by ELO. Not sure why, but it’s just perfectly suited for tidying. I’ve used it so often that hearing the album automatically gets my brain into cleaning mode.\n\nHowever, I’m looking to branch out, so any cleaning album recommendations?",
        "created_utc": 1678138845,
        "upvote_ratio": 1.0
    },
    {
        "title": "doubt my adhd",
        "author": "Witty_Gate1192",
        "url": "https://www.reddit.com/r/ADHD/comments/11kevq7/doubt_my_adhd/",
        "text": "[removed]",
        "created_utc": 1678138636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone cracked the code on how to take their meds early (before 9 am) AND eat?",
        "author": "sunfrit",
        "url": "https://www.reddit.com/r/ADHD/comments/11ketvq/has_anyone_cracked_the_code_on_how_to_take_their/",
        "text": "[removed]",
        "created_utc": 1678138527,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you forget your trauma/ don't think about it, is the effects still there?",
        "author": "AnimeFreakz09",
        "url": "https://www.reddit.com/r/ADHD/comments/11kets3/if_you_forget_your_trauma_dont_think_about_it_is/",
        "text": "One thing about having ADHD that messes with me in dating and relationships is I forget so many things and details. A guy can do me wrong and then I will forget then forget details then wondering why I was mad at him and then forget and the randomly it might pop up and I'm like damn wtf! I've noticed I do this a lot or think something someone does is me tripping or reading too much into it.  If you have trauma you don't think about or forget but remember every now and then does it effect you in ways where you don't consciously notice?? I am kind of care free despite so much anxiety and stuff  (because I forget) but every now and then I think back on some things and remember some things but I feel \"detached from it\" I know it's fucked up 100% what I went through but feel kind of nothing.  Idk if that is good or bad.  \n\n&amp;#x200B;\n\nI've always had these issues and why I prefer to stay to myself because I keep finding myself in situations with someone that's \"predatory\" in a way.  I feel I come off as ditzy/naïve/gullible and have heard I have an innocent face.",
        "created_utc": 1678138521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else have a designated album for cleaning?",
        "author": "LemonPigeon",
        "url": "https://www.reddit.com/r/ADHD/comments/11keshx/anyone_else_have_a_designated_album_for_cleaning/",
        "text": "[removed]",
        "created_utc": 1678138448,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm an asshole in the morning and it's ruining my relationship",
        "author": "Natural_Ad2913",
        "url": "https://www.reddit.com/r/ADHD/comments/11kesdy/im_an_asshole_in_the_morning_and_its_ruining_my/",
        "text": "So my partner is usually understanding and supportive about me having ADHD. However, he is adamant that I am apart of his morning routine and that we get up at 6.30 together and exercise, then make smoothies, then get ready and go to work. Unfortunately, i am not a morning person and I'm a bit of an ass to deal with. I struggle to wake up quickly and jump straight into exercise without complaining and that's whats causing a spanner in our relationship. I tried getting up before him and spritzing my face which helped, but when it came to the exercise I still struggle to get into it. I think a huge part of it is that it's not something I enjoy doing so struggle doing it. Any tips on how to be a better morning person or how I can talk to my partner about this situation would be much appreciated.",
        "created_utc": 1678138442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy productive Monday before the inevitable crash! Embrace what you can!",
        "author": "AutoRedialer",
        "url": "https://www.reddit.com/r/ADHD/comments/11kerbg/happy_productive_monday_before_the_inevitable/",
        "text": "…If you’re like me you can’t keep a schedule for SHIT. I usually am a focus God on Mondays but then will nosedive from some massive detour in my attention span or energy level on Wednesday. Today though, I woke up early, went to the gym, took my medicine and a shower, was feeling alive and great. \n\nAfter lunch I crashed in my bed for two hours (I work from home and am self employed). \n\nSo it’s a record 6 hours before I messed my schedule up 🫠. \n\nEmbrace having any success, nothing can undo your healthy actions, just get back on the damn horse 👊🏼",
        "created_utc": 1678138375,
        "upvote_ratio": 1.0
    },
    {
        "title": "brain fog?",
        "author": "murrangutan",
        "url": "https://www.reddit.com/r/ADHD/comments/11keofi/brain_fog/",
        "text": "Hello! I’ve been on this reddit passively for a while but this is the first time Im posting. I was on Ritalin for a long while but found myself hitting a huge wall about 3 hours after taking it so I got put on Adderall about 4 months ago. I love it! It’s great! It lasts all day!\n However, I’ve started to notice that as soon as I wake up (take it in the AM), I have intense brain fog. It goes away as soon as I take my adderall, but if I try to do absolutely anything off of it I feel like a complete zombie. \nIs this normal? I’ve tried looking on here and elsewhere, but can’t seem to find anything about when you’re OFF adderall and haven’t taken it in 24 hours. It’s not concerning enough that I want to stop taking it, but I honestly wasn’t told a list of side effects so I just want to know if any of you have experienced this!",
        "created_utc": 1678138213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone cracked the code on how to get up early enough (before 10 am) to take their meds AND eat?",
        "author": "sunfrit",
        "url": "https://www.reddit.com/r/ADHD/comments/11kenmb/has_anyone_cracked_the_code_on_how_to_get_up/",
        "text": "[removed]",
        "created_utc": 1678138162,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started ADHD medication, but it is making me tired?",
        "author": "fseed",
        "url": "https://www.reddit.com/r/ADHD/comments/11kekfz/i_started_adhd_medication_but_it_is_making_me/",
        "text": "[removed]",
        "created_utc": 1678137967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strattera not a continued treatment?",
        "author": "marengari",
        "url": "https://www.reddit.com/r/ADHD/comments/11kec96/strattera_not_a_continued_treatment/",
        "text": "Just finished my three year road to diagnosis so yay to me! 😁 But some things the doctor said that have been bugging me. She prescribed me strattera saying concerta is only indicated for children and strattera is the primary medication for adults, which seemed … weird to me. The fact she wouldn’t even consider it? She also made some comments regarding my plans for my future career, saying that strattera is only appropriate for students and i will be taken off it once i finish my education and insinuated i should take that into consideration when career planning. I’m not a doctor, of course, but obtaining my degree doesn’t seem like a magical cure for ADHD. Doubly weird since she would not even consider stimulants. This and various other comments made me doubt, well, the integrity of her medical expertise. I’m starting the treatment tomorrow so i can’t exactly change doctors right now but i’m kinda feeling like i should? Thanks for any advice",
        "created_utc": 1678137484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone having experience with stimulants and stopping SSRI?",
        "author": "FitLow7075",
        "url": "https://www.reddit.com/r/ADHD/comments/11keb4o/anyone_having_experience_with_stimulants_and/",
        "text": "Hey All,\n\nSince I stopped my SSRI (Zoloft, low dose, but since long time; don‘t need it anymore as Vyvanse helps with OCD), I have issues with Vyvanse not lasting as long as before, muscle pain, crash, often not the desired effect etc.\nHas anyone else experienced something like that?\n\nRestarted tritration to find the right dose again, but it‘s not as before. I.e., I need a afternoon buster.\n\nI‘m off Zoloft since two months. Withdrawal is still not fully done.\n\nThanks in advance for your input, if you experienced something similar - and how you dealt with it (either mentally or dose-wise ☺️).",
        "created_utc": 1678137417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Provisional Diagnosis Purgatory",
        "author": "nerdyqueerandjewish",
        "url": "https://www.reddit.com/r/ADHD/comments/11keb23/provisional_diagnosis_purgatory/",
        "text": "Is there something I’m not understanding about provisional diagnosis? I was tested for adhd, and they said that i fit all they symptoms but I also flagged for anxiety, which I knew would happen, and the testing people said said “ok, they can be mistaken for each other so get the anxiety under control and if you still have adhd symptoms, we will know it’s adhd.” I go to a psych, get anxiety meds, doing way better anxiety wise, but my adhd symptoms have gotten a bit worse. During my appointment my psych reviews my tests, she says that since I don’t have a “real” diagnosis she doesn’t know if she can prescribe me anything for adhd and will have to check with the medical director and I’ll hear back Wednesday. But, she didn’t seem to understand that we just eliminated the factor that made the diagnosis provisional in the first place. I know I just have to wait but I feel really discouraged. Explaining my test results and background (that she didn’t bother to review) and how my current reaction leads us to the “has adhd route” just made me feel like I was being perceived as a med-seeker, especially since my testing had an amendment added, changing diagnosis from unspecified cognitive disorder to adhd.",
        "created_utc": 1678137414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Irritability on Vyvanse",
        "author": "withtheklutch",
        "url": "https://www.reddit.com/r/ADHD/comments/11kea8t/irritability_on_vyvanse/",
        "text": "Hey y’all! I (26f) recently got switched to Vyvanse from Adderall, and while I’m mostly finding it to be pleasant and helpful, I am 10000% more irritable since being on it. I’m usually pretty patient and chill, but while on it I have a very short fuse, and am quick to point out what others are doing that’s pissing me off. \n\nHas anyone else felt like this while adjusting? And if so, does anyone have any tips on how to diffuse it a bit?",
        "created_utc": 1678137365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are intrusive thoughts a symptom of ADHD?",
        "author": "Sollyfairy",
        "url": "https://www.reddit.com/r/ADHD/comments/11ke8w1/are_intrusive_thoughts_a_symptom_of_adhd/",
        "text": "[removed]",
        "created_utc": 1678137284,
        "upvote_ratio": 1.0
    },
    {
        "title": "independent problem solving , silly mistakes and embarrasment",
        "author": "confused_8357",
        "url": "https://www.reddit.com/r/ADHD/comments/11ke37k/independent_problem_solving_silly_mistakes_and/",
        "text": "If u give me a list of instructions and a sequence to follow them, u will find me either working very slowly or staring blankly after the 1st few steps. You would also find me making very dumb mistakes and getting confused easily. I get even more anxiety when somebody is staring at me..and i am trying to troubleshoot. \n\nI doubt this is learning disability coz i have never been a bad student my entire life .grades were always above average.  I suck at lab work in general. ( occasionally excel and become very fast when i get the confidence) .\n\nAnything to do with ADHD. ?",
        "created_utc": 1678136953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Desperate for morning wake up tips!",
        "author": "Kodys_angel",
        "url": "https://www.reddit.com/r/ADHD/comments/11ke11t/desperate_for_morning_wake_up_tips/",
        "text": "As above… I’m starting a new job next week and have to be at work by 7am!! \n\nFor some reason, no matter how many alarms I set, how often, how loud, whether it’s in a different room, vibrating on my wrist, I don’t wake up! \n\nIt doesn’t matter how much sleep I’ve had - 4 hours or 10 hours - i’m perpetually exhausted! \n\nLike most I struggle to get to sleep because my brain is so busy. Apart from my stress naps (when everything is so overwhelming I can’t do anything so I have a nap!). Nap or no nap, I still stay awake longer than I’d like. \n\nI’ve tried the doctors but other than giving me sleeping tablets for temporary relief to actually fall asleep, telling me to go to bed earlier, telling me to improve my sleep hygiene (all of which I’ve tried), they have no solution for me. \n\nI will sleep through multiple alarms every day. I turn them off in my sleep. Even the ones where I have to do a maths problem! Why am I like this?! At the minute I have my MUM call me in the mornings to make sure I’m up. This isn’t going to cut it when I start my new job and I’m really worried about oversleeping and losing my job. \n\nAnyone else have this issue? Has correct medication helped you to manage it? I live by myself so don’t have anyone here to kick me when then alarm goes off",
        "created_utc": 1678136823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evaluation is later this month, but…",
        "author": "Plants_and_Pinot",
        "url": "https://www.reddit.com/r/ADHD/comments/11ke0pe/evaluation_is_later_this_month_but/",
        "text": "I’ve been on 10mg of Adderall XR for about two years (atomoxetine/straterra made me nauseous) after telling my PCP I was struggling to focus while working from home. After scouring the internet for a while, I believe I have ADHD, but want a diagnosis if I’m going to continue taking stimulants. If I don’t get a diagnosis, I’ll stop. Close family members have been diagnosed and I have many symptoms. \n\nI guess my question is, do I go off the meds for the evaluation? And any tips/advice as I head into the evaluation? I’m not sure what to expect - it’s a 45 minute appointment with a psych PA. Appreciate your insights!",
        "created_utc": 1678136803,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need friends",
        "author": "RockStealer",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdyo5/i_need_friends/",
        "text": "I'm 17, I have adhd and bpd and there might be other stuff going on. I have no friends. I can never find people my age that want to be friends. Every time I try to talk to someone about the stuff I like I end up talking to much and they think I'm weird. I don't really know how to keep or make friends. I'm looking for people around my age to be friends with. \nI like bobs burgers, bojack horseman, bluey. I'm obsessed with film analysis and psychology and sociology. I like fnaf, slime rancher, and some other games. I draw and paint and stuff like that. Possibly a furry. I love sharks, frogs, cows, cats, dogs, too many animals to list.",
        "created_utc": 1678136687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it hopeless for me?",
        "author": "BetterThanVeteran",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdw1x/is_it_hopeless_for_me/",
        "text": "I have had ADHD since I could remember, always getting trouble during elementary school and unable to read textbooks even if my life depended on it. I would read a paragraph, the next one, and have no idea what I just read. It didn't matter how many times I read the paragraph and I couldn't move on to the next paragraph. That's when I really realized something was wrong. Was about 15 or so, but had textbook ADHD symptoms from very early childhood and was punished harshly for it. I did not know ADHD even existed at the time. I just thought I was a a bad kid.\n\nHighschool was manageable, despite my ADHD but in college it really impacted my grades and mental well being and pretty much every aspect of my life. I dropped out of school a couple of times because I just could not focus, prioritize, keep track of time, and completely forget important appointments despite having reminders and such. I would always be late to events, no matter how early I prepared so I eventually began going extremely early. Literally at least two hours earlier than when I was supposed to. \n\nBecause of my academic performance, I became severely depressed. I thought I was worthless because my title was a student and I was failing all of my classes. I just thought I was a lazy piece of shit and graduation seemed hopeless. I dropped out two times and nearly gave up on getting a degree.\n\nI was extremely fortunate enough to meet a doctor during my last attempt at university and she trusted me enough to prescribe me Vyvanse. It was a game changer. I never got straight A's during college years. I was too depressed and worthless to even show up to class or even have a conversation. But the Vyvanse really changed everything. For the first time in my life, I felt like I can accomplish something if I invested enough time, effort, and practice. It improved symptoms of depression and I found some self worth again. I was able to get such an expensive medication because of the school's mandatory insurance.\n\nAfter graduation, I had no choice but to rely on Medi-Cal, which is free insurance in California for people with low income. But I cannot find any psychiatrist who will accept medi-cal. \n\nMedi-cal does not cover Vyvanse and that is the only ADHD med I tried that worked with no issues. I tried Ritalin, Focalin, and Adderall. None of them even come close to the effectiveness of Vyvanse. Because of the patent, it's extremely expensive without insurance and there is absolutely no way I can afford it. \n\nRitalin is absolute crap and the side effects are torture. It doesn't even last long enough for me to finish an assignment. Focalin is a little better. Adderall, like everything else, has to much of an up and down.\n\nI am willing to try Dexedrine because of the generic cost and if there is an extended release version, even better, because I don't like to continuously have to take pills throughout the day.\n\nAre there any psychiatrists that actually trusts their patients to use their medication for their intended purpose and who accepts medi-cal? I've been looking but it almost seems impossible.\n\nMy life has went down the drain since I couldn't take Vyvanse due to my insurance changing and I am afraid living with this disability and just barely scathing through life with depression caused by ADHD is the only way. I don't consider this living. I mean what's the point?\n\nHas anyone had a positive experience with medi-cal and ADHD? I just want to hear some hopeful stories so I can at least dream that I can possibly get my life back again.\n\n&amp;#x200B;\n\nTL;DR: Forced insurance change prevents me from getting the ADHD medication that I need and works to function like a normal human being but I have been cut off with no where to ask for help. Is there hope?",
        "created_utc": 1678136534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences using L-Tyrosine?",
        "author": "tna11101989",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdt5x/experiences_using_ltyrosine/",
        "text": "[removed]",
        "created_utc": 1678136383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with this sh*t.",
        "author": "MethodicallyCurious",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdr5f/dealing_with_this_sht/",
        "text": "Does anyone else feel that they have to always one-upmanship themselves when it comes to doing anything? Generally negative activities, that cause issue. \n\nFor example, every shit show of my own doing, always preceeds an even bigger one. Again, of my own doing. \n\nDoes anyone else feel like, when shit's going down, double down?",
        "created_utc": 1678136265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences using L-Tyrosine",
        "author": "tna11101989",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdp9y/experiences_using_ltyrosine/",
        "text": "[removed]",
        "created_utc": 1678136157,
        "upvote_ratio": 1.0
    },
    {
        "title": "I realized I struggle with feeling bad AND feeling good.",
        "author": "Life_Tourist4111",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdmql/i_realized_i_struggle_with_feeling_bad_and/",
        "text": "I was recently diagnosed at 30 after being suspicious for a long time. A lot of things made sense and some things were things I hadn’t realized, like that I have trouble regulating emotions. I’m aware that my sadness and anger can get out of control, negative emotions, and I know my brain lacks serotonin and I am often seeking it. \nI had a big aha moment however when last week, I had an interview/introductory call for a job I really wanted. It went great, and what I learned on the call made me even more excited about the roll. My current job is not going well so the thought of being out of there, and this new chapter felt amazing. Like, too much serotonin, cloud 9. That in itself was probably an overreaction because I was not guaranteed the job and you never know, sometimes things sound good at first and end up awful. Still, knowing how big my reaction was I couldn’t stop it, I had a really hard time focusing on work the rest of the day and only wanted to plan for this new role. I thought about other times this has happened to me, and I wanted to calm down and just catch up on work but I couldn’t. It was weird feeling like even a GOOD feeling could set me back and annoy me when I can’t turn it off\nI guess this is still emotional dysregulation? I’m planning on starting to meditate again but dang, if I’m not good at feeling down/angry, or good/happy.. what else is there? When things are just steady I get bored like I’m sure many of you can relate :/",
        "created_utc": 1678136010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big cry at the therapist's office today",
        "author": "mary_goodfellow",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdmfg/big_cry_at_the_therapists_office_today/",
        "text": "[removed]",
        "created_utc": 1678135993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird experience at pharmacy",
        "author": "cynthiadoll",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdle6/weird_experience_at_pharmacy/",
        "text": "So I just got a new prescription for some short acting Adderall, and when I initially went to pick up my medication they said they didn’t have a prior authorization approved yet. So I called my doctor, who responded by the next week saying that my medication was authorized the week before and to call the pharmacy back. I just called the pharmacy and they said that the prescription was on back order and to have my doctor send my prescription to other pharmacies. I asked her if any other CVS stores nearby would have it. She then took her statement back and said she had enough in stock to fill my prescription. My question is how can you tell me to go elsewhere and then say actually I can fill this for you? Should the pharmacist not be checking stock before telling me that they are out? The whole interaction just felt sketchy. I am aware that there is a supply issue but I also think that the employees should know what they have. I also don’t understand why the pharmacy never filled my prescription after getting the authorization as this is not a refill but a brand new medication. Is it always this complicated to get medication?",
        "created_utc": 1678135932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will I ever cope stimulant free?",
        "author": "Longjumping-Bend3871",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdian/will_i_ever_cope_stimulant_free/",
        "text": "Just tired of constantly having to regulate myself. I always need something to restore my balance - whether it’s earphones to tune out the noise or meditation to calm my mind or caffeine, a legal high, a drink or randomly tidying up for hours or isolating myself…\n\nI dream about what it would be like to just be zen. Just 100% peaceful and not overwhelmed. Has anyone found this kind of peace?",
        "created_utc": 1678135756,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do when my medication doesn’t work?",
        "author": "RemarkableNatural",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdh79/what_do_i_do_when_my_medication_doesnt_work/",
        "text": "I took a break from my meds yesterday so that they would work today (bad decision because I was a complete mess yesterday) but they’re not working.\nI just have a headache, some pressure on my eye, and all the symptoms the meds are supposed to help with.\nI have to use all my energy just to focus my vision and not space out.\nWhat should I do about this?",
        "created_utc": 1678135690,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'M TIRED OF FELLING USELESS AND IMPOTENT, what I'm supposed to do?",
        "author": "Noxus_Exile",
        "url": "https://www.reddit.com/r/ADHD/comments/11kdfz7/im_tired_of_felling_useless_and_impotent_what_im/",
        "text": "Since I can remember I've feel like I don't have any power over my on life and self, since as child a hear that I'm mistake, I can't function, I'm the worst thing that happen, I'm  the cause of all troubles I'm my parents life and ETC\n\nAnd this made I've been dragged by others and the moment all my life, making me lose the first 22 years of my life (When I got Diagnosed with ADHD), this state of living made my self steem going in to a very deep whole, where I basically didn't live my teen years.\n\nI've grown thinking that I'm less that anybody else, ZERO confidence, i just got isolated into a room playing video games and been depressed all day long 24/7\n\nBasically from 8 to 21 years of i spent inside a room playing games because I believed that I'm dumb and can't do anything right, so no social connections ( 0 friends ), no sports practice ( 0 health ), no hobbys ( 0 confidence ) and the list goes on\n\nFAST FORWARD TO TODAY, I'm 23 now and have deeply studied ADHD but I have know fucking clue where to start\n\nI just like the past, I keep all day scrolling through a screen doing nothing for my self and life, just procrastinat, don't now what i should do to go and start my LIFE\n\nI'm alone, don't work, I live in a room just because my Father has money and pay it, but from the rest I don't have a clue wtf I'm doing next\n\nTired of this feeling of been lost I'm my own mind, I don't have any friends or will to keep going, I'm living day by day tortured by my own thoughts of uselessness",
        "created_utc": 1678135617,
        "upvote_ratio": 1.0
    }
]