[
    {
        "title": "I can’t wake up before 10am",
        "author": "lizardjenkins",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnfsz/i_cant_wake_up_before_10am/",
        "text": "[removed]",
        "created_utc": 1678352397,
        "upvote_ratio": 1.0
    },
    {
        "title": "im diagnosed but people dosent seem to care",
        "author": "im_bored2137",
        "url": "https://www.reddit.com/r/ADHD/comments/11mnbm2/im_diagnosed_but_people_dosent_seem_to_care/",
        "text": "Im not on meds becuse i feel bad she (my mom) also was against.\n\nBut every time i say to her that i forgot something she says \"dont forget it\" or \"dont do it\" if we talk about things in school.\n\nMy dad does not do it is much since he is the one that goes with me to therapists psychiatrics etc. So he knows why i do it and stuff.\n\nAlso after i started (swinging? I dont know the translation im not from US) on a chair teacher said to stop, i said i have adhd and she said that i need to have the other document type later to learn you can get it for adhd.\n\nIm 13 if it changes anything i know mostly adults are here.",
        "created_utc": 1678351913,
        "upvote_ratio": 1.0
    },
    {
        "title": "I believe I'm undiagnosed adhd and learning disability kid. I'm 37 years old now",
        "author": "Economy_Ad_9846",
        "url": "https://www.reddit.com/r/ADHD/comments/11mn92f/i_believe_im_undiagnosed_adhd_and_learning/",
        "text": "Guys dont be mad im just really clueless  to this \nI grew  up in Poland back in the 90s. I just always remember  to have problems  with reading  , especially  infront of people  out loud. I remember my mom trying  to teach me basic  math, by making me stand on a table and counting. \nI also had to go to to a speech therapist.\nNow as I'm getting  older I'm noticing  that I have to think little bit more about what I will say. My dyslexia  happens more often  especially  with numbers.\n\nIs there  anything  I could do?\nNo insurance  living in NY",
        "created_utc": 1678351642,
        "upvote_ratio": 1.0
    },
    {
        "title": "phone games?",
        "author": "Glittering_Rock1665",
        "url": "https://www.reddit.com/r/ADHD/comments/11mn2z5/phone_games/",
        "text": "[removed]",
        "created_utc": 1678350978,
        "upvote_ratio": 1.0
    },
    {
        "title": "i want to conquer adhd help needed",
        "author": "StrengthImpossible88",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmz22/i_want_to_conquer_adhd_help_needed/",
        "text": "I conquered my other demon but now i need adhd to be off and i need a goal in life i have no goal thinking of a goal make me confused between ton of diffrent things that i want to do what should I do , i don't have job how much time till i live on parents money i need a life so share some resources about adhd so I can read about what causes it and how can it be controlled or tone down to zero",
        "created_utc": 1678350557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety and adhd",
        "author": "Marieob_",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmwhx/anxiety_and_adhd/",
        "text": "I have been taking antidepressants for panic disorder and anxiety. Now I’m 99% anxiety free and no panic attacks. Im an straight A student but lately after treating my anxiety i have been dealing with issues with my education. I feel like anxiety was the reason for my good grades. Back then, i have always started whatever assignment i got right away, fearing that i won’t have enough time or something wrong would happen. Since i started college, I’ve always had to do lists daily, weekly and even for every single course. I still do this not after being anxiety free. But now im missing most of my work and getting bad grades on a course I already took and also good at. I’ve been showing signs of adhd for a while but my psychiatrist suggested we check it after we’re done with the anxiety.\n\nCould my anxiety (back then) be the reason for my good grades? And the adhd is the reason why im messing up everything this semester? \n\nIf any students here had this issue I really would like to know because my next appointment is 2 months away. So if it’s a serious issue i may consider going to my psychiatrist asap cuz I can’t risk getting more bad grades.\n\nIm not sure 100% if this an adhd issue and im not asking for diagnosis. I just want to know if somebody who had gone through the issue i have with anxiety and probably adhd.",
        "created_utc": 1678350280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Split dose or whole dose? or earlier? What's the best way to prevent adderall induced insomnia?",
        "author": "yopharmd",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmwcj/split_dose_or_whole_dose_or_earlier_whats_the/",
        "text": "I've been taking adderall for quite some time now and have developed insomnia as a result. When I had initially started, I took a single dose of 10mg ir around 8:30 AM and had no trouble falling asleep.\n\nRecently, I have been taking 15mg ir and two 5mg's ir. The starting time varied depending on whether I slept the night before . When I felt its effects decreasing (typically around 1-2 hrs) , I take the last 5mg dose (usually between 11-2 PM).\n\n**I was wondering what contributes to insomnia more, the dosage amount or the time that it’s taken ?**\n\nLike can I continue taking 25mg as long as I cut it off by a certain time, if so, when's the lastest that i should take my third dose?\n\nOr would better sleep result just from taking less overall? Which I obviously rather not do as that will decrease the duration of effectiveness, but would do if that's what needs to be done to prevent insomnia.",
        "created_utc": 1678350262,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to fix your sleep without any medication?",
        "author": "Inevitable_Map7625",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmtes/how_to_fix_your_sleep_without_any_medication/",
        "text": "The tittle pretty much says it all. The problem with any sleeping medication is it makes me a dope, especially long acting ones. \n\nI’ve been prescribed Mirtazapine , it works but as it’s meant to have an extremely long half life it makes me forget things more and be super dopey 24/7 then I’m on it. I’ve been given Melatonin, lots of people swear by it but again, it makes me dopey even at low doses and takes me at least a third of the day to wake up from. Been prescribed benzos too, at least they wear off the quickest so the negative side effects from them are the lowest, but they didn’t help me sleep the last time I got them, if anything I woke up almost every hour of the night and slept less while taking them, not that it’s healthy to take them long term anyway. \n\nMy sleep quality greatly effects my ADHD as you guys would know, 7-8 hours of sleep vs 6 hours or less for me is almost like being a completely different person function wise. I’ve tried all the normal mainstream advise from psychologists &amp; psychiatrists on sleep hygiene and it doesn’t seem to effect my sleep, it just does what it wants, and unfortunately for the last 2 months I’ve been struggling.",
        "created_utc": 1678349951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall is ruining my marriage. I love my husband and I hate how much I hurt him when I'm on it.",
        "author": "yopharmd",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmtai/adderall_is_ruining_my_marriage_i_love_my_husband/",
        "text": "I was prescribed adderall 10mg a few years ago to help me focus in school. I was single and living at home, and used it sparingly when I needed to study for an exam, in the privacy of my own room.\n\nFlash forward a few years later, I'm in nursing school and dating the love of my life. 10mg isn't really helping me anymore and my dr. prescribes me 20mg, which I take in seperate doses.\n\nAll throughout that time I had continued to take adderall in isolation, and was never required to socially interact. My fiance knew that I took it occasionally to study for exams.\n\nNow we are 9 months into our marriage, and I have been taking it every day. The reason being that I'm studying for my nursing boards.\n\nWhen I take adderall I am angry, irritable, bitter, pessimistic and my anxiety level is through the roof. I barley acknowledge my husband because I am so focused on trying to pass my exam. My board exam has bin the subject of our entire marriage and how I don't feel confident enough to pass. I've been having major side effects from the prescription too. I don't sleep, which causes me to take more adderall to stay up. It's a vicious cycle. The lack of sleep makes me snappy. The stress from my exam overwhelms me and makes me lash out at him. What's worse is I secretly blame him for my lack of success because he is always home when I'm studying, we live in a one bedroom apartment and he doesnt seem to understand that I have a short attention span and need privacy to focus.\n\nI love him. I don't want to be this way. But I feel like I need the medication to help me focus. I don't know what to do. I've seen how depressed he's gotten because of me and I hate that I'm doing this to him. I also hate that he's home so often and he doesnt see what that's doing to me. We both feel miserable. But I love him and i care about his happiness more than my own.\n\nI wish that i could just stop taking the medication, but I need to pass my boards so I can get a job and help financially support us. I plan to stop taking the medication after my exam, but I don't know how to repair the damage I've done to the beginning of our marriage and I feel like a horrible person every day when taking adderall because of how it's affecting him.",
        "created_utc": 1678349939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall makes me talkative, but in a different way.",
        "author": "alinniswennis",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmq3z/adderall_makes_me_talkative_but_in_a_different_way/",
        "text": "I have add (no hyperactivity) and I used to be super shy and had bad social anxiety. I’m a server and have worked in the industry 6+ years so it made me more comfortable talking with people. Without medication, I would start a conversation and ramble on and share information about myself that was waaay too private for people who aren’t good friends with me. It’s like I didn’t know when to stop and I would just say things without thinking about it. Now, with adderall, I’m able to talk more but I can actually think before I say something super weird. I’m able to have more conversations because of this! I’m able to stay on topic and not say anything too outlandish. It’s like the conversations flow better and I’m able to say what I’m thinking about more clearly. I’m 26 and it’s been two months since I’ve started these meds and I wish I could have started them sooner, but better late than never I suppose!",
        "created_utc": 1678349597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Programmers with ADHD, How did you manage to learn.",
        "author": "coolestsp00n",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmnl5/programmers_with_adhd_how_did_you_manage_to_learn/",
        "text": "[removed]",
        "created_utc": 1678349342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Notifications chaos",
        "author": "FeedZealousideal2300",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmm8v/notifications_chaos/",
        "text": "[removed]",
        "created_utc": 1678349200,
        "upvote_ratio": 1.0
    },
    {
        "title": "A browser for ADHD'ers!? Might be worth a look.",
        "author": "svonwolf",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmelx/a_browser_for_adhders_might_be_worth_a_look/",
        "text": "https://www.meetsidekick.com/\nCEO and founder Dmitry Pushkarev said, in a statement, “Modern browsers are not designed for work, but for consuming web pages. This gap really hurts hundreds of millions of users. We are convinced that lowering web distraction reduces anxiety and increases the quality of people’s work and the quality of their lives.”",
        "created_utc": 1678348445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not starting things because i don't want them to end",
        "author": "Snoo-14784",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmcw8/not_starting_things_because_i_dont_want_them_to/",
        "text": "I hope this fits here and someone can give me some insight. I tend to not want to start things because i'm so excited to do them and I don't want them to end.  For example k-dramas, i love watching them but i hate when they end so i don't start ones i really want to watch.  Also I like Gunpla, and i have many I haven't started because i enjoy the hobby so much...this happens to me with books...relationships etc...does anyone relate and can give me some advice?\n\nAlso I like to set nights to do certain things....ie. Tuesday nights are k-drama nights where i make Korean food and watch (if that helps)",
        "created_utc": 1678348262,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like ADHD and social media are an outright life-wasting combination and that it should be more frequently recommended that ADHD sufferers avoid it altogether.",
        "author": "SpiritualState01",
        "url": "https://www.reddit.com/r/ADHD/comments/11mmc7u/i_feel_like_adhd_and_social_media_are_an_outright/",
        "text": "[removed]",
        "created_utc": 1678348199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxious in morning and at night…? Please help",
        "author": "Throwawaylightningde",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm8sr/anxious_in_morning_and_at_night_please_help/",
        "text": "[removed]",
        "created_utc": 1678347859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random bursts of rage...?",
        "author": "malaproperism",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm798/random_bursts_of_rage/",
        "text": "I was diagnosed a few years ago with ADHD, and still have doubts I really have it.  Seeing it brought up so casually on Reddit (the only social media I'll allow myself to use) has contributed to those doubts, as well as family and friends.  I don't have the 'classic' symptoms so...I feel like some kind of poser.  I quit taking all medications, drinking and smoking.  I do take sleeping pills but I genuinely need them or I just won't sleep.\n\nOne of the more frustrating things I face is the random, intense bursts of angry energy I experience.  They come from seemingly nowhere, for no *good* reason.  Often it's when there's just nothing going on.  If it's a slow night at work I'll just start feeling it bubbling up, for example.  I want to scream, kick my desk, run up and down the stairs a few times just to get it out.  I've sat in my chair breaking pencils and markers just to let out steam.  If I'm not boiling in my seat I'm generally half asleep and in a far off land mentally.  Half my co-workers think I'm on hard drugs because of my sudden ups and downs.\n\nJust curious if this is something anyone else here has experienced, and how they cope.  I feel awful even if I only act out in the slightest way, because I know there's really no excuse for it.",
        "created_utc": 1678347702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Procrastination",
        "author": "lickinsalt",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm5y6/procrastination/",
        "text": "[removed]",
        "created_utc": 1678347578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former smokers and vapers, how have you been able to quit?",
        "author": "Fantastic_Ad_2638",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm5m0/former_smokers_and_vapers_how_have_you_been_able/",
        "text": "I was addicted to cigarettes for about 2 years, and was able to quit by replacing them with vapes. It’s now been almost 4 years addicted to vapes and the longest I’ve stopped for is a week. I don’t have a huge desire to quit, but I’m starting to realize that I’m never gonna want to quit and that doesn’t mean I shouldn’t.  The adhd is definitely a big roadblock in quitting, so I’m curious has anyone found ways around that?",
        "created_utc": 1678347541,
        "upvote_ratio": 1.0
    },
    {
        "title": "insomnia is incredibly annoying",
        "author": "cybercherries",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm5ka/insomnia_is_incredibly_annoying/",
        "text": "Idk if this is even the right sub but I’m really annoyed right now.  It’s 2 am and I’m sitting here scrolling through Reddit because I’ve been laying in bed for 4 hours with the jitters. The combination of adhd and blue light is not a good one.\n\nAnd just when my sleep was actually getting decently stable, I started my stimulants. Now I get to function, but I don’t get to be chemically stable enough to be able to have a healthy sleep schedule. \n\nI wish I could say I’ve tried everything but we all know how hard routines are. I’ve tried coming up with a sleep routine and then I only do it once every few weeks. \n\nI have a dream that one day I won’t drink insane amounts of coffee along with my literal stimulant medication to simply function like a normal adult, I won’t eat after 7pm, I’ll stretch, take a warm relaxing shower, drink an herbal tea, take some magnesium, and crawl into bed to be asleep by 10pm and happily up at 5.\n\nOne day my friends! Today though? Today is not that day and I’m very upset about it. \n\nTl;dr My ADHD is ADHD-ing and I’m upset about it. I want to sleep.",
        "created_utc": 1678347536,
        "upvote_ratio": 1.0
    },
    {
        "title": "I knew it was coming, but still, to many feelings to process.",
        "author": "SeorsaGradh",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm5hh/i_knew_it_was_coming_but_still_to_many_feelings/",
        "text": "So, my daughter was already diagnosed and tested for giftedness (is this an English word?) And we where working on that with teachers and a psychologist, she made enormous progress with the sensitivy 'issues' but know the psychologist said something was blocking the progress and she's almost sure it's ADHD. That would mean that I passed all my 'shit' on to my daughter. \n\n\nShe's getting tested, but me to, I'm almost am certain it's ADHD, I was just a bit ignoring the signs because I did not want to jinx it (if this makes any sense idk). \n\nAnyway, I'm sad, I did not want this for her. But what can I do? I know it's not the worst condition to have, but still. I kinda wanted her to have less struggles fitting in. \n\n:-(. Idk. Just wanted to share, and honestly all the other people don't get me because they are Neuro Typical, or don't have kids.",
        "created_utc": 1678347528,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to power through burnout?",
        "author": "pan33rMan",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm53v/how_to_power_through_burnout/",
        "text": "I'm on an extremely high stakes internship right now and it is imperative that it goes well. I have &lt;2 months left and need to get through the burnout. I don't have access to medication since I'm working in a different country, but I am willing to self-medicate with things like caffeine or sugar even if it's not healthy. I will get access to the right meds once I'm done with this term and go back to university. Please help.",
        "created_utc": 1678347486,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you watch your YouTube videos?",
        "author": "NeedTo_Ask",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm1mg/how_do_you_watch_your_youtube_videos/",
        "text": "[removed]",
        "created_utc": 1678347132,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to power through burnout",
        "author": "pan33rMan",
        "url": "https://www.reddit.com/r/ADHD/comments/11mm08s/how_to_power_through_burnout/",
        "text": "[removed]",
        "created_utc": 1678347011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just did a sexy dance in the mirror to Awolnation -Sail",
        "author": "AlwaysTrying2bBetter",
        "url": "https://www.reddit.com/r/ADHD/comments/11mlwpq/just_did_a_sexy_dance_in_the_mirror_to_awolnation/",
        "text": "[removed]",
        "created_utc": 1678346664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do doctors advise to check neurotransmitters levels and correct them as part of ADHD treatment ?",
        "author": "oddball_ADHD_bae",
        "url": "https://www.reddit.com/r/ADHD/comments/11mlv8r/do_doctors_advise_to_check_neurotransmitters/",
        "text": "[removed]",
        "created_utc": 1678346515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone was advised by doctor to check their neurotransmitters levels and correct them?",
        "author": "oddball_ADHD_bae",
        "url": "https://www.reddit.com/r/ADHD/comments/11mltp2/has_anyone_was_advised_by_doctor_to_check_their/",
        "text": "[removed]",
        "created_utc": 1678346373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hopelessness about meds",
        "author": "TheNameIsMarty",
        "url": "https://www.reddit.com/r/ADHD/comments/11mlms4/hopelessness_about_meds/",
        "text": "Just, how do I stop *feeling it*?\n\n\nI'm going to give the short breakdown, my current meds aren't working, and i don't have any other alternatives.\n\n\nLet me repeat this, because it might seem like the obvious solution:\n\n\nI Have No Other Medication Options.\n\n\nThe bottom line is that, and I find myself feeling sad, hopeless, guilty, whenever I see a post about people having the greatest successes with medication, or just when I think about what could've been.\n\n\nIt's great that people can share their joy, their success, finally getting somewhere.\n\n\nYet I can't. I'm in a limbo where I've tried and done everything I could, and yet despite everything I still have to do it all by myself, practically without the help of medication.\n\n\nAnd yeah, it's really, really not fucking great.\n\n\nBut at least I want to accept it. I'm sick and tired of fucking whining that my current meds haven't ever fucking worked. Sick of complaining, and explaining how where I'm at, No, I can't just try a different damn medication because there isn't one.\n\n\nAnd so I just want to stop feeling so down, when I realize that's the reality I'm in.",
        "created_utc": 1678345699,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to maintain weight after stopping adhd meds?",
        "author": "Ok_Instance_679",
        "url": "https://www.reddit.com/r/ADHD/comments/11mlk0p/how_to_maintain_weight_after_stopping_adhd_meds/",
        "text": "[removed]",
        "created_utc": 1678345427,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best free apps for managing adhd?",
        "author": "gracefullytasty",
        "url": "https://www.reddit.com/r/ADHD/comments/11mljnp/what_are_the_best_free_apps_for_managing_adhd/",
        "text": "My adhd is getting so out of hand, my therapist recommended me having a system in place like a chart with tasks so I can stay on track but having an app on my phone with me at all times I can check off tasks or reminders to do things would be so helpful. moneys tight so I can’t subscribe to any monthly charges. I’m wondering if there’s anything free like this other than just notes and reminders on iPhone because I would rather just have ONE app for everything I need then all my lists in separate areas on my phone is too disorganized than I like. \nThank you for the help!!!",
        "created_utc": 1678345389,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accidentally placebo'd myself; It could never replace proper medication.",
        "author": "Xochtil1",
        "url": "https://www.reddit.com/r/ADHD/comments/11mligd/i_accidentally_placebod_myself_it_could_never/",
        "text": "# How did it happen?\n\nWon't bore you with the story how it happened, in short I was doing my daily routine but one thing distracted me which caused me to not take my meds. After that I started doing the daily routine I do after taking meds, fully convinced I did actually take them.  \n\n\n# How did you feel after that?\n\nIt was a bit weird experience. I fooled myself so much I even felt the usual side effects of flight and flight response (dry mouth, a lot of fidgeting, need to overshare, desire to make impulsive decisions etc)   \n \n\n# Does that mean you can have similar effects as on meds without them?\n\nSort of. When I actually tried doing things requiring attention (programming) I noticed I couldn't fully focus for some reason. I had to force myself to focus, but I found myself reaching to do other things.  Surprisingly, I still was able to achieve some things, but it definitely came way harder than on meds.\n\n# Why did it even work in the first place?\n\nMy guess is, my body **did** start to produce norepinephrine/noradrenline (*oversimplification:* hormone that adhd meds supply us with) but on a level far from enough to actually help with adhd symptoms.\n\n# How did you find out you didn't actually take your dosage today?\n\nAfter some time of trying to code and get distracted, I started asking myself why am I so inattentive today. That's when I got the idea to count remaining pills in my blister and sure enough, there was one more pill than there should be.\n\n# Morale of this story?\n\nThe effect of placebo itself is strong, enough to even fool my own body; but it's not enough to replace proper medication. Far from it. So don't listen to anyone trying to fool you into some placebo therapy or something.\n\n# Why did you format your post like that lol\n\nCause I have ADHD. And you (most probably) do too. I first wrote it without this type of formatting, but then realized nobody would want to read that wall of text. Because I wouldn't want to read that.\n\nIt's funny how we can get tricked into reading a lot of text if it's just split into short paragraphs with big titles.\n\nAnyways my meds kicked in, I'll go work on my project now. I will reply to comments in either 5 minutes or 5 hours lol.",
        "created_utc": 1678345283,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling kind of lost right now...",
        "author": "Ill-Candy-4926",
        "url": "https://www.reddit.com/r/ADHD/comments/11mkwqc/feeling_kind_of_lost_right_now/",
        "text": "[removed]",
        "created_utc": 1678343242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall Dose Increase 25mg XR &gt; 30mg XR (Was this the right choice?)",
        "author": "Khetsu",
        "url": "https://www.reddit.com/r/ADHD/comments/11mkrcy/adderall_dose_increase_25mg_xr_30mg_xr_was_this/",
        "text": "I was prescribed 25mg XR for my first month last month. Things have been great, I been more efficient at work and have been getting a lot of my pirorities and responsibilities I needed to get done and also been really organized.\nI found that the 25mg for the month is really effective peffectly theough my work shift (8 hours) It starts to fade after that, and maybe lingers just long enough to get at least some things done after work. (Sometimes more if im just in the groove already and just getting things done) - If this matters, the things i needed to get done was a lot of organizing, tracking expenses, making appointments and dealing with financial debt.\nI think maybe I been trying to be unrealistic and include my Writing and Content creation into the day, so I told my provider that it wasn’t lasting long enough for my personal goals. \nMaybe once i got all these responsibilities out of the way it wouldve been perfect for me to focus on my personal goals after.\n\nJust ended my first day on 30mg XR\nAnd I’m having a bit of trouble sleeping the first night.\nOddly enough i feel like i was less productive after work, but i did feel mentally drained so i chalked it up to that for now. Work shift was still efficient per usual like the 25mg.\nIs the 30mg XR too much for me? Is it too early to say? Also i been getting slight headaches in the front right side of my head. Not every day but definitely once in a little while.",
        "created_utc": 1678342741,
        "upvote_ratio": 1.0
    },
    {
        "title": "SSRIs after stimulants?",
        "author": "Fun-Wear9615",
        "url": "https://www.reddit.com/r/ADHD/comments/11mke5i/ssris_after_stimulants/",
        "text": "Hi, currently on 20mg XR and celexa for well managed agoraphobia/ anxiety.\n\nUsually take both meds after a hearty breakfast and sip on coffee after per docs recommendation.\n\nI get a solid 9 hours of productivity from the XR from when it kicks in. \n\nRecently tried taking the Celexa one hour before the adderrall wears off and the results are great!! I feel so much less “burnt out” at the end of the day after a bunch of work.\n\nAnxiety was super minimal during the day, too.\n\nAnyone else experience this?",
        "created_utc": 1678341555,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if I have the right therapist for me?",
        "author": "comrade_frost",
        "url": "https://www.reddit.com/r/ADHD/comments/11mkdj5/how_do_i_know_if_i_have_the_right_therapist_for_me/",
        "text": "Hey everyone, I am stuck in a bit of a situation here. The thing is I was diagnosed with adhd-pi recently. It's been a few months and I am on medication and therapy. \nI have a professional therapist who is trained in dealing with adhd. Or so I thought. The medicine has been helping, but the problem is that I focus on the wrong thing. I should have been focusing on my upcoming exams but instead I focused on other completely irrelevant things like manga, comics and novels stories. I love to lose myself in the fantasy world. But I am not a kid anymore. I am 21(f) studying engineering. I should be able to control myself. I have already failed a year and am currently repeating. I failed not because I couldn't study, but simply because I didn't study. \n\nIt wa COVID time and we had a long holiday. So I was procrastinating until finals when I suddenly had a breakdown. Which lead me to consult a psychiatrist who diagnosed me with adhd. She said I had quite severe adhd. We got on medication and it was going fine, good actually until again study holidays came and again I kept running away and procrastinating studying. \nI kept losing myself in fantasy world in novels. I kept thinking I will do it. I have been through worse. I can pull through. But apparently not, because the next morning I ran away from college. I skipped. It was getting too suffocating. Seeing the other students discussing doubts was like a flashback to what had happened previously when I failed. I had promised myself it would never happen again. But I am too much of a fuck up even to myself. \n\nThe worst part in all of this is my parents. They are incredible and have been highly supportive all along the way. But I lied to them that I wrote my exam when in reality I didn't. I didn't want to see the disappointment and anger in their faces so I didn't tell them. Because of all these years of coping mechanism, I have become a very good lier. \n\nWhen this process of procrastination was happening again, I had contacted my therapist via message and asked her advice. But she gave me a very generic advice on how I can do it and all I had to do was I had to put my phone down. \n\nThe problem is that after I rejoined college to repeat the year, I couldn't meet up with my therapist because of my busy schedule. However I did ask her to change my time slot so that we can have regular sessions every week. But it felt like she had no more interest in helping me anymore. All of a sudden, my therapist no longer contacted me, never steeped forward to remind me or to even reschedule any session which I might have missed. \nI made sure not to miss sessions with her. It was she who misses sessions because she was very busy and had all slots booked. While I understood that and tried to be accomodating, but after almost 2 months with scarcely any session, I started to feel like my therapist might not even be interested anymore. \n\nI know that therapist have their own life and their own problems, but I can only be accommodating for so long. Each time a session was scheduled, my therapist either has an emergency, or she was travelling or outside stuck in traffic due to which sessions had to be cancelled. These could be genuine reason and at that time even I didn't pay that much attention because I was doing fine in college. \n\nIt was only after another incident that I described earlier that I realised I wasnt doing well at all. I only had been ignoring my problems, thinking that adhd was gone now. Thinking if I just had my meds and my college schedule O could ace it.\n\nBut ofcourse I didn't. The few sessions that I did have with her, it didn't seem as though she genuinely wanted to understand. Maybe it was also my fault because I told her that everything is going fine now. \n\nBut in the times O told her that it's not, she just gave very generic advice like \"Just keep you phone away, don't look at it\" or she kept repeating her advice that given in the previous sessions. \nHonestly, I felt like I took nothing away from those sessions. I didn't find them useful. I thought I would give it time and maybe it will get better. \n\nBut just yesterday after my breakdown i messaged her asking for free slots , I had been messaging her earlier about my anxiety issues and how I have been procrastinating all the time. Most of the time she ignored my messages. It was okay tho, because even therapist are busy and shouldn't have to dela with their clients on their free hours. \n\nBut even thought I knew and she also knew that I was so close to crashing with the high speed bullet train again, so close to breakdown, she never reached out or scheduled a session. When I did ask, she only gave me an answer saying that all her slots are booked. \n\nI just wanted to know if I have the right therapist or should I change?",
        "created_utc": 1678341499,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first week on meds has been such a roller coaster I don't know what to think. Please fix me Reddit, ty",
        "author": "Zaskoes",
        "url": "https://www.reddit.com/r/ADHD/comments/11mkag8/my_first_week_on_meds_has_been_such_a_roller/",
        "text": "Diagnosed with ADHD just over a week ago, and my psychiatrist was horrible. He said “you have ADHD” and handed me aspen dex 5mg after about an hour of questions about me. I wasn’t warned what the drugs would be like, what to expect, what the plan is, what my backup plan is, what are short-term goals with the drugs are, and what the long-term could look like, nothing. I walked out of the office excited to finally get rid of the “brain fog and absurd lack of emotional control” as the only thing he did say is “it will be like night/day”.  I was instructed to do the following: have one 5mg every morning for a week, after that week, 1 tablet in the morning followed by 1 tablet in the afternoon at 8 am and then again at 1)    \n\nSo as expected I was so excited to get to work and try out my new ‘day/night difference in life’... Took the dex at 8:15, got to work, and got straight to work typing away and holding great conversations with my boss about shit I normally couldn’t no matter how hard I tried. I did not feel anything at all at the time, actually felt completely normal but I had no brain fog and was completely capable, of focusing on my tasks at hand without getting all restless and bored (in my case opening a game of bullet chess every 3 minutes). 9-11 that day was perfect and I was glad I found a drug that works for me so quickly. \n\n**THE BAD:** \n\nThat effect made my life feel perfectly normal for about 2 hours, it was insane truly. But from 11-3, all my ADHD symptoms were back and getting worse by the hour. 5 o'clock rolled by and I was almost in tears over nothing (I'm one of those males that either bottle up emotions or show them in anger and haven't cried in years) accept it wasn't over nothing because I was in such a depressive state it made sense for me to cry. I had so little dopamine in me that I was glued to my office chair at home unable to move for about 4-5 hours while I sat there completely miserable. bottom line is that for 2 hours I felt cool and normal, chill-minded, easily focusing on my work and talking about things but then for the next 8 hours I was in a crippling depression I was NOT expecting at all.  \n\nThe following day I was terrified of the drug but pursued it as I was told it would get better, I didn't feel focused in the morning, I couldn't clear my mind off the fog, and I felt maybe 10% more focused but then again that was me HOPING for results, I still crashed though. The second night was about 70% of the first night but with 10% of the benefits... So I'm losing it, I went to sleep completely depressed and questioning why my doctor is teasing my brain with under-medication, and why my doctor WANTS me to crash mid-day and feel like shit for the rest of my time.  \n\nOn my third day, I literally told my misses I feel like an unmedicated ADHD person, the meds did nothing, zero effect at all. The crash was 40% of the first one.. I said ah enough is enough I'm emailing this man and asking him what to do. I sent an email along the lines of 'I can't crash 2 hours into my work day\" and explained my first 3 days in detail. I got nothing in return and eventually came the weekend where I said fuck it, I had the plan to do some art with a mate so I decided to see what would happen if I took 10mg first thing in the morning to self-gauge whether I am under medicated. The results of that were my first headrush ever cause I don't smoke or do drugs, followed by 4 hours of drawing tiny little details on something I normally get bored of so fast (once it stopped being my hyper fixation). I felt like I actually was on drugs so I had a laugh and said ok at least now I know what happens and ill talk to my doctor once he eventually gets back to me about being undermedicated. \n\nAt that point, a week was over so I decided to try 5mg in the morning and 5mg in the afternoon and it was a shitty result of being up a bit for 2 hours then down again for 2 hours followed by up less than the first time and down more than the first time. To put it simply, I hated it, it was shit. I emailed my doctor everything and got no response... I then decided to keep experimenting and tried to take it 45 minutes before I expected the crash, I used my first boost to help me figure out what a day of back-to-back dexies could look like and just said fuck it, and took it 4 times in one day, each one 45 minutes before the last one crashes... It was pretty perfect regarding smoothness, as for the effects I decided that 5mg wasn't nearly enough to get me to the dopamine baseline of a normal person. If I was doing something boring id still be so bored and foggy, but the second I was locked into a hectic conversation or something I enjoy, I felt like a god. Good, but what's the point, I would get that feeling with my random hyper-fixations anyways. I want the symptoms to go away even when I'm doing something boring.\n\nI emailed my doctor for a third time with all my findings, and I got a 2-minute call from him saying he E-Scribed me to Vyvanse 30mg and to have it every morning, he didn't want to answer any of my questions and rushed to hang up so I ended up calling my local GP and finding a doctor who I can actually build a relationship with and knows stuff about the drugs they prescribe me.   \n\nYesterday I took my first dosage of Vyvanse at 8:00 am and I felt clear-minded, focused, and dedicated to doing things I normally couldn't, I sat down for 4 hours and wrote 2000 words about how I felt about some family drama going on just to put my thoughts on paper and keep them... More typing was done in that 4 hours than my entire schooling, it worked well, and it's a much slower up and down. I have the same issue but, the down doesn't stop, from 4:30 pm that day til 9:18 pm I crashed into such a dopamine-deprived depression, one comparable to my first day on dex. I once again was almost in tears at the thought of nothing at all, I couldn't move, I couldn't do anything. I couldn't even imagine touching a video game and I had my pc turned on right in front of me ready to go the whole time.  \n\nAs I'm writing this I am on day 2 of Vyvanse... I wasn't focused today, I wasn't locked in, I couldn't talk to anyone or process information easily and I couldn't read stuff without losing the information to my ADHD curse... It's 4:30 pm and I am expecting to crash beyond return but we shall see, should hopefully be 70% of yesterday lmao.  This is my fucked first week and so far I'd rather be scattered and unmedicated, but that isn't an option as I get older and get more responsibilities in life. Completely lost in what to expect and what to do with me from here onwards.",
        "created_utc": 1678341212,
        "upvote_ratio": 1.0
    },
    {
        "title": "People with ADHD need more break when doing Promodoro?",
        "author": "Accurate-Ad-6586",
        "url": "https://www.reddit.com/r/ADHD/comments/11mk4b1/people_with_adhd_need_more_break_when_doing/",
        "text": "[removed]",
        "created_utc": 1678340657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a screen time app",
        "author": "Jezarr",
        "url": "https://www.reddit.com/r/ADHD/comments/11mk3qc/looking_for_a_screen_time_app/",
        "text": "[removed]",
        "created_utc": 1678340601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have my first appt to get officially diagnosed.",
        "author": "new_fella",
        "url": "https://www.reddit.com/r/ADHD/comments/11mk2oy/have_my_first_appt_to_get_officially_diagnosed/",
        "text": "This has been a really long time coming since I'm now at 41. Been mentioned by so many teachers, therapists and doctors, but I've finally decided I need to do something about it. Recently I got normal, I'm not self-employed anymore, job, and there doesn't seem to be enough pressure/stress to mask all of my tendencies. (It's so hard to \"make\" myself stay in task without imminent consequences lol) Anyone else experienced this.. could use some talking points for this appointment if anyone could help? Appointment is in a month",
        "created_utc": 1678340506,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might have ADHD",
        "author": "InternationalMud3472",
        "url": "https://www.reddit.com/r/ADHD/comments/11mjt2a/i_think_i_might_have_adhd/",
        "text": "[removed]",
        "created_utc": 1678339653,
        "upvote_ratio": 1.0
    },
    {
        "title": "BEWARE of Circle Medical (Virtual ADHD Consult)",
        "author": "potatodrank",
        "url": "https://www.reddit.com/r/ADHD/comments/11mjnuz/beware_of_circle_medical_virtual_adhd_consult/",
        "text": "[removed]",
        "created_utc": 1678339185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a life coach/counselor worth getting?",
        "author": "honeyfixit",
        "url": "https://www.reddit.com/r/ADHD/comments/11mjjek/is_a_life_coachcounselor_worth_getting/",
        "text": "Lately I've been struggling with my ADHD.  My stress level is extremely high. I feel like I'm supposed to know what to do but I can't figure it out.  I've heard that some people have had success with a life coach or counselor to help them organize their life.  I was wondering about the experiences people on this sub have had with that or something similar.  Any advice good or bad is welcome.",
        "created_utc": 1678338798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing to get medications for ADHD ruined my life. Never again",
        "author": "FaruinPeru",
        "url": "https://www.reddit.com/r/ADHD/comments/11mjjbv/choosing_to_get_medications_for_adhd_ruined_my/",
        "text": "Let me explain, I (22F) started Vyvanse &amp; man oh man, life has been hellish when it comes to the suppressing of appetite. My Dr warned me about this side effect but I continued. It couldn’t be that bad, right? Its been 2 weeks. I went from eating 2500 calories a day, a good 3 full meals, to half a meal a day… I always struggled with weight because of my petite figure but after many years, I started hitting the gym, forced myself to eat a lot and saw such a difference. I built my dream figure and couldn’t be happier. !!!!\n\nNow… I can barely get in a meal without gagging. Been up for about 16 hours and whole day all I ate is some fries and thats it. I feel like I am going back to my old version who would gag at the thought of food. I’d rather have bad adhd symptoms then starve to death. My stomach is eating itself i am starving but eating makes me gag. \n\nNote- I started off with 10mg, then 20 then 30, i hate them all.",
        "created_utc": 1678338792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyday feels foggy",
        "author": "attackingkat",
        "url": "https://www.reddit.com/r/ADHD/comments/11mjb31/everyday_feels_foggy/",
        "text": "Growing up, I've never really been observant. It seems like I'm stuck in my own thoughts 24/7. I barely even notice changes in things like people's hair and wardrobe; this is quite embarrassing when I finally do take notice and compliment them months later. I also have extreme trouble remembering people's faces. It turns out that I've met my current best friends five times prior to us actually forming a friendship and I was completely unaware. This has happened many times with other people. I also have an extremely hard time recalling conversations and remembering what people have told me. Basically, i have a shit memory. It feels like I'm just kind of passing through life with cotton in my head. \n\nIs there anything I can do to fix this? Also, how can I improve my memory? I really need to focus on self-improvement, but i dont know how nor where to start :(",
        "created_utc": 1678338091,
        "upvote_ratio": 1.0
    },
    {
        "title": "My hacks for getting out of bed in the morning (and staying out)",
        "author": "meqqhan",
        "url": "https://www.reddit.com/r/ADHD/comments/11mirsj/my_hacks_for_getting_out_of_bed_in_the_morning/",
        "text": "Drink a huge glass of water. That's literally it. When I wake up I need to go pee right away. I either have two options: Piss the bed or go piss.\n\n&amp;#x200B;\n\nAll jokes aside this really helps, along with setting your phone/alarm in your bathroom if you have an en-suite. Lemme know if you guys have tried anything similar!",
        "created_utc": 1678336503,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your exercise hack?",
        "author": "Virtual-Bandicoot-91",
        "url": "https://www.reddit.com/r/ADHD/comments/11mioy0/whats_your_exercise_hack/",
        "text": "Exercise does not give me an endorphin rush. No matter the type or the intensity or the environment.\n\nExercise, when done consistently, does help me feel my best physically.\n\nMy body needs exercise, but it doesn’t bring me any form of joy while I’m doing it. It is tremendously hard for me to overcome that psychological hurdle.\n\nI know there are “just do it” people out there. But when you have ADHD, it’s a little (okay a lot) more complicated than that.\n\nSo … for those of you who KNOW the ADHD paralysis of not being able to do something that feels draining, and that draining thing is exercise,\n\nhow do you overcome it?\n\nPS: I’m a fat positive person and very aware of ED triggers, so please refrain from referencing weight loss content in your replies, even if it’s been part of your story, because that can be triggering for others.",
        "created_utc": 1678336266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Similar experience?",
        "author": "Dry-Earth6976",
        "url": "https://www.reddit.com/r/ADHD/comments/11min1k/similar_experience/",
        "text": "I took 10mg of adderall today to help me clean a little (I’d normally take 40mg a day of the non extended release and do 20mg in two sittings and I’m pretty sure the dosage needed to be increased because my adhd is that bad and this is my first time taking it in over a year I think about two) but I’m wondering if it’s at all safe to drink any amount. I have a healthy heart and drink a lot of water. From what I’ve read you just have to know your limit and not drink too much because you don’t feel the effects of the actual drunkenness that much. Does anyone have any personal or friends with experience in this specific thing?",
        "created_utc": 1678336107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Share your struggles",
        "author": "SheWhoMusntBNamed",
        "url": "https://www.reddit.com/r/ADHD/comments/11mihys/share_your_struggles/",
        "text": "For me, ADHD is…replaying a video or audio clip multiples times from the same point because I got distracted/bored/zoned out 🙈\n\nIt’s also realizing like two minutes later that someone may have said something to me but I have no idea what it is because I was completely elsewhere.\n\nI don’t know how common this is but I also sometimes ask someone to repeat something but before they’ve finished it’s like my brain finally catches back up and I realise I’d heard them after all.\n\nI did these things for so many years not realizing it may have been adhd because I always associated it with being hyperactive and only became aware in my university years that inattentive type was a thing after which I brought it to the counselor’s attention and she told me my grades were too good for me to have it 🙄\nAnyway here I am finally being diagnosed like 5 years later after it started to affect work and led to anxiety attacks 🤦🏽‍♀️ Better late than never though \n\nWhat’s ADHD for you? Share your experiences",
        "created_utc": 1678335682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who would I have been like if I didn't have ADHD?",
        "author": "pancakedad",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi7wp/who_would_i_have_been_like_if_i_didnt_have_adhd/",
        "text": "A personal example:\nI got my performance review this week. Standard procedure every year. You're told what you excel in and what you can improve upon. I was told I did an amazing job and was a valuable asset. When it came along to my improvements, the feedback was all that I expected. \n\n- Need to listen more\n- Read the room\n- Don't get caught up in the details\n- Learn to manage timelines\n\nAll that I agree with 100%, and honestly predicted it. I wonder, what would have been my improvements if I didn't have ADHD? Would it have been the same?\n\nWhat about you?",
        "created_utc": 1678334862,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is probably the hardest for me to overcome",
        "author": "zuumbawbwe",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi7to/this_is_probably_the_hardest_for_me_to_overcome/",
        "text": "I have a problem I don’t seem to be able to solve alone. I don’t even know if this is the right subreddit for this, but adhd runs in my family and I do suspect this might be a symptom of some sort. If not, I apologize. Here goes my suffering: It‘s almost 5am now and I am tired af, but still I find ways not to go to sleep. This has been a habit for years and I can‘t think of a way to make me go to sleep earlier. It is very easy to stay up a little longer every day until it is 5am like now or even later. Ending a day and committing to sleeping is probably the hardest habit for me. I always find ways to sabotage myself  distracting myself from sleep and I hate it but it still happens almost every day. I feel like I have no sense of self control as if the decision to go to bed was not even a possibility. I just stay awake until I am so tired my eyes start hurting and my body gives me the strong indication that it is time to let go. People say to me „just sleep earlier“ and yeah, in theory this sounds so easy and obvious, but I somehow manage to fuck it up day by day. Does anyone have any tips, tricks, methods, life hacks, strategies, mindsets or experiences that might help me with this? It becomes a real issue for me when I am unable to function the next day, miss appointments etc. I really wanna get the grip on this. Will finally sleep now and put my phone away but this post had to be. \n\nThank you all in advance!",
        "created_utc": 1678334855,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner isn’t being a good partner.",
        "author": "Signal-Carpenter2484",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi4lu/my_partner_isnt_being_a_good_partner/",
        "text": "The best way for me to stay focused or even focus on trying to relax is a clean home. \nBut, The only thing my wife does is pay half the bills and dishes. \n\nI work full time, go to school full time, take care of the dogs, cats, chickens, I cook and I clean. \nI come home and need to study but I can’t until I can get the house in order, this includes at the minimum, cleaning the kitchen(this is wear my “office”s is, vacuuming floors(dog door and lots of dead grass this time of year) and starting laundry. \nAnd then I can begin working. \n\nBut this routine of having to work then go to school then constantly clean and take care of the pets . . .\n\nI am so exhausted that I just want to give up. \n\nI’m so incredibly angry at the lack of help even when I ask. I ask nicely, I try lists, I try schedules. I’ve pleaded with her. I don’t know what to do anymore.",
        "created_utc": 1678334586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Claustrophobia-friendly weighted blanket recommendations?",
        "author": "VisualIndependence95",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi4l1/claustrophobiafriendly_weighted_blanket/",
        "text": "I sort of wrote off weighted blankets for anxiety because I am suuuper claustrophobic (like, I have before gotten panicky over too-tight mining levels in video games), but I was sort of surprised today at the dentist when the weighted x-ray vest actually seemed to be really good for my anxiety and general sensory stuff. I’ve seen weighted vests/hoodies/jackets online, but I’m not sure what would be most effective. As far as I’m aware, basically as long as I can breathe and my limbs are free to move, I’m good. Does anyone else with sensory issues have suggestions for something like this?",
        "created_utc": 1678334584,
        "upvote_ratio": 1.0
    },
    {
        "title": "I forgot that I applied to grad school &amp; made plans to move across the country. I got accepted and enrolled but now I’m not sure what to do between the fall and now",
        "author": "EnvironmentalEbb1346",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi4k7/i_forgot_that_i_applied_to_grad_school_made_plans/",
        "text": "[removed]",
        "created_utc": 1678334582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me buy LAURA MODEL 10",
        "author": "cobra_topg",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi3gx/help_me_buy_laura_model_10/",
        "text": "[removed]",
        "created_utc": 1678334498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall makes me sleepy now?",
        "author": "Ok_Wind6868",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi2nd/adderall_makes_me_sleepy_now/",
        "text": "Just wondering if anyone else has experienced this lately. But thanks to the shortage I was off of my meds (Adderall XR 30 mg) for about a month. Luckily I was finally able to find a pharmacy that had it in stock, but for some reason it makes me extremely sleepy/calm/slow?. \n\nFor context I used to take Prasco brand generic adderall, and I’m currently taking Sandoz brand generic. I mean they’re pretty much the same thing right? Both are the authorized generic.",
        "created_utc": 1678334445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rejection and humiliation",
        "author": "zackeatos",
        "url": "https://www.reddit.com/r/ADHD/comments/11mi1i9/rejection_and_humiliation/",
        "text": " Already posted about my anxiety yesterday.\n\nGot humiliated and rejected in the worst possible way today! I finally approached the girl i like and said hi, I was nervous as hell, she and her friends noticed it, she told me she is in hurry to go gym, her friends were rushing her, this is made me more nervous, i said to her, i think you are pretty and if you would like to hang out tomorrow, she thought about it for a second and told me she is busy tomorrow, i asked how about later, she just kept saying she is busy, so i told her if i can get her number, she said she doesn’t remember it, then one of her friends grabbed my phone and typed a fake number (didn’t know by then) i said i will give her a call, then they walked away, was so happy, went back home and i tried to WhatsApp her, but the number has no WhatsApp. I felt broken and took it as rejection. Then I thought she maybe shy or nervous too and i should be brave and give it another chance.\n\ni met her by accident with her same friends, her friends were rushing her again as soon as they see me, and gently touched her shoulder in back, then she gave me that’s look just like I’m sex offender so, she told me to not touch her. I just said sorry and walked away feeling like a criminal. I didn’t mean too, i was just tired of being afraid, i tried to be brave for once in my life and turned out I’m a real creep and sick guy just didn’t know it. I will never talk to another girl any more again. And most importantly, i should be away from people.\n\nNever felt or experienced something like this in my whole life.\n\nI already hate myself, and Now I hate myself even more.",
        "created_utc": 1678334362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can ADHD meds help non ADHD people focus?",
        "author": "Optimal-Depth-1546",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhvz6/can_adhd_meds_help_non_adhd_people_focus/",
        "text": "For the last while ive been paying more attention to the fact that I could have ADHD, as many of my friends and people I have spoken to who have been diagnosed with ADHD say that I show many red flags. My friend got a Vyvanse prescription, and he let me try it once as I had concerns of me having ADHD, so I took 20mg of it in the morning. Upon trying it, it felt strange but I was able to concentrate all of my energy into a specific task and my thoughts that I would normally think just stopped and I could actually zone in and concentrate on something. I was wondering this information could be utilized to hint at the chance I have ADHD or if this is useless and doesn't mean anything.\n\nThanks.",
        "created_utc": 1678333898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Home automation is bringing me so much relief",
        "author": "Dcellular",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhu4c/home_automation_is_bringing_me_so_much_relief/",
        "text": "I've been using Home Assistant for a few years to automate lights and window treatments and generally try to make menial tasks easier for me to deal with by not having to remember them or by automating them. I have plant sensors that monitor soil health and remind me to water them, window and door sensors that alert me when I've left a window open when I leave the house, door locks that automatically lock in case I forget, an automation that runs at 1:50 every afternoon that asks if I want to make coffee and will heat up my espresso machine if I tap \"yes\". \n\nMy greatest success in automation finally came together. I've been buying cheap broken robot vacuums on Craigslist and Ebay and adding them into Home Assistant to clean my house when I'm not home. My house has lots of steps/levels that separate every room which makes owning 1 vacuum not effective to clean my house. So I went as cheap as possible by getting broken ones and repairing them and ended up with 5 vacuums total. I added them all to Home Assistant and created an automation that uses my phone for presence detection and will trigger all vacuums to start once it detects I'm more than 1 block away. If I go on a short dog walk, the presence detection will trigger at the 1 block geofence and send them a command to return to the dock before I enter the house. I literally never see them except for when I empty them on trash day every week and my floors are clean and free of pet hair all the time. It's also forced me to not leave anything on the floor.  \n\n&amp;nbsp;\n\nI saw the post about hiring a house cleaner and it inspired me to write this.",
        "created_utc": 1678333750,
        "upvote_ratio": 1.0
    },
    {
        "title": "I guess I'm fucked",
        "author": "Crashmittensickle",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhsr1/i_guess_im_fucked/",
        "text": "My doctor won't prescribe me any ADHD meds because they fear meds would trigger schizophrenia or some other serious mental illness. So now I'm officially stuck with ADHD, without any means to improve my concentration and time management. I don't think I can take up any routine or try different approaches to life, since I get bored immediately in all kinds of things.\n\nSo in this situation, it's impossible to manage my time, concentrate on studies (that really require concentration and effort from me), keep my home clean and improve as a person. I feel like not getting meds has doomed me. I don't know how to live the rest of my life without meds while strugling with ADHD every goddamn day. It's just so unfair. Right now my life is a mess and I don't know how to put everything in my life in a working order.",
        "created_utc": 1678333636,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time methylphenidate 10mg XL",
        "author": "CoffeeSlutNext",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhqne/first_time_methylphenidate_10mg_xl/",
        "text": "So I was started on Vyvanse 20mg but had a bad reaction to it and ended up in the ER. So we decided that I should stay away from methamphetamines. \n\nFor generic Concerta basically I’m on 10mg we’ll move me up to 20 next week if no side effects. I took 10mg and felt almost nothing, I felt slightly tired which is when I knew it kicked in. I had an increase in anger and agitation if I focused on things that upset me. I also focus on the weirdest things, but not much else, the Vyvanse 20mg had a much stronger reaction when I was on it before the ER incident. \n\nI’m pretty sure it’s bc 10mg is too low a dose. But any advice on things to watch out for with methylphenidate and help with dealing with side effects would be appreciated :)",
        "created_utc": 1678333470,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD as a result of a physical issue with brain",
        "author": "raincoat_bubblegum22",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhkpl/adhd_as_a_result_of_a_physical_issue_with_brain/",
        "text": "I have a large lesion/calcification on my brain that extends over the sylvian fissure and affects both my right frontal lobe and temporal lobe. It is a result of having a congenital arterial malformation in my brain. I was diagnosed with this at 33, along with epilepsy. When I told my psych med manager, she was like “oh this all makes so much sense” lol. I’ve struggled with ADHD, anxiety, depression, etc. for most of my life, and I guess it’s because of the lesion and the specific area of the brain it is locate. \n\nI’m just curious if anyone else has ADHD as a result of a physical issue. I’d never really thought of that before my lesion diagnosis.",
        "created_utc": 1678332981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall and your age: Can you be too old to take it?",
        "author": "Interesting-Iron-229",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhinu/adderall_and_your_age_can_you_be_too_old_to_take/",
        "text": "I have jumped through all the hoops of evaluation and diagnosis most recently 2 years ago, and have had PsychAtlanta group to dispense and regulate medication, with appointments every 3 months, when the 90-day supply is due for refill.  All of this went well until my insurance carrier changed.  The office sent an Rx to the new mail-order per UHC and it was rejected b/c they specified a generic  that the Optum didn't do business with. In the ensuing dialogs, I was willing to go to any provider, for a 30-day supply at least.   But PsychAtlanta was unresponsive for weeks.  I was out of all the halves and crumbs of meds, which I know is considered illegal to retain or use not within the prescribed regimen. (I would save a pill here and there if I were planning a wine with dinner event;).(Or sometimes ADHD just forgets)\n\nMy PCP is very cautious.  She  forced the current diagnosis (2 yr ago /$1600+ to comply).  I was hoping she would grant me a 30-day supply now.   She said that she was worried that the PsychAtlanta was medicating me at an age that would be not compliant with good practice.  I had never heard of that before.  I have had to provide records of heart-rate, activity, all types of records from my cardiologist- BP, Echo-cardiogram, etc.  She also does stress test. \n\nQuestion: Is everybody giving me my hat because I just turned 80 years old?  I still function as a musician, arranger, director, and organist daily and weekly, in addition to having a \"patient\" for a husband with daily meals and meds.  I have complied with all the amphetamine regulations - except for squirreling meds that should have been taken.  I possess them and use them myself when times are tough.  \n\nI have such a searching question because of what seems to be resistance to treating adult ADHD as a deficiency...It seems to have so many restrictions that are misplaced.     I am not obese. I am not addicted. I have never felt any euphoria from taking Adderall.  I had the feeling that fog has lifted and I can see more clearly and get about my business again, when I had been feeling that I didn't know what to tackle next.  \n\nI know that the amphetamines have been abused.  But why punish the people who are innocent? Is there any physician to turn to who will understand?",
        "created_utc": 1678332826,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Time on 5 mg Methylphenidate IR",
        "author": "Intelligent_Hat4608",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhhd1/first_time_on_5_mg_methylphenidate_ir/",
        "text": "I 24 (M) been seeing my psychiatrist for 7 months now for depression. On my first visit I ended up being diagnosed with depression and anxiety, which was a shocker.\n\nNow I am being diagnosed with ADHD-PI.\n\nHas anyone ever started on Methylphenidate IR 5 mg once daily?\n\nI took it today for the first time and I felt sleepy after an hour.",
        "created_utc": 1678332729,
        "upvote_ratio": 1.0
    },
    {
        "title": "To the teacher who wanted to hold me back in 6th because I would \"never pass high school\"...",
        "author": "futuretherapist1",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhgva/to_the_teacher_who_wanted_to_hold_me_back_in_6th/",
        "text": "I'm graduating with my Master's degree in 2 months. :) \n\n(Quick note: don't compare yourself to me. We are all on our own journey, and success isn't defined as solely a diploma. There are many types of accomplishments worth celebrating (and even aspects of ourselves that are unrelated to what we've achieved))",
        "created_utc": 1678332692,
        "upvote_ratio": 1.0
    },
    {
        "title": "i​ h​av​e ​pr​ob​le​ma​ti​c ​hy​pe​rf​ix​at​io​ns​ a​nd​ i​ d​on​'t​ k​no​w ​wh​at​ t​o ​do",
        "author": "RedSlimeballYT",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhgij/i_have_problematic_hyperfixations_and_i_dont_know/",
        "text": "h​as​ a​ny​on​e ​el​se​ e​ve​r ​de​al​t ​wi​th​ p​ro​bl​em​at​ic​ h​yp​er​fi​xa​ti​on​s ​li​ke​ h​yp​er​fi​xa​ti​ng​ o​n ​so​me​ d​ar​k ​an​d ​de​pr​av​ed​ h​is​to​ri​ca​l ​ev​en​t ​an​d ​yo​u ​ca​n'​t ​ge​t ​it​ o​ut​ o​f ​yo​ur​ m​in​d ​no​ m​at​te​r ​wh​at​ a​nd​ y​ou​ k​ee​p ​im​pu​ls​iv​el​y ​ma​ki​ng​ d​ar​k ​jo​ke​s ​ab​ou​t ​it​ a​nd​ j​ok​in​gl​y ​do​in​g ​ac​ti​on​s ​as​so​ci​at​ed​ w​it​h ​it​ a​nd​ y​ou​ j​us​t ​fe​el​ s​el​f ​ha​te​ b​ec​au​se​ i​t'​s ​a ​hy​pe​rf​ix​at​io​n ​th​at​ w​on​'t​ g​o ​aw​ay​ b​ut​ y​ou​ k​no​w ​it​'s​ b​ad​\n\nf​or​ t​he​ p​as​t ​fe​w ​mo​nt​hs​ u​nt​il​ n​ow​ (​it​ w​or​se​ne​d ​un​ti​l ​no​w)​ i​'v​e ​be​en​ s​tr​ug​gl​in​g ​wi​th​ a​ r​ea​ll​y ​ba​d ​hy​pe​rf​ix​at​io​n ​th​at​ i​ r​ea​ll​y ​sh​ou​ld​n'​t ​be​ h​yp​er​fi​xa​ti​ng​ o​n ​(i​t ​to​ok​ m​e ​a ​wh​il​e ​to​ r​ea​li​ze​ i​t ​wa​s ​a ​hy​pe​rf​ix​at​io​n ​be​ca​us​e ​i ​ke​ep​ m​ak​in​g ​jo​ke​s ​ab​ou​t ​it​ a​nd​ i​ j​us​t ​ha​pp​en​ t​o ​kn​ow​ a​ b​un​ch​ o​f ​fa​ct​s ​ab​ou​t ​it​ a​nd​ e​ve​ry​ti​me​ i​ s​ee​ a​ny​ r​ef​er​en​ce​ t​o ​it​ i​ j​us​t ​no​ti​ce​ i​t ​an​d ​im​pu​ls​iv​el​y ​go​ \"​OH​ M​Y ​GO​D ​IT​'S​ T​HE​ (​ba​d ​pr​ob​le​ma​ti​c ​th​in​gy​)\"​ a​nd​ i​ j​us​t ​do​n'​t ​kn​ow​ h​ow​ t​o ​st​op​ i​t\n\n​i'​ve​ c​ri​ed​ i​n ​be​d ​ti​me​ a​nd​ t​im​e ​ag​ai​n ​be​ca​us​e ​of​ i​t,​ l​ik​e ​at​ s​ch​oo​l ​i ​ju​st​ s​ub​tl​y ​do​ t​hi​ng​s ​re​la​te​d ​to​ i​t ​bu​t ​no​t ​di​re​ct​ly​ (​i ​te​nd​ t​o ​fe​el​ l​ik​e ​a ​di​ff​er​en​t ​pe​rs​on​ a​t ​sc​ho​ol​ s​in​ce​ i​ h​av​e ​to​ t​ie​ m​y ​ha​ir​ a​nd​ w​ea​r ​my​ u​ni​fo​rm​ a​nd​ s​tu​ff​ s​in​ce​ i​ g​ue​ss​ c​lo​th​in​g ​af​fe​ct​s ​my​ p​er​so​na​li​ty​??​? ​bu​t ​th​at​'s​ j​us​t ​a ​th​eo​ry​ i​ g​ue​ss​) ​an​d ​i ​ha​ve​ t​he​ u​rg​e ​to​ m​ak​e ​jo​ke​s ​ab​ou​t ​it​ l​ik​e ​it​ j​us​t ​bu​il​ds​ u​p ​in​si​de​ o​f ​me​ a​nd​ i​ j​us​t ​ha​ve​ t​o ​re​le​as​e ​it​\n\n​(a​nd​ i​ a​po​lo​gi​ze​ i​f ​th​is​ i​sn​'t​ w​el​l ​ar​ti​cu​la​te​d,​ b​ut​ p​le​as​e ​ju​st​ u​nd​er​st​an​d ​th​at​ m​y ​mo​m'​s ​ov​er​pr​ot​ec​ti​ve​ e​ve​r ​si​nc​e ​tw​o ​of​ m​y ​si​bl​in​gs​ d​ie​d ​wh​en​ i​ w​as​ a​ f​ew​ y​ea​rs​ o​ld​, ​an​d ​my​ c​ur​re​nt​ y​ou​ng​er​ s​is​te​r ​ha​s ​le​ig​h ​sy​nd​ro​me​ w​hi​ch​ i​s ​a ​mi​to​ch​on​dr​ia​l ​di​se​as​e,​ a​nd​ b​ec​au​se​ o​f ​th​at​ a​nd​ a​ls​o ​si​nc​e ​co​vi​d ​ha​pp​en​ed​ m​y ​mo​m ​is​ o​ve​rp​ro​te​ct​iv​e ​so​ i​ve​ n​ev​er​ r​ea​ll​y ​ha​d ​th​e ​pr​op​er​ c​hi​ld​ho​od​ t​o ​de​ve​lo​p ​so​ci​al​ s​ki​ll​s ​to​ t​al​k ​to​ o​th​er​s,​ a​nd​ i​ w​as​ k​in​d ​of​ j​us​t ​bo​rn​ a​n ​ip​ad​ b​ab​y ​(w​el​l ​te​ch​ni​ca​ll​y ​i ​us​ed​ a​n ​an​dr​oi​d ​no​t ​an​ i​pa​d ​bu​t ​st​il​l)​ a​nd​ i​ve​ u​se​d ​th​e ​in​te​rn​et​ a​ l​ot​ a​nd​ b​ec​au​se​ o​f ​th​at​ i​ o​nl​y ​re​al​ly​ h​av​e ​th​e ​in​te​rn​et​ t​o ​ta​lk​ t​o ​ot​he​rs​ o​ft​en​ a​nd​ i​ve​ b​ee​n ​sh​un​ne​d ​a ​sh​it​ t​on​ f​or​ t​al​ki​ng​ i​n ​th​e ​wr​on​ge​st​ o​f ​pl​ac​es​, ​i'​ve​ b​ee​n ​ba​nn​ed​ f​ro​m ​se​ve​ra​l ​se​rv​er​s ​on​ d​is​co​rd​ f​or​ b​ei​ng​ i​mm​at​ur​e ​wh​en​ r​ea​ll​y ​i ​ju​st​ h​av​e ​no​ s​oc​ia​l ​sk​il​ls​, ​an​d ​i ​ju​st​ w​an​t ​yo​u ​to​ u​nd​er​st​an​d ​wh​y,​ t​hi​s ​is​ w​hy​ i​'m​ r​am​bl​in​g ​ab​ou​t ​my​ l​if​e ​st​or​y ​so​ y​ou​ u​nd​er​st​an​d ​wh​y ​i ​am​ s​o ​ho​rr​ib​ly​ s​tu​pi​d ​at​ c​om​mu​ni​ca​ti​ng​, ​be​ca​us​e ​i ​ne​ve​r ​de​ve​lo​pe​d ​th​e ​sk​il​ls​ b​ec​au​se​ i​'v​e ​ne​ve​r ​ha​d ​be​en​ g​iv​en​ t​he​ o​pp​or​tu​ni​ty​ t​o,​ a​nd​ l​ea​rn​ h​ow​ t​o ​st​ru​ct​ur​e ​we​ll​ w​ha​t ​i'​m ​tr​yi​ng​ t​o ​sa​y)​\n\n​tl​;d​r ​i ​ha​ve​ a​ p​ro​bl​em​at​ic​ h​yp​er​fi​xa​ti​on​ w​it​h ​a ​sp​ec​if​ic​ r​ea​ll​y ​da​rk​ t​op​ic​ a​nd​ i​'v​e ​fe​lt​ a​ t​on​ o​f ​se​lf​ h​at​e,​ a​nd​ i​ a​po​lo​gi​ze​ i​f ​it​ i​sn​'t​ w​el​l ​sa​id​ b​ut​ j​us​t ​un​de​rs​ta​nd​ t​ha​t ​wh​en​ i​ w​as​ y​ou​ng​er​ i​'v​e ​ne​ve​r ​ha​d ​th​e ​op​po​rt​un​it​y ​to​ d​ev​el​op​ p​ro​pe​r ​so​ci​al​ s​ki​ll​s,​ i​ w​as​ t​ec​hn​ic​al​ly​ a​n ​ip​ad​ b​ab​y",
        "created_utc": 1678332668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something I’ve learnt with my therapist",
        "author": "Wonderful-Camera-722",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhg04/something_ive_learnt_with_my_therapist/",
        "text": "Hey so I just wanted to share something with you guys in case it may help. \n\nI’ve been struggling to get up in the mornings and just waste time on my phone. \n\nBut the one thing I always do is feed my dog. I love her and she is my responsibility. But I can’t do it for me. \n\nTalking with my therapist I thought it could have been my adhd playing the part but she said \n“if your dog is your responsibility, why aren’t you?”\n\nYes I’ve got a lot of childhood trauma but it came to realise that I was never a priority to anyone else. So that’s how I treated myself, no matter what I knew I had to do cook, clean or just going out. I couldn’t. \n\nIt isn’t fool proof and a lot of it is self love work, but making myself my responsibility because I deserve it has helped me do the things I need to do.. most times",
        "created_utc": 1678332628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Like Sleeping but Hate Going to Sleep",
        "author": "Worldly-Ease-1311",
        "url": "https://www.reddit.com/r/ADHD/comments/11mhf75/like_sleeping_but_hate_going_to_sleep/",
        "text": "I don't know if this happens to anyone else but I don't like going to sleep. It's like there's always something else to be thinking about, learning about, or doing. And the prospect of sleep just seems boring. I like being asleep and being rested though. I just have to force myself to do it. Is this just me or does it happen to anyone else?",
        "created_utc": 1678332570,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP -- How to not be a selfish conversationalist",
        "author": "imsooooootired",
        "url": "https://www.reddit.com/r/ADHD/comments/11mh89l/help_how_to_not_be_a_selfish_conversationalist/",
        "text": "[removed]",
        "created_utc": 1678332030,
        "upvote_ratio": 1.0
    },
    {
        "title": "i have problematic hyperfixations and i don't know what to do",
        "author": "RedSlimeballYT",
        "url": "https://www.reddit.com/r/ADHD/comments/11mh635/i_have_problematic_hyperfixations_and_i_dont_know/",
        "text": "[removed]",
        "created_utc": 1678331866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodbye, misdiagnosed (and maybe you too)",
        "author": "maxxslatt",
        "url": "https://www.reddit.com/r/ADHD/comments/11mh4vl/goodbye_misdiagnosed_and_maybe_you_too/",
        "text": "Hey guys, actually not goodbye, I think I am going to stay in the sub because there are still a ton of things I relate to with y'all. ADHD is still on my list of diagnoses, as is everything that randos in the medical field stuck to me, because nobody ever bothers to take anything off even if it doesn't fit. However, I did a screening recently and was told I was most likely misdiagnosed. I stand by that fully; I agree with the professional.\n\n&amp;#x200B;\n\nI was diagnosed with \"inattentive\" ADHD for 12 years. I am in my early 20s. As a kid I was sent to testing places for ADHD over and over at my teacher's request, and I failed the ADHD test every time. They said I wasn't hyperactive, and that the test was mainly testing for that so I was probably inattentive iirc. So they put me on Adderall anyway, and focus wise it didn't help at all, but it made me feel happier so I didn't dispute it.\n\n&amp;#x200B;\n\nLong rest of story short, I have a dissociative disorder. After doing the screening it makes so much sense. Basically with all the problems I was having that I communicated to my psych at the time was just chalked it up to ADHD but the medication never helped. And to my shame, I became a huge speed addict in my late teens because of it. I am clean now.\n\n&amp;#x200B;\n\nNot trying to give my life story although it is starting to look like that.. but if you are unsure about your diagnosis you might want to look at a dissociative disorder screening. I'm not sure what the ones online look like since my EMDR therapist just did the screening directly but if you have trauma or think it is possible you had trauma you forgot, check it out. It might save you some pain. Although I'm sure the majority of people who will see this do have ADHD for sure. But I was thinking there is probably a minority like me in this situation.\n\n&amp;#x200B;\n\ntl;dr:\n\ndissociative disorders are apparently very commonly misdiagnosed as ADHD, if you have trauma check it out, now I actually know how to help myself better.\n\n&amp;#x200B;\n\nALSO-- In regards to trauma, it solely relies on how it affects you. Don't think you don't have trauma because it doesn't seem like a big deal compared to a Vietnam war vet. Don't overanalyze it either and trick yourself into thinking you have PTSD. Just rely on intuition. You can feel it. But I am just a guy, not a professional in any means",
        "created_utc": 1678331769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought I was having a heart attack on Ritalin (I wasn't)",
        "author": "khaellar",
        "url": "https://www.reddit.com/r/ADHD/comments/11mh3yv/thought_i_was_having_a_heart_attack_on_ritalin_i/",
        "text": "[removed]",
        "created_utc": 1678331702,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m so easily overwhelmed",
        "author": "Jolongh-Thong",
        "url": "https://www.reddit.com/r/ADHD/comments/11mh3l9/im_so_easily_overwhelmed/",
        "text": "Today I forgot to do an assignment for homework. Yesterday I forgot to go to a meeting that was very emotionally important to me. It just left my brain immediately after making the plan. I seem to have misplaced my social security card and my service learning hour papers so now all of my service learning hours are gone. I’m late on class dues. I have to fish for a tux for prom, i have to get my grades up since I’m failing two of my 5 classes, I have to talk to my counselors for transcripts for college, taking the accuplacer test, taking a retest for a biliteracy seal, study for aps, study for driving test, and on top of that fix my damn schedule since I can’t hold a simple daily routine.\n\nToday I had kinda a break down. I just wasn’t in my head and I couldn’t do anything but close my eyes. I felt scared to open them because I felt I would get overwhelmed by my reality. \n\nI really just really want help. I’m diagnosed but no meds because I’m not really hyperactive or anything. \n\nThere’s probably more I’m just fucking forgetting like damn usual. I hate myself sometimes. I’m just drowning rn and I need someone to lend me a scooba mask.",
        "created_utc": 1678331673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am just so easily overwhelmed",
        "author": "mmmmmmm678",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgzb7/i_am_just_so_easily_overwhelmed/",
        "text": "Today I forgot to do an assignment for homework. Yesterday I forgot to go to a meeting that was very emotionally important to me. It just left my brain immediately after making the plan. I seem to have misplaced my social security card and my service learning hour papers so now all of my service learning hours are gone. I’m late on class dues. I have to fish for a tux for prom, i have to get my grades up since I’m failing two of my 5 classes, I have to talk to my counselors for transcripts for college, taking the accuplacer test, taking a retest for a biliteracy seal, study for aps, study for driving test, and on top of that fix my damn schedule since I can’t hold a simple daily routine.\n\nToday I had kinda a break down. I just wasn’t in my head and I couldn’t do anything but close my eyes. I felt scared to open them because I felt I would get overwhelmed by my reality. \n\nI really just really want help. I’m diagnosed but no meds because I’m not really hyperactive or anything. \n\nThere’s probably more I’m just fucking forgetting like damn usual. I hate myself sometimes. I’m just drowning rn and I need someone to lend me a scooba mask.",
        "created_utc": 1678331335,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just can’t seem to make myself take my meds…",
        "author": "serpentsortia85",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgy9l/i_just_cant_seem_to_make_myself_take_my_meds/",
        "text": "So, this might be long, I’m not sure. I’ve been diagnosed with ADHD since I was like 6 or 7. I’ve been medicated for a large portion of my life but unmedicated from 2010-2017.I got back on my meds in 2018, and I took my Vyvanse until November of 2022. I got back on it in 2018 because my boss at work was like, “Hey. You’re not doing great in all areas of your job and I don’t want to fire you. Maybe you have ADHD.” So I thought I had grown out of it. Clearly not. I got back on meds and started crushing my job (in a good way.)  I got in a bad wreck and moved into a different role and did a great job there but for some reason I stopped taking my meds again.  Cognitively I know I need it to function but I just can’t make myself take it. I know that I lose 60-70% of my productivity without it and I just can’t seem to make myself do it. I am not sure what’s wrong with me. Has anyone else ever dealt with this? I literally feel so stupid. I know I need to but I just cannot force myself to go through with it.",
        "created_utc": 1678331251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adult ADHD at work",
        "author": "-QuietlyScrolling-",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgwy1/adult_adhd_at_work/",
        "text": "I feel like I'm the most distractible human being on the planet when I'm at work. My manager even brought it up in my six-month performance review. I can't seem to help it. I'm medicated, and I'm in therapy, but I still can't keep myself focused for long periods of time. It's to the point, where people think I'm at least five years younger than I really am, because I am chatty and unfocused. I'm 31, but if you met me, you wouldn't guess I'm a day over 24, because I'm short and \"haven't lost my whimsy\" as I put it. I was fired from my last job because I can't work without structure. Can anyone give me advice? Please?",
        "created_utc": 1678331146,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I am going to lose my job… vent",
        "author": "thelil1thatcould",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgrdr/i_think_i_am_going_to_lose_my_job_vent/",
        "text": "[removed]",
        "created_utc": 1678330748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seems its interesting for people to see how ADHD brain works , but I kinda had a tear roll down my eyes",
        "author": "adhd-related-stuff",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgr7y/seems_its_interesting_for_people_to_see_how_adhd/",
        "text": "[removed]",
        "created_utc": 1678330735,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Cleaning Hacks?",
        "author": "silvern_light",
        "url": "https://www.reddit.com/r/ADHD/comments/11mglrn/adhd_cleaning_hacks/",
        "text": "To put it bluntly, 90% of my bedroom has been unusable for the past six years at least. When I was a kid, I didn’t have that much stuff which made it manageable. As an adult, my spending habits and hoarding habits have teamed up with my reluctance to pick up trash or change the sheets or fold the laundry. I’ve essentially got my bed and nothing else at this point. Even the cat seems upset.\n\nI have to move out of the house fairly soon and I don’t want to leave all this stuff with my parents. Furthermore, I’m flying out to California for college in August. \n\nFor all my fellow ADHD brains out there - how do you all find motivation to actually clean your rooms?",
        "created_utc": 1678330318,
        "upvote_ratio": 1.0
    },
    {
        "title": "administering electricity to the brain to summon effortless willpower and cure adhd (tDCS)",
        "author": "cheatcodesforlife",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgl5w/administering_electricity_to_the_brain_to_summon/",
        "text": "I recently found out about a journalist who [wrote about her experiences in trying tDCS at a military research facility](https://www.lastwordonnothing.com/2012/02/09/better-living-through-electrochemistry/), and said that **electricity was the most powerful drug she had ever tried**, comparable to Adderall, and substantially better in many ways.\n\nThe tech is called **Transcranial direct current stimulation** (tDCS) - the US military has experimented with it to great success:\n\n[Just 20 minutes of low intensity current applied painlessly to the scalp can reliably generate a massive increase in performance and memory.](https://www.youtube.com/watch?v=yoEu2mEdLjw)\n\nShe said it ignited a sense of **\"profound serenity\"**, having been freed of the relentless unhelpful chatter of the mind, something she had only glimpsed after hours of yoga, she was able to dramatically focus and excel...\n\n...then after a few days, she found herself slowly drifting back down to her normal chaotic anxiety ridden unproductive state and thought constantly of trying tDCS again.\n\nThis might just be the silver bullet; I will be fully investigating this in a safe and controlled manner under medical supervision to see if it solves the problem.\n\nIf anyone knows how I can find a medical expert who knows what they are doing, and can put me in touch, that would be super helpful!",
        "created_utc": 1678330273,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with worsening ADHD when changing/adding on antidepressants?",
        "author": "savetheurth",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgjkf/how_do_you_deal_with_worsening_adhd_when/",
        "text": "Hi all! On top of ADHD, I deal w/ anxiety/depression. I was on Trintellix and Wellbutrin. It was a good combo for me. Within the last 6 or so months, under my psych's supervision, I was on Wellbutrin alone for some time, and it did not work for me. Increased anxiety, OCD, spaciness, etc. Increasing the dosage made it worse. I'm in the process of getting back onto the Trintellix/Wellbutrin combo I was on, but I'm just a few days into being back on Trintellix. Has anyone's ADHD temporarily worsened during an antidepressant switch/transition? I used to never have issues on this combo that couldn't be solved with Ritalin, but, even then, I've found it a lot easier for my mind to wander off. Please let me know if you have and how you've coped! Talking to my psych at the end of the week about this. Trying to be patient during this change.",
        "created_utc": 1678330157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone's ADHD temporarily worsened during an antidepressant switch/transition?",
        "author": "savetheurth",
        "url": "https://www.reddit.com/r/ADHD/comments/11mghsu/has_anyones_adhd_temporarily_worsened_during_an/",
        "text": "[removed]",
        "created_utc": 1678330022,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://www.psypost.org/2023/03/new-study-provides-insight-into-the-relationship-between-adhd-and-school-attendance-problems-in-adolescents-68947",
        "author": "Sweet-savyQ4u",
        "url": "https://www.reddit.com/r/ADHD/comments/11mgde3/httpswwwpsypostorg202303newstudyprovidesinsightint/",
        "text": "[removed]",
        "created_utc": 1678329691,
        "upvote_ratio": 1.0
    },
    {
        "title": "My doctor presrcribed me ritalin 10mg a day I feel like it's effective but only for 5 hours",
        "author": "Plastic_Basket_2886",
        "url": "https://www.reddit.com/r/ADHD/comments/11mg9zn/my_doctor_presrcribed_me_ritalin_10mg_a_day_i/",
        "text": "It helped me and relieved my adhd symptoms and make me feel calm and foucsed but only for 5 hours ,  after the 5 hours my symptoms come back and i find it's really diffcult to stay calm and foucsed on a task without getting distracted  , how i can ask my doctor to increase in an appropriate way to increase my dosage without sounds like a junkie",
        "created_utc": 1678329434,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some advice",
        "author": "altchaulk21",
        "url": "https://www.reddit.com/r/ADHD/comments/11mg44x/i_need_some_advice/",
        "text": "I'm really anxious I need some help.\n\nSo I went to a new doctor that specialized in mental health and so I went I got diagnosed with adhd. And iv3 been taking zoloft 150mg for depression and anxiety and lorazepam(avitan) .5mg for 2 weeks three times a day. She told me to start weening off it by taking it twice a day for four days one in the morning one at night which I'm fine with but I'm scared to take it with the Adderall she prescribed that im taking in the morning. So has anyone done this before I just need some comfort. Because I need to take the avitan and Adderall at the same time.",
        "created_utc": 1678328994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being a mentor to a kid with ADHD-Inattentive, where do I start?",
        "author": "smalltownVT",
        "url": "https://www.reddit.com/r/ADHD/comments/11mg34j/being_a_mentor_to_a_kid_with_adhdinattentive/",
        "text": "TL;DR (because you have ADHD) I have been asked to mentor a young, newly diagnosed child who is likely ADHD-Inattentive. I know I can do this, but how do I start? What resources haven't I found?\n\nI was diagnosed at 40 with ADHD and it's clear to me it's inattentive. Both my child have also been diagnosed, one with ADHD and one with ADHD-inattentive. I am very open at my school about my struggles and have had some candid conversations with students.\n\nA young student has just been diagnosed and the parents asked if there was an adult who could be a mentor to the child. The principal and counselor have asked if I will be this mentor. I work in the primary grades, so I will be a part of this kid's life for a few years. I have also known the family for many years. I am really happy to do this and want to do a good job so this child does not have to grow up like me, feeling out of step with everyone else and never knowing why.\n\nHowever, I have no idea how to approach a child I don't specifically teach. It was suggested I have lunch with them, but then what? My imposter syndrome is in force with this. I know I can do this, but I don't know where to start. With the other students it was organic because of the time I was already spending with them in class or small groups.\n\nWhat do you wish an adult had told you as a kid? What would you have wanted as a mentor for yourself or your child? Does anyone have any good books or resources? \n\nThank you so much!",
        "created_utc": 1678328911,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know any of my interests, I mean like real interests.",
        "author": "Gypsy_Queen13",
        "url": "https://www.reddit.com/r/ADHD/comments/11mg2us/i_dont_know_any_of_my_interests_i_mean_like_real/",
        "text": "I feel like anything I may find interesting is just surface level and nothing more. I have a hard time really learning and knowing topics or hobbies and I don't stick to anything long enough to really call a true hobby. \n\nBasically I feel like my interests is the same as intro college courses you choose, just a broad spectrum of randomness and no depth. I can seemingly do or \"know\" many things but they literally have no depth and it feels like a facade. I can't stick to anything at all and it has always been like that. I try to change it, focus on one thing, learn it well, but I end up switching - rinse and repeat.",
        "created_utc": 1678328887,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 15f think I have adhd but my dad refuses to get me diagnosed. What do I do ?",
        "author": "Fuvkoff-135",
        "url": "https://www.reddit.com/r/ADHD/comments/11mg273/i_15f_think_i_have_adhd_but_my_dad_refuses_to_get/",
        "text": "[removed]",
        "created_utc": 1678328831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there specific ADHD-related symptoms that Guanfacine helps with? Or is it more of a general thing?",
        "author": "aprilshowers7",
        "url": "https://www.reddit.com/r/ADHD/comments/11mfx93/are_there_specific_adhdrelated_symptoms_that/",
        "text": "[removed]",
        "created_utc": 1678328450,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (31m) was diagnosed about a month ago. Feeling like I have no free time now.",
        "author": "Piratey_Pirate",
        "url": "https://www.reddit.com/r/ADHD/comments/11mfsh8/i_31m_was_diagnosed_about_a_month_ago_feeling/",
        "text": "I mean, it's great that I'm getting stuff done, but I feel like it just weaponized my ADHD. I'm always cleaning or doing something productive at this point, but the balance has swayed the opposite direction. Now I'm getting distracted by stuff to do.\n\nExample: today I was helping my kids get a game out of the closet. Found the game for them and then ended up cleaning the closet for a half hour.",
        "created_utc": 1678328088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medication and unable to socialise",
        "author": "Altruistic-Ticket228",
        "url": "https://www.reddit.com/r/ADHD/comments/11mfrsr/medication_and_unable_to_socialise/",
        "text": "Hi guys I started vyvanse and Dexamphetamine about a week ago and it’s pretty shit so far lol. But I literally have lost all motivation to hang out with anyone and socialise at all, i love my friends and boyfriend but I just have been finding it so hard to be with other people since I started taking them. Did anyone else experience this and is there any tips u guys have to help with this",
        "created_utc": 1678328034,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m stuck on a loop of telling myself I’m going to workout in the future and then not doing it. Help!",
        "author": "apeyousmelly",
        "url": "https://www.reddit.com/r/ADHD/comments/11mfrnf/im_stuck_on_a_loop_of_telling_myself_im_going_to/",
        "text": "[removed]",
        "created_utc": 1678328022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this just me?",
        "author": "Sterling-Song-418",
        "url": "https://www.reddit.com/r/ADHD/comments/11mflvs/is_this_just_me/",
        "text": "[removed]",
        "created_utc": 1678327593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like I’m “faking” it sometimes",
        "author": "Future_Hyena_6304",
        "url": "https://www.reddit.com/r/ADHD/comments/11mf9ol/feel_like_im_faking_it_sometimes/",
        "text": "I was diagnosed with ADHD in November of last year after bringing it up with my psychiatrist, and started taking medication soon after. I don’t know how to explain it, but there’s always this deep fear that I’m faking this even though I feel like the medication is helping in most ways. I can get out of bed, I’m going to classes much more, I don’t feel as anxious and can do tasks that I want to do that normally I wouldn’t have done, and my anger issues have gotten somewhat better. But I feel like I still struggle to start things like homework and my actual job work (I WFH.) Does anyone else ever feel like they’re “faking” their ADHD in a sense? Like maybe I’m just depressed or lazy? I’ve explained this poorly but I guess I just wanted to express my frustration and I think about it a lot. Sometimes I think I really do have it and other times I don’t know if this is how I should feel on the medication, like is this what I’m supposed to feel like or no. Thanks for reading, I appreciate it.",
        "created_utc": 1678326694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non Drug Tips",
        "author": "ProposalMurky2816",
        "url": "https://www.reddit.com/r/ADHD/comments/11mf733/non_drug_tips/",
        "text": "Alright so I definitely had ADHD. And I’ve always just kind of dealt with it. Then like 5 years ago I went to a doctor about it and got Adderall. And it helped me SOOOOOOOO MUCH!!! It was so nice to be able to finally focus. And for months I could take 20 in the morning and focus all day. But then after awhile one would help me focus a few hours. Then I felt horrible and would take another. Then I could either take another and keep focusing. Or stop and feel horrible. I’ve tried and tried to use Adderall. But ultimately I’ve found it to be overall harmful. Like it helps a ton at first. But then leads to way more problems than it’s worth. I haven’t taken it in two years not and feel like getting on it again would be a MASSIVE step backwards in life. But I still have ADHD though. Like I’ll be working and then next thing I know I’m randomly down the hall way thinking to myself about something random. I mean it is what it is….. And I try to control it the best I can. But does anyone have non Adderall suggestions to help focus?",
        "created_utc": 1678326493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone had trouble using the Vyvance manufacturer coupon?",
        "author": "Professional-You-365",
        "url": "https://www.reddit.com/r/ADHD/comments/11mf6qa/has_anyone_had_trouble_using_the_vyvance/",
        "text": "[removed]",
        "created_utc": 1678326463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on what pharmacies in South Florida have an Adderall supply?",
        "author": "holypuck77",
        "url": "https://www.reddit.com/r/ADHD/comments/11mf6i7/any_tips_on_what_pharmacies_in_south_florida_have/",
        "text": "I just moved to South Florida from the DC area - I had some issues getting my generic Adderall Rx up there due to the shortage - usually just a few days' backorder, but it seems impossible to get down here. I've tried multiple Publix, CVS, and Walgreens stores with no luck. Does anybody know which pharmacies might have any supply? Or am I better off switching to Ritalin/methylphenidate?",
        "created_utc": 1678326443,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and the lack of Adderal",
        "author": "LongjumpingScratch11",
        "url": "https://www.reddit.com/r/ADHD/comments/11mf5fq/adhd_and_the_lack_of_adderal/",
        "text": "I am one of those people that need it to function , organize , set goals , etc. without it my life becomes a mess of depression due to not accomplishing the tasks.   \n\n\nsince I am prescribed adderall to help with my adult adhd it also helps me with my other diagnosis ... Narcolepsy. So working a job and not having the medication in order to help with the process of planning , focusing , in not just my work life but also my personal life.   \n\n\nthis is just frustrating I feel like i'm losing a handle of my life without this and I hate that , does anyone feel the same way?",
        "created_utc": 1678326364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reducing Vyvanse &amp; Racing thoughts",
        "author": "hhkhkhkhk",
        "url": "https://www.reddit.com/r/ADHD/comments/11mf2jl/reducing_vyvanse_racing_thoughts/",
        "text": "Hello all, \n\nI'm wondering if this is a common symptom people have had when they began withdrawing (or reducing the dosage) of their Vyvanse prescription. \n\nFor context, I was on 30mg of Vyvanse and then decided to reduce it back to 20mg after I noticed that I was extremely emotional and angry on the dosage. Thing was, my anxiety and ADHD were great. \n\nI've been on a reduced dosage for around a week and began noticing that at around 8:00pm (as the medicine leaves my system) I began having racing thoughts. I'm no strange to them, but these scare even me. \n\nI have racing thoughts, random intrusive thoughts and I become very hyperactive. Perhaps, I am just now used to feeling so 'lively' anymore, but this is honestly troubling. I was talking to my friend around this time the other day and I was skipping from subject to subject, almost unable to keep my thoughts in order. It's honestly scary. \n\nIs this a normal Vyvanse withdrawal symptom? Or is this just my ADHD returning and me feeling like a crazy person? \n\nOther things I've been experiencing is also:   \n\n\n* Sleeping better (yay) \n* Appetite returning \n* Headaches \n* Dry mouth \n* More tired during the day \n\nPlease let me know. I'm about to start a new job and am a little concerned at just how 'haywire' my brain feels right now.",
        "created_utc": 1678326145,
        "upvote_ratio": 1.0
    },
    {
        "title": "What accommodations can you ask for, for double checking work?",
        "author": "eaterofgoldenfish",
        "url": "https://www.reddit.com/r/ADHD/comments/11mey7p/what_accommodations_can_you_ask_for_for_double/",
        "text": "**TLDR:** Mom's husband got in trouble for making small mistakes at work in reports and needs accommodations so he won't be fired.\n\nMy mom's husband is ADHD and having a really hard time at work because of the adderall shortage. He's trying out different meds but having a really hard time in the meantime. He does reports and works with clients but has gotten in trouble at his work because sometimes he will miss small details in his reports and will need to fix it. Currently he is on probation on his boss is double checking his work, but she found a mistake and really chewed him out over it. He needs to ask for accommodations ASAP because this is going to keep happening, but if he had someone to double check his work quickly before submitting it (without getting in trouble for small mistakes when they happen) it wouldn't be a problem, and this is directly related to his ADHD. \n\n**A few questions:**\n\n* Are there any other accommodations that he could ask for, other than for someone to double check his work before he submits it just to make sure there aren't small mistakes?\n* Is there anything he could do that would make it more likely for him to get the accommodation he asks for?\n* He's on probation; will requesting accommodations help him legally if he does get fired over these small mistakes?",
        "created_utc": 1678325821,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no control over procrastination",
        "author": "crbsidenigma",
        "url": "https://www.reddit.com/r/ADHD/comments/11mex2t/i_have_no_control_over_procrastination/",
        "text": "[removed]",
        "created_utc": 1678325734,
        "upvote_ratio": 1.0
    }
]