[
    {
        "title": "is it normal to be upset when someone brakes eye contact?",
        "author": "redbeard0688",
        "url": "https://www.reddit.com/r/ADHD/comments/11k722u/is_it_normal_to_be_upset_when_someone_brakes_eye/",
        "text": "My SO is very angry with me that I keep breaking eye contact but like instantly... \"I'm over here\" the micro second I look away. It's too much ad ice told her this. Am I just being too sensitive?\n\nThere are other signs that I think she's expecting typical behavior out of an atypical person.... when we met I was deep in my early 20s denial.... we're 12 years together now and it seems like there is a corilation between me becoming awaire of my symptoms and her dislike of me ...",
        "created_utc": 1678125073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Protein bars and drinks",
        "author": "natttsss",
        "url": "https://www.reddit.com/r/ADHD/comments/11k71bt/protein_bars_and_drinks/",
        "text": "A while ago I noticed that sometimes when I'm not feeling very well, either from a headache or dizziness, I get better after eating a protein bar or drinking an energy drink.\n\nIt's known that a high protein diet is good for everybody, especially for us with ADHD, but, I have a really hard time eating a balanced meal, so this little cheat helps me a lot.",
        "created_utc": 1678125050,
        "upvote_ratio": 1.0
    },
    {
        "title": "hyperfixation on people?",
        "author": "lingling40000",
        "url": "https://www.reddit.com/r/ADHD/comments/11k70o5/hyperfixation_on_people/",
        "text": "have you guys hyperfixated on non-objects or non-hobbies like…. people? and get kinda obsessed over someone in your life (can be a role model, teacher etc.) for a few months and then get hyperfixated on another person?\n\nam just wondering if this trait of mine is related to adhd or it’s just my attachment issues, or both.",
        "created_utc": 1678125029,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 of my children were just diagnosed, how can I help them?",
        "author": "kochanie2013",
        "url": "https://www.reddit.com/r/ADHD/comments/11k6zyi/2_of_my_children_were_just_diagnosed_how_can_i/",
        "text": "[removed]",
        "created_utc": 1678125007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from Adderall to Vyvanse?",
        "author": "Healthy_Crazy6581",
        "url": "https://www.reddit.com/r/ADHD/comments/11k6l5v/switching_from_adderall_to_vyvanse/",
        "text": "So my doc suggested possibly switching from Adderall to Vyvanse or Concerta because of the shortage.\n\nFor those of you who have switched from Adderall to one of these, what differences did you notice? I was briefly on Vyvanse back in 2015 and all I remember s having focus, but no motivation or drive. Just sat and played Dark Souls all day. Which really sucked because I've always been a creative person, but I didn't feel like doing anything creative on Vyvanse :/ Maybe I needed a higher dose? Whatever the case, I'd love to hear your input.",
        "created_utc": 1678124524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trouble with Recall",
        "author": "hellooo-its-me",
        "url": "https://www.reddit.com/r/ADHD/comments/11k6k9e/trouble_with_recall/",
        "text": "Hey everyone. Newly diagnosed about 4 weeks ago. \n\nI'm wondering if anyone can relate and provide some ideas that might help.\n\nBefore a diagnosis, I thought I was just like everyone else, and people have always had a high opinion of me. I've had to work so hard to maintain that over the years, but I just didn't notice I was doing it. Now that I'm even more aware of my flaws, I've been focusing on the negative even more than usual which leads to even more overwhelm.\n\nMy biggest issue that hasn't got better is my memory recall. Does anyone have this issue? My memories seem to be in my brain and can be accessed with a picture or a prompt. But otherwise, it's like my mind is always blank. I've always written things down because of this, but I can never stay consistent where I write it or to remember that I did write it.\n\nI think it's why I'm so unproductive, poor at solving problems in the moment and bad with conversation.\n\nAny ideas that have worked for anyone else? Not everything can simply be written down and followed.",
        "created_utc": 1678124493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shortage advice",
        "author": "Empty-Ask5034",
        "url": "https://www.reddit.com/r/ADHD/comments/11k6hxq/shortage_advice/",
        "text": "[removed]",
        "created_utc": 1678124418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Focusing and being present",
        "author": "OldAd180",
        "url": "https://www.reddit.com/r/ADHD/comments/11k68nj/focusing_and_being_present/",
        "text": "Has anybody noticed a big difference in how they can stay focused and just enjoy the moment since starting medication?\n\nI’m recently diagnosed and I have a million questions, I’m now 35 and have done quite a bit of backpacking when I was a little younger, I was never really present whilst I was away, always thinking of the next trip even if it was two years into the future, never really been able to stop and appreciate the beauty of a country I was traveling through, and I find all of this a shame upon reflection, has anyone had similar experiences or have any advice?? \nThanks.",
        "created_utc": 1678124118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roommate gets mean when on adhd meds",
        "author": "FishIndependent2911",
        "url": "https://www.reddit.com/r/ADHD/comments/11k62s7/roommate_gets_mean_when_on_adhd_meds/",
        "text": "My roommate has adhd, as do I and so does my other roommate. I'm currently not medicated for anything nor am I able to. My roommate is diagnosed and she takes her Adderall and just gets like mean. Suddenly she has the energy to clean everything, then we're not doing enough because she's doing ALL the work. She also flies off the handle and snaps at people when she's on her meds and we suddenly turn into an obstacle and everything we say or do is an annoyance and her feelings and actions take up precedence. \nI'm not medicated I'm running at like minimum capacity no matter how hard I try. I can't keep up with her and I can't preemptively clean before she takes her meds because she does it sporadically. So it's just random days with an overactive roommate. \nWhen she doesn't take Adderall the baseline mess of the house is fine and not an issue at all so when she does it's like being blindsided and I'm suddenly at the mercy of someone else's serotonin level.",
        "created_utc": 1678123930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reassurance Needed",
        "author": "Sweet-Bed-4533",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5xrv/reassurance_needed/",
        "text": "Hi, I’m new to this page. I’ve started doing research on ADHD/executive dysfunction/RSD and I’m convinced ADHD is my real diagnosis.\n\nI am currently diagnosed with generalized anxiety disorder and depression with an unofficial bipolar 2 diagnosis (I’m looking for a new psychiatric because who gives you bipolar meds without diagnosing you first?) \n\nI do go through episodes of mania and depression, however the meds seem to not help at all, hence the continuing episodes. But my current diagnosis doesn’t explain the extra symptoms I have:\n\n-I can’t keep my house clean (laundry once a month, I don’t do dishes, I always need my mom or sister to come over to help me reorganize all of the things in my house that have no object permanence to me) \n\n-I cry any time I know I’ve done something wrong, even before I get the rejection or get reprimanded, I have panic attacks after I do get confronted. \n\n-I have never had a job longer than 1.5 years and the jobs I do keep that long I have a tendency to quit and beg for them to take me back. \n\n-I can’t hold a romantic relationship because I get burnt out and become a very unhappy person and no one can seem to handle me. \n\n-I’ve earned certificates (ie EMT, equine therapy) but never used them. \n\n-I have a corner in my room full of the incomplete projects/crafts I once was hyper-fixated on that I got bored of and haven’t touched since. \n\n-I’ve had periods of my life where I put my life at risk just to find a hint of adrenaline/dopamine (solo skydiving, unprotected sex with strangers, driving wayyy too fast etc) \n\n-I’m currently in the process of filing for bankruptcy because I racked up so much credit card debt I can no longer afford to make my minimum payments. \n\n\nI feel lazy and worthless because I know I once had the ability to accomplish tasks and take care of business, and as the years progress my ability to function “normally” is disappearing. Please someone reassure me I’m not crazy and this is a real possibility for me. I need a light at the end of this dark tunnel I call existence. The more time goes on the more I lose hope and the more and more I consider unaliving myself. \n\nI know Reddit is not a diagnosis but some reassurance and understanding is what I think I need right now.",
        "created_utc": 1678123768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 3 of 54mg Concerta and it’s…weird/spotty?",
        "author": "goosenbear",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5vkv/day_3_of_54mg_concerta_and_itsweirdspotty/",
        "text": "I (28F) recently got diagnosed and my doctor suggested either Vyvanse or Concerta. Started on 18mg of Concerta and nothing, 36mg was faint but made me slow and lethargic, 54mg I feel but there’s spotty-ness to it.\n\nI feel kind of emotionally numb, and feel weird socializing - which I don’t know if it’s just quietness in the brain that I’m not used to. I feel like I’m still getting distracted by things and struggle to do the tasks at hand. Once I bring myself to the task I can focus on it, but I feel like it’s doing 75-80%. There are also periods throughout the day where I know it’s working and others where I question if it’s even doing anything.\n\nI tried my uncles Vyvanse over the summer and still felt my emotions, but regulated them without even trying, and I found that I literally could not distract myself or procrastinate if I tried.\n\nHave any of you had similar experiences? Could it be that Concerta just isn’t for me?",
        "created_utc": 1678123699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tingling in wrist and hand on concerta",
        "author": "Vermillon666",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5v45/tingling_in_wrist_and_hand_on_concerta/",
        "text": "Hi all, I've been on Concerta for around 2 weeks and I've started getting random episodes of tingles in my wrist and left hand. It's not sore or painful I just know it's there and it's irritating more then anything. \n\nDoes this go away at all ? I can't get much info on it and just want to know if anybody else gets this. \n\nIt's horrible because one part of me now wants to stop Concerta completely and another doesn't because it's made such a difference to me .\n\nFor the record I'm taking 18mg. In the morning. I was upped to 27mg as I was handling the 18mg just perfectly but after 2 days I dropped back to 18mg because of said side effects.",
        "created_utc": 1678123684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Magical Chunks",
        "author": "CraftDetritus",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5t06/magical_chunks/",
        "text": "Is anyone else really tired of the advice \"Break down BIG PROJECTS into managable chunks!!!\"\n\nUm, okaaaaay..... HOW DO I DO THIS?!? \n\nWhat are these \"Magical Chunks\" that everyone seems to know about but ME?!\n\n I normally start projects in the middle, and work in a weird, roundabout pattern, gathering ideas and stuff as I go and then hyperfocusing to pull it together in the end. \n\nI CAN break this process into chunks, but it doesn't help me ORGANIZE THE CHUNKS. It doesn't tell me if they are the RIGHT CHUNKS. It doesn't tell me NOT to spend 5 hours hyperfocusing on the FONT for my project when I HAVEN'T EVEN WRITTEN THE OUTLINE YET.\n\nIf I was ABLE to do this \"Magical Chunk\" stuff, I would have DONE IT ALREADY. \n\nTelling me to break projects into chunks is like saying, \"Oh, it's really simple, just Hagenflaff the Flugelblinden\"  - it's COMPLETELY USELESS and FRUSTRATING advice that makes NO SENSE!!!\n\nOr maybe it \\*IS\\* just me?",
        "created_utc": 1678123618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get a diagnosis",
        "author": "Sweet-Bed-4533",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5s0u/can_i_get_a_diagnosis/",
        "text": "Hi, I’m new to this page. I’ve started doing research on ADHD/executive dysfunction/RSD and I’m convinced ADHD is my real diagnosis.\n\nI am currently diagnosed with generalized anxiety disorder and depression with an unofficial bipolar 2 diagnosis (I’m looking for a new psychiatric because who gives you bipolar meds without diagnosing you first?) \n\nI do go through episodes of mania and depression, however the meds seem to not help at all, hence the continuing episodes. But my current diagnosis doesn’t explain the extra symptoms I have:\n\n-I can’t keep my house clean (laundry once a month, I don’t do dishes, I always need my mom or sister to come over to help me reorganize all of the things in my house that have no object permanence to me) \n\n-I cry any time I know I’ve done something wrong, even before I get the rejection or get reprimanded, I have panic attacks after I do get confronted. \n\n-I have never had a job longer than 1.5 years and the jobs I do keep that long I have a tendency to quit and beg for them to take me back. \n\n-I can’t hold a romantic relationship because I get burnt out and become a very unhappy person and no one can seem to handle me. \n\n-I’ve earned certificates (ie EMT, equine therapy) but never used them. \n\n-I have a corner in my room full of the incomplete projects/crafts I once was hyper-fixated on that I got bored of and haven’t touched since. \n\n-I’ve had periods of my life where I put my life at risk just to find a hint of adrenaline/dopamine (solo skydiving, unprotected sex with strangers, driving wayyy too fast etc) \n\n-I’m currently in the process of filing for bankruptcy because I racked up so much credit card debt I can no longer afford to make my minimum payments. \n\n\nI feel lazy and worthless because I know I once had the ability to accomplish tasks and take care of business, and as the years progress my ability to function “normally” is disappearing. Please someone reassure me I’m not crazy and this is a real possibility for me. I need a light at the end of this dark tunnel I call existence. The more time goes on the more I lose hope and the more and more I consider unaliving myself. \n\nI know Reddit is not a diagnosis but some reassurance and understanding is what I think I need right now.",
        "created_utc": 1678123586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Auditory processing disorder questions",
        "author": "PepsPotion",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5ouc/auditory_processing_disorder_questions/",
        "text": "So, I (28f) was diagnosed with ADD almost 20 years ago. I think I found out I had APD around the same time, it effected me differently then it does now, for example school was extremely difficult for me because I wasn't grasping knowledge like the other kids. \n\nBut now as an adult, I am feeling the full force of APD, it makes me feel inferior to my peers around me. For example: I play D&amp;D every week, and have for a couple years. I'm still in that learning phase lol, I'm constantly having to ask if I need to roll my dice to hit for certain attacks. The information just won't stick in my brain. I constantly have to ask people to repeat themselves or how to do something, or even to prompt me on tasks I need to get done (but that last part is mostly just the ADHD) \n\nOthers who have APD, what are some ways that you cope with it?",
        "created_utc": 1678123482,
        "upvote_ratio": 1.0
    },
    {
        "title": "the adderall shortage is like government sponsored violence towards my roommates",
        "author": "nolakhsa",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5l37/the_adderall_shortage_is_like_government/",
        "text": "I’ve become a menace and a terror. i feel kinda bad for them but not really. \n\nall my life i’ve been allowed to paint on my walls. my roommates and i live in a rental so obviously i cant do that. i bought a whole roll of canvas and am painting it and hanging it on the wall. it’s the SIZE of the wall. i keep forgetting to eat and the other day passed out and hit my head. now i have a concussion. i’m also singing more than normal apparently and they are sick of it.",
        "created_utc": 1678123358,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve been out of adderall since October. Has anyone tried Adzenys?",
        "author": "prolongedexistence",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5gtn/ive_been_out_of_adderall_since_october_has_anyone/",
        "text": "[removed]",
        "created_utc": 1678123224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online ADHD diagnosis and help",
        "author": "ErinThomasSucks",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5g6j/online_adhd_diagnosis_and_help/",
        "text": "Hello, I have just joined this subreddit. Are there any online therapists or services that provide ADHD diagnosis and hence medication? My local ones are severely unreliable and although I am undiagnosed, I have been reading a lot about it. I have suffered with low dopamine for quite some time now and I believe medication could go a long way to improve my state. \n\nThank you for taking the time out to reply :).",
        "created_utc": 1678123205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whyyy...???",
        "author": "dangerroussociopath",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5ffy/whyyy/",
        "text": "[removed]",
        "created_utc": 1678123181,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you stand for 8 hours at work?",
        "author": "KurohNeko",
        "url": "https://www.reddit.com/r/ADHD/comments/11k5a5g/how_do_you_stand_for_8_hours_at_work/",
        "text": "I'm desperate for a job that will give me health insurance so I'm grasping at straws. There is a job I \"want\" that could require me to stand for 8 hours with a small 15 minutes break in the middle. I'm scared of this because I have trouble standing still and even 5 minutes at the bus stop, I walk from one end to the other constantly, like a tiger in a cage. I have no idea how I'm going to stand up behind a desk for 8 hours! Can you all share any tips?",
        "created_utc": 1678123017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short videos are dangerous, especially to the ADHD brain",
        "author": "05Lidhult",
        "url": "https://www.reddit.com/r/ADHD/comments/11k591d/short_videos_are_dangerous_especially_to_the_adhd/",
        "text": "It fries our brains even further\n\nWith that said, if you're constantly finding yourself watching TikTok/YT shorts etc, without any memory of opening the app: move the app icon on your home screen slightly. It really helps with realizing that you're just about to open the app.\n\nI hate the fact that I watch those videos, and I've become more cautious, especially as I see how addicted \"normal\" people get. I don't want to be that person.",
        "created_utc": 1678122984,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you eat? Hungry for a change.",
        "author": "Pleasant-Plankton-93",
        "url": "https://www.reddit.com/r/ADHD/comments/11k53t1/what_do_you_eat_hungry_for_a_change/",
        "text": "Has anyone altered their diet and noticed positive (or negative) results with their ADHD symptoms? \n\nMy current way of eating is well… most likely not a recommended diet for any living human. \n\nI’m curious if anyone has eaten something or in someway and noticed real ADHD related changes.  If so please share!!!",
        "created_utc": 1678122828,
        "upvote_ratio": 1.0
    },
    {
        "title": "My parents think I won’t have a good life",
        "author": "LuckyDucky13579",
        "url": "https://www.reddit.com/r/ADHD/comments/11k51wv/my_parents_think_i_wont_have_a_good_life/",
        "text": "I am in 11th grade and my grades aren’t good and I am unmediated with adhd but I do want to mention I go to Gunn High School which if you look up is the hardest public school in California. My GPA is 3.1. I plan on going to community college for 2 years then transferring and right now i want to major in mechnical design. Do you think it is possible for me to have a future or am I fucked? Also any advice/feedback is appreciated.",
        "created_utc": 1678122772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short videos are dangerous, especially to the ADHD brain",
        "author": "05Lidhult",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4z53/short_videos_are_dangerous_especially_to_the_adhd/",
        "text": "[removed]",
        "created_utc": 1678122691,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of fidgeting/stimming/rewarding can you do to replace smoking? Any mindfulness practices that worked for some?",
        "author": "Cultural_Owl9547",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4w9u/what_kind_of_fidgetingstimmingrewarding_can_you/",
        "text": "Everytime I quitted smoking in the past, my productivity took a huge hit or my thc consumption increased radically. I work online, mostly from home, and for many-many years my routine is coffee+cig/joint and then sit down and work. A cig before doing something, a cig after finishing it.   \nI've never been medicated, I was functioning on smoking different things quite well.   \n\n\nNow I'm expecting a baby, so all the smokes are off the table together with caffeine, and I'm doing quite well, but for my life, I can't put myself into any productivity. My attention is all over the place, I can't stay present in an online call for 3 damn minutes, I'm browsing around my windows, struggling to get to start anything, doom scrolling/waiting a notification on some channels and running after that dopamine all day. \n\nIt's been 3 weeks now since I found out and stopped smoking, and I really net to go down the task list and put my ducks in a row. \n\nMy options are fairly limited, so I need to find some healthy coping mechanism, because I can't afford to scroll through the year.   \nI know meditation, but it increased my anxiety recently. I guess some mindfulness would help, and some other tools &amp; technics would be great too. How do you transition from one thing to another, how do you reward yourself for completing tasks &amp; how do you keep your hands/mind busy enough to pay attention to work?   \nIt's Monday evening already, and I feel like basically this week is already doomed as I just couldn't put myself into any productivity today.",
        "created_utc": 1678122608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beauty vs. Pretty (and how that relates to ADHD)",
        "author": "sobrique",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4qpp/beauty_vs_pretty_and_how_that_relates_to_adhd/",
        "text": "Pretty is a fairly superficial thing. Many things are pretty, and there's a broad consensus on what that means. \n\nBut beauty? That runs deeper. \n\n\"Beauty is in the eye of the beholder\" is quite true - a thing cannot be beautiful on it's own, because beauty is more like a question looking for an answer. \n\nYou can experience beauty, you can hear beauty, you can find an idea beautiful. \n\nIt's all about the emotional response. Does this thing bring you pleasure to experience, contemplate or admire? Then it is beautiful. \n\nIt can also be pretty or aesthetically pleasing, or technically accomplished _as well_. But not every pretty thing is truly beautiful.\n\nSo where am I going with this? \n\nWell, because 'pretty' is not a requirement for beauty. And neither is flawlessness. Of indeed any sort of aesthetically pleasing. \n\nThe finest artworks are not 'photo realistic'. They're beautiful because of what they don't include as much as for what they do. Their flaws don't detract from their beauty, they're part of it. \n\nADHD is a flaw. It may only be one of many flaws you have. I know I've rather a few. \n\nBut that doesn't stop you being beautiful. Of being worthy of admiration, of being able to inspire others. Of being able to love and be loved in return.",
        "created_utc": 1678122391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meditation &amp; ADHD. Does anyone has an experience of the effects of meditation on ADHD symptoms?",
        "author": "Disastrous_Variety65",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4o4q/meditation_adhd_does_anyone_has_an_experience_of/",
        "text": "[removed]",
        "created_utc": 1678122259,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you eat? I’ hungry for some tips.",
        "author": "Pleasant-Plankton-93",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4nxz/what_do_you_eat_i_hungry_for_some_tips/",
        "text": "[removed]",
        "created_utc": 1678122250,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD &amp; Periods",
        "author": "Spikeypine",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4n1c/adhd_periods/",
        "text": "Having ADHD and monthly mood swings if the f*cking worst. \n\nRight after my period I’m sailing high on all my estrogen and feel like I can tackle the world. It was I want to feel like all the time. I still have ADHD, can I motive myself to get shit done so that when I crash in 2 weeks I won’t be drowning, lol nope. \n\nSo a week and a bit of being on top of the world, and then coming up to my period the estrogen crashes, and I crash hard. And then it’s a week + of depression and getting out of bed and eating is the main goal. And then as soon as I’m used to it and figuring out ways to get out of bed. Boom, back to feeling on top of world. \n\nI’ve tried increasing my Vyvanse dose during my period, which helps a little bit, but I also get very jittery. \n\nAnyone else have strategies for the wild rollercoaster of hormones and ADHD? \n\nI feel like it prevents me from developing routine because I can only do a routine for 2 weeks at a time. \n\nI also can’t handle birth control with estrogen because the synthetic estrogen has the opposite effect (AKA depression pill)",
        "created_utc": 1678122203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jobs and ADHD",
        "author": "GlamoursMango",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4mrl/jobs_and_adhd/",
        "text": " \n\nHi yall-\n\nI'm a 25f, who's a nurse. I got my bachelor's in 2020, worked at 2 hospitals and a few outpatient's jobs. I was diagnosed with ADHD the last semester of nursing school. And I suffer from GAD. After a couple of years of bedside nursing, I realized it's not for me. Too much social interaction (I did not realize that I was more introverted until I started working haha), responsibility and stress. Nursing is great job- it's just not for me. I also looked into different outpatient jobs and just realized that I don't want to really work with patient's anymore. But the only other nursing jobs i see are desk jobs and a lotttttt of reading (like health records and stuff). I actually want to leave the field.\n\nTBH guys- I went into nursing because of pressure from those around me. I do a good job at my job (although it kills me mentally and physically lol), but I feel like this is the first time in my life that I'm finally asking myself of what *I* like and what *I* want to do. It feels liberating but also scary because I like/dislike so many things.\n\nI've been thinking about going back to school. I like music, animals and food! But I don't really know what to make of those things. I would like a stable, secure job but I know that I can't have it all. Dream jobs are hard to come by.\n\nI like fast paced environment, but not chaotic. I like to be autonomous when I know what I'm doing. Tasks are super cool, just not all at once. I like the feeling of being productive! And I like to learn new things that interest me...cause if it's not I zoning out.\n\nOriginally this was gonna be a \"any suggestions?\" post which I'm still open to, but I guess I just needed to get it off my chest as well.\n\nThanks for reading. Sorry if this doesn't make sense!",
        "created_utc": 1678122191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help. Doctor appt. TODAY for diagnosis. I can't find the spreadsheet that was shared on this sub that addresses the questions asked for ADHD diagnosis.",
        "author": "OnehappySmile",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4lyw/please_help_doctor_appt_today_for_diagnosis_i/",
        "text": "[removed]",
        "created_utc": 1678122162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctors/pharmacy",
        "author": "WigglyNut",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4ibv/doctorspharmacy/",
        "text": "Florida area-\n\nCan an old doctor call my pharmacy and red flag me or make it impossible or very difficult for me to get my meds filled by a new doctor? \n\nCan or will the pharmacy call my old doctor to let him know I am trying to fill medication with a new doctor? \n\nDoes information that an old doctor includes in your medical history, stay on a general report that any new doctor has access to? \n\nOr is everything started fresh with a new Doctor, unless they contact the old doctor? \n\nI’m worried that my medical records with my old asshole doctor might be tainted and ruin my chances with getting Adderall with my new doctor. How should I move forward?\n\nI’ll stop with the many questions after this I promise lol \n\nThanks a bunch",
        "created_utc": 1678122050,
        "upvote_ratio": 1.0
    },
    {
        "title": "difficulties with school",
        "author": "Much-Tone-3576",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4fkz/difficulties_with_school/",
        "text": "I've been having difficulties with my homework/ studying. I just can't get myself to study, I always end up doing other things like watching YouTube or something else (posting this is another example I guess). I don't know if it's my ADHD or the fact that I haven't been very happy lately. The usual procrastination just ends up in not doing my work instead of the usual rush that makes me do the work. The stress of the work that needs to be done used to motivate me to do my work but all it does now is make me nervous and destroy my skin.\n\nAnyone who's had this? Anyone with some advice?",
        "created_utc": 1678121974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repost (got removed due to charicter limit):I want to get tested for ADD/ADHD but not sure how to get started, or if I want to get diagnosed. I have extreme symptoms and several people around me say I should get it checked out.",
        "author": "TheFakeLime_",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4fc5/repost_got_removed_due_to_charicter_limiti_want/",
        "text": "[removed]",
        "created_utc": 1678121966,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can I do about sleep issues on Amfexa?",
        "author": "opheaphea",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4byf/what_can_i_do_about_sleep_issues_on_amfexa/",
        "text": "So I've been taking elvanse for a few months now, and I've been settled on a dose of 40 mg for the last 2 months. The issue is it's only lasting about 6-7 hours max for me. Because of this, my psychiatrist has prescribed me 5 mg of amfexa for the afternoon, which I started taking about 3 weeks ago. It's working great, but it's absolutely wrecked my sleep, which wasn't great to begin with. Before, I got maybe 3-5 hours of sleep a night, with the occasional night of no sleep. On amfexa, I literally can't sleep for days on end, then I'll crash and end up sleeping for over 24 hours. I've tried messing around with the time I take it and it hasn't made much of a difference.\n\nI really like it otherwise though and I have no other issues with it. I have an appointment in a few days and I don't know whether I should ask to try a different medication or ask for a sleeping pill like melatonin or something similar. I'm wary of adding another medication into the mix on top of what I'm already taking, but I also don't want to spend the next few months trying out different meds and working on getting the right dose sorted out as I'm worried I'll react poorly to them and I can't really afford the mental drain of that right now with uni and work.\n\nAnother thing is that I'm currently with a private clinic in the UK, so I'm paying \\~£350 a month between the appointments and medication. If I stick with the amfexa, I can go onto a shared care plan soon and start paying NHS prices, which is around £10 a month. I'm a broke uni student and can only just about afford groceries after paying for everything else, so going on a shared care plan would be a huge weight off my shoulders. Having a consistent sleep schedule even before I started any medication was also a bit of an issue, even if it has been manageable, so maybe sleeping pills are the way to go? \n\nObviously I'm going to talk about this with my psychiatrist, but I figured I'd also look for some opinions from people with first hand experience with these things. Has anyone found any alternative methods for fixing sleep issues that could potentially help? I read that vitamin C can stop the medication from working, would taking vitamin C supplements before I go to sleep be a viable option? \n\nThanks in advance for any advice :)",
        "created_utc": 1678121869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Glad to have a provider that seems to be on my side",
        "author": "Hate_usernames2",
        "url": "https://www.reddit.com/r/ADHD/comments/11k4bvf/glad_to_have_a_provider_that_seems_to_be_on_my/",
        "text": "I have been feeling extra spacey while on my medication, and recognized some specific examples this weekend that I made note of to bring up at my annual appointment today. My provider still asked questions to clarify what was happening, but there was no talk about \"what if upping the dosage doesn't work?\" (Which happened with my provider before) and it was nice to feel like I was believed and understood rather than feeling like I'm going up against someone to convince them that I need something. I'll be trying the next dose up once I can get it from the pharmacy, and the only reason why we decided to meet again in a month rather than 3 months is because I'm going to be moving before that time and she can't be my prescriber if I'm out of state.\n\nTL;DR: Just nice to leave a doctor's appointment when your doctor seems to trust you and your diagnosis.",
        "created_utc": 1678121866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thesis supplement - does it work?",
        "author": "Vapuru",
        "url": "https://www.reddit.com/r/ADHD/comments/11k48xd/thesis_supplement_does_it_work/",
        "text": "[removed]",
        "created_utc": 1678121780,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Adderall effect you personally?",
        "author": "theBolsheviks",
        "url": "https://www.reddit.com/r/ADHD/comments/11k43dg/how_does_adderall_effect_you_personally/",
        "text": "I was watching Ice Cream Sandwich's video on ADHD meds, and he said that Adderall was making him get up and do chores, but he wasn't focusing. I've never had trouble focusing on stuff I'm interested in, but my main issue is getting up to do stuff. Dishes, cleaning, doing stuff at work. I'm wondering if you guys have also experienced this, because if that's a common effect, I'm going to tell my psychiatrist I want to try Adderall, because at this point I'm going to lose my job if I can't make myself get up and actually work, side effects be damned.",
        "created_utc": 1678121495,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and lack of purpose in life",
        "author": "A_Grumpy_Pickle",
        "url": "https://www.reddit.com/r/ADHD/comments/11k416t/adhd_and_lack_of_purpose_in_life/",
        "text": "I'm struggling to find a sense of purpose in my life due to my ADHD. I feel like I'm constantly starting new hobbies and projects, only to lose interest after a few months and never touch them again. I've also tried to think of side hustles that could bring in extra money, but they never seem to work out, so I end up giving up on them as well.\n\nIt's frustrating because I feel like I'm wasting time if I'm not working on these things, but at the same time, I can't seem to stick to anything long enough to really make progress or achieve anything meaningful. It's like I'm always chasing the next shiny object, but never actually reaching any kind of goal.\n\nIf anyone else has experienced something similar, I would love to hear from you. Maybe you have some advice or tips on how to find a sense of purpose despite struggling with ADHD. Or perhaps you just want to commiserate and let me know that I'm not alone.\n\nI know that ADHD can make it challenging to focus on long-term goals and stay motivated, but I still have hope that there's a way to find meaning and purpose in my life. Any input or insights would be greatly appreciated.",
        "created_utc": 1678121356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else has no reaction to caffein",
        "author": "SkullnSkele",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3yo2/who_else_has_no_reaction_to_caffein/",
        "text": "[removed]",
        "created_utc": 1678121195,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Psychiatrist Advice Needed",
        "author": "rainytuna",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3y3v/new_psychiatrist_advice_needed/",
        "text": "I have an appointment with a new psychiatrist very soon and need advice. \n\nI was diagnosed with inattentive ADHD a few years ago. I also have very bad anxiety. I am dealing with several major issues, one being legal, that needs to be addressed and need different medications to help me. \n\nI was put on SSD by my biological parents many years ago, which is another story. My insurance is Medicare. I also don't have a career or job.\n\nI need advice on what to say and what not to say.\n\nSome questions that l am anticipating are:\n\n1: Why are you looking for a new doctor.\n2: Why are you on SSD.\n3: Do you work.\n\nShould l mention the legal issues?\n\nAny advice would be highly appreciated.",
        "created_utc": 1678121157,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to get tested for ADD/ADHD but not sure how to get started, or if I want to get diagnosed. I have extreme symptoms and several people around me say I should get it checked out.",
        "author": "TheFakeLime_",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3wly/i_want_to_get_tested_for_addadhd_but_not_sure_how/",
        "text": "[removed]",
        "created_utc": 1678121062,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Replying\" to noises in my environment",
        "author": "Aggressive-Bad-1360",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3utl/replying_to_noises_in_my_environment/",
        "text": "So I have this tendency to respond to noises around me. Bird whistles, I mimic it back. Machine beeps, I beep back. I mimic interesting noises in video games while I play.  Completely unconscious; half the time I don't realize I heard the sound until I've mimicked it. Always thought it was just a weird and amusing quirk. \n\nToday I found out that's a common stimming behavior for ADHD. Anyone else reply to random noises?",
        "created_utc": 1678120946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me with my research on ADHD :)",
        "author": "ResearchOnADHD",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3ufi/please_help_me_with_my_research_on_adhd/",
        "text": "[removed]",
        "created_utc": 1678120921,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much for generic XR Adderall through Capsule? (No insurance)",
        "author": "sadgurlporvida",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3svx/how_much_for_generic_xr_adderall_through_capsule/",
        "text": "Hi Everyone, \n\nI got a new trial prescription last week for generic Adderall at 20 mg and I couldn't have pick a better time! =-) been striking out at most pharms but luckily my city has a Capsule Pharmacy. Now unfortunately it looks like they do not accept good rx and I do not have insurance at the  moment, So I was wondering if anyone here has experience with paying for Adderall at that pharmacy and what kind of costs I would be looking at. thank you and have a great week.",
        "created_utc": 1678120829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living on my own for the first time from a recent death",
        "author": "hitmusicwithtc",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3r99/living_on_my_own_for_the_first_time_from_a_recent/",
        "text": "Sorry for the rambling at any point , but I need to get these thoughts out. I appreciate you taking your time to read.\n\nI (28f) am now living on my own in a 3 bedroom apartment which I shared with my mother till her recent passing last month on the 21st. I do have a good support system from my family but I am worried about when I will be on my own starting next week. Which is also the week I will be returning to work.\n\nA bit of history my mother has pretty much been my core support for all my life. She would always drive me to work in the morning, make sure I had breakfast, would prepare and cook my meals when I didn't feel up for it (she was tired of me eating fast food). She pretty much did everything. I know it sounds like I relied on her too much and honestly I did. I was slowly starting to be more dependent. \n\nMy concerns is my day to day life. Like making sure I eat properly and make sure I bring my lunch for work. What do I need to make sure is always stocked in the apartment? How much do I need to budget for groceries? How am I going to make sure I get up on time to eat before I need to catch my bus for work in the morning? I take sleeping pills in order to sleep. Now I need a cleaning schedule? \n\nI will be staying here for at least a year. I do have my very supportive boyfriend who is always here 3-4 days a week and has already said he will help me with meal prep. I think I might just be overthinking everything which is common for me. I do have plans to help make the kitchen more easier for me by having everything I need in one corner of the counter. Also plan to have a shelf for all my bento containers/accessories, and other appliances(Kitchenaid, blender, and Soda Stream) \n\nAny tips or suggestions that will help is appreciated. If you made it this far, thank you.",
        "created_utc": 1678120730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book adhd and anxiety",
        "author": "SiobhanRoy1234",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3pfl/book_adhd_and_anxiety/",
        "text": "I know there are a lot of books out there about ADHD but I’m looking for a good book about ADHD and anxiety. The two often go hand in hand and exacerbate each other, so I figured there would be plenty of books out there, but I can’t find any.\nSo do any of you know of a good book that deals with this, even just partly?",
        "created_utc": 1678120620,
        "upvote_ratio": 1.0
    },
    {
        "title": "work pet peeves?",
        "author": "themagicalworldofmei",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3nou/work_pet_peeves/",
        "text": "[removed]",
        "created_utc": 1678120515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got my official ADHD diagnosis today! (I’m 42.)",
        "author": "marvelousmrs",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3lzt/got_my_official_adhd_diagnosis_today_im_42/",
        "text": "I’m 42 and started suspecting I *might* have ADHD about a year ago after reading anecdotes from others who were diagnosed. \n\nI started seeing a therapist recently for unrelated reasons (my husband and I are having some disagreements about how best to parent a 17 year old… it’s hard!) and part of that required an intake form. I didn’t put anything in the form about thinking I might have ADHD, but after going through it, the therapist asked if I was ever diagnosed. I said no, but mentioned it had crossed my mind. \n\nThis began the process. \n\nI’m very fortunate that I didn’t have to jump through many hoops (I’ve read some pretty rough stories in this group!).\n\nAnd today, at age 42, I got an official diagnosis. I’m inattentive type. And I have to say how validating it is. I’ve gone my whole life feeling different and like an outsider and being awkward in situations with my work and family and social stuff. My brother has ADHD hyperactive, so my symptoms are different from his, and I always did so well in school - which is probably how it got missed all these years. \n\nBut finally, I can know there isn’t anything wrong with me. After feeling like a failure for not being able to just do stuff and not living up to my potential, I now know that my brain just works differently than other people. \n\nI’m going to make an appointment to discuss medication options, but I’m really hesitant to take anything. I’ve been on Wellbutrin for a while and it helps my depression, but I’ve taken some other antidepressants over the years that really messed me up. \n\nAnyway, I just wanted to share this huge milestone with someone who would understand!",
        "created_utc": 1678120412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Treating adhd without medication",
        "author": "cgilev25",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3e2i/treating_adhd_without_medication/",
        "text": "Hi I’m new to this thread. I’m 36 years old with adhd. I took adderall or concerta most of my life until I got sober almost 5 years ago. I dropped all medications just to prioritize my sobriety. I was hoping someone could recommend any literature to help me manage my adhd. I feel like I don’t even understand what I’m up against because I’ve just been dealing with it for so long. It’s hard for me to even perform basic daily tasks and progress throughout my life. \n\n*Medication is not an option for other reasons in addition to my sobriety. Not even Welbutrin \n\nThanks for anyone’s help!",
        "created_utc": 1678119925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall for ADHD",
        "author": "catluvr1233",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3deu/adderall_for_adhd/",
        "text": "Does anyone take adderall for their ADHD? Im on 20mg of the slow release pills and on 112mg of effexor for depression. I wanted to know your guy’s experience with adderall or if you take it with another drug. I find that I go through waves of feeling very energetic ( especially in the morning an hour after I first take them )and hyper to a wave of being super calm like i’m xanxed out. I wonder if this is a normal reaction to the pills or if maybe they are not right for me.",
        "created_utc": 1678119886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does that make sense?",
        "author": "keepitgoingtoday",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3d21/does_that_make_sense/",
        "text": "[removed]",
        "created_utc": 1678119864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impulsivity... if thats a word",
        "author": "PuzzelingAdventurer",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3cyr/impulsivity_if_thats_a_word/",
        "text": "I'm sure im not the only one here, but my wife and i both have diagnosed adhd (i was originally diagnosed with add, but it seems that's no longer a thing). Anyways I stopped taking meds in high school (class of 2015), and i impulsively do or buy things that i really can't afford. Now im over obsessed with a budget because of $30k in CC debt, but I still buy things on impulse or go on spending sprees when i face difficulties. For example, my dog just just suddenly passed away 6 yrs old, and we were going on a run, but she had a stroke. Since then, outside of her medical bills, I've spent over $300 and haven't even bought my groceries for the week. Does anyone have good advice on how to crack down on my impulsiveness without taking meds? I need to focus on things and its easy to push those thoughts away because \"ill deal with it later\" but bever actually deal with it.\n\nTLDR: I need help with impulse control without meds.",
        "created_utc": 1678119857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alcohol in urine screen for medication compliance. Will my script get cancelled?",
        "author": "Makeabettername",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3akx/alcohol_in_urine_screen_for_medication_compliance/",
        "text": "[removed]",
        "created_utc": 1678119711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety making ADHD worse?",
        "author": "Gain-Outrageous",
        "url": "https://www.reddit.com/r/ADHD/comments/11k3a5z/anxiety_making_adhd_worse/",
        "text": "So today I feel like I'm on the knifes edge of a panic attack. I've got some stuff going on that is just making me feel sick all the time. But I've noticed that my ADHD symptoms are so much worse. I've just been jumping between rooms all day doing half of everything, the hoover is in the hall, the windows are half cleaned, the washing has moved closer to the radiators 3x but not gone on yet. I've cleaned the washing machine but still have a load to do. I'm hungry, I can't cook but I've got the stuff out if the fridge. It took me going into the back room half a dozen times before I actually managed to turn the outside light off. Is this a thing? Ive never noticed before. I'm losing my mind, and I feel like I'm gonna be stuck here for another 3 days until I maybe get my head sorted out.",
        "created_utc": 1678119684,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do i do if i build up an tolerance for my medication",
        "author": "chance188",
        "url": "https://www.reddit.com/r/ADHD/comments/11k35bg/what_do_i_do_if_i_build_up_an_tolerance_for_my/",
        "text": "[removed]",
        "created_utc": 1678119390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally on a stim based med!",
        "author": "TheSheepdog",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2yrv/finally_on_a_stim_based_med/",
        "text": "[removed]",
        "created_utc": 1678118984,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bad is the adderall shortage in your area?",
        "author": "Unlucky-Parsley-602",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2yk5/how_bad_is_the_adderall_shortage_in_your_area/",
        "text": "Last week I called 33 pharmacies until I found one with my dose (10mg IR) in stock. I live in suburbs of Chicago. And these were all local pharmacies/ones at hospitals, didn’t call a single Walgreens/Costco cuz I knew they wouldn’t have any. I know the shortage is nation wide but wondering if it’s this bad everywhere. Has me really feeling like an addict, but no one could even give me an estimate of when they’d get it in so I just kept making calls.",
        "created_utc": 1678118969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outside of work, it is impossible for me to function as a normal human being.",
        "author": "Parasight11",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2v3x/outside_of_work_it_is_impossible_for_me_to/",
        "text": "I’ve recently turned 30 years old. My entire life I’ve probably had adhd but I wasn’t diagnosed until I was 18. I used meds from 18-26 but I quit for a long list of reasons, but ultimately they were ineffective in helping me live like a normal person and the negative side effects of stimulate drugs were taking it’s toll on me. (I’ve tried em all, also very knowledgeable on the subject)\n\nI’ve been thru so many different phases , tried so many different things, medication, no medication, meditation, zero sugar, literally everything.\n\nBy some anamoly I can perform very well at my job but it wasn’t until I got into a high paced, high stress manufacturing job 5 years ago that I found something I ‘enjoyed’ enough to hyper focus on for long periods of time.\n\nI find it near impossible to maintain any kind of schedule outside of work. It’s near impossible to bring my self to clean, I can’t organize anything no matter how hard I try-everything just gets piled beside me. I feel like I can’t even prepare and eat a meal like a normal person, I go to make a sandwich and just eat the meat and cheese right of the fridge.\n\nI’m lucky enough to have a partner I’ve been with for 9 years and have a 3 year old son together. She is a stay at home mom and takes care of the house, if she didn’t it would probably fall in around me because I can’t maintain anything but she resents me for it and doesn’t understand .\n\nI could go on and on about not functioning as a normal person but my iPhone keyboard has lagged this entire time and I am about to scream because of it…anyone out there feel me?",
        "created_utc": 1678118758,
        "upvote_ratio": 1.0
    },
    {
        "title": "What apps help keep you sane/functioning/organized?",
        "author": "muss_es_sein_",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2uxm/what_apps_help_keep_you_sanefunctioningorganized/",
        "text": "*I’ve given up on ever actually being organized, but you know… more organized. \n\nAnyway the title pretty much says it all. Are there any apps that have dramatically improved your quality of life? Ones you can't imagine living without now? \n\nI’m using one called “Forest” as I pack last minute now and it‘s helping a little. Would love to hear what has helped you all",
        "created_utc": 1678118748,
        "upvote_ratio": 1.0
    },
    {
        "title": "No one likes me",
        "author": "WorkingAd4794",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2trc/no_one_likes_me/",
        "text": "I know it sounds very melodramatic. Probably because it is! But I think I'm onto something here. I post this here because I partially blame my adhd for people supposedly not liking me. \n\nFor the first time in my life I have zero friends. I have no one to send messages to when something happens. I have no one to ask to go out. I usually keep a very positive and mature idea about this: I'm working more, I'm learning a lot of things, I don't have the resources to actively try to find and make friends. But I can't help but compare, other people seem to have friends naturally, why do I have to make efforts ? Also, it's not just about friendship. I feel like people normally don't seek me out to just talk. For example at work, people will gather around to gossip ou whatever and no one comes to me to talk to me about anything. The only way I have conversations is when people are forced to hang out with me because of work assigments or something like that. \n\nBefore you go there, I don't think I'm that bad of a person. I think I can be pretty funny sometimes, I have a tons os interests and I'm working on social skills, I keep the conversation on both sides, I'm on treatment, I don't think I' interrupting people that much. I initiate a lot of interactions and I keep the conversation about them too. But for some reason, people are just not talking to me and I'm starting to feel really hurt. The rejection feelings are kicking in and I don't know what I should do. \n\nI recently shaved my head and sometimes I think this has something to do with it. I'm a woman, 25 years old. I don't think that's it though, I remember already struggling with this when I had long hair. But now is definitely worse.\n\nThere's also the perception that I'm too innocent or maybe imature. Because when people are talking in groups I feel like they're usually talking about \"adult things\", like about their sexual life and gossiping about other coworkers. When I come in they just treat me like I'm an outsider. An alien. Everyone is very polite with me, but they don't get interested about me. I'm starting to think I'm a terrible person. \n\nI get angry about this sometimes and think about distancing myself by making myself more intimidanting, more closed off. Even getting tattos and keeping my head shaved is becoming very appealing so I can keep telling myself that I'm the one who chose to be alone. (In my country tattos could make you more intimidang) I'll do it anyway though haha I just want to do it faster to pretend I'm confident.  Anyway, how do I keep myself from thinking I'm undeserving?",
        "created_utc": 1678118675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having ADHD is like being genius and stupid sometimes at the same time",
        "author": "CommunicationTop8996",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2rkd/having_adhd_is_like_being_genius_and_stupid/",
        "text": "[removed]",
        "created_utc": 1678118533,
        "upvote_ratio": 1.0
    },
    {
        "title": "What helps you stay motivated?",
        "author": "wheredacookiesat",
        "url": "https://www.reddit.com/r/ADHD/comments/11k2k8r/what_helps_you_stay_motivated/",
        "text": "[removed]",
        "created_utc": 1678118090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help/Support - Homophobia/ADHD/Break-up because of Love",
        "author": "LovingGuy1",
        "url": "https://www.reddit.com/r/ADHD/comments/11k28uc/helpsupport_homophobiaadhdbreakup_because_of_love/",
        "text": "I got diagnosed and recently after that fell in Love with a perfect boy. He's an Indian boy from Malaysia and has moved to Berlin to study engineering. We complimented each others personalities like hand in glove, but from the beginning we had to face an issue. \n\nA combination of, racism, homophobia, home sickness, family responsibility caused my boyfriend to  blaming himself for orientation, inability to hold hands because of fear, impossibility of getting married, having children, him having to take care of his parents in the deep future. It was not that he wanted to have these things and I didn't but that we both wanted and he was unable to give me them. The thing is that most of these things where self-imposed expectations and even before meeting me have led to his low self-esteem which he raises by getting validation from dating apps and being kind but not overly sexual. \n\nOn my side, I'm fairly intelligent but my ADHD that I thought of as a little deal back then, with my impulsive behaviour and inability to empathise well especially over chat and him being a quite person -- led to his self-expecations mounting and make him break in crisis where he wanted to break-up so I could find someone that deserves me more.\n\nMy impulsive nature led to me crying passionately which led to even more self-blame and lower self-esteem which perpetuated and amplified this loop. \n\nWe had officially broken up and decides to have a break of two weeks to consider our emotions and feelings.  During that period I was blaming myself a lot or I was feeling numb till I read up on covert narcissistic behaviour and started interpreting our past as if he was self-centered and abusing me. \n\nThe thing is of course that I had faith in his kindness, so instead of lashing out I wrote a letter that didn't blame him explicitly but that put my worry in words, and of course that was also self-centered of me. He was confused...after that he decided to write a long reply which had some parts that triggered me, and instead of seeing it as a considerate message I replied with a question that triggered him. \n\nHe became very angry, but I didn't act later that night we had a call where he was blaming me and was finally happy to break free. I was crying and he said that he enjoyed it, which of course didn't last long before he started blaming himself again. Since then he wants to be alone, and I will talk to my therapist on Friday. I was considering if maybe I was a narcissist but after reading on emotional regulation issues and ADHD I realise our inability to understand ADHD has led to this, together with his low self-esteeem. \n\nI appreciate all the support, advice, even criticisms...just please know that we both have the best intentions for each other.",
        "created_utc": 1678117360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switched from Wellbutrin to Intuniv",
        "author": "DeerMeat220",
        "url": "https://www.reddit.com/r/ADHD/comments/11k27ws/switched_from_wellbutrin_to_intuniv/",
        "text": "I was diagnosed officially last month and my psychiatrist gave me Wellbutrin. I had increased anxiety, night sweats, mood swings, uncontrollable crying, etc within the first 4 weeks. It obviously wasn't helping so today she started me on Intuniv. This is one I haven't heard much about, even on here. Anyone wanna give me some feedback if they tried it before? I kinda feel like this might be a fail too :/\nThank you for any responses!",
        "created_utc": 1678117298,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my RSD has made me wanna withdraw from people and society",
        "author": "the_oracle_of_wifi",
        "url": "https://www.reddit.com/r/ADHD/comments/11k26pl/i_think_my_rsd_has_made_me_wanna_withdraw_from/",
        "text": "I live with my parents and everyday, I just always slip up and end up making them mad. They give me lots of leeway but I understand that they have the right get frustrated with me too...\n\nThings like: Not throwing the trash, not doing dishes, not caring for my younger siblings...they take that stuff *personally*. When I don't do stuff around the house, it comes across as \"I won't do it, so I expect YOU to do it instead, because I'm super entitled and dont care about your feelings\".\n\nI don't even know how to describe my thought process, but it's more like \"I don't wanna do that right now, but I can definitely do that later (sets a phone reminder)\" which is still selfish, but idk, it makes me mad when they assume what I'm thinking? I can't explain why it makes me so mad.\n\nBut obviously, the world doesn't revolve around me and not following instructions right NOW means everyone else gets held back. (Didn't do the dishes? Well now we can't make dinner! It's all your fault!! How could you be so selfish?)\n\nShit like that keeps happening, and I am just so done with it. I want to scream and cry because I know I'm being immature, but I just really wish I didn't have to plan my life around other people's lives? I can stomach that kind of work ethic at school, but at home, I just can't handle even *thinking* about other people 24/7. Maybe I'm so emotionally numb? But these conflicts happen at home, it feels so suffocating.\n\nI have a hard time tracking the trash, because *other people throw trash when I'm not looking* and suddenlynits filled up wven though I *just threw it out yesterday. And I get overwhelmed by doing dishes because even after I do ALL the dishes and then skip meals to study, I come back a few hours later *and suddenly there's even MORE dishes???*\n\nWhat's the deal with all these surprise boss battles??? It's like it never ends! Even when I do *nothing* I end up having to do *something* and it feels so unfair but hey, again, I live with my parents, so I have ZERO right to complain (sigh)\n\nMy parents believe that when I eventually move out, I'm gonna live in a pigsty. But you know what? I don't think so. You know why? Because I won't have younger siblings leaving toys and crumbs everywhere and other people adding to my shit when I know I don't have the mental energy today. It's gonna be so fucking spotless because I will *refuse* to create chores for myself in the first place. I hate how immature I sound, but ugh, a girl can dream, I guess.\n\nI am okay with cleaning up after myself, because I give myself a fuckton of leeway and I forgive myself when I make mistakes: because it only affects me. My feelings don't get hurt if I literally don't care. That kind of thinking  probably isn't healthy, but my current life doesn't feel healthy either.\n\nI feel stuck. I feel like giving into that idyllic image in my head is like \"giving in\" to my immaturity and it shows that I refuse to grow as a person. But oftentimes, it's the only thing that keeps me going: that ray of hope that someday I won't have to live like this anymore...\n\nSo yeah, I think my RSD has conditioned me to hate living with people! Can't be a disappointment if there's no one to disappoint! Now I just want to just give up on humanity and die alone. Maybe get a couple big doggos just to keep those ghosts away.\n\nSorry for ranting, I'll show myself out.",
        "created_utc": 1678117222,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am just tired of living like this. How can I get better?",
        "author": "madhav1113",
        "url": "https://www.reddit.com/r/ADHD/comments/11k25to/i_am_just_tired_of_living_like_this_how_can_i_get/",
        "text": "[removed]",
        "created_utc": 1678117168,
        "upvote_ratio": 1.0
    },
    {
        "title": "do you find it more difficult to do anything when on your period?",
        "author": "Dense_Hospital_Girl",
        "url": "https://www.reddit.com/r/ADHD/comments/11k21pk/do_you_find_it_more_difficult_to_do_anything_when/",
        "text": "[removed]",
        "created_utc": 1678116900,
        "upvote_ratio": 1.0
    },
    {
        "title": "help I've started working my dream job and now I just can't do school",
        "author": "26779",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1z37/help_ive_started_working_my_dream_job_and_now_i/",
        "text": "Context: I'm 18 and a senior in HS \nI started working as a white water raft guide recently and now that I'm 18 and legally an adult. The only reason I wanted to go to college was because of the influence of my parents. I have no interest in going to college even though I've committed to a school, because I despise school... I feel not quite burnt out but I feel like numbers that define your entire future are fucked up, I'm graduating HS just to go to another school to learn things that are completely unrelated to my major. I'm tired of putting my hard work and time into stuff THAT I WILL NEVER USE... I'm good with everything hands on, I've taken 2.5 years of carpentry and 2.5 years of automotive service classes at a trade school I need help what should I do",
        "created_utc": 1678116741,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mum ruined my motivation.",
        "author": "Low-Difference8938",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1y2k/my_mum_ruined_my_motivation/",
        "text": "I have been trying to tidy my room myself for months then I finally got motivated today then while I was tidying my mum came in and went on my computer then went on the phone and was trying to book something online and i couldn’t do anything with her in the room bc i just couldn’t. I told her loads of times to get out bc I knew this would happen she stayed in my room ignoring me for half an hour while waiting I went on my phone now I have ADHD paralysis and I’m not in the mood to do anything whatsoever and I have tears streaming down my face and I’m just crying’m so upset. I hate myself for being this way",
        "created_utc": 1678116678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diagnosed with ADHD at 27, away from home, overwhelmed.",
        "author": "Saanchi_N",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1xqa/diagnosed_with_adhd_at_27_away_from_home/",
        "text": "[removed]",
        "created_utc": 1678116660,
        "upvote_ratio": 1.0
    },
    {
        "title": "What apps help keep you sane/functioning/organized?",
        "author": "muss_es_sein_",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1v6j/what_apps_help_keep_you_sanefunctioningorganized/",
        "text": "[removed]",
        "created_utc": 1678116508,
        "upvote_ratio": 1.0
    },
    {
        "title": "hype me up, will you?",
        "author": "paralelepipedx",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1sfv/hype_me_up_will_you/",
        "text": "hi there :) I've been writing my undergrad thesis for a little iber two year and I get to defened it tomorrow morning!!!! (about 20 hours from now), but I'm of course an anxious mess and I can't seem to get up from the couch. Plus I'm fighting the worst case of tonsillitis I've had. So here I am, once again, looking for support, encouragement, funny stories, whatever you can throw my way to help me. Thank you so much!!!",
        "created_utc": 1678116336,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you can't turn your brain off, rest isn't rest.",
        "author": "existcrisis123",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1rve/when_you_cant_turn_your_brain_off_rest_isnt_rest/",
        "text": "I'm lying in bed, I've been unable to get up. But I've also been unable to sleep.\n\nI'm trying to tell myself that at least I'm lying down and resting. But I'm not. My mind has been churning for hours, depressing anxious thoughts nonstop. Then I go on my phone to stop it and the internet, posting, going down rabbit holes, reading hundreds of opinions and giving yours, it's a whole other type of exhausting.\n\nI just wish I could lie here and just think \"durrrrrr\" for 2 hours and finally feel somewhat recovered.",
        "created_utc": 1678116302,
        "upvote_ratio": 1.0
    },
    {
        "title": "What specialist can help me with personal scheduling?",
        "author": "youdontknowanything1",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1qkk/what_specialist_can_help_me_with_personal/",
        "text": "I realize it might be a very different case of ADHD and not many will relate to this. But in case anyone has an answer to my situation: I consider myself an extremely productive person, but at the same time I'm not getting anything done. How is it possible, you might ask? Well, even when I plan out my day minute by minute, and keep my distractions to a minimum, I can never truly keep my schedule. There is ALWAYS something that demands my attention, like dirty dishes, someone texting me and disrupting my schedule, but I can't ignore their request, dirty laundry that can't wait any longer, me having to pick up a thing from someone on Craigslist, having to buy groceries, random traffic ticket I have to pay off, having to do an urgent research for a new phone as I really need one and I have to make sure I spend a lot of time on researching it, etcetera, among many, many others, that I cannot postpone or ignore.\n\nAll of this while doing my main things: business number 1, side hustle/business number 2, creative hobby that I want to succeed in, foreign languages, politics books because I intend to pursue a career in that regard. \n\nI live alone, no partner/kids or anyone to take care of, I have friends and family but I spend a ridiculously low amount on talking to them, like a couple messages a week/a meetup a month. I love them but I value my freedom and time and I like this dynamic, I'm not complaining and I don't think I would want to change that. But somehow I still don't have absolutely any time it seems. \n\nI can't imagine owning a pet (even though I did have one growing up, I love animals to death, but it was a cat and I had minimum responsibilities). I can barely even fit in my workout routine (3 times a week, 1hr-1.5hr each). I almost always go to bed at 1:30am-2am and wake up at 8am, I can't imagine cooking for more than 5 minutes a day. Even while having frozens/Chipotle, it still takes time to heat food up, wash dishes, buy the food. I don't even eat more than twice a day because I'm perpetually busy and I simply can't fit in 3 meals a day even though I know it's not healthy. \n\nI have been keeping a diary of things that I plan on doing and trying my best to stick to them, but there is ALWAYS some urgent matter that overrides my plans at least temporarily and I can't predict those things. \n\nI guess my question is, is there any scheduling expert that can help me or do I have to talk exclusively to a psychologist? I feel like they won't really really helpful. I have a productivity problem, not really psychology.  Thank you to all for reading.",
        "created_utc": 1678116221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mixing elvanse(vyvanse) with water and drinking slowly throughout day",
        "author": "jibberkibber",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1i9y/mixing_elvansevyvanse_with_water_and_drinking/",
        "text": "Hi,\n\nis it possible to mix elvanse/vyvanse with water and then sip it slowly throughout the day? I’ve read a lot about people mixing it with water for splitting or drinking at once, but not a lot about dividing it into small sips throughout the day.\n\nMy body is extremely fast on taking in substances and getting rid of them. Elvanse/vyvanse is the slowest adhd-med i’ve tried yet but still only lasts for like 4 hours. And a higher dose than what im currently on would make the anxiety and comedowns unbearable. Appreciate any answers about the water.",
        "created_utc": 1678115708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could ADHD be the reason why I have no creativity or imagination?",
        "author": "GardenData61373",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1hhy/could_adhd_be_the_reason_why_i_have_no_creativity/",
        "text": "I had this issue ever since I was born. Whenever I was told to do something that required me to be creative and use my imagination like drawing or writing. I couldn't do it. I never could. I had to pay other people to write essays for me because my mind is blank. I cannot get words out. I wanted to learn drawing but like with writing my mind simply cannot produce a picture. There are some games like Minecraft I cannot play because they require creativity and imagination. I honestly don't know what it's causing this. People always tell me to \"keep practicing\" over and over again. I am practicing. It's not working. Heck. Even writing this post was difficult.",
        "created_utc": 1678115658,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do i do if i build up an tolerance to my medication",
        "author": "chance188",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1goy/what_do_i_do_if_i_build_up_an_tolerance_to_my/",
        "text": "[removed]",
        "created_utc": 1678115608,
        "upvote_ratio": 1.0
    },
    {
        "title": "A discussion about the evolutionary purpose of ADHD.",
        "author": "Easly_Distracted",
        "url": "https://www.reddit.com/r/ADHD/comments/11k1cy3/a_discussion_about_the_evolutionary_purpose_of/",
        "text": "[removed]",
        "created_utc": 1678115368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this sound like ADHD?",
        "author": "Chiyo_Best",
        "url": "https://www.reddit.com/r/ADHD/comments/11k196m/does_this_sound_like_adhd/",
        "text": "[removed]",
        "created_utc": 1678115127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for those in management roles with ADHD-PI to stop from sucking at work",
        "author": "pete53832",
        "url": "https://www.reddit.com/r/ADHD/comments/11k15rz/tips_for_those_in_management_roles_with_adhdpi_to/",
        "text": "Hi friends,\n\nI'm relatively new to my ADHD-PI diagnosis (five years or so). It's been good, so good in fact that I just got a promotion at work, working remotely. I'll now be leading a pretty big team, which scares the crap out of me because I often forget to drink water and will sometimes accidentally play video games all day instead and have trouble managing multiple priorities.  So basically, everything about my ADHD makes managing people a struggle.\n\nThese symptoms are WAY better than the days when I almost was fired, but still, I'm freaking the freak out. So, I'm hoping to get everyone's ideas on app, books, tattoos, ***whatever***, that will help me do a good job at this.\n\nThank you!",
        "created_utc": 1678114906,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone with ADHD from Italy?",
        "author": "Mindless_Selection34",
        "url": "https://www.reddit.com/r/ADHD/comments/11k13i1/anyone_with_adhd_from_italy/",
        "text": "Im from Italy and finding a way for some sort of cure seems impossibile as an adults. Just asking if someone had the same experience...i'm going to lose another job.\nIt seems that the only drugs available are ritalin an stattera but im sure the First Is incompatible with other disease i suffer.\nLooking for other people from ER, Italy\nCheers",
        "created_utc": 1678114775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Warning: ADHD Online, LLC requires you to submit a support ticket for everything",
        "author": "CostcoAisleBlocker",
        "url": "https://www.reddit.com/r/ADHD/comments/11k12w1/warning_adhd_online_llc_requires_you_to_submit_a/",
        "text": "For anyone considering ADHDOnline for their care, I wish I had known that they require you to submit a support ticket anytime you wish to transfer pharmacies, refill a medication or relay any information to your provider.  Response times to these requests can take 3-4+ weeks, if at all.  The only way to communicate to your provider is to schedule another 15 minute call for $99.  (This will be increasing to $169 btw). I had a positive experience taking the initial assessment and meeting with my caregiver for the first time. That’s not the case anymore.  I cannot recommend that anybody use ADHD Online.",
        "created_utc": 1678114731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the Vyvanse headache ever go away?? Tips?",
        "author": "londonbridges224",
        "url": "https://www.reddit.com/r/ADHD/comments/11k11le/does_the_vyvanse_headache_ever_go_away_tips/",
        "text": "Does the Vyvanse headache ever go away?\n\nI’ve been taking it for 6 days, headache wasn’t really noticeable for first couple days. Days 5 &amp; 6 have been really annoying, bad headache, won’t go away.\n\nSide note I’m female. Anyways wondering if anyone has experienced this, does it go away after awhile? Do you get used to it? Any suggestions for reducing it naturally?",
        "created_utc": 1678114637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brain falling asleep",
        "author": "datcelery",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0v64/brain_falling_asleep/",
        "text": "I feel frustrated that my brain feels like a separate entity from myself, capable of falling asleep on its own. Reading through college papers feels like the worst group project to exist with my \"partner\" who cannot get their ass up whenever it gets dull. And when I do try to listen to my brain and have nap or rest, it STILL betrays me by not falling asleep because _ I_  am not actually tired or I take a break and instantly \"wake up\" by simply looking at something more interesting, making me seem like I'm actually just lazy and very well capable of discipline.",
        "created_utc": 1678114190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctor recommendations?",
        "author": "drduckslinger",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0uo2/doctor_recommendations/",
        "text": "I recently moved to a new town and do not have a primary care doctor of any kind. I am looking for someone to help me combat my ADHD and don’t know exactly where to start. \n\nWhat type of doctor should I be looking for?\n\nAny advice on how to approach the situation without sounding like someone who just wants drugs? \n\nTIA",
        "created_utc": 1678114153,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone with ADHD from Italy?",
        "author": "Mindless_Selection34",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0tzv/anyone_with_adhd_from_italy/",
        "text": "[removed]",
        "created_utc": 1678114104,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've never not been exhausted in my life",
        "author": "PrincessxBoom",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0t8z/ive_never_not_been_exhausted_in_my_life/",
        "text": "I am fucking tired all the time. Doesn't matter how much I rest. Keeping a good sleep routine, eating well, living the healthiest lifestyle of my life currently and feel worse than ever. Coffee and meds make me even more sleepy. I'm doing everything that I'm \"supposed to\", I'm working so hard on my mental and physical health yet I feel worse than I ever have. I am so fatigued and nauseous I can't get out of bed most days. Doctors can't find anything wrong with me physically but I genuinely feel like I am dying. I have been tired since the day I was born. I can't remember a time when I wasn't tired. I have so little energy. I am tired. Losing my mind.",
        "created_utc": 1678114050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone try purely DARI meds?",
        "author": "v1ns",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0sfx/did_anyone_try_purely_dari_meds/",
        "text": "I took an SSNRI for 2 years and stopped because I felt the Noradrenaine makes me even move anxious and constantly puts me into fight or flight mode. Replaces with a pure SSRI since about a year and feel much better, but my ADD ist still tough as hell.\n\nI am scared to take anything with Noradrenalin inhibitor because I almost went into a full blown psychosis last time.. Hella scary..\n\nI read that there are very few only dopamine inhibitor drugs.\nHas anyone tried them?\nWhats your experience with those?",
        "created_utc": 1678113999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vaping while on ADHD medication",
        "author": "AstroFarlen",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0r02/vaping_while_on_adhd_medication/",
        "text": "Does anyone else feel like they hit their nicotine vape excessively while being on their medication? \n\nI swear that I hit this vape a thousand times a day and it doesn’t even make me feel anything anymore. I think it’s a nasty habit but I can’t let it go. Any negative experiences or things to scare me away from this?",
        "created_utc": 1678113901,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Radio",
        "author": "datcelery",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0pin/adhd_radio/",
        "text": "That's what I call brain tab 1 out of 26374726 which is always some random ass song, melody or even just a snippet of a commercial stuck on loop like a broken record. It's sometimes annoying but really the most adorable thing about my adhd imo. My brain literally plays music for me to entertain myself, I mostly appreciate it. Today's brain radio has this song on repeat:\n\nhttps://youtu.be/GUSi-Rb0ixY\n\nWhat's your radio like today?",
        "created_utc": 1678113795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Look into L-Tyrosine! It’s an amino acid that’s metabolized to produce dopamine",
        "author": "worldofpain100",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0gd8/look_into_ltyrosine_its_an_amino_acid_thats/",
        "text": "I recently started taking 500mg of L-Tyrosine in the mornings with my Vyvanse, and I have noticed a much greater absence of executive paralysis! It is so much easier for me to start and focus on tasks with this in my system, and it brings me up to a normal baseline of dopamine. It feels natural too, because it is naturally occurring! I highly recommend looking into trying this!",
        "created_utc": 1678113132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall and acid reflux. Has anyone found a solution?",
        "author": "Lolabunnee",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0dgn/adderall_and_acid_reflux_has_anyone_found_a/",
        "text": "[removed]",
        "created_utc": 1678112934,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get out of this slump?",
        "author": "GomuGomuNoKush",
        "url": "https://www.reddit.com/r/ADHD/comments/11k0aw5/how_can_i_get_out_of_this_slump/",
        "text": "[removed]",
        "created_utc": 1678112747,
        "upvote_ratio": 1.0
    },
    {
        "title": "phone games??",
        "author": "dazaibee",
        "url": "https://www.reddit.com/r/ADHD/comments/11k07hb/phone_games/",
        "text": "what are your go to phone games that you  love to play whicu gives u the reward rush?\npersonally, it changes for me every once in a while, sometimes it is some cute restaurant game (animal restaurant is amazing) or something basic like subway surfers. recently I've not been able to find something new to hyperfixate on so need some game recommendations (free if possible since they get discarded after a while T-T)",
        "created_utc": 1678112496,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Cookbook",
        "author": "asalz437",
        "url": "https://www.reddit.com/r/ADHD/comments/11k070l/adhd_cookbook/",
        "text": "Hey all, I’m a recently diagnosed grad student.  Currently getting my master’s in Gastronomy and for one of my classes I am writing a cookbook proposal.  I really want to do something geared towards folks with ADHD, especially because ADHD is really affecting my ability to feed myself right now.  I’ve gone to culinary school (one of three career paths so far lol) only problem is, I’m still learning about ADHD myself.  So I wanted to come here and ask some advice, if anyone’s willing.  \nMy idea was to have this cookbook organized by effort level and to list some of the sensory needs/benefits of each recipe (e.g. crunchy, salty, sweet) with a ton of pictures and very clear but concise instructions.\nSo what I wanna ask is:\nWhat do y’all dislike about cookbooks that you’ve tried to use in the past?\nWhat has been helpful in a cookbook or recipe for you?\nGot any other kitchen related tips or tricks? —(Like how to keep on top of dishes. ‘Cause I’m struggling)\n\n\nThanks for reading!",
        "created_utc": 1678112464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could ADHD be the reason I have no creativity or imagination?",
        "author": "GardenData61373",
        "url": "https://www.reddit.com/r/ADHD/comments/11k05jo/could_adhd_be_the_reason_i_have_no_creativity_or/",
        "text": "I'm currently undiagnosed but the more I research ADHD the more I relate to it.\n\nThe issue I always had is whenever something requires me to be creative and use my imagination I'm unable to do so. I never was good at things that required those two. Drawing, writing etc. Heck, even writing long Reddit posts is difficult because I have no idea what to write. Even in certain video game I have issues with creativity. For example Cities Skylines. All my cities are grid because I simply cannot do anything else. Or Minecraft. I can only build an oak house. That's it. The most common answer I get for everything I try is \"just keep practicing\". But even if I try practicing it doesn't make a difference.",
        "created_utc": 1678112366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do your comorbidities actually help you?",
        "author": "WolvesNGames",
        "url": "https://www.reddit.com/r/ADHD/comments/11k04gg/do_your_comorbidities_actually_help_you/",
        "text": "I've come to realise that the anxiety I have actually help me control my symptoms. I've been chronically late (a few minutes) since childhood (among other things) and after I was out of school in highschool for a few months due to chemo my anxiety was significantly lower and I found it **very** hard to not be even 1h late to places. \n\nAfter this I also developed depression (probably due to chemo AND the side effects of my ADHD symptoms now being stronger than before) but when I tried an antidepressant (1 day only) for it I literally was out of control, I felt almost drunk and my filters were non existant, I was hyper even though I'm usually not so hyper and just decided I don't want to deal with this, despite that state making me feel amused. In the meantime my depression got way better once I dropped out of university and got a WFH job.\n\nHas anyone else found that their ADHD symptoms are controled by their anxiety and maybe their depression which contributes to you being almost normal member of society (without medication or behavioral therapy) in spite of the negative psychologial effects?\n\nP.S.: I'm not medicated, I want to go to my family doctor for a referance next week and start an official proper diagnosis (was kinda diagnosed but through the DSM-5 symptom list by a psychologist not experienced with ADHD and it took a long time to find a psychiatrist specialised in ADHD in my country and city).",
        "created_utc": 1678112290,
        "upvote_ratio": 1.0
    }
]