[
    {
        "title": "My adhd symptoms are now too obvious at work and I'm terrified now being asked why I behave the way I do. Help",
        "author": "Double-Lychee8987",
        "url": "https://www.reddit.com/r/ADHD/comments/11inzzd/my_adhd_symptoms_are_now_too_obvious_at_work_and/",
        "text": "Seems like a bad idea disclosing it and also a bad idea not disclosing it at the same time. \n\nI also don't want to be seen as making excuses too. It just makes things harder for me but not impossible. I'm also about to start my period so my medication is useless so my symptoms are naturally worse anyway right now. Even on birth control to level me out it still sucks. \n\nToday I kept forgetting things unintentionally and starting cleaning tasks before finishing the next one and at times appearing scattered. Have been working at a new job for just over a month so I'm not even that new. \n\nOnly being able to function during busy and hectic periods but almost paralysed during quieter periods as I wanted to do everything at once and getting off comments starting something not quite as important as something else but then being scared to ask what is more important... as I should know this and it's simple and I appear more incompetent. As anyone with a pulse would know what to do next easily without being prompted. \n\n\nAt the very end of the day I forgot to properly clean the sink. I cleaned everything else being distracted as the thing I cleaned naturally led to other tasks I had to complete right on time. I naturally came back to the sink then began cleaning it out. \n\nThen I got asked why I seem to struggle at times with simple things, why I still sometimes ask questions or worry about forgetting things when I should know, if I need to have things broken down further (said in way in a sense that only idiots would need to have it broken down). I just said I don't know. Cried driving home. \n\nI just feel so awful. Why can't I do and behave and think like everyone else. I feel so useless at times and constantly frustrated feeling my brain not work with me when I just want to do things :( I work 5 days which is normal but feels brutal at times and I seem to get tired faster but I have to hide it too.",
        "created_utc": 1677992121,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m really bad at cleaning",
        "author": "iknowaplace5",
        "url": "https://www.reddit.com/r/ADHD/comments/11inzgb/im_really_bad_at_cleaning/",
        "text": "This applies mostly to cleaning my room. I have the age old adhd problem of starting to organize a part of my room, but subsequently making another part disorganized in the process. For example, I had a box full of random items that I’ve neglected to go through for months. Finally decided to tackle it, but now most of it is in a pile on the floor because I ran out of focus to continue finding homes for everything. That’s what makes cleaning so frustrating. It’s never “clean”. The clutter just takes a different form. \n\ndoes anyone have some tips for being able to actually finish a cleaning task?",
        "created_utc": 1677992076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with switch from Adderall XR to Vyvanse",
        "author": "phonehome22",
        "url": "https://www.reddit.com/r/ADHD/comments/11inyb8/struggling_with_switch_from_adderall_xr_to_vyvanse/",
        "text": "For some background - I was diagnosed with ADHD 3 years ago (mid-20s). Up until the end of 2022, I had only taken Adderall. Aside from a brief stint of 20mg XR + 10mg IR, my dose had consistently been 20mg XR for at least 2 years. I would often times skip the meds on weekends or when I was on vacation. Like many, I struggled to get my hands on Adderall starting in August 2022. Between August 2022 and January 2023, I only managed to get 2 refills so I have not had the ability to take the medication consistently. While taking Adderall, I did not have many negative side effects. I did get the jitters but they only lasted for about 30 mins before I was able to settle into my day. Appetite was impacted but I quickly found a way to manage it and by 3/4pm hunger came back. When I was taking the 10mg IR in the afternoon to extend my day, the dry mouth got too bad and I went back to only taking the the XR.\n\nRecently, I talked to my doctor about switching to Vyvanse. With no end in sight on the Adderall shortage, I as willing to try (and pay for) something that was easier to get. Another reason behind the switch is that I am making an international move in the next couple of months and Vyvanse is less of a hassle to get in the country I am moving too.\n\nMy doctor started me out at 50mg dose, so no build up in dosage like I had done when I was started taking Adderall. She mentioned there was guidance on what dose to start at based on the dose of Adderall that worked well for me. I read online about folks having enjoyed the transition from Adderall to Vyvanse so I was hopeful it would be smooth.\n\nI've been taking the medication for 3 weeks now. From an ADHD perspective, the medication has been great, feels way smoother than Adderall. Lasts longer which is great because XR only gave me 6-8 good hours. Mentally, I haven't had mood issues, I don't feel empty inside. Now physical side effect wise, overall I am struggling. It definitely impacted my sleep, that was solved by taking the medication earlier then I was used to. I take the meds as soon as I wake up (Adderall I would wait until 8:30-9am). The appetite suppression lasts way (way) longer than I am used to. I've gotten back into the routine of having a big breakfast but it hits 6/7pm and I am still not hungry. This is impacting my overall energy levels and ability to work out which sucks. I am working on ways to manage this (setting reminders, eating low volume / high calorie snacks, going into the office so I remember to eat when everyone else eats lunch), but it is still a work in progress. The worst part has been the impact to my digestive system. I have been skipping the medication on the weekends, mainly because I sleep in too late. So I take the medication M-F and like clockwork, Friday afternoon, the tummy starts to rumble and I've got a date with my toilet for the evening. My poops have definitely been off throughout the week and I have attributed that to eating less/more infrequently, but the food poisoning reminiscent diarrhea has me stumped. Diet wise, I've made no changes from the usual and I never had memorable digestive issues with the Adderall so I really think it is coming down to the new medication.\n\nIt has only been 3 weeks so I am committed to giving myself some time to adjust. I am not supposed to see my doctor again until mid-April, but I've reached out to her office to find an appointment sooner. In the meantime, I wanted to see if anyone has had a similar experience with the switch from Adderall to Vyvanse? If so, did it get better with time or was there something specific that helped? A lot of the experiences I've read about switching have been more positive than mine is tracking. I am hoping if I can get the food intake down, that will help. Also hoping I can talk to my doctor about dosage to see if we just came out of the gate too fast with 50mg.\n\nTIA!",
        "created_utc": 1677991972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strattera Constipation",
        "author": "daniel180808",
        "url": "https://www.reddit.com/r/ADHD/comments/11inpgz/strattera_constipation/",
        "text": "[removed]",
        "created_utc": 1677991220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short term memory loss and adhd",
        "author": "chaothiccc",
        "url": "https://www.reddit.com/r/ADHD/comments/11inpa8/short_term_memory_loss_and_adhd/",
        "text": "urmmm so i’m trying to figure out why i keep forgetting small things and thought this community might have insights. \n\ni’ll turn the tap on and then go back to turn it on and realize i already did - didn’t remember. \n\nturning the light off - i’ll be in bed and be like how did the light turn off \n\nit’s happening way too often for little things and feels weird",
        "created_utc": 1677991208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple way I've found to be more productive and less stressed if you have a lot of tasks to do",
        "author": "PotentiallyAnts",
        "url": "https://www.reddit.com/r/ADHD/comments/11inoni/simple_way_ive_found_to_be_more_productive_and/",
        "text": "[removed]",
        "created_utc": 1677991160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderal Question Regarding Mood",
        "author": "MustangJim226",
        "url": "https://www.reddit.com/r/ADHD/comments/11inok4/adderal_question_regarding_mood/",
        "text": "Hey guys. Prescribed 5mg twice a day since December. The first two weeks were…dare I say…AMAZING. I was happy, outgoing, getting shit done, working harder etc. Now it’s March and 5mg just doesn’t give me the same euphoria or benefits to my mood and personality. I still focus, but not like HYPER focused.\n\nAny insight? Should I consult the doctor for a higher dose? Should I try a higher dose? Anything else you suggest I do? I miss the way I felt those first two weeks and it pulled me out of a slight depression and changed me!\n\nInterested to hear what you guys have to say and what your experiences are.\n\nTIA",
        "created_utc": 1677991151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple I found to be more productive and less stressed when you have a lot of tasks",
        "author": "PotentiallyAnts",
        "url": "https://www.reddit.com/r/ADHD/comments/11inngk/simple_i_found_to_be_more_productive_and_less/",
        "text": "[removed]",
        "created_utc": 1677991057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Booking a appointment with a psychiatrist",
        "author": "StagnantProgress-",
        "url": "https://www.reddit.com/r/ADHD/comments/11inhfe/booking_a_appointment_with_a_psychiatrist/",
        "text": "Should i call a psychiatrist to see if i can get diagnosed?,I've been unmedicated for far too long.I was diagnosed when i was like 14 and now i am 28 i forgot why they stopped my treatment.I am kind of feeling doubtful about the meds enhancing my life,maybe it’s just that i have substandard IQ level because of my intellectual disability and that’s why my concentration is really poor and so is my memory.",
        "created_utc": 1677990554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Write to your state senators about how the medication shortage is effecting you? Please..!",
        "author": "Agreeable-Detail-820",
        "url": "https://www.reddit.com/r/ADHD/comments/11inhen/write_to_your_state_senators_about_how_the/",
        "text": "Does anyone have a template that we can use summing up the fact that the ADHD medication shortage has been negatively effecting our lives….. I was told by my doctors office to write to the state senators as well.. If we all do this we maybe, just maybe, give this issue a priority. Thanks..\n\nIf you have a template or something among those lines please share it and send it to me.",
        "created_utc": 1677990552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I hire a carer?",
        "author": "brownie627",
        "url": "https://www.reddit.com/r/ADHD/comments/11infn5/should_i_hire_a_carer/",
        "text": "I’m 23F, and I suspect that I have undiagnosed ADHD. I am diagnosed autistic. I also deal with depression and anxiety. I’m really struggling with keeping up with daily tasks, it’s really overwhelming, and often I have to choose whether I can spare the energy for doing chores or doing my university work. I’m thinking about hiring a carer, but I have no physical disabilities and because I’m so young I feel like I don’t deserve the care. I know I’m struggling to deal with daily life, though. What are your thoughts on this? I’m from the UK if that helps anything. Thank you.",
        "created_utc": 1677990404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coping and Studying Help",
        "author": "vellichorandtsundoku",
        "url": "https://www.reddit.com/r/ADHD/comments/11inffm/coping_and_studying_help/",
        "text": "Hello. Obligatory mobile notice. I have ADHD (duh) and I'm barely starting college but it's only been a couple of semesters and I feel like I'm drowning. Everytime I go to start an assignment, I can't kickstart my brain into studying (instant gratification monkey). I feel like shit all the time because I constantly avoid work and later get jittery when everything is due. I try to keep schedules, formulate better study habits, take breaks etc. but nothing seems to work and I can't bear it. I can't face the fact that I have many more years of studying up ahead (I want to be a surgeon). If I can't deal with introductory level classes then how can I advance to higher levels with larger and more exhausting work? I KNOW what I'm doing isnt right or helping me but it's like I can't stop. How can I get over this? How can I create a better version of me that doesn't make me want to die? I want things to get better, I don't want to be in this cycle anymore. Thank you. By the way, is this the right flair? This is my first post here, sorry.",
        "created_utc": 1677990387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difficult to start but immersive once I do so",
        "author": "Blue_Hooves",
        "url": "https://www.reddit.com/r/ADHD/comments/11inbji/difficult_to_start_but_immersive_once_i_do_so/",
        "text": "Hi! So I (16f) issues starting anything, even if i enjoy it. My family has had adhd for generations on my dad\"s side and I got it quite badly. Working out, school work, anything to be honest always seems like such a struggle for me to start. However, when i grt myself to do it, Im usually sucked into it. Tje hardest part is if I get distracted even for a minute. I have to go through the process of fighting to get myself to do it again. Im an AP student and it's crushing my ability to do homework. I alwahd get distracted when doing homework either bc of my fsmily, bathroom break, hungry, ect. Its hard for me to find a middle ground where i have balances impulsiveness, control, and levels of dopamine ect. Im probably just renting but hopefully this gets posted because I reall just need to share this crushing bag of bull. If anyone has any suggestions as to how i  might fix/help it thst would be great but this isn't primarily about question and answer, just me sharing. Thank you",
        "created_utc": 1677990070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Caffeine with Inattentive type?",
        "author": "YouGotInked",
        "url": "https://www.reddit.com/r/ADHD/comments/11inapd/caffeine_with_inattentive_type/",
        "text": "Does caffeine affect hyperactive and inattentive types differently? I am inattentive type ADHD and caffeine…. It’s okay. It seems to quicken my heart a little so I can’t have too much, but otherwise I think it kind of helps wake me up because having my heart beat a little faster does remind me to stay focused. I don’t particularly like the feeling so I only drink it when I’m dead on my feet and need to not be, or maybe just a little bit, which is fine, like 1/3 of a mug. I’m curious if this is something other people with inattentive type experience.",
        "created_utc": 1677990008,
        "upvote_ratio": 1.0
    },
    {
        "title": "i can’t do school work because of my special interest",
        "author": "sydney_raine",
        "url": "https://www.reddit.com/r/ADHD/comments/11in78f/i_cant_do_school_work_because_of_my_special/",
        "text": "my brain just simply will not let me get any work done because i am too busy wanting to put all of my thoughts and effort into my special interest. i’m a senior in college and i have a full rough draft of my thesis due on Wednesday and i haven’t worked on it in a week because all my brain wants me to do is read manga. how do you all get out of that specific funk of doing stuff you know you need to do but don’t want? i’m usually pretty decent with setting boundaries with myself but in this moment i cannot stop myself from pushing my thesis further and further away and bringing my special interest closer and closer.",
        "created_utc": 1677989721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Complete vitamin and mineral supplement",
        "author": "usernameperson101",
        "url": "https://www.reddit.com/r/ADHD/comments/11in2ym/complete_vitamin_and_mineral_supplement/",
        "text": "Hi all,\n\nI’ve read about this supplement powder on here before but can’t find it, do any of you recall what it is?\nThere’s a supplement that’s meant to be a complete vitamin/mineral/greens powder. The post I read was for picky kids with adhd but I’m a picky adult with adhd who struggles to eat a nutritionally balanced diet and gets super overwhelmed trying to optimise/make it perfect and I’d love to find this supplement again.",
        "created_utc": 1677989379,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling anxious about getting a job, and getting told to also look into collage, also, may not drive a car or maybe?!",
        "author": "Ill-Candy-4926",
        "url": "https://www.reddit.com/r/ADHD/comments/11in2he/feeling_anxious_about_getting_a_job_and_getting/",
        "text": "ok,  so im nervous about getting employed because of my constant mental shutdowns,  and anxiety,  and im nervous im gonna have another mental shutdown again due getting overwhelmed. \n\nim also getting told to look into collage,  which isn't something im very intrested in at the moment tbh,  and me getting pissed off,   i tell my dad  \"i thought you only wanted me to do one thing at a time?  why the hell are you pressing me about collage when your telling me to also get a job?    and my dad goes silent and tells me \"Ok fine, just forget it.\"  \n\ni wanna drive a car,  but ive came to the realization that due to my constant mental shutdowns  and constant anxiety,   that may never be possible for me,   (and is very unsafe due to me possibly killing other people unintentally due to my anxiety disorder and it's just dangerous)   and guess what?  GUESS FUCKING WHAT,   MY DAD GETS MAD AT ME AGAIN telling me \"i thought you wanted to drive?\"   and my NON ADHD brother laughs at me as im starting to mentally shut down  telling me \"you haven't practiced your driving in a year\"      WELL NO FUCKING SHIT,   WHAT DO YOU WANT ME TO DO??!  FUCKING KILL SOMEONE WITH MY PANIC ATTACK??!!?!??!!?  THAT SHIT IS DANGROUS AS FUCK, ME DRIVING IS DANGROUS WHILE IM HAVING A PANIC ATTACK,  AND IM CLEARLY OVERSTIMULATED SO SHUT THE FUCK UP YOU NON ADHD BROTHER!!!!  \n\n&amp;#x200B;\n\nto make matters worse,  my dad just laughs as im trying to explain to him  that he's seen me almost crash into a firehydrent and nearly crash into a car,   and just tells me to \"stop talking about it,  as im clearly just on the verge of tears once again,   tbh,  as much as i wanna drive,  im being self aware and realizing my limitations early on so that i don't kill someone with my anixety (or accidently kill myself while driving)   and to be fair,   i don't trust myself behind the wheel of a car,  and my processing is like the equivlant of a apple computer from 1995,   and i get overwhelmed trying to process everything and mentally shut down while driving. \n\n(thanks fucking overpriced US healthcare system,  you've failed me once again  by not letting me get a phcyatrist in person,  and delaying my offical diganosis,  on weather i have ADHD combined with autsim or just ADHD in general,  or both.    even tho my mom tells me that self digonsing is bad,  and i tell her  \"well,  what else do you want me to fucking do  when healthcare is so overpiced?   btw,  i forgot to mention,  money isn't my strongpoint,   and i have a severe math disability.  \n\n&amp;#x200B;\n\n(and i just hate myself,  on the inside,  but i love myself on the outside.)",
        "created_utc": 1677989341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally getting evaluated!!!",
        "author": "Br199an",
        "url": "https://www.reddit.com/r/ADHD/comments/11in14y/finally_getting_evaluated/",
        "text": "After years of confusion, doubts, denial, misdiagnosis, &amp; more. I have been struggling with this for years I (16m) have been trying to get my parents to have me evaluated. They always denied the possibility even though my dad and older brother have adhd, though I never understood why they refused. I have been told that I have OCD because of my “random” over-fixation on things, told i might be slightly autistic because of my SEVERE hyper sensitivity. I have assumed that it was just me being lazy and/or depressed (also being evaluated for depression as well). But I am hoping after my appointment Monday that I will finally have those answers, wish me luck…",
        "created_utc": 1677989232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remembering the names of movie characters.",
        "author": "Astronst",
        "url": "https://www.reddit.com/r/ADHD/comments/11imwt3/remembering_the_names_of_movie_characters/",
        "text": "Honestly, it grinds my gears. I’ll watch a movie and then try and speak about it with a mate and I just can never remember the names of said characters. Then I’ll just explain their physical features which usually makes the conversation more long winded.\n\nIt’s the same with anything that requires me to remember names and unless I keep repeating that name over and over, I don’t remember it. \n\nDoes anyone have any ways on remembering them? Thanks",
        "created_utc": 1677988887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former addicts with ADHD: Were you able to get over your addiction and live a sober life without ever taking prescribed stimulants?",
        "author": "necessary_cactus",
        "url": "https://www.reddit.com/r/ADHD/comments/11imuzg/former_addicts_with_adhd_were_you_able_to_get/",
        "text": "My sibling was diagnosed with adhd as a child. He was given adhd medication as a child for a short time but it was a bad experience. (I don’t know which medication and I don’t know the details.) Since then, he has been turned off by ADHD medication. That was the only adhd treatment that my mom attempted. After that, they pretty much ignored the issue of adhd. He was not given much education about how adhd affects the brain nor any education about coping strategies. \n\nBy the time he was a teenager, he was addicted to drugs and alcohol. He has been struggling on and off for the past 15 years. Even though he know he has adhd, he has not learned much about it. Part of the issue is that he is not in touch with his emotions and needs. He was raised in a way that made him suppress his emotions. \n\nMy mom used to vilify adhd medication until I got diagnosed and started taking stimulants a few years ago. My brother still vilifies adhd medication though. I think his distrust of adhd medication deters him from wanting to seek treatment. I wish I could explain to him that learning more about adhd and learning coping strategies would help. (I am very aware of the irony of him distrusting prescribed medication, yet unhealthily self-medicating everyday. Ugh)   \n\nSo, I’m wondering if any former-addicts with adhd in this sub can related to my brother’s situation. Were you reluctant to learn about adhd and treat it with therapy  or self-help? Have you been able to live a functional, sober life without adhd medication? I would love to hear about your recovery journey. \n\n\nThanks for reading this far. I know I have to let go and love him from afar. I already do that and I’m not very close to him. It’s just really sad to watch him and the rest of my family struggle.",
        "created_utc": 1677988761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents never learned to help me",
        "author": "Zrade_",
        "url": "https://www.reddit.com/r/ADHD/comments/11imt0e/parents_never_learned_to_help_me/",
        "text": "Growing up I was told men don’t cry don’t show emotions. Obviously that’s not an easy task when you can’t regulate your emotions like others. It eventually turned the point I just don’t show emotions at all for anything. To this day still (I turn 24 this year) all I ever get is insulted and called lazy because I forget to do things or feel like I never have time to do anything and I just mentally shut down from panicking or getting yelled at for not being good enough. I was never allowed to see a therapist, but guess what both of my sisters were given one and neither one has any disorder and yes both were tested. I was always compared to every other kid growing up by my parents. My parents are both nurses so you’d think they’d understand or do research. They never did. It’s gotten to the point for the last 7 years of my life I wish I had either just not been born or been born normal. I’d give up half of my life expectancy and die at like 50 if it meant I could of been born normal",
        "created_utc": 1677988596,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm taking Strattera and now caffeine makes me super anxious.",
        "author": "New-Opportunity-5447",
        "url": "https://www.reddit.com/r/ADHD/comments/11imsk5/im_taking_strattera_and_now_caffeine_makes_me/",
        "text": "I was able to drink coffee with little to no anxiety before I started taking Strattera (40 mg). Not sure if it matters, but I take the generic. Yeah, so anyways I seriously can't drink coffee anymore without feeling like my body is going to internally combust. I get catapulted into fight or flight mode and it gives me a sensation as if the sky is falling. In other words, it gives me a major anxiety attack for hours. I've been taking this dosage for about three weeks now. I freaking love the taste of coffee, but I can't live like this. The Strattera is helping, I think, but it's hard to tell with the whole caffeine issue. Am I alone in this? Why the heck is this happening?\n\nTLDR: Caffeine gives me way more anxiety compared to before I was on Strattera.",
        "created_utc": 1677988561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research on ADHD Adults",
        "author": "shravanya20",
        "url": "https://www.reddit.com/r/ADHD/comments/11immdi/research_on_adhd_adults/",
        "text": "[removed]",
        "created_utc": 1677988048,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know why I did this..",
        "author": "Prudent_Target_7380",
        "url": "https://www.reddit.com/r/ADHD/comments/11imkpg/i_dont_know_why_i_did_this/",
        "text": "Someone I work with was talking to me about a career field and after they walked away I looked into it.. sent in a college application and ordered transcripts. I don’t even know (or think) this is what I want. I swear the impulse control just took over. Have you ever found yourself doing something like this before? Like hyper fixating on an idea or goal without even realizing what you’re doing or getting involved with. This triggered me because I have been feeling kind of trapped or helpless about my career lately and the next steps.. so I guess in a frantic impulse I looked into it and figured ‘Oh I’ll take classes’.. and i’m over here applying for a certificate program.. felt like an episode I’m still wondering where that came from.. welp that’s $40 down the drain..",
        "created_utc": 1677987914,
        "upvote_ratio": 1.0
    },
    {
        "title": "teeth are killing me",
        "author": "enough37",
        "url": "https://www.reddit.com/r/ADHD/comments/11imkl0/teeth_are_killing_me/",
        "text": "so I accidentally doubled up on my adderall dose which led to zoning out and clenching my jaw for a long enough amount of time that it feels like my teeth are going to fall out. I can't keep my mouth still at all. if I'm not clenching then my mouth is really wide open and I cant keep my tongue still.\n\nwhat can I do right this second to make this bearable? I've seen people recommend gum for teeth grinding but I don't have any and it's too late to get to the store tonight. any input is welcome for this tweaking",
        "created_utc": 1677987907,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD and High Blood Pressure?",
        "author": "SKirby00",
        "url": "https://www.reddit.com/r/ADHD/comments/11imk52/adhd_and_high_blood_pressure/",
        "text": "Does anyone here have ADHD and High blood pressure?\n\nI'm 22 and have finally gotten diagnosed with ADHD in January after waiting a year (not to mention a false negative test 5 yrs ago) but my doctor won't prescribe me stimulants unless I can get my blood pressure down to normal levels, which means dropping it by a solid 10-15 points. Stratera is an option otherwise, but I'd rather at least try a stimulant treatment if I can because of how very badly I reacted to Wellbutrin (another non-stimulant) last year before my official diagnosis.\n\nI've already started taking steps to improve on my blood pressure, such as dramatically cutting down on salt, cutting down on red meat, and trying to make sure I get a minimum of 30 mins of light/moderate exercise in everyday (am already in decent shape though, and some days I do exercise more heavily). I do wonder how much the stress of not knowing if I'll be able to pursue effective treatment, not to mention the month that just got added to my wait time because of this, is in turn, increasing my blood pressure even more than normal. Feels like I'm stuck in a catch 22 because all the things that I need to do to finally get treatment are harder for someone who has ADHD.\n\nHas anyone here been through this? Really feeling alone in this uphill battle right now, not being able to find much help online, beyond adjusting my diet. Would love to hear your stories and especially any advice you might have. I also haven't ruled out CBT but really do want to try effective medication if at all possible.",
        "created_utc": 1677987870,
        "upvote_ratio": 1.0
    },
    {
        "title": "My doctor's receptionist on a power trip",
        "author": "jcgreen_72",
        "url": "https://www.reddit.com/r/ADHD/comments/11imivb/my_doctors_receptionist_on_a_power_trip/",
        "text": "I have been diagnosed since my thirties, I'm now 50, I've been with my same doctor for more than 20 years.  His receptionist has been consistently awful to me but this is a new level of ridiculousness.  I have to be seen in person every 3 months because I take 2 controlled substances, and it's Florida law. BUT! There's a caveat regarding my Vyvanse rx: on my usual 3 month appointment, I make 2 telehealth appointments for the monthly rx for Vyvanse.  I checked to see when my appointment would be next week, and noticed I didn't have one scheduled. They're made to take place a day or 2 before I run out, so I called to see if I could possibly be seen next week. First thing she says \"is this for adderall?\" I say no, it's for Vyvanse, but yes, it's medication for my adhd. She goes on to say that \"telehealth appointments are no longer allowed\" like, at all, and says I have to come into the office every month now, and \"the reason for this is due to some new federal or state law\" (she's not sure and it doesn't exist anyway) that she \"saw an article on Facebook.\" (She's referring to laws already in place, enacted last year, that requires I be seen in person every 3 months.)  She said this like \"ooh, ha ha! Gotcha!\" \n\n&amp;#x200B;\n\nI am \\*not\\* being diagnosed through a telehealth app! I've \\*been diagnosed\\*, by a professional, more than 20 years ago! With Vyvanse, I'm being seen through a video call in order for them to, I guess, see my face? And comply with the law, so they can send that month's prescription to the pharmacy.\n\n&amp;#x200B;\n\nI'm so mad at this lady thinking she knows wtf she's talking about because she \"saw it on Facebook!\" She is NOT my doctor! She has zero say in which appointment format is legal.  I'm just fuming. She's given me so much bs over the years, condescendingly bringing up any time I've ever been late to or missed an appointment (hello, I have adhd, \\*of course\\* I've been late/ forgotten appointments a handful of times in the span of 20 years.)  My doctor is fantastic, as is the nurse practitioner, who \\*makes sure my scripts have been submitted AND received by my pharmacy, on the day of my appointment, then texts me to let me know!\\* (They constantly have issues with their e-script service not sending, and they don't check to make sure they've been received at the pharmacy.) \n\n&amp;#x200B;\n\nTL;DR Receptionist thinks she has as a say in medication schedules bc Facebook said so",
        "created_utc": 1677987762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Called my GP (doctor) and they said I “Don’t fit their criteria”",
        "author": "Ayajuki",
        "url": "https://www.reddit.com/r/ADHD/comments/11im7ky/called_my_gp_doctor_and_they_said_i_dont_fit/",
        "text": "Hi all, I am pretty certain that I have always been struggling with ADHD after it had been pointed out by my girlfriends mom, who used to be an ADHD clinic lead for CAMHS. \n\nObviously I didn’t really look for it or notice it much when I was younger, or much before being told by people that I may possibly have it, but I’ve noticed a lot of traits over the past year and some months. \n\nI finally gathered the courage (and finally remembered to) call my GP and see about getting something done once and for all. First of all, they had set up a telephone appointment which was a bit frustrating as I had expected to be seen in person but I digress. She had asked me to describe all of my symptoms of inattentiveness and hyperactivity which I mentioned I could possibly have. \n\nAfter all of this, she had told me that I “don’t fit their criteria” for anything more than their “assistance” with some coping strategies. They sent me a LEAFLET containing 3 coping strategies for school and 3 coping strategies for home. That is it. After that she told me good luck with your education and exams and have a nice day.\n\nI’m at a loss. I don’t know what to do from here on out since the GP is the only way I’m aware of that gets you put onto the ADHD pathway. If anyone has any tips of ideas of what to do next please tell me, I would love to hear it and I’m anxious to do something about this.\n\nThank you for reading.",
        "created_utc": 1677986866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Untreated ADHD Anger issues are destroying my life",
        "author": "Sir_Hoss",
        "url": "https://www.reddit.com/r/ADHD/comments/11im3bu/untreated_adhd_anger_issues_are_destroying_my_life/",
        "text": "I am an 18 male still in highschool we just recently discovered I had ADHD (not diagnosed but anyone with the slightest inkling of knowledge in psychology could see it) and it’s REALLY severe, but of course, my parents do not believe in therapy or mental health meds or anything like that. For most of my life I’ve been fine, I wasn’t too different from your typical “hyper active” kid. But now for some reason it’s gotten SO bad, I can’t pay attention at school at all and my grades are taking a nose dive from perfect student to lazy teenager. But that’s not the main issue, it’s my anger. I am extremely quick to anger and very explosive when I do. I yell and scream and say hurtful things to my friends and I get insanely competitive to the point that people don’t want to play with me. I say violent things out on nowhere without thinking it’s over-the-top and people think I’m crazy, and I always make mistake in the heat of it. and now I’ve flew too close to the sun. My best friend, the most wonderful person I’ve ever met, has left me. We met last year, she has helped me so much in life I couldn’t imagine not being friends with her. But I’ve fucked up. These past few months I’ve treated her like complete shit. Taking my anger out on her, shooting down all her ideas, calling her interests stupid and childish, telling her to stop being friends with people I don’t like, not supporting her when she needs it, blaming her for things wrong in my life, making shitty jokes and not apologizing for them, forcing her to do things my way and cutting her off if she doesn’t want to. All because I can’t let it go when she makes a joke about me or I’m just directing my anger onto her. Recently we have a falling out after an honest misjudgment and she says she can’t be friend with me anymore because of how I’ve been acting saying I’ll lose everyone if I keep it up.\n\nI didn’t always use to be like this but with things like college, learning to drive, school work, dealing with my insane, unsupportive family, bullies, figuring out my own sexually identity, dealing with depression and feelings of being unworthy of love, burnout and trying to keep up my hobbies I’ve constantly been on edge with no outlet for stress. What do I do? I want t fix this friendship but I can’t find the words, she knows I have ADHD but she doesn’t take that as an excuse (like most should) I’m tired of being a monster but don’t know how to stop being like this, I can’t lose her. I just feel so empty, anger is all I know. I hate myself so much, I take my anger out on the ones who love me, why?",
        "created_utc": 1677986521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Spending sprees part of the adhd tax?",
        "author": "mr_greenmash",
        "url": "https://www.reddit.com/r/ADHD/comments/11im0sk/are_spending_sprees_part_of_the_adhd_tax/",
        "text": "I have a habit, that every 6-24 months, I spend excessively within a theme... I've had movie buying sprees, musical instrument sprees, coffee sprees, retro gaming sprees, retro mobile phone sprees etc.\n\nRecently I've spent about 800 usd on old mobile phones and another 600 on movies and old games. Some of it by credit cards, which I can afford to pay before interest starts, but still....\n\n\nI want to play the games, but I don't make time (so maybe I'm a collector?). I do occasionally play the instruments, but.. I usually forget I want to do it. The phones... I think less notifications would provide a happier life, but I haven't really tried using any of them as a daily driver (so I guess I'm a collector?), movies.. Well.. Because I don't trust the dreaming services to keep it available.\n\nIdk, I guess this is just a venting post.",
        "created_utc": 1677986327,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens after the finish line?",
        "author": "EastofEdensgrave",
        "url": "https://www.reddit.com/r/ADHD/comments/11ilvoa/what_happens_after_the_finish_line/",
        "text": "So about a year ago, I promised myself I would:\n\nFind a job that pays well\nGet into therapy to get to a place where I’m mentally healthy\nGet my ADHD medicated \n\n\nI did that. I got it done. I worked through the therapy sessions and have finally gotten to a good place. The ADHD is finally medicated and completely diagnosed- which, as a young woman was tough enough but it’s done.\n\nNow? \n\nThe goal is probably a job that better suits me- that I can find fulfillment in that is more a career than this one is. And I’m not really sure where to go. How do I find inspiration, or that spark that lets me know what kind of industry I want to be a part of? I keep asking myself what I want to be doing for work, and I can’t think of anything. Now that I’ve done what I set out to do, I … feel stuck again. Any ideas?",
        "created_utc": 1677985921,
        "upvote_ratio": 1.0
    },
    {
        "title": "A long journey to find my place in the world",
        "author": "Meggles_28",
        "url": "https://www.reddit.com/r/ADHD/comments/11ilt54/a_long_journey_to_find_my_place_in_the_world/",
        "text": "Hi all. I am a 26 year old female who was diagnosed with ADHD (predominantly inattentive) last year. I also have a trauma background and have experienced significant anxiety and depression since my early teenage years. When I was younger I developed an eating disorder but have been in remission for a long time. Other diagnoses have been examined but ruled out (e.g. OCD, ASD, bipolar) I have had regular psychology and psychiatrist input for approximately 5 years now and think I am in a good spot with my medications; however, adulthood continues to be gruelling.\n\nThroughout my life I have always felt like I am behind my peers and slow to learn or that I need to put in excessive effort just to keep afloat. Nothing has felt easy. I was able to achieve good results in high school and University but at a large personal cost. I am an allied health professional (occupational therapist) and have always had negative work experiences since leaving University, not due to my clinical skills or ability to write satisfactory documentation but because of continual failure to manage the administrative load. I also was never able to be effective in my casual roles prior to graduating, regardless of what effort I put in. At home I continue to struggle with basic life skills like cooking, cleaning, doing laundry etc. Socially I have always been awkward and found it hard to navigate friendships.\n\nI spent time in a psychiatric facility last year and I am currently in a very bad mental state again as I face the pressure of having a mortgage and am experiencing hard treatment at work for underperformance (had disclosed about my mental health and ADHD from the start). My psychiatrist has suggested doing a cognitive/adaptive behaviour assessment to see if there is something else contributing to my challenges and to help decide what other approaches could be explored.\n\nMy identity is strongly linked to my work and I am very passionate about what I do. However, even in the disability industry true acceptance and understanding has not been found. I can’t even begin to think of other career avenues at the moment and know being forced to leave the field would be devastating. \n\nI sit here wondering how much longer do I have to live in survival mode. Even with improved concentration/organisation and better management of anxiety following medication/therapy I continue to fail to meet societal expectations then spiral with the stress of backlash. I feel lost and defeated at the moment so wanted to reach out to see if anyone has had relatable experiences and could offer what has been useful for them to remain hopeful in adulthood.",
        "created_utc": 1677985728,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your first day taking Concerta like?",
        "author": "josie1999",
        "url": "https://www.reddit.com/r/ADHD/comments/11ilmac/what_was_your_first_day_taking_concerta_like/",
        "text": "Just got done with today which was my first day on Concerta (or any ADHD stimulant). Can anyone else share their experience so I can compare and feel normal? Lol\n\nRight now my body feels like I had a very stressful day even though today was good. I’m tense overall, but I did feel like I had enough energy to do what I wanted to do today.\n\nMy heart rate is still moderate, not as high as it was when I peaked, but It’s still kind of concerning (not from a medical standpoint just a personal one lol). 80’s-90’s at rest, higher than 100 when I get up or move, but not usually higher than 110.",
        "created_utc": 1677985211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question??",
        "author": "DiscombobulatedAd704",
        "url": "https://www.reddit.com/r/ADHD/comments/11iljlq/question/",
        "text": "Hi, I was in the store today and they had rows and rows of color coded clothes. As I was looking through them everything was fine. I took a step back to see where to go, and all of a sudden I saw all the dozens of colors and it was like my brain stoped working. It wasn’t fuzzy or anything but for a few minutes I just couldn’t process anything. It’s happened once or twice before. I couldn’t really think of anywhere else to ask if it might be a symptom. Google wasn’t very helpful. My mom didn’t really believe me when I asked her.",
        "created_utc": 1677985000,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your favorite calendar/reminder apps?",
        "author": "illuminaddi",
        "url": "https://www.reddit.com/r/ADHD/comments/11il1m1/what_are_your_favorite_calendarreminder_apps/",
        "text": "I tutor in addition to my full time job. It is WFH, and I only tutor for an hour and a half on Saturdays. I have a reminder in my calendar app on iPhone to remind me the day before and day of, but I tend to overlook the reminder on a frequent enough basis that it’s causing problems with my tutoring attendance. I’m going to ask to change tutoring times, but beyond that I think I need a better system in place for similar circumstances. I would love an app that allowed for scheduled items as well as checklists. Something with multiple functions to help me remember everything I’ve planned, and the stuff I want to work on in a given day. I wish I didn’t overlook things like this tutoring. It’s frustrating, and I think it makes it look like I don’t care when I care immensely. Any suggestions would be greatly appreciated. How do you micromanage yourself to take advantage of your own motivation/s?",
        "created_utc": 1677983577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coding and Programming",
        "author": "Buttermilk_Pnck_91",
        "url": "https://www.reddit.com/r/ADHD/comments/11il02j/coding_and_programming/",
        "text": "I'm not sure if anyone else in here works in tech, hyper-fixates on coding, or dabbled in any sort of programming language, but I recently have been thinking of changing careers to work in the tech industry. I've been using this app called \"Mimo\", and when I tell you it has been a GOD SEND! The way it's structured works so well with how I absorb information. Has anyone else had the same successes with this (or any other) apps/courses? Because this is the first time I've been able to focus this long on something and still be excited about it. I welcome any advice, pros, and cons...lay it on me.",
        "created_utc": 1677983461,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s time…",
        "author": "Interesting-Hunt8639",
        "url": "https://www.reddit.com/r/ADHD/comments/11ikdmn/its_time/",
        "text": "[removed]",
        "created_utc": 1677981773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone take concerta and buspar?",
        "author": "sappysapphicsaphire",
        "url": "https://www.reddit.com/r/ADHD/comments/11ikct9/anyone_take_concerta_and_buspar/",
        "text": "[removed]",
        "created_utc": 1677981710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it really possible for people to receive bad batches of their meds ( vyvanse, Adderall)?",
        "author": "No_Effort2680",
        "url": "https://www.reddit.com/r/ADHD/comments/11ikby4/is_it_really_possible_for_people_to_receive_bad/",
        "text": "You guys...I finally understand what everyone was upset about in regards to the recent batch of Vyvanse.\n\nI picked up my script this week after not having them for 2 months. Been using my stash from last year ( had about 2 months worth).\n\nI was a bit hesitant to believe what was being said about vyvanse on tik tok and reddit. \n\nWell when I took my first dose of my new script, It felt like I haven't taken anything. I normally take breaks on the weekend, so this definitely caught me off guard when I started to feel tired even though I took my meds. \n\nMy dosage has not changed so that's definitely not the issue. But I did compare the amount of powder from my old meds to my new ones and they are definitely different.\n\nThe old ones had way more powder than the new ones. \n\nAnyway, there's definitely something going on with vyvanse.\n\nIs anyone else dealing with this right now?",
        "created_utc": 1677981655,
        "upvote_ratio": 1.0
    },
    {
        "title": "has anyone experienced ADHD episodes?",
        "author": "hammyt42",
        "url": "https://www.reddit.com/r/ADHD/comments/11ik9mx/has_anyone_experienced_adhd_episodes/",
        "text": "[removed]",
        "created_utc": 1677981494,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help me bring awareness",
        "author": "Present_Big9053",
        "url": "https://www.reddit.com/r/ADHD/comments/11ik8oj/please_help_me_bring_awareness/",
        "text": "I was wondering If you could share this YouTube video of me speaking at my daughter's school board meeting. I'm trying to bring awareness to the struggle for my daughter of not having her iep followed. I'm from a small town that just wants to sweep it under the rug. Please consider just sharing ty\n\nhttps://youtu.be/mMmgoipD4co",
        "created_utc": 1677981416,
        "upvote_ratio": 1.0
    },
    {
        "title": "26 and recently diagnosed with ADHD",
        "author": "Repulsive_Ad_111",
        "url": "https://www.reddit.com/r/ADHD/comments/11ik0y1/26_and_recently_diagnosed_with_adhd/",
        "text": "Ive struggled my whole life, I’m trying to figure out if my case is severe or my symptoms are normal?\n\n-Cant focus on either tasks or conversations. - Cant read a book or listen to podcasts. Lose focus, forgot what ive read.\n- Cant watch films\n- Cant focus in a group setting even if I tell myself to focus\n-Make rational decisions all the time then regret them \n-Mood swings all the time\n-Get distracted very easily\n-My organisation and time keeping skills are shocking\n-I hate making eye contact it makes me feel extremely uncomfortable \n-Make careless mistakes at work all the time \n-I lose things all the time and forget everything \n\nNever been able to focus in a classroom - go into the class saying to myself - “ I am going to maintain focus this lesson” but 5 minutes in im lost straight away.  This was throughout both School and college. I never went to university \n\nI Disengage and pick skin convos\n\nBlurt out million miles an hour then change topics every 5 seconds to get everything out my head or else I forget it and then everyone tells me to calm down or repeat what I said.\n\nFeel like I interrupt too much\n\nTrip up over own words. Sentences often come out jumbled.\n\nI speak too fast and stutter\n\nAnxiety \n\nZone out every five minutes\n\nOften leads to mistakes at work. Forget stuff dont pay attention \n\nCant motivate myself to do anything \n\nMental brick wall work cant focus anything \n\nLeave jobs because of performance and mistakes as feel like im forming bad reputation for being bad at CV",
        "created_utc": 1677980820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe it's ADHD",
        "author": "Swimming_Macaroon_21",
        "url": "https://www.reddit.com/r/ADHD/comments/11ijxzg/maybe_its_adhd/",
        "text": "Not to self-diagnose, but I have been noticing a certain pattern and no matter how many times I have tried to make things right, they never do. In the past, I would say I was a very smart student although I never had a consistent study routine I would always manage and get 85% and above on most of my report cards. That has gradually or, perhaps, severely depleted over the years. I'm 20 and currently in university and repeating my 2nd year as I believe that I lacked self-discipline. I've never established a method of studying. It was always last minute. I would anticipate it and believe that despite the unnecessary stress and emotional breakdowns I would always make it and pass. It's gotten worse and I am at my wit's end. I lack concentration, I cannot sit still for one measly lecture video without pausing it if it's longer than 10 minutes, I procrastinate and procrastinate and give in assignments late, more deductions and then eventually it all lead to not passing the year. I don't know what to do and no matter how many to-do lists with simple tasks, I can't seem to figure it out. \n\nIt's also extremely frustrating hopping from one interest to another in the span of a few months. It was learning sign language, then Spanish, then wanting to expand my perfume collection, then the art of handwriting analysis, buying books because I felt inspired, then nail art, etc. You get the picture. I would love to have a hobby that I stick with on a permanent basis and not just be on the whim for once.\n\nIn addition to the above, I have been diagnosed with GAD several years ago, took meds for two months, and stopped as I had convinced myself that I'd be better off without them. Now that I think of it, I should probably start again. \n\nNot really sure where I'm going with this post but I felt like sharing.",
        "created_utc": 1677980592,
        "upvote_ratio": 1.0
    },
    {
        "title": "inattentive ADHD + working with numbers",
        "author": "infinitenap",
        "url": "https://www.reddit.com/r/ADHD/comments/11ijwzu/inattentive_adhd_working_with_numbers/",
        "text": "is anyone here diagnosed with inattentive ADHD and work with numbers? i seem to get my work all messed up, can’t remember what’s done even when it’s mere seconds ago (extremely forgetful) or pick up clear instructions from my boss. my brain just feels like a fog and i have trouble switching from one task to another. due to the repetitive nature of work that i do, i often find myself doing careless mistakes and struggling to multitask quickly which comes with the job description. thus, causing me to severely underperform. i’m four months at my new job and i feel severely incompetent. aside from work, i’m also part time studying for my professional accountancy and i always have trouble with getting started into studying and procrastinated even until the eve of the final exams. i get anxious about not starting but i also find myself infuriatingly mindlessly scrolling and lacking willpower to start. i lay in bed on the weekends with my abandoned to-do lists feeling bad about myself and extremely isolated and depressed. anyone else with this same problem, does being on medication help with improving focus?",
        "created_utc": 1677980518,
        "upvote_ratio": 1.0
    },
    {
        "title": "12 yr old started Ritalin and seems more hyper",
        "author": "Any_Ad6921",
        "url": "https://www.reddit.com/r/ADHD/comments/11ijt7i/12_yr_old_started_ritalin_and_seems_more_hyper/",
        "text": "[removed]",
        "created_utc": 1677980235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social behavior differences in ADHD men vs. women?",
        "author": "aaelizaa",
        "url": "https://www.reddit.com/r/ADHD/comments/11ijeac/social_behavior_differences_in_adhd_men_vs_women/",
        "text": "I’ve noticed certain behaviors in the people in my family that have (or I suspect have) ADHD, and I’m curious if anyone else has noticed the same thing, and if it might be a difference of gendered socialization or perhaps a difference of PI, C, PH?\n\nSo in my family example, only two people are actually diagnosed: \nme (female, combined)\nmy BIL/sister’s husband (male, PI). \n\nBut I suspect the following family members also have ADHD: \nMy mom (I’m 1000% certain and all her symptoms are the same as mine)\nMy dad (not quite as certain if adhd but if so prob would be inattentive)\nMy sister (she’s convinced she is, uncertain PI vs combined tho)\nMy husband (prob inattentive)\nMy FIL/husband’s dad (prob inattentive)\nMy SIL/husband’s sister (combined?)\n\nOkay, this is the scenario we’re all sitting together having a family dinner and conversation.\n\nThe MEN at some point, or many points, will start to not pay attention to the conversation and may in fact disengage from it completely and obviously. My husband and BIL will pull out their phones, my FIL will watch the TV he’s left on in the other room. My dad isn’t a TV or a phone guy, but he will get so completely lost in his own thoughts that when you ask him something, he will have no idea what everyone else has been talking about.\n\nI’ve noticed that the WOMEN that have or are suspected to have adhd don’t disconnect like this, and are good at paying attention to the conversation (or at least pretending to). The ADHD behaviors they (we) are more prone to is switching topics abruptly, interrupting each other, or unintentionally dominating the conversation with our preferred topics.\n\nThoughts? Anyone else notice something like this?",
        "created_utc": 1677979140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will orange juice make my Adderall crash easier?",
        "author": "Moon_And_Stars9",
        "url": "https://www.reddit.com/r/ADHD/comments/11ijajg/will_orange_juice_make_my_adderall_crash_easier/",
        "text": "This sounds like an extremely silly question, but I think I have some sound reasoning behind it.\n\nI don't take Adderall on weekends because it makes me anxious and antsy (not as much on weekdays though, it's weird), but tomorrow I need to take it so that I don't crash on Monday because I have an important thing to go to in the evening. I'm obviously not looking forward to tomorrow, but being miserable for one day this weekend is worth being able to get through the thing on Monday.\n\nSo I was thinking about it, and I know that orange juice offsets the effects of Adderall for some science reason I don't understand, but what if I drank it tomorrow with my meds anyway? Would it cancel out the side effects but make it so I don't crash on Monday, or would it just make it so the Adderall completely passes through my body and I'll end up crashing on Monday anyway? Also, if this helps anything, usually what happens is that I crash on Monday and then on Tuesday I'm almost completely back to normal and barely crash, which is why I'm planning on taking my meds tomorrow. \n\nOkay I just checked my fridge and I don't actually have orange juice so I can't do it even if it would work, but I'm still curious for future reference",
        "created_utc": 1677978857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those who got diagnosed as an adult, how?",
        "author": "ParticularlyAlright",
        "url": "https://www.reddit.com/r/ADHD/comments/11ij6ij/those_who_got_diagnosed_as_an_adult_how/",
        "text": "[removed]",
        "created_utc": 1677978551,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what situations does your hyperactivity worsen or improve?",
        "author": "Waste_Necessary654",
        "url": "https://www.reddit.com/r/ADHD/comments/11ij25c/in_what_situations_does_your_hyperactivity_worsen/",
        "text": "In what situations does your hyperactivity worsen or improve?\n\nI noticed that when I sleep well, I become very talkative and much more inattentive.\n\nIf I sleep poorly, I am inattentive, but since I am tired, I don't have the energy to do things.\n\nI also observed when I sleep bad it's more difficult to observe the simulant effect (LA Ritalin, 20mg).",
        "created_utc": 1677978230,
        "upvote_ratio": 1.0
    },
    {
        "title": "finally tried adderall which worked, but the crash is killing me",
        "author": "teenyrabbitt",
        "url": "https://www.reddit.com/r/ADHD/comments/11ij10q/finally_tried_adderall_which_worked_but_the_crash/",
        "text": "so i've taken depression and anxiety medication for many years. they don't do the absolute most but it's the best i know they can do (i have tried a lot of medication). i started to suspect over a year ago i had adhd and i finally spoke to my psychiatrist about it and he prescribed adderall.\n\ni've had extremely low energy and a high difficulty getting tasks done for many years. i finally felt like i had energy to get through an entire day. it was great, but i noticed at night i started to feel sad again. i thought maybe the dose was too high so i took half like my doctor had said but i realize i cut the dose after being on it about a week and it made the crash significantly worse. it also gave me the weird anxious feeling i sometimes got without the energy. i didn't take any today because the crash was bad and i was scared to take any, even at the normal dose (i was given 10 to take twice a day). \n\ni'm going to reach out to my doctor when i can but he isn't in office until wednesday, i just feel extremely distraught because it felt like i could finally function and be normal, but i was scared of the potential crash at night. it still feels like i have taken a bit because i am strangely restless but that is about it. i know there are other stimulants that may work better for me but i am starting trade school monday and worried i won't be able to function well for it. any advice or similar experiences, words of comfort, are appreciated.",
        "created_utc": 1677978147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ritalin 20mg: My experience in 2 weeks. Effects dropping after one week.",
        "author": "Waste_Necessary654",
        "url": "https://www.reddit.com/r/ADHD/comments/11iiy6p/ritalin_20mg_my_experience_in_2_weeks_effects/",
        "text": "[removed]",
        "created_utc": 1677977958,
        "upvote_ratio": 1.0
    },
    {
        "title": "diagnosed last weekend",
        "author": "gdmoc83",
        "url": "https://www.reddit.com/r/ADHD/comments/11iivtv/diagnosed_last_weekend/",
        "text": "[removed]",
        "created_utc": 1677977776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with understanding ADHD",
        "author": "Adhdhelpme1",
        "url": "https://www.reddit.com/r/ADHD/comments/11iiuc8/help_with_understanding_adhd/",
        "text": " TL;DR: Please help a non-ADHD person better understand their partner. Please. Thank you\n\nHello, I am a long-time lurker, first time poster.\n\nI wanted to post here because I need help with something. I (31, non-ADHD) am in a relationship with someone (32, ADHD) who has been diagnosed with ADHD since they were young. Since we have been dating and especially since they told me about their diagnosis, I have been doing my best to learn about the condition - casually on sites like WebMD, through reading books like ADHD 2.0, Driven to Distraction, the Couple's Guide to Thriving with ADHD, etc. and through looking up studies on PubMed. Please believe me when I say I am REALLY trying because I care about them, I love them and all of them and I want them to feel seen and loved.\n\nI am struggling though. We went through a phase where they hyper-focused on me for a bit, then lost interest and since then, it's been a bit rough at times trying to connect with them when they weren't distracted. The thing is, I had read about this phenomenon, and I have tried not to take it personally. I'm adjusting my own expectations.\n\nWhat is really hard though are the emotional outbursts, specifically the rage. It has felt in this relationship like their emotions and their feelings take precedence over mine at all times, no questions asked. If I bring up how I'm feeling a little sad or hurt (trying to use lots of \"I\" statements) by X behavior, it frequently gets turned on me or they get angry and upset for how I'm feeling and it becomes about them and their feelings. It has been exhausting. They will also get angry to the point that they scream at me. One thing about me is that I am not good at confrontation. I have had some physically abusive relationships where I have been screamed at and then hit and as such, having someone raise their voice at me sets me back to that time and I shut down. They know this about me. And I also recognize that it is a \"me\" problem and I shouldn't expect people to cater to me just because I can't take loud voices. I am working on this. But anyway, I'm sort of an avoidant person and they have openly said they thrive on confrontation. The end result is that I shut down and there is typically a lot of yelling and screaming at me. After they calm down, they tend to apologize and will even accept blame for certain things. But they also say that I trigger them and at the end of the day, that most of this is my fault because of what I'm doing. The thing is, I'm not sure how to fix it.\n\nI know rejection-sensitive dysphoria can be a thing and they have cited it as a reason for why they react as strongly as they do with the yelling and screaming at me when I upset them. I need help. I got kicked out of our shared apartment the other day after they got angry at me. It was 3am and I didn't know where to go so I called a friend. I haven't told anyone else about their behavior before but I broke down. This friend also has ADHD and she was adamant that these signs were not 'just' ADHD and told me to leave. The thing is, I don't want to give up on this relationship and walk away in case this is just ADHD and I'm the problem here. Please help me. I would love more advice.\n\nThank you.",
        "created_utc": 1677977668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with understanding ADHD",
        "author": "Adhdhelpme1",
        "url": "https://www.reddit.com/r/ADHD/comments/11iit4a/help_with_understanding_adhd/",
        "text": "[removed]",
        "created_utc": 1677977575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Adderall supposed to speed you up?",
        "author": "Wolfotashiwa",
        "url": "https://www.reddit.com/r/ADHD/comments/11iiqf7/is_adderall_supposed_to_speed_you_up/",
        "text": "I started adderall on Wednesday and ever since I've felt very productive (so productive in fact that I overwork myself often) and have been very \"fast.\" My heart rate is sped up and overall has made me very hyper. I'm also on Intunive which, I've been told, calms you down, but it doesn't seem to be doing much. Does anyone else experience this off adderall? Or any other medication?",
        "created_utc": 1677977380,
        "upvote_ratio": 1.0
    },
    {
        "title": "The decline after middle school",
        "author": "lenalou006",
        "url": "https://www.reddit.com/r/ADHD/comments/11iinop/the_decline_after_middle_school/",
        "text": "I had to do the sorry task today of getting rid of a bunch of paper from elementary through university. It’s really depressing how things have just progressively gotten worse. As a fourth grader I was writing so well, even neat and organized. It all went to shit &amp; it seems like I was a very bad investment. Have never had a good job &amp; social stuff is bad too. Can anyone relate ?",
        "created_utc": 1677977173,
        "upvote_ratio": 1.0
    },
    {
        "title": "straterra side effects",
        "author": "makeupnmed",
        "url": "https://www.reddit.com/r/ADHD/comments/11iimdl/straterra_side_effects/",
        "text": "i was prescribed 20mg (f 22 5’4 200lbs) and i took it for like 4 days, but it made me too tired. so my doctor prescribed 10 mg, and if anything, i started night eating again 😭. does this mean i wont get that side effect ? im trying too weight, plus help my adhd h to at i recently got diagnosed. will i get that side effect when i hit 40 mg maybe ? i want help with my adhd (i tend to help with my verbal impulsiveness, but nothing else so far. let me know ur your experience if ur open to sharing. thank you !",
        "created_utc": 1677977081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching to Vyvanse",
        "author": "Skellyrista",
        "url": "https://www.reddit.com/r/ADHD/comments/11iilyb/switching_to_vyvanse/",
        "text": "I was on 10 mg IR Adderall in the morning and 20 mg SR Adderall at like 1ish. Got a concussion that seems to have changed the way adderall works for me, so my psychiatrist put me on Vyvanse 30mg… I was just curious from others experience what the differences are, or if I can expect Vyvanse to not be as strong or something? I really appreciate it!!",
        "created_utc": 1677977051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intentional boredom/meditation, does it really help?",
        "author": "zackarylef",
        "url": "https://www.reddit.com/r/ADHD/comments/11iihlc/intentional_boredommeditation_does_it_really_help/",
        "text": "Many times now I read the same thing, meditation increases connections within the prefrontal cortex, which is thought to regulate focus and self control and thus, help mitigate adhd symptoms. \n\nBut how effective is it really? And can you do it while on the meds? \n\nI read that you just have to sit down for 5 to thirty minutes and try to focus on your breathing, and any time your mind wanders off, you bring it back. But I just wanna be sure if that's correct...\n\nAlso, could intentionally boring and depriving yourself from any stimuli do the same? \n\nIs it effective at all? Will I waste my time and suffer for nothing?",
        "created_utc": 1677976728,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I stop thinking it often makes the illusion of \"me\" stops working. It's death-level terrifying and has been lifelong. Any advice?",
        "author": "VestPresto",
        "url": "https://www.reddit.com/r/ADHD/comments/11iievw/when_i_stop_thinking_it_often_makes_the_illusion/",
        "text": "When I'd shower, walk up a flight of stairs, go to the bathroom or am in the process of falling asleep this happens. Basically when my mind idles a bit. It's torturous and I cried all night most nights until I got to drinking age...\n\nIt doesn't seem to be derealization or depersonalization or ego death. Please don't tell me this is a cool drug ego death experience. It feels impossible for me to explain the subtleties. FWIW I was tested for seizures as a kid and they didn't find anything.\n\nA psychologist once mentioned there's a part of the brain involved with our sense of self that's often different in people with ASD/ADHD, but I've never seen this discussed on forums.\n\nI'm old now and never grew out of it like I always wished I had. It really adds to my sense of isolation and living a sad lonely life. I would really love if there was a drug I could take or if there's something else to try.\n\nThanks for your consideration",
        "created_utc": 1677976529,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i get a more effective drug like adderall or Vyvanse without coming off as drug seeking ? ive only been shoved SSRI'S down my throat for years and nobody wants to consider any other options ?",
        "author": "greentea_solaire",
        "url": "https://www.reddit.com/r/ADHD/comments/11iic0y/how_do_i_get_a_more_effective_drug_like_adderall/",
        "text": "As the title suggests i want to try and get my psychiatrist to prescribe me something more effective. i (17 Mixed Black M) Have ADHD, Autism, Depression and Anxiety, my psychiatrist is hell bent on saying the reason why my ADHD is so uncontrolled is that my depression is terrible so we need to fix that first which is absolute bs. ive been on lexapro, zoloft,wellbutrin, and noratriptilane. I cant go to anyone else in my area because of a lack of available pediatric offices and beacuse of my insurance so im stuck with this guy till im 18. im falling behind worse and worse in school and i cant keep up with peers as ive been burnt out since 2019. this is my last straw with these people and im just done with mental health care in general, any advice ?",
        "created_utc": 1677976323,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I stop thinking it often makes the illusion of \"me\" stops working. It's death-level terrifying and has been lifelong.",
        "author": "VestPresto",
        "url": "https://www.reddit.com/r/ADHD/comments/11iiblg/when_i_stop_thinking_it_often_makes_the_illusion/",
        "text": "[removed]",
        "created_utc": 1677976292,
        "upvote_ratio": 1.0
    },
    {
        "title": "I didn’t deposit paychecks at my old job and got asked about it by my old boss",
        "author": "Best-Application6580",
        "url": "https://www.reddit.com/r/ADHD/comments/11iibjp/i_didnt_deposit_paychecks_at_my_old_job_and_got/",
        "text": "Title basically explains it. I, now 18, was 16-17 working at my old job and we didn’t have direct deposit, we had paper paychecks. I’m sure adhd people can understand depositing them can be hard to do and I just didn’t deposit a large sum of money (around 2,000 dollars worth). I know it’s a ton of money and I honestly don’t even care I even threw them out a while after I quit and didn’t think it would come to bite me in the ass. My boss texted me asking about them, not sure what to do. I told him the truth obviously. Please don’t come at me for the amount of money or whatever bc I really deeply struggle with things like that even if I need the money. I now have direct deposit at my new job so it’s not a problem anymore but I’m not sure what repercussions from this would be.",
        "created_utc": 1677976289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking support and thoughts",
        "author": "RevolutionarySoft704",
        "url": "https://www.reddit.com/r/ADHD/comments/11iiaj3/seeking_support_and_thoughts/",
        "text": "Hi everybody, this is my first Reddit post and I hope it follows the rules!  I am looking for empathy/support here. \n\nI’m 29 and only just seeking an adhd diagnosis from a specialist. I’ve been in treatment for bipolar disorder for my entire adult life and whenever I brought up adhd with any number of psychiatrists, they poo-pooed me and said it was just the bipolar. \n\nWell here I am, having successfully managed my bipolar for a year or so for the first time in my LIFE (huuuuuge victory here), and I still struggle to function. \n\nI didn’t realize how much it was bothering me until I got emotional talking to my therapist about how hard it is simply to LIVE and some people seem to just skate by. \n\nI’ve definitely been covering up and compensating for something for as long as I can remember, doing great things in school (like insanely detailed drawings for example, or a 40-page paper on cs Lewis in the style of the screw tape letters) while wildly depressed through it all. \n\nI feel like people write me off because I do such a great job hiding my trouble functioning…which just causes me frustration and fatigue. \n\nI’d love if you could provide advice on what worked for you at the beginning stages of seeking treatment and diagnosis.  And maybe having grace for myself. \n\nAlso, does anyone find that adhd makes them EXTREMELY fatigued, like allll the time??  I’m so sick of just “accepting that I need significantly more sleep than other people” (like 12+ hours a night plus naps, alarms barely work). I feel like I could be leaps and bounds ahead of where I am now (financially, career specifically) if I didn’t need to sleep all the time!\n\nThank you so much in advance for your support!",
        "created_utc": 1677976225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clinical Therapy Adult ADHD - Sydney",
        "author": "Revolutionary-Toe955",
        "url": "https://www.reddit.com/r/ADHD/comments/11ii0wq/clinical_therapy_adult_adhd_sydney/",
        "text": "Hi all, I believe I'm suffering from undiagnosed ADHD and at 38 I'm finally motivated to do something about it. Has anyone in Sydney, Australia used Clinical Therapy Services in Kogarah or could recommend another provider? I don't mind paying for a private service as I just want to deal with this condition and start living my life.",
        "created_utc": 1677975552,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate being so fucking picky",
        "author": "ratgarcon",
        "url": "https://www.reddit.com/r/ADHD/comments/11ihvpj/i_hate_being_so_fucking_picky/",
        "text": "[removed]",
        "created_utc": 1677975180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone find that these sound box effect TikTok’s help",
        "author": "superior_be1ng",
        "url": "https://www.reddit.com/r/ADHD/comments/11ihomb/does_anyone_find_that_these_sound_box_effect/",
        "text": "[removed]",
        "created_utc": 1677974683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have parents with ADHD?",
        "author": "irenequeen12",
        "url": "https://www.reddit.com/r/ADHD/comments/11ihesk/anyone_have_parents_with_adhd/",
        "text": "[removed]",
        "created_utc": 1677974003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not enough stimulation in this world",
        "author": "InternationalName335",
        "url": "https://www.reddit.com/r/ADHD/comments/11ihd6r/not_enough_stimulation_in_this_world/",
        "text": "I’m 15 and right now I noticed whenever I’m under stimulated like right now, I don’t feel like doing anything not even hobbies as it uses up too much energy and focus.  I would  just curl up under the covers and do nothing.  It’s really boring laying around.  Like whenever I wake up I lay around for 20 minutes and stare at the ceiling until I force myself to get up and I get this weird feeling that I’m doing something against what my body and brain wants.  For example if you’re super comfy in bed and suddenly you have to get up- that’s what it feels like for me.",
        "created_utc": 1677973884,
        "upvote_ratio": 1.0
    },
    {
        "title": "If my doctor gives me ADHD meds am I diagnosed with ADHD?",
        "author": "Needlepaws78",
        "url": "https://www.reddit.com/r/ADHD/comments/11ihbhd/if_my_doctor_gives_me_adhd_meds_am_i_diagnosed/",
        "text": "I assumed it meant I was diagnosed with ADHD when my doctor gave me meds but I've been seeing people talk about psychiatrist appointments and testing so I'm a little confused. He just gave me a questionnaire and then was like yeah you have it here's some meds. I ended up not taking them but was that not an official diagnosis? Just a little confused.",
        "created_utc": 1677973768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have parents with ADHD?",
        "author": "irenequeen12",
        "url": "https://www.reddit.com/r/ADHD/comments/11ih9c9/anyone_have_parents_with_adhd/",
        "text": "[removed]",
        "created_utc": 1677973621,
        "upvote_ratio": 1.0
    },
    {
        "title": "If my doctor gives me ADHD meds am I diagnosed with ADHD?",
        "author": "Needlepaws78",
        "url": "https://www.reddit.com/r/ADHD/comments/11ih6wx/if_my_doctor_gives_me_adhd_meds_am_i_diagnosed/",
        "text": "[removed]",
        "created_utc": 1677973463,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I budget?",
        "author": "blueberry-spy",
        "url": "https://www.reddit.com/r/ADHD/comments/11ih29f/how_do_i_budget/",
        "text": "How do I learn how to budget? Do you know any ADHD friendly methods? \n\nNothing seems to click for me, I just sort of go off vibes, but that's not working. At the same time I don't wanna use an app that I have to give my bank info or something.\n\nPlease help, I was rightfully called out on it by a friend, and I know they have my best interest at heart so instead of getting defensive I'm trying to learn from it.",
        "created_utc": 1677973148,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if I should seek professional testing?",
        "author": "Luffeevee",
        "url": "https://www.reddit.com/r/ADHD/comments/11ih1go/how_do_i_know_if_i_should_seek_professional/",
        "text": "I think I might have ADHD, as I can relate to quite some symptoms, but, I'm worried if I get tested and I don't have ADHD, I might just be an attention seeker and I will have wasted my parents' and the professional's time. \n\nI know those are not the most accurate, but I've done a few online tests, and I always fall in the middle \"you might have ADHD or not, who knows? Not us\"\n\n\nI guess I'm really worried I might be making a fuss over a non-existing problem I just made up in my head, or, on the other side, but, I really want to know if I have ADHD or am just making it up. \n\nPlease, any advice is welcome.",
        "created_utc": 1677973089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do y’all get accused of having an attitude problem?",
        "author": "CriticalCase4337",
        "url": "https://www.reddit.com/r/ADHD/comments/11ih0l5/do_yall_get_accused_of_having_an_attitude_problem/",
        "text": "\n\nI get told that I have an attitude a lot. It’s hard for me to see why a lot of the time. Sometimes I’ll merely respond to a question and the person will look at me as if I personally attacked them, even though I meant them no offense. \n\nIt was far more common, and carried more consequences, when I was younger. Now that I’m something resembling an adult it happens less frequently but still, in moments of stress or disagreement, I’m suddenly told that I have an attitude problem.",
        "created_utc": 1677973028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can I put things into words or writing",
        "author": "z-x-y156",
        "url": "https://www.reddit.com/r/ADHD/comments/11igv8w/why_can_i_put_things_into_words_or_writing/",
        "text": "[removed]",
        "created_utc": 1677972669,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no hobbies/interests and I feel like a failure",
        "author": "zombiequeen66",
        "url": "https://www.reddit.com/r/ADHD/comments/11iguwn/i_have_no_hobbiesinterests_and_i_feel_like_a/",
        "text": "I feel like a failure, and really stupid as compared to my friends or family. I have no interests/hobbies, like I get obsessed with something, hyper focus on it for awhile, get distracted by something else and never pick up that hobby again. I tried everything gaming, reading, dance class, yoga, cooking, baking, learning piano, gym, art, but nothing sticks. I hop from one hobby to another. I have no direction in life. \n\nI’m currently doing my masters Specialized in data analytics, I was so into it for months, and now I’m bored and I don’t like it, and want to change my track, and next semester is my last semester. \n\nMy brain is just not consistent with anything at all. All I do is daydream and pace, it’s like a constant itch, I can’t sit still to work. And i daydream. \n\nI hate myself so much, cuz I disappoint everyone. I had friends, and when my ADHD got worse this semester, they all kind of distanced themselves from me.",
        "created_utc": 1677972647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meeting Accommodations",
        "author": "KateMacDonaldArts",
        "url": "https://www.reddit.com/r/ADHD/comments/11igufr/meeting_accommodations/",
        "text": "Wondering if anyone (particularly, hyperactive impulsive) has found any group meeting accommodations that have helped? I’m specifically looking for simple hacks that can make sitting in long meetings (with less than friendly people) less overwhelming. \n\nI find being interrupted and over spoken a trigger - as well as people doing really disrespectful things like rolling their eyes or dismissing me with a wave of their hands. At my last board meeting one person even sneered at me. I try to get out for some fresh air when there are breaks, but aside from that, what kind of accommodations could be requested? I disclosed my ADHD status a few months ago and they’re still continuing with this behaviour. (The chair is conflict avoidant so hasn’t been much assistance.)\n\n(If it’s of any help, it’s a charity board I’ve been on for several years and I’ve been Vice Chair for most of this time. Some of our newer members are bullies/cry bullies who are targeting me specifically and it’s destroyed the safe environment that existed previous to now.)",
        "created_utc": 1677972615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help please. Required to record activities broken down into timeframes for work compliance.",
        "author": "Swords_and_Cameras",
        "url": "https://www.reddit.com/r/ADHD/comments/11igttd/help_please_required_to_record_activities_broken/",
        "text": "So in my job we work with NDIS participants (for you non Aussies, they're individuals living with disability that affects them enough to need funding for supports e.g. physio, support workers, therapists, inclusion programs, employment supports or a heap of other things so they can lead fulfilling lives and access the services they need).\nIn my role, we upload a file not after each session, broken down into what we did and the times.\nE.g.\n\n2:00 pm - 2:10 pm\nDiscussed progress with work experience preparation.\n2:10 pm - 2:40 pm\nUndertook communication activities as per goal #2. Activities consisted of *insert description here*.\n2:40 pm - 2:50 pm\n*Ented detailed text*\n2:50 pm - 3:00 pm\n*Enter detailed text*\n\nAnd so on, for sessions which run for 2-4 hours.\n\nNow, I used to type a draft session plan to help, but my participants tend to veer from the plans, which is fine as long as it's related to their employment goals.\nBut I really struggle to write a comprehensive file Note (which also can't be too long ugh) breaking down how much time we spent doing each thing.\n\nBy the end of the sessions, good luck remembering how much time we spent on each thing, and I don't want to disrupt my participants by obviously checking the time and writing down notes regularly.\n\nAdditionally, currently my participants' sessions finish at 5 pm due to their availability, so I either day back on a brain that has lowered ADHD medication levels and try to write the file note, or worse I write it the following day  when I'm more likely to forget bits.\n\nI get paralysis too where I struggle to make myself start because it's so challenging.\n\nTL;DR\n*Screams into the abyss*",
        "created_utc": 1677972574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading With ADHD",
        "author": "SilencerSerhii",
        "url": "https://www.reddit.com/r/ADHD/comments/11igszx/reading_with_adhd/",
        "text": "How can one increase his/her reading comprehension with ADHD? For example,when I read something that doesn't have a special importance for me, I forget everything I read. \n\nI often cannot read without pomodoro. Could you share some of your hacks for effective reading with ADHD,please? -It's very interesting:)",
        "created_utc": 1677972516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I get reevaluated?",
        "author": "maisyo0",
        "url": "https://www.reddit.com/r/ADHD/comments/11igrk2/should_i_get_reevaluated/",
        "text": "Some time ago I got evaluated but I felt that the experience was really weird, like it didn't felt right. The evaluation was like so fast and the procedure was like just my dad answering a questionnaire, the psychiatrist said I didn't have ADHD because I cope well and did well in school (which was weird for me because if I was getting tested I sure wasn't coping well, but I'm naturally good at studies because I like learning things and my psrents are strict). The whole time I felt like she was judging me, as if I was telling my dad to say I had those symptoms (which I didn't I just translated the questions because he doesn't understand the language well) and the whole school thing. They supposedly asked my school but like I'm a almost straight A student who talks quietly, the teachers think I'm a shy and good student and I don't get distracted or distract other people.\n\nMy friends agree that I have the symptoms for ADHD or something similar, and my friend who has a diagnosis since he was a kid said that maybe medication would help. So idk if I want to get re-evaluated because I felt like shit last time, how is the testing? Because I thought that it wouldn't be just an excel sheet.",
        "created_utc": 1677972411,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice",
        "author": "DrGreenfing",
        "url": "https://www.reddit.com/r/ADHD/comments/11igq65/i_need_advice/",
        "text": "Hey, so in 2019 I got diagnosed with ADHD and then got Ritalin. I took the Ritalin for about 3 Years, but I always got unwanted side effects after that I got Atentin basically the German Version of Adderall. But that didn't really work either, then I just stopped Medication because I could live my Life pretty normally without meds.\n\nBut now too my Question. I have been playing Video games my whole life, and recently I started playing in a Competitive environment, not just normal Video games but Tournaments etc. And I just noticed after like 3 Hours I just can't  concentrate anymore, and I am not able to perform on the level I can perform at, and on the level I need to perform to get further. That's why I wanted to ask if anyone of you have Strategies for Similar Situations because Google didn't really help me and I don't really want to go back to Meds.",
        "created_utc": 1677972318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meeting Accommodations?",
        "author": "KateMacDonaldArts",
        "url": "https://www.reddit.com/r/ADHD/comments/11igply/meeting_accommodations/",
        "text": "[removed]",
        "created_utc": 1677972282,
        "upvote_ratio": 1.0
    },
    {
        "title": "My brains constant need for entertainment.😅",
        "author": "Squee3ds",
        "url": "https://www.reddit.com/r/ADHD/comments/11igmgg/my_brains_constant_need_for_entertainment/",
        "text": "I noticed more and more in recent years my mind tries to make everything funny. Whether it's someone saying something and me hearing something just silly for a few seconds until I process what they actually said. Or just picking up on the slightly funny way people say certain things. Just the little things I observe in other people I find funny. Recently sometimes when my gf talks certain phrases sound like rapping to me. Just the cadence of the words. I'm not complaining. It's hilarious to me. I'm bored a lot and you are all my entertainment.🤣 Who can relate?",
        "created_utc": 1677972061,
        "upvote_ratio": 1.0
    },
    {
        "title": "How validated (scientifically) are next-gen CPT modules like QBCheck in diagnosing ADHD?",
        "author": "TheIllandTheAd",
        "url": "https://www.reddit.com/r/ADHD/comments/11iggnd/how_validated_scientifically_are_nextgen_cpt/",
        "text": "My primary doctor has suspected I have ADHD for the longest time. I've actually been screened for ADHD in uni and school, but he is insisting I have it based on certain symptoms that are indeed very suggestive. He tried to fit me in with a neuropsych for a full-blown evaluation, but my insurance did not approve it. That neuropsych\\* suggested another guy, who does condensed evaluations that are much, **much** more affordable. Where's the catch?\n\nThe catch is that they focus almost exclusively on a software that diagnoses you, followed by a very short interview. This software is really, really new. The guy has a bunch of articles from medical journals on his site that rave about qbcheck and how it isn't like previous CPTs, which are apparently notably low-sensitivity. What throws me off is how ... intense he is about it. It comes across as if he gets a pretty penny from the manufacturers of qbcheck. I emailed with this guy, and he told me he's  just a professional who is really ecstatic about a \"gamechanger\" that removes the need for unneeded costs to the patient.\n\nDoes anyone know anything about them? Are they reliable? Or is this effectively a glorified PsychCentral quiz?\n\n\\**I should note here that the first neuropsych guy also referred me to someone who does similarly shortened tests, but still a bit more conventional. It consists of some screeners, 3 hours' worth of interviewing and the Connors CPT-3. But it costs nearly thrice the qbcheck, yet still much cheaper than the full blown assessments.*",
        "created_utc": 1677971679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling less than others",
        "author": "Repulsive-Creme5082",
        "url": "https://www.reddit.com/r/ADHD/comments/11ig8br/feeling_less_than_others/",
        "text": "Feeling less than others\n\nI’m fed up of getting disrespect,feeling less than others, right now I’m in program of computer class, and I feel like other people from my class treat me bad due to my inability to properly learn from PowerPoints slides, learning from PowerPoint is hard for me , I have adhd and when I read the slides I get lost and daydream. that’s not my type of learning.\nI love learning by my own from YouTube I can learn a lot from YouTube and very quickly , I will be a computer genius,I will not let myself be treated this bad.\nI will know every protocol from scratch, how computer works more than I know myself\nThe grind is addictive and im fed up of feeling less than others , I already know a lot about networking, but now I’m going to know even more, no one will disrespect me\nI don’t judge people based of their knowledge ,never, we are humans, but others judge, I won’t let them and if they wanna compete with me they shall know that there is no end",
        "created_utc": 1677971121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instant addiction to non addictive \"cigarettes\"? (for mods: i removed \"the part\")",
        "author": "Meencrafft",
        "url": "https://www.reddit.com/r/ADHD/comments/11ig7wy/instant_addiction_to_non_addictive_cigarettes_for/",
        "text": "So im 15, i have adhd but a higher iq of about 120-130 so i manage in school and when learning. Theres alot of minor things that \"my\" adhd brings with it, one of the main things tho is that i fidget, like alot, anything i get my hands on, i juggle in my hands, i watch a movie i make sounds with my feet or hands, to me very minor and i dont even realize it, to everybody else very annoying tho.\n\nThats just the introduction, now to what happened today, i went out to grill (not sure if thats how its called) with my dad and my twelve year old brother in the woods during the day i find some dried \"nielen\" (thats the german name, i couldnt find the real name, its like a kind of vine that you can smoke because it has lots of little tiny holes in it). So i find that and go and try and smoke it and show it to my dad, he laughs and says he used to smoke these as a dumb teenager etc. bla bla, but tells me off and says its bad, doesnt really care. i still smoke that thing for about 10 more minutes, then he tells me to stop cus thats stupid\n\nBtw: Its known where i live and has no proven compounds that would get you high or any kind of effect. Its just like your smoking wood, but with a slight odd taste. \n\nTo me that was very calming and i just loved to smoke that thing, i usually have a very bad mindset towards cigaretts which is why i think that was weird.\n\nSo we get home and as im in my bed, around 6pm i start thinking about that i can smoke that again as soon as my parents go to sleep, and thats the only thing im thinking about. WTF, i cant really put it in words without totally exaggerating but it was on my mind quite alot.\n\nSo i did hear that people with adhd like to smoke because its like fiddeling, could that be it?\n\nIm not really concerned or anything, and im making a huge post for just that but i gotta say im interested.\n\nThanks in advance, i will try to answer everything and please point out grammar mistakes or non logical points in the story, i tend to make those english aint my first language.",
        "created_utc": 1677971095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting my first adhd screening",
        "author": "Avetra",
        "url": "https://www.reddit.com/r/ADHD/comments/11ig3zt/getting_my_first_adhd_screening/",
        "text": "I'm 32 and finally getting tested, in the paperwork they sent me it says I need to bring a friend, co worker, or family member for the first hour, why is this? It also says it'll take 3-4 hours which makes me super anxious because the only person I can bring with me doesn't get off work until 12 so my appointment is at 1, and my daycare closes at 5:30. So I'm freaking out that I won't make it out before the daycare closes, and I have no one else that can pick my kid up. Also, I hate doctors so the thought of an appointment being 4 hours long is stressing me out lol.",
        "created_utc": 1677970835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just need some encouragement (and opinions) to convince myself that's it's okay to try and get tested for ADHD !!",
        "author": "Substantial-Leg2207",
        "url": "https://www.reddit.com/r/ADHD/comments/11ifxs7/just_need_some_encouragement_and_opinions_to/",
        "text": "Hi!   \n\n\nI just wanted some opinions or validation maybe haha forgive me if I did something wrong\n\n**tl;dr Unsure if I should ask and try for a diagnosis from my specialist that I've seen for a long time?**   \n\n\nLong story short, I'm going to go see my specialist (rheumatologist) soon who has seen me the longest out of all of my doctors (my GP works on a rotational basis so I rarely, if ever, see the same person twice). They are the one who helped me through all my other mental health problems so this isn't too out of the blue.   \n\n\nAfter lurking this sub and other ADHD related things, I feel like it's just too relatable to be a coincidence and the only type of anti-depressant that helped me be able to do anything was Wellbutrin XL which I read has some ADHD-helpy properties so, I'm a bit ??  \n\n\nI've been thinking about asking them if they could help me get to a psychiatrist but, my hesitance comes from a few places:  \n\n\n\\- ADHD and such have been 'trendy' on social media where it feels like everyone has it and it makes me nervous that I'm subconsciously thinking I have because of FOMO or something (I know this is stupid)  \n\n\n\\- This doctor has seen me since I was middle school until now in university and they never said anything then and I know ADHD is a genetic thing (I don't remember anything before about 4 years back (bc trauma yay!) so I don't know how I was as a kid)  \n\n\n\\- If they say 'no,' I just don't think I could handle it, like I'd be so ashamed. I would be able to accept that I don't have ADHD, it's just the potential of a rejection like 'no' or 'I don't think that's the case' really freaks me out.  \n\n\nThere's probably more, but that's all I can think of for now.  \n\n\nOh and the reason why I'm struggling is that I only see this doctor once every 3/4 months and I'm failing uni (woo-hoo) so that 3/4 months is a whole semester and I think it's better to address this sooner rather than later because I literally cannot afford to fail again. For some reason I think is important, but I'm Chinese so that's a factor I think...?  \n\n\nI have a lot of other questions and things to say but then this post would be a book long so I'll cut myself off here!   \n\n\nSorry I'm not quite sure what I exactly want but I think I just need some encouragement or opinions on what I should do in this situation?   \n\n\n**tl;dr Unsure if I should ask and try for a diagnosis from my specialist that I've seen for a long time?**   \n\n\n(also if you saw me post before, no you didn't, I wrote that when I really mad haha)",
        "created_utc": 1677970404,
        "upvote_ratio": 1.0
    },
    {
        "title": "wish i could be happy and focused at the same time",
        "author": "Maleficent-Debate529",
        "url": "https://www.reddit.com/r/ADHD/comments/11iftwe/wish_i_could_be_happy_and_focused_at_the_same_time/",
        "text": "i enjoy things so much more when i don’t take my meds. i went on a hike this morning and had an amazing time; i wasn’t focused on everything i have to get done and wasn’t in my head as much, i definitely feel more like myself when i’m not on my meds. but now i’m trying to get work done and i can’t for the life of me. i think being on meds so much has made my focus off of them worse. i have so much to do but can only do mindless tasks that don’t require a lot of thinking/sustained attention. i just want to feel like myself but also be able to be productive. am i on the wrong meds? i feel fine when i’m on them but am definitely a bit more irritable and don’t enjoy food at all. has anyone found the perfect balance of being happy but also focused?",
        "created_utc": 1677970139,
        "upvote_ratio": 1.0
    },
    {
        "title": "hyper focus out of control",
        "author": "dongdongplongplong",
        "url": "https://www.reddit.com/r/ADHD/comments/11iff4o/hyper_focus_out_of_control/",
        "text": "I need some help breaking out of hyperfocus because its making my life very hard, im only getting a few hours sleep a night and with a job and family im totally burnt out. the thing im hyperfocusing on *is* good for me in the right amount (creative/music production) but i feel like a drug addict with it right now, doing it during work hours and when i should be sleeping. Part of my brain notices when im doing it, tells me to stop and go to sleep but the adhd part that wants to stay in flow is stronger. When it gets bad i feel like theres just no time for anything else but my hyper focus interest, like there is this urgency to it and my brain cant prioritise actually important stuff like looking after myself.\n\nany advice would be very appreciated",
        "created_utc": 1677969125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost My Job Because of The Medication Shortage",
        "author": "FiftyNereids",
        "url": "https://www.reddit.com/r/ADHD/comments/11ifab2/lost_my_job_because_of_the_medication_shortage/",
        "text": "I started a new job back in September 2022. It paid very well and it was a good jump from the prior company I was at. However because of the medication shortage, after visiting various pharmacies and them never having any medication, I fell into a deep depression and stumbled the next couple of months. I was able to get my hands on medication last month and my performance at work has increased significantly. \n\nBut it didn’t undo the prior months of semi-poor performance. As a result I will be laid off next month. The company is willing to give me a bit of cushion time to find new work. I can’t help but feel that I screwed it up because many people would have killed for the job that I had. Just couldn’t keep up.",
        "created_utc": 1677968811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any side gigs good for ADHD?",
        "author": "ContactHonest2406",
        "url": "https://www.reddit.com/r/ADHD/comments/11if88b/any_side_gigs_good_for_adhd/",
        "text": "I recently had to go down to part time at work because of mental health issues. I should still be able to pay my bills, but I’m gonna need some cash for extra spending money. What’s a good side gig for people with ADHD? Especially one that maybe I could do full time eventually. I’m pretty good at writing if that helps.",
        "created_utc": 1677968675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do y’all get accused of having an attitude?",
        "author": "CriticalCase4337",
        "url": "https://www.reddit.com/r/ADHD/comments/11if7m1/do_yall_get_accused_of_having_an_attitude/",
        "text": "[removed]",
        "created_utc": 1677968633,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your experience as a Artist with ADHD?",
        "author": "DanteDoubleAgent",
        "url": "https://www.reddit.com/r/ADHD/comments/11if5x4/whats_your_experience_as_a_artist_with_adhd/",
        "text": "To any artist with ADHD, how does it positively AND negatively affect your performance as a artist? Truthfully I'm really more interested in hearing the setbacks it could cause but can't go wrong with some positives :) share anything you want!\n\nI'm still unsure whether or not I have ADHD yet( so take my experiences with a grain of salt ) but some things I've related to my artistic endeavors that I've been experiencing for years has been: I get painstakingly impatient with the process and physically feel this impatience just eating at me, easily agitated over nothing, miss obvious details &amp; the second a method/technique of art becomes slightly boring to me- I lose access to it all together and need to replace it with something new. Thought I would just grow out of this as my skill sluggishly grew but it's been years and my skills have improved but they're still getting dragged down by babysitting some manchild- aka me! \n\nanything of this sound familiar? what's your experiences, let me know! ( Advice is especially welcomed! )",
        "created_utc": 1677968520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ritalin LA with Caffeine",
        "author": "ExpensiveFeedback901",
        "url": "https://www.reddit.com/r/ADHD/comments/11if45n/ritalin_la_with_caffeine/",
        "text": "I've been on Ritalin LA (extended release) for about two weeks now. I started on a low dose, and I can't perceive much of an effect.\n\nHowever, I do think the Ritalin enables me to drink coffee without feeling like my brain is a ping-pong ball ricocheting all over the room. I had previously switched to decaf and tea because I couldn't handle a cup of coffee, but the Ritalin seems to help me gain the motivation benefits of caffeine without losing my mind.\n\nDoes anyone else have this experience with how stimulants interacting with coffee? Or am I looking for patterns where none exist?\n\nOtherwise, I really can't tell what the drug is doing.",
        "created_utc": 1677968408,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Freestyle writing piece I did for university.",
        "author": "CainTheWanderer",
        "url": "https://www.reddit.com/r/ADHD/comments/11if3wl/a_freestyle_writing_piece_i_did_for_university/",
        "text": "\n\nFree writing paper I did for university about being an adult with ADHD\n\nIt's not a masterpiece by any means but I hope you enjoy\n\n\n\"Living life as an adult with Attention Deficit Hyperactivity Disorder (ADHD) is a challenge that few talk about. I remember being 6 or 7 years old, sitting in clinic to clinic, talking to psychiatrist after psychologist about how hard it was for me to sit still, pay attention, remember things that I was supposed to remember. \n\nI don't know what I thought then, I was probably thinking about the next episode of Dragonball Z that was going to be on Toonami after school or if I was finally going to be able to beat the Water Temple in The Legend of Zelda on my already well-worn N-64. \n\nBut none of the words that these adults were telling me then mattered. In fact, I thought that most of them were idiots who didn't actually care about me, they just wanted to take my parents money and tell me how to live my life. Now as a 31-year-old adult, I understand just how wrong I was to shirk what these people were trying to tell me and how much they were wanting to help. \n\nTrying to explain how ADHD affects my day to day to someone who has never been around it offers an exciting challenge.\n\n How do I explain to someone that it's like walking down a hiking trail with 47 different pathways, while constantly noticing that my nose itches, my left shoelace is tied slightly less tightly than its brother on the right, my shirt isn't quite the right fit of comfort that I wanted for this walk, what I had for breakfast two Tuesdays ago and how I should have it again, while weighing my reactions to a conversation that I had 3 weeks ago that had already come to conclusion but I could have ended it differently if I had changed the emphasis on how I worded certain things.\n\nthen suddenly remembering I'm on a hiking trail and profusely sweating. Checking my watch to notice that 4 hours had gone by and I was 3 miles into my hike and couldn't remember a single detail of the trail I had been on. All of this while actually sitting in the comfort of my air conditioned apartment, eating a bowl of cereal at 8pm getting ready for bed.\n\n Its getting lost, then finding myself for a little while just to get lost again. Its failing at some basic human interactions while excelling at others. Its empathizing with others to the point that they think I'm trying to one-up them, but its also being such a socially distant recluse that I at times wonder if I'm plagued by an anti-social personality disorder. Its wishing that someone could dig inside my skull and rewrite the wiring of my neurons, while simultaneously loving who I am because of how unique it makes me.\"",
        "created_utc": 1677968392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for the medicated: do you still get days when your brain feels totally dopamine depleted?",
        "author": "redblueheader",
        "url": "https://www.reddit.com/r/ADHD/comments/11if3ja/question_for_the_medicated_do_you_still_get_days/",
        "text": "I'm still going through titration. After a week on my latest higher dose, I'm now feeling like my brain is lacking stimulation again - I feel restless, and bored, and none of my usual activities are appealing or can capture my attention, I can't get motivated to do the things I need to do tonight, and instead I just crave the things I used to before I started medication - caffeine, alcohol, junk food etc. I feel like self medicating again. I also feel a bit down emotionally, like there's no point trying to do anything useful today, and no way of cheering myself up. I'm feeling pessimistic and questioning my life choices and whether things actually can get better.\n\nIt's a similar feeling to how I experienced burnout before I started treatment. Am I just noticing it more now I know what it's like to feel better? But I didn't think I'd still get burnout once I started medication...\n\nSo my question is basically, is it normal to get days like this, even on the optimal dose of medication? Are these just days we have to get through, or should I be looking at altering my meds in some way? \n\nTIA!",
        "created_utc": 1677968367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unresponsive to meds and unsure of diagnosis",
        "author": "xi-v",
        "url": "https://www.reddit.com/r/ADHD/comments/11if1ry/unresponsive_to_meds_and_unsure_of_diagnosis/",
        "text": "I've dealt with treatment resistant depression most of my life and it seems to only become more complex. After trying most major antidepressants, TMS, therapy, naturopathic doctors, ketamine, and two hospitalizations, my psychiatrist ordered a comprehensive assessment from a neuropsychologist. In the assessment, he observed that in addition to the major depression, I was most likely experiencing ADHD. He didn't pursue a bipolar II diagnosis which is what I was being treated for at the time, even though I didn't fit neatly into the diagnosis.\n\nSo here's the first example of my question about meds. My psychiatrist has put me on modafinil to help manage fatigue from depression and medication side effects. The modafinil did nothing, essentially. We even went up to 400 mg per day which is outside of the FDA recommendation. I didn't even get anxiety, which I'm prone to.\n\nNow we're trying to address the ADHD component, so I started taking 18 mg Concerta. I couldn't even tell that I had taken anything, not that I was expecting anything crazy, but I assume that I would experience anxiety if it wasn't what I needed or I would experience even a small benefit if it was what I needed. So my doctor increased the dose to 54 mg. Again, nothing. It seems strange that I wouldn't even notice a negative effect. In addition to this, antidepressants used to work for me but now, if they do work, they become ineffective after a few months. I know that medication isn't the sole answer, but it's frustrating when a medication doesn't even help to rule things out when dealing with an atypical mental health complex.\n\nSo I don't know if this is even the proper sub for this post, but I'm wondering if anyone else has been unresponsive to psych meds, and I'm especially thinking of ADHD meds. And what's a good treatment path when you can't even be sure of the diagnosis?",
        "created_utc": 1677968247,
        "upvote_ratio": 1.0
    }
]