[
    {
        "title": "ADHD drugs as an Adult?",
        "author": "Tio1988",
        "url": "https://www.reddit.com/r/ADHD/comments/11ni8tm/adhd_drugs_as_an_adult/",
        "text": "[removed]",
        "created_utc": 1678433309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I give ritalin more time?",
        "author": "evenobject7",
        "url": "https://www.reddit.com/r/ADHD/comments/11ni6g1/should_i_give_ritalin_more_time/",
        "text": "I went on ritalin regular release in the past two years ago for predominantly inattentive adhd but found the side effects too horrible (fatigue, dehydration, nausea) and only lasted about two weeks. I’ve finally now had another psychiatrist appointment and had my special authority renewed and have been started on Ritalin LA because I really struggle at uni. I’ve now been on it for 8 days but when I take it I just don’t feel good. I feel unmotivated, tired, dehydrated, I’ve experienced no positive effects. It also makes my anxiety so much worse to the point I couldn’t go to one of my lectures. I didn’t take it today and I feel way less terrible and less anxious. I have another appointment on the 23rd but I just don’t want to keep taking it until then. Is it too early to tell if it’s working/to for the side effects to subside? I didn’t take it on the weekend so only taken it 5/6 times.",
        "created_utc": 1678433094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diagnosis at 30?",
        "author": "alextbrown4",
        "url": "https://www.reddit.com/r/ADHD/comments/11ni44n/diagnosis_at_30/",
        "text": "Is it that common for people to not realize they have ADHD till adulthood? Idk why it took me this long to even consider it but I read up on symptoms recently and I check every single box. I even took some bs quizzes for shits and giggles and they all said go see a doctor. Anyways I’m setting up an appointment with my PCP but the posts I’ve been reading here describe me to a T. It’s like I finally found a group of people that suffers all the same quirks and issues I do. I drive my wife nuts by fidgeting constantly, I procrastinate like no other even at the risk of school/job impact (I’ve dropped out of school twice), even forcing myself there is a limit to how long I can pay attention to work calls like 5-7 minutes max and I am spacing hard, I set my keys/water bottle down and forget where they are like 5 times a day, I’ll go to the store to get something, get 8 things, and then realize I never got what I went to get. \n\nI’ll continue to peruse this sub and gather information but any advice/resources would be great on dealing with potentially having ADHD. Or at the very least what’s a good starting point. It feels good to maybe have figured out why I’ve felt like such a failure my whole life. If I do get the diagnosis I really hope therapy and medication can make a big difference. It’s really depressing to just you’re stupid or less capable than other people and there’s no fixing it",
        "created_utc": 1678432880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey everyone, I'm doing a project for my major work; an investigation into the societal perceptions of ADHD and would love it if you could fill out my questionnaire if you have been diagnosed or are in the process of being diagnosed with ADHD.",
        "author": "Plsdomyquestionnaire",
        "url": "https://www.reddit.com/r/ADHD/comments/11ni11o/hey_everyone_im_doing_a_project_for_my_major_work/",
        "text": "[removed]",
        "created_utc": 1678432600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey everyone, I'm doing a project for my major work; an investigation into the societal perceptions of ADHD and would love it if you could fill out my questionnaire if you have been diagnosed or are in the process of being diagnosed with ADHD. I will attach the link below. Thank you!",
        "author": "Plsdomyquestionnaire",
        "url": "https://www.reddit.com/r/ADHD/comments/11nhzgx/hey_everyone_im_doing_a_project_for_my_major_work/",
        "text": "[removed]",
        "created_utc": 1678432454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else been 'discriminated' against at work?",
        "author": "AnnaK2022",
        "url": "https://www.reddit.com/r/ADHD/comments/11nhipu/has_anyone_else_been_discriminated_against_at_work/",
        "text": "[removed]",
        "created_utc": 1678431005,
        "upvote_ratio": 1.0
    },
    {
        "title": "New on Vyvanse",
        "author": "xnoinfinity",
        "url": "https://www.reddit.com/r/ADHD/comments/11nhbyc/new_on_vyvanse/",
        "text": "I have recently been diagnosed with ADHD last month and started with Atomoxetine that I didn't tolerate well so I was wondering what are your experiences on Vyvanse? Due to my anxiety and not good reaction on Atomoxetine my psychiatrist prescribed me 10mg as a like slow try out to not take any precautions till the end of the month",
        "created_utc": 1678430418,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you guys convey to your teachers/professors/employers that you aren’t dumb, just forgetful?",
        "author": "FlagshipHuman",
        "url": "https://www.reddit.com/r/ADHD/comments/11nha4e/how_do_you_guys_convey_to_your/",
        "text": "I’ve struggled with remembering things all my life. I’m in a profession that I enjoy, because it involves complex research and analysis, which keeps my brain engaged. But the one thing I despise is that I’m required to remember a bulk of information down to very small details. I can work them out if I have access to the internet and source materials. However, when you’re being tested, or interviewed, or have to give a presentation, you aren’t allowed to look at the source material. If it’s something like an interview, people with anxiety have it worse, since you’re also extremely anxious because you *know* you’ll probably not remember stuff. And someone staring at you while you try to remember something makes it all the more difficult to do so. It’s extremely unfair and annoying in this day and age I shouldn’t need to memorise things when I can have access to all the information in the world on my fingertips. \n\nJust wanted to know if any of you face this as well, and if yes, how do you deal with it? I just want people to know that I’m not stupid, I just can’t rattle off things off the top of my head.",
        "created_utc": 1678430260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you maintain weight after stopping adhd meds?",
        "author": "Early_Salamander_808",
        "url": "https://www.reddit.com/r/ADHD/comments/11ngu2t/can_you_maintain_weight_after_stopping_adhd_meds/",
        "text": "Hello, so I am wondering if anyone has had any experience with going off adhd stimulants and effects on weight/body/metabolism after stopping? I am concerned as I have lost weight due to healthy changes in my life style and also the fact that medication helped stopped my impulsive eating and I’m worried if I go off I will gain the lost weight back even though I did it in a long term way.",
        "created_utc": 1678428933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep issues",
        "author": "x5ten03",
        "url": "https://www.reddit.com/r/ADHD/comments/11ngo8t/sleep_issues/",
        "text": "Male, age 31, newly diagnosed with ADHD inattentive type . I have been started on 30mg of Vyvanse and 5mg of Dexampheatamine as a top up to take once as needed (usually no later than 12:30pm)\n\nSome nights when I have taken both doses I have issues with not feeling tired and difficulty getting to sleep (known side effects) I was wondering if anyone has any tips they could share to deal with this.\n\nI have been told to try taking Vitamin C at night time because the acidity is meant to reduce the effects of Vyvanse. \n\nDoes anyone have experience with this?",
        "created_utc": 1678428448,
        "upvote_ratio": 1.0
    },
    {
        "title": "First day on Vyvanse 30mg and feel so foggy",
        "author": "Sianburton1984",
        "url": "https://www.reddit.com/r/ADHD/comments/11ngi0m/first_day_on_vyvanse_30mg_and_feel_so_foggy/",
        "text": "Today is my first day on meds after being diagnosed last week.\n\nI took 30mg of Vyvanse this morning and within a few hours felt really foggy. I had today off luckily as I definitely wouldn't have been able to work. I feel like I can't focus properly and like I have cotton wool in my head, has anyone else experienced this? Does it go away? I'm now 10 hours into the dose and still feel the same.  \n\n\nOn the plus side the chatter in my head has gone and I was able to play with my daughter for an hour today without being distracted. I was also able to reason with my ADHD daughter this morning without losing my cool and, whilst out walking, I felt like I was connected to the outside world instead of the one in my head and could hear the birds and see the flowers for what felt like the first time ever. All super positive but I'm not going to be able to stay on these meds if I feel this foggy everyday.",
        "created_utc": 1678427971,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do y'all face your fear/aversions to things?",
        "author": "footballmonkeys",
        "url": "https://www.reddit.com/r/ADHD/comments/11nge43/how_do_yall_face_your_fearaversions_to_things/",
        "text": "I am so avoidant. I avoid studying because I know I get distracted even with Adderall and I'm demotivated. Why study when it'll just make me feel bad about myself? I avoid going to social events because I'm so hyperactive and I can't follow along with conversations and conversations bore me and I'm socially awkward and I have \"too much energy\". Why put myself out there if I'm just going to start spiraling and overthinking everything I say or do? I feel like quitting everything. I'm scared of studying; I'm scared of failing again. I'm scared of putting myself out there. How do y'all get over the fear?",
        "created_utc": 1678427635,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I don't have time to consume all the good media ever and feel uneasy by a certain feeling of missing out",
        "author": "lynxerious",
        "url": "https://www.reddit.com/r/ADHD/comments/11ngb22/i_feel_like_i_dont_have_time_to_consume_all_the/",
        "text": "I have interests in many many things. I want to read many good books, watch great movies, play excellent video games,... That's normal. \n\nBut lately I want to spend any of my spare time not working to consume. Because there are so many great things there that I haven't experienced, I want to consume them all, I'm feeling greedy. But they take time and energy to even complete, especially video games. And it's more productive and take way more effort than browsing social media all days.\n\nIt starts to give me an axiety feeling of missing out, like I don't have time to enjoy this thing that people said are masterpieces. But there are more and more masterpieces thing in the world every day, I can't possibly have time to take them all in.\n\nI do some running/swimming once in a while, and I'm learning the piano too. That is way to many stuff for a day after a 9 to 6. So it kinda makes me having to stay up a bit late to at least some checklist on them. Alright, after dinner, I should play this game, maybe an episode of this show, learn this piece of music,... If I don't do it, I would feel worse. But the feeling of not having enough time to do them all makes me stop doing activity like exercising regularly because they are the same, and I somehow always want to experience new things.\n\nIt's like the greed of experience is trying to take over me, and I'm overwhelmed by the amount of knowledge and things that I want to know more.",
        "created_utc": 1678427384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medic School and ADHD",
        "author": "OGShadow3",
        "url": "https://www.reddit.com/r/ADHD/comments/11ng2fo/medic_school_and_adhd/",
        "text": "Hey Reddit, I’m a 22yom EMT-Basic and I’ve been in the field for around 9-months. My company is offering a sponsored certificate paramedic program with our main university and I’m planning on signing up. But I have ADHD. And I’m trying to figure out the best way to manage that and school. Not to mention that it is a fast track program and will take 10.5 months to graduate. I am on medication but still struggle with time management and with finding a good way to study. Who’s got any tips or tricks on how to make it through medic school with ADHD?",
        "created_utc": 1678426660,
        "upvote_ratio": 1.0
    },
    {
        "title": "can people with ADHD complete university?",
        "author": "Background-Fly-8869",
        "url": "https://www.reddit.com/r/ADHD/comments/11nfx9c/can_people_with_adhd_complete_university/",
        "text": "just looking for reassurance i guess, maybe some advice and success stories too. i’m currently having yet another bout of feeling hopeless, haha. fair warning there’s a lot of text, TLDR at the bottom.\n\nso some background - i’m 25, australian, i never finished high school, but i completed a certificate and a diploma at TAFE (which is equivalent to community college in the USA, according to google) and i got into university that way at age 20. i’ve been enrolled in uni since semester 2 2017 and i think i’ve completed maybe 10 units so far, so a year and a half’s worth of units (i’m guessing, i can’t currently check my completion status because i have a sanction on my enrolment). i’ve only studied part time and taken on just 2-3 units each semester. i think i’ve spent more time deferred/on leave of absence than actually attending classes at this point, lol. i was diagnosed with ADHD early 2023 and haven’t been at uni since 2022.\n\nmy three most recent attempts at uni i couldn’t make it past the second assignment for the semester — in 2019 my uncle passed away and wasn’t mentally well enough to study, in 2020 i struggled getting to campus on time and missed half of my classes and then i couldn’t adjust to online learning when the covid lockdown started, and then my most recent attempt last year i had convinced myself that i was failing and that there was no point to studying and so i stopped showing up to classes even before getting my results back for my first assignments (i ended up getting 93% on one, and 78% on another that i handed in late and lost 10%)\n\nin previous units i had passed all of my completed assignments, but i would’ve scored higher if i handed it in on time and didn’t receive the late penalty. there is a way to get an automatic extension plan on assignments if i provide a medical certificate, but i’ve only done that once before because the process of acquiring a plan intimidates me and i shut down.\n\npsychiatrically; i’m on an antidepressant that works well, i’ve been on dexamfetamine sulfate for one month that only kind of helps, i’ve done DBT and CBT twice, schematherapy once and a tiny bit of EMDR that was unsuccessful because i couldn’t hold my attention long enough during sessions. i’ve *really* tried to challenge my persistent and reinforced negative core belief that i’m inherently a failure, but i tend to be on the treatment resistant side of things, and deep down i still wholly believe that i’m hopeless. i’ve never felt accomplished before when i achieve something academically.\n\nanother thing is that i’m unable to apply for a HECS debt (student loan) because when i turned 18 i received my father’s inheritance and so i’ve been paying my tuition fees out of pocket. i’ve lost ~7 units worth of fees so far, and while i work and can comfortably support myself financially, this makes me anxious to return.\n\ntoday i’ve checked my student emails for the first time in forever and i see that i’ve got a sanction and have to sort it out ASAP or i’ll potentially lose my enrolment and my place in the course. this prompted me to reconsider trying university again now that i’ve been diagnosed with ADHD, but i’m still uncertain. i think i’ll need all the help i can get.\n\n\nTLDR; i want to go back to study, i really enjoy it, but life’s making it hard. is it even possible for someone like me in this situation to finish something as big as a university degree?",
        "created_utc": 1678426230,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time on meds",
        "author": "Commercial-Trash-226",
        "url": "https://www.reddit.com/r/ADHD/comments/11nfwo8/first_time_on_meds/",
        "text": "In Decemeber I had a trial run of 10mg ritalin for a week. I felt more \"awake\" and felt like I could function better. However the psychiatrist then suggested I should rather take a concerta generic(contramyl 27mg). I'm starting the generic today and wanted to know what to expect. Will it have a similar effect as the ritalin? Because as a student what bothers me the most about this thing is not being able to get up in the mornings and having the attention span of a fish🥲",
        "created_utc": 1678426191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling dull and tired on mdm4",
        "author": "No_Telephone_9991",
        "url": "https://www.reddit.com/r/ADHD/comments/11nfmpr/feeling_dull_and_tired_on_mdm4/",
        "text": "Recently when I’ve taken mdm4 I haven’t felt euphoric at all. It was the crystal pure md pills and they’ve been tested and all my friends felt great except me. I felt so cold and tired and didn’t even want to be around peopl. All I wanted to do was go home. I felt horrible tbh. I was like zoning out and feeling so exhausted. Does anyone else ever experience this?  I also have adhd but I’ve taken mdm4 other times and felt amazing. It’s very werid and I rlly want to figure out why this happens",
        "created_utc": 1678425349,
        "upvote_ratio": 1.0
    },
    {
        "title": "vayvance and Adderall",
        "author": "tiredfromthemeds",
        "url": "https://www.reddit.com/r/ADHD/comments/11nfeyf/vayvance_and_adderall/",
        "text": "[removed]",
        "created_utc": 1678424709,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best options for budget-friendly noise cancelling headphones for people with ADHD?",
        "author": "Frumblebeee",
        "url": "https://www.reddit.com/r/ADHD/comments/11nez2k/what_are_the_best_options_for_budgetfriendly/",
        "text": "In my experience with ADHD, one of the most challenging struggles I have dealt with is my extreme hypersensitivity to both emotional and physical stimuli. I get extremely overwhelmed, overemotional, and am prone to panic attacks whenever I feel particularly overstimulated. \n\nAs I am nearing the end of my senior year of high school, I am beginning to notice how much background noises affects my focus when attempting to complete assignments, especially in my AP courses that often has more reading and requires much more focus. Even on medication, I can’t work efficiently in anything but complete silence. Even though my peers probably understand, I find it embarrassing to be seen holding my hands over my ears, or asking to do my work in a quieter location.\n\nMy therapist even suggested noise cancelling headphones for me, but I’m struggling with the amount of options I have. I feel like the best headphones for noise cancelling are extremely pricey. I’m 18, and I genuinely don’t have hundreds of dollars to throw down. If anybody else here knows of effective options that are budget friendly, please let me know!",
        "created_utc": 1678423469,
        "upvote_ratio": 1.0
    },
    {
        "title": "l look like a killer",
        "author": "Danplanman",
        "url": "https://www.reddit.com/r/ADHD/comments/11neptr/l_look_like_a_killer/",
        "text": "[removed]",
        "created_utc": 1678422715,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to control Adhd tics?",
        "author": "PhatStrong",
        "url": "https://www.reddit.com/r/ADHD/comments/11neowp/how_to_control_adhd_tics/",
        "text": "I work in finance/sales and when I’m in the zone I’m zeroed in at my standing desk. When on remote calls I’m constantly pacing in my office, squeezing stress ball, etc. to point colleagues ask if I ever stop moving. I lift/run every morning to burn off extra energy before taking my medicine. \n\nWith our office returning to work and allowing more travel to client sites my tics have become more noticeable to others. Even with medication I have always had a problem sitting still. Fidgeting let’s off energy while allowing mental concentration. \n\nTips to control/hide?",
        "created_utc": 1678422643,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started ADHD meds today. How does my experience compare so far?",
        "author": "Fleuro739",
        "url": "https://www.reddit.com/r/ADHD/comments/11neo9q/i_started_adhd_meds_today_how_does_my_experience/",
        "text": "[removed]",
        "created_utc": 1678422601,
        "upvote_ratio": 1.0
    },
    {
        "title": "That Guilt Around My ADHD Symptoms",
        "author": "Ashton_616",
        "url": "https://www.reddit.com/r/ADHD/comments/11nembh/that_guilt_around_my_adhd_symptoms/",
        "text": "I´m currently drowning in my life at the moment. I´m failing one class and have two C´s in other classes. I keep forgetting assignments and test dates and no matter what planner I use, I will forget. And if I do remember, I´ll avoid it like the plague and beat myself up because I procrastinated. I struggle badly with time management, and time blindness. And every time it affects my friends, project members, and family, I feel so guilty about it. Every tip I´ve seen helps for a day then I forgot or get overwhelmed. \n\nI know that there are some things I can´t control until I receive help from a mental health professional, but there´s always that guilt that I´m just not trying hard enough and it´s my fault I´m failing.\n\nLike today, I´ve been avoiding buying my ticket for the Spring Dance which I´ve been very excited about this Saturday all week because, in my head, I planned to get my ticket on Friday, tomorrow. But now there´s no school tomorrow now, and I can´t get a ticket. I want to be angry but I just can´t help but feel guilty complaining about it or asking for help because *I* was the one who chose to procrastinate the ticket. \n\nNow I have to email my school´s Student Council to buy a ticket. But I´ve had a history of doing things late like asking them last minute for my friend from another school to come to our past homecoming without a pass because I forgot to send it to my friend. I just feel so guilty for wanting to ask them if I can get it still. Some part of me says this isn´t a symptom and I´m using my ADHD as an excuse, while the other part is saying I´m valid. I´m just stuck in fear while writing the email.",
        "created_utc": 1678422440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences with Ritalin LA and generics?",
        "author": "Smiles360",
        "url": "https://www.reddit.com/r/ADHD/comments/11nem0d/experiences_with_ritalin_la_and_generics/",
        "text": "TLDR; Generic Ritalin LA is working weird for me, should I keep trying it or try to get back on the IR. Also should I try to get a branded medication over a generic one? \n\nSo I just recently started taking medication about a month ago and it's worked wonders. I started on a generic Ritalin IR. My psych wanted to put me on Concerta after that worked but I got a generic Concerta and it was terrible. My psych tried to get a prior authorization for brand name Concerta but the insurance company said they cover Ritalin LA so I should try that. \n\nI thought that meant it was going to be brand but it wasn't. It's Ritalin LA made by Granules Pharmaceuticals. I've taken it for the last 3 days and it's been interesting. The first day it worked pretty good, almost felt like the first time I had Ritalin IR again. The second day I was in school and I just felt like it's effectiveness kept going in and out and in and out. Not stable at all. Then today I've been physically anxious like something is in my chest and I've been irritable and agitated all day. It's kinda wearing off now. I'm just wondering; do I need to get used to the Ritalin LA? Will it get better if I take it more? I want to try for at least a week just to see. \n\nWhere things get weird is that my insurance DOES cover the brand name of Ritalin IR. But CVS put it on hold. They say they can't order it. I could move it though. I also have a generic Ritalin IR made by Mallinckrodt which isn't great it doesn't really do a lot. \n\nAnyway my main questions are:\nWhat are your experiences with Ritalin LA? And generics? \nShould I try to get the brand Ritalin IR or stick with the LA for now? Thank you so much",
        "created_utc": 1678422414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyperfocusing on a guy that I like??",
        "author": "zombiequeen66",
        "url": "https://www.reddit.com/r/ADHD/comments/11neiy2/hyperfocusing_on_a_guy_that_i_like/",
        "text": "Has this ever happened to you that you meet someone, there is a connection, you start hanging out with them almost everyday, and you really like them that you can’t get them out of your head?? There is this guy that I like, and I constantly check my texts to see if he has read it, or not, over and over, and I start getting obsessive about them? \n\nJust wondering if this is an ADHD thing to hyper focus on someone you like??",
        "created_utc": 1678422168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Out of Sight, Out of Mind",
        "author": "ArcLight5150_",
        "url": "https://www.reddit.com/r/ADHD/comments/11nehiq/out_of_sight_out_of_mind/",
        "text": "I’ve got a rather busy life, trying to juggle my work life(including relationships with people at work), spending time with my wife and kids, all my family back at home(I’m thousands of miles from family, and only see them every few years now), friends from back home(only have 2), adult responsibilities(fixing/buying/maintaining, etc), my own personal time &amp; hobbies, etc. Me and my 2 friends aren’t the kind of people to have conversations over the phone, more of playing video games together. One of my friends, we play videos games every Saturday night(my only “free time”), but the other friend gets kinda neglected, in which some of it is “out of sight, out of mind” and it’s hard for us to coordinate time together. I want to tell him I don’t mean to ignore him or not talk to him for a while because of the “out of sight, out of mind”, along with life’s business, but I don’t want to sound like an asshole. How can I get that point across without sounding like I don’t care about him?",
        "created_utc": 1678422054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyperfocusing on a guy that I like?",
        "author": "zombiequeen66",
        "url": "https://www.reddit.com/r/ADHD/comments/11neebt/hyperfocusing_on_a_guy_that_i_like/",
        "text": "[removed]",
        "created_utc": 1678421803,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to confront my kids school re: their mishandling of a situation.",
        "author": "incognito_nonya",
        "url": "https://www.reddit.com/r/ADHD/comments/11nedgr/i_want_to_confront_my_kids_school_re_their/",
        "text": "My son (5 y/o kindergartener) has ADHD. He has a history of eloping, hiding under tables, and non compliance when instructed to do things he has no interest in (mostly class work when he’s overwhelmed). He has an IEP and a resource teacher who pushes into class to support him, or he goes to her room when he needs a break.\n\nToday I went to pick my kids up early (1:20pm) for an appointment. I walked into the schools office and the assistant principal is there with my son. She waves me into a room to talk, the principal walked in behind me.\n\nMy son looked upset so I picked him up. The principal told me that my son was heard telling some classmates to help him unalive another student during recess (around 10:10am). Supposedly another student overheard and reported to the teacher. My son denied this very strongly and passionately stating that someone else had done it, the assistant principal shook her head up and down stating that he admitted to the resource teacher that he DID make that statement. She said that four other students all agreed that he did it also. He denied again, each time he refuted the principal would disagree and reference him admitting it to the resource teacher. She said they would do more fact finding as they hadn’t had a chance to do so at that point aside from talking with my son trying to get him to be truthful about “what he had done”.\n\n1.5 hours later the principal calls. She says that after talking with the students involved, it was determined that they were playing super hero’s and villains during recess and that there was no real threat and the whole thing was a misunderstanding. She went on about how she knew they had to have been playing and how they know my son is not like that, so on and so forth. She also stated that they spoke to THE “other gentleman” (another student) and explained to him that they shouldn’t say things like that even when they’re playing, and to use different words instead. She then said how she talked to the student who reported and explained to them that they needed to be more careful before they report things and that they needed to basically mind their business and worry about themselves. Like all is well and we can just move on now. \n\nI feel this situation was mishandled and caused unnecessary distress to myself and my son. \n1. They should have done their fact finding before they looped me in and caused all this distress upon my child. \n2. The principal stated that he admitted to making the statement to his resource teacher. However, in the daily communication log from the resource teacher, she stated that he did not admit to making the remarks and that he blamed another student.\n3. My son told his homeroom teacher that he was not the one who made the remarks, he told her who did and she told him he was not being truthful before sending him to resource. The resource teacher accused him of lying, and the principal insinuated that he was not being truthful as well by repeatedly saying in front of him that he admitted to it already.\n\nI talked with my son after I had the last conversation with assistant principal and told him that he wasn’t in trouble and it was just a misunderstanding, even then he said, “but mom, I really didn’t say it, so and so did. I told Mrs XXX, and she said I wasn’t telling the truth”. \nI’m further upset that all of the adults around him at school accused him of lying and automatically assumed his guilt before getting all the facts because “the kid with ADHD is always the guilty party.\n\nI feel they owe me and my son an apology. They completely bombarded and dropped a bomb on me as I’m retrieving my kids for their appointments without all of the facts. \nAlso, I’m trying to decide if I want to send an email expressing my grievance or if I should schedule a meeting to hear/see their reactions in real-time before they’re able to concoct a story that sounds good.",
        "created_utc": 1678421732,
        "upvote_ratio": 1.0
    },
    {
        "title": "quite bpd or Adhd ? what might be the accurate diagnosis in my case",
        "author": "Ashton_michael69",
        "url": "https://www.reddit.com/r/ADHD/comments/11nebn8/quite_bpd_or_adhd_what_might_be_the_accurate/",
        "text": "I'm 20 and live alone after the abandonment/neglection from my parents . Kicked out of school at 15 for being zone out during school time and being absent . Have zero friends . Have a confusing hate for people or the world around me it's kind of hard to explain . I spend my day alone daydreaming that kinda look like some coping mechanism i made up for my emotions . And i do ruminate about things inside of my head. Sometimes it's fun but mood swings fast and end up getting angry for it. Like i really wanna fit in with a outside world but at the same time i wanna punish them and hate them. I'm kind of sensitive to rejection so i prevent myself from making friends they all endup being disappear . I always fidget my legs or tapping desk while doing stuffs and zone out everytime even while watching a 10 min youtube video . Always catch up myself daydreaming on certain subject that maybe related to tasks i doing or something i interested in.",
        "created_utc": 1678421587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any canadians have any idea of how to go about getting an adhd and/or autism diagnosis?",
        "author": "jadeemayer",
        "url": "https://www.reddit.com/r/ADHD/comments/11neaj2/any_canadians_have_any_idea_of_how_to_go_about/",
        "text": "I have spent the better half of a year doing research on both including taking multiple tests, reading both DSM-5’s, writing notes on how they fight with eachother, writing notes on what symptoms I have noticed as an adult/a child, etc. I have a binder full of things now, pages on pages.\n\nI 100% believe in self diagnosis being valid but for some reason, I cannot accept it for myself. I think its especially hard because I know I have anxiety, I know I have depression and I know I have trauma due to my childhood and past relationships. A lot of things in adhd/autism overlap with these other things so it’s so hard to tell what is what.\n\nI want to get a formal diagnosis for both but when I talked to my doctor, she dismissed me and said that both of these would’ve been recognized as a child. Just looking for any advice or places I can contact for help. \n\nThank you, in advance.",
        "created_utc": 1678421498,
        "upvote_ratio": 1.0
    },
    {
        "title": "quit Bpd or Adhd ? what might the accurate diagnosis in my case",
        "author": "Ashton_michael69",
        "url": "https://www.reddit.com/r/ADHD/comments/11ne8us/quit_bpd_or_adhd_what_might_the_accurate/",
        "text": "I'm 20 and live alone after the abandonment/neglection from my parents . Kicked out of school at 15 for being zone out during school time and being absent . Have zero friends . Have a confusing hate for people or the world around me it's kind of hard to explain . I spend my day alone daydreaming that kinda look like some coping mechanism i made up for my emotions . And i do ruminate about things inside of my head. Sometimes it's fun but mood swings fast and end up getting angry for it. Like i really wanna fit in with a outside world but at the same time i wanna punish them and hate them. I'm kind of sensitive to rejection so i prevent myself from making friends they all endup being disappear . I always fidget my legs or tapping desk while doing stuffs and zone out everytime even while watching a 10 min youtube video . Always catch up myself daydreaming on certain subject that maybe related to tasks i doing or something i interested in.",
        "created_utc": 1678421373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there valid online diagnosis options?",
        "author": "SpiritualScumlord",
        "url": "https://www.reddit.com/r/ADHD/comments/11ne7z9/are_there_valid_online_diagnosis_options/",
        "text": "I've contacted the three Psychologists in my city that cover ADHD and the other issues I want to investigate, but all of their appointments are taken until April 2024 minimum. Are there any valid options for me to get a proper diagnosis online? Preferably something affordable because I doubt my insurance will cover an online session, but nonetheless I'm interested in what people have to say. \n\nI gave it a search myself but I'm only seeing info about speaking with Psychiatrists, not Psychologists.",
        "created_utc": 1678421305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chaos / adrenaline, or routines / peace?",
        "author": "AnonymousOnReddit99",
        "url": "https://www.reddit.com/r/ADHD/comments/11ne7v8/chaos_adrenaline_or_routines_peace/",
        "text": "I hate routines! The boring, do it the same way every day aspect makes them miserable. But without them I forget to do too many things. My mornings before work were chaos. I had to bring a second set of toiletries to work because I would forget contacts or deodorant, etc. I would rush around frantically trying not to be late. I tried the Routinery app. Yes it helped. But I can’t stand it. Every morning is the same thing in the same order 🤮 and it works. \n\nHonestly I think the chaos brings me adrenaline…but I want myself to want a peaceful boring routine! \n\nThe same way I want myself to go to the gas station when it’s 1/4 full instead of waiting til the last possible minute. Instead I wait til the gas icon is on / blinking. The stress that causes! And every time I promise myself that next time we’ll go in peace when it’s at a quarter tank and stop this nonsense. \n\nI want a peaceful organized type of daily life—except that I think the adhd gremlin in charge of my brain, who is the real boss these days, likes chaos because it brings adrenaline. Anyone relate?",
        "created_utc": 1678421295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any credible online diagnosis options?",
        "author": "SpiritualScumlord",
        "url": "https://www.reddit.com/r/ADHD/comments/11ne5hf/are_there_any_credible_online_diagnosis_options/",
        "text": "[removed]",
        "created_utc": 1678421113,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop obsessing over new love interest",
        "author": "Savor_Serendipity",
        "url": "https://www.reddit.com/r/ADHD/comments/11ne26z/how_to_stop_obsessing_over_new_love_interest/",
        "text": "I noticed I have a recurrent pattern when meeting a new potential love interest and I can't seem to get over it. \n\nI know all about NRE (new relationship energy) -- the exciting high we get when we are starting a new relationship or on the verge of that. And it makes sense that in an ADHD brain, NRE is exponentially stronger. \n\nIn my case this manifests as follows.\n\nI meet a guy with whom there is a clear connection. At first I have no expectations and I take things one step at a time. I enjoy the time we spend together and getting to know each other etc. I don't take things personally, I don't overanalyze what he does, and I'm generally just feeling happy about the new connection and looking forward to seeing where it might go. I'm not too attached to any outcome. So far so good!\n\nAfter a little while, if all goes well, it becomes clear that he really likes me. \n\nAnd that is when things paradoxically start going downhill for me. My brain seems to kick off into high gear and I enter this frenzy of dopamine rollercoasters. I start analyzing all the little details of the guy's behavior towards me, what he said, how he looked at me, messages he's sending me, etc. If I feel that he's not moving our connection forward fast enough, I start to get frustrated and impatient. Or I'll get very frustrated if I imagine I'm noticing any small, perceived decline in him expressing his interest in me (Hello, RSD..!) \n\nAnd it's so exhausting and unhealthy. I want to just stay in that initial \"Let's see where this might go\" curious, relaxed mindset and enjoy the budding connection, and yet my brain is trying to jump ahead at a million miles a minute and interprets every little thing through the lens of RSD. \n\nThis is all especially frustrating because I am clearly able to have that chill, no expectations, relaxed attitude in the beginning of the connection. I've done a lot of inner work and at this point I'm very self-aware and emotionally intelligent, and yet I can't seem to hold on to that relaxed attitude after the initial phase of the connection progresses. \n\nAnd it's so frustrating how it's so easy for me to be chill and relaxed in the beginning, when I'm not really sure at all how he feels about me, and yet as soon as I become fairly certain that he really likes me and is interested in moving forward, rather than enjoying that feeling, I enter this crazy, frenzied brain roller coaster situation. \n\nI recently just met someone and it looks like we have a really good connection and after the first couple of weeks of me being super relaxed and hoping that I can stay that way, I'm clearly entering the dopamine rollercoaster again. Obsessing over every little action or thing he says to me. Analyzing whether that's in line with how I think someone who's really interested in me \"should be\" behaving. Analyzing how I interact with him and whether I am doing everything I can to move the connection along. \n\nJust as an example, I just came back from an event we both attended (we met through our mutual hobby which is a type of Latin dancing) and we had some lovely interactions and a really nice dance there, and yet instead of being happy about that, I'm obsessing over the fact that he didn't offer me a ride home like he did when we had both attended that same event 2 weeks ago. I know it doesn't probably mean anything and yet my brain is obsessively coming up with thoughts like, maybe he's not quite as interested anymore etc.\n\nI could go on but I think you get the idea. Do you guys experience anything like this, and if so how do you deal with it?",
        "created_utc": 1678420869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rant/help/",
        "author": "Hypo_Flaneur",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndri9/ranthelp/",
        "text": "[removed]",
        "created_utc": 1678420063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I Be Better Suited To Adderall vs. Vyvanse?",
        "author": "theoknowsbest",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndrbm/can_i_be_better_suited_to_adderall_vs_vyvanse/",
        "text": "I started medication for the first time at 33 years old in December of last year. I started on 40mg of Vyvanse and the first week was an extreme honeymoon phase. I had read about it and prepared myself for it but it was so life changing that I still had high expectations for it after the honeymoon phase had worn off. \n\nI noticed the benefits to become less about a month later once my side effects started wearing off. I tried to rationalize it (my period was coming, I’m not supposed to feel amazing 24/7, etc.) but after 8 weeks and it dwindling down to only lasting about 3-4 hours, I spoke to my doctor. She agreed that I needed to up my dose to 50mg. She also prescribed 5mg Adderall ER for an afternoon booster because I was in between prescriptions and it would be 15 days before I could start the 50mg. She prescribed 5mg so that I could experiment with how much to take since I didn’t know how I would react to it. I only used it a few times.\n\nI have been on the 50mg for almost a month now and the first few days were great but it has again slowly stopped working and the effects are only lasting 4-5 hours. I have tried everything to make sure I am assisting the Vyvanse (eating protein in the morning, making sure I eat throughout the day, drinking more water, no Vitamin C, etc.) but nothing seems to help anymore. \n\nMy problem is that I started adding my Adderall booster in the afternoons and I started taking 10mg and I felt amazing again, not as high as my honeymoon phase, but I have all of the great benefits I had before (mental clarity, motivation, my emotional regulation was much better). I decided to experiment and I took 10mg in the morning without my Vyvanse and took another 10mg in the afternoon (around 3) and I had one of the most productive days I’ve had since I started medication 3 months ago!\n\nNow my question is this: is it possible that I am better suited to Adderall as opposed to Vyvanse? \n\nI’m so surprised because it’s such a low dose of Adderall compared to the Vyvanse that I’m taking, I have seen conversion calculators and 50mg of Vyvanse is compared to 30mg Adderall, how is it that 10mg (20mg all day) is so life changing? Could I need to take the Adderall everyday for a month and see a decline like I did with the Vyvanse? I am so hesitant to try the Adderall route because of the shortage (main reason why I went with Vyvanse from the beginning) as my doctor said that the shortage is horrible for some of her patients and very time consuming. I had no issue filling the Adderall but I wonder if that’s because it’s such a low dose and/or I just got lucky. Should I talk to my doctor about switching to Adderall or should I up my Vyvanse dose again?\n\nIf you’ve made it this far (I tried to not ramble but you know lol) thanks for reading! Any advice or anecdotes are very much appreciated!",
        "created_utc": 1678420049,
        "upvote_ratio": 1.0
    },
    {
        "title": "A psychologist described people with ADHD having a much larger spectrum of executive functioning than people without ADHD. Is there research to back this? Thoughts?",
        "author": "Key-Statement9638",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndq6h/a_psychologist_described_people_with_adhd_having/",
        "text": "A psychologist just described an interesting concept to me; that for people without ADHD/ mental health conditions the range or spectrum of executive functioning skills is quite small and thus, they are relatively consistent (within a range) regarding their executive functions across a number of domains/ activities, whereas people with ADHD will have a very very large range/ spectrum i.e. from abysmal - forgetting keys every day, complete lack of planning before an important event etc. to exceptional - planning an event in excellent detail, solving a challenging problem much more quickly than typical etc. \n\nI have always heard of executive functioning deficits and having poor executive functioning skills as a feature of ADHD, as opposed to it being referred to as a spectrum, and that the spectrum is much wider for people with ADHD, however I do relate very strongly to this concept. \n\nI’m wondering if other people relate, what you make of this, and I would especially love any research or articles around this concept. When I try and google, because of the word ‘spectrum’, I keep getting results around autism spectrum, or will exclusively get results about executive functioning deficits. \n\nTIA!",
        "created_utc": 1678419958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brand name Adderall vs generic?",
        "author": "Strict-Elderberry-20",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndovf/brand_name_adderall_vs_generic/",
        "text": "It was time to submit for my refill this month and I got a notification that they expected it to cost $40 for brand name Adderall vs the usual $10 for the generic. Has anybody ever noticed a difference? I don’t mind at all paying more this time but I’m just curious.\n\nIs there anyone out there that specially asks not to have the generic version? This just be something to do with the shortage and maybe more people request the generic than brand name?",
        "created_utc": 1678419859,
        "upvote_ratio": 1.0
    },
    {
        "title": "A psychologist described people with ADHD as having a much larger spectrum of executive functioning skills than neurotypical people. Is there research to back this?",
        "author": "Key-Statement9638",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndmqe/a_psychologist_described_people_with_adhd_as/",
        "text": "[removed]",
        "created_utc": 1678419686,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time getting Adderall vs Generic",
        "author": "Strict-Elderberry-20",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndmbo/first_time_getting_adderall_vs_generic/",
        "text": "[removed]",
        "created_utc": 1678419655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did nothing at my last job. Now I got a new one and don't know what to do.",
        "author": "UserName029",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndkx3/did_nothing_at_my_last_job_now_i_got_a_new_one/",
        "text": "Hi,\n\nI'm asking this here because I don't know what to do. \n\nI'm a 24-year-old guy who two years ago started at a job that paid really bad. When I started, I thought I knew nothing （I'm a software/data engineer） and was incredibly scared. Thankfully, thanks to the fear of being fired I managed to do the job, even though it costed me a severe burnout that I'm not sure if still lasts （I didn't have vacations yet）.\n\nDuring the last year at this job, I did basically nothing, I was completely unable to complete even the simplest tasks, and they most likely didn't fire me because, maybe, we were almost like friends in that team.\n\nI knew I wasn't growing, learning and I was doing very repetitive tasks that are not even involved to software engineering.\n\nNow, I quit my job because I found another one, but at a startup. A fast-paced environment but with a good salary. It took me a whole year to get a job. But my fear is to enter once again to this loop where I distract myself with everything and do literally nothing. \n\nThis time I'm sure they will not fear firing me, and I'm the only source of income from a family of 4. Losing my income will mean we will all be in a terrible condition.\n\nI have to say that I'm not officially ADHD, but I'm about to schedule an exam with a professional because in my experience, I have all the hints since I'm a child. And I think that, even if I'm not, this is a topic that someone here might know something that could help.\n\nThis kind of boredom and discouragement is nothing new, it used to be the same when I was at school. Things changed when I moved to another school.\n\nSummarized: I feel scared of not being able to complete a single task.",
        "created_utc": 1678419551,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you de with the constant yawning?",
        "author": "Ghotyel",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndjx7/how_do_you_de_with_the_constant_yawning/",
        "text": "I'm not sure if this is an ADHD thing and I haven't bothered to google it, but anyone else experience constant yawning if you're not doing something actively, I'll be fine when I'm playing a game or watching a show but if I'm just standing waiting for something I yawn like 5 times in 7 minutes, I have to make a conscious effort to not yawn. It could be my sleeping schedule so I won't write that off but it happens to me even on days that I slept well.\n\nTLDR; I yawn alot whenever I'm waiting for things, any tips?",
        "created_utc": 1678419474,
        "upvote_ratio": 1.0
    },
    {
        "title": "need advice from adhd-inattentive ppl out there!",
        "author": "Abject-Fee-4106",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndid9/need_advice_from_adhdinattentive_ppl_out_there/",
        "text": "[removed]",
        "created_utc": 1678419354,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish I had the subtitles",
        "author": "GroovyGracie02",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndfax/i_wish_i_had_the_subtitles/",
        "text": "I had this thought the other day and it feels like my catch phrase now &lt;3 \n\nIt sucks to not be able to hear people when I look directly at the sometimes, it's like I'm looking right at them but they're the only thing in the world that isn't making noise at that moment.\n\nOther times I'm looking at a coworker and I can hear them talking but the words just don't translate. They don't even sound like words anymore, it's all just sound. Making eye contact or reading their lips to see what they're saying isn't helping much anymore either.\n\nMaybe not related to needing subtitles but is have trouble talking sometimes part of ADHD? It might just be depression but I know part of the struggle is finishing a sentence, losing my train of thought, tripping over my words and combining words together on accident. The other part is being so exhausted that opening my mouth or thinking about making a sound feels like a mountain of a task. I've started to write things down at work instead of speaking, do a thumbs up or use some other type of body language. My boss told me that I need to communicate better at work but I'm already doing the best that I can.\n\nThese are the moment that I wonder if I'll ever be able to function well enough for any job. My ability to function fluctuates daily and I can't control it. I read that you can get disability for ADHD and it sounds like a really great idea right now but I also read that one of the qualifications for it is that you had bad grades in school? Not everyone that has ADHD has bad grades in school. I had good grades in school because I had nothing else to live for but my constant anxiety masked some of my ADHD and feeling smart made me feel less worthless.\n\nAny thoughts or helpful advice? This went on longer than it was supposed to &lt;3",
        "created_utc": 1678419122,
        "upvote_ratio": 1.0
    },
    {
        "title": "not sure if adhd or selective mutism/anxiety",
        "author": "DarthMaul627",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndf8e/not_sure_if_adhd_or_selective_mutismanxiety/",
        "text": "I have sm but I also have a lot of adhd symptoms when I'm calm. Like when I took a break from a game because I was hungry, then got distracted by my dogs and forgot I was hungry. And I've never been able to follow a schedule with chores or homework. I think maybe my sm was caused by adhd because I remember when I was young I could talk fine, but I was always a secondary friend. People only talked to me if they couldn't talk to their other friends. But sm and adhd have similar symptoms so I'm not sure if it's both or just sm. I have a doctor's appointment in a week so maybe I will ask about adhd.",
        "created_utc": 1678419117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vyvanse &amp; PPI",
        "author": "Christie358",
        "url": "https://www.reddit.com/r/ADHD/comments/11nddz5/vyvanse_ppi/",
        "text": "I took my vyvanse capsule over 17 hours ago and I still can’t sleep. I’m tired, but I can still feel the stimulant working. It’s really frustrating. I can’t recall my meds working THIS long previously. I’m only just starting to get my appetite back, but my mouth is still dry. I took prescription medication for my stomach acid yesterday approx 12 hours before my ADHD meds, and although the pharmacist said there are no interactions there clearly seems to be? Do any of you have similar experiences?",
        "created_utc": 1678419027,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"adderall\" shortage is finally hitting me",
        "author": "Frenchsilkbaby",
        "url": "https://www.reddit.com/r/ADHD/comments/11ndbqi/adderall_shortage_is_finally_hitting_me/",
        "text": "I was on 20mg adderall (not the name brand though) and I recently got my dose increased to 30mg. While on 20mg, I could get my prescriptions right away. I was not experiencing the adderall shortage at all. Well now I am. I got my 30mg dose prescription sent in a week ago and it's still out of stock. I thought 20mg was the most common dose so it would be out, but maybe 30mg is. I'd be nice if they could just pop some of those 20mg capsules open and mix em up into 30mgs for me. Is anyone on 20mg and unable to get it? Maybe it's the location that determines which dosages will be out of stock.",
        "created_utc": 1678418873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bipolar/Schizo Predisposition &amp; ADHD Medication",
        "author": "mystxvix",
        "url": "https://www.reddit.com/r/ADHD/comments/11nda74/bipolarschizo_predisposition_adhd_medication/",
        "text": "[removed]",
        "created_utc": 1678418755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a screen time app",
        "author": "Jezarr",
        "url": "https://www.reddit.com/r/ADHD/comments/11nd9tg/looking_for_a_screen_time_app/",
        "text": "Im honestly not even sure this exists but an app kind of like apples screen time but you cant disable it with a passcode. i have tried using screen time before but i always just end up putting in the passcode and justifying it by saying to myself \"only a couple more minutes\" and i don't want to have that option. it can be based on time of day or time spent on a certain app it doesn't really matter to me. i use an iPhone by the way. thanks in advance!",
        "created_utc": 1678418727,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just had a break down cause I didn't know what to eat for dinner",
        "author": "hotnotmental",
        "url": "https://www.reddit.com/r/ADHD/comments/11nd94t/i_just_had_a_break_down_cause_i_didnt_know_what/",
        "text": "I'm super hungry and all I wanted was to have a sit down dinner with my partner but it's late and everything closes at 10 pm here. So I spent 30 minutes crying cause I couldn't figure out how to tell him. We got in the car and he picked a place but they close at 930 and i had never eaten there before. So i was worried the food would be bad so it was all really stressing me out so I started crying and he kept asking what was wrong but I don't even know anymore. I feel stupid and I wish my brain didn't make things so difficult \n\nHe's inside ordering me soup and all I really wanted was to go to dinner and sit next to him cause today has been so stressful and busy. Why couldn't I just say that????",
        "created_utc": 1678418678,
        "upvote_ratio": 1.0
    },
    {
        "title": "my brain forces me to do things I don't want to do when I think about them",
        "author": "PretzilBoy",
        "url": "https://www.reddit.com/r/ADHD/comments/11nd88i/my_brain_forces_me_to_do_things_i_dont_want_to_do/",
        "text": "This takes some explaining, every once in awhile, I thought will come across my brain and I just 𝙝𝙖𝙫𝙚 to do it, even if it inconveniences me I just have to do it or it'll drive me mad, it's so incredibly frustrating, for example, I'll be watching a video on YouTube or something and there will be a thing that I need to back up to hear again, and I just keep backing up again and again even though I've already heard and understood the part that I backed up to, just again and again and I don't know why, there's just this little voice in my head that says do it again and I just have to. Another example is when I was at the zoo a little while ago I kept coming across animals that I really did not need to take pictures of but that little voice in my head kept telling me to go back and take pictures of them, one time there was this deer that I really had no care for but the little voice came in and I backtracked so far just to take a picture of the stupid deer and I hate myself for it, it's just such a pain in the butt having that little voice forcing me to do things. Does anyone know how I can cope with this, thank you",
        "created_utc": 1678418612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Program for ADHD/ASD Students Doesn't Understand Why Letting Parents Know Due Dates and Grades is Important",
        "author": "InspiredGargoyle",
        "url": "https://www.reddit.com/r/ADHD/comments/11nd372/program_for_adhdasd_students_doesnt_understand/",
        "text": "I (40f) have ADHD. My Son (14m) has ADHD/ASD. The ASD is more social, except expressing himself in writing, ADHD is definitely the big issue with education. He has been in a specialized program since seventh grade for students one or more grade levels below where they should be in two or more classes.\n\nSince the principal changed communication has gone to trash. There is an online app teachers could be using that would allow parents to see grades as entered, assignments, and test dates. Instead this is the s cond parent teacher meeting a week before report cards when multiple teachers didn't give grades or feedback to the teacher I spoke with. This is the second time I am hearing about issues in class just before report cards. I even emailed all of the teachers a week ago asking for grades, outstanding assignments, and any concerns!\n\nThe school, or new principal, doesn't seem to understand expecting students already struggling with organization, prioritizing, and remembering daily things to be the only way parents find out anything is ridiculous! \n\n-No my Son is unlikely to write in his agenda if it isn't checked daily OR teachers rarely have anything on the board for him to write. \n\n-His anxiety makes it unlikely he's going to tell me his grades often if he even remembers them.\n\n-He doesn't comprehend a unit quiz and a unit exam are different things that require different levels of preparation.\n\n-If he hands in an assignment, in his mind it's done. Giving it back to him saying you're giving him a chance to improve it doesn't compute.\n\nI emailed the principal once before. She didn't reply but instead had the science teacher call me and say he'd be sure to remind my Son when assignments were due (useless if it isn't in writing). I called her out on not replying to my email and asked her in person at another school event. She seemed determined to brush off my genuine question of HOW parents are supposed to support students if the don't know anything until it's too late?\n\nMy Son has the opportunity to continue the modified program in high school next year. I know he would drown in a mainstream program where grades, dates,and tests are available to parents. I am unsure how fretting he may be/probably is slowly submerging but not knowing for sure without being ON TOP of teachers daily is going to work out for another three to five years. I emailed the program coordinator for the high school we're considering and I hope to get a response that makes me more confident.",
        "created_utc": 1678418243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety About Class and Work",
        "author": "Aerda_",
        "url": "https://www.reddit.com/r/ADHD/comments/11nd0y0/anxiety_about_class_and_work/",
        "text": "In 2020 I really went through it, and dropped out of college. Recently I started going back to school.\n\nThis winter, I took two classes. A history class, and a PE class. I stopped going to the history class after a few weeks, and I dropped it. In the past month I stopped going to the PE class. Ive been hunting for a decent job for the past 3 months, and I havent had much luck. Whenever I get close, they end up hiring someone else instead. It's getting to the point where I cant rely on hand outs from family or the emergency fund at school, so Im taking whatever job I can get. I dont have the support network in this town that I need, and without that I dont feel like theres anything tangible keeping me motivated to stay the course. Dont think I'll be able to afford to live, and Im so tired of scrambling to find money every month. It makes me feel sick, having to rely so much on other people's money when I should be independent. When I was in college in 2019 I got really good grades, but Im not confident that I can pass a class anymore. Im not old enough to be eligible for fafsa loans that could cover my costs\n\nNeedless to say it's been really rough, I just want life to work out in a way where I can have friends again, have a decent job, and reliably go to school. For me, medication is a big part of making those things easier to get\n\nThe job Im starting next week is fairly inflexible. They will only allow you to work the full shift- so if I have class at 3:30, I cant leave an hour early, instead they just won't let me work that day at all. Which means once the new quarter starts, Ill only be able to work two shifts per week... Im hoping to get another job when that happens\n\nCan anyone give me some reassurance that things get easier? That I'll find a job, friends, and get my degree? Im worried I'll skip whole days of class so I can work. Im already doing that without work. Ive been pursuing a fuller, more legit ADHD diagnosis, but its been 4 sessions and my psych still hasn't prescribed medication. Im going to a doctor instead before classes start again. Its hard watching all this money get burned up, I feel like I should be able to just tough it out and get a good job, do well in school, but Im just constantly failing at everything. Its exhausting and I want to give up so I can stop disappointing myself and my family\n\nCan anyone give me some reassurance that things get easier? That Ill find a job, friends, and get my degree?\n\nTL;DR: Needing a kind word or two",
        "created_utc": 1678418077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally got an ADHD diagnosis. Angry with mom!",
        "author": "sherripepito75",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncvkj/finally_got_an_adhd_diagnosis_angry_with_mom/",
        "text": "I’m literally 38 years old and have been diagnosed with BPD, bipolar, PTSD and depression, etc. I knew none of those felt right nor did any of the meds they gave me - they never helped. I finally shelled out a ton of money and saw a very good therapist/psychiatrist and was finally diagnosed with ADHD. After doing all sorts of learning about ADHD, I’m confident this is the correct diagnosis. \n\nHere’s the thing - I called my mom to tell her and she said “I always suspected you had that as a kid” like WTF?! She’s never once mentioned that to me, ever. I asked her why she never had me evaluated, it could have changed the whole trajectory of my life. She called me dramatic and hung up on me. I feel so angry I could disown her 😡",
        "created_utc": 1678417674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medication question for long term users",
        "author": "aayceemi",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncvkk/medication_question_for_long_term_users/",
        "text": "Hey all,\n\nI’ve read some threads on here regarding efficacy of meds (both adderall and vyvanse) recently and how people don’t think they’re working as well as of late. I’ve noticed this myself the last four or five months but I can’t tell if it’s tolerance or a legitimate change in the medication (on top of always getting a different generic which doesn’t help). I’ve been on meds since 10/21. I guess my question is, for those that have taken the same medication and dose for many years, have you noticed a recent difference after years of consistency?\n\nThanks for any help or feedback :)",
        "created_utc": 1678417674,
        "upvote_ratio": 1.0
    },
    {
        "title": "did I do the right thing?",
        "author": "redditredddy",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncvjt/did_i_do_the_right_thing/",
        "text": "My doctor diagnosed me of severe adhd a couple years ago but I don't think she is right I'm prescribed adderall 30mg XR but I don't want to take it. It helps me too much. It seems unnatural. But I don't want to limit myself with my studying and learning. Can anyone help on my dilemma? When i take adhd everything feels normal but I feel like I am messing myself up because when I stopped completely today (bc I don't think adhd is real) I became extremely anxious and depressed alot my mind became scatterbrained and foggy and I just wanted to sleep all day. It was almost panic inducing. I told my doctor that I think adderall is for losers and she put me off it but now I face this dilemma. I don't want to hinder myself but at the same time I feel like I need it. What do I do? She told me I can set an appointment anything if I want to go back but I feel so ashamed and pathetic if I were to go back. My family said to me today and asked me if I am still taking the pills (I take 4 or 5 on top of adderall) so I just decided to stop everything and become natural. Was this a good choice? Will I regret it?",
        "created_utc": 1678417671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online material?",
        "author": "mephisto604",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncqi5/online_material/",
        "text": "[removed]",
        "created_utc": 1678417306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for tips for how to be less hard on myself",
        "author": "h0tBeef",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncpwg/looking_for_tips_for_how_to_be_less_hard_on_myself/",
        "text": "[removed]",
        "created_utc": 1678417269,
        "upvote_ratio": 1.0
    },
    {
        "title": "stomach ache while gaming?",
        "author": "flamingslender",
        "url": "https://www.reddit.com/r/ADHD/comments/11nckzw/stomach_ache_while_gaming/",
        "text": "i'm not sure if anyone has experienced this or if it's just me.. sometimes when i play certain games my stomach hurts ?. it's super weird. take terraria. i'll be completely fine playing terraria on pc but on mobile my stomach twists and turns. but i'm switch it's also fine?. even on 3d games the same thing happens i'm completely fine playing it for months or even years but then all of a sudden i feel like shit while playing. not sure if this is helpful or relevant but i have diagnosed adhd and add. can anyone help me? at least tell me someone has experienced this before.",
        "created_utc": 1678416925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a bit of advice please...",
        "author": "FlemFatale",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncgi2/need_a_bit_of_advice_please/",
        "text": "Okay, it's taken me a while to get the courage to post this tbh, so please hear me out.\n\nThe problem is that I say stupid shit without thinking about it and end up making myself look like an idiot as well as other stuff that I thought I had found ways to deal with but clearly haven't (timekeeping, having a tiny attention span, not being able to listen to stuff, constant fidgeting, racing thoughts etc. etc.).\nI did have an ADHD test back in 2007 and scored highly for ADD (so much so that my mum swears I have it [she's also a retired child psychologist]) but as I was an 18 year old girl back then with a lot of other shit going on (mainly due to gender dysphoria that I didn't know about), didn't get the diagnosis.  \nManaged to bumble my way through school somehow, went to uni, got a job, that whole stuff fine because there was structure.  \nNow I'm freelance and fucking love it, but I find it really hard to keep everything under control (unless its a longer job with more structure or if i have all the information before hand), also meeting new people is hard because until they get to know me, I look like a complete idiot saying stuff outloud to myself and all that kinda thing, so they think I am an idiot (I'm not).  \nI'm kind of thinking that maybe it's time to do something about it, because I just end up feeling like shit most of the time and I hate that. Most of my teens were spent severely depressed (well, dysphoric but before I worked that out) and absolutely hating myself, so I don't want to get back into that place.  \n  \nI'm in my 30s now and always thought getting diagnosed would not help me at all, but reading about how much it helps some people has changed my mind a bit, so does anyone have any advice?  \nI'm in the UK if it helps.  \n\nMentioned the trans thing because it's useful to know, but I also see that as something that happened in the past at this point (been fully transitioned for about 5 or 6 years now).\n  \n  \n  \nTLDR: Didn't get diagnosed at 18 in 2007, but I definitely have loads of ADHD traits, and it's starting to become a problem as an adult. I am looking for any advice people diagnosed later in life (30s) have and how it has helped them.",
        "created_utc": 1678416601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adhdoers materials",
        "author": "mephisto604",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncfls/adhdoers_materials/",
        "text": "[removed]",
        "created_utc": 1678416534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Antidepressant Copay Savings Card",
        "author": "Cubbby",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncdfu/antidepressant_copay_savings_card/",
        "text": "Hello all! Pharmacist here. Just wanted to provide everyone with something that may help you save a few dollars. If you're taking an antidepressant medications (as many of us with ADHD do), you may benefit from this copay card. It is from the manufacturer of Rexulti, but covers Rexulti **and** certain generic antidepressants with a maximum of $6000 per 12 months. The antidepressant must be first covered by insurance and sadly does not apply to cash patients. Antidepressants included in the program are:\n\n* Amitriptyline\n* Amoxapine\n* Bupropion (regular and XL)\n* Citalopram\n* Clomipramine\n* Desipramine\n* Desvenlafaxine (regular and ER)\n* Doxepin\n* Duloxetine\n* Escitalopram\n* Fluoxetine (regular and DR)\n* Fluvoxamine (regular and ER)\n* Imipramine\n* Maprotiline\n* Mirtazapine\n* Nefazodone\n* Nortriptyline\n* Paroxetine\n* Phenelzine\n* Protriptyline\n* Sertraline\n* Tranylcypromine\n* Trazodone\n* Trimipramine\n* Venlafaxine (regular and ER)\n\n&amp;nbsp;\n\nIf you take any of these and are paying a copay, download the coupon [here](https://www.rexulti.com/savings) and ask the pharmacy to run it in conjunction with insurance. Hope it helps :)",
        "created_utc": 1678416369,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD people doing a PhD, what was your experience? Did the PhD reveal your ADHD?",
        "author": "gendutus",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncbwm/adhd_people_doing_a_phd_what_was_your_experience/",
        "text": "I'm doing a PhD, and I have noticed that I often am very inattentive, particularly with grammar, sentence structure etc. My wife has also expressed frustration with elements of my behaviour that she says is very symptomatic of ADHD (she studied clinical psychologist).\n\nWhat was your experience? What symptoms did you have?",
        "created_utc": 1678416262,
        "upvote_ratio": 1.0
    },
    {
        "title": "need advice!",
        "author": "Abject-Fee-4106",
        "url": "https://www.reddit.com/r/ADHD/comments/11ncb7b/need_advice/",
        "text": "[removed]",
        "created_utc": 1678416208,
        "upvote_ratio": 1.0
    },
    {
        "title": "First day Not taking adderall in years",
        "author": "Bitter-History4729",
        "url": "https://www.reddit.com/r/ADHD/comments/11nc7lj/first_day_not_taking_adderall_in_years/",
        "text": "This is my first day without any due to the shortage. \n\nI’m done with it and trying to get it. Adderall was my “training wheels” and I’ve developed the skills so now it’s time to show what I can do without it. I was surprised that I can do basically everything but adderall gives me that extra push\n\nThis is coming from someone that has almost gone to jail because of my adhd\n\nThe more I focus on obtaining it, the more irritated I become. So if it’s available, great. If not, great! \n\nI’ve dealt with calling a bunch of pharmacies, techs lying to me and saying my prescription is ready then going to the pharmacy and them saying nope we don’t have any! Like dude, another god damn pharmacy tech just told me it would be ready. \n\nCalling my doctor and then he submits my prescription too late so they gave it to someone else. This is fuckin madness. I swear it seems like a comedy show to make unmedicicated adhd people deal with this \n\nMy doctor put me on vyvanse but who knows when that could be. For now, I am walking, exercising, taking ginseng &amp; Yerba mate, and sticking to my routines as best I can.",
        "created_utc": 1678415952,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is all making sense now",
        "author": "auntpama",
        "url": "https://www.reddit.com/r/ADHD/comments/11nc6d5/it_is_all_making_sense_now/",
        "text": "[removed]",
        "created_utc": 1678415859,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s my turn.",
        "author": "Ok_Ad_5658",
        "url": "https://www.reddit.com/r/ADHD/comments/11nc36l/its_my_turn/",
        "text": "[removed]",
        "created_utc": 1678415628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meds only work when awake",
        "author": "allyoopa10",
        "url": "https://www.reddit.com/r/ADHD/comments/11nc1j9/meds_only_work_when_awake/",
        "text": "I’ve seen a bunch of posts about how setting an alarm an hour before you have to get up and taking your meds then makes it easier to get up in the morning. I’ve tried that, but I still will literally sleep the whole morning! \n\nI find that I can’t take my meds until I’ve been awake for 1-2 hours. If I feel tired at all when I take them, they just don’t seem to work. It doesn’t seem to be tied to the amount of sleep I got that night, if I’m feeling tired my meds are less effective. \n\nHowever, this creates a problem, as you can imagine. Trying to wake up and get my day started without my meds is very difficult. Do you think this is a dosage problem? Something else I’m not factoring in? I take 20mg XR adderall in the morning and have a 20mg IR booster in the afternoon if needed.",
        "created_utc": 1678415509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is having strong desires then overthinking, losing interest or talking yourself out of it associated with adhd",
        "author": "wadiostar",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbxue/is_having_strong_desires_then_overthinking_losing/",
        "text": "I will have these ideas/desires that pop up in my head. Some are long term ones that I still haven’t done. Some are ones that I’ve thought about a long time and make sense to the point it would be stupid not to. Some are quick come and goes.\n\nI have a few desires/goals that I’ve wanted to do for ages but just as I build up enough courage to do them I generally talk myself out of it or I get distracted, lose interest and forget about it. I don’t know if this is trauma as some of these goals I’ve been discouraged a lot by family. Or if it’s adhd or maybe both. \n\nSometimes if an idea comes up in my head I just do it straight away without thinking because I know if I start thinking about it I probably won’t do it. It’s probably not the most wisest of strategies lol. Other times I talk myself out of it because of past failures and disappointment. My last psychologist said I had a lot of false beliefs that were holding me back. But a lot of my family think I’m delusional. So I’m not sure what to believe.",
        "created_utc": 1678415246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for suggestions/what to bring up to GP etc for meds (already been diagnosed)",
        "author": "seobyonce",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbu3d/looking_for_suggestionswhat_to_bring_up_to_gp_etc/",
        "text": "Hi all!\n\nThis is my first time posting here after lurking on the thread for quite some time (you've all been so helpful) and I'm basically at my wit's end.\n\nBackground info: 27F, I was diagnosed with ADHD in summer 2020. Previously I was diagnosed with Bipolar I (it was originally II but a psychiatrist in 2018 reassessed me) with psychosis, Borderline Personality Disorder (BPD), Generalized Anxiety Disorder (GAD), Social Anxiety Disorder and Obsessive Compulsive Disorder (OCD). I always felt like I had ADHD but every psychiatrist I've seen was hesitant to test me/give me meds for it because of my Bipolar Disorder background. My psychiatrist in 2020 only gave me the test because I told her my younger brother (25M) was diagnosed with it. I have a history of autism in my family (my cousin has high support autism), but no history of other mental health issues (that I know of). It is worth noting that I am Korean (I moved to Canada at a young age) so we don't really talk about mental health issues. I currently live in Vancouver, and I moved from Toronto in 2017. \n\nI've been in and out of the mental health care system since I was 18, since I was unable to access any psychiatric health resources while in high school due to stigma/not wanting to burden my parents. I've always had a psychiatrist (either affiliated with the university I'm attending or a community one). However, I recently finished my Bachelor's Degree (after 8 years of attending school on and off -- yay!) so I don't really have access to a psychiatrist anymore unless I go through my GP/Family Doctor. My most recent psychiatrist (affiliated with my university) has concluded that I do not have Bipolar Disorder, BPD or OCD -- but rather that all these psychiatric symptoms are a result of untreated ADHD. \n\nI've been on so many different types of medication for both ADHD and Bipolar Disorder in the last few years. But for timing's sake, I will only list all the ADHD meds I have been on.\n\nJune 2020: I was prescribed Ritalin/Apo-Methylphenidate (generic) (25mg) twice a day with Abilify (15mg) (once a day). This increased to 30mg twice a day in August.\n\nDecember 2020: I didn't like that I had to retake the medication during the day (I was going to school and working a part-time job) so my doctor switched me to an extended-release drug. I switched to Concerta/Apo-Methylphenidate ER (generic) (36mg) once a day, along with 15mg of Abilify\n\nFebruary 2021: The Concerta wasn't going all day so my doctor added a booster of Ritalin for the evening (30mg) along with 15mg of Abilify.\n\nOkay I was going through my medication records and I realized that giving you my entire medication history was going to be a LOT so I'll just break it down lol.\n\nI was on Vyvanse (up to 60mg with 20mg of Abilify), Concerta (up to 56mg with 20mg of Abilify,), Adderall XR (40mg), and Strattera (18mg with the Adderall). My most recent psychiatrist (yes, the one that denounced the Bipolar Disorder) took me off all my antipsychotics and put me strictly on ADHD medication -- I was on Adderall 40mg with the Strattera but the side effects were so bad he switched me back to Vyvanse (40mg). The 40mg was too much so my GP (after convincing him with the paperwork, calling the pharmacy, etc) decreased the dose to 20mg. \n\nMy main problem with my meds is that I metabolized them too fast (at least when I was on the Abilify). I would \"run out\" of energy and become sluggish around 2/3pm. That's why I switched my meds so many times the last few years. Now that I am on 20mg of Vyvanse (and just the Vyvanse) I feel nothing. I feel like a shell of a human being. I was doing so well for the last few years despite the \"crash\" I felt around 2/3pm. I even finished my degree with honours. But now, after graduating, since I don't really have a schedule/recovering from burnout I feel like a shell of a human with nothing to look forward to. Not having the right meds don't help. Also, I felt the WORST dry mouth after being taken off the Abilify. That's why I stopped taking the Adderall. I was going through like 4x32oz of water a day. And I have the WORST nausea. I'm always nauseous. But it's either I go through life being nauseous and somewhat functioning or not be nauseous and be a shell. \n\nIt's also worthy to mention that I have chronic insomnia (does anyone with ADHD not????) and mild sleep apnea. So I am ALWAYS tired, always sluggish. And the meds kind of helped, but now I am at a loss on what the right dosage for me is. \n\nMy GP set me up with a psychiatrist appointment to reassess that I don't have Bipolar Disorder (he wants to get a second opinion) before tweaking my ADHD meds. My psychiatrist appointment isn't until June. \n\nI am just so frustrated at myself and the shell of a human I've become. I know meds don't fix EVERYTHING but they sure helped when I was on the right one!!\n\nI have an appointment with my GP in two weeks and I need advice on what medication I should suggest to my GP for him to prescribe. I feel like if I have a stepping point then I will be able to advocate for myself better.\n\nAlso another thing to note is that because I don't have a schedule (job hunting right now, even that is difficult without proper meds) I wake up around 11am\\~1pm. This means that I can't really take my Vyvanse at that time without ruining my sleep. So I just go without it. I was thinking of getting IR meds for now but I honestly have no idea if going back to Ritalin is the right choice.\n\nI've been taking my meds on and off for like two weeks and I feel like I'm dying. I honestly feel like a shell of a person. \n\n&amp;#x200B;\n\nTDLR: What meds should I suggest for my GP to prescribe so I don't feel like a shell of a person??? I want to exist peacefully.",
        "created_utc": 1678414979,
        "upvote_ratio": 1.0
    },
    {
        "title": "NYT article on Adderall \"feeling different\" in recent months",
        "author": "kenvela",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbq4i/nyt_article_on_adderall_feeling_different_in/",
        "text": "[removed]",
        "created_utc": 1678414702,
        "upvote_ratio": 1.0
    },
    {
        "title": "New here. Looking for anyone who has been on medikinet.",
        "author": "RecordOk9421",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbpxm/new_here_looking_for_anyone_who_has_been_on/",
        "text": "Hey I just got diagnosed yesterday and it’s been very overwhelming and I’m not sure if it’s the right diagnosis but that’s a whole other thing. I’m actually writing in to ask if anyone else has been on medikinet Xr 20mg. I just took mine for the first time awhile ago and it’s made me feel strange. It gave me a really spaced out/ high feeling in my head and that faded into nausea which  read is normal. The head feeling was odd though and it kind of spread from my head to my body if that makes sense. I feel better now after having some water but still left with this weird feeling in my head and body. Kinda freaked out and overwhelmed just wanna know if anyone else has any similar experiences.",
        "created_utc": 1678414689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey did you know that there are more hair washing aids than just dry shampoo??",
        "author": "Booshes",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbpft/hey_did_you_know_that_there_are_more_hair_washing/",
        "text": "[removed]",
        "created_utc": 1678414654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between IR and XR doses",
        "author": "palmettofoxes",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbkdb/difference_between_ir_and_xr_doses/",
        "text": "[removed]",
        "created_utc": 1678414282,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like as I get older, it gets worse.",
        "author": "devilspeaksintongues",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbju7/i_feel_like_as_i_get_older_it_gets_worse/",
        "text": "[removed]",
        "created_utc": 1678414242,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADHD Tax hit hard today",
        "author": "Gotanypaint",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbim0/adhd_tax_hit_hard_today/",
        "text": "3 years ago I bought a truck off my grandfather that needed some brake work (the truck has rust...that will haunt me later), shortly after COVID hit and with my work schedule (and new found ADHD) I didn't work on it for over a year. Now mind you this is probably a 2 hour job but I still couldn't get myself to do it. Sometime last year I got the courage to work on it and got the line replaced.....woohoo!......except now a fuel line burst 🤦. Got fed up and let it sit again til this year where I used my newfound hyperfocus on my mustang to get the truck fixed and sold asap so I can use some of the money on the mustang. So for 2-3 weeks I've been diligently working on it (when I have time) BUT because its been sitting I now had a busted oil cooler line.......got that fixed and started bleeding the brakes today and ANOTHER brake line busted. If I had just done this when I bought it this wouldn't have happened but now I'm bringing it to a friend that has a shop so I don't have to deal with it anymore.\n\nMaybe I'll learn from this? 🤷\n\nTl;dr: Put off a quick job, ended up making it 5 times harder and several hundred dollars more expensive.",
        "created_utc": 1678414159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else have their perception of time kind of messed up?",
        "author": "micherudesu",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbczs/anyone_else_have_their_perception_of_time_kind_of/",
        "text": "[removed]",
        "created_utc": 1678413763,
        "upvote_ratio": 1.0
    },
    {
        "title": "5th grade teacher told class that ADHD is just hyper and meds are bad. She knows my son has ADHD and takes meds, and the class knows too (because of her). I emailed the principal today. Now what?",
        "author": "aprilmay3",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbcoj/5th_grade_teacher_told_class_that_adhd_is_just/",
        "text": "Help. ADHD mama here trying to advocate for my ADHD son, and I'm overwhelmed with so many emotions right now. He has a 504. He has had this teacher all year, and she seemed to get worse after our 504 meeting, but in a sneaky snarky way that I couldn't pin down clearly enough to report her for. Today, she crossed a line. \n\nThe redacted email I immediately sent to the principal and assistant principal/counselor is below. Maybe I should have waited, I don't know. But it's done. We are both processing. I'm keeping him home tomorrow. I don't know what to do next and I'm in way over my head. \n\nEmail summary: \n\nToday she told the class all about how ADHD didn’t exist when she was a kid. She said ADHD is just being hyper, and that she is hyper, everyone is hyper, medication isn’t necessary and that it’s bad for you, and that all that’s needed is to adjust your sleep schedule and use natural remedies like essential oils. It’s not the first time she has talked about these natural remedies and the essential oils she takes to fight things like cancer cells, but it’s the first time she has specifically said this about ADHD. That she is saying ADHD drugs aren’t necessary and are bad for you while they are also doing a anti drug program, and talking about drugs makes it all even worse because she made them sound like the same things. After all the attention called to him needing to drink water at the beginning of the year, the whole class knows he has ADHD and takes medication. Now he thinks everyone is going to see him as a drug addict.\n\nIt’s completely inappropriate for a teacher to be pushing opinions about medical conditions or medications to a class of 5th graders who don’t even have a say in their own medical treatment and telling children that medicine isn’t necessary and they only need natural remedies is irresponsible. There was nothing to be gained by her sharing her feelings about ADHD with the class; she knows it directly applies to him and would be hurtful. He is understandably upset. He is angry but also feels ashamed and like it’s his fault somehow. We were really trying to ride out the year without needing any intervention for these problems, but this is unacceptable. Any guidance would be appreciated.",
        "created_utc": 1678413740,
        "upvote_ratio": 1.0
    },
    {
        "title": "No hyperfixations like usual",
        "author": "Treadmillham",
        "url": "https://www.reddit.com/r/ADHD/comments/11nbcin/no_hyperfixations_like_usual/",
        "text": "[removed]",
        "created_utc": 1678413729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making Progress",
        "author": "Cynicalwall357",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb8bg/making_progress/",
        "text": "I am on month 2 of medication. Since then I have started IT certification, my sleep patterns are better, I have diligently learned to ease my mind, I have gainful employment that actually maximizes my abilities with adhd, and I have been able to hire a house cleaner. Tonight I am going home to a clean apartment. In the next few weeks I will have my bills in check and I will be able to start making a budget. This is the first time since my diagnosis and in my life where I feel like everything is coming together. But I haven't done it myself. The pain of this disability sometime feels endless, and mourning that is nessecary. But at some point, I had to realize that I needed to take steps to take care of myself and I had to stop trying to think and behave like everyone else and figure out what works for me and huge part of that was having the patients to stop and ask for help. I feel so full tonight.",
        "created_utc": 1678413454,
        "upvote_ratio": 1.0
    },
    {
        "title": "QUEST Study Seeking Participants",
        "author": "mapplab",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb85r/quest_study_seeking_participants/",
        "text": "[removed]",
        "created_utc": 1678413443,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Concerta failed to show up in my drug test TWICE??",
        "author": "ThrowRApossum",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb7m0/my_concerta_failed_to_show_up_in_my_drug_test/",
        "text": "I have been taking it, except on weekends I sometimes forget but week days I conform to my routine and always take it. Idk what's going on, but I failed twice and now he's taken my prescription away with no alternative. I don't know how it didn't show up or what I can do to fix it but I feel like I'm basically fucked when it comes to treating my ADHD now over something I don't really feel is my fault.\n\nHAS ANYONE ELSE EXPERIENCED THIS??",
        "created_utc": 1678413404,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m have trouble keeping friends and I think it’s bc of my adhd",
        "author": "Treadmillham",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb4yb/im_have_trouble_keeping_friends_and_i_think_its/",
        "text": "I am a good person (according to everyone I know) and am not bossy or selfish and I actually have the opposite problem lol so I know it’s not that. I am able to make a good first impression but after time I can’t put on a face and I talk a lot and people find me annoying so I will talk less but eventually everyone I know gets super distant or just stops talking to me I’m a couple months. And I need advice and am curious to know if it’s me or if anyone else with adhd experiences this bc I have heard like 2 others with adhd have this problem. If you made it this far thanks for reading",
        "created_utc": 1678413215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Task paralysis for hours",
        "author": "Late_You_9558",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb3s5/task_paralysis_for_hours/",
        "text": "Hey ya’ll,\n\nRecently I’ve finally gone to therapy and I’m going to see a psychiatrist for adhd soon. At my university, we are in “deadweek” before final exams start and I’m doing abysmal. I’ve been in the library for 12 hours (I also work here, I was on shift for 6 hours) and I’ve gotten nothing done. All I feel is a low level anxiety and negative voice, and all I can do is to keep soothing myself to hold it together.\n\nI’ve had this experience so many times before and I look forward to finally trying things to fix it. Until then, I’m gonna worry about my homework due at midnight that I haven’t started, my final exams I’ve done 0 studying for, and the unfinished lab work that is due soon as well. Hopefully I start soon…",
        "created_utc": 1678413127,
        "upvote_ratio": 1.0
    },
    {
        "title": "I failed my urine Test TWICE for Concerta?!",
        "author": "ThrowRApossum",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb2tl/i_failed_my_urine_test_twice_for_concerta/",
        "text": "[removed]",
        "created_utc": 1678413056,
        "upvote_ratio": 1.0
    },
    {
        "title": "the mental fatigue / executive dysfunction won’t go away",
        "author": "Agreeable-Dog-1131",
        "url": "https://www.reddit.com/r/ADHD/comments/11nb2bl/the_mental_fatigue_executive_dysfunction_wont_go/",
        "text": "it’s a struggle to do anything but work and lie in bed. i’ve been back on my antidepressant for 3+ weeks now and it’s not getting much better. i want to *want* to do the things i enjoy but i’m just so fucking exhausted. there are so many things i “love” to do and create but i don’t feel any motivation at all to do any of them. i have an appointment with my psychiatrist soon and i’m going to ask about adding Strattera along with my Adderall, but i’m scared it won’t help. i don’t have any other ideas and i’m tired of wasting my life away. i really don’t want to live like this anymore. suggestions or advice very much welcome.",
        "created_utc": 1678413019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stimulants suggestion due to Adderall shortage",
        "author": "Minespidurr",
        "url": "https://www.reddit.com/r/ADHD/comments/11nay9z/stimulants_suggestion_due_to_adderall_shortage/",
        "text": "I’ve been diagnosed with ADHD and on stimulants for almost 8 years now, and the recent shortages have hit me hard. I started on Adderall, then switched to Vyvanse for a few years, and then switched back because Vyvanse either increased too much in price, or my insurance simply stopped covering it (I can’t remember). \n\nNow since I can’t get my typical Adderall prescription, I’m likely going to have to switch back to Vyvanse or some other medication. The only thing is that my mother recently quit her job, and so now we’re only covered through Medicaid. I’m worried I’m gonna have to pay 300$ out of pocket for Vyvanse or something outrageous like that. I’ve heard there’s coupons but I’m just curious, are they that big of a discount? What all is available as far as coupons go? Where can I find them?\n\nAre there any stimulants other than those two that are effective? Would like to hear from anyone else who’s in a similar situation.",
        "created_utc": 1678412731,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not immediately nitpick my partner?",
        "author": "nintendo_d_s",
        "url": "https://www.reddit.com/r/ADHD/comments/11nakbd/how_to_not_immediately_nitpick_my_partner/",
        "text": "I don't know if it's an ADHD thing, a perfectionism thing, or both. But as soon as I get home from work, the first thing I do after saying hi is go straight into nitpicking what he is doing. \n\nToday he was washing the dishes when I got home. He doesn't rinse the soap off the clean dishes, and just puts them in the rack to dry. I started telling him why he should rinse them and asking him to please do that. I then noticed he hadn't taken the chicken out of the freezer yet, and I took it out myself and showed it to him. \n\nWe both suspect that he also has ADHD. So I jokingly said \"you have ADHD babe\" and he asks me why I'm grilling him about things so soon after getting home. \n\nI feel really bad about this and it's certainly not the first time I've done this. But it's just so hard not to point out things like this, in hopes that he will do better with them. \nIt's the same thing with me reminding him to do things for us during business hours (like call the bank, mechanic, etc) and then voicing my frustration when he doesn't do it. \n\nHow can I tell myself to just leave him alone about it?",
        "created_utc": 1678411758,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if I was diagnosed with ADHD as a child? Parents won't help",
        "author": "Traven-Whitburn",
        "url": "https://www.reddit.com/r/ADHD/comments/11nak0r/how_do_i_know_if_i_was_diagnosed_with_adhd_as_a/",
        "text": "As the title indicates I'm trying to find out if I was diagnosed as a kid because comparing myself to those I know with ADHD and looking at the ADHD awareness stuff I've seen I check a lot of the boxes.\n\nI remember being tested for it back in 5th grade, like 18 years ago, and taking one dose of medication that made me generally angry so I was taken off of it by my mom and that's the last that was ever said of it. Normally one would go ask mom but she doesn't believe in mental health disorders like ADHD or my sisters Aspergers so thats a dead end. I would go talk to my GP but due to insurance stuff I don't have access to one right now and most of my Google searches take me to articles talking about diagnosing it not looking up and old diagnosis.",
        "created_utc": 1678411734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall raising blood pressure?",
        "author": "Highest-Adjudicator",
        "url": "https://www.reddit.com/r/ADHD/comments/11naiga/adderall_raising_blood_pressure/",
        "text": "I have been on 10mg adderall xr for several months now, but today my doctor told me my blood pressure was too high and they are considering stopping my prescription and having me see a psychiatrist to find an alternative. I have noticed some side effects with the medication of course, but it has really helped my symptoms and has been extremely beneficial, so I am worried about what will happen if I have to stop taking medication. Has anyone else dealt with an issue like this and if so, what advice would you have?",
        "created_utc": 1678411611,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve never come across anyone with the same nail pulling impulses that I have",
        "author": "cranberry_sugar",
        "url": "https://www.reddit.com/r/ADHD/comments/11nafjb/ive_never_come_across_anyone_with_the_same_nail/",
        "text": "I have a really strange compulsion - I pick and pull off my entire big toenails, to the point where after finally seeing a podiatrist this week, I’ve been told I’ve permanently damaged the nails and I’ll never have normal nails on my big toes again. He also told me I’ve done a better job of removing my own toenail than most podiatrists would - there’s almost no nail left at all. I literally pick off and pull at my nails until they bleed, I use tweezers and dig down the sides of my nails into my toes to the point where they swell and I’m in agony, but I can’t stop. Has anyone else ever done this?",
        "created_utc": 1678411399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opening ER capsules of Dextroamphetamine",
        "author": "Less-Community5912",
        "url": "https://www.reddit.com/r/ADHD/comments/11naded/opening_er_capsules_of_dextroamphetamine/",
        "text": "[removed]",
        "created_utc": 1678411246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay is this an insane idea? I feel like this would be useful..",
        "author": "AquaDime",
        "url": "https://www.reddit.com/r/ADHD/comments/11nadat/okay_is_this_an_insane_idea_i_feel_like_this/",
        "text": "[removed]",
        "created_utc": 1678411239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I insane for thinking this could/should exist????",
        "author": "AquaDime",
        "url": "https://www.reddit.com/r/ADHD/comments/11nab74/am_i_insane_for_thinking_this_couldshould_exist/",
        "text": "[removed]",
        "created_utc": 1678411096,
        "upvote_ratio": 1.0
    },
    {
        "title": "BUSINESS PITCH: if this existed would you use it?",
        "author": "AquaDime",
        "url": "https://www.reddit.com/r/ADHD/comments/11na9bb/business_pitch_if_this_existed_would_you_use_it/",
        "text": "[removed]",
        "created_utc": 1678410961,
        "upvote_ratio": 1.0
    },
    {
        "title": "F@#$% insurance!",
        "author": "ShallotExtension8175",
        "url": "https://www.reddit.com/r/ADHD/comments/11na65p/f_insurance/",
        "text": "[removed]",
        "created_utc": 1678410739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every day is two days for me. How about you?",
        "author": "Sophie_Logic",
        "url": "https://www.reddit.com/r/ADHD/comments/11na1gd/every_day_is_two_days_for_me_how_about_you/",
        "text": "I found out quite recently that 2 weeks is a month real feel. So an average day is likely about 2.\nI had been putting savings into an account without a standing order to try and work on taking responsibility and to feel the dopamine when I did it.\nBut then I realised that for 3 months in a row, I had put savings in every 2 weeks, without even realising that a month hadn't yet passed.\nEach time was a panic, that I hadn't done it that month and based on all of the things that had happened in the time since my last deposit, how could it have not been a Month?\n\nSo my question is this:\nHas anyone experienced/do you experience this?\nWhat is your real-feel timescale?\nDoes it depend on your schedule/what you fixate on?\nDo you have times where the scale almost feels neurotypical?\n\nI haven't found a lot of information on this, beyond the basics, from looking into Time Blindness, so I really appreciate anyone for taking the time to help me navigate my ✨️chaos✨️",
        "created_utc": 1678410400,
        "upvote_ratio": 1.0
    }
]