[
    {
        "title": "Was there any justification of the treatment of the Aborigine people of Australia from anthropological fieldwork?",
        "author": "jaw10",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59pfxs/was_there_any_justification_of_the_treatment_of/",
        "text": "",
        "created_utc": 1477591085,
        "upvote_ratio": ""
    },
    {
        "title": "Child rearing practices in hunter gatherer or traditional small scale societies",
        "author": "Privatelyfe",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59o0hx/child_rearing_practices_in_hunter_gatherer_or/",
        "text": "Can anyone point me to some ethnographies or studies (preferably viewable without a paywall) or books focused on child rearing practices in hunter gatherer or small tribal societies?  I am already aware of and have read The Continuum Concept, but I have no idea if this is considered a valid account and I'd also like to see descriptions of other cultures.  It's something I'm interested in but a search of this sub didn't get me any relevant threads and by googling I'm mostly finding stuff that tries to apply it to modern parenting methods, which is not what I'm looking for.",
        "created_utc": 1477575655,
        "upvote_ratio": ""
    },
    {
        "title": "Is there research on humanities ability to pet animals and interspecies relationships",
        "author": "qx87",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59mh2h/is_there_research_on_humanities_ability_to_pet/",
        "text": "sry about the wonky wording, but the question is regularly on my mind when I see blissed animals after a thorough cuddling.",
        "created_utc": 1477547678,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any proof of Polynesians sailing to South America?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59lots/is_there_any_proof_of_polynesians_sailing_to/",
        "text": "[deleted]",
        "created_utc": 1477535706,
        "upvote_ratio": ""
    },
    {
        "title": "What are some examples of how indigenous societies handled menstruation?",
        "author": "guygizmo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59ix76/what_are_some_examples_of_how_indigenous/",
        "text": "I'm curious about the variety of practical methods indigenous societies used to handle menstruation, and any beliefs around it, spiritual or otherwise. Any good examples from a particular people?",
        "created_utc": 1477503758,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone familiar with the practice of Akheth?",
        "author": "benedictxxii",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59idno/is_anyone_familiar_with_the_practice_of_akheth/",
        "text": "I'm writing a paper and found an interesting reference to the practice of \"Akheth\" described as gifting young girls to local monarchy during camel festivals. i cannot seem to find any other reference to this practice other than the article which can be found [here](https://www.theguardian.com/commentisfree/2011/nov/08/saudi-arabia-child-brides-marriage)",
        "created_utc": 1477498209,
        "upvote_ratio": ""
    },
    {
        "title": "gender roles in native american society, source suggestions?",
        "author": "cyanoside",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59fjnr/gender_roles_in_native_american_society_source/",
        "text": "I am writing a paper about gender roles in naive american societies, especially pre-colonization. I would like to include some about how gender roles relate to spiritual life. Do you have any source suggestions for me? I would definitely appreciate reading some interesting papers!",
        "created_utc": 1477454079,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the region of the Caucasus Mountains seem to have so many different ethnic groups compared to the rest of Eurasia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59fe66/why_does_the_region_of_the_caucasus_mountains/",
        "text": "[deleted]",
        "created_utc": 1477451869,
        "upvote_ratio": ""
    },
    {
        "title": "Is there the possibility that people from remote areas are inbred?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59bspe/is_there_the_possibility_that_people_from_remote/",
        "text": "[deleted]",
        "created_utc": 1477411063,
        "upvote_ratio": ""
    },
    {
        "title": "Do cultures with fewer taboos surrounding sex have fewer instances of sexual violence?",
        "author": "Xoboo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59bl17/do_cultures_with_fewer_taboos_surrounding_sex/",
        "text": "Since sexual violence is usually less about actual sex and more about humiliation, degrading, etc, do cultures that have a less shameful view on sex have fewer cases of sexual violence?\n\nEDIT: what brought this to mind is that I remember in one of my first year anthro classes I recalled, though perhaps incorrectly, a professor said that a particular group hardly ever used rape as a method of war because they did not view sex outside of marriage or not being a virgin as shameful. Essentially what I remember her saying is that according to their norms rape would be similar to forcably shoving your finger into their mouth, painful, instrusive and unwanted but having little psychological effect. has anyone heard anything like this?",
        "created_utc": 1477408764,
        "upvote_ratio": ""
    },
    {
        "title": "Do cultures",
        "author": "Xoboo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/59bggv/do_cultures/",
        "text": "[removed]",
        "created_utc": 1477407376,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know how much importance to place on certain anthropological and archaeological finds?",
        "author": "tendorphin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/596w8j/how_do_we_know_how_much_importance_to_place_on/",
        "text": "[This was posted](https://www.reddit.com/r/ArtefactPorn/comments/596fdj/pagan_god_caught_in_river_by_fisherman_confirmed/) in /r/ArtefactPorn and I'm just wondering, how do they come to the conclusion of god or spirit, not just for this, but other figurines found. They say it being a god or spirit is based almost solely on the fact that it's got distinct features. This could just be a baby's rattle, or just someone messing around with sculpture, could it not? \n\nI'm not talking so much about those things found around shrines or altars, but if it's an isolated find like this one, what real evidence is there? Is it a bias of people expecting things that were created long ago to have some sacred quality otherwise people wouldn't have bothered? Is it a bias of media and perception? By that I mean things that get publicity will likely be important things like statues of gods or spirits, and I'll only read them, creating an illusion that most finds are of religious or spiritual nature. If this doesn't belong here, please let me know where to post it, but I thought anthropologists might have the best answer available. Thanks!",
        "created_utc": 1477341236,
        "upvote_ratio": ""
    },
    {
        "title": "Publishings on cannibalism amongst Neanderthals?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/591ftl/publishings_on_cannibalism_amongst_neanderthals/",
        "text": "[deleted]",
        "created_utc": 1477265202,
        "upvote_ratio": ""
    },
    {
        "title": "How did people in ancient times know that castrating someone would prevent them from going through puberty or exhibiting male physical qualities?",
        "author": "throwawayyourmonkeys",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58yr0h/how_did_people_in_ancient_times_know_that/",
        "text": "",
        "created_utc": 1477232567,
        "upvote_ratio": ""
    },
    {
        "title": "Why do Native Americans suddenly scream out of nowhere?",
        "author": "Glenssuos",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58y0rf/why_do_native_americans_suddenly_scream_out_of/",
        "text": "I'm sorry if this sounds a little stereotypical and maybe a little racist, but this is an honest question. In films, natives are often depicted as suddenly shouting high pitched screams whenever there's a celebration going on. Looking at various potlatches show that this is often the case, especially during celebratory songs and dances. \n\nIs this tradition Pre-Columbian? Or did it spread after the Europeans, much like the AIM song? Is it similar to the way young girls suddenly shout at the top of their lungs during concerts?",
        "created_utc": 1477218527,
        "upvote_ratio": ""
    },
    {
        "title": "Have canines affected human evolution like we affected theirs?",
        "author": "moralprolapse",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58x3zo/have_canines_affected_human_evolution_like_we/",
        "text": "",
        "created_utc": 1477198090,
        "upvote_ratio": ""
    },
    {
        "title": "\"Chapel\" as a placename.",
        "author": "brother_van",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58wnwi/chapel_as_a_placename/",
        "text": "\nIn the southeast United States I have noticed a lot of placenames with chapel in them. Examples would be, \"Jones Chapel\" \"Souls Chapel\", \"Greens Chapel Rd.\"\n\nI assume for the most part Chapel signified a church or religious meeting place. However, in the southeast finding a place of worship is very rare. I can't think of any examples off the top of my head with a place of worship named \"chapel\". It's usually always church, synagogue, or simple house of worship/praise.\"\n\nMy question is, does the chapel term hold some other significance other than a religious meaning? Also, is this naming pattern found country wide or is it limited to the southeast region of the United States?\n\nThanks.",
        "created_utc": 1477190727,
        "upvote_ratio": ""
    },
    {
        "title": "how many people lived at sites like kostenki menzin and dolni vestonice?",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58vtfu/how_many_people_lived_at_sites_like_kostenki/",
        "text": "",
        "created_utc": 1477178201,
        "upvote_ratio": ""
    },
    {
        "title": "When did the idea of \"the future\" develop?",
        "author": "Capelily",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58uc0p/when_did_the_idea_of_the_future_develop/",
        "text": "Is it an instinct or a concept, or both?",
        "created_utc": 1477159411,
        "upvote_ratio": ""
    },
    {
        "title": "Aren't the terms Old World and New World extremely ethnocentric?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58o4dv/arent_the_terms_old_world_and_new_world_extremely/",
        "text": "[deleted]",
        "created_utc": 1477067156,
        "upvote_ratio": ""
    },
    {
        "title": "I need to make some concepts become clear.",
        "author": "Thienohazard",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58mj2a/i_need_to_make_some_concepts_become_clear/",
        "text": "Hi r/AskAnthropology,  i have some questions.\n\nFirst : what are the differences between a society and a community ? \n\nSecond : How may I define culture ? I mean we all know what culture is, yet I can't define it clearly with my world.\n\nThird : what are relevance between a society and a culture ?  What aspect of a society effects a culture ?",
        "created_utc": 1477045907,
        "upvote_ratio": ""
    },
    {
        "title": "[X-post from r/AskHistorians] Is there evidence of nomadic groups interacting with sedentary groups in Neolithic Mesopotamia?",
        "author": "fendoria",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58en0c/xpost_from_raskhistorians_is_there_evidence_of/",
        "text": "I am most interested in Neolithic Mesopotamia, but answers based on other time periods or surrounding areas in Eurasia are welcome.",
        "created_utc": 1476932589,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any anthropological or sociological models for the development of religion within a culture/society/ethnic group?",
        "author": "BroBrahBreh",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58ef1h/are_there_any_anthropological_or_sociological/",
        "text": "I'm specifically curious if there are models that try to connect aspects or developments of religions to factors within cultures that practice them. For example, do we see that industrialization had a widespread and consistent effect on religions? Or do religions which emerged from similar climates have similar characteristics? ",
        "created_utc": 1476929992,
        "upvote_ratio": ""
    },
    {
        "title": "What is the higher classification of Asian languages?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58dmde/what_is_the_higher_classification_of_asian/",
        "text": "Example:\n\nSpanish, French, and Italian are examples of Latin languages\n\nGerman, Gaelic and Russian are the Germanic languages\n\nWhat are the Asian languages called?",
        "created_utc": 1476920470,
        "upvote_ratio": ""
    },
    {
        "title": "Why do different places have different languages?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58dh7a/why_do_different_places_have_different_languages/",
        "text": "If we all originated from Africa, wouldn't we have invented a universal language before everyone started spreading out? I know that some languages are very similar derivatives of other languages such as Latin and Spanish, but why did some languages end up so different from others? Such as Mandarin and Spanish. ",
        "created_utc": 1476918734,
        "upvote_ratio": ""
    },
    {
        "title": "When and what was the first vocal language ever invented?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58dgo1/when_and_what_was_the_first_vocal_language_ever/",
        "text": "Why did people stop speaking it?\n",
        "created_utc": 1476918551,
        "upvote_ratio": ""
    },
    {
        "title": "When did people in Europe start tattooing their bodies for aesthetic purposes rather than for identification?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58dgd8/when_did_people_in_europe_start_tattooing_their/",
        "text": "And what made them make the switch from tattooed identity into other forms of identity? For example, did the early humans have names for each other?",
        "created_utc": 1476918450,
        "upvote_ratio": ""
    },
    {
        "title": "How does race impact learning in school? (see body)",
        "author": "anthropo_seen",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/58cfo5/how_does_race_impact_learning_in_school_see_body/",
        "text": "I recently listened to episode 568 of This American Life, the one regarding how desegregated schools are better for children of color because it gives them the same access to resources as white students. I'm really interested in learning more about the impact of race in education from the standpoint of integration but, perhaps moreso, writings on pedagogy and how to include race as part of a teacher's praxis. Is the racial makeup of children and how they are (subconsciously) treated ignored by teachers? What are the effects of this? How have teachers attempted to incorporate a race conscious pedagogy into teaching and what have the repercussions been? \n\nThanks in advance for any material ",
        "created_utc": 1476907213,
        "upvote_ratio": ""
    },
    {
        "title": "How widely accepted is the notion that Çatalhöyük and other parts of Neolithic Anatolia existed as classless, non-patriarchal societies?",
        "author": "gshenck",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/588amp/how_widely_accepted_is_the_notion_that_çatalhöyük/",
        "text": "An article was posted in the comments on another sub claiming that Neolithic society in Mesopotemia in Çatalhöyük and elsewhere was essentially classless, cooperative, non-patriarchal, and based on solidarity and mutual aid. The site itself wasn't exactly the most scholarly source, though they were simply reposting the article. It seemed to jive somewhat with what I could cross-check from a cursory google search (albeit with less of the Marxist flair), but I wanted to see if any archeologists could weigh-in.\n\nThe article for reference: http://www.urkommunismus.de/catalhueyuek_en.html",
        "created_utc": 1476848378,
        "upvote_ratio": ""
    },
    {
        "title": "How widely accepted is the notion that Çatalhöyük and other parts of Neolithic Mesopotemia existed as classless, non-patriarchal societies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5887e5/how_widely_accepted_is_the_notion_that_çatalhöyük/",
        "text": "[deleted]",
        "created_utc": 1476847139,
        "upvote_ratio": ""
    },
    {
        "title": "What would the average population of a Hunter-gatherer tribe be at the time of the Neolithic Revolution?",
        "author": "LegateGraham",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/587eeb/what_would_the_average_population_of_a/",
        "text": "",
        "created_utc": 1476836653,
        "upvote_ratio": ""
    },
    {
        "title": "Questions on virtual ethnography and its related field",
        "author": "Ikhtilaf",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/585kt7/questions_on_virtual_ethnography_and_its_related/",
        "text": "So I was reading Pink and Postill's [\"Social Media Ethnography\"](http://blogs.bournemouth.ac.uk/research/files/2013/04/Postill-Pink-socialmedia-ethnography.pdf). It's in the syllabus for a class, but oddly enough no one in my department specialize in virtual ethnography (wut). My discussion with the profs and my classmates, with all respect, is... unsatisfying. I tried to Google the information by myself but I'm not sure if randomly reading academic articles is a decent solution for someone who's still learning.\n\nSo I hope I can ask for some help from anthropologists and fellow students here.\n\n* First of all, why are there so many terms on this field? I've encountered virtual ethnography, netnography, social media ethnography, digital ethnography, internet anthropology, cyborg anthropology, not to mention more general terms like internet studies. What are the differences from one to another? I've looked at the definitions at it seems to intersect with each other; e.g. Postill and Pink defines social media ethnography as something more concerned with internet-related (as in, the site doesn't have/cannot be solely in internet), but then you'll find similar definition from Kozinet's netnography, which is \"adaptable\" and studies \"technology-related communications and interactions\".\n* I'm still grasping with the concept of multi-sited ethnography itself, so this might stem from my lack of proper understanding of the concept, but can we say that virtual anthro is multi-sited? Since in virtual anthro we jump from site to site (at least as Pink and Postill defined it) and basically we're following the networks?\n* Pink and Postill argued that the notion of online community is not quite relevant in this age where one's experience online can hardly be separated from their experience offline (or something to that effect). But I would guess that really depends on the research question, does it not? They based their paper on Postill's experience with researching activists who are social media savvy. But, for example, what about studying a primarily online community such as Reddit?\n* How would one immerse in an anonymous site, like 4chan or maybe, even more so, the deep web? How would one conduct field work in a site where everything is unrecognizeable? You don't really know who is who there.\n\nThanks a lot!",
        "created_utc": 1476816728,
        "upvote_ratio": ""
    },
    {
        "title": "How do magicans invent new magic ?",
        "author": "Thienohazard",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/582tz4/how_do_magicans_invent_new_magic/",
        "text": " Hi r/AskAnthropology , i am conducting a research about magic and religious rituals.  I wonder how do magicans invent  new magics , for new purpose. \n\nWe already knew that magicans conduct magics for a specific purpose, but what happen when they approach something new  which the magics they learnt can not fit into the situation ? Do they invent new spells and rituals or not ? And if yes how does that process happen ? And in a general  situation, how did magic emerge  from situation ?\n\nI did tried to find this in some book about religious rituals and shamanism, but i can not find anything about magic invention.",
        "created_utc": 1476781619,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between a gypsy lifestyle and a bohemian lifestyle?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/582qfz/what_is_the_difference_between_a_gypsy_lifestyle/",
        "text": "",
        "created_utc": 1476779363,
        "upvote_ratio": ""
    },
    {
        "title": "When and why did Americans lose their British accent?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/582pj2/when_and_why_did_americans_lose_their_british/",
        "text": "",
        "created_utc": 1476778765,
        "upvote_ratio": ""
    },
    {
        "title": "What was the original purpose for body modification?",
        "author": "benevolentonion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/582ono/what_was_the_original_purpose_for_body/",
        "text": "Was it only for vanity or did it serve a religious purpose or something? How far back in history does it go?",
        "created_utc": 1476778166,
        "upvote_ratio": ""
    },
    {
        "title": "In polygamist societies in history, what has the correct term for the second or junior wife been?",
        "author": "politicalbitching",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/580qnv/in_polygamist_societies_in_history_what_has_the/",
        "text": "The kids cant figure out whether to call me mom 2 or Auntie and I really need a new name for this.",
        "created_utc": 1476748652,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have experience applying (Cultural) Anthropology to Marketing?",
        "author": "waves_of_vapor",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57y7qi/anyone_have_experience_applying_cultural/",
        "text": "Hey I am studying marketing at school but I also find anthropology incredibly interesting specifically cultural/ethnic research. Clearly the study of culture is an important aspect of both disciplines but I was wondering if anyone had any specific examples or experiences looking at marketing from an anthropological standpoint?\n\nAny theories, phenomena or areas of study from anthropology that stand out as especially applicable to marketing?",
        "created_utc": 1476721394,
        "upvote_ratio": ""
    },
    {
        "title": "What do native Americans think about Nativism as a political philosophy and those who espouse it like Donald Trump?",
        "author": "sumant28",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57wtoa/what_do_native_americans_think_about_nativism_as/",
        "text": "[removed]",
        "created_utc": 1476703704,
        "upvote_ratio": ""
    },
    {
        "title": "Paleolithic mammoth bone village population",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57seqb/paleolithic_mammoth_bone_village_population/",
        "text": "What were they I'm asking,  specifically gonsty and menzin",
        "created_utc": 1476637986,
        "upvote_ratio": ""
    },
    {
        "title": "Paleolithic mammoth bone village population",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57seqc/paleolithic_mammoth_bone_village_population/",
        "text": "What were they I'm asking,  specifically gonsty and menzin",
        "created_utc": 1476637986,
        "upvote_ratio": ""
    },
    {
        "title": "Some questions from a prospective anthropology student",
        "author": "AFewGazelle",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57qtz2/some_questions_from_a_prospective_anthropology/",
        "text": "Hello, I am currently a 6th former in the UK, very interested in going to study anthropology at university next year. I've spent some time looking into what the discipline(s) is all about  but I still have some questions.\n\n* The thing I would most like an answer to is what is the knowledge that anthropology actually produces and how is it unique from other disciplines and what makes it important? \n\n* In social anthropology, how can meaningful evidence about a society be taken from an ethnography? It seems to me that often ethnographies are too narrow for them to be used to make significant claims about a whole society, how does social anthropology overcome this?\n\n* I suspect the answers to my questions may be more about *how* rather than what it is anthropology studies (as this doesn't seem to be unique to it), am I right about this? Is it the way anthropology looks at its subject matter that distinguishes it rather than the subject matter itself? \n* Furthermore, how does this affect the development of the discipline?\n\nAny response would be greatly appreciated, thanks. ",
        "created_utc": 1476612646,
        "upvote_ratio": ""
    },
    {
        "title": "Why do very few places in the world managed to have traditional local clothes wear in everyday life?",
        "author": "Xamzarqan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57kv6s/why_do_very_few_places_in_the_world_managed_to/",
        "text": "Why do very few regions in the world managed to preserve their traditional attires and make them wear in everyday life?\n\nFor example, why does countries like Afghanistan, Pakistan, Yemen, Gulf countries and Bhutan and probably some places in Africa managed to preserve their traditional clothing and wear it as in daily life?\n\nIs the reason because of convenience in wearing traditional clothes than western modern day clothes? Like for example, in Pakistan, it is a lot more convenient to dress in shalwar kameez because of the weather and environment and other factors?\n\nI mean why do at least 95% of the world's everyday dress completely got replaced by western modern clothes? And that the traditional clothes value is immensely reduced to those of wearing for special occasions like for marriages or some holidays only? I think if there are no special holidays or occasions, all these traditional attire would completely perished for oblivion from the world history.\n",
        "created_utc": 1476511655,
        "upvote_ratio": ""
    },
    {
        "title": "Need help analyzing a bully act.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57j5ne/need_help_analyzing_a_bully_act/",
        "text": "[removed]",
        "created_utc": 1476484452,
        "upvote_ratio": ""
    },
    {
        "title": "Help with research. Articles needed",
        "author": "happybeard92",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57i4zu/help_with_research_articles_needed/",
        "text": "Hi, I'm an undergrad currently getting my Anthropology degree.  Last summer I did an Archaeology field school at Fort Fairhaven and I have been given the task of analyzing the course earthen ware ceramic/pottery found at the site.  The site dates to 1862, so I need to find literature and published articles that describe course earthen ware ceramics from the 19th and early 20th century.  My schools article data base search engine can't process that info.\n\n\ntl;dr Any articles pertaining to North American historical course earthen ware ceramics would be appreciated, Thanks!",
        "created_utc": 1476472371,
        "upvote_ratio": ""
    },
    {
        "title": "Books on Neanderthals and/or the Mousterian culture?",
        "author": "xrscx",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57h801/books_on_neanderthals_andor_the_mousterian_culture/",
        "text": "I am currently a bio anthro undergrad student, and I have a particular interest in Neanderthals and the Mousterian culture as a whole. I will also be spending a month at a Neanderthal site this coming summer. I'm looking for some good, casual reads on these subjects. I'm not looking for anything super technical, just something informative and fun to read while taking breaks from my studies. I'm just trying to build a solid background before I get into the super technical side of things. Any suggestions?",
        "created_utc": 1476462357,
        "upvote_ratio": ""
    },
    {
        "title": "(x-post from r/askhistorians) Paleoamerican migration",
        "author": "CaptainVonDanDan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57f619/xpost_from_raskhistorians_paleoamerican_migration/",
        "text": "My understanding is that the indigenous Americans migrated over the land bridge joining Asia and North America during the last glacial period. Weren't there ice sheets covering much of North America at the time? My questions are: how did they get to all the places they settled with giant glaciers in the way? Were they just hanging out in Beringia until the glaciers melted? If so, what was the timeframe for these migrations? How long did it take for paleoamericans to make it from what is now Alaska to all the places in the Americas they ended up settling? Also, weren't there later migrations occurring after sea levels had risen, such as the migration of the Inuits? How did they end up in the Americas? Did they go by boat? Thank you for any answers, this is a very interesting topic to me, and I would also appreciate any reading suggestions about the topic",
        "created_utc": 1476429061,
        "upvote_ratio": ""
    },
    {
        "title": "Sources for Responses to Cultural Change?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57dugp/sources_for_responses_to_cultural_change/",
        "text": "Anybody know any good ethnographies for people or groups experiencing drastic cultural or social change? ",
        "created_utc": 1476407430,
        "upvote_ratio": ""
    },
    {
        "title": "An AskReddit thread about the creepiest folklore creatures brought forward the possibility of mental illness/disorders personified in the form of these creatures. Are there more examples of it? Is this common?",
        "author": "Yelesa",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/57br2a/an_askreddit_thread_about_the_creepiest_folklore/",
        "text": "[This comment in particular](https://www.reddit.com/r/AskReddit/comments/574aw4/whats_the_creepiest_creature_from_your_countrys/d8ov6hp)\n\n&gt; We have a creature called a Kuri. It is known to wait near graves of people who have died on the moor. If you walk passed one of these graves, it will latch on to you.\n\n&gt; It slowly convinces you of its existence over the course of weeks, if not months. First you may hear a faint whisper in your ear. You may dream of it or feel a cool touch on the back of your neck. Over time its presence will start become more known. It will grab your leg in the night, start attacking you in your dreams, transpose its face onto your family members as you're talking to them.\n\n&gt; It will never make itself known to anyone else, making you question your own sanity. It will start talking to you, asking you to go back to the moorland, promising you your freedom back if you do. Eventually, once the mental torment gets too much, you give in and wonder back out to the moors. It will keep telling you you're almost there, allowing you to wonder aimlessly around. Eventually, exhaustion will strike you and you will be forced to watch your body succumb to the elements. As you lie there, unable to lift a finger, the Kuri tells you how much it will enjoy dragging your soul to hell. And like that, another grave is created.\n\nAs another comment pointed out, it looks like the description of schizophrenia. Maybe something else, I'm not a psychologists, but something that can happen to the human mind.",
        "created_utc": 1476382582,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hand-winning\" chivalric contests",
        "author": "deanarrowed",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/576tdf/handwinning_chivalric_contests/",
        "text": "In antiquity there seem to be lots of tropes and examples of \"winning her hand\" in some sort of game, contest, or rite of passage. For instance, Saul says that David cannot marry Michal unless he collects 100 Philistine foreskins on the battlefield. Penelope creates a contest for her suitors to win her hand.\n\nI realize that shows like *The Bachelorette* (and obviously, in reverse, *The Bachelor*) could be considered modern western examples, but they seem to draw viewership partly by how unconventional they are, whereas the ancient \"contest\" trope seems more widespread. But this could be a total misconception on my part.\n\nHas this phenomenon been widely studied? How widespread are such contests today in comparison to ancient times, and are there modern western analogues that I might not immediately recognize as being analogues?",
        "created_utc": 1476309753,
        "upvote_ratio": ""
    },
    {
        "title": "Careers with a Bachelor in Biological Anthropology?",
        "author": "Gypsy_S0UL",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/576t7c/careers_with_a_bachelor_in_biological_anthropology/",
        "text": "So I currently hold a degree in Bio Anthro. I have done research with primates in two countries (one, an independent study; the other as a research assistant). Now, I don't know where to go from here. Do I go back to school? What kind of careers are available to me with the experience and education I currently have? Any direction or resource suggestions are welcomed!",
        "created_utc": 1476309700,
        "upvote_ratio": ""
    },
    {
        "title": "How accepted is the account of hominid evolution in BBC's production \"The Incredible Human Journey\" presented by Alice Roberts?",
        "author": "Polgara19",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/575nr4/how_accepted_is_the_account_of_hominid_evolution/",
        "text": "",
        "created_utc": 1476296956,
        "upvote_ratio": ""
    },
    {
        "title": "Were the ancestors of humans really frugivores?",
        "author": "EDI-Thor",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/570uza/were_the_ancestors_of_humans_really_frugivores/",
        "text": "Hopefully this doesn't become too political. \n\nVegans often argue that our ancestors were frugivores. To what extent is this true? If this is the case, when did humans become omnivores?",
        "created_utc": 1476225512,
        "upvote_ratio": ""
    },
    {
        "title": "What would you say are the most important works on the anthropology of food?",
        "author": "liliannereid",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56z8zf/what_would_you_say_are_the_most_important_works/",
        "text": "Hi! I'm an undergraduate student writing my thesis in cultural anthropology and getting a little lost in looking for the right literature. I figured I'd try asking you guys, in case you had any opinions on it. \n\nMy main focus is on food in relation to identity, with an emphasis on the concepts of exclusion, inclusion and belonging.\n\nHave a great day.\n",
        "created_utc": 1476207378,
        "upvote_ratio": ""
    },
    {
        "title": "Thinking about submitting a paper for publication?",
        "author": "strawberryshortycake",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56ykth/thinking_about_submitting_a_paper_for_publication/",
        "text": "I only have a BA, but I wrote a paper that I am actually pretty proud of. I'm wanting to try to submit it to a journal for publication, but I'm not quite sure how to go about it or which journal to even submit it to. My topic was racism and xenophobia in the US.",
        "created_utc": 1476199944,
        "upvote_ratio": ""
    },
    {
        "title": "Can cultures really not be mapped? If so, is it not made possible because of recent development (related to migration and diaspora) or is culture never possible to be mapped to begin with?",
        "author": "Ikhtilaf",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56xymv/can_cultures_really_not_be_mapped_if_so_is_it_not/",
        "text": "I was reading Buzard's *On Ethnographic Authority* where he briefly mentioned the criticism on ethnographic maps; how difficult it would be to try to map cultures, because it cages culture with spatial location.\n\nBuzard's assertion might not be difficult to imagine if we see [19th century ethnographic maps](http://www.davidrumsey.com/rumsey/Size4/D5005/0370025.jpg) which ambitiously attempt to map the cultures around the whole world. Surely there is nothing fruitful in mapping Africa as having \"negro culture\".\n\nBut the practice of culture mapping still exists today, particularly in countries which government boast tourism as their economic driving force. Such as in Indonesia. If one visits Indonesia, it's not hard to find [map of cultures like this one](https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Indonesia_Ethnic_Groups_Map_English.svg/2000px-Indonesia_Ethnic_Groups_Map_English.svg.png) in travel agencies and government institutions promoting tourism.\n\nI've been reflecting on Buzard's assertion the improbability of mapping cultures. Taking the example from Indonesia, yeah, in reality the map doesn't tell anything; in an area labeled as having one culture (e.g. \"Betawi\" in the green area which is supposed to be DKI Jakarta), in real life life you'll find people from various cultures (Jawa, Sunda, Minang, etc).\n\nWhat has been puzzling me: is it because the flow of people in the past centuries that have made this impossible? Migration, diaspora, etc.\n\nOr the idea of mapping culture is never possible to begin with? That culture mapping is rooted in older anthropological tradition where culture is imagined as static, isolated in one place, to be visited by enthusiastic colonial tourists?",
        "created_utc": 1476192278,
        "upvote_ratio": ""
    },
    {
        "title": "Anthropological literature on airsoft, war \"(re)enactment\", group conflict, masculinity?",
        "author": "performer8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56qm1g/anthropological_literature_on_airsoft_war/",
        "text": "Hey everyone. I'm doing a research project for my university on the topic of airsoft and the (maybe) divisions within our country's airsoft community that is made up of two sub-groups speaking different languages. These are two ethnic groups who speak two quite different languages. There has been quite a bit of controversy lately regarding airsoft as a \"training ground\" for radicals on either side who might be preparing for armed conflict through airsoft military simulation scenarios/games.\n\nI think the moral panic is overblown, but there are undoubtedly divisions. I'm not sure if I'll be able to dig into the ethic/linguistic divisions aspect of this issue, since time is limited and the players I've spoken to are quite wary of people asking such questions due to previous bad press, so I was thinking of focusing also on masculinity and its expression in or through airsoft in my country (basically I live in a country in the post-Soviet space).\n\nAny advice or suggestions would be great. Thanks!",
        "created_utc": 1476079007,
        "upvote_ratio": ""
    },
    {
        "title": "Role of dogs amungst hunter gatherers",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56n4vj/role_of_dogs_amungst_hunter_gatherers/",
        "text": "In hunter gatherer socioties how do dogs fit within people's lives, it seems to me that they might have been seen more as animal members of sciotey, as independent as the humans and not so much seen as belonging to certain people or families, is this accurate? Also do all cultures give dogs names?",
        "created_utc": 1476033195,
        "upvote_ratio": ""
    },
    {
        "title": "Skin color differs due to your proximity to the equator?",
        "author": "tareqkatbi1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56n3hl/skin_color_differs_due_to_your_proximity_to_the/",
        "text": "I read something online a while ago saying that human skin complexion differs due to people's proximity to the equator. I'm from the Middle East and I'm usually a lighter complexion than most of my Arab friends and usually get mistaken for European around here. Also if proximity to the equator does choose your skin color, how are there peoples like Eskimos, Native Siberians, and Native Americans darker skinned than Europeans even though they live around the same distance from the equator?",
        "created_utc": 1476032710,
        "upvote_ratio": ""
    },
    {
        "title": "I want to start writing (publicly) about the different cultural aspects of countries (and the behavior of their people) that I visit and I don't want to screw it up - what book(s) on anthropology should I read?",
        "author": "GiveMeNotTheBoots",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/56eyv7/i_want_to_start_writing_publicly_about_the/",
        "text": "I'm starting a blog and probably, eventually, a youtube channel about the cultures I encounter in different countries I travel to and, when recounting what I see, I want to do it at least somewhat correctly.\n\nI'm basically asking for a recommendation for books on \"how to be an anthropologist\".  Not \"how to be hired as an anthropologist\", I'm not looking to be *considered* one as such, I'd just like to do this and do it right.  I'm going to be talking about people's behavior and culture, and I'd like to do as good a job of it as I can.\n\nWhat should I read?  Textbooks are fine, I'm willing to dig in and wade through some fairly dense material if I have to.",
        "created_utc": 1475892635,
        "upvote_ratio": ""
    },
    {
        "title": "What was the process of oral tradition being written down as societies became literate?",
        "author": "AbuWerda",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/563u6t/what_was_the_process_of_oral_tradition_being/",
        "text": "I am researching cultural memory and the durability of folklore in protohistory. How far back can we surmise the stories of early literate societies extend? Does anyone know of any formal studies on this topic?",
        "created_utc": 1475730027,
        "upvote_ratio": ""
    },
    {
        "title": "Self-realization, actualization, fulfillment - why these concepts are \"happens\" in our history? What is bio-socio-reasons behind them?",
        "author": "G-tiger",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/561jfd/selfrealization_actualization_fulfillment_why/",
        "text": "",
        "created_utc": 1475698414,
        "upvote_ratio": ""
    },
    {
        "title": "Don't upvote - Haviland textbook request",
        "author": "Tuts_holy_underwear",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55xusu/dont_upvote_haviland_textbook_request/",
        "text": "[removed]",
        "created_utc": 1475642397,
        "upvote_ratio": ""
    },
    {
        "title": "Question about the inscription and authenticity of this rock.",
        "author": "mr_han_solo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55vr37/question_about_the_inscription_and_authenticity/",
        "text": "The following rock was found in late-1995. It was found in Northeast Alabama, within a gorge. The gorge itself is made-up of sandstone. However, the rock is made of limestone, which can be found within several miles to the north and west of the area. \n\tThe inscription seems to be written in Cherokee Syllabary, which would date the inscription to a time period after 1820. This inscription itself has not been translated. \n\tWanted to post this here to get some feedback on the rock and its inscription. I have already drawn my own conclusions on the object, but I would like to see what others think about its authenticity, or can possibly translate the inscription. \n\tI understand that this may not be the best place for this to be posted, and I will gladly cross post or post this inquiry somewhere else upon suggestion.\n\nThanks. \n\n\nhttps://imgur.com/gallery/WUuyi",
        "created_utc": 1475614470,
        "upvote_ratio": ""
    },
    {
        "title": "[X-post from /r/AskHistorians] Are there any resources in English on Circassian (neo)paganism?",
        "author": "toot_toot_man",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55vmmk/xpost_from_raskhistorians_are_there_any_resources/",
        "text": "",
        "created_utc": 1475613031,
        "upvote_ratio": ""
    },
    {
        "title": "What was the point in having/storing milk before cheese was invented?",
        "author": "GreensburgZombie",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55ul1y/what_was_the_point_in_havingstoring_milk_before/",
        "text": "It's my understanding that lactose intolerance was the norm - and while cheese is much easier to digest, why would the ancients have milk laying around in the first place to discover the rennet/acid curdling process? It seems like a cart-before-the-horse scenario.",
        "created_utc": 1475601424,
        "upvote_ratio": ""
    },
    {
        "title": "I've been reading The Nacirema. It's fascinating that it was published in a credible academic journal. Can anthropologist actually publish such satire, or was it a publication of its time?",
        "author": "Ikhtilaf",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55u6wa/ive_been_reading_the_nacirema_its_fascinating/",
        "text": "The Nacirema is a parody of anthropology's (at its time) tendency to make other cultures as curious practices. [The interesting piece is available here](http://www.ohio.edu/people/thompsoc/Body.html). What I find fascinating, the article is actually published in an academic journal.\n\nIf I were an anthropologist, can I still write such parody article and publish it in a journal today? Maybe for different audience, or different subject (Nacixem perhaps). Or is The Nacirema a writing of its time?",
        "created_utc": 1475596846,
        "upvote_ratio": ""
    },
    {
        "title": "Which importance had insects in first humans diet?",
        "author": "cagapenas",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55u051/which_importance_had_insects_in_first_humans_diet/",
        "text": "I want to know to what extent insects were relevant in early humans (Sapiens) diet. We are used to this picture of ancient humans chasing mammoths and there is this \"paleolitic diet\" based on meat, but in all tv documentaries I've seen about gorillas and other big primates, I've noticed they eat a lot of ants and other insect stuff. Was it the same with our ancestors?",
        "created_utc": 1475594628,
        "upvote_ratio": ""
    },
    {
        "title": "Is the view that races have different intellectual capacities accepted in anthropology fields?",
        "author": "ValhalaMn",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55tzoq/is_the_view_that_races_have_different/",
        "text": "[removed]",
        "created_utc": 1475594461,
        "upvote_ratio": ""
    },
    {
        "title": "The last mammoth bone houses",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55qqo8/the_last_mammoth_bone_houses/",
        "text": "The cultures of ice age Eastern Europe who lived in a grassland environment with few trees made huts out mammoth bones, when did this end,  the latest mammoth bone huts I know of are from manzinin culture along the Don river, about 14,000 bce any evedence of them later than this?",
        "created_utc": 1475538886,
        "upvote_ratio": ""
    },
    {
        "title": "The last mammoth bone houses",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55qqoa/the_last_mammoth_bone_houses/",
        "text": "The cultures of ice age Eastern Europe who lived in a grassland environment with few trees made huts out mammoth bones, when did this end,  the latest mammoth bone huts I know of are from manzinin culture along the Don river, about 14,000 bce any evedence of them later than this?",
        "created_utc": 1475538886,
        "upvote_ratio": ""
    },
    {
        "title": "Dogs in primitive socioties",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55qotx/dogs_in_primitive_socioties/",
        "text": "Question: dingos are feral dogs so that indicates dogs existed amungst aboriginals, what where these dogs used for? I've heard they hunted with them if so how and what was typically hunted with them? Are these dogs distinct from dingos?                         Follow up question: how do dogs fit into primitive cultures in general? From what I have read it seems they just sort of lived with the tribe not so much as belonging to certain people but as animal members of socioty, is this accurate, do primitive people consider dogs as belonging to certain people or families? Do all socioties give dogs names?",
        "created_utc": 1475538151,
        "upvote_ratio": ""
    },
    {
        "title": "What is the relationship between Jeulmun, Mumun, Jomon, and Yayoi cultures?",
        "author": "i_reddit_too_mcuh",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55moav/what_is_the_relationship_between_jeulmun_mumun/",
        "text": "We know that the Yayoi probably came from southern Korean peninsula. Do we know which group? Is it a coincidence that Mumun ended in Korea in 300BC and Yayoi starts in Japan in 300BC?",
        "created_utc": 1475481482,
        "upvote_ratio": ""
    },
    {
        "title": "Did all homo sapiens once live in the same region?",
        "author": "prenis",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55kvxb/did_all_homo_sapiens_once_live_in_the_same_region/",
        "text": "One topic I find very interesting is the concept of a single human proto-language, and even a more encompassing proto-culture. Let me say that I know it is impossible to ever know for sure. I don't want to encourage wild speculation or pseudo-science, but I still find it very fun to think about. \n\nIt seems to me that in order for such a proto language to have existed, all humans (i'm not even sure whether I mean just homo sapiens or other homo species as well)  must have lived together in the same place at the same time. Whether or not such a language did exist, is it reasonable to think that all members of our species must have lived together at one time? Otherwise, wouldn't they have had to evolve independently of each other in different places? That seems impossible to me. \n\nI know there have been threads in the past regarding a proto-human language, which is why I tried to ask a more specific question regarding a single homeland for homo sapiens. \n\nIf anyone has any thoughts, please let me know. Or, alternatively, let me know if my thinking is just totally pseudo-scientific and problematic. \n\nThanks. ",
        "created_utc": 1475450781,
        "upvote_ratio": ""
    },
    {
        "title": "Do all human cultures hold that fact and opinion are different, discernible things?",
        "author": "Bteatesthighlander1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55k6u6/do_all_human_cultures_hold_that_fact_and_opinion/",
        "text": "So human languages always have words that signify something objective vs some matter of subjective opinion? ",
        "created_utc": 1475441453,
        "upvote_ratio": ""
    },
    {
        "title": "How does the English education curriculum still represent an industrial era curriculum and will it ever change?",
        "author": "lukeyy33",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55iy1u/how_does_the_english_education_curriculum_still/",
        "text": "I have recently took an interest in the history of the English education system and how it has come to be today. After researching I would like to learn about the impact on society it has had.\n\nCurrently, it can be thought of as two ideologies:  [current English curriculum](https://www.gov.uk/government/publications/national-curriculum-in-england-secondary-curriculum)\n\nLogic | Arts/Other\n---|---\nMaths | Music\nScience | Drama\nEnglish | Art &amp; Design\nDesign &amp; Technology | Religious Studies\nHistory | Physical Education\nGeography| Languages\nCitizenship |\n\n \nSo as you can see from the modules, there is more content for Logic. This is due to many factors, but mainly the Industrial Revolution. Where people were taught with the purposes of educating to the working standard, i.e in factories and manual labour.  \n&gt; 'Schools of industry' were set up to provide the poor with manual training and elementary instruction.\n     \n[Schools of industry](http://www.educationengland.org.uk/history/chapter02.html)\n\n\nThe curriculum that was sufficient for the industrial era was, and still is, composed of three core knowledge-bases:\n\n* **English**\n* **Maths**\n* **Science**\n\nA grade 'C' in each subject is considered mandatory to be able to work in the UK. This is only 3/10 subjects taught. \n      \n\nWe are constantly improving our intelligence as a people and will no doubt continue to do so, yet the same curriculum's (which were built specifically for poor, working-class citizens) are present in public schools. \nIt's proven that learning is more efficient and effective when made enjoyable. But the way a class is taught is essentially 'I am the teacher, you are the student.' (of course there are exceptions for every rule), if I analyse this relationship and break it down semantically I see it as: \n\n* Teacher &gt; Student\n* Superior &gt; Inferior\n* Elite &gt; Poor\n* Master &gt; Slave  \n\nThis begs the question, why are our government (the body in control of the education curriculum) addressing education in this manner?",
        "created_utc": 1475425810,
        "upvote_ratio": ""
    },
    {
        "title": "What are the reasons for the United Kingdom using the same 'Industrial era' teaching methods 200 years on?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55ivhs/what_are_the_reasons_for_the_united_kingdom_using/",
        "text": "[deleted]",
        "created_utc": 1475424859,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find a good list of tools and technologies available in the neolithic?",
        "author": "BastiatFan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55in2m/where_can_i_find_a_good_list_of_tools_and/",
        "text": "",
        "created_utc": 1475421662,
        "upvote_ratio": ""
    },
    {
        "title": "The parsimonious nature of recurring anthropomorphism?",
        "author": "CatsBarkLikeTrees",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55h5h6/the_parsimonious_nature_of_recurring/",
        "text": "Many years ago Kelly Dolan spoke of times where \"nature was drawn from the shadow of men, and men were drawn from the shadow of nature\", implying that the duality of the origin of men and animals shared a common ancestor. They are not mutually exclusive, and it is something that humanity has understood through eons. Recently, if we assume that recent is thousands of years ago, this undivided not mutually exclusive duality came to a halt when nature and men became separate entities. \n\nJohn Strauss wrote,\n\n&gt; By the time kings were the rulers of the Earth, nature had lost its place as the counterpart of humanity. It became a force to fight against, instead of a force to negotiate with.\n\nWhat actually led to these shifts in thought about mutual exclusivity and the abandonment of the recurring anthropomorphism that dominated human society for thousands of years?",
        "created_utc": 1475388826,
        "upvote_ratio": ""
    },
    {
        "title": "How well conected where upper paleolithic people?",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55fqqz/how_well_conected_where_upper_paleolithic_people/",
        "text": "To what extent did they trade (it might not have been trade per say but move material over long distences), and move information, for example how far inland would people have known about the ocean? Could people in say what is now Belgium have known about altamera in Spain (provided those who painted it made no secret of it) I know the Australian aboriginals had complex trade networks cris crossing the content, did inland aboriginals know about the ocean?",
        "created_utc": 1475363909,
        "upvote_ratio": ""
    },
    {
        "title": "Australoids and denosovins",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55foud/australoids_and_denosovins/",
        "text": "I'm confused about two things: where do people of the \"australoid race\" exist I know Australia, new gennia and melanesia, but I've also heard the philapenes, shri lanka, and andamese islands, some say just austrailia, so are these other Asian people's australoid or not, it gives me the impression that the australoids where \"the original Asians\" surviving in isolated places in south Asia, if so why do only Australians have denisoven DNA and not the Asian \"negritos\"",
        "created_utc": 1475363130,
        "upvote_ratio": ""
    },
    {
        "title": "Australoids and denosovins",
        "author": "prehistorian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55fouc/australoids_and_denosovins/",
        "text": "I'm confused about two things: where do people of the \"australoid race\" exist I know Australia, new gennia and melanesia, but I've also heard the philapenes, shri lanka, and andamese islands, some say just austrailia, so are these other Asian people's australoid or not, it gives me the impression that the australoids where \"the original Asians\" surviving in isolated places in south Asia, if so why do only Australians have denisoven DNA and not the Asian \"negritos\"",
        "created_utc": 1475363130,
        "upvote_ratio": ""
    },
    {
        "title": "What mental illnesses to have carried an evolutionary advantage? What is the evidence for these?",
        "author": "niado",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55dulz/what_mental_illnesses_to_have_carried_an/",
        "text": "I have read that (due to the significance of prevalence?) ADHD is likely to have been selected FOR at some point in human evolution. Can someone provide a detailed breakdown of the evidence for this? What other mental illnesses have evidence for positive selection and what is the relevant evidence? ",
        "created_utc": 1475338390,
        "upvote_ratio": ""
    },
    {
        "title": "Showers vs growers: climate?",
        "author": "1TrueScotsman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55c1p6/showers_vs_growers_climate/",
        "text": "I was wondering if there is any correlation between the percentage of a male population that are \"showers\" vs \"growers\" and the climate their ancestors evolved in.  In particular temperature.\n\nI'm going off the assumption that males would evolve to show their manhood off to impress females and intimidate rival males, but if the climate was such that there are harsh winters where frost bite was a serious risk they'd evolve to be growers as the trade off for showing is too steep.\n\nEDIT:I was hoping for some data rather than just counter arguments.  Any data to mine out there, regardless of my weak premise?",
        "created_utc": 1475301462,
        "upvote_ratio": ""
    },
    {
        "title": "Why do our instincts insist on violence?",
        "author": "Immortal_Scholar",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55b6od/why_do_our_instincts_insist_on_violence/",
        "text": "When we study the interactions between different species. The innate desire to survive seems to demand the death of the other. Why can they not stand hand in hand? It seem our instincts desire destruction and desperation from the start. Even when a group of people attempt to create a change, whether it be in society, politics, etc, then they usually revert to violence rather than knowledge or compassion. Why?\n",
        "created_utc": 1475285590,
        "upvote_ratio": ""
    },
    {
        "title": "Why must we fear what we don't understand?",
        "author": "Immortal_Scholar",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55b51w/why_must_we_fear_what_we_dont_understand/",
        "text": "",
        "created_utc": 1475284858,
        "upvote_ratio": ""
    },
    {
        "title": "One thing we continue to share with our ancestors is depicting animal heads on human bodies. I was wondering what are some of the earliest practices of this and what are the reasons behind it?",
        "author": "Sparky1397",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/559l8y/one_thing_we_continue_to_share_with_our_ancestors/",
        "text": "Modern Examples: \nBojack Horseman, Magical Mystery Tour The Beatles, The latex horsemasks\n\nHistoric Examples:\nNick Bottom Shakespeare, Egyptian/Hindu Gods, Journey to the West. ",
        "created_utc": 1475263446,
        "upvote_ratio": ""
    },
    {
        "title": "Are White American and Black American culture in the midst of diverging presently?",
        "author": "nicmos",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/559apv/are_white_american_and_black_american_culture_in/",
        "text": "Or have they always had a distinct separateness to them?  I admit I don't interact with African Americans as much as I would need to to have a better idea about this.  Maybe they appear to be diverging, but are actually converging?  I can't tell.",
        "created_utc": 1475259917,
        "upvote_ratio": ""
    },
    {
        "title": "Are concepts like Global Consciousness, concern for the Environment, etc. only post-modern inventions, or do indigenous populations have their correlate/equivalent?",
        "author": "obvom",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/55897r/are_concepts_like_global_consciousness_concern/",
        "text": "",
        "created_utc": 1475247073,
        "upvote_ratio": ""
    },
    {
        "title": "How widespread were flutes in the pre-contact/early post-contact Americas",
        "author": "akhotsharks454",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/555ofm/how_widespread_were_flutes_in_the_precontactearly/",
        "text": "I've been reading a bit more about pre-Columbian American music recently. I'm well-aware that wood flutes have been used in the Americas for millennia, but I can't tell how geographically widespread they were.\n\nDoes anyone have any knowledge or resources on this? \n\nI would also appreciate it if any NAs could specify whether wood flutes are part of their own tribe's/community's music heritage.",
        "created_utc": 1475199989,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any inconsistencies or mysteries with the evidence that informs our knowledge of ancient history? Do we have the full picture of the Upper Paleolithic to the end of the neolithic?",
        "author": "HumansAreWildAnimals",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5551dc/are_there_any_inconsistencies_or_mysteries_with/",
        "text": "",
        "created_utc": 1475190788,
        "upvote_ratio": ""
    },
    {
        "title": "Why did some groups remain nomadic/semi-nomadic if they have the capacity to settle?",
        "author": "kinkycosmonaut",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5544s9/why_did_some_groups_remain_nomadicseminomadic_if/",
        "text": "The chichimeca and mexica people, for example didn't settle until they reached the valley of Mexico, the hun tribes trabel to raid european settlements, why did they prefered to keep moving?",
        "created_utc": 1475179421,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evolutionary advantage to being drowsy?",
        "author": "MakerGrey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5543ho/is_there_any_evolutionary_advantage_to_being/",
        "text": "Or, why am I tired when I wake up and my dog isnt?\n\nPlease correct any false assumptions here, but I've been casually thinking about this since I got a dog. Every day when I wake up, even after getting plenty of sleep, I'm a little groggy or drowsy for some time, whether it's a few minutes or an hour. I'm going to guess I'm not alone in this.\n\nMy dog, two years old, active, and high energy, can pop up from a dead slumber, stretch, yawn, and immediately go bonkers (scientific term). I can see the advantage to that. Having a near zero transition period between sleep and full energy would let you avoid predators, or snatch prey that was close by.\n\nHow did humans develop this low-activity period? Is it social? Do we (western middle class humans) have such lives of luxury that we can afford to waste time brewing coffee and not wearing pants? Do other peoples in the world just suck it up and start sprinting at sunup?\n\nIf I'm asking the wrong question, I'd gladly accept any help or feedback forming a more appropriate question.\n\nThank you.",
        "created_utc": 1475178994,
        "upvote_ratio": ""
    },
    {
        "title": "Culture that eats in solitude",
        "author": "intrntdetective",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/54xlwn/culture_that_eats_in_solitude/",
        "text": "I remember hearing about an indigenous or native culture that traditionally eats in solitude because it is shameful (?) to eat in the presence of others. Anyone know the name of that group of people?",
        "created_utc": 1475084918,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a Mentor for my Masters in Anthropology?",
        "author": "dayglo_nirvana",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/54x3w5/looking_for_a_mentor_for_my_masters_in/",
        "text": "How do I go about this? My Forensics professor I focus on Textile Anthropology/Archaeology, but my searches for a professor turn up blank. Any suggestions? Thanks!",
        "created_utc": 1475079086,
        "upvote_ratio": ""
    },
    {
        "title": "Since when have human beings engaged in war?",
        "author": "heitapoistili14",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/54vggj/since_when_have_human_beings_engaged_in_war/",
        "text": "By war I mean something that's not covered by \"kin selection\", so brothers attacking some other group of humans doesn't count. I'm interested about the first case where unrelated humans have risked their lives in common aggression.",
        "created_utc": 1475053168,
        "upvote_ratio": ""
    },
    {
        "title": "Will polyamourous relationships very popular in the future and will they be able to shift monogamy absolutely?",
        "author": "G-tiger",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/54v4gz/will_polyamourous_relationships_very_popular_in/",
        "text": "",
        "created_utc": 1475045275,
        "upvote_ratio": ""
    },
    {
        "title": "How were cows and other animals originally domesticated?",
        "author": "BastiatFan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/54un4u/how_were_cows_and_other_animals_originally/",
        "text": "I mean, what was the actual process for keeping them separate from the wild herds? Were they leashed to tree or posts? Did the people build fences to contain them?\n",
        "created_utc": 1475035831,
        "upvote_ratio": ""
    }
]