[
    {
        "title": "When did states start pushing for the impossible task of impenetrable borders and is there any evidence for their rationale?",
        "author": "Domhnal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8sfm73/when_did_states_start_pushing_for_the_impossible/",
        "text": "It just seems crazy to me to think that any artificially demarcated line can or should be one hundred percent impenetrable.  I'm also dubious of this system that seems to restrict movement for the non-rich while the rich and their companies can pretty much ignore border lines altogether.\n\nIs this a control tactic?  Is this xenophobia on the part of leadership, or is it faked to garner support?  Is it genuine post-911 fear?  What's going on?  I just don't get why Americans are so whipped up in over a problem that has pretty much been well addressed, even too much so.  I can't make sense of what's going on in Texas right now.\n\n\n_____________________________________________________________________\nedit: \n\nI was encouraged to add this:\n\nI'm hoping for something along the lines of *Imagined Communities* (Benedict Anderson) meets *Flexible Citizenship* (Aihwa Ong) with a buildup towards what we're witnessing now.  And I'm not so interested in the state border as much as I am the representation of nation for citizens and how it is spacially reinforced by these borders.\n\nI kept it vague at first to see what would pop up, because in the past I've gone very specific and no one even voted.  Thanks for reading!",
        "created_utc": 1529470705,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have a favourite anthropologist? If so, who is it and why?",
        "author": "gibsanchez",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8scpo7/do_you_have_a_favourite_anthropologist_if_so_who/",
        "text": "Not necessarily in a competitive sense but someone who has had a big impact on you and the way you see humanity. Maybe the first one that comes to your head when you read this question.\n\nMine would be without a doubt Edwin Hutchins. For me he really blew life into the concept of Culture and put it, in a very concrete manner, not only in individual's heads but articulated very elegantly how it is something that is necessarily shared. Others had of course discussed this from Durkheim to Geertz, but no one, in my opinion, made it as solid as Hutchins. When I read Bloch's Anthropology and the Cognitive Challenge I could not think of anyone who was more succesful in linking culture and cognition in a way that makes both so susceptible to study through ethnography, by anyone.",
        "created_utc": 1529444113,
        "upvote_ratio": ""
    },
    {
        "title": "Are modern Armenians the most ancient people/ethnic group in today's Europe?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8scl1p/are_modern_armenians_the_most_ancient/",
        "text": "[deleted]",
        "created_utc": 1529443105,
        "upvote_ratio": ""
    },
    {
        "title": "Was the human population reduced to only 10,000 individuals around 70,000 years ago, or has this theory been debunked?",
        "author": "Real_Elon_Musk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8safpk/was_the_human_population_reduced_to_only_10000/",
        "text": "Many credible sources seem to be contradicting each other on that topic.",
        "created_utc": 1529427260,
        "upvote_ratio": ""
    },
    {
        "title": "Why do humans have hair that grows indefinitely? What are the evolutionary mechanisms that produced this phenomenon?",
        "author": "AbuWerda",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s6sgr/why_do_humans_have_hair_that_grows_indefinitely/",
        "text": "This seems to be a fairly rare occurrence in nature, and I'm just wondering why modern humans are the only primates who have hair on our heads that grows continuously. Is this the result of sexual selection, or has some genetic switch responsible for stopping hair growth mutated (something like the Lactase Persistence allele)? Did early hominins' abilities to produce increasingly complex cutting tools remove the selective pressure for short hair? Was long hair evolutionarily advantageous in colder environments? Thanks for any light you can shed on this question.\n\nEdit: After some hunting online, it looks like part of the answer is published in this 2010 [PLoS Genetics](http://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1000904) paper and summarized [here](https://www.sciencedaily.com/releases/2010/04/100415085317.htm). From the article:\n\n`Hair is important for temperature regulation, physical protection, sensory activity, seasonal camouflage, and social interactions. Hair is formed in hair follicles, which are complex mini-organs in the skin that are specialized for this purpose. All hair follicles are formed during fetal development, then new hair is generated in the hair follicle by continually undergoing phases of recession, rest, and growth throughout life. The length of the hair is determined by the duration of the growth phase; for example, the growth phase for scalp hair can proceed for a number of years, while the growth phase for eyebrows last a few months.`\n\n`In the present study Leif Carlsson's research team identifies the transcription factor Lhx2 as an important regulator of hair formation. The Lhx2 gene is active during the hair follicle's growth phase and is turned off during the resting period. The scientists have been able to show that Lhx2 is functionally involved in the formation of hair, as hair follicles in which Lhx2 has been inactivated cannot produce hair. Moreover, the activation of the Lhx2 gene in hair follicles has been shown to activate the growth phase and hence the formation of hair. Thus, Lhx2 is a gene that is important for the regulation of hair growth.`",
        "created_utc": 1529391207,
        "upvote_ratio": ""
    },
    {
        "title": "What are good books for a general intro to anth?",
        "author": "rachilles",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s5nxk/what_are_good_books_for_a_general_intro_to_anth/",
        "text": "Someone has asked me for a list of books that provides a good, general introduction to anthropology. Hopefully, books that can help someone understand anthropological thought and theory better.\nI’m not looking for intro-style textbooks, but rather non-fiction (or fiction, if you think it fits!), and books from authors like Jared Diamond, Leanne Hinton, Thomas King, and Cornelius Holtorf. Something that’s easy to read,  not *too* academic, but still accurate and informative. \nMy specialty is linguistics, so I have a pretty good list of fiction and non-fiction that I think highlight some key issues and thoughts in that field. But, I’d be open to hearing what other linganths suggest! Also looking for input from the many other fields of anth, of course! \n\nDo you have any books that really impacted your thinking or understanding? Any you’d instantly recommend? All input is helpful :) \n\nThanks fellow Anthros! \n\n",
        "created_utc": 1529378630,
        "upvote_ratio": ""
    },
    {
        "title": "In what ways were hunter-gatherers healthier than farmers?",
        "author": "Ask_Everything",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s5aop/in_what_ways_were_huntergatherers_healthier_than/",
        "text": "Ive always read that Neolithic farmers were less healthy than hunters. However hunters are less plan based food which is. Ad. Hunters also ate a lot of meat which also can’t be good. We are told that a plant based diet is good and red meat is horrible. So how were the hunter gatherers healthier than their Neolithic farming counterparts?",
        "created_utc": 1529375186,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many cultures dislike the education of women? (Or do they?)",
        "author": "XNoize",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s4ydo/why_do_so_many_cultures_dislike_the_education_of/",
        "text": "This topic has been bothering me of late. I honestly can't think of a good reason why a society would not educate women, or would consider that morally wrong or undesirable. Googling the issue has not been especially fruitful, although I have learned a bit about education in different cultures which is interesting. So I would greatly appreciate if anyone could further explain the issue and why it seems such a common trend.",
        "created_utc": 1529371980,
        "upvote_ratio": ""
    },
    {
        "title": "Roughly how many hours per week do Nomadic Pastoralists work, on average?",
        "author": "PerfectSociety",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s3zsk/roughly_how_many_hours_per_week_do_nomadic/",
        "text": "Marshall Sahlins called Immediate-Return, Nomadic Hunter-Gatherers the \"Original Affluent Society\" and emphasized their short work week of about 20ish hours per week. \n\nI'm curious if anyone here knows of a rough estimate for the average number of hours per week that nomadic pastoralists work. If it would be easier to provide multiple averages based on geography or cultural groups, I'd love to get an answer like that as well! I'm curious how a nomadic pastoralist work week would differ from that of an immediate-return, nomadic hunter-gatherer in terms of the number of hours. \n\nThanks!",
        "created_utc": 1529363328,
        "upvote_ratio": ""
    },
    {
        "title": "What are examples of Nomadic Pastoralist cultures in which there is equal power between the sexes?",
        "author": "PerfectSociety",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s3una/what_are_examples_of_nomadic_pastoralist_cultures/",
        "text": "",
        "created_utc": 1529362112,
        "upvote_ratio": ""
    },
    {
        "title": "Question about jobs",
        "author": "SolusCoalman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s2nb1/question_about_jobs/",
        "text": "Where do you find a job to research abroad in different countries? What countries/continents are the most common to get sent to?\n\nThanks if you reply!",
        "created_utc": 1529352813,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the Khas Arya people of Nepal? How are they differenr from the rest of the South Asians?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8s17t3/who_are_the_khas_arya_people_of_nepal_how_are/",
        "text": "[deleted]",
        "created_utc": 1529342004,
        "upvote_ratio": ""
    },
    {
        "title": "A thread in r/Europe is claiming a connection between the folk costumes of Albania and the French Arvan Valley, based on similarities and genetics. Does it make sense?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rzor1/a_thread_in_reurope_is_claiming_a_connection/",
        "text": "[deleted]",
        "created_utc": 1529330177,
        "upvote_ratio": ""
    },
    {
        "title": "Has genetic research led to any really shocking breakthroughs about recent human migration?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rwaye/has_genetic_research_led_to_any_really_shocking/",
        "text": "Through linguistics we've discovered potential historical affinities between between peoples as disparate as the Aztecs and the Shoshone. \n\nHave any other previously unknown population-historical linkages been discovered through genetics? I understand that genetic research seems to conform an Italian origin of Ashkenazi Jews and an ancient connection between Vietnam and Japan. What else do we now know through genetics?",
        "created_utc": 1529291285,
        "upvote_ratio": ""
    },
    {
        "title": "The same in every culture? Food anthropology question",
        "author": "GManDH",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rumag/the_same_in_every_culture_food_anthropology/",
        "text": "Is there a dish that is eaten in every culture/cuisine, ie soup, sandwich, or anything else? I assumed noodles but am finding out its not. Thank you",
        "created_utc": 1529274829,
        "upvote_ratio": ""
    },
    {
        "title": "Glass Bangles - Middle Eastern anthropology",
        "author": "Epiphany31415",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rnppd/glass_bangles_middle_eastern_anthropology/",
        "text": "My family lived in the Middle East - near Dhahran for about 35 years back in the 1950s. After any large sandstorm, they would go on these \"treasure hunting\" excursions lead by a local and find items in the desert, supposedly along old trade routes. \n\nI suspect that the stones with holes in them are weights for spinning thread? I don't know much about the glass pieces, other than that they might be bangles.\n\nHow old might these be? Are my guesses correct? Do you guys know anything else about these? I would love to learn more about them.\n\nhttps://i.imgur.com/Vtrclsc.jpg\n\nEdit: Or do you know any kind of anthropology / archaeology professor I could email who specializes in middle Eastern history? I found one guy in Austin, but here's retired and I am afraid that he wouldn't answer his .edu email anymore.\n\n",
        "created_utc": 1529197788,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any historical evidence that suggests that humanity has been near exctinction? Additionally, are there any periods of time when schoolers of an age believed that humanity was nesting extiction due to their society's status/environment/health?",
        "author": "bobo311",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rngf3/is_there_any_historical_evidence_that_suggests/",
        "text": "I posted a similar Post in the historian ask subreddit and thought it appropriate to also ask year. In the other subreddit I asked regarding specific documentation of Scholars or people who may have commented and believed in an Extinction event. Here I would like to ask less for specific documentation but rather if there is any cultural or societal evidence that's a group of people believe in extinction event was occurring or may occur and had some foundation in which to believe this. A foundation beyond their religious beliefs and superstition. Of course religious beliefs and Superstition may have been part of why they believe this but if there was also some more scientific evidence to suggest they had fears with weights behind them. My first thought is regarding periods and time like the Black Plague, where many died and many more were ill. I have no doubt that some form of religious beliefs played a factor in the management and cause of the plagues.\n\nThank you all for the time in reading and pondering my question and thank you for the information and knowledge this sub provides.",
        "created_utc": 1529194980,
        "upvote_ratio": ""
    },
    {
        "title": "How did the people who came to be known as Native Americans spread down through what is now Alaska, Canada, and the U.S.A?",
        "author": "bellumaster",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rlxpi/how_did_the_people_who_came_to_be_known_as_native/",
        "text": "I would like to be made aware of how North America was populated. The theory of the land bridge or any other theories, following prey,  etc- how did so many people end up forming the different tribes if they just came from a single group? Was there a particular path taken? Are there any decent books or writeups on the topic? \n\n\nI am developing a story about this 'arrival of man' and would like to know more about the climate,  flora and fauna of the setting.  Thank you for your time. ",
        "created_utc": 1529179962,
        "upvote_ratio": ""
    },
    {
        "title": "Does the period of oral cultures overlap hunting and gathering and agriculture?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rjd6u/does_the_period_of_oral_cultures_overlap_hunting/",
        "text": "There seems to be a widespread if not universal phase of societal/cultural development prior to the existence of writing, when tribal history and other important information is encoded in long stories or songs and it was the responsibility of certain elders to memorize and retain the full and accurate content of these and pass them on? What is not clear is the realtionship between this phase and the traditional divisions between hunting and gathering and agriculturalists?",
        "created_utc": 1529155964,
        "upvote_ratio": ""
    },
    {
        "title": "Good Starter Books",
        "author": "HotMarsupial",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ri31w/good_starter_books/",
        "text": "Hi everyone, my dad; a retired man working in the financial sector has always been interested in anthropology (in fact he wished he was able to take a degree in it during his youth). Despite the interest hasn't pursued anything beyond very surface level stuff (mostly watching documentaries on NatGeo and some history books). I know nothing about anthropology either but want to help get him started in this subject. \n\nWhat are some good starter books? If you know any websites with lists or anything else to help amateurs that would help too but I'm mostly looking for books (old fashioned man, he is)\n\nReally appreciate your help",
        "created_utc": 1529137377,
        "upvote_ratio": ""
    },
    {
        "title": "How did a gender binary develop in Europe and become prominent even if this isn’t the case for many other parts in the world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rh9k3/how_did_a_gender_binary_develop_in_europe_and/",
        "text": "[deleted]",
        "created_utc": 1529125675,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good sources for Traditional African religions in East Africa?",
        "author": "steven_soderbergh",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rgtdi/what_are_some_good_sources_for_traditional/",
        "text": "I've got a friend going on an extended visit to East Africa for her Food Systems degree, and I want to give her a going-away gift. She's interested in religious studies as a hobby, but hasn't done or taken classes about academic work in it. What would be a good book on Traditional African religions that focuses on East Africa that is accessible and available for sale at a reasonable price (seriously, I've seen some books go for like $700 used on Amazon)?",
        "created_utc": 1529120489,
        "upvote_ratio": ""
    },
    {
        "title": "What roles do dogs play in world mythology's?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rghm8/what_roles_do_dogs_play_in_world_mythologys/",
        "text": "",
        "created_utc": 1529116933,
        "upvote_ratio": ""
    },
    {
        "title": "Why did cannibalism develop such a strong taboo in so many cultures when human flesh is completely safe to eat and has been in various cultures' ceremonies?",
        "author": "Paul-A-Deen",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8rbb7u/why_did_cannibalism_develop_such_a_strong_taboo/",
        "text": "Aside from the brain, of course. Perhaps that fact is what has lead civilizations to condemn such practices as they could not tell the difference, associating any form of cannibalism with victims of Kuru.\n\nThis is my first time posting. Apologies if I've strayed from the preferred format. ",
        "created_utc": 1529072527,
        "upvote_ratio": ""
    },
    {
        "title": "Could hybrid dinosaurs exist in Dinosaur's time on Earth?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8raz1w/could_hybrid_dinosaurs_exist_in_dinosaurs_time_on/",
        "text": "[deleted]",
        "created_utc": 1529069630,
        "upvote_ratio": ""
    },
    {
        "title": "If all blue eyed people descended from a common ancestor 6- 10,000 years ago, how can we explain the anomalous cases of blue eyed Pacific islanders, aborigines, etc?",
        "author": "p_noid",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ra7hi/if_all_blue_eyed_people_descended_from_a_common/",
        "text": "[http://www.businessinsider.com/all-people-blue-eyes-have-common-ancestor-2017-9](http://www.businessinsider.com/all-people-blue-eyes-have-common-ancestor-2017-9)",
        "created_utc": 1529062031,
        "upvote_ratio": ""
    },
    {
        "title": "intellectual humans 12 thousand years ago",
        "author": "morphxz",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r9d8q/intellectual_humans_12_thousand_years_ago/",
        "text": "Is it possible intellectual humans lived on earth 10'000 BC and most (if not all) of their knowledge didn't survive the cataclysm when the last ice age faded rapidly and caused multiple catastrophes nobody was prepared for?",
        "created_utc": 1529051181,
        "upvote_ratio": ""
    },
    {
        "title": "Lack of Conference Funding For MA Students - Should I Still Attend?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r944u/lack_of_conference_funding_for_ma_students_should/",
        "text": "[deleted]",
        "created_utc": 1529047654,
        "upvote_ratio": ""
    },
    {
        "title": "What is your favorite poem/poet from the group you’ve studied?",
        "author": "0interests0",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r91de/what_is_your_favorite_poempoet_from_the_group/",
        "text": "",
        "created_utc": 1529046630,
        "upvote_ratio": ""
    },
    {
        "title": "Why don’t you hear that much about bonobos in the pop science world?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r7wer/why_dont_you_hear_that_much_about_bonobos_in_the/",
        "text": "",
        "created_utc": 1529033362,
        "upvote_ratio": ""
    },
    {
        "title": "How common was it for cultures to categorize plant food?",
        "author": "uq42",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r6hyf/how_common_was_it_for_cultures_to_categorize/",
        "text": "Categories like fruit, vegetable, and grain. If they had categories, what categories did different cultures have?",
        "created_utc": 1529019568,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding the feud between Lévi-Strauss and the Annale School",
        "author": "xXbee_lover88Xx",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r67w7/regarding_the_feud_between_lévistrauss_and_the/",
        "text": "I’m a history student, currently studying historiography. I realize there is still some discussion between history and anthropology in the academia, but I was wondering if anyone could recommend any articles/books on the subject (preferably something written by Lèvi-Strauss, since my university is prioritizing the Annale School).",
        "created_utc": 1529017085,
        "upvote_ratio": ""
    },
    {
        "title": "How far back does slash-and-burn agriculture go?",
        "author": "Made_of_Loki",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r67ht/how_far_back_does_slashandburn_agriculture_go/",
        "text": "Does it predate other forms? Was it used in the New World as well as the Old?",
        "created_utc": 1529016989,
        "upvote_ratio": ""
    },
    {
        "title": "The effect of mountains that touch the sky on the collective development of cultures",
        "author": "Paul_Kagame_Offical",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r61yv/the_effect_of_mountains_that_touch_the_sky_on_the/",
        "text": "So the other day I was in the town of Akureyri, Iceland.  Now Akureyri is surrounded by these pretty major mountains that reach so high they penetrate the constant and thick clouds that cover the towns sky.  Now this got me thinking about how so many cultures believe in the idea that gods and what not live up above in the sky, and even more importantly that the sky is this endless thing and thats got to have some sort of humbling effect on the people below. But in a place like Akureyri the sky is a tangible place that can physically be reached.  I was wondering if there’s ever been some study looking at what effect these mountains that seem to make the sky this tangible and reachable place have on a people group?  Or really any other thoughts on this?",
        "created_utc": 1529015640,
        "upvote_ratio": ""
    },
    {
        "title": "Is the modern idea of a \"caveman\" based on any real prehistoric culture(s)?",
        "author": "NerdyGamerGeek",
        "url": "https://www.reddit.com/r/AskHistorians/comments/8r01qv/is_the_modern_idea_of_a_caveman_based_on_any_real/",
        "text": "",
        "created_utc": 1529010636,
        "upvote_ratio": ""
    },
    {
        "title": "Yet another 'how did they get water' question. This time, fishing villages!",
        "author": "yesh_me_lorde",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r3o2v/yet_another_how_did_they_get_water_question_this/",
        "text": "How would a stone age coastal fishing village survive, if the coast is all salt water?",
        "created_utc": 1528996913,
        "upvote_ratio": ""
    },
    {
        "title": "Did hunter gatherers use something like the Australian Aboriginal \"songlines\" to navigate?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8r1s1n/did_hunter_gatherers_use_something_like_the/",
        "text": "Australian Aboriginal \"songlines\" may be among the oldest extant folkloric records that mankind has. They were apparently used like maps, to navigate long distances. We do not know how (or if) hunters and gatherers in other places had such tools for navigation. Is it a reasonable possibility that songlines were used?",
        "created_utc": 1528982336,
        "upvote_ratio": ""
    },
    {
        "title": "The internet is saying deserts in the Middle East formed/were created when salt buildup from irrigating crops in the fertile crescent eventually crossed a threshold that most plants could no longer tolerate. True or false?",
        "author": "fatbudha1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/8r08pr/the_internet_is_saying_deserts_in_the_middle_east/",
        "text": "",
        "created_utc": 1528966374,
        "upvote_ratio": ""
    },
    {
        "title": "Essentialism in stand-up comedy?",
        "author": "lameimity",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qyxs8/essentialism_in_standup_comedy/",
        "text": "[removed]",
        "created_utc": 1528949738,
        "upvote_ratio": ""
    },
    {
        "title": "Indigenous present-day monkeys, the [Into-&amp;-]Out-of-Africa theory, and fallibility of unlimited power",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qxesx/indigenous_presentday_monkeys_the_intooutofafrica/",
        "text": "[removed]",
        "created_utc": 1528935304,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate is this video",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qwill/how_accurate_is_this_video/",
        "text": "https://m.youtube.com/watch?v=zFohbr7ALeQ",
        "created_utc": 1528927553,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a direct cultural link between the Dene people of Canada and the Dine of the U.S. Southwest?",
        "author": "trouve",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qvcs5/is_there_a_direct_cultural_link_between_the_dene/",
        "text": "Any linguistic tie? Cultural commonalities? Direct genetic descendants?",
        "created_utc": 1528918728,
        "upvote_ratio": ""
    },
    {
        "title": "Did the onset of agrarian societies cause a rift in or evolutionary existence and harmony with the natural world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qv7wg/did_the_onset_of_agrarian_societies_cause_a_rift/",
        "text": "[deleted]",
        "created_utc": 1528917727,
        "upvote_ratio": ""
    },
    {
        "title": "In what areas of the globe did clan-based social structures break up in Early Modern times?",
        "author": "icydepth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qr9li/in_what_areas_of_the_globe_did_clanbased_social/",
        "text": "Were there, or are there culturally (rather than economically) individualistic countries outside of Europe and North America? Maybe the ancient/medieval Tamil states, or guilds in southeast Asia?",
        "created_utc": 1528884534,
        "upvote_ratio": ""
    },
    {
        "title": "Why did humans look more masculine thousands of years ago?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qqs25/why_did_humans_look_more_masculine_thousands_of/",
        "text": "[deleted]",
        "created_utc": 1528878106,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't Africans have androgenized body hair?",
        "author": "AndeanRebozo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qor6l/why_dont_africans_have_androgenized_body_hair/",
        "text": "It is generally assumed body hair grows because of high levels of circulating androgens and/or high androgen receptor sensitivity. \n\nHowever, Africans have the most sensitive androgen receptors, and the most testostrone (and its derivatives-- DHT and estradiol, chief among them relevant to hair growth) adjusted for age and body size (https://www.somalispot.com/threads/testosterone-levels-by-race.19099/). Yet, a quick look at West Africans, East Africans, and South Africans gives the same picture: they have almost no androgenized body hair (other than relatively weak beard growth in some groups).\n\nWhat mechanism is going on that protects Africans from developing terminal hairs on their chest, arms, thighs, etc.?\n\nEDIT: I did not mean to post the somalispot link. I don't even know how that got there. I meant this study:\n(1) androgen receptor sensitivity variation: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2608588/pdf/jnma00357-0023.pdf\n(2) androgens in black, east asian, white, etc.: https://pdfs.semanticscholar.org/56c7/049634ac87441e8a96afc8fe34c588bdad94.pdf\n\n",
        "created_utc": 1528855722,
        "upvote_ratio": ""
    },
    {
        "title": "Human diet",
        "author": "kesascarfman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qmffa/human_diet/",
        "text": "How did humans get a well rounded diet before more vitamins were made available through plant domestication and selective breeding. ",
        "created_utc": 1528835971,
        "upvote_ratio": ""
    },
    {
        "title": "I heard from someone that native Americans didn’t have a concept of illegitimate children",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qlsyl/i_heard_from_someone_that_native_americans_didnt/",
        "text": "And even if the child was of Europeion decsent they would be treated equally. Is that correct?",
        "created_utc": 1528831400,
        "upvote_ratio": ""
    },
    {
        "title": "Studies of Collective Decision-Making and Social Choice?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qkqq2/studies_of_collective_decisionmaking_and_social/",
        "text": "I am having a difficult time finding studies of collective decision making in anthropology. Economics has the entire field of social choice theory but I rarely see it cited by anthropologists. \n\nAny good ethnographies of how groups make collective decisions? Boehm's Hierarchy in the Forest has a bit. Also Marshall's Collective Decision Making in Rural Japan. Other than that, I know of no devoted works. ",
        "created_utc": 1528823753,
        "upvote_ratio": ""
    },
    {
        "title": "Is it difficult to be a right-wing Christian in the field of anthropology?",
        "author": "GoldenFascist",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qhxek/is_it_difficult_to_be_a_rightwing_christian_in/",
        "text": "I'm starting courses in anthropology this summer, I hope to get into archaeology after school. One thing I saw in the syllabus was the question, \"Are humans intelligently designed?\" This got me thinking about how difficult it may be for me to fit into a world of people who may be atheists or left-leaning politically. \n\nIn your experiences, is this something that may be difficult to juggle or do you think that it'll have no effect?",
        "created_utc": 1528800050,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the night is associated with fear, uncertainty, and the supernatural?",
        "author": "supx3",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qhqxb/why_is_the_night_is_associated_with_fear/",
        "text": "The best explanation I've found so far was a note by George Devereux explaining how at night our eyesight is less effective and its the sense we lean on the most. I'm happy with the answer but I'd love to hear more on the subject. Articles and books on the subject of night from anthropology, sociology, or psychology backgrounds are welcome in addition to your own personal musings. Also welcome are counterpoints such as cultures which welcome night as normal and thrive in it.",
        "created_utc": 1528797838,
        "upvote_ratio": ""
    },
    {
        "title": "How did England manage to integrate so many different groups through its history (saxons, scandinavians, normans) into a single ethnic identity, whereas a country like sri lanka has not managed to integrate its two main populations (singhalese and tamils) after thousands of years of co-existence?",
        "author": "Rohanthewrangler",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qh2d9/how_did_england_manage_to_integrate_so_many/",
        "text": "I posted this question in /r/askhistorians without receiving an answer so maybe this subreddit will be able to help me. I'm specifically interested in why the tamil and singhalese populations remain distinct identities despite a long history of living together. I'm just using england as a comparison to see why some countries seem to integrate disparate groups whereas others don't.",
        "created_utc": 1528788742,
        "upvote_ratio": ""
    },
    {
        "title": "Why do uncontacted tribes cover their genitals?",
        "author": "natantantan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qgw18/why_do_uncontacted_tribes_cover_their_genitals/",
        "text": "When watching documentaries on hunter gatherer tribes or  uncontacted tribes everyone has a cloth around their groin to cover their genital. \n\nOne would assume this would be a \"society\" thing but it seems like it's more of a \"human\" thing. Is it innate in us to be embarrassed by our genitals? And if so, why? \n\nIs it an evolutionary thing where if peoples didn't cover themselves, women would just select the men with the largest penis? Is it forced modesty for the benefit of the group that eventually became part of all humans culture? \n\nIs it safe to assume that hunter gatherers thousands of years ago did the same thing? ",
        "created_utc": 1528786617,
        "upvote_ratio": ""
    },
    {
        "title": "How did most humans die?",
        "author": "natantantan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qgo4x/how_did_most_humans_die/",
        "text": "I'm talking about starting from anatomically modern humans X amount of thousands of years ago to today. If you tallied up all the causes of death, what would be the leading one?\n\nI know there is almost no way to know this concretely, but what would be your best guess?\n\nWould it be something like starvation? \n\nSide question: How did most cavemen die? If we exclude all the humans post civilization, what would most likely be the biggest cause of death? Would it be something physical like from warring tribes or something like dying to the elements? \n\nAnother side question: How common was dying of starvation? Was it very common since life as hunter gatherers was very hard or was it not that common since if you were born, it meant that most likely you were born into a successful tribe that could feed itself? ",
        "created_utc": 1528783971,
        "upvote_ratio": ""
    },
    {
        "title": "Do anthropologists still use the word ‘barbarian’ and ‘civilized’",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qd0zf/do_anthropologists_still_use_the_word_barbarian/",
        "text": "What’s the difference “",
        "created_utc": 1528750971,
        "upvote_ratio": ""
    },
    {
        "title": "Did pre-contact Maori have any types of Spirt/demon posesssion?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8qauac/did_precontact_maori_have_any_types_of_spirtdemon/",
        "text": "",
        "created_utc": 1528734325,
        "upvote_ratio": ""
    },
    {
        "title": "When Chimpanzees first became carnivorous did it produce any changes in brain structure or social structure?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8q9d1v/when_chimpanzees_first_became_carnivorous_did_it/",
        "text": "The question in general is; if a previously vegetarian animal species takes up the killing of animals does it produce any structural changes in the brain or other physical or social systems. Is there any recognition that killing another animal is different?",
        "created_utc": 1528722215,
        "upvote_ratio": ""
    },
    {
        "title": "Could the bronze age battle at the Tollense river be seen as a sort of Trojan War for northern Europe?",
        "author": "TheDrakced",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8q88w6/could_the_bronze_age_battle_at_the_tollense_river/",
        "text": "Could the battle been part of a larger military conflict in the region and period? Could the stories and legends from this time have impacted the Germanic/Norse mythology that came later? Events like the Aesir-Vanir War come to mind with warring factions of Indo-Europeans. Conflicts over generations with migratory people settling the same land and finally coming together and infusing the culture. Though I may be romanticising this too much.",
        "created_utc": 1528710092,
        "upvote_ratio": ""
    },
    {
        "title": "How ancient people perceived time before writing, calendar and language?",
        "author": "Pleional",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8q6wh9/how_ancient_people_perceived_time_before_writing/",
        "text": "Did they only have the ability to sequence the events or did their sense of time resemble in any way to later times?",
        "created_utc": 1528693329,
        "upvote_ratio": ""
    },
    {
        "title": "Does rib cage cartilage decompose along bones or sooner?",
        "author": "ned_poreyra",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8q1nia/does_rib_cage_cartilage_decompose_along_bones_or/",
        "text": " [https://i.imgur.com/FrLbRiE.png](https://i.imgur.com/FrLbRiE.png)\n\nAfter death, how long does it take for costal cartilage to disappear (I mean, \"turn to dust\")? Does it ossify? Or when I see a real skeleton on display, the costal cartilage is just an artificial recreation (plastic or something) to keep the rib cage together? All the other cartilage seems to disappear eventually, somewhat between advanced decay and skeletonization.",
        "created_utc": 1528645732,
        "upvote_ratio": ""
    },
    {
        "title": "What was the original human phenotype?",
        "author": "DarthNightnaricus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pzrla/what_was_the_original_human_phenotype/",
        "text": "I'm curious as to what the earliest *Homo sapiens sapiens* individuals, like the remains found at Jebel Irhoud, Morocco, would have looked like. What was their skin color? How defined was the brow ridge?",
        "created_utc": 1528623092,
        "upvote_ratio": ""
    },
    {
        "title": "Before the advent of Darwinian evolutionary theory, what did humans make of the anatomical similarities between humans and non-human primates? Do we know if any cultures believed us to be related independent of Darwinian theory?",
        "author": "VeryVeryCum",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pvaaq/before_the_advent_of_darwinian_evolutionary/",
        "text": "",
        "created_utc": 1528573070,
        "upvote_ratio": ""
    },
    {
        "title": "Would an average Cro-Magnon have a similar level of intelligence to that of an average modern human?",
        "author": "Thefireisrishing",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8puz8c/would_an_average_cromagnon_have_a_similar_level/",
        "text": "",
        "created_utc": 1528570544,
        "upvote_ratio": ""
    },
    {
        "title": "How are humans so good at driving?",
        "author": "wannabe414",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8puxvi/how_are_humans_so_good_at_driving/",
        "text": "I just came out of a Cognitive Science class where we talked a lot about evolutionary psychology and Gene culture coevolution in the context of human nature and diversity. Driving is something that has always alluded me (I don't have a license), but i see my friends effortlessly drive these thousand pounds behemoths. \n\nAnd using a car, I don't think, is similar to other tools like bows and arrows or hammers, since there's so many more moving parts. There's the gas pedal, stuck shift, and steering wheel you have to take into consideration, as well as the dozens of signals on the road coming from Street signs and other cars. Was there ever an analogous activity in human history? And if not, how is that pretty much any human can spend a couple dozen hours on the road and then become comfortable enough to drive?",
        "created_utc": 1528570207,
        "upvote_ratio": ""
    },
    {
        "title": "Where to start with anthropology?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pt9ok/where_to_start_with_anthropology/",
        "text": "[deleted]",
        "created_utc": 1528555828,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting book suggestions for the summer",
        "author": "Oskar2323",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pslgu/interesting_book_suggestions_for_the_summer/",
        "text": "I´m looking for some interesting books to read during the summer. Not really looking for some heavy books filled with facts, but a more easy to read and interesting field study.",
        "created_utc": 1528548772,
        "upvote_ratio": ""
    },
    {
        "title": "When did the childhood game of \"floor is lava\" appear?",
        "author": "TheYearOfThe_Rat",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8prmb9/when_did_the_childhood_game_of_floor_is_lava/",
        "text": "As well as is that game transcultural in any way and do any similar games exist outside of the European and North American continent?",
        "created_utc": 1528535313,
        "upvote_ratio": ""
    },
    {
        "title": "Are Californian Yokuts related to Yakutian Yakuts?",
        "author": "tanktango",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pr7ye/are_californian_yokuts_related_to_yakutian_yakuts/",
        "text": "",
        "created_utc": 1528529304,
        "upvote_ratio": ""
    },
    {
        "title": "What essential books about incest do you recommend?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pk9ad/what_essential_books_about_incest_do_you_recommend/",
        "text": "[deleted]",
        "created_utc": 1528467654,
        "upvote_ratio": ""
    },
    {
        "title": "1 Have there been any case of large scale conflict where animal have war with one another? Or is this is a human construct?",
        "author": "nashmishah",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8piesx/1_have_there_been_any_case_of_large_scale/",
        "text": "I know that there are small conflicts where animal fight for territory and food source? But, is there any record that indicates animal having a full-blown war with each other? If there is any, why did this happen? Thank you.",
        "created_utc": 1528448774,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think humans will collectively start \"forgetting\" knowledge as they outsource procedure to computing?",
        "author": "Domhnal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8piayz/do_you_think_humans_will_collectively_start/",
        "text": "I was a psych major in undergrad and I took a \"statistics\" course that essentially taught me how to organize the numbers, how to insert them into SPSS and finally how to interpret the stuff that SPSS spits out.  I'm not saying this is useless, but I have no idea at how SPSS arrived at its conclusions mathematically, and conceivably I could have a successful psychology career without ever needing to know.\n\nThis makes me wonder: the more computing takes over operations the less we need to specialize what makes those operations possible.  Are there any futurists (I don't know if this is outside anthropology, tbh) who are drawing conclusions about this potential for our species?  Is this a real concern?",
        "created_utc": 1528447300,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for article(s) about bone healing shamans in South America?",
        "author": "tesla_spoon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pg563/looking_for_articles_about_bone_healing_shamans/",
        "text": "Hello! I am hoping you can help me find an article I remember from a Medical Anthropology class I took about seven years ago. It is about a tradition of healers whose calling is revealed to them by dream. Often reluctant individuals will dream of a bone fragment which speaks to them, and upon waking they'll find the same bone fragment wiggling nearby. Thereafter they are duty-bound to travel from town to town, healing the sick by rubbing the bone fragment on their patients' ailments (they may use herbs too?). They are not allowed to accept payment for their services, beyond shelter and food. I'm pretty sure this was in South America but I can't remember much beyond that. \n\nDoes this ring a bell for anyone? Any help is greatly appreciated! It just popped into my head earlier and I would love to read more about them. Thanks so much! ",
        "created_utc": 1528423850,
        "upvote_ratio": ""
    },
    {
        "title": "Curious about anthropological function of aging",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pet83/curious_about_anthropological_function_of_aging/",
        "text": "[deleted]",
        "created_utc": 1528411969,
        "upvote_ratio": ""
    },
    {
        "title": "Anthropological Questions",
        "author": "MemeLOLogy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pe078/anthropological_questions/",
        "text": "What are some good questions relating to anthropology regarding the Armin Meiwes case that you would ask others?",
        "created_utc": 1528405492,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking opinions on: \"Petroglyph similarities around the world happened because intense auroras\"",
        "author": "xvaldetaro",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8pc7uj/seeking_opinions_on_petroglyph_similarities/",
        "text": "I recently listened to a [podcast featuring Robert Schoch](https://www.youtube.com/watch?v=Vka2ZgzZTvo). In it, he explaned his theory of a \"Solar induced dark age\" wherein humans had complex and high technology civilizations at the end of the last Ice Age, but then suffered a massive collapse and a following Dark Age that lasted until the first recordings of civilization as we know it.\n\n\nOne of the evidences presented to corroborate his theory [was the article by Anthony Peratt on how petroglyphs are depictions of intense auroras](http://www.theplasmaverse.com/pdfs/Characteristics-for-the-Occurrence-of-a-HighCurrent-ZPinch-Aurora-as-Recorded-in-Antiquity-squatter-squatting-man-Anthony-Peratt.pdf), which were seen simultaneously all over the world.\n\n\nI don't really buy Schoch's theory (but I also don't think it totally implausible), but I am really curious about Peratt's article, specially the petroglyphs of the squatter with 2 circles on each side. As I see it, for the theory to be valid, there should be a rising of similar pattern on the petroglyphs all over the world in a certain period of time (while the auroras were happening) and then that pattern being gone. Since I don't know anything about petroglyphs I am asking here:\n\n* 1. How easy is it for one to hand pick petroglyphs of anything to prove some random association of ancient humans with whatever theory one wants?\n* 2. Are the petroglyphs that Peratt shows on the article rare and only seen in a short period of time?\n* 3. If 2 is true, what would be other good explanations for the patterns.\n* 4. Are there any other weird themes on petroglyphs besides the ones showed by Peratt?\n\nAlso, comments on Schoch's theory are also welcome.",
        "created_utc": 1528392502,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] (African) Tribes where people go topless have more, less or same amounts of rape/sexual harassment?",
        "author": "silveryfeather208",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p794f/serious_african_tribes_where_people_go_topless/",
        "text": "No, I don't think nudity = rape, I do however, know that there are people who justify themselves by saying the victims were indicating that they 'want sex' because of nudity. If tribes who are desensitized to nudity/topless women, do they have less reasons to justify themselves or do they just find other reasons?\n\nDo the men look at a topless women and make remarks like, 'nice breasts' or whatever?",
        "created_utc": 1528344182,
        "upvote_ratio": ""
    },
    {
        "title": "Why hasn't inherited socioeconomic status been accommodated by human evolutionary theory?",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p5wrf/why_hasnt_inherited_socioeconomic_status_been/",
        "text": "[removed]",
        "created_utc": 1528331727,
        "upvote_ratio": ""
    },
    {
        "title": "Did the transition from hunting-gathering to farming cause standards of living/quality of life to go down? If so, why did groups make this transition? Couldn't individuals whose quality of life was reduced have run away?",
        "author": "Low_Voice_K",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p5db2/did_the_transition_from_huntinggathering_to/",
        "text": "",
        "created_utc": 1528327073,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best English translation of the mongol title ‘khan’",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p54cw/what_is_the_best_english_translation_of_the/",
        "text": "",
        "created_utc": 1528325028,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone verify the origins of the \"'Mayan' gender calendar\" system?",
        "author": "CannedGuru",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p2yl8/can_anyone_verify_the_origins_of_the_mayan_gender/",
        "text": "I was working on an unrelated anthropology project when I came across the \"ancient Mayan gender calendar.\" It is mentioned predominantly in forums and blogs, and I cannot find any references in peer\\-reviewed literature.\n\nThe method is as follows:\n\nTake the mother's age at the infant's conception and either the year or number of the month in which the child was conceived (sources vary\\*). If both are odd or both are even (they sum to an even number), expect a girl, if one is even and the other odd (they sum to an odd number) expect a boy.\n\nI suspect that this system is a purely modern invention and that the \"Mayan\" label was added to sound exotic, but I can't be sure. The earliest reference I can find is the website [www.tablamaya.com](http://www.tablamaya.com) which went up some time in 2002. The term \"tabla maya\" appears again in a [2003 blog post](https://maternidad.enfemenino.com/foro/tabla-china-y-maya-todo-un-cuento-fd539287), and the purported method is described in a [2004 BBC article](http://news.bbc.co.uk/2/hi/uk_news/magazine/3628773.stm).\n\nAnybody know where this started? Is it actually a Mayan traditional belief? And if there is an 'ancient' source (Mayan or otherwise), how can I find it?\n\n\\* While using the year is mentioned earlier, using the month makes more sense, since being born in an odd\\-numbered year would mean your age is nearly always an even number when the year is odd, and nearly always an odd number when the year is even, and being born in an even\\-numbered year would mean your age is nearly always even when the year is even, and odd when the year is odd.\n\n**Edit:** After playing six degrees of citations for a few days I think I’ve finally found the source. The “Mayan gender calendar” appears to be either a corruption or synthesis of different Chinese numerological methods for predicting the sex of an unborn child. There are two key publications which describe this practice. Here's what I found:\n\n**The folklore of China, and its affinities with that of the Aryan and Semitic races** by Dennys, N. B. (Nicholas Belfield), 1876, page 11\n\n*The formula for ascertaining the sex of a coming child is not very far removed from the children's amusement of prophesying by buttons, commencing \" Tinker, Tailor, Soldier, Sailor, &amp;c.''* ***The mother adds to the number of her age in years that of the month, day and hour she was born****: thus if twenty years old and she was born in the sixth hour of the third day of the second month, she would have a total of thirty\\-one. She then takes a series of pictures of the thirty\\-six assistants of the Goddess of Children, sold for fortune\\-telling purposes, and according to the sex of the child in the arms of the thirty\\-first concludes that her own child will be a boy or a girl. If the number of her age, &amp;c., exceed thirty\\-six, she commences to count the first picture from number thirty\\-seven. Childless women also resort to a similar process to ascertain whether they will or will not have children. Those curious to ascertain the religious ceremonies made use of prior to birth may be referred to Mr. Doolittle's work on Chinese Social Life.*\n\n**La pratique des accouchements chez les peuples primitifs : étude d'éthnographie et d'obstétrique** by Engelmann, George J. (George Julius); Charpentier, A; Rodet, Paul, 1886, page 359\n\nOriginal text:\n\n*Manière de diagnostiquer le sexe. — Multipliez 7 par 7 vous obtenez 49. Retranchezen le nombre d'années formant l'âge delà mère, ajoutez 19 plus le chiffre indiquant le mois de l'année dans lequel l'enfant a été conçu.* ***Si le nombre ainsi obtenu est impair, l'enfant sera du sexe masculin ; s'il est pair, ce sera une fille.***\n\nTranslated:\n\n*Diagnosing the sex (of the child). — Multiply 7 by 7 and you get 49. Retract the number of years forming the mother's age, add 19 plus the number indicating the month of the year in which the child was conceived.* ***If the number thus obtained is odd, the child will be male; if it is even, it will be a girl.***",
        "created_utc": 1528308864,
        "upvote_ratio": ""
    },
    {
        "title": "Impact of language on development",
        "author": "AlloyAlpaca",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p1gsq/impact_of_language_on_development/",
        "text": "Many people think that humans are unique in our ability to be “conscious” but I feel that what makes humans special and more advanced is our ability to communicate through language. That maybe other species have the same cognitive ability we do but not a language to form more complex ideas or thoughts. I was hoping to find some evidence for against how language has expanded our ability to think both about others and reflect on our own minds. Please feel free to mention any other information you guys feel is relevant or interesting!",
        "created_utc": 1528298402,
        "upvote_ratio": ""
    },
    {
        "title": "Did the practice of human sacrifice begin with agriculture?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8p1857/did_the_practice_of_human_sacrifice_begin_with/",
        "text": "Is it the case that for all the hundreds of thousands of years we were hunters and gatherers we did not need to resort to human sacrifice, but with coming of a seemingly more civilized way of life, we did engage in human sacrifice. And it seems to have been practiced in all cultures.",
        "created_utc": 1528296663,
        "upvote_ratio": ""
    },
    {
        "title": "To what degree does the technology and resources available to a society determine it's political structure?",
        "author": "ModerateMandarin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oyyn1/to_what_degree_does_the_technology_and_resources/",
        "text": "For ex., if I described the resources (and their geography) and technological ability of a society to you, could you predict it's government? ",
        "created_utc": 1528273674,
        "upvote_ratio": ""
    },
    {
        "title": "Can mythemes predict individual human psychology or societal trend in the cultures that esteem them?",
        "author": "Domhnal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oygc9/can_mythemes_predict_individual_human_psychology/",
        "text": "A lot of neo-Jungians spurred on by modern speakers like Peterson seem to think that we can \"read the entrails\" so to speak of the various mythemes each culture esteems like Freud or Jung would a dream and then get information about the psychology of individual members of said culture or societal values and norms.  This seems counterintuitive to me because the whole concept of a mytheme is that we only have a very limited number that seem to produce or be produced by a myriad of cultures.  I seem to remember some researchers trying to use massive data crunching programs to see if we can find any trends with little luck, but I can't remember any details.  What do you guys think?",
        "created_utc": 1528267244,
        "upvote_ratio": ""
    },
    {
        "title": "Can you disprove this theory about the 1st human settlement?",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oxbaf/can_you_disprove_this_theory_about_the_1st_human/",
        "text": "[removed]",
        "created_utc": 1528255233,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys! I was wondering, if any archaeologists are reading this, what are some interesting stories you have and what are some theories/conclusions you've derived from your findings?",
        "author": "King_Steve62",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ox14p/hey_guys_i_was_wondering_if_any_archaeologists/",
        "text": "",
        "created_utc": 1528252651,
        "upvote_ratio": ""
    },
    {
        "title": "Is it cultural appropriation for a white person to have a tattoo of Chinese characters?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8owyq1/is_it_cultural_appropriation_for_a_white_person/",
        "text": "[removed]",
        "created_utc": 1528252066,
        "upvote_ratio": ""
    },
    {
        "title": "Debunking racists' claims about skull shapes?",
        "author": "DarthNightnaricus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ownel/debunking_racists_claims_about_skull_shapes/",
        "text": "[removed]",
        "created_utc": 1528249398,
        "upvote_ratio": ""
    },
    {
        "title": "Beginning of dreams",
        "author": "LunaAmino",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8os1cb/beginning_of_dreams/",
        "text": "As far as I know, when the man discovered fire he could not only scare predators but also have more hours of sleep and (maybe) a better sleep, can we suppose that was the beginning of dreams?",
        "created_utc": 1528214869,
        "upvote_ratio": ""
    },
    {
        "title": "Best language to take in school?",
        "author": "TheRedQueen13",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8or8a6/best_language_to_take_in_school/",
        "text": "Hello all!\n\n I am going back to school to finish my bachelors in Anthropology at the age of 32. I have gotten into the University of Kentucky and one of the requirements is to take a language. I don’t really have a language I’m interested in, but they offer Spanish, French, German, Italian, Chinese, Japanese, Greek Arabic, and Latin.\n\nI signed up to take Classical Latin but I keep hearing that it’s very hard and difficult. I’m worried that it might not be the best choice. Will having a language help in the long run to work in Archaeology ? How hard is it to learn a language at 32? \n\nI’m interested in working in a couple of different fields of anthropology, like Paleoanthropology, studying funeral and death rituals, classical archaeology and Persia and the Middle East area. Haven’t narrowed down which I will do for my masters but still have some time. \n\nSorry for the ramble I’m very nervous about going back to school in my 30s and want to do well. Any advice would be greatz",
        "created_utc": 1528208809,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the most interesting/toughest/funny/favorite of yours rites of passage?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oqfqe/what_are_some_of_the_most/",
        "text": "Thanks for any answers.",
        "created_utc": 1528202087,
        "upvote_ratio": ""
    },
    {
        "title": "Is Ice Core dating an relative or absolute dating method?",
        "author": "charlesspeltbadly",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oowo3/is_ice_core_dating_an_relative_or_absolute_dating/",
        "text": "",
        "created_utc": 1528183776,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we clap/applause?",
        "author": "careersinscience",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oo9j9/why_do_we_clapapplause/",
        "text": "What is the origin of clapping as a form of applause, and why do we do it? And how does it vary among cultures?",
        "created_utc": 1528176207,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know of any Central African archaeological sites where hominid fossils or stone tools have been discovered?",
        "author": "DasIstWangernumb",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8on8er/do_you_know_of_any_central_african_archaeological/",
        "text": "It seems that the majority of important paleoanthropological findings in Africa have been found in Southern and Eastern Africa. Do we know of any important findings in Central Africa? I am primarily interested in stone tool and hominid fossil finds from 7mya to ~100kya.\n\nBelow is a link that depicts the region I am referring to. For this question, I am not including Chad in the region.\n\nhttp://caglobalint.com/recruitmentafrica/wordpress_caglobal/wordpress/wp-content/uploads/2013/12/Central_Africa_Map.gif\n\nEDIT: *Don't get too hung up on the outdated country names on the above map, I'm just using it to give people a general idea.",
        "created_utc": 1528165709,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a good Thailand related read",
        "author": "Jc-walker",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8olssj/looking_for_a_good_thailand_related_read/",
        "text": "Hello everyone,\n\nI'll be travelling to Thailand soon and have recently started reading about Anthropology. I'd love it if someone could recommend me a book that'd allow me to read about their development etc that I could then go over there and experience it.\n\nMy favourite books I've read so far in this area are Sapiens and Tribe if that helps.\n\nThanks :\\)",
        "created_utc": 1528153171,
        "upvote_ratio": ""
    },
    {
        "title": "OTHER THAN scalping, what purposes, ritually, strategically, socially, etc. did mutilation of enemy corpses by natives serve during the wars of the Great Plains in the 19th century?",
        "author": "screwyoushadowban",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8okt4m/other_than_scalping_what_purposes_ritually/",
        "text": "How often were the bodies of white combatants like Adolph Metzger in the Fetterman Fight spared? And why? The assumption by his Anglo contemporaries was that it was a sign of respect, but there were no American witnesses to his death so I'm wondering if that had occurred in other instances that might support this conjecture.\n\nThanks!",
        "created_utc": 1528145437,
        "upvote_ratio": ""
    },
    {
        "title": "Why did Proto-Iranian spread much more quickly than did proto-Indo-Aryan?",
        "author": "tnk9241",
        "url": "https://www.reddit.com/r/linguistics/comments/8oj8qr/why_did_protoiranian_spread_much_more_quickly/",
        "text": "",
        "created_utc": 1528134140,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for papers on internet trolling and/or hate.",
        "author": "JebusWasAnAlien",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8oiofk/im_looking_for_papers_on_internet_trolling_andor/",
        "text": "Hello\n\nI'm looking for any sort of scientific source which can place the phenomena of Internet hate/mobs/trolling in a historical cultural perspective. \n\nI've tried searching Google Scholar &amp; PLOS but I'm not even sure which keywords to use. \n\nAny help is greatly appreciated. ",
        "created_utc": 1528129942,
        "upvote_ratio": ""
    },
    {
        "title": "How much does English language penetrate cultures with strong ESL programs like Germany and what is it's effect on things?",
        "author": "Domhnal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ohvv9/how_much_does_english_language_penetrate_cultures/",
        "text": "With English being the um..*lengua Franca*, there are quite a few cultures now who are not native speakers but have a proficient command of the language. I'm currently in China studying with some Italians who have no reason other than their curriculum to learn English, and we have pretty solid communication.  Not to mention so much of international pop culture (via Hollywood, music and Youtube et al) as well as political discourse is conducted in English.  How is this impacting things?  Are we heading to Joss Whedon's vision in Firefly where everyone speaks English with a little Chinese peppered in?  Does it create and reinforce generational gaps, economic gaps or other sorts of class disparity?  Is it having an impact on local languages?  Are more and more English words making it into dictionaries (like coup d'etat, armada, haboob - personal favorite - or into the vernacular like long time no see)? \n\nThanks for reading!",
        "created_utc": 1528124102,
        "upvote_ratio": ""
    },
    {
        "title": "Is the exclusion of others a fundamental aspect of social community?",
        "author": "Uncle151",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ohmrj/is_the_exclusion_of_others_a_fundamental_aspect/",
        "text": "Say you're in an exclusive club (fraternity, sports team, whatever). You feel good about being a part of that club and that social group. A second club you're in allows anyone to join. There's a social group there, too, but wouldn't you value the exclusive club more? What's the point of a \"club\" in the first place?  \n\nDoes our human need for belonging require the exclusion of others? Why does it feel better to be part of an exclusive club rather than an inclusive one? ",
        "created_utc": 1528122095,
        "upvote_ratio": ""
    }
]