[
    {
        "title": "Starting my first job teaching at a university tomorrow, excited but nervous. Any tips from people who have been here before?",
        "author": "gotpaidtowrite",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96ny3f/starting_my_first_job_teaching_at_a_university/",
        "text": "",
        "created_utc": 1534064392,
        "upvote_ratio": ""
    },
    {
        "title": "How to enroll in an MD program as I now finish my PhD?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96n7i3/how_to_enroll_in_an_md_program_as_i_now_finish_my/",
        "text": "[deleted]",
        "created_utc": 1534053958,
        "upvote_ratio": ""
    },
    {
        "title": "Worth going abroad (UK) for History M.A.?",
        "author": "KeatsianOde",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96mg9l/worth_going_abroad_uk_for_history_ma/",
        "text": "Currently a year out of undergrad (did not major in history, though I took many history electives), unhappily in the workforce. I'm starting to save money up to eventually go for a Master's in History, and hopefully a Ph.D. I understand my chances of getting an actual job in history, let alone a professorship, are quite slim, to say the least. Still, I feel I'd probably regret it for the rest of my life if I didn't at least give grad school a try.\n\nI haven't narrowed down my focus yet, but it's safe to say that there is a 99% chance it will be focused on medieval/early modern Europe (probably pertaining to daily life in some fashion). The one thing I'm conflicted on is what schools I should apply to. I live in Toronto, and the premier institution for history here is the University of Toronto. However, it's quite expensive - 25.5k for domestic students (though for international students it is only 1k more), and unfunded. I've started looking at schools in the UK. For a Master's, most of them would have International Student tuition fees of about the same as U of T or just a few thousand more. However, general living expenses would effectively double that amount. I currently live at my parents', so I have barely any expenses in Toronto.\n\n I'm also ashamed to admit the grade threshold is a factor for me - I got good, but not great grades in undergrad, and the idea (whether true or not) that I could still get into a good UK university for my subject of choice is really reassuring to me.\n\nWould it be worth saving up for a few extra years in order to go to the UK?",
        "created_utc": 1534045340,
        "upvote_ratio": ""
    },
    {
        "title": "About co-authoring a paper in history, with humble credentials.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96lcz9/about_coauthoring_a_paper_in_history_with_humble/",
        "text": "[deleted]",
        "created_utc": 1534034752,
        "upvote_ratio": ""
    },
    {
        "title": "What to put on my student web space provided by the university? What do people use it for?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96kyvs/what_to_put_on_my_student_web_space_provided_by/",
        "text": "[deleted]",
        "created_utc": 1534031082,
        "upvote_ratio": ""
    },
    {
        "title": "My professor refuses to provide me my graded exams. Any recourse?",
        "author": "gussuk25",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96kxyw/my_professor_refuses_to_provide_me_my_graded/",
        "text": "Title sums it up. I emailed him asking for them and [this](https://imgur.com/a/F2AaSHD) is the response I got. Which is about as helpful as a box of rocks.\n\n\nIs there any way I can proceed with getting the exams? My university does not have a policy regarding this.\n\n\nI just want to see evidence of my grades, get what I paid for. Both of which were conveniently 89%.",
        "created_utc": 1534030842,
        "upvote_ratio": ""
    },
    {
        "title": "I question the legitimacy of my reasons to study classics.",
        "author": "tjones3333",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96k36a/i_question_the_legitimacy_of_my_reasons_to_study/",
        "text": "My first brush with classics came with my Grandfather whose implicit views on Rome can be effectively summarised by Edgar Allan Poe… I was an impressionable child- jingoistic and nationalistic among other things. Nowadays, I am patriotic, not nationalist. He introduced me to Gladiator- a great film in its own right, and, barring details surrounding costume etc and Hollywood-isation, upholds a pretty good likeness of how we think Rome might have looked. I love that film. Classically-themed yes, but the appeal comes from the excitement of it as an action-packed blockbuster. \n\nWhy did I tell you about my youth? When my mind drifts, I get excited by imagining hordes of legions sweeping across the Rhine and beyond. Wishing Caesar had in fact smashed into Persia, as the New Alexander, and raced towards India. He might trade- more directly than what really happened- with China just to allow the future emperors to invade right across South-East Asia. I ponder what if *Rome* had productively crossed to America. What if they could have had machines or guns?\n\nMy worries go deeper. My Grandfather loved knowing things and education. But he did not do. He was a business rep and went to night school to study law, but never went further than enjoying facts, reading books, watching programmes for knowledge. Never did he do any sort of research. He simply liked it. He was the sort of person who likes the top scale of the knowledge stratification; he would never go any deeper to create etc. I worry I am like that: Simply enjoying classics for the knowledge and not willing to go any further. I feel this is not a good enough reason to pursue a career as a classicist as I am not won’t have the same extreme passion as my colleagues. \n\nI must take a step back. I am an undergraduate, studying the classics already. These concerns might have something to do with the fact I am yet to find m specific specialism and so my real, specific is yet to be discovered.  Furthermore, I have another justification for my alignment with classics, a pure, wonderful reason but one that I worry I have no proper conviction for: holding an object once possessed by someone two-thousand years ago, one feels an unbelievable, personal connection with them. How you can traverse such a wide gap of time, mindset, culture through researching, as far as possible, the provenance of the object is mind-bogglingly awesome. The unfortunate thing about that reason is I seem to forget it quite often. I didn’t use it when writing my piece for entrance to university. \n\nI would be very happy if I just had that reason for connecting myself with the classics. \n\nAny advice? ",
        "created_utc": 1534023423,
        "upvote_ratio": ""
    },
    {
        "title": "8 Funded PhD Positions in law at the University of Luxembourg (PhD Scholarships)",
        "author": "scholarshipocean",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96givd/8_funded_phd_positions_in_law_at_the_university/",
        "text": "[removed]",
        "created_utc": 1533993890,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with Papers to Bookends",
        "author": "Digirati99",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96gdoe/need_help_with_papers_to_bookends/",
        "text": "I’m trying to export my papers collections to Bookends. When I follow instructions posted on Bookends website (SonnySoft) I keep getting a “Papers 3 did not send papers” error message when I go to execute the import function. HELP",
        "created_utc": 1533992453,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] Reddit users who have lost parents at a young age, what is the most important advice they gave you before they left?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96f7sm/serious_reddit_users_who_have_lost_parents_at_a/",
        "text": "[deleted]",
        "created_utc": 1533977425,
        "upvote_ratio": ""
    },
    {
        "title": "How Many Hours a Week Do You/Should One Work On Their Dissertation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96f65q/how_many_hours_a_week_do_youshould_one_work_on/",
        "text": "[deleted]",
        "created_utc": 1533976765,
        "upvote_ratio": ""
    },
    {
        "title": "how long is a postdoc in the US?",
        "author": "labpenguin",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96e9l1/how_long_is_a_postdoc_in_the_us/",
        "text": "Hello!\n\nI am a PhD in cancer biology and moved to the US for a postdoc. I found that in my new lab postdoc projects (time until publication) tend to be very long, some more than 7 years, minimum I've seen is 5. Is this something particular about this lab because they only want to publish in top journals, or is this common in the US? How long would you say it takes for the average postdoc in the field of cell biology/cancer research?\n\nthanks for your input!",
        "created_utc": 1533965442,
        "upvote_ratio": ""
    },
    {
        "title": "When does my bachelor's degree \"expire\"?",
        "author": "chunkykitty",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96dq0x/when_does_my_bachelors_degree_expire/",
        "text": "I earned a bachelor's of science in neuroscience in 2013. For 2 years as an undergrad and 2 years post-grad I worked in academic wet labs.  Since about 2015 I've been working in an unrelated non-academic job (at a humane society for dogs/cats and briefly as a vet tech) because I wanted to explore other interests.\n\nI'm having a quarter- life crisis.  I can't afford to go to graduate school right now. But at what point will my undergrad degree just not count anymore? Do I have a chance at being accepted into a grad/PhD program in my 30s, or starting some kind of academic research career?\n\nEdit - spelling",
        "created_utc": 1533959774,
        "upvote_ratio": ""
    },
    {
        "title": "Switching Fields - What should I do to catch up?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/96cifj/switching_fields_what_should_i_do_to_catch_up/",
        "text": "[deleted]",
        "created_utc": 1533948395,
        "upvote_ratio": ""
    },
    {
        "title": "What do you wish you had known before taking on students?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/969525/what_do_you_wish_you_had_known_before_taking_on/",
        "text": "[deleted]",
        "created_utc": 1533923139,
        "upvote_ratio": ""
    },
    {
        "title": "How to go about keeping in touch with past professors",
        "author": "Daytona_Flux",
        "url": "https://www.reddit.com/r/AskAcademia/comments/968mz5/how_to_go_about_keeping_in_touch_with_past/",
        "text": "To give some perspective to help with your answers;\n\nI am currently about to be in my 3rd year of a Chemistry major at a U.S. university.  I am still on the fence about going for a Phd program, but I am open about applying for a masters. \n\nI just don't want it to seem forced or awkward on the professors.  I feel like I need some \"ice-breakers\" just to start off the conversation and hopefully I can go from there",
        "created_utc": 1533919766,
        "upvote_ratio": ""
    },
    {
        "title": "Affordable Continuing Ed. Courses in NYC?",
        "author": "NervousTumbleweed",
        "url": "https://www.reddit.com/r/AskAcademia/comments/967tw5/affordable_continuing_ed_courses_in_nyc/",
        "text": "Basically just the title. Are there any programs out there that offer more affordable courses? Everything is just so damn expensive.",
        "created_utc": 1533914341,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best way to reach out, and keep in contact, with faculty from another uni as an undergrad?",
        "author": "realmrfaceman",
        "url": "https://www.reddit.com/r/AskAcademia/comments/967si8/whats_the_best_way_to_reach_out_and_keep_in/",
        "text": "So I'm heading into my sophomore year of undergrad and I want to pursue a career in academia, which from what I understand is an up-mountain battle, and I'm at peace with that. I already have a really solid idea of the type of research I want to be a part of and conduct, so I want to start getting to know people that run labs relating to my interests. If the professors whose lab I think I may want to work in for grad school email me back, I want to keep in touch with them so when the time comes, I'm better prepared for what they'll be like as an advisor and they'll be more comfortable taking me as a student. I've seen a lot of sites recommend keeping in touch with old professors by emailing them articles relevant to them every now and then, emailing them congrats on papers they've published (with specific things from the paper to make it more than a \"nice job, that's all\" kind of email), and things like that. Would doing those same things with a professor whose lab I'm interested in work or would I come off the wrong way? Thanks in advance, I appreciate any and all responses!",
        "created_utc": 1533914068,
        "upvote_ratio": ""
    },
    {
        "title": "How do I stay sane in academia?",
        "author": "SleeplessInSparta",
        "url": "https://www.reddit.com/r/AskAcademia/comments/967lhp/how_do_i_stay_sane_in_academia/",
        "text": "Hi everyone,\n\nI am about to start my master's degree and plan to continue with a PhD and go into academia. \n\nI've heard a lot about how mentally taxing a career in research can be. What are some things I can do now to prepare myself for that? What do you wish you would have done or realised sooner? How do I keep my passion for science alive and don't let it get ruined by the harsh circumstances of an academic career? \n\nI want to work and learn 24 hours a day right now but also know dangerous it is to define yourself solely through the research you do. How do I not burn out but achieve things at the same time? \n\nI'm looking forward to hearing your experiences, thanks :) ",
        "created_utc": 1533912725,
        "upvote_ratio": ""
    },
    {
        "title": "Recent grad: how do I leverage Co-authorship in top Journal",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/967agn/recent_grad_how_do_i_leverage_coauthorship_in_top/",
        "text": "[deleted]",
        "created_utc": 1533910528,
        "upvote_ratio": ""
    },
    {
        "title": "How to find a postdoc in the humanities?",
        "author": "beaniebeanbean",
        "url": "https://www.reddit.com/r/AskAcademia/comments/965vn4/how_to_find_a_postdoc_in_the_humanities/",
        "text": "What are some tips and strategies for finding a postdoc in the humanities? Some specific questions I have (but please give me all the unsolicited advice!): \n\n* Is there an international database of post docs to search? (I know of some, vaguely, that are lumped in with funding opportunities)\n* If you didn't find your postdoc by searching a database, how did you find your postdoc?\n* What should I be looking for in a good postdoc?\n* What should I be avoiding? What are warning signs?\n* Is there a hierarchy of what's more important, i.e. location, supervisor, institution, fund?\n\nThanks for your help everyone!",
        "created_utc": 1533898125,
        "upvote_ratio": ""
    },
    {
        "title": "Professors of reddit, when you tell a student to draft their own letter of recommendation and make \"small edits\", what do you actually change?",
        "author": "strictlypersonal",
        "url": "https://www.reddit.com/r/AskAcademia/comments/963re4/professors_of_reddit_when_you_tell_a_student_to/",
        "text": "",
        "created_utc": 1533874880,
        "upvote_ratio": ""
    },
    {
        "title": "How to know when you're overreaching, when not coming from a top uni.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/963h0f/how_to_know_when_youre_overreaching_when_not/",
        "text": "[deleted]",
        "created_utc": 1533872310,
        "upvote_ratio": ""
    },
    {
        "title": "Immunohistochemistry Lab Question",
        "author": "midnitetots12",
        "url": "https://www.reddit.com/r/AskAcademia/comments/962nqx/immunohistochemistry_lab_question/",
        "text": "Sorry for the random question, but I'm an undergrad in a lab right now. I'm doing a lot of IHC, and I noticed there's a lot of time waiting in between. I feel like I burn through a hell of a lot of gloves since I just do one step wait do one step wait and whatnot. I was wondering if this was normal. ",
        "created_utc": 1533865408,
        "upvote_ratio": ""
    },
    {
        "title": "Went into industry and I HATE it",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/962edk/went_into_industry_and_i_hate_it/",
        "text": "[deleted]",
        "created_utc": 1533863265,
        "upvote_ratio": ""
    },
    {
        "title": "Paying for a Coursera certificate to include in my CV",
        "author": "RaikiaR",
        "url": "https://www.reddit.com/r/AskAcademia/comments/960ag0/paying_for_a_coursera_certificate_to_include_in/",
        "text": "Hi! I'm a psychology student interested in cognitive neuroscience. I was wondering if getting a Coursera certificate would be great to include in my CV or if I would be throwing away my money, because I can still access the lessons without paying. \n\nCoursera is a platform where universities like Yale, Michigan, Stanford... offer virtual education. The course I will be taking is in collaboration with Duke University. \n\nThank you in advance! ",
        "created_utc": 1533847598,
        "upvote_ratio": ""
    },
    {
        "title": "I'm writing a cover letter to apply for a job at my university as an undergraduate classroom assistant for Introductory Physics. Does anyone mind reviewing it? It's very short. I have more details and the letter itself below.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9607o6/im_writing_a_cover_letter_to_apply_for_a_job_at/",
        "text": "[deleted]",
        "created_utc": 1533847047,
        "upvote_ratio": ""
    },
    {
        "title": "22 years old with no ACT/SAT: Best way to approach getting into college?",
        "author": "lovepirate69",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95z7di/22_years_old_with_no_actsat_best_way_to_approach/",
        "text": "At 22 I've never applied to college or taken either exams (plans were 100% to join the military but was found medically unfit, been loafing around since). The only kind of college credit I have/had was scoring a 3 on a couple of AP History exams during high school. I finished with a 3.5 GPA as well.\n\nI'm planning on taking one of the exams, but my concern is how colleges may view a four-year break on my application. Would my AP exam scores still be valid? Should I expect to be able to get into anything above community college at this point or should I start there? Any advice would be appreciated.",
        "created_utc": 1533840398,
        "upvote_ratio": ""
    },
    {
        "title": "How do I make sure that only my first name is used during citations? What are the consequences of using only my first name?",
        "author": "SameBunch",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95xy1m/how_do_i_make_sure_that_only_my_first_name_is/",
        "text": "Hi there. \n\nI am from Bangladesh and I have a very common Muslim name. My last name is even more extremely common. I am a PhD prospect and I have started writing research papers primarily in the field of business, economics and finance. I am also writing non-academic work of literature. All these works would be published outside Bangladesh in a Western country, whether that's an online website, foreign publisher etc. \n\nI would like to be known only by my first name. I cannot change my last name since that would entail going through extreme amounts of red tape and might cause serious problems in my life now or later on. Name change also requires citing reasons and some reasons are not thought well off. I will not go into details on why legal name changing is not possible. \n\nAnyways, my question is: How do I make (or at least maximize my chances) that I am known by my first name only in all of my works? By work, I mean conference proceedings, lectures, meetings, academic publishings etc. Basically all things academia. \n\nSecondly, what are all the negative consequences I should be aware of? For example, not getting credit, universities not recognizing that the works were mine since they do not correspond to my legal name (yikes!) etc. ",
        "created_utc": 1533832026,
        "upvote_ratio": ""
    },
    {
        "title": "Reviewing Manuscripts: helping non-native speakers with writing clarity",
        "author": "puddleduckjerry",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95xolu/reviewing_manuscripts_helping_nonnative_speakers/",
        "text": "Hi all, \n\nI'm reviewing a manuscript by native German speakers writing in English. This is for a trade journal in the earth sciences. The MS is generally good, but the writing lacks clarity and needs to be more succinct. I'm looking for general suggestions/approaches to help how I address this in the comments. I'm not looking to be a copy editor, but the journal will not provide one either. \n\nMostly, I want to be useful, but not over-step my role as a reviewer. Thoughts? \n\nThx.",
        "created_utc": 1533830279,
        "upvote_ratio": ""
    },
    {
        "title": "Scholarly Journals to follow, and platforms for following them?",
        "author": "pop_philosopher",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95x10e/scholarly_journals_to_follow_and_platforms_for/",
        "text": "I hope this isn't too redundant of a post, but I couldn't find exactly what I was looking for in a search. Essentially I'd like to know what journals you all think are worth keeping a regular eye on. Mainly I'm interested in philosophy (especially political phil), political science (especially international relations), law, and economics. But I also often find articles in psychology, sociology, criminal justice, history, and media studies relevant to my interests. Feel free to through in journals like for any discipline though, as it can't hurt to know what other fields pay the most attention to. \n\nI have a jstor account of course, but that's not so great for current publications as much as past ones. I also have a Philpapers accounts and I get emails about recent publications in my areas of interest, so if there are similar platforms that you guys like let me know. Ideally I'm looking for free platforms. \n\nedit: My level of education is currently undergraduate with a BS in Politics, Philosophy, and Economics and I intend to pursue a post-graduate degree in Philosophy. I can understand most articles in political science and philosophy but I don't have as much experience in economics (and almost no experience with econometrics).  \n\nAny responses would be appreciated and I thank you in advance! Hopefully we can get a good thread going. ",
        "created_utc": 1533825874,
        "upvote_ratio": ""
    },
    {
        "title": "How do I write a backdated Medical withdrawal Petition letter?",
        "author": "thr02waway",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95wpnt/how_do_i_write_a_backdated_medical_withdrawal/",
        "text": "https://www.reddit.com/r/AskAcademia/comments/8v79mg/i_didnt_write_my_deferred_final_exams_due_to/\n\nI posted my situation here last month and I received a lot of helpful advice. However, when it comes to writing the actual letter I still have no idea how to even start it. All I have is a bunch of unorganized fragments of sentences. I am feeling so frustrated, because I don't know where to begin or what to say first. \n\nIf anyone has written one before can you please help me get started or give me an advice on how to format it? \nThank you ",
        "created_utc": 1533823516,
        "upvote_ratio": ""
    },
    {
        "title": "How to start a thesis/academic article?",
        "author": "Shownkindness",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95wizg/how_to_start_a_thesisacademic_article/",
        "text": "Hello!\n\nI am still working on my undergrad degree, but I want to start working on my thesis. My plan would be to have two thesis written when I apply for grad school in hopes it will give me a boost. I am finishing my associates this year and have my 4-year school already lined up. I know to some this may seem really early to even think about this, but I don't plan on writing something that will be published. This is mostly to show that I am passionate about my education and my field of study (Environmental Sciences). \n\nMy question is where do I start and are there any guides online to help me step by step in a way. I plan to ask one of my professors, but also want something I can look at on my own because he does get busy later in the year.",
        "created_utc": 1533822084,
        "upvote_ratio": ""
    },
    {
        "title": "Choosing between 3 seemingly similar courses",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95w37o/choosing_between_3_seemingly_similar_courses/",
        "text": "[deleted]",
        "created_utc": 1533818479,
        "upvote_ratio": ""
    },
    {
        "title": "UPDATE: Surviving a volatile coauthor",
        "author": "elcaballitico",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95w2c2/update_surviving_a_volatile_coauthor/",
        "text": "So a few days ago I made [this post](https://www.reddit.com/r/AskAcademia/comments/94w8k2/surviving_a_volatile_coauthor/) about trying to finish a paper alongside a more senior, bullying coauthor.  Long story short, she assailed me with accusations about trying to force her out of the project, when I was just trying to do a pretty standard job.  I finally told my PI about it, and wanted to share his response.  It was a very delicate professional situation and I was impressed with how he handled it.   \n\n\nI asked to meet with him and gave him my spiel.   My main goals of the conversation were to 1) counter any bad narrative coauthor might have given 2) ask for PI to act as a buffer if/when we get stuck in reviewer hell, and 3) openly describe coauthor's manipulation tactics in case other people encounter them later. After I was done, he said \"OK.  Well, if this actually is bullying, then unfortunately this is not the last time you will have to deal with it.  So let's talk about how to handle professional bullies.\" Leading this conversation this way let us talk about what happened with a thin cover of \"hypothetically speaking\" that meant PI did not have to say anything bad about coauthor.  PI pointed out that one evasion tactic I never tried was to calmly leave the room, especially after enduring a token amount of verbal abuse.  The must blunt thing he said in the conversation was \"I know \\*\\*you\\*\\* can do this assignment by yourself. You should not reward people who treat you badly, or they will learn that's how they can get what they want.\"  He also subtly indicated that he did not believe this narrative from my word alone, but because he had more sources of information that corroborated my story.  Fortunately, we are at the point on the project where PI can engineer things so coauthor and I do not have to work together behind closed doors, which was the main thing I wanted to get out of the conversation. ",
        "created_utc": 1533818274,
        "upvote_ratio": ""
    },
    {
        "title": "Self-citations and double blinding (How to cite under review?)",
        "author": "MrLegilimens",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95vyzk/selfcitations_and_double_blinding_how_to_cite/",
        "text": "From what I've read, if the sentence reads:\n\n&gt;Prior research in area Y shows this result (/u/MrLegilimens, 2015).\n\nThere's no need to blind that. Anyone could have written that.\n\nThis is in comparison to:\n\n&gt;We have found in prior research in area Y that this result holds (/u/Mrlegilimens, 2015). \n\nHere, you'd want to sub in /u/MrLegilimens for something like XXX or \"authors\", until the review stages are done.\n\nBut I can't find a rule of thumb for this:\n\n&gt;Prior research in area Y shows this result (/u/MrLegilimens, under review). \n\nOn one hand, anyone could have written that (it's not saying it's MY work, just prior work). On the other hand, if it's under review, how else would I have access to the work unless it was my own? ",
        "created_utc": 1533817472,
        "upvote_ratio": ""
    },
    {
        "title": "With a PhD (UK) improve my chances of emigrating to USA or Canada...",
        "author": "ThePersonof21",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95uqqa/with_a_phd_uk_improve_my_chances_of_emigrating_to/",
        "text": "I am researching as much as I can about doing a PhD as well as listing universities to choose from (UK, Canada and USA). I am going to start my Master's in Computer Science next month.\n\nI would like to do a PhD in Canada or USA, but I understand that the application process can be harder as an international student.\n\nSo, in case I have to settle for a UK PhD (and thus complete it), will my chances of emigrating to Canada or USA increase as an academic? \n\nUltimately, as you can already tell, I want to emigrate from the UK.",
        "created_utc": 1533804746,
        "upvote_ratio": ""
    },
    {
        "title": "Help me out with my proposed research! Trying to see how the race of actors in ads increase or decrease behaviour change",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95ubnu/help_me_out_with_my_proposed_research_trying_to/",
        "text": "[deleted]",
        "created_utc": 1533799648,
        "upvote_ratio": ""
    },
    {
        "title": "How much does the program title of a PhD matter?",
        "author": "s1147",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95u3ac/how_much_does_the_program_title_of_a_phd_matter/",
        "text": "Hey, I am planning to apply to several psychology PhD programs in the UK and US this year for Autumn 2019 entry, and I've noticed that a lot of universities have different titles for their PhD programs. My interests are in language and cognition within a developmental context so there are several labs that I am interested in that are placed within the experimental, developmental or cognitive programs (one is even a PhD in human development from the department of human ecology). \n\nI was wondering whether the title of the program would affect job prospects after PhD, for example, would I only be able to teach developmental courses if my PhD was in developmental psychology or human development? If so, which program do you think could potentially have the best job prospects upon completion?",
        "created_utc": 1533797015,
        "upvote_ratio": ""
    },
    {
        "title": "PhD program concerns: Australian vs. United States",
        "author": "justthrowMEaway002",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95tpsh/phd_program_concerns_australian_vs_united_states/",
        "text": "Hey all! Just as the title says, I'm (21 F) concerned about the varying differences from the two in terms of the type of thorough education I will receive since I want to participate in research in the behavioral neuroscience field (psychology).\n\nFrom what I've looked up, compared to U.S. PhD programs, the Australian PhD programs do not have coursework and go straight into being supervised and conducting a thesis.\n\nSo my questions are:\n\n1. Will the lack of breadth in coursework in the Australian PhD program leave me disadvantaged for research, especially if I were to go back to the U.S. to participate in research?\n2. I read that in Australian PhD s programs,  the responsibility to keep up-to-date with literature would be on the student. How do these students keep up to date without having to endlessly sift for the most prominent research, compared to the prepared coursework Americans would receive in the U.S.?\n\nThanks everyone, and forgive my ignorance on the topic. Please correct me if I'm looking at this completely wrong.\n\nEdit: Thank you for the quick responses! I could definitely use more comments even if you're not in the field to get your opinion on the differences.",
        "created_utc": 1533792879,
        "upvote_ratio": ""
    },
    {
        "title": "Negotiating a post-doc salary (Australia)? Is it even possible?",
        "author": "Dr_poop_PhD",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95t539/negotiating_a_postdoc_salary_australia_is_it_even/",
        "text": "I am at the end PhD (just waiting on some administrative stuff to go through) and on post-doc job market in Australia. I find myself in the somewhat unusual spot of having multiple formal post-doc offers from a couple of different universities. I was wondering if anyone had experience negotiating their post-doc salary (particularly in Australia, but advice from anywhere is helpful)? The offer that I am leaning towards is slightly lower in pay than my top offer. I was hoping to be able to use this to my advantage and negotiate it up a bit, but I'm not sure how negotiable these things are. They are both at the same pay group/level, but one is at a higher starting step than the other.  Are these things negotiable? ",
        "created_utc": 1533787157,
        "upvote_ratio": ""
    },
    {
        "title": "P&amp;G FIRST conference experience for a CS PhD",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95rty6/pg_first_conference_experience_for_a_cs_phd/",
        "text": "[deleted]",
        "created_utc": 1533775706,
        "upvote_ratio": ""
    },
    {
        "title": "Proofreading/ advice on dissertation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95rk1x/proofreading_advice_on_dissertation/",
        "text": "[deleted]",
        "created_utc": 1533773511,
        "upvote_ratio": ""
    },
    {
        "title": "Short novels featuring any city very well",
        "author": "matterlandsen",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95qrzt/short_novels_featuring_any_city_very_well/",
        "text": "Hi,\n\nI'm teaching a class about Nation/Place Branding for undergrads, however and due to the big number of students that I have this semester I needed to change a little bit the syllabus, so I'm looking for any short novel that features any city in a good deep way so I can later make a reading control. They need to be able to distinguish key/iconic aspects of the city that the author used so the reader imagines the place while reading.\n\nAny suggestions on titles?",
        "created_utc": 1533767450,
        "upvote_ratio": ""
    },
    {
        "title": "Second Time with Grad School-- Help with Statement of Purpose",
        "author": "agradschoolthrowaway",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95qmnj/second_time_with_grad_school_help_with_statement/",
        "text": "I've been lurking on here for a while to see if I can get some help with a problem I've been having and I decided to go ahead and see what kind of feedback you all might be able to give. \n\nI'm currently applying for a STEM PhD program and I'm having difficulty explaining why I previously attended at another university and did not graduate. I am an NSF recipient, my first experience was at at top R1 university. \n\nMy decision to leave the first time was based on several things that had happened to me and taking some time off was 100% the best choice for me at the time. The school that I went to was very cut-throat and had evidently admitted far too many students than they had spaces for. The professor I moved to the university for went emeritus very unexpectedly during my first semester. The only other lab that had spaces was grossly underfunded and the professor that I worked for was was being sued by a former student on some pretty legitimate grounds. This professor was quite honestly the worst human being I've ever met-- after I got my fellowship, he told me that I didn't deserve it and to give it back. After I told him I wouldn't, he started putting me on dead-end projects with no funding and once I made progress, he handed them off to his other more favorite students. I eventually decided to switch groups after I was point-blank told that he was publishing the research I was solely working on for three years and giving authorship to another student and my name would not be listed as an author. Sure enough, the paper was published this spring. \n\nI tried to leave to find another professor, but the damage was done. I was a mental wreck. It got so bad that I was having full-on nervous breakdowns. At this time, I also had discovered that I had essentially chronic mono and was in and out of the hospital for nearly a year. A master's degree was not an option, despite finishing all of my classes, because I had \"no research\" to put on a thesis because it was constantly taken from me, even though I had the notebooks. I tried to take the case all the way to the dean of students but my professor was the chair of the department at that time and he had too much pull. \n\nI moved back home, got a job as a product developer in manufacturing. I feel pretty stunted, I like what I do, but I keep getting told that I don't have enough experience and I don't have a degree so I have to assist other people who hold only BS degrees. So, I've decided to try grad school again. \n\nI tried one round of applications last spring but I didn't properly fill in the gaps on my statement of purpose. I do know that the field I work in is small enough that if I tell the story, it will probably get back to this professor. I have no intention whatsoever to contact this former professor so I don't have his letter of rec and it makes my application look suspicious. I recently spoke with a professor at a local university who was very understanding and would love to work with me next semester. He was pretty adamant that I needed a very good case for the rest of his admissions committee and I feel stuck. \n\nAny advice about telling this story in such a way that doesn't make me look suspicious to an admissions committee? ",
        "created_utc": 1533766340,
        "upvote_ratio": ""
    },
    {
        "title": "Just got a JoVE request",
        "author": "Siberet",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95pq3y/just_got_a_jove_request/",
        "text": "My sister (she doesn't reddit) got a request from JoVE to use one of her papers to make a video article. Is this legit? Browsing their journal it seems to be subscription based. Will her work be taken advantage of? ",
        "created_utc": 1533760074,
        "upvote_ratio": ""
    },
    {
        "title": "Is graduating undergrad in 3 years a negative on grad school applications?",
        "author": "academiaq792",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95pgjw/is_graduating_undergrad_in_3_years_a_negative_on/",
        "text": "Here is my situation:\n\nI was advanced 2 years in grade school, so I’ve just finished high school in May at age 16. In high school I took various AP and community college classes, which gave me 32 credit hours at the university I’m starting at this fall. As a result, I technically have sophomore standing and only a couple of gen-ed requirements left to fill.\n\nI am majoring in (sociocultural) anthropology and plan to pursue my studies up to a PhD. It’s something I’ve really reflected on a lot, and after years of interest in the field and assisting in anthro research this summer, I’ve become positive that this is what I want to do.\n\nDue to the college credits I accrued in high school, I am on track to graduate in 3 years with no cramming required to do so. This would be a huge financial help to my family, as I’m required to pay $10k per year and we really don’t have much money to begin with. This combined with the fact that it wouldn’t involve any extra academic stress on my part makes me very much inclined to do so.\n\nHowever, I’m worried that graduating early will look bad on grad school applications. My university is an R1 school and not many undergrad students get involved in anthropology research, so I’ll have research assistantship opportunities from freshman year. Second and third year undergrad students are also frequently accepted to TA anthro classes, which I plan on applying to do. Students typically complete their capstone research project in either their junior or senior year, so completing it in my 3rd year shouldn’t be abnormal or exceptionally difficult. With all of this considered, I’m still just mainly worried that perhaps I will appear too rushed and hurried on grad school applications for completing undergrad in 3 years. Does such a stigma actually exist or is it just my paranoia?\n\nThe other main thing worrying me is my age. If I graduate in 4 years I’ll already be 20 at graduation, but if I graduate in 3 I’ll be even younger at 19. When I mentioned this in a meeting with the head of the anthro department, she suggested that perhaps I could devote a year or two to research/fieldwork after undergrad and then apply to grad schools, so a) I’ll be a normal graduating age if that’s what worries me and b) my application will be strengthened.\n\nSo basically, my three main questions are: 1) Does finishing undergrad in 3 years look bad in any way? 2) Would my age strictly be a negative factor if I graduated and applied to grad schools at 19? and ergo 3) Would it be a good idea if I graduated in 3 years to dedicate a year or two to research/fieldwork instead before applying to grad schools?\n\nMany thanks in advance to anyone who can offer any insight!",
        "created_utc": 1533758299,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any downsides to study software engineering in distance modality?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95p3ry/is_there_any_downsides_to_study_software/",
        "text": "[deleted]",
        "created_utc": 1533755947,
        "upvote_ratio": ""
    },
    {
        "title": "Question: Can someone explain to me how teaching philosophies, beliefs and values can inform educational practice?",
        "author": "stoosepp",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95osn1/question_can_someone_explain_to_me_how_teaching/",
        "text": "I'm a PhD candidate in the learning sciences, and the idea of justifying instructional strategies based on my beliefs and values around teaching seems like a strange and outdated idea to me. We have over 100 years of research informing us how students learn, what is effective teaching and learning strategy and how to apply these strategies in meaningful ways.  \nInstead of speaking about our teaching philosophy, teaching values or beliefs, shouldn't we be talking instead about our understanding of learning itself and how this informs our practice as educators?  \nI realize that Teaching philosophy statements and teaching values and beliefs are informed by what we have learned through research, but I worry that these terms reinforce a vague and blurry approach to teaching that moves us away from what we know to be beneficial to learners. Should we be choosing technology integrations or instructional strategies based on our personal beliefs, or on established models and evidence from research? I guess my question is, why do we need teaching values and beliefs, if we can just look up pretty objective answers in the literature?  \n\n\nI'd welcome input from this community and any articles / books that speak to these issues. ",
        "created_utc": 1533753908,
        "upvote_ratio": ""
    },
    {
        "title": "“Publish or perish” fear",
        "author": "squish314",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95oml2/publish_or_perish_fear/",
        "text": "So I recently heard this phrase. I’m starting a clinical grad program (PsyD) and I was wondering if this is true in more clinically-driven fields as well? \n\nThanks!!",
        "created_utc": 1533752811,
        "upvote_ratio": ""
    },
    {
        "title": "Resources for learning Python libraries: PANDAs, MatPlotLib, NumPy?",
        "author": "NervousTumbleweed",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95oicl/resources_for_learning_python_libraries_pandas/",
        "text": "Does anyone know of decent resources for learning these libraries? I'm familiar with python, but I'm a bit lost as where to start, and the youtube series I normally use is not helping.",
        "created_utc": 1533752051,
        "upvote_ratio": ""
    },
    {
        "title": "How to tell your department chair you are leaving?",
        "author": "knsound",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95ngra/how_to_tell_your_department_chair_you_are_leaving/",
        "text": "My husband and I recently had a baby and it really made us re-evaluate our lives and priorities.   Currently we live in a city where we have no friends or family - the one where we did our post-grad training.  I am a relatively new junior faculty in my department and stayed because I became friends with my department chair.  At first I thought the idea of working in academics to be incredibly interesting - working with students, writing manuscripts, etc.  However, even before having my kid, I've noticed my enthusiasm and job satisfaction from  above to be decreasing rapidly, and the stress of never truly being \"off work\" to be increasing.  I found myself bombarded by e-mails even during maternity leave.  My department chair has been very supportive, but I don't like to complain.  To make things worse, the department is running very lean right now, so I would be leaving them in a tough spot, but I don't know if they will ever be fully staffed in the next 2 years.\n\n\nIn short, I don't think the academic world is something that can make me happy (in fact it's making me miserable) and I really want to prioritize my family by moving into the private sector and back to family/friends.  \n\n\nMy department chair is probably one of my closest friends in this city (not saying much), and I don't know how or when to present this?  \n\n\nDo I bring in my personal life (I know it is kind of an unwritten rule not to)? - this is the primary reason I want to make a career change, but the fact that I am growing to dislike academia is also a large part.\n\n\nDo I wait to find a job in the private sector before letting her know?  The issue with this one is my field of interest is relatively small with many in the private sector and academia that talk.  Many private sector jobs also ask for references.   I definitely do not want to burn any bridges.\n\n\nI want to leave after this academic year just to make the break clean and for other personal reasons (husband's job), but when should I let my department chair know?",
        "created_utc": 1533745167,
        "upvote_ratio": ""
    },
    {
        "title": "So lost with my literature review and I need some help, please!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95n32k/so_lost_with_my_literature_review_and_i_need_some/",
        "text": "[deleted]",
        "created_utc": 1533742653,
        "upvote_ratio": ""
    },
    {
        "title": "Differences between undergraduate and master's experiences (UK Universities)",
        "author": "xotedd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95myz3/differences_between_undergraduate_and_masters/",
        "text": "I completed my undergraduate degree this summer in Biology and I will be starting my master's next month. I'm wondering what the differences are between undergrad and master's in terms of the academic difficulty and expectations, class sizes, average weekly schedule, etc. I know a lot of this will be very dependent on the specific university but I would just like a general insight please. :)\n\nThank you",
        "created_utc": 1533741878,
        "upvote_ratio": ""
    },
    {
        "title": "How can I make myself a better candidate for teaching-focused academic jobs?",
        "author": "spec_of_cp",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95mkxn/how_can_i_make_myself_a_better_candidate_for/",
        "text": "I'm just starting the fourth year of my PhD in Cognitive Science \n and I'm starting to think about what kind of job I want (and I'll already be on the market next year! Scary!). I always thought I would want to go down the typical route of getting a TT job at a research university, but over the last couple years I've discovered that I absolutely LOVE teaching and might want to go into a more teaching-focused job. I know most of these are at SLACs, which I have very little experience with because my undergrad was a large state school and I'm currently at a private research university. So I have no idea what I should do to prepare best!\n\nHere's some basic info about me, teaching and research-wise:\n\n* My field is psycholinguistics and I do web-based behavioral experiments. My work is very cheap and quite amenable to undergraduate research. This should be a pro for SLACs, right?\n\n* I've TAed 3 classes, one of which was a graduate course that was very hands-on (I taught programming labs). \n\n* Due to some very, ah, unique circumstances, the class I TA'ed last year was a total disaster and I ended up running most of the logistical end as well as interaction with students outside of lectures (I had a lot of people in my office hours all the time!). I knew I liked teaching before this, but this is when I really started feeling like I could make an impact on students. Later that year I received a teaching award for this. I also received a fellowship for this year based on some combo of research/community outreach/teaching and I'm told mentoring undergrads was a big part of my getting this.\n\n* This fall I'm co-instructing the introductory course in my field, taking on about 30% of the lectures and leading the team of TAs (which are all undergrads from the course last year, I'm happy to have them again :)).\n\nWhat else can I do to prepare myself for a teaching job? I know a big focus of applications is teaching philosophy, and while I feel like mine is starting to develop, I don't really know how to nurture it.",
        "created_utc": 1533739285,
        "upvote_ratio": ""
    },
    {
        "title": "Positive experiences with PhD/Academia?",
        "author": "ZanyZeugma",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95lhqb/positive_experiences_with_phdacademia/",
        "text": "Hi! \n\nI'm a grad student, planning on doing a PhD. Whenever I tallk to my friends who do/have done PhDs they often tell me the experience made them miserable. Most of them abandoned the project of an academic career afterwards. Likewise, my Facebook feed is saturated with with those \"Shit Academics Say\" types of pages, rife with self-deprecating humor and grim jokes about depression and burn-outs.\n\nI guess my question is: Is it really all there is? I think I need to hear more positive experiences as well so that I can have a more balanced view of what academia entails, especially during the precarious PhD years.",
        "created_utc": 1533730677,
        "upvote_ratio": ""
    },
    {
        "title": "Hoping to go to graduate school. What do history departments look for?",
        "author": "throwawayhistoire",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95khhz/hoping_to_go_to_graduate_school_what_do_history/",
        "text": "I'm finishing up my Bachelors. When I'm done, CGPA will likely be 3.1-3.2, while my major GPA will be around 3.5-3.6. My CGPA is lowered by a few math classes I did poorly in that was part of a second major I have now decided to drop. Without them, my CGPA would be closer to a 3.3. There's no real trend visible in my grades over 4 years. Some semesters I do a 2.7, others I'll do close to a 4.0. My upper level 300/400 history courses are solid at a 3.8 average, and I'm the only non honors student that was allowed to do an honors thesis in the department after intercession from the department head.\n\nDo history departments generally put more stock in major GPA? I'll also have my senior history thesis completed and defended by this point, and have strong personal relationships with several prominent historians in my department, so good letters of rec won't be an issue at all.",
        "created_utc": 1533720139,
        "upvote_ratio": ""
    },
    {
        "title": "Can you get Undergraduate Scholarship for Japan if you are older than 22 and already have a bachelor?",
        "author": "SoulKingBrook7",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95k85i/can_you_get_undergraduate_scholarship_for_japan/",
        "text": "I was looking into the scholarships for Japanese universities but due to my bachelor grades not being good enough and my subject was not related to what i want to do (in my country there wasn't choice for that) i am thinking of another way, even if there are scholarships that don't pay much attention to the grades i still want to know if this is possible. \n\nExcluding the MEXT scholarhsip where limits for undergraduate are 22 years old (i am 23 now), is it possible through one of the other scholarship systems to get an undergraduate scholarship even though you aren't really an undergraduate anymore? My high school grades were pretty good but my bachelor's degree grades weren't and together with the fact that my bachelor was unrelated to the subject i wanted to pursue it adds 2 barriers to get graduate scholarship or even to enter any graduate course the normal way.",
        "created_utc": 1533716933,
        "upvote_ratio": ""
    },
    {
        "title": "Career advice",
        "author": "ParadoxicalBud",
        "url": "https://www.reddit.com/r/labrats/comments/95hmfc/if_i_wanted_to_work_in_a_lab_setting_as_a_career/",
        "text": "",
        "created_utc": 1533692020,
        "upvote_ratio": ""
    },
    {
        "title": "How to \"let go\" or \"fire\" an unproductive paid undergraduate researcher?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95g8kz/how_to_let_go_or_fire_an_unproductive_paid/",
        "text": "[deleted]",
        "created_utc": 1533680241,
        "upvote_ratio": ""
    },
    {
        "title": "Why has sexual assault recently become such a central focus for academia?",
        "author": "Genedide",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95fqs9/why_has_sexual_assault_recently_become_such_a/",
        "text": "Headlines about presidents getting impeached over cover-ups, grad students gettting taken advantage of by mentors, and female students now seem more on-guard then ever in American universites.\n\nBased on these Title IX reports, there is a clear display of some sort of \"last straw\" that provoked a [*Skyrocket in Title IX Investigations*](https://projects.chronicle.com/titleix/) within the middle of this decade. \n\nWhat societal forces have caused this issue to ascend to the top of the platform in academia in 2010's?",
        "created_utc": 1533676752,
        "upvote_ratio": ""
    },
    {
        "title": "Best way to share thesis with advisor",
        "author": "_vfbsilva_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95fi2h/best_way_to_share_thesis_with_advisor/",
        "text": "Howdy, I'm writing my thesis  in latex and versioning it with bitbucket. I was wondering if there is a good way to share it with my advisor, like adding a cron job to mail it to him or something like that. He likes to do the annotations on the pdf so maybe just mailing is better but I need some insights.",
        "created_utc": 1533675115,
        "upvote_ratio": ""
    },
    {
        "title": "Do professional scholars travel to libraries?",
        "author": "HenryWu002",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95erui/do_professional_scholars_travel_to_libraries/",
        "text": "To any historians, critical theories, anthropologists, and other arts and social science scholars out there; do you ever/regularly travel to libraries outside your home town/institution? Obviously academic libraries are generally large and comprehensive, but even Ivy League libraries are eclipsed by the collections of the likes of the Library of Congress, or the British Library, so presumably there are significant numbers of books that just arent available at most university &amp; public research libraries. Do you then order the books, or do you physically travel to the Library of Congress, for example, and sit in their reading rooms?",
        "created_utc": 1533670233,
        "upvote_ratio": ""
    },
    {
        "title": "Writing a letter of rec for a professor",
        "author": "Cryptic_kitten",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95ep0m/writing_a_letter_of_rec_for_a_professor/",
        "text": "I was asked by one of my undergraduate professors to write him a letter of recommendation for a promotion. I just graduated undergrad so I am not really sure where to start. What sort of things should I include? How long should the letter be? ",
        "created_utc": 1533669713,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of having an opt-out organ donation system?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95egpy/what_do_you_think_of_having_an_optout_organ/",
        "text": "[removed]",
        "created_utc": 1533668142,
        "upvote_ratio": ""
    },
    {
        "title": "Academic rules of repurposing a book chapter into a journal article? Where is the plagiarism line?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95e6qa/academic_rules_of_repurposing_a_book_chapter_into/",
        "text": "[deleted]",
        "created_utc": 1533666319,
        "upvote_ratio": ""
    },
    {
        "title": "How feasible is traveling during a (STEM) PhD?",
        "author": "Zhaligkeer318",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95dr6q/how_feasible_is_traveling_during_a_stem_phd/",
        "text": "I have accepted a position in a very good PhD program (among the best in my field), and I'm totally committed to--even excited for--the hard work I know I'll have to do for the degree. However, I am currently in Europe on a pre-gradschool vacation and I am being reminded daily of how much I *love* travelling.\n\nWhat are the options, if any, to be able to get out of my country (the US) during my PhD? Possibilities I've considered:\n\n-Visiting scholar programs seem difficult to justify since my school will have basically every resource I could ever need\n\n-International conferences will be great (I will have a 'discretionary' fund for research-related travel), but they won't allow much time for exploring a city, going for a hike, etc.\n\n-I am willing to continue doing research work in another country and using nights and weekends for interesting travel activities (my program is known for reasonable work hours and I will be mostly computational), but I don't know how common it is for an advisor to be okay with remote work.\n\nI can accept if the answer is, \"you're gonna be pretty immobile for the next 5yrs,\" but I don't want to miss an opportunity if one exists. Thanks in advance!",
        "created_utc": 1533663423,
        "upvote_ratio": ""
    },
    {
        "title": "The correct terminology to describe races - Black/White",
        "author": "lilbearj",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95dm3m/the_correct_terminology_to_describe_races/",
        "text": "What is the correct (and most culturally sensitive) way to refer to Black and White ethnicities in an academic paper? I'm writing on Brown vs. Board of Education, and the article I'm referencing uses \"black\" and \"white,\" uncapitalized (published in 2014). I did a cursory google search and it seems like they should be capitalized (ie. \"Black\" and \"White\"). But is it better to use \"African-American\" and \"Caucasian?\" \"Black\" seems more inclusive than \"African-American,\" but I remember hearing that \"African-American\" was more politically correct for a time.           \nMy deepest apologies if this is in some way offensive - I am asking here on reddit so that I can avoid major offense elsewhere.\n\nThank you.",
        "created_utc": 1533662491,
        "upvote_ratio": ""
    },
    {
        "title": "Repository for articles",
        "author": "gusamarante",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95diyj/repository_for_articles/",
        "text": "I am looking for a way to organize articles and create a repository. Something that allows to search by tags / groups and make relations between papers and also store a PDF version of the article.\n\nI know about relational databases, like neo4j, but those are not very freindly.\n\nAny suggestions?",
        "created_utc": 1533661911,
        "upvote_ratio": ""
    },
    {
        "title": "Startup or Finish PhD? How to Resolve Conflict with PI and University?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95czko/startup_or_finish_phd_how_to_resolve_conflict/",
        "text": "[deleted]",
        "created_utc": 1533658229,
        "upvote_ratio": ""
    },
    {
        "title": "How confident were you in your skills when you applied for graduate studies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95csrp/how_confident_were_you_in_your_skills_when_you/",
        "text": "[deleted]",
        "created_utc": 1533656957,
        "upvote_ratio": ""
    },
    {
        "title": "how many interviews until offer",
        "author": "MischievousManor",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95bz1a/how_many_interviews_until_offer/",
        "text": "Applied to countless jobs, have had 5 interviews so far...US, UK and Australia\n\nTwo were very close, and no offers yet....at what point did you decide to give it a rest, or, re-evaluate strategy.\n\nI have learned a great deal through these interviews, more questions more time to refine answers.\n\nBut after no offers, I am feeling a bit down. And need to stay positive!",
        "created_utc": 1533651133,
        "upvote_ratio": ""
    },
    {
        "title": "Could you take a look at my resume? Undergraduate applying to research positions",
        "author": "fakefunfood",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95bgdt/could_you_take_a_look_at_my_resume_undergraduate/",
        "text": "I'm not sure if these types of posts are allowed here, but I'll try. I am an undergraduate transfer student and I will be a junior at my new university this fall. I have found some openings for undergraduate research assistants in the field of psychology. I don't have any research experience and little volunteer experience. I hope I didn't screw up too badly on this resume because Iv'e already sent it to a handful of labs. I just want to ask for some feedback on my resume, whether the formatting is alright and whether there is enough detail there. \n\n[here is my resume](https://imgur.com/a/zb11UoQ)",
        "created_utc": 1533647144,
        "upvote_ratio": ""
    },
    {
        "title": "A programme that can output a plot with embedded data table",
        "author": "redofthekin",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95ax73/a_programme_that_can_output_a_plot_with_embedded/",
        "text": "Our research group uses KaleidaGraph because our Prof is used to it but it kinda a hassle, especially if you have many plots to make. The saving grace of kgraph is that its output plot has a data table embedded in it. A double click of the plot in the ppt file will open the plot in kgraph with the embedded data table. It's useful for collating and distributing the plot (and hence embedded data) in a PowerPoint file.  \n\n\nSo is there a way to automate all this? Perhaps an output plot image file that is linked to a .txt or .csv etc? Or any other method is welcomed. I am familiar with mainly Python, but learning a new language is not a problem.\n\nThanks!",
        "created_utc": 1533642520,
        "upvote_ratio": ""
    },
    {
        "title": "Postdoc/Professorship and Grants",
        "author": "skydivingbigfoot",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95ap0i/postdocprofessorship_and_grants/",
        "text": "Hello all. I was discussing post-PhD options with an advisor when the topic of competitiveness came up. The most obvious point to me was publication record - and that makes sense to me. However, I was told that one's fundraising ability (i.e. grants) is also taken into consideration. My question is what is considered a competitive grant history? Is it dependent on how much you have earned total or by year? Is there a successful-to-fail ratio that I should be mindful in going ahead? Are larger single grants looked upon more favorably than a large amount from smaller ones? I am a first year PhD with a total of about $10,000 (USD) total in successful grants so far; however, I am more than willing to bet that that number needs to be bolstered before the next stage.  \n\n\nAlso, I am in a STEM field (research by day; grant writing and caffeine by night). ",
        "created_utc": 1533640302,
        "upvote_ratio": ""
    },
    {
        "title": "How can I support an overworked, unpaid instructor I really like?",
        "author": "thehabibiboy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95ak77/how_can_i_support_an_overworked_unpaid_instructor/",
        "text": "I'm an undergrad in a political science department and the amount of exploitation of these adjunct instructors is ridiculous. Underpaid, aren't given enough courses, part-time.. all while admins are making inflated salaries.\n\nSo all this being said, I really learned a lot from the class I took (probably one of the best courses I took while in college) and want to do something. How much power do students have? Should I email the director of the program?\n\nThanks for your time!\n\nedit: title should say underpaid",
        "created_utc": 1533638914,
        "upvote_ratio": ""
    },
    {
        "title": "What advice do you wish you’d have known prior to starting postgraduate study?",
        "author": "_SpionKopite",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95a2pv/what_advice_do_you_wish_youd_have_known_prior_to/",
        "text": "",
        "created_utc": 1533633448,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone had issues with Papers 3 for Mac that they fixed?",
        "author": "bitchwithacapital_C",
        "url": "https://www.reddit.com/r/AskAcademia/comments/959fzt/has_anyone_had_issues_with_papers_3_for_mac_that/",
        "text": "[removed]",
        "created_utc": 1533625848,
        "upvote_ratio": ""
    },
    {
        "title": "How to create a good impression in first email to a professor?",
        "author": "SalmanHaydar",
        "url": "https://www.reddit.com/r/AskAcademia/comments/958us9/how_to_create_a_good_impression_in_first_email_to/",
        "text": "Hi! I'm preparing for my Master degree. And my first choice of destination for my study is Canada. In most of the university there it's recommended to manage a supervisor before applying to research based master program. So I'll start emailing soon and want to make a good impression in my first email. So, **my question is what actually a professor look for in a student to filter out potential student? And what should i include in my first email to make a good impression?**\n\n(My intended program is **Computer Science**)",
        "created_utc": 1533619465,
        "upvote_ratio": ""
    },
    {
        "title": "How to graduate despite evaluation experiment impossible due to slow committee decision",
        "author": "Megafritz",
        "url": "https://www.reddit.com/r/AskAcademia/comments/958k8w/how_to_graduate_despite_evaluation_experiment/",
        "text": "I am supposed to graduate in 2 weeks from the IT department of a graduate school at a Japanese university (I am a foreigner here, but a regular student). My research deals with predicting Quality of Experience for multimedia applications by using EEG data (brainwave data). \n\nTo evaluate my method, I planned to conduct a small experiment with maybe 10 persons. This experiment needs to be approved by the ethical committee, so I asked my supervisor to send them the documents and he did so in march. They were supposed to answer to me 1 month ago but it was delayed due to bad weather in Japan. My supervisor told me that they would decide over it last week but then he followed up by telling me that they demanded revised documents.\n\nIt seems I have to deal with the fact that I can not test my method. The deadline is in 2 weeks and, according to the supervisor, can not be extended under any circumstances. My supervisors advice was to \"use public data\". However, I could not find any public EEG data which is even close to my research. How can I go from here? I already got a job offer, so I only need to graduate.",
        "created_utc": 1533616581,
        "upvote_ratio": ""
    },
    {
        "title": "Is mentoring undergrads a waste of time?",
        "author": "40percentoffallitems",
        "url": "https://www.reddit.com/r/AskAcademia/comments/958767/is_mentoring_undergrads_a_waste_of_time/",
        "text": "I've heard that mentoring undergraduates are a waste of time, but I've also heard that it's fruitful for graduate students since a good way to really know you know how to do something is to watch, do and teach. I've also heard the, \"who hate's free labor\"?\n\nWhat is your opinion and experience?",
        "created_utc": 1533613365,
        "upvote_ratio": ""
    },
    {
        "title": "Advice for Admission into Graduate Studies (MA) with relatively low GPA",
        "author": "FuegoaGogo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/957wgw/advice_for_admission_into_graduate_studies_ma/",
        "text": "Hey all,\n\nI hope it's ok to post this here. I'm in the last semester of my BA and looking into options for a possible MA. However, I am concerned that my GPA/results will be an issue; I failed some subjects in my first and second years due to unresolved health conditions.  Fortunately these are no longer an issue, and while I think my results thereafter meet the minimum requirements for the programmes I am interested in, my actual GPA will not (we don't use GPA in Australia, my uni uses a Weighted Average Mark but it's basically the same thing).\n\nDoes anybody have experience getting into graduate study from a position like mine? Can anybody give some advice on how to be a more impressive candidate and hopefully offset my poor results to some extent? I'm not in the USA and not applying to North American schools, so I won't be doing any admissions exams like a GRE. I'm not sure if reputation makes a difference, given that I will be applying to institutions in Europe, but the uni where I will complete my BA is considered one of the best in Australia and top 50/60 globally.\n\nThanks :)",
        "created_utc": 1533610808,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to find out who the most well-regarded professors on campus are?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/957tty/what_is_the_best_way_to_find_out_who_the_most/",
        "text": "[deleted]",
        "created_utc": 1533610162,
        "upvote_ratio": ""
    },
    {
        "title": "Is it more advantageous to be first author as compared to first of the co-first author?",
        "author": "passionate_student",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95769y/is_it_more_advantageous_to_be_first_author_as/",
        "text": "My mentor is hinting to me that he wants to be second of the co-first author on the paper that I am writing. The issue is as this is my second paper, so  I am more familiar with the techniques, thus his help is minimum this time. (He is the second co-first in my first paper). His argument is being first or first of the co-first author does not have much difference. How true is this?\n\nEdit: If he is not second of the co-first, he will be second author. ",
        "created_utc": 1533604636,
        "upvote_ratio": ""
    },
    {
        "title": "Is it common to get a masters before your PhD? What's the point?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95732m/is_it_common_to_get_a_masters_before_your_phd/",
        "text": "[deleted]",
        "created_utc": 1533603872,
        "upvote_ratio": ""
    },
    {
        "title": "Publishing my undergraduate thesis - what should I expect of the process?",
        "author": "xotedd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9558mx/publishing_my_undergraduate_thesis_what_should_i/",
        "text": "I'm going doing a master's at my undergraduate university. My undergrad thesis supervisor contacted me saying he wishes to pursue trying to get my undergraduate thesis published (I study biomedicine) and has arranged a meeting for when term starts in September. \n\nI have obviously never published anything before and I don't know too much about the process so I'm just wondering what I should expect of the process? \n\nThank you",
        "created_utc": 1533589818,
        "upvote_ratio": ""
    },
    {
        "title": "I am applying for the Marie Curie Individual Fellowship and I am stuck.",
        "author": "GiuliaDondoli",
        "url": "https://www.reddit.com/r/AskAcademia/comments/954qlu/i_am_applying_for_the_marie_curie_individual/",
        "text": "Hi,\n\nI recently completed my PhD in Law and I am currently applying for the Individual Fellowships - Marie Skłodowska-Curie Actions. I am particularly stuck in the second question, and I hope there is someone out there who have some suggestions.\n\nThe application form asks to explain the:  \"Quality and appropriateness of the training and of the two way transfer of knowledge between the researcher and the host\".  In sum, it asks to outline \"how a two-way transfer of knowledge will occur between the researcher and the host institution\". It is quite clear to me how I will benefit from the fellowship: training-through-research, workshops and training opportunities, ecc... But I am unsure how the host institution will  benefit from my fellowship. In particular because I am a researcher in socio-legal studies, I will not produce a patent or a new technology.\n\nDid someone apply for this type of fellowship? How did you understand the transfer of knowledge from you to the host?",
        "created_utc": 1533586371,
        "upvote_ratio": ""
    },
    {
        "title": "Why were women forbidden to be in any sort of theater for so long and how did they get the right to be actors?",
        "author": "[deleted]",
        "url": "https://old.reddit.com/r/AskFeminists/comments/93j63w/why_were_women_forbidden_to_be_in_any_sort_of/",
        "text": "[deleted]",
        "created_utc": 1533585410,
        "upvote_ratio": ""
    },
    {
        "title": ".",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskReddit/comments/952nrx/what_are_the_most_interesting_research/",
        "text": "[deleted]",
        "created_utc": 1533583524,
        "upvote_ratio": ""
    },
    {
        "title": "Question about blinding a manuscript submission",
        "author": "SolamenteBasura",
        "url": "https://www.reddit.com/r/AskAcademia/comments/953s1y/question_about_blinding_a_manuscript_submission/",
        "text": "Hi AskAcademia,\n\nI'm in the process of removing identifying information from a manuscript that I'm submitting to a journal.  I understand the basic elements that I need to remove (e.g. author names and affiliations, reference to home institution, etc.), but this particular paper has aspects that are new to me and I need some advice about:\n\n* This is the first paper I've produced that is based on work supported by NSF funds.  In the blinding process, when I make reference to the NSF support, should I obscure the grant no.?  e.g., NSF grant no. XXXXXXX\n* This is a paper about pedagogical approach in a specific course.  If the course name were generic, like \"Introduction to Statistics,\" I wouldn't care about it.  But our course name is not likely to be shared with courses at other institutions, so I think I should blind this as well.  Thoughts?  On a related note, right now the course name appears in the paper title.  So if I blind it in the paper, I assume I should also blind it in the title, right?  What suggestions do you have for doing that?\n\nThanks in advance for your input!",
        "created_utc": 1533579839,
        "upvote_ratio": ""
    },
    {
        "title": "How can we make Universities prepare students for non-ac jobs?",
        "author": "ThrowawayAcademic234",
        "url": "https://www.reddit.com/r/AskAcademia/comments/953pn4/how_can_we_make_universities_prepare_students_for/",
        "text": "So by now we're all aware of the job crisis in academia. But we're also aware that a PhD can lead to a variety of good jobs outside academia, both in the humanities and the sciences. So a PhD can still be valuable outside academia, depending on your career. \n\nBut students looking to transition away from academia get basically zero support from their programs. Your PhD alone isn't often enough to land a job: employers want to see relevant job experience. I've heard a lot of non-ac PhDs say that it wasn't their PhD that landed them a job: it was an internship, or volunteer work, or hobby, etc. outside the lab. \n\nCurrently, it's completely up to the students to get job experience. I was lucky to attend a school with the \"BEST\" program, which allows students to do a professional internship in grad school. But these programs are few, far between, and only funded temporarily by the NIH. There's no permanent institutional mechanism that helps students get the job experience they need to get hired.\n\nPlus, a lot of mentors are happy to let their students do an internship, as long as it \"doesn't come at the expense of their lab work\". Grad school already devastates your work-life balance, and expecting a student to prepare for a career transition in their limited free time isn't reasonable.\n\nI can think of a number of solutions that might help:\n\n* Students should have the right to spend 3-6 months outside the lab for an internship. \n* Universities should offer classes on leadership, budget management, teamwork, and other skills employers look for. \n* Universities should form partnerships, networks, etc with industry, government, etc.\n* Graduate training itself should be shortened for those not pursuing an academic career.\n* etc. \n\nThe problem is that universities are in *no way* incentivized to make these changes. University leadership knows about the job crisis, but as long as they get grant funding and have enough graduate students to do the actual research, they don't really care. When they do implement changes, they're slow and insufficient. \n\nCan universities be forced to make changes? What changes should they make?",
        "created_utc": 1533579400,
        "upvote_ratio": ""
    },
    {
        "title": "Is it bad etiquette to apply to/volunteer in a second lab while completing my undergrad thesis in a different one?",
        "author": "SuspiciousMajor9",
        "url": "https://www.reddit.com/r/AskAcademia/comments/953ejy/is_it_bad_etiquette_to_apply_tovolunteer_in_a/",
        "text": "I’m a rising senior undergrad at an R1 state university, working to prepare to apply to graduate school not this but next fall. I’ve volunteered (for credit) in the same lab in my field for a couple years now, get along with the PI, and have committed to completing my senior thesis there, which is 3 credit hours of work (on paper). However, I’m getting nervous because while I am excited about my project and think it will challenge me to improve upon my weak areas in the field, I don’t know how applicable the experience is to the graduate programs I want to apply to. I’ve found another lab that’s accepting student researchers that focuses on a completely different aspect of my field, one I’d like to pursue in grad school, and would like to try to volunteer there as well to gain more diverse experience for myself and my transcript. Provided I don’t die from 18 hours plus of lab time per week with classes, is it ok to try to join another lab? Will my current PI be upset about this?",
        "created_utc": 1533577358,
        "upvote_ratio": ""
    },
    {
        "title": "Math and Theoretical physics blogs",
        "author": "FormerAct",
        "url": "https://www.reddit.com/r/AskAcademia/comments/952nad/math_and_theoretical_physics_blogs/",
        "text": "Do you have any blog to suggest which is publishing math/theoretical physics related content (with actual calculations...)?",
        "created_utc": 1533572159,
        "upvote_ratio": ""
    },
    {
        "title": "How did you make your parents understand PhD stress ?",
        "author": "springishere247",
        "url": "https://www.reddit.com/r/AskAcademia/comments/951h83/how_did_you_make_your_parents_understand_phd/",
        "text": "New PhD student here. Just finished my Master's in physics. I am currently preparing for my qualifying exams. Over the summer I was working on my thesis as well as studying for my qualifying exams. This obviously made me anti-social.\n\nMy parents are not able to understand the amount of work needed for my program. This also comes with a great deal of stress. My parents do not have any education beyond a Bachelor's degree.\n\nDid any of you have parents who did not understand why you wanted to be in academia ? How did you make them understand your desire for a PhD ?\n\nEdit: Thank you all for your responses. I cannot respond to them individually. It is good to know that I am not the only one going through this. Your experience is helpful. ",
        "created_utc": 1533563712,
        "upvote_ratio": ""
    },
    {
        "title": "Choosing my next project",
        "author": "hdkridnsh",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9510uq/choosing_my_next_project/",
        "text": "How did you go about choosing your next project for after your PhD? I’m in the humanities. ",
        "created_utc": 1533559966,
        "upvote_ratio": ""
    },
    {
        "title": "Failing to find a term paper topic (Eng Lit)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/950v5q/failing_to_find_a_term_paper_topic_eng_lit/",
        "text": "[deleted]",
        "created_utc": 1533558565,
        "upvote_ratio": ""
    },
    {
        "title": "Wondered if people could f8ll out a survey for my dissertation about special educational needs and technology?",
        "author": "EnchantedRoseXO",
        "url": "https://www.reddit.com/r/AskAcademia/comments/950f5u/wondered_if_people_could_f8ll_out_a_survey_for_my/",
        "text": "[removed]",
        "created_utc": 1533554210,
        "upvote_ratio": ""
    },
    {
        "title": "Applying for PhD before finishing Masters...",
        "author": "ThePersonof21",
        "url": "https://www.reddit.com/r/AskAcademia/comments/950dcb/applying_for_phd_before_finishing_masters/",
        "text": "I am researching the PhD application process, particularly for Canada as a UK citizen. I don't even start my master's until September, but have been reading that you should apply 12 months before you intend to start a PhD program.\n\nHow will my applications work whilst I am still studying a masters? Do PhD programs allow conditional/unconditional offers?",
        "created_utc": 1533553669,
        "upvote_ratio": ""
    },
    {
        "title": "I’m struggling to decide on an undergraduate course (Law, History or International Relations)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/95087o/im_struggling_to_decide_on_an_undergraduate/",
        "text": "[deleted]",
        "created_utc": 1533552170,
        "upvote_ratio": ""
    }
]