[
    {
        "title": "Any overviews of proverbs and sayings? I'm interested in the collective knowledge of different cultures.",
        "author": "WeirdUndSpooky",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7kkitg/any_overviews_of_proverbs_and_sayings_im/",
        "text": "If any of you have any favorite proverbs, I'm interested. And I'm not even just looking for proverbs and sayings, also words unique to certain cultures that express meaning or concepts. \nI hope this is the correct place to ask. Thanks in advance.",
        "created_utc": 1513594622,
        "upvote_ratio": ""
    },
    {
        "title": "What do experts think of the problem of the black community in USA?",
        "author": "tidderfodnimpot",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7kk3p3/what_do_experts_think_of_the_problem_of_the_black/",
        "text": "[removed]",
        "created_utc": 1513587778,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most well-accepted contemporary theories on the development of property?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7kb5ho/what_are_the_most_wellaccepted_contemporary/",
        "text": "Who are the big 20th and 21st century theorists who discussed the origins of private property and property rights? What models did they put forward?\n\nI'm only familiar with Marx and Engels' arguments. Do basically all modern anthropologists believe they were on the right track?",
        "created_utc": 1513475635,
        "upvote_ratio": ""
    },
    {
        "title": "Are language and ethnicity always entwined, or are there instances where the language of one group of people was completely supplanted by the language of another group?",
        "author": "antisthenesandtoes",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k9gno/are_language_and_ethnicity_always_entwined_or_are/",
        "text": "For instance, I recently came across [this weird map](https://imgur.com/a/M5rUP) that seems to show the spread of Indo-Europeans across Eurasia, but it's got some inconsistencies with our current understanding. The artist seems to think that the Hebrews are not Semitic. Is there any evidence for this at all?\n",
        "created_utc": 1513457630,
        "upvote_ratio": ""
    },
    {
        "title": "What is the anthropological consensus as to whether males are biological wired to be attracted to women's bodies, particularly breasts?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k9gle/what_is_the_anthropological_consensus_as_to/",
        "text": "Am having a heated debate on this on another site.   It seems to me to be both cultural and some hard wiring.\n\nA critic who says men's fixation here is entirely cultural wrote this:  *In some cultures, all the women are topless all the time. From pre-teen girls who's breast are just starting to show to old grandmothers who's breast are sagging...You're telling me the men in these culture would feel the same kind of arousal you do at this everyday sight? That's kind of ethnocentric.*\n\nThis seems correct, but I offer the following ethnocentric view:  As virtual all societies became more advanced (sorry to use this term!), as in more technological, people elected to wear clothing.  Particularly in dense cities where people are side by side in food establishments, public gatherings, dense streets.\n\nIt happened in many, many civilizations, even in warm climates. \n\nAs we adopted clothing, the innate concepts of modesty and propriety in dress (unrealized in early times) naturally came to the fore.  It does not seem that these two concepts and, third, men's attraction to female bodies, is 100% socialization/cultural learning.\n\nBut if I am wrong I am interested in hearing about it.  Fascinating topic! ",
        "created_utc": 1513457609,
        "upvote_ratio": ""
    },
    {
        "title": "Are language and ethnicity always entwined, or are there instances where one group of people completely supplanted the language of another group?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k9ea9/are_language_and_ethnicity_always_entwined_or_are/",
        "text": "[deleted]",
        "created_utc": 1513456945,
        "upvote_ratio": ""
    },
    {
        "title": "Any recommendations for ethnographical works about North American Indigenous peoples just after contact?",
        "author": "generic101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k92q4/any_recommendations_for_ethnographical_works/",
        "text": "Hi there,\n\nAs the title would suggest I'm interested in learning about first person accounts from early explorers and traders about their experiences during contact with Indigenous peoples, especially from regions within present day Canada. I know that these will be massively biased by the perceptions and culture of the Europeans, but I'm looking for a snapshot of how First Nations, and Inuit peoples lived in Canada around the time of first contact with Europe. \n\nEspecially any works that go into detail about hunting practices, bushcraft, building, and other general cultural practices would be appreciated. Textbooks and summaries could be interesting too, but I would like if they included quotes from the primary resources, because I want to hear descriptions from people who were actually there in the moment. \n\nI know this may be a hard question to answer, but any help is appreciated!\n\n",
        "created_utc": 1513453685,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible ancestral languages are easier to speak than non-ancestral ones?",
        "author": "galacticduchess",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k7pzs/is_it_possible_ancestral_languages_are_easier_to/",
        "text": "I am currently studying German, but I also have studied French in the past. I sing Spanish, German, Italian, and French as a classical singer. Over the years, my teachers remarked how natural my German skills were. I picked up the language quickly and pronunciation seemed to slide off the tongue. However, I was not good at French and singing in French or Italian does not come naturally.\n\nWe did a DNA test and I found out that I am majorly German, with no Italian or French ancestry. \n\nIs there a correlation between my DNA and the ease with which I speak German, or is it just a coincidence?",
        "created_utc": 1513439960,
        "upvote_ratio": ""
    },
    {
        "title": "How did Native Americans deal with poison oak and poison ivy?",
        "author": "Elphinstone1842",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k5hjo/how_did_native_americans_deal_with_poison_oak_and/",
        "text": "I've heard things like that they fed babies a small leaf of it to inoculate them, but that kind of sounds like a myth. I haven't been able to find any solid information about this online. I've always been curious about it.\n\nAll I know is that I've lived around poison oak all my life and gotten terrible rashes several times and it seems like it would be a really huge issue for Native Americans if they couldn't make themselves immune somehow. ",
        "created_utc": 1513404445,
        "upvote_ratio": ""
    },
    {
        "title": "Do children in hunter-gatherer societies play war?",
        "author": "10z20Luka",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7k2qnc/do_children_in_huntergatherer_societies_play_war/",
        "text": "As in, do they take sticks and pretend to be men with spears, killing their enemies or hunting animals?",
        "created_utc": 1513373088,
        "upvote_ratio": ""
    },
    {
        "title": "A lot of us think it's funny when some unsuspecting person slips on a banana peel or trips onto their face. Is this kind of slapstick humor culturally universal?",
        "author": "not-a-xenomorph",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jxxy7/a_lot_of_us_think_its_funny_when_some/",
        "text": "",
        "created_utc": 1513318675,
        "upvote_ratio": ""
    },
    {
        "title": "what is the oldest symbol?",
        "author": "phaedra_zeit",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jx65e/what_is_the_oldest_symbol/",
        "text": "",
        "created_utc": 1513309378,
        "upvote_ratio": ""
    },
    {
        "title": "What are some interesting or unique cultural beauty standards or that you've come across in your work?",
        "author": "JustinJSrisuk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jp24l/what_are_some_interesting_or_unique_cultural/",
        "text": "",
        "created_utc": 1513223749,
        "upvote_ratio": ""
    },
    {
        "title": "Could we use the technology we used to compare Neandertal DNA with H. Sapien DNA in reverse to discover potential other species we may have interbred with?",
        "author": "Meritbicnot",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jooym/could_we_use_the_technology_we_used_to_compare/",
        "text": "",
        "created_utc": 1513219843,
        "upvote_ratio": ""
    },
    {
        "title": "How is the subject of \"Primative\" societies dealt with?",
        "author": "Carmb09",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jlv1o/how_is_the_subject_of_primative_societies_dealt/",
        "text": "Can somebody point me to some stuff?\n",
        "created_utc": 1513195030,
        "upvote_ratio": ""
    },
    {
        "title": "Are patriarchal societies as old as mankind?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jl1q6/are_patriarchal_societies_as_old_as_mankind/",
        "text": "[deleted]",
        "created_utc": 1513188236,
        "upvote_ratio": ""
    },
    {
        "title": "Ethnography of Chimpanzees?",
        "author": "timmg",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jk8gu/ethnography_of_chimpanzees/",
        "text": "Not sure if this is *actually* an anthropology question, but: does anyone know of an \"ethnography\" of chimpanzee society?  \n\nIt seems there is some sort of culture and social structure.  It would be cool to read a (scientifically literate) layman's account of their social structure, etc.",
        "created_utc": 1513181319,
        "upvote_ratio": ""
    },
    {
        "title": "A well done chart of the Homo family?",
        "author": "PureWhey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jhkto/a_well_done_chart_of_the_homo_family/",
        "text": "As the title says, has anyone come across a nice chart/timeline for the homo family?\n\nCheers.",
        "created_utc": 1513148760,
        "upvote_ratio": ""
    },
    {
        "title": "I have a question about gender in Morocco",
        "author": "HisMajestytheSquid",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jg485/i_have_a_question_about_gender_in_morocco/",
        "text": "Hey there, everyone, I am currently in an African anthro course in college and have a big paper to do about the relationship between the cultural roles of men and women in Morocco. My current issue is that I am deeply limited in my knowledge of ethnic relations as well as general knowledge of the area. I don't want to be insulting or insensitive to the topic since the Islamic faith is very prevalent amongst the people in Morocco.\n\n\nI have an ethnography about women in Fes that indicates possible tensions between social classes; citing that the middle-class Fassi are/were attempting to stifle a movement to reform the code dictating women's rights in marriage and divorce. \n\n\nSo my question, I suppose, is what kinds of cultural contexts should I be looking for when reading this ethnography to better understand the complex relationships at work?\n\n\nAre there any differences in kinship relations that may cause tensions between groups?\n\n\nWhat are the Fassi and why are they so important to the narrative of the issue regarding women's rights?",
        "created_utc": 1513132607,
        "upvote_ratio": ""
    },
    {
        "title": "What role did obsidian trade play in the rise of Teotihuacán?",
        "author": "dcalhoon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jfbbp/what_role_did_obsidian_trade_play_in_the_rise_of/",
        "text": "",
        "created_utc": 1513124694,
        "upvote_ratio": ""
    },
    {
        "title": "What role did obsidian trade play in the rise of the Olmec site San Lorenzo?",
        "author": "dcalhoon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jfb4f/what_role_did_obsidian_trade_play_in_the_rise_of/",
        "text": "",
        "created_utc": 1513124648,
        "upvote_ratio": ""
    },
    {
        "title": "A question about grave terminology",
        "author": "liburnoroman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jeis6/a_question_about_grave_terminology/",
        "text": "Does anyone here perhaps know the term used in archaeology for the stone slabs used to cover the sides of the grave pit and the term for the slab covering the top of the pit? \n\nAll suggestions are greatly appreciated. \n\nEdit: To give some more context, I need the terms that fit into the context of  a Liburno-Roman iron age necropolis.",
        "created_utc": 1513117582,
        "upvote_ratio": ""
    },
    {
        "title": "To Anthropologists, is Appropriation equal to Cultural Exchange?",
        "author": "graidan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7je4jn/to_anthropologists_is_appropriation_equal_to/",
        "text": "Someone on line is claiming that the negative understanding of appropriation is not what 90% of anthropologists believe, and that is is used in anthropology essentially as a synonym for cultural exchange.\n\nIs that true? Because it sure doesn't seem accurate based on what I know - my background is in religious studies and native traditions - both of which have a HUGE amount to say from a negative perspective, about appropriation.\n\nIt also doesn't seem accurate based on the papers and such I'm finding in google.",
        "created_utc": 1513114137,
        "upvote_ratio": ""
    },
    {
        "title": "Which specific sites demonstrate complex chiefdoms or archaic states of peoples of the New World compared to the Old World?",
        "author": "Citypanda23",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jdz6b/which_specific_sites_demonstrate_complex/",
        "text": "[removed]",
        "created_utc": 1513112865,
        "upvote_ratio": ""
    },
    {
        "title": "Did aztecs/mayans and other meso americans originate from the bering strait ice bridge?",
        "author": "yesh_me_lorde",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7jc8v8/did_aztecsmayans_and_other_meso_americans/",
        "text": "And if so, why did they look more different from native north americans, than siberians do?",
        "created_utc": 1513099343,
        "upvote_ratio": ""
    },
    {
        "title": "Xunzi states, “The children of the Han, Yue, Yi, and Mo peoples all cry with the same sound at birth, but when grown they have different customs, because teaching makes them thus.”",
        "author": "Qinhuangdi",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7j9j6x/xunzi_states_the_children_of_the_han_yue_yi_and/",
        "text": "He is arguing for the fact that learning is of primary concern because it can change and alter the nature of a person, and that this nature is originally universal. Regardless of his further thoughts on human nature, I was wondering if humans become distinguished through learning, and that they would start out at least similar to one another at birth?",
        "created_utc": 1513069920,
        "upvote_ratio": ""
    },
    {
        "title": "How did Austronesian people expand so far?",
        "author": "artofprinceshaolin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7j8lyr/how_did_austronesian_people_expand_so_far/",
        "text": "From Taiwan to Madagascar to Polynesia. Its such an extensive area compared to other groups.",
        "created_utc": 1513056970,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence that Northeastern Native Americans used varve clays in pottery?",
        "author": "Javelin901",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7j7vpj/is_there_any_evidence_that_northeastern_native/",
        "text": "If so, how did these clays behave compared to convential clay resources found in NA pottery?",
        "created_utc": 1513049345,
        "upvote_ratio": ""
    },
    {
        "title": "what differentiates human races and species?",
        "author": "Naderium",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7j7hlj/what_differentiates_human_races_and_species/",
        "text": "I don't want to sound racist, but why are (for example) Denisovans and neanderthals considered different species while modern humans are differentiated as different races. Physically speaking the three major races are very different to each other in terms of looks if you were to ask me (mongoloids, caucasoids and negroids). Is it because the differences between people groups such as Denisovans and neanderthals were much larger than the differences between modern human races? \n\nAgain i'm not trying to come across as racist, just a curious person of middle eastern descent.   ",
        "created_utc": 1513045873,
        "upvote_ratio": ""
    },
    {
        "title": "For how long have humans been Trading?",
        "author": "PerfectSociety",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7j6den/for_how_long_have_humans_been_trading/",
        "text": "",
        "created_utc": 1513035121,
        "upvote_ratio": ""
    },
    {
        "title": "Humans have been naming the stars for a long time. Are there any shared star names or constellations in widely divergent cultures that likely originate in prehistory?",
        "author": "best_of_badgers",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7j2m88/humans_have_been_naming_the_stars_for_a_long_time/",
        "text": "",
        "created_utc": 1513003688,
        "upvote_ratio": ""
    },
    {
        "title": "A common and long-standing trope/stereotype in Western pulp fiction is for pre-contact societies to worship volcanoes and appease them with human sacrifice (usually the hero's beautiful girlfriend). Does this have any basis in reality? What does real volcano worship look like?",
        "author": "124876720",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7it0g5/a_common_and_longstanding_tropestereotype_in/",
        "text": "It even has a TV Tropes page: http://tvtropes.org/pmwiki/pmwiki.php/Main/AppeaseTheVolcanoGod\n\nI'd also be interested in how this stereotype came to be.  ",
        "created_utc": 1512896893,
        "upvote_ratio": ""
    },
    {
        "title": "What determines which places become cities?",
        "author": "TOMATO_ON_URANUS",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ipjag/what_determines_which_places_become_cities/",
        "text": "Intentionally very broad; I'd welcome any perspective on this!",
        "created_utc": 1512854875,
        "upvote_ratio": ""
    },
    {
        "title": "Are Austroasiatic people related to Austronesian people?",
        "author": "tobixice",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ilvrl/are_austroasiatic_people_related_to_austronesian/",
        "text": "",
        "created_utc": 1512812108,
        "upvote_ratio": ""
    },
    {
        "title": "What are some particularly dramatic examples of gendered occupations differing from the ways the modern-day West divides them?",
        "author": "MugaSofer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ifa2q/what_are_some_particularly_dramatic_examples_of/",
        "text": "",
        "created_utc": 1512743238,
        "upvote_ratio": ""
    },
    {
        "title": "How do band societies deal with crime?",
        "author": "JLTeabag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7idjql/how_do_band_societies_deal_with_crime/",
        "text": "",
        "created_utc": 1512719581,
        "upvote_ratio": ""
    },
    {
        "title": "What are the differences between cultural anthropology and human/cultural geography?",
        "author": "sassprin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7i85nw/what_are_the_differences_between_cultural/",
        "text": "",
        "created_utc": 1512668712,
        "upvote_ratio": ""
    },
    {
        "title": "How did Nomadic Tribes settle down?",
        "author": "PenHeron",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7i66dj/how_did_nomadic_tribes_settle_down/",
        "text": "I'm aware that this could be a vague question, so to clarify slightly, I'm not talking about the very first tribes to establish cities, but rather later tribes that settled down, most likely near preexisting towns and cities. e.g Gallic and Italian tribes deciding to build cities, when there are established cities already near by, such as the Etruscans and early Rome.\n\nWhat made a tribe decide to give up its Nomadic way of life, and how did it go about actually building a city, and carving out an area of land to control, possibly at the expense of nearby rival towns? ",
        "created_utc": 1512650418,
        "upvote_ratio": ""
    },
    {
        "title": "In cultures with \"sky burial\" (dead left to the vultures), is there any difference in the practice if the dead is a man, woman, child, rich or poor?",
        "author": "masiakasaurus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7i56dg/in_cultures_with_sky_burial_dead_left_to_the/",
        "text": "",
        "created_utc": 1512637228,
        "upvote_ratio": ""
    },
    {
        "title": "What did Southern California look like at the end of the Pleistocene/beginning of the Holocene?",
        "author": "tootaitee",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hynlv/what_did_southern_california_look_like_at_the_end/",
        "text": "Doing research for a time travel screenplay. What did Southern Californian coastline look like as humans began populating the area? I imagine most of the flora we see today is introduced, so what would have been the dominant foliage? What was the climate like? Was it similar to today's Mediterranean style climate? If you were transported back there, would it immediately be obvious?",
        "created_utc": 1512573231,
        "upvote_ratio": ""
    },
    {
        "title": "Why Humans spread so far ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hyh3u/why_humans_spread_so_far/",
        "text": "[deleted]",
        "created_utc": 1512571552,
        "upvote_ratio": ""
    },
    {
        "title": "Could pubic hair have been thicker on early homonids and served to conceal they're genitals before they began to used cloths but after we lost our hair?",
        "author": "Epigravettian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hy9xi/could_pubic_hair_have_been_thicker_on_early/",
        "text": "",
        "created_utc": 1512569626,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been any serious study on people's choice of tiles' colors?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hy3th/has_there_been_any_serious_study_on_peoples/",
        "text": "[deleted]",
        "created_utc": 1512567925,
        "upvote_ratio": ""
    },
    {
        "title": "Linguistical anthropology",
        "author": "nudget13",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hy0ty/linguistical_anthropology/",
        "text": "Hi, could anyone recommend me some books, articles, texts (whatever) for me to get an introduction on linguistical anthropology? And also something on \"how to do it\"\n\nThanks!",
        "created_utc": 1512567063,
        "upvote_ratio": ""
    },
    {
        "title": "Is the study of identities more recent than that of cultures in anthropology?",
        "author": "Riodeplata",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hxgp6/is_the_study_of_identities_more_recent_than_that/",
        "text": "I've read an article the other day that talked about identities as a relatively new concept, separating it from the ideas of culture. If this is way too broad of a question I'll go back to it later to rewrite it.",
        "created_utc": 1512560104,
        "upvote_ratio": ""
    },
    {
        "title": "College student considering an Anthropology minor",
        "author": "psychoticpython",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hvlnq/college_student_considering_an_anthropology_minor/",
        "text": "Hello all,\n\nI'm a current freshman who is trying to study Business as a major (international business in particular). I am also looking for a minor or two to pair with my major, and anthropology (mostly focused on history and evolution) really interests me. Would this combination be in anyway beneficial or would anthropology not be as useful when paired with business. \n\nThanks!",
        "created_utc": 1512533877,
        "upvote_ratio": ""
    },
    {
        "title": "4 How did pre-Iron Age humans (ie, \"cavemen\" or Göbekli Tepe-era people) trim their nails/maintain personal hygiene?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hulo3/4_how_did_preiron_age_humans_ie_cavemen_or/",
        "text": "Reposted from r/askhistorians: \n\nThis question focuses on nails, but could be expanded to the rest of personal hygiene. Like for nails, did they just grow absurdly long nails, or like break them via rocks? How did they shave anything pre-metal? And did they wipe their butt after taking a dump or just live with the itch?",
        "created_utc": 1512523868,
        "upvote_ratio": ""
    },
    {
        "title": "Did any atheist cultures emerge? That is, any without religion?",
        "author": "tresbros",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hu8zz/did_any_atheist_cultures_emerge_that_is_any/",
        "text": "",
        "created_utc": 1512520568,
        "upvote_ratio": ""
    },
    {
        "title": "Picking a discipline",
        "author": "iReddit2000",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7htxka/picking_a_discipline/",
        "text": "Is it really that bad to be interested in more than one discipline in anthropology? I love cultural anthropology and archaeology, and as i prepare my application to grad school i choose to go the culture rout because there are more things there that interest me. When i speak to my advisors they say im not ready for grad school yet for what essentially boils down to me liking too much of my field. Is that really such a bad thing? I have two archaeology professors that want me to work with them and would take me for the asking, yet that's not what i was 100%. I dont even have a particular interest within arch. Maybe i should go the sure rout anyway?\nWhat does r/AskAnthropology think? Should i go arch? And can i really like too much of a good thing?",
        "created_utc": 1512517672,
        "upvote_ratio": ""
    },
    {
        "title": "How do anthropologists view the impact of the horse on the native American culture? For all its benefit in hunting and travel, horse culture resulted in a huge increase in raiding.",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hte34/how_do_anthropologists_view_the_impact_of_the/",
        "text": "And related violence.  One example would be the Comanches, who engaged in a broad range of captive taking, horse stealing and raiding other tribes, notably the Apaches, for some 150 years\n\nSome writers have observed that when cultures are on foot, the capacity to raid is much reduced.   How much loot can you carry off on foot?  How long does it take for raiders to return to their home range? \n\nCertainly some tribes like the eastern woodlands Iroquois engaged in a fair amount of raiding and slaving before they got horses.   But on balance, the large scale inter-tribal violence that arrived with horse culture seems to have offset the benefits.\n\n*(The high point of horse culture lasted only a few generations before displacement by the white man.)*",
        "created_utc": 1512512979,
        "upvote_ratio": ""
    },
    {
        "title": "Did Neanderthals had a chin ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hq7fn/did_neanderthals_had_a_chin/",
        "text": "[deleted]",
        "created_utc": 1512486201,
        "upvote_ratio": ""
    },
    {
        "title": "What are these sites I found in Peru?",
        "author": "Helicbd112",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hlqgc/what_are_these_sites_i_found_in_peru/",
        "text": "**edit: so it looks like the holes are probably looter holes, but I'm still curious about the other features**\n\nI was checking Peru on Google Earth a couple of months ago and started noticing faint squares in the ground. They are mostly along the bottom of the mountain ridges. I found some 50km away also but have stopped looking until I know what they are since they could be modern livestock pens for all I know and I'd be wasting hours on nothing.\n\nI also found one that is similar to the baKoni ruins of South Africa.\nThere are also holes that seem to be dug purposely, some in rows.\n\n\nTo begin with and as a reference point, here's an image of the well known Band Of Holes and the ruins of Tambo Colorado in Peru.\n\nhttps://i.imgur.com/JrXL5cm.jpg\n\n\nHere's one of the \"cities\" I came across. It has a bit of everything, including rows of holes, a large circle, and a lot of 'squares'.\n\nhttps://i.imgur.com/2BLhBop.jpg\n\n\nHere's a bunch of holes that seem to have been dug into a square pattern.\n\nhttps://i.imgur.com/XOfZ4N1.jpg\n\n\nHere's some of the sites full of squares.\n\nhttps://i.imgur.com/GMm9L1T.jpg\n\n\n\nFinally here's a compilation of other random interesting sites.\n\nhttps://i.imgur.com/xc5Qt2i.jpg\n\n\"LC\" Seems to be dug purposely in a row.\n\"BK\" circled area looks like the baKoni ruins in South Africa.\n\nAs you can see these sites spread for at least 50 km.\n\nThanks.\n\nForgot to add that I went through satellite imagery history and these sites have been there for at least 20 years untouched.",
        "created_utc": 1512432951,
        "upvote_ratio": ""
    },
    {
        "title": "What's it like to actually study Anthropology?",
        "author": "BkAEEIlKL39x9",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hkidj/whats_it_like_to_actually_study_anthropology/",
        "text": "Hi everyone, first time posting here! I apologise if this question isn't allowed but it doesn't seem to break any rules and I can't really think of a better sub for obvious reasons lol.\n\nSo I'm in my twenties and for the past year I've really started asking myself what I'd like to study. I've always been fascinated by humans, culture and history. What really sparked my interest for Anthropology and Ethnography (could someone please explain the difference btw?) was reading Kontiki by Thor Heyerdahl which I'm sure many of you are familiar with. I understand Thor wasn't very acclaimed as a scientist though but I found it fascinating nonetheless.\n\nSo anyway, I was wondering: what is it like to actually go to university and study anthropology? What careers can it lead to later down the line other than working at a museum? Not that it'd be a bad thing, just curious what the options are. I'm specifically interested in Biological anthropology and Sociocultural anthropology. I was thinking about maybe combining those studies with some Biology too, specifically Botany &amp; Ethnobotany (the study of plants and their relationship to humans).\n\nAny replies are welcome! Thank you! :)",
        "created_utc": 1512422514,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't Africa get it together and develop into a first or second world country? India and China have come back from being third world, why can't Africa ?",
        "author": "Petrus_",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hiwn7/why_cant_africa_get_it_together_and_develop_into/",
        "text": "[removed]",
        "created_utc": 1512409427,
        "upvote_ratio": ""
    },
    {
        "title": "Is there such a thing as an islander culture? What are characteristics do people who live in islands share that cross racial, ethnic, historical lines?",
        "author": "cheetalia",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hf0ys/is_there_such_a_thing_as_an_islander_culture_what/",
        "text": "I don't mean big technical islands like Greenland or Great Britain. I mean smaller islands like in the Caribbean (Cuba, Puerto Rico, Virgin Islands, etc..) and the Pacific (Hawaii, Samoa, etc..) and even Taiwan. What are characteristics of an island culture across racial, historical lines? What characteristics are shared because they live in an island rather than because they are from the same race, ethnic group, nationality, share a history?",
        "created_utc": 1512361956,
        "upvote_ratio": ""
    },
    {
        "title": "How accepted is the theory of the original affluent society?",
        "author": "chaosofstarlesssleep",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7hbla7/how_accepted_is_the_theory_of_the_original/",
        "text": "The theory of the original affluent society, from what I understand, is that pre-agricultural humans (at least in some regions) were not barely eking by and struggling to survive, as they are often perceived to have been, but had ample leisure time compared to later humans. That leisure time, then, allowed for them to develop touchstones of culture, such as music and art. \n\nThe theory strikes me as very plausible, considering that it seems unlikely that, without requisite free-time, humans would be able to lay the foundations of culture. \n\nFurthermore, did the transition to agriculture lessen how much free-time most early humans had, changing the structure of societies so that early humans had less free-time? Did the transition to agriculture bring about or widen class divisions?",
        "created_utc": 1512328183,
        "upvote_ratio": ""
    },
    {
        "title": "How did individuation evolve?",
        "author": "leanardodelcaprio",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7h8k8p/how_did_individuation_evolve/",
        "text": "",
        "created_utc": 1512288363,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of mammal are these vertebrae from?? I found it at pv beach!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7h8aek/what_kind_of_mammal_are_these_vertebrae_from_i/",
        "text": "[deleted]",
        "created_utc": 1512283622,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any cultures where it's acceptable to eat one's pet?",
        "author": "PETApitaS",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7h46ht/are_there_any_cultures_where_its_acceptable_to/",
        "text": "after it's dead, I mean",
        "created_utc": 1512238274,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it ancient artwork is assumed to have deep significance, whereas no such expectations are put on contemporary work?",
        "author": "Breeze_in_the_Trees",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7h27rf/why_is_it_ancient_artwork_is_assumed_to_have_deep/",
        "text": "",
        "created_utc": 1512214891,
        "upvote_ratio": ""
    },
    {
        "title": "If the social structure of the Yanomami was largely based on combative superiority, then why weren't Yanomami men constantly training in the martial arts?",
        "author": "naekid",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7h1uyp/if_the_social_structure_of_the_yanomami_was/",
        "text": "I'm currently reading Noble Savages by Napolean Chagnon (great book), where the author details his experience living among the Yamomami people in the amazon basin for over 5 years. What he concludes is that the most valued resource from the perspective of Yamomami men were actually women, and that Yamomami people lived \"in a state of chronic warfare\" as men tried to protect females from their tribe and raid neighboring tribes to take their women. He then describes the men at the top of the social hierarchies as having attained the position through a combination of kinship ties and superiority in use of force in raids on neighboring villages, or intra-tribe club fights.  \n\nReading up on wikipedia shows some mixed conclusions about whether the cause of the violence in yanomami culture is due to the native culture or acculturation/affect of modernization near the tribes, but it seems like most anthrpologists accept the that  violence is prevalent. Estimates show around 20-40% of male deaths occur through violence.\n\nIf I was living in such a culture, I'd be spending a significant chunk of my downtime sparring and honing my martial skills, but I don't read anything about them doing this too much. Anyone have any thoughts?",
        "created_utc": 1512208240,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been a site report published for the Denisova Cave excavations?",
        "author": "Maace94",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gyscg/has_there_been_a_site_report_published_for_the/",
        "text": "If so, where can I find it? Sorry if this isnt the appropriate subreddit.\n\n\nEdit: Also, this [National Geographic article] (http://ngm.nationalgeographic.com/2013/07/125-missing-human-ancestor/shreeve-text) on the site has some info about the cave before any archeaological surveys, but has no citations. Does anyone know of sources to those?",
        "created_utc": 1512168760,
        "upvote_ratio": ""
    },
    {
        "title": "Human male penises are supposedly quite large relative to body mass compared to other apes, but what about human female vaginas?",
        "author": "CalibanDrive",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gy68s/human_male_penises_are_supposedly_quite_large/",
        "text": "I have seen much ado in popular science discourse about the significance—in terms of evolutionary history and sexual/reproductive selection—of the fact that human male penises are much larger relative to body size than our near ape relatives. \n\nBut I never see much discussion about the size or shape of human *female* genitalia... so have there even been any studies of the subject? What have been the conclusions? Are human female vagina wider relative to body size relative to ape, for example? Have selection pressures related to mate selection, copulation and childbirth had significant effects on women the way they supposedly have had on men?",
        "created_utc": 1512163197,
        "upvote_ratio": ""
    },
    {
        "title": "What factors kept agriculturalists from outcompeting hunter gatherers?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gxu03/what_factors_kept_agriculturalists_from/",
        "text": "I've always heard that agriculture took to root and spread 10,000 or so years ago because agricultural civilizations could bring more manpower to bear against enemies and had logistical advantages that come with having storable/moveable food surpluses.\n\nYet there are many examples where agriculturalists seem to have failed to outcompete their hunter-gatherer competitors.\n\nThe major ones I can think of all involve people of the steppe/plains - people who rode horses.\n\nAll throughout history, we hear of nomadic steppe peoples beating settled agriculturalists on the Asian/European steppe.\nIn the Americas, agriculturalists seem to have won out in Mexico/South America, but in north America, the agriculturalists were largely limited to the eastern and western coasts. The vast central part of the continent was ruled by hunter gatherers.\n\nWhy was this?\n\nWere the steppe peoples really hunter gatherers, or would we consider them more as farmers of animals, and so comparable to the agriculturalists in terms of population availability?",
        "created_utc": 1512160306,
        "upvote_ratio": ""
    },
    {
        "title": "Gender roles in bands/tribes/chiefdoms/states?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gxlnx/gender_roles_in_bandstribeschiefdomsstates/",
        "text": "I've found a lot on the economic, religious, government centralization, slavery, etc. aspects of the four different types of social organizations (bands, tribes, chiefdoms, and states). But I can't seem to find anything that explicitly addressed the changing of gender roles over that time? In class, my professors often mention that states are extremely patriarchal and bands and egalitarian in pretty much any way, but what about in between? Are there any situations where women lead? ",
        "created_utc": 1512158365,
        "upvote_ratio": ""
    },
    {
        "title": "Would homo ergaster/erectus have covered they're genitals?",
        "author": "Epigravettian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gw2q8/would_homo_ergastererectus_have_covered_theyre/",
        "text": "",
        "created_utc": 1512145598,
        "upvote_ratio": ""
    },
    {
        "title": "How definite is the 170 kya date for the earliest use of clothing?",
        "author": "Epigravettian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gw2cz/how_definite_is_the_170_kya_date_for_the_earliest/",
        "text": "I remember that's based on louse genetics, so I suppose that would mean these are modern human lice being tested. Would that mean earlier hominids, in Europe and Asia perhaps have used clothing and left no trace? What if African hominids just whore clothing over their genitals or wore clothing only when it was cold, would this not leave evidence under the current louse genetic study?",
        "created_utc": 1512145516,
        "upvote_ratio": ""
    },
    {
        "title": "Are Indians (from the subcontinent) considered Caucasian?",
        "author": "throwaway_jacques",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gtkh5/are_indians_from_the_subcontinent_considered/",
        "text": "I’ve read multiple articles that say that Indians are caucasians even though there is a skin color difference. face structures , bone structures etc are very similar. What do you guys think?",
        "created_utc": 1512114002,
        "upvote_ratio": ""
    },
    {
        "title": "Need help dating these sites youngest to oldest (seriation) would love an explanation",
        "author": "ImThatClutch",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7golao/need_help_dating_these_sites_youngest_to_oldest/",
        "text": "Not so clear on how to do this and I would love it if someone could explain to me how exactly you order them from youngest to oldest. \nThe sites are shown in this link, just the Petristan chapter \nhttps://books.google.com/books?id=WWvATeUcNtgC&amp;pg=PA43&amp;lpg=PA43&amp;dq=petristan&amp;source=bl&amp;ots=D3dxrv_rqS&amp;sig=ncs3ITs-mJTbsQRUHAYzr5PAkz8&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjf75fx-ObXAhVFbiYKHQfrBb4Q6AEIKTAA#v=onepage&amp;q=petristan&amp;f=false",
        "created_utc": 1512067816,
        "upvote_ratio": ""
    },
    {
        "title": "Major in Anthropology with a minor in Art History? Am I wasting my time and money?",
        "author": "dcalhoon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7go7s6/major_in_anthropology_with_a_minor_in_art_history/",
        "text": "I’m a junior in college and my major is Anthropology, I just added a minor in Art History and I’m thinking about a possible minor in Geography. Is this a total waste of time in regards to finding a job after I graduate? ",
        "created_utc": 1512064890,
        "upvote_ratio": ""
    },
    {
        "title": "Bathrooms around the world?",
        "author": "felixforfun",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7glyo6/bathrooms_around_the_world/",
        "text": "How did it come about that en suite bathrooms in private homes are common in the US / Latin America, while shared bathrooms are common in Europe? Is it due to differing cultural norms / sense of shame?\n",
        "created_utc": 1512044489,
        "upvote_ratio": ""
    },
    {
        "title": "Southwest road trip: Archaeology style",
        "author": "chachinstock",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7gl810/southwest_road_trip_archaeology_style/",
        "text": "I have some free time in December and am planning a road trip through the American Southwest. I want to see as many archaeological sites as possible and was hoping for some suggestions of parks/sites within parks to visit. Any anecdotes as well would be appreciated!\n\nThe trip starts in Los Angeles. I might just start on Route 66 and explore some ghost towns to wet my beak. My list of \nplaces to see so far are: Chaco Canyon, Mesa Verde, Canyon of the Ancients National Monument, and Nine Mile Canyon. All suggestions welcome!",
        "created_utc": 1512034657,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the origin of the wink gesture as a romantic/sexual gesture?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7g1ako/whats_the_origin_of_the_wink_gesture_as_a/",
        "text": "[deleted]",
        "created_utc": 1511841421,
        "upvote_ratio": ""
    },
    {
        "title": "What are qualities of leadership across cultures?",
        "author": "WeirdUndSpooky",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fyz3y/what_are_qualities_of_leadership_across_cultures/",
        "text": "I understand this is context dependent, especially in hunter-gatherer societies. Ideally I would like an overview, be it a textbook or a paper. I have better access to the latter than the former, of which I do not have good access to.",
        "created_utc": 1511820791,
        "upvote_ratio": ""
    },
    {
        "title": "How universal are the short time units, like hour, minute and second?",
        "author": "yuksare",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fy2c7/how_universal_are_the_short_time_units_like_hour/",
        "text": "I'm uneducated on the matter, as far as I remember, they come from Sumerians (?) Then what other people used before borrowing this system? I guess, hunter-gatherers or agricultural societies don't really need to be that specific and to count minutes. What about more urbanized cultures then, like ancient China?",
        "created_utc": 1511813647,
        "upvote_ratio": ""
    },
    {
        "title": "What are the anthropological ramifications of people’s interest in their ancestors?",
        "author": "hockeyrugby",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fxs2d/what_are_the_anthropological_ramifications_of/",
        "text": "We see ancestry.com commercials with African Americans who thought their heritage was Haitian, or Americans who thought they were Scottish find out they are German. \nMy question is what does this phonominon mean? Why are people so interested? Why does it matter? \nSecondly, has anyone studied this? ",
        "created_utc": 1511811446,
        "upvote_ratio": ""
    },
    {
        "title": "Is a service like ancestry.com accurate?",
        "author": "SomberSnow",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7futqe/is_a_service_like_ancestrycom_accurate/",
        "text": "How certain can we be of the results?\n\nHow far back can we assign genetic makeup to your personal ancestry over the collective ancestry? And I do not mean to start a debate about what is your personal ancestry vs the greater ancestry of mankind please\n\nI just remember that video of the white supremacist being told he had African DNA and it made me wonder how meaningfully these tests speak to your actual heritage",
        "created_utc": 1511785559,
        "upvote_ratio": ""
    },
    {
        "title": "[xpost from r/askhistorians] Let's say a peat cutter comes across a well-preserved body in his neighborhood bog. What happens next?",
        "author": "gooseposse",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7frqop/xpost_from_raskhistorians_lets_say_a_peat_cutter/",
        "text": "I've been reading a bit about bog bodies, and it seems like a good number of them were (and still are) uncovered by regular people who were cutting blocks of peat for fuel (definitely not trained archeologists). Assuming that the cutter realized what he found and called the police, what would happen next? For example, if a forensic scientist is sent out, would they be able to tell that a body is too old to be a recent murder victim with enough certainty to call off further police investigation and call in the archeologists? Assuming an archeologist has whatever permission is required to remove the body and no significant time constraints (like a new building development going in on that site), would she/he simply remove the body quickly and take it to a lab, or would a more extensive excavation take place? What are the basic measurements or tests that a competent archeologist or specialist would perform before removing a body?\n\nThank you in advance for any answers!",
        "created_utc": 1511748431,
        "upvote_ratio": ""
    },
    {
        "title": "What body parts are sexualized in other cultures?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7frg5j/what_body_parts_are_sexualized_in_other_cultures/",
        "text": "",
        "created_utc": 1511745585,
        "upvote_ratio": ""
    },
    {
        "title": "How do children in isolated tribes deal with their non-conforming or free-thinking peers?",
        "author": "Odd_craving",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fnvne/how_do_children_in_isolated_tribes_deal_with/",
        "text": "Are these differences (such as homosexuality, questioning tradition, social awkwardness) allowed or squashed?",
        "created_utc": 1511713621,
        "upvote_ratio": ""
    },
    {
        "title": "[Xpost from /r/AskHistorians] Did ancient alchemists work together?",
        "author": "MagesFault",
        "url": "https://www.reddit.com/r/AskHistorians/comments/7fmmc2/did_ancient_alchemists_work_together/",
        "text": "",
        "created_utc": 1511700042,
        "upvote_ratio": ""
    },
    {
        "title": "How far in time could we go back take an infant, raise him/her by our \"modern\" standards and not feel a difference",
        "author": "onowar",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fhor3/how_far_in_time_could_we_go_back_take_an_infant/",
        "text": "the question may seem a little weird, but I know I've seen a reddit post before claiming exactly this to be 250.000 years. Although weird, the question would highlight how important community, society and civilization for the current state of technology and progress in general is. ",
        "created_utc": 1511641087,
        "upvote_ratio": ""
    },
    {
        "title": "Do all cultures have a similar pattern of use to their fingers as we do in the west?",
        "author": "420MenshevikIt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fenlw/do_all_cultures_have_a_similar_pattern_of_use_to/",
        "text": "In western cultures, we generally use the index finger extensively, the middle finger somewhat, and the ring finger not very much at all. \n\nDo other cultures use the index finger universally frequently, and the ring finger universally less? If not, what cultures use their fingers in a different manner, and when did this pattern of use of our fingers become widespread in European cultures?",
        "created_utc": 1511608895,
        "upvote_ratio": ""
    },
    {
        "title": "When did salt and pepper become the most common table spices?",
        "author": "OnceSheWasMine",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7fb463/when_did_salt_and_pepper_become_the_most_common/",
        "text": "",
        "created_utc": 1511564669,
        "upvote_ratio": ""
    },
    {
        "title": "Could Orangutans be our Closest Living Relative?",
        "author": "Historicmetal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7f5oi2/could_orangutans_be_our_closest_living_relative/",
        "text": "Several years ago I read a book by an anthropologist named Jeffrey Schwartz who promoted the idea that orangs, not chimps, are the closest living relative to humans. The support for this hypothesis is that orangs share many traits with humans that chimps and gorillas do not: hair rather than fur, moustaches, thick tooth enamel, lack of an estrus cycle, aspects of hand structure, and smaller ischial callosities (while humans have none). The main evidence for chimps being closer was evidently that they share more DNA with us, but Schwartz contends this DNA evidence is not as strong as people tend to assume. I don't know much about all of the DNA research that has lead to the conclusion that chimps are our closest relative, but I think the basic assumption might be something like: the more derived SNPs you have in common, the more closely related you are.\n\nAnyway, it's been a while since I read this book, but at the time, it sounded like an extreme minority of anthropologists agreed with this idea. What is the current consensus on this matter? Is the possibility of orangs or other apes being more closely related to humans than chimps taken seriously?\n\nThank you, and sorry if I have gotten anything wrong. I am definitely not an expert on evolution or genetics.",
        "created_utc": 1511505958,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a paper I once found on this sub about female rulers and wars",
        "author": "Im_regular_legs",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7f0ixf/looking_for_a_paper_i_once_found_on_this_sub/",
        "text": "I think its title was \"Queens\". It was posted in a discussion about gender and violence as evidence that female rulers have initiated more wars than male ones.\n\nSomething like that anyway.\n\nEDIT: Found it. If anyone else is interested:\n\nhttp://odube.net/wp-content/uploads/2015/11/Queens_Oct2015.pdf",
        "created_utc": 1511452834,
        "upvote_ratio": ""
    },
    {
        "title": "Sexual freedom in societies?",
        "author": "tacforall",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ezjjo/sexual_freedom_in_societies/",
        "text": "What happens to a civilization/society when there is/was a relatively high degree of sexual freedom? What happens to a civilization/society when there is/was a relatively low degree of sexual freedom?",
        "created_utc": 1511442627,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't humans have sex more?",
        "author": "avery_404",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ez1t6/why_dont_humans_have_sex_more/",
        "text": "Most bonobos have sex many times a day. Chimps have sex quite a lot too. What's with humans? Why do so many of us (often unwillingly) go weeks/months/years without sex? \n\nAlso, the whole covering up of sexual areas thing ... Is that related? Is our species just really sexually repressed?",
        "created_utc": 1511436518,
        "upvote_ratio": ""
    },
    {
        "title": "Difference between animals and humans?",
        "author": "marcio421",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7eyscx/difference_between_animals_and_humans/",
        "text": "[removed]",
        "created_utc": 1511432943,
        "upvote_ratio": ""
    },
    {
        "title": "Logic over superstition",
        "author": "Kethew85",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7eu0di/logic_over_superstition/",
        "text": "Is there and sign that logical thinking is overcomintg the superstitions of religion? \n\nDid the dark ages set back humanity 1000 years in the feat?",
        "created_utc": 1511382588,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that agriculture was spread from the sinking Doggerland?",
        "author": "LePult",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7escz5/is_it_possible_that_agriculture_was_spread_from/",
        "text": "So I have recently watched [this YouTube Video](https://www.youtube.com/watch?v=dvOcK4wfIHo), which basically suggests that the Neolithic Revolution (which included the rise of agriculture) in Britain, as well as in Scandinavia and parts of Northern Europe might have been caused by people fleeing from the sinking Doggerland.\n\nThe topic is really interesting to me, but I'm kinda skeptical about it since the video doesn't stated many sources. So I'm asking if any Archeologist, Historian or anybody else knows something about this topic.",
        "created_utc": 1511369627,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone translate this scribble at my work toilet? Hieroglyphics I think",
        "author": "Jikarta",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7enapd/can_anyone_translate_this_scribble_at_my_work/",
        "text": "Hieroglyph https://imgur.com/gallery/oWESa",
        "created_utc": 1511316450,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any post armenian genocide studies?",
        "author": "amazingasvirgin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7em3va/is_there_any_post_armenian_genocide_studies/",
        "text": "I attended an anthropology conference in münich and there a professor talked about post armenian genocide. However, she was really bad and provocative and not very objective. I really do not like false information and also, dramatization of this subject. I want some facts. Do you know any book or any research on this post armenian genocide topic?\n",
        "created_utc": 1511305768,
        "upvote_ratio": ""
    },
    {
        "title": "Found what appears to be a bone tool - any ideas on origin?",
        "author": "Necrosis_KoC",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7em0ll/found_what_appears_to_be_a_bone_tool_any_ideas_on/",
        "text": "While closing up my family's lake house a few years back I found what appears to be a bone tool of some kind.  It has a sharpened tip and a socket which it appears is to rest the user's thumb - maybe for skinning hides? \n\n\nI found it in N Indiana and sent pictures to the State museum and they indicated it did appear to be crafted by human hands but I could never get anyone to actually look at it there or anywhere else.  So I thought, why not ask Reddit???  \n\n\nI would be happy to hear any ideas as to what it actually is and how old it could possibly be, I do know that the Miami Indians were known to be native to the area where it was found.\n\n\nhttps://imgur.com/RwTpf9L\n\nhttps://imgur.com/gpieNs5\n\nhttps://imgur.com/KAu8H76\n\nhttps://imgur.com/KB3KwA5\n\n\n\n\n\n\n\n\n\n\n",
        "created_utc": 1511305026,
        "upvote_ratio": ""
    },
    {
        "title": "When did humans first start wearing gloves?",
        "author": "notJustin43",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7eea9m/when_did_humans_first_start_wearing_gloves/",
        "text": "I know this seems like a dumb question, but my curiosity is killing me on this one.\n\nWhen do gloves (or evidence of) first appear in the archaeological record?",
        "created_utc": 1511229892,
        "upvote_ratio": ""
    },
    {
        "title": "Is promiscuity in non-Western and/or pre-modern societies?",
        "author": "MovingOnUpp",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7edv8u/is_promiscuity_in_nonwestern_andor_premodern/",
        "text": "(Wrote the title wrong and can't edit it now. Should be \"Is promiscuity in non-Western and/or pre-modern societies *normal*?\")\n\nI read recently about the people of the [Trobriand Islands](https://en.wikipedia.org/wiki/Trobriand_Islands#Marriage_customs) and a few other peoples with similar customs towards sex and marriage, and compared to most modern cultures in the world their attitudes and taboos towards these things seem very lax and not repressive. Is/was this normal in hunter-gatherer societies, or little known settled farming societies? And any suggestions on further reading?",
        "created_utc": 1511226050,
        "upvote_ratio": ""
    },
    {
        "title": "People's personalities are not fully developed until they are around 25, if I understand the science correctly. Do we know if, 100 years ago, before the idea of the 'teenager' was as fully developed as it is today, when most people were married with kids at 25, this was also the case?",
        "author": "td4999",
        "url": "https://www.reddit.com/r/AskHistorians/comments/7eafsw/peoples_personalities_are_not_fully_developed/",
        "text": "",
        "created_utc": 1511217064,
        "upvote_ratio": ""
    },
    {
        "title": "Do we know whether teenagers acted like teenagers before the social idea of \"teenagers\" existed (it appears as an idea to have emerged in the '40s)? Did the notion of adolescence as something different end up affecting behavior?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ecqlc/do_we_know_whether_teenagers_acted_like_teenagers/",
        "text": "[deleted]",
        "created_utc": 1511216448,
        "upvote_ratio": ""
    },
    {
        "title": "Know any documentary on Moche culture?",
        "author": "Fuxio",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7earup/know_any_documentary_on_moche_culture/",
        "text": "Looking for something that's both informative and keeps you interested as opposed to stuffed full of facts but dry and hell and with poor narration. ",
        "created_utc": 1511201180,
        "upvote_ratio": ""
    },
    {
        "title": "CMV: Intersectionality is Race Realism and its not compatible with Anthropology",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7e8hvq/cmv_intersectionality_is_race_realism_and_its_not/",
        "text": "Anthropology is a discipline that has spent the last century trying to prove that race is simply a social construct. Now some are advocating for a \"race identity\" with Intersectionality (Yes I realize you can talk about a racial identity but this belief goes much further than that into the realm of reification of the highest degree)\n\nIt has perpetuated the racial construct more than any other recent ideology and the rise of white supremacy has risen as a result, along with the isolation of many many minorities that do not identify with far-left socially liberal ideologies (see the articles below for first-hand accounts of \"progressive discrimination\")\n\nhttps://areomagazine.com/2017/11/07/on-campus-a-minority-and-reflecting-on-free-speech/\n\nhttps://areomagazine.com/2017/10/24/the-state-of-the-campus-and-womens-self-censorship/\n\nHow did this ideology become so common place in social sciences (is it even in Anthropology) what is the end goal of identifying race in this instance unlike previously, and how is removing a focus on the biggest social disparity: Class, better for people?\n\nEdit: thank you for the discussion ",
        "created_utc": 1511180490,
        "upvote_ratio": ""
    }
]