[
    {
        "title": "Question on human sexual conditioning",
        "author": "collinmcavinchey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/820rvm/question_on_human_sexual_conditioning/",
        "text": "What determines human sexual attraction? Are human children born innately attracted to certain aspects of human anatomy (i.e., breasts, muscles, buttocks, etc) or are the objects of sexual desire more the product of acculturation?\nI'm sure it's a complicated combination of the two but wanted to hear some thoughts.",
        "created_utc": 1520199390,
        "upvote_ratio": ""
    },
    {
        "title": "do any people ride oxen as steeds?",
        "author": "dieLaunischeForelle",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81xp2a/do_any_people_ride_oxen_as_steeds/",
        "text": "the traditional depiction of Lao Tse has him sitting on the back of what looks like a water buffalo. Montaigne (in *des Destriers*) claims someone told him around India they use oxen as steeds and consider it pleasurable. Both of it seems to bear little connection to the bull riding practiced as \"rodeo\" for sport in the Americas. Can anthropologists confirm there are (or were) indeed people using oxen for steeds? \n\nIs Lao Tzu doing a *divine steed* thing, as do the hindu Gods? or is it done to emphasize how very chill he was himself? (consider he is riding a bull and it looks not like a rodeo) ",
        "created_utc": 1520170702,
        "upvote_ratio": ""
    },
    {
        "title": "Please explain gender to me",
        "author": "x_Machiavelli_x",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81vep5/please_explain_gender_to_me/",
        "text": "So, gender theory confuses me beyond belief. Listening to a bunch of credible and not so much people, I have formed a general idea of how it works, but I have a suspicion that I am completely wrong, as I have yet to meet someone who would agree with me. I would appreciate it if somebody could deconstruct my argument and point out what I am getting wrong and what I am getting right. Here it goes.    \n    \n**Definitions I use**     \n*[to avoid any confusion]*    \n* Biological sex - chromosome differentiation - XX, XY and rare deviations from those.    \n* Gender - generalisation of sociocultural characteristics related to biological sex (roles assigned to males and females, appearance expectations, etc.)    \n    \n**Argument**    \nA bit of a backstory: I am from Russia and I only recently fully realised the difference between gender and sex, as such a distinction is absent in Russian language. This made me question the value of the concept of gender. What the terms sets out to describe is simply a set of arbitrary characteristics, which differ from culture to culture and create a great deal of tension in the non-scientific community. The concept of 'gender', akin to 'race' fails to capture any real existing characteristics of human beings and serves as an arbitrary divide.    \nThus, I would argue that the term is pointless. What is now called 'gender identity' does not need to be classified into categories related to biological sex, as it is much more dependent on culture than biology. Moreover, I think the \"there are only 2 genders\" camp of public opinion should agree with this too - 'gender pronouns' should refer to biological sex instead, as it is evident that they fail to meaningfully represent one's gender identity.    \nIn the end, we have fully flexible gender identity and easy-to-fill \nbinary checkboxes for website registration (sex instead of gender), no longer bound to some arbitrary characteristic.    \n    \nSomething like that. I dunno. Maybe I am not making any sense. Pls help.",
        "created_utc": 1520135816,
        "upvote_ratio": ""
    },
    {
        "title": "Are shamanistic seances/trances/visions caused by psychological disorders (depression, schizophrenia, anxiety, hysteria, etc.)?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81vc4u/are_shamanistic_seancestrancesvisions_caused_by/",
        "text": "",
        "created_utc": 1520134980,
        "upvote_ratio": ""
    },
    {
        "title": "During a talk show from Mexico, the the lady that runs the show mentioned young girls being sold and in some cases bartered for horses and cows. How common is this in the present age?",
        "author": "maripiri",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81t71q/during_a_talk_show_from_mexico_the_the_lady_that/",
        "text": "",
        "created_utc": 1520113124,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be accurate to say that humans were in the the stone age for approximately 3.4 million years?",
        "author": "KittenDust",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81qu8v/would_it_be_accurate_to_say_that_humans_were_in/",
        "text": " I need the info for a children's fact sheet, is 'human' the right word to use?",
        "created_utc": 1520091616,
        "upvote_ratio": ""
    },
    {
        "title": "How exactly did the first chiefs get their fellow villagers to carry them aloft on litters, allow them to take multiple wives, and other things that benefit solely the chief?",
        "author": "Lithide",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81nzcm/how_exactly_did_the_first_chiefs_get_their_fellow/",
        "text": "",
        "created_utc": 1520060583,
        "upvote_ratio": ""
    },
    {
        "title": "Need help identifying bones found in an abandoned graveyard",
        "author": "hotelindia",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81lxkw/need_help_identifying_bones_found_in_an_abandoned/",
        "text": "Hello,\n\nI found these bones in an abandoned graveyard, where some human remains have been known to surface. If anyone could help identify them as human or not, so that I know if this is worth notifying anyone about, I'd be very grateful. The longest long bone is around four inches long, and there are people of all different ages buried in the graveyard, if that helps.\n\n* [Overview](https://i.imgur.com/A9OZtWC.jpg)\n* [Closeup of long bones](https://i.imgur.com/l09mDoG.jpg)\n* [Another overview](https://i.imgur.com/rhmhdLK.jpg)\n\nThank you very kindly in advance.",
        "created_utc": 1520046294,
        "upvote_ratio": ""
    },
    {
        "title": "Application for field school and being underage?",
        "author": "lunch_aint_on_me",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81i0em/application_for_field_school_and_being_underage/",
        "text": "This is gonna seem like a stupid question, but on the application it asks how often you drink alcohol.(this part of the questionnaire is just for roommate compatibility) I'm 18 in the US, so should I admit to it? I only drink when given the opportunity(about once a month)and we are going to a country where the age is 18 for alcohol consumption, but I don't want to shoot myself in the foot if they reject me because I have done an illegal thing in the past.\n\nI'm thinking it won't be a big deal, but you never know. Thoughts?\n\nedit: I guess I should add that I also don't want to get left behind at the kids' table while others are bonding over drinks.",
        "created_utc": 1520023590,
        "upvote_ratio": ""
    },
    {
        "title": "Any documented instances of Hylobates activity/behavior that is directly caused by its interactions with human populations?",
        "author": "quirkfalling",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81hamg/any_documented_instances_of_hylobates/",
        "text": "Looking for instances in which gibbons may be prone to acting out of their norm in order to cope with human interaction or environmental destruction. ",
        "created_utc": 1520019877,
        "upvote_ratio": ""
    },
    {
        "title": "Caribbean discussion help",
        "author": "mickey106113",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81gz67/caribbean_discussion_help/",
        "text": "How has the geography and indigenous cultural history affected the current status of the Caribbean and its inhabitants of African descent.",
        "created_utc": 1520018196,
        "upvote_ratio": ""
    },
    {
        "title": "Do we have any idea of the origins of the 'full moon effect'? Is there anything beyond anecdotal evidence to back it up?",
        "author": "td4999",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81deev/do_we_have_any_idea_of_the_origins_of_the_full/",
        "text": "",
        "created_utc": 1519987675,
        "upvote_ratio": ""
    },
    {
        "title": "What industry was the prepared core technique used in?",
        "author": "randomDudeSomeNumber",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/81byam/what_industry_was_the_prepared_core_technique/",
        "text": "I'm a little confused. Was the prepared core technique used in the Acheulian industry or in the Mousterian Industry? If it was used in the Mousterian industry, then where does that place the disc core technique?\n\nFrom my understanding, the Prepared core technique (in particular the Levalloisian tool technique) was characteristic of the Homo Heidelbergensis, which used Acheulian tools until the middle Paleolithic. However, didn't Neanderthals also use this technique? When did they make the transition to disk core technique? \n",
        "created_utc": 1519967436,
        "upvote_ratio": ""
    },
    {
        "title": "Best undergraduate colleges for paleoanthropology/archeology",
        "author": "Australopithecus98",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/816ifp/best_undergraduate_colleges_for/",
        "text": "Hello everyone\n\nI've been fascinated with human evolution since 9th grade. It seems like an undergraduate degree in anthropology covers all the subfields (cultural anthropology, biological anthropology, linguistic anthropology, and archaeology). However, are there any schools on the eastern coast of United States that have an undergraduate degree in just archaeology or Paleoanthropology? Or just any schools with degree programs like that in the U.S in general?\n\nThank you for your help!",
        "created_utc": 1519921794,
        "upvote_ratio": ""
    },
    {
        "title": "Eskimo kinship subsystems",
        "author": "FabulousAstronaut",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8167jd/eskimo_kinship_subsystems/",
        "text": "I've been reading about the different kinship systems, and I understand that most (if not all) European languages use the Eskimo kinship system.\n\nHowever to me, there seems to be two subtypes  that have to do with cousin terminology.\n\nDoing some research, I've been able to discover two different terminology systems within the Eskimo kinship. The difference has to do with how each language specifically categorizes the different cousins. I call one the English-French system, and the other the Spanish-German system.\n\nBoth systems are in agreement of what is a 1st cousin, 2nd cousin, etc. The difference comes when referring to the ancestors and descendents of these cousins. Take for example the son of a grand uncle, and the term in each language:\n\n* English: First cousin once removed.\n* French: Cousin germain éloigné au 1er degré (First cousin removed one degree)\n* German: Onkel 2. Grades (Uncle 2nd degree)\n* Spanish: Tio segundo (Second uncle)\n\nAnd the terms for the son of a first cousin:\n\n* English: First cousin once removed.\n* French: Cousin germain éloigné au 1er degré (First cousin removed one degree)\n* German: Neffe 2. Grades (Nephew 2nd degree)\n* Spanish: Sobrino segundo (Second nephew)\n\nIt's obvious to see that the major difference here is that, in the English-French system most of these kinshsip relations are cousins (or systematically X cousin Y removed), whereas in the German-Spanish system the only cousins are the ones that share the same number of generations to the common ancestor, with all the ancestors of a cousin being an uncle/aunt, and all the descendants of a cousin being nephews/nieces.\n\nFunny thing, is that I cannot find online any reference to these subsystems. I'm writing a genealogy article on this, and I'd like to call them something else than English-French and Spanish-German.\n\nSee some relationship charts for the different languages here:\n\n* [English](https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/CousinTree.svg/884px-CousinTree.svg.png)\n* [French](http://cerclegenealogiquedelanguedoc.pagesperso-orange.fr/activites/Degredeparente.jpg)\n* [German](https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/European_kinship_system_de.svg/576px-European_kinship_system_de.svg.png)\n* [Spanish](https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Relatives_Chart_es.svg/1200px-Relatives_Chart_es.svg.png)\n\nI've confirmed these wikipedia charts with non-Wikipedia sources ",
        "created_utc": 1519919473,
        "upvote_ratio": ""
    },
    {
        "title": "What do guys in nude cultures find attractive?",
        "author": "candelalgebra",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/813r5w/what_do_guys_in_nude_cultures_find_attractive/",
        "text": "Here men love to see breasts and everything else a bathing suit covers. Since that's visible 24/7 in some places, what do men there find attractive? What do they talk about with other guys, or fantasize about?\n\nEDIT: It doesn't look like anybody really had an answer so far, so I'll add a couple of things:\n\n1) for those who've done field research, what is men's locker room talk / young men's idealization about? For example, when they're alone together, one says, \"Did you see Trina. She's got amazing ____.\" Or \"Janet is the hottest girl in our tribe right now. Every man wants her because of her ____.\"\n\n2) Info could also come from folklore stories, where a woman's traits are described to make it understood she's desirable.\n\n3) What women prize most about their physicality / accentuate in talks about marriage, lament the loss of / are visually prideful about having as a quality because it attracts men / makes one woman stand out among her peers because of her quality\n\n4) It could also come from \"make-up\" and body adjustments, where women try to make themselves seem more one way or the other, or to make a body part look more one way or the other.",
        "created_utc": 1519892290,
        "upvote_ratio": ""
    },
    {
        "title": "Is anthropology a good complement to psychology?",
        "author": "marcmjm",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/811qpq/is_anthropology_a_good_complement_to_psychology/",
        "text": "The reason I ask is because today, I switched my minor from sociology to anthropology, mostly for scheduling reasons. I am nonetheless interested in anthropology, possibly more so than sociology. But do you think it would go hand-in-hand with psychology? Why or why not? I am a psych major by the way.",
        "created_utc": 1519869940,
        "upvote_ratio": ""
    },
    {
        "title": "Pursuing a masters in Archaeology?",
        "author": "hairypickle1138",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80zvg3/pursuing_a_masters_in_archaeology/",
        "text": "I'm currently in college pursing a Bachelors in Business. Ive recently developed a love for archaeology and want to pursue it as a career later on. My question is that would I be accepted into any quality graduate program even though my degree doesn't relate to archaeology? Any other contributing factors that might help? thanks",
        "created_utc": 1519854011,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a study on whether the world views Buddhism as a religion or philosophy?",
        "author": "yozzle",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80xs17/looking_for_a_study_on_whether_the_world_views/",
        "text": "Hi,\n\nI am currently writing a research paper for my history of Zen Buddhism class and am hoping to find a study showing how views of Buddhism have changed from viewing it as a religion to a philosophy. Specifically after 1893, but any study would help. I have found many articles asking whether it is a religion or a philosophy but no data. A western centric study could work as well.\n\nThanks if anyone can help!",
        "created_utc": 1519838717,
        "upvote_ratio": ""
    },
    {
        "title": "Can anthropology reliably determine that a burned fragment such as this is human and which part of the skeleton?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80wr86/can_anthropology_reliably_determine_that_a_burned/",
        "text": "[deleted]",
        "created_utc": 1519830910,
        "upvote_ratio": ""
    },
    {
        "title": "Why do tribes still appear to have male leaders?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80s79j/why_do_tribes_still_appear_to_have_male_leaders/",
        "text": "I always learned in school that hunter-gatherer bands and tribes were more egalitarian, and therefore were not patriarchies. I learned more recently in college that bands and tribes have no \"archy\" and therefore cannot have \"patriarchy,\" but also in nearly every single account we've read of Papua New Guinean tribes, the Nuer (tribe), the potlatch communities of the Pacific (tribes), the San (band), or the Inuit (band), the community leaders (\"big men\" or others who tend to be persuasive, lead potlatches, etc.) are always male. Why is this? Is male leadership just the human default? \n\n\n\n*Side note: We've learned in my northern cultural geography class that female shamans are considered to be more powerful among circumpolar societies, but to me that doesn't necessarily indicate that women in general are considered to hold political power.*",
        "created_utc": 1519782450,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a legitimate book on gobekli tepi",
        "author": "profesh_2_death",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80n7za/looking_for_a_legitimate_book_on_gobekli_tepi/",
        "text": "I've watched a few youtube videos and read the wikipedia article. It seems like something that would be really interesting to read about.\n\nHowever it seems like there might a lot of speculation or nonsense written about it, and I'd like to avoid wasting time on books like that. Can someone recommend an objective, fact-based book on gobekli tepi?",
        "created_utc": 1519744971,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between a bride-price and a dowry? What kind of economic, geographic, or cultural conditions would give rise to one or the other?",
        "author": "phenomenomnom",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80n7pf/what_is_the_difference_between_a_brideprice_and_a/",
        "text": "I promise I'm not doing anthropology homework -- I wish I were!  I just saw \"bride price\" on the Wikipedia article about the Suri of Ethiopia and I'm curious about this. Thanks for any info.",
        "created_utc": 1519744919,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"ancient matriarchy\" a real thing?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80fwfr/is_ancient_matriarchy_a_real_thing/",
        "text": "I thought this had been debunked, but my cultural geography professor told me during office hours that the ancient default was matriarchy (defined as women being the heads of households). She even cited the findings of old idols all being female and then later transitioning to male as evidence. \n\n\nIs this true? Or is my professor just outdated? ",
        "created_utc": 1519674831,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research into what the most basic symbols/writing sed by humans around the word are and cross-culture similarities (or differences) in their meaning?",
        "author": "PolymathArtisan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80f902/is_there_any_research_into_what_the_most_basic/",
        "text": "Hi, I wondeed if there is any research into what the most fundamental (writtend/painted)symbols used by humans are and if they have roughly consistent meanings across cultures.\n\nThe fundamental symbols I'm talking about I suppose are a bit like radicals in Kanji. They are simple shapes or groupings, which crop up again and again in lots of different settings, combinations and cultures. Things like 'short vertical line', 'filled circle', 'empty cirlce', 'short horizontal line' etc. Granted these often come up in natural forms as well, but their simplicity and the seeming intuitiveness with which people use them (around me, I'm only going by anecdotal experince to frame this question) made me wonder if they had consistent use and meaning across different cultures?\n\nPerhaps such meanings could have come from relatiopnships between the symbols and things which are comon to all people, such menaings of 'hand' as a symbol being similar aorund the world?\n\nTo give you a flavour of the comparative aspect I'm interested in, I recently discovered the work of Joseoph Campbell, and was fascinated by the universality of the traits he finds in myths. It is this 'all humans, even in seemingly independent cultures' aspect which I wanted to ask about.\n\nAny referalls to prior work, or just discussion in the comments is great. Thanks\n\n***\n\n_Sorry if this is posted in the wrong place, I wasn't quite sure. Also sorry for the laboriously worded title._",
        "created_utc": 1519669888,
        "upvote_ratio": ""
    },
    {
        "title": "Are religious practices an example of culture?",
        "author": "FightMiilk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80dnm8/are_religious_practices_an_example_of_culture/",
        "text": "Sorry if this should be obvious!\nIm writing an essay on why culture is a political issue and wanted to talk about the issue of the practice of male circumcision being prohibited in some places. Often it's done as part of religious ritual so is it acceptable for me to write about it as an example of culture?\nThank you! :)",
        "created_utc": 1519657718,
        "upvote_ratio": ""
    },
    {
        "title": "Recently saw a documentary about a tribe where young women have an item of gold that they can use for passage home.",
        "author": "superiguana",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80b015/recently_saw_a_documentary_about_a_tribe_where/",
        "text": "I am not referring to the gold neck rings of the Ndebele or Kayan. It was something more cosmetic and I'd like to think I remember it being a Southeast Asian group. In the documentary the locals described it/them as something that young women could use to \"barter for passage back home.\" Does anyone know which tribe/group I'm thinking of?",
        "created_utc": 1519627254,
        "upvote_ratio": ""
    },
    {
        "title": "What is the anthropological explanation for some rural whites' fascination/identification with Native Americans?",
        "author": "whole_nother",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/80960l/what_is_the_anthropological_explanation_for_some/",
        "text": "I know and know of many country folk who are fascinated with Indian lore, arrowheads, etc. Many claim descent from Indians despite a total lack of proof.\nIs there a name or explanation for the phenomenon of a victorious culture revering and even adopting aspects of the vanquished culture in this way?",
        "created_utc": 1519607968,
        "upvote_ratio": ""
    },
    {
        "title": "Outlets for angry young men in traditional societies?",
        "author": "beelzebubs_avocado",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/803u84/outlets_for_angry_young_men_in_traditional/",
        "text": "It seems like we have a problem of (mostly) young men becoming dissatisfied with their social position and acting out in a violent way.\n\nDid pre industrial societies also had this issue and if so, did they find a way to channel it in a less harmful direction?\n\nI suppose the obvious answers would be hunting or raiding. But I'm curious what the experts have to say.",
        "created_utc": 1519556454,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any good works on the anthropology of sexuality?",
        "author": "Apiperofhades",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zvljf/are_there_any_good_works_on_the_anthropology_of/",
        "text": "I’ve been researching philosophy of sexuality so I can work on a sexual ethic. I think to supplement my study I would like a wider knowledge of sexual practices across the spectrum. Are there any books about this that could help me? ",
        "created_utc": 1519464391,
        "upvote_ratio": ""
    },
    {
        "title": "Are all early American Continent inhabitants (North &amp; South) related to the same original groups thought to have arrived through the Bering Straight?",
        "author": "Odd_craving",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zuhf4/are_all_early_american_continent_inhabitants/",
        "text": "",
        "created_utc": 1519448641,
        "upvote_ratio": ""
    },
    {
        "title": "Black Panther - a movie that should sparkle an anthropologist's mind. If you've watched it - what were your thoughts?",
        "author": "LePouletMignon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zscx8/black_panther_a_movie_that_should_sparkle_an/",
        "text": "For those who aren't aware: Black Panther is a superhero movie about a fictional African state named \"Wakanda\". Wakanda is a hidden technological marvel that the world yet does not know much about. The peculiar thing about the movie is the mostly non-white cast.\n\nI won't post spoilers here, but the movie really does, either directly or indirectly, speak of slavery, colonialism, greed, injustice and racism. It is quite fascinating how, despite it's main marketing scheme being the superhero, it manages to bring forth all these tragedies of the world, both new and old.\n\nI found it to be an important contribution to our imagining of the future. It's an alterantive narrative of what the world could be like; it attempts to reach out and convey to all humans that we should be helping each other instead of isolating a select wealthy few while condemning the rest.\n\nTo me, this was much more than a superhero movie. I recommend a watch if you haven't already. For those of you who have already watched it - What were your thoughts?",
        "created_utc": 1519427239,
        "upvote_ratio": ""
    },
    {
        "title": "What do we know about the origins of \"Winter gift bringing man\" traditions around the world?",
        "author": "largePenisLover",
        "url": "https://www.reddit.com/r/AskHistorians/comments/7zgg9o/what_do_we_know_about_the_origins_of_winter_gift/",
        "text": "",
        "created_utc": 1519417008,
        "upvote_ratio": ""
    },
    {
        "title": "Forensic Anthropology question",
        "author": "heroinsoap666",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zqd0q/forensic_anthropology_question/",
        "text": "I’m currently in college getting my bachelors in science, my interest has been surgery and forensic pathology but I recently learned about forensic anthropology and my internet was piqued. I wanted to talk to someone in the field if possible and get some insight if it’s worth pursuing? From what I’ve read I know it’s highly specialized but does that mean there aren’t many field jobs, mostly just teaching jobs?",
        "created_utc": 1519411444,
        "upvote_ratio": ""
    },
    {
        "title": "Has ADD always been so prevalent?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7znc8g/has_add_always_been_so_prevalent/",
        "text": "[deleted]",
        "created_utc": 1519384531,
        "upvote_ratio": ""
    },
    {
        "title": "How does the meaning of the term \"chieftain\" differ among the many historical societies for which it is used, such as Native Americans, Altaic peoples, Greeks/Anatolians, Celts, Bantu peoples, Siberian peoples, and others?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zn2bt/how_does_the_meaning_of_the_term_chieftain_differ/",
        "text": "[deleted]",
        "created_utc": 1519380868,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any references to Neanderthals in ancient texts or drawings?",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zlhox/are_there_any_references_to_neanderthals_in/",
        "text": "Or Denisovans or any other ones?",
        "created_utc": 1519361258,
        "upvote_ratio": ""
    },
    {
        "title": "Tobacco plants",
        "author": "perudan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zjfxb/tobacco_plants/",
        "text": "\nIn the northeast USA, can native american tobacco plants be found today?  (growing wild/unattended)\n\n",
        "created_utc": 1519342243,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that Neanderthals taught Homo Sapiens language?",
        "author": "gardano",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zhi5k/is_it_possible_that_neanderthals_taught_homo/",
        "text": "I just read [this article](https://www.buzzfeed.com/danvergano/neanderthal-cave-art?utm_term=.foK1bRWgY#.cem2xRNvD) on buzzfeed that reports that the oldest art found so far might very well be Neanderthal -- with the implication that language was also involved.\n\nGiven the great time periods involved, is it possible that symbolic thinking and language came from them?",
        "created_utc": 1519327108,
        "upvote_ratio": ""
    },
    {
        "title": "How did traits that are often perceived as \"demonic\" in Western culture become so?",
        "author": "Porkadi110",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zglqf/how_did_traits_that_are_often_perceived_as/",
        "text": "I'm talking about things like horns, red eyes, bat like wings and claws, spade tails, etc.",
        "created_utc": 1519320444,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for any information on traditional designs European tribal tattoos.",
        "author": "thesprung",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zd7xf/im_looking_for_any_information_on_traditional/",
        "text": "Hi, so I'm interested in European tribal tattoos, specifically the designs/symbols the different tribes wore. I ran across the Picts but that's about all I can find. It seems like those traditions weren't transcribed much when civilization kept advancing. ",
        "created_utc": 1519286061,
        "upvote_ratio": ""
    },
    {
        "title": "What is the relationship between culture, technology and natural selection?",
        "author": "spiralsandjeremy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7zcimh/what_is_the_relationship_between_culture/",
        "text": "I'm interested especially if anyone can point me towards some reading on this. \n\nHuman beings obviously display vast cultural and societal differences as well as a bedrock of underlying similarities and an unparalleled capacity to manipulate the world of matter through technology. All of this is constantly in flux, and it seems to me that there is a kind of progression to it, at least in terms of its increasing complexity, normative questions aside. Our ability to mold and constantly remold culture and society as well as increase our power over the natural world comes from biological roots in our physiology and cognitive capabilities, so what relationship does it have to human evolution? Its power is obviously that it changes at a much faster rate than genetics, but does it follow the same basic logic?",
        "created_utc": 1519277684,
        "upvote_ratio": ""
    },
    {
        "title": "How does the concept of evil got created culturally speaking ? Is there a pattern among cultures?",
        "author": "SpaceKraken420",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7z6l6u/how_does_the_concept_of_evil_got_created/",
        "text": "My question doesn't concern the countries where Christianism got involved, I mainly seek answers for other cultures.\n\nN.B: I don't do anthropological studies so I don't know if I expressed myself clearly. If the question is too broad, feel free to ask questions and point me out to some schools, trains of thought or cultures.\n\nThanks",
        "created_utc": 1519228872,
        "upvote_ratio": ""
    },
    {
        "title": "Do matrilineal societies value female virginity/chastity, or restrict female sexuality?",
        "author": "Cordial_Cherry",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7z5j3x/do_matrilineal_societies_value_female/",
        "text": "I'm looking for sources on sexuality in matrilineal societies. In most of the world women's sexuality has traditionally been highly restricted, with some severe punishments for defying cultural norms. If i understand correctly this was in part due to the need to keep the male line of descent/inheritance \"pure\". Basically, I'm wondering if the absence of a male line of inheritance would have an impact on women's sexuality and sexual freedom? Do matrilineal societies have any reason to care about female virginity or restrict female sexuality?",
        "created_utc": 1519219821,
        "upvote_ratio": ""
    },
    {
        "title": "Are modern Jewish people Semitic in name only? Aren't Arabs &amp; Palestinians the true Semites?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7z0f1n/are_modern_jewish_people_semitic_in_name_only/",
        "text": "[removed]",
        "created_utc": 1519167271,
        "upvote_ratio": ""
    },
    {
        "title": "Did the Romans ever record how they were able to move and lift the Trilithon stones at Baalbek?",
        "author": "curiousman9934",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yzcuc/did_the_romans_ever_record_how_they_were_able_to/",
        "text": "I read somewhere that Roman cranes were only able to lift up to 6 tons. ",
        "created_utc": 1519159599,
        "upvote_ratio": ""
    },
    {
        "title": "Why did so many cultures all around the world believe in the existence of souls?",
        "author": "elo3800",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yvk43/why_did_so_many_cultures_all_around_the_world/",
        "text": "It is clear to me that the natural phenomena was explained by supernatural beings, but what exactly did souls explain and simplify? ",
        "created_utc": 1519130209,
        "upvote_ratio": ""
    },
    {
        "title": "What is the significance of the findings in Dmanisi, Georgia in 2010?",
        "author": "elo3800",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yv91a/what_is_the_significance_of_the_findings_in/",
        "text": "I have heard that this finding has made it possible that the first hominids were from Eurasia, not Africa. Is there any general consensus about this finding?",
        "created_utc": 1519126677,
        "upvote_ratio": ""
    },
    {
        "title": "Did the R1a and R1b haplogroups, now associated with Europe and India, descend at least in part, from Southeast Asians? Also, how are there samples of R1b in Cameroon and Chad given how the Sahara mostly limited migration?",
        "author": "TortaDelBBQ",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ys8mk/did_the_r1a_and_r1b_haplogroups_now_associated/",
        "text": "",
        "created_utc": 1519091609,
        "upvote_ratio": ""
    },
    {
        "title": "Do poems/epics actually inspire civilizations?",
        "author": "le57percent",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yrt7s/do_poemsepics_actually_inspire_civilizations/",
        "text": "There are many countries and nations that have their own epics, can these in any way be attributed to the formation of these nations? I've heard people attribute some epics to the birth of civilizations but I don't know if they actually mean that or they're just being poetic.",
        "created_utc": 1519087729,
        "upvote_ratio": ""
    },
    {
        "title": "Why have humans, at least, in western cultures, evolved to have 3 meals?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ym9rh/why_have_humans_at_least_in_western_cultures/",
        "text": "I found myself wondering why, at least in North America and Europe (I apologize if I am oversimplifying) specifically have 3 meals in a day, instead of 2, 4, 5, etc.\n\nFollow-up question: are there any cultures that had different tendencies relating to this topic?\n\nThanks :)",
        "created_utc": 1519042825,
        "upvote_ratio": ""
    },
    {
        "title": "for present/current culture as it relates to technology, could we please get some more youtubes, blogs, resources, sites, etc. on such an important topic of culture",
        "author": "curiousone6151",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ym1u6/for_presentcurrent_culture_as_it_relates_to/",
        "text": "and any other topic of culture that is representative present/current culture \n\n",
        "created_utc": 1519040071,
        "upvote_ratio": ""
    },
    {
        "title": "Can Anthropology help explain hierarchy/oppression?",
        "author": "frangipane17",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ylknm/can_anthropology_help_explain_hierarchyoppression/",
        "text": "How can the past/historical events help explain oppression and hierarchy in today's society? Does it affect how society react to oppression and hierarchy? ",
        "created_utc": 1519033338,
        "upvote_ratio": ""
    },
    {
        "title": "What is the job market like in Anthropology?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ylbe3/what_is_the_job_market_like_in_anthropology/",
        "text": "[deleted]",
        "created_utc": 1519029529,
        "upvote_ratio": ""
    },
    {
        "title": "What triggered the transition from an egalitarian hunter-gatherer society to a hierarchical and more individualistic agrarian one?",
        "author": "Scalybeast",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yl12i/what_triggered_the_transition_from_an_egalitarian/",
        "text": "I am listening to a book on human sexuality and its evolution. They assert that when humans where living as hunter-gatherers they practiced sexual egalitarianism where male and female partners were freely shared within the group.  The book then states that with the rise of agriculture humans transitioned to individual families. Is this true? If yes, why would this happen? Wouldn’t it make more sense to have all the members of the group contribute on a single large farm instead of instead of smaller independent units?",
        "created_utc": 1519025459,
        "upvote_ratio": ""
    },
    {
        "title": "How did we go from sharing everything to caring about personal property?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ykukk/how_did_we_go_from_sharing_everything_to_caring/",
        "text": "[deleted]",
        "created_utc": 1519023102,
        "upvote_ratio": ""
    },
    {
        "title": "Is it realistically possible to go to live with an extant hunter-gatherer society for an extended period of time to learn how to live that way? If so how?",
        "author": "PolymathArtisan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yftzu/is_it_realistically_possible_to_go_to_live_with/",
        "text": "There is a _lot_ of personal context to this question and my own reasons for wanting to do this. If you're interested or think it's important I explain, I can elaborate, but I won't bore you now. \n\nI want to learn about the realities of hunter-gatherer life, especially in 'primitive' (not reliant on modern technologies) societies/tribes/bands. My question is whether this is realistically possible by going to live, alone (as in not taking a camera crew or similar) as a member of such a society, for _at least_ a couple of years. \n\nAnd If the answer to the above is 'yes, it is possible', my next question is 'how and where?'. I can't find a comprehensive resource for modern hunter-gatherer societies anywhere. Even I could, I wouldn't know where to begin with approaching such a society, with language, etiquette, or contact (know any Sentinelese with a Reddit account?). \n\nAny and all help and advice is appreciated!",
        "created_utc": 1518976013,
        "upvote_ratio": ""
    },
    {
        "title": "Could Acheulean hand axes have been used as money?",
        "author": "t_rolling_u",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yffah/could_acheulean_hand_axes_have_been_used_as_money/",
        "text": "Kent Parker has written extensively about the economic systems of early hominins, including Australopithecus afarensis and Homo erectus. His hypothesis mostly revolves around the idea that early hominins exchanged food items for acts of sexual gratification, and that later economic systems of hominins like Homo erectus begin with this idea of exchange, and quid pro quo arrangements.\n\nThere seems to be a lot of debate about how hand axes were used. Some people have suggested that they were just used as tools, While others have argued that they played a role in some kind of mating display.\n\nPersonally, I think that they were used as currency. Instead of exchanging food items, a homo erectus could either exchange an entire hand axe, or knock a flake off and exchange that. The quality of the lithic material, the quality of the knapping that produced the hand axe, and the nature of the exchange would dictate how large a hand axe was in the first place, and how quickly one was reduced from a large rough tool to a smaller and much more heavily flaked tool.\n\nIn this way, marriage relationships could have been sealed among different partners in Homo erectus societies. The large numbers of unused hand axes found at some sites might even have been part of some kind of dowry.\n\nI have not come across this idea anywhere in the anthropological literature, and I would like to publish it before someone else scoops me. But I don't know which journal would be the best place to publish it.\n\nCan anyone here suggest a good journal for this article?",
        "created_utc": 1518972582,
        "upvote_ratio": ""
    },
    {
        "title": "What does it say about the universality of human behaviors that the Aztec and Inca Empires looked so similar to those of Eurasia, though separated for tens of thousands of years?",
        "author": "spiralsandjeremy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7yd994/what_does_it_say_about_the_universality_of_human/",
        "text": "I'm just curious to know what anthropologists have to say about this. Of course, this is a historical question, nothing can be empirically verified, but it seems to me that the discovery of the New World was a laboratory that we may never see again in the history of our species, unless we discover sentient life on another planet one day. \n\nWhat does it say about the universality of the human experience that the Aztecs and Incas developed in a direction so reminiscent of early Mesopotamian, Egyptian, Indus Valley civilizations?",
        "created_utc": 1518944952,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence of Australopithecines caring for the elderly or burying their dead?",
        "author": "bahamanana",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7y8zjw/is_there_any_evidence_of_australopithecines/",
        "text": "And if not who were the first early humans to do so?",
        "created_utc": 1518897529,
        "upvote_ratio": ""
    },
    {
        "title": "Shaka Zulu",
        "author": "chandler404",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7y4ht4/shaka_zulu/",
        "text": "I was sent here by the good people of r/askhistory in hopes y'all could help me. \n\nIwant to learn more about Shaka Zulu.  What's a good (not too dense) book that can introduce me to the Zulu tribe?",
        "created_utc": 1518841102,
        "upvote_ratio": ""
    },
    {
        "title": "what are good sites, blogs, youtubes, etc. on current culture and cultural anthropology in various highly developed places like australia, switerland, usa, sweden, etc.?",
        "author": "curiousone6151",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7y3vb2/what_are_good_sites_blogs_youtubes_etc_on_current/",
        "text": "what are good sites, blogs, youtubes, etc. on current culture and cultural anthropology in various highly developed places like australia, switerland, usa, sweden, etc.?\n",
        "created_utc": 1518833736,
        "upvote_ratio": ""
    },
    {
        "title": "What does r/askanthropology think of Donald Brown's list of universal human traits?",
        "author": "twiggez-vous",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7y3bwa/what_does_raskanthropology_think_of_donald_browns/",
        "text": "Background from [Wikipedia](https://en.m.wikipedia.org/wiki/Human_Universals):\n\nHuman Universals is a book by Donald Brown, an American professor of anthropology (emeritus) who worked at the University of California, Santa Barbara. It was published by McGraw Hill in 1991. Brown says human universals, \"comprise those features of culture, society, language, behavior, and psyche for which there are no known exception.\" Steven Pinker has referenced Professor Brown's work in 'The Blank Slate', including the list as an appendix. \n\nThe full list of human universals can be downloaded [here](http://joelvelasco.net/teaching/2890/brownlisthumanuniversals.pdf), but I'll include the list in the comments. \n\nDoes anyone here disagree with anything on the list? Are there any surprising inclusions that you agree with?\n\nEdit: If anyone finds the lists in the comments too cumbersome and/or unnecessary, please downvote away and I'll remove them in a few hours. In any case, I will be upvoting replies so the list will be at the bottom of the thread.",
        "created_utc": 1518828172,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain to me the relation of the ACTN3 gene to ethnicity?",
        "author": "DiabolikDownUnder",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xx1mp/can_someone_explain_to_me_the_relation_of_the/",
        "text": "I've seen conflicting popular science articles which claim ACTN3 is either genetically more common in people of West African descent or merely more common in certain populations originating in this part of the world.\n\nCould someone help clarify what the current consensus is regarding ACTN3's prevalence?",
        "created_utc": 1518764144,
        "upvote_ratio": ""
    },
    {
        "title": "Ethnolinguistic Diversity &amp; Poverty",
        "author": "UnityByNsibidi",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xssgd/ethnolinguistic_diversity_poverty/",
        "text": "I have noticed that the poorest countries in the world are usually the most ethnolinguistically diverse, whereas the most powerful/richest countries are the most homogeneous.  Is a significant reduction in diversity necessary for a country to grow and become powerful (in terms of control of natural and human resources)?",
        "created_utc": 1518722563,
        "upvote_ratio": ""
    },
    {
        "title": "Are race and ethnicity the same thing, and if not what makes race a bad category and ethnicity a good category?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xs35s/are_race_and_ethnicity_the_same_thing_and_if_not/",
        "text": "Bad and good as making useful distinctions",
        "created_utc": 1518716921,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a culture where evil lives in the sky and good lives below ground?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xfcir/is_there_a_culture_where_evil_lives_in_the_sky/",
        "text": "Today in Northern Geography class, we learned that in all shamanistic religions, the ground/underground is believed to inhabit evil spirits, whereas the sky holds gods/good spirits. This seems quite similar to our own mythology/Greek mythology/etc.\n\n\nI always thought that people viewed the ground as the \"land of the dead\" because they buried their dead there, but we also learned today that many northern cultures do *not* bury their dead, and it occurred to me that many other cultures don't, as well, but cremate or set people out to sea. \n\n\n\nSo is there any culture where ground = good and sky = evil? Is there an exception to this? ",
        "created_utc": 1518580769,
        "upvote_ratio": ""
    },
    {
        "title": "Where to purchase this mat? (Archaeology)",
        "author": "brother_van",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xf97r/where_to_purchase_this_mat_archaeology/",
        "text": "I was wondering where photo mats like the one in the photo can be purchased. I have a set of metric scales, but would like to purchase a mat for photos of points and artifacts from my personal collection.\n\nhttps://imgur.com/gallery/dcQpb",
        "created_utc": 1518579794,
        "upvote_ratio": ""
    },
    {
        "title": "Graduate programs for Maya archaeology",
        "author": "LadySixSky",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xebnl/graduate_programs_for_maya_archaeology/",
        "text": "I'm a junior majoring in anthropology, and I'm really interested in pursuing a PhD in Maya archaeology, especially Maya epigraphy. This spring I've started working on a senior thesis about Maya marriage alliances. \n\nSo far I have Tulane and UT Austin on my list of places with good Maya offerings. Does anyone have any other suggestions?",
        "created_utc": 1518570464,
        "upvote_ratio": ""
    },
    {
        "title": "Why do Spain and Armenia have low Muslim populations?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xcbju/why_do_spain_and_armenia_have_low_muslim/",
        "text": "[deleted]",
        "created_utc": 1518553191,
        "upvote_ratio": ""
    },
    {
        "title": "Besides the Mayan, Olmec, Aztec and Inca, who else inhabited Pre-Colombian South America?",
        "author": "AcidBitter",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xc2ka/besides_the_mayan_olmec_aztec_and_inca_who_else/",
        "text": "I know other people must have, because were taught that the Aztecs would conquer other people and sacrifice them and that when the Spanish arrived those other tribes helped them fight against the Aztec.\n\nSo who were these other tribes? Were they just small community with no real importance? \n\nAnd why, despite the Mayan Empire existing longer and the Spanish burning Aztec writings, do we know more about the Aztecs than Mayans? ",
        "created_utc": 1518551212,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding unethical acts during field work",
        "author": "Oskar2323",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xbsrl/question_regarding_unethical_acts_during_field/",
        "text": "I am reading Colin M Turnbulls book, The Mountain People. On page 132 he tries to save a child that is about to starve to death. The mother and father then kills her after some days. But is this an unethical and selfish act on Turnbulls side? isn´t his job to passively note and observe the cultural phenomenons?",
        "created_utc": 1518549092,
        "upvote_ratio": ""
    },
    {
        "title": "Thresholds, guests and the home: are there any studies of the superstitions related to this?",
        "author": "hoenykidney",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7xarzj/thresholds_guests_and_the_home_are_there_any/",
        "text": "I'm doing some research into superstitions relating to thresholds and entryways, and guests in homes. I've been unable to find any books or complete articles devoted to this and so far have been hopping between different texts on folklore. I'm particularly looking for references to this in the history of the British Isles.\n\nFor example: first-footing, spirits or beings having to get permission to enter a dwelling (eg vampires), liminal boundaries of holy ground, warding marks etc on doors.\n\nDoes a specific study or collation of such superstitions exist? Could you suggest any recommended reading around the topic?",
        "created_utc": 1518541042,
        "upvote_ratio": ""
    },
    {
        "title": "What’s your take on cultural relativism? Has that shaped your opinion on campus free speech and PC culture?",
        "author": "Hyejinks",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7x7a87/whats_your_take_on_cultural_relativism_has_that/",
        "text": "I’m an undergrad student and like most colleges campuses around the country, the campus free speech debate continues to rage on. \n\nIn particular, I’ve witnessed a faculty split within the anthropology department — there are some professors who are the most vocal supporters of student activism against hate speech. Others are more conservative. \n\nI’ve taken classes with both and am noticing a trend in their attitude towards PC culture and how they taught Boas’ theory of cultural relativism. Is this just a coincidence?\n\nHow could this century-old debate in anthropology inform the free speech movements on college campuses? ",
        "created_utc": 1518500260,
        "upvote_ratio": ""
    },
    {
        "title": "throughout the *initial* migratory era of peoples out of central Africa central Africa, were there any settlers who were able to successfully traverse the Gibraltar Strait?",
        "author": "deeper_insider",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7x79pf/throughout_the_initial_migratory_era_of_peoples/",
        "text": "Like, a long time before peoples who moved through the middle east and/or eastern europe; western asia.\n\n\n/r/AskHistorians mods suggest I post this question here instead.  thank you for any insight:)",
        "created_utc": 1518500092,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for human-centric Evolution/ Ecology videos that also have correct Anthropology.",
        "author": "dreadcanadian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7x45gb/looking_for_humancentric_evolution_ecology_videos/",
        "text": "Hello,\n\nI'm a high school Biology teacher who teaches evolution, and have come to realize that some of the more popular evolution videos have some Anthropology errors.    I would appreciate some thoughts on better videos, so I am not accidentally giving my students bad Anthropology .\n\n\n(Here are a couple of examples of popular evolution /ecology videos that include human culture aspects, to get the conversation started:\n\nEvolution PBS \"The Mind's Big Bang\"\n\nHuman Planet - BBC (entire series)\n\nBlue Planet 2: Cities (Ecology)\n\nNOVA:  World in the Balance (Demography)",
        "created_utc": 1518470613,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if kinship did not exist?",
        "author": "Oskar2323",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7x3rwj/what_would_happen_if_kinship_did_not_exist/",
        "text": "",
        "created_utc": 1518467599,
        "upvote_ratio": ""
    },
    {
        "title": "The recent findings on Chedder man say that he likely had dark skin and blue eyes, was this combination common 10,000 years ago?",
        "author": "scuffmuff",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7x14n8/the_recent_findings_on_chedder_man_say_that_he/",
        "text": "Amongst modern populations youre unlikely to find someone with naturally dark skin with blue eyes, was this just more common 10,000 years ago and why dont we find more people like this today?",
        "created_utc": 1518446286,
        "upvote_ratio": ""
    },
    {
        "title": "Globalization has made the world bigger, but can it be that because of globalization the world have shrinked?",
        "author": "Oskar2323",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7x0q6w/globalization_has_made_the_world_bigger_but_can/",
        "text": "Globalization has made the worlds \"playing field\" bigger with technology and communication. Everything moves faster, people, goods and information. But if you think about globalization through a time and space aspect, could you say that the world has become smaller?",
        "created_utc": 1518442260,
        "upvote_ratio": ""
    },
    {
        "title": "Was the story of Rapunzel about waiting until puberty?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wxziz/was_the_story_of_rapunzel_about_waiting_until/",
        "text": "[deleted]",
        "created_utc": 1518406450,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any anthropological accounts of fascism from the 1930s-40s?",
        "author": "SegmentedState",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wxip5/are_there_any_anthropological_accounts_of_fascism/",
        "text": "I was recently reading an article on the increasing study of new alt-right and neo-nazi movements in America and Europe and it got me thinking.\n\nDoes anyone know of any accounts by anthropologists from the 1930s-40s in Germany or Italy? If not by anthropologists, perhaps other social scientists and their first hand experience of the rise and/or experience under fascism. \n\nThanks. ",
        "created_utc": 1518401560,
        "upvote_ratio": ""
    },
    {
        "title": "What is the Aquatic Ape Hypothesis and why is it largely dismissed?",
        "author": "SquishyGhost",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wxbqm/what_is_the_aquatic_ape_hypothesis_and_why_is_it/",
        "text": "To preface: I did check the wiki, and the AAH quite honestly seems ridiculous just from the start. I have one intro-level college Anthropology course behind me and even I can tell the theory is reaching. Hard. But, I'm no expert so I thought maybe someone smarter would make this hypothesis more palatable.  Or, failing that, give me more specific reasons to dismiss it as nonsense. Maybe even tell me how it became a mainstream (ish) hypothesis to begin with.",
        "created_utc": 1518399575,
        "upvote_ratio": ""
    },
    {
        "title": "Need Help With My Fantasy Book; Cultural Anthropology Question",
        "author": "quirkytink",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wwgfs/need_help_with_my_fantasy_book_cultural/",
        "text": "Hello, all you awesome anthropologists and sociologists! I have a question about a character I'm creating for my fantasy book series. I'm in a cultural anthropology class right now and we're learning the importance of growing up in a culture. I was wondering what sort of consequences my character would suffer since she was raised in a forest by her father, rarely ever interacting with others. Her father does teach her about the world, but I wonder if it's somehow not the same as growing up in a society? Let me know if this question would be better asked to psychologists instead, but I thought looking at this from every perspective would be beneficial so I would love a best guess if you have one. Thank you so much, you rock!! \nEdit: Cross posted to AskSocialScience. ",
        "created_utc": 1518391044,
        "upvote_ratio": ""
    },
    {
        "title": "A few questions about iron age settlements?",
        "author": "le57percent",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wv5j4/a_few_questions_about_iron_age_settlements/",
        "text": "What was the population of the average iron age settlement in Europe? Where there were things like hillforts, how many people lived within the fortifications and how many people lived outside of them? Did farmers live on their own plots of land or did they live near each other in fortifications for defense? How much farmland was there in your average iron age settlement? Also, in the case of things like forts, did most of the resources come from farms/places around the forts or was food ever transported from different areas to supply military forts in other areas?\n\nDo we even know any of this? Are there any good sources of information on the anatomy of iron age settlements out there? I'm no anthropologist, so it could just be due to my inexperience, but it seems like not much is known about the iron age in Europe until the Romans show up. I've been able to find some information on hillforts but not a whole lot.",
        "created_utc": 1518379459,
        "upvote_ratio": ""
    },
    {
        "title": "What is the anthropological explanation for gender oppressive islam in the middle east?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wu6e1/what_is_the_anthropological_explanation_for/",
        "text": "[deleted]",
        "created_utc": 1518370836,
        "upvote_ratio": ""
    },
    {
        "title": "How Did People In Ancient Empires [350 BCE - 100 CE] Determine What News Was Trustworthy? [X-post w/ AskHistorians]",
        "author": "UnderTruth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wocvh/how_did_people_in_ancient_empires_350_bce_100_ce/",
        "text": "Given the ease with which documents could be forged or simple lies about events or identity could be passed along, how did ancient empires (specifically thinking of the Roman Empire and Han Dynasty, ca. 100 CE, or the Achaemenid and Macedonian Empires ca 350-300 BCE) ensure that accurate information was conveyed over long distances, as was required to administrate the respective empires? I know there were sometimes episodes of broken alliances and rebellions, but it seems that these empires lasted multiple generations, and this implies a structural mechanism by which the sort of insular \"fake news\" which is so pressing in the minds of many today, or the pressures of selfish gain though lies, were prevented as a general rule.\n\nHow was this accomplished?",
        "created_utc": 1518298134,
        "upvote_ratio": ""
    },
    {
        "title": "What parts of anthropology are more useful in speculative writing?",
        "author": "quietandproud",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wo01z/what_parts_of_anthropology_are_more_useful_in/",
        "text": "First of all, if this sub is not suited to this kind of questions I sincerely apologize.\n\nIn short: I like writing science fiction and fantasy stories, and I feel like a knowledge of cultural anthropology would help me create much more interesting and consistent cultures. I think one of the best parts of speculative fiction is to consider how people would fare in worlds and environments far-removed from ours, be they fantastical or futuristic. \n\nI've seen the reading list in the sidebar, and while it looks like it will be useful (thanks to whoever made it or maintains it!) I'd still appreciate some advice on what I should focus on. \n\nOf course, I don't just want to learn about anthropology purely for \"practical\" reasons. I've always thought it was a field I'd love to know more about, and I thought making it work with another of my hobbies would be a good way to get into it.\n\nThank you for your time.",
        "created_utc": 1518294739,
        "upvote_ratio": ""
    },
    {
        "title": "What do academic anthropologists think of applied anthropologists?",
        "author": "GameofLoans16",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wmqdq/what_do_academic_anthropologists_think_of_applied/",
        "text": "Just curious...",
        "created_utc": 1518283279,
        "upvote_ratio": ""
    },
    {
        "title": "Question about a Steven Pinker quote.",
        "author": "lordwhatshisface",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wkm5v/question_about_a_steven_pinker_quote/",
        "text": "Ran across this quote from How the Mind Works.\n\n&gt;In anthropology, one South Sea island paradise after another has turned out to be nasty and brutish. \nMargaret Mead said that nonchalant sex made the Samoans satisfied and free of\ncrime; it turned out that the boys tutored one another in rape techniques.\nShe called the Arapesh \"gentle\"; they were headhunters. She said\nthat the Tshambuli reversed our sex roles, the men wearing curls and\nmakeup. In fact the men beat their wives, exterminated neighboring\ntribes, and treated homicide as a milestone in a young man's life which\nentitled him to wear the face paint that Mead thought was so effeminate.\n\nHas Mead's work been disproven like this? From what I can tell her work is still considered very important.",
        "created_utc": 1518256517,
        "upvote_ratio": ""
    },
    {
        "title": "Are people living in primitive tribes more happy?",
        "author": "desuvult1095",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7whwhi/are_people_living_in_primitive_tribes_more_happy/",
        "text": "",
        "created_utc": 1518222010,
        "upvote_ratio": ""
    },
    {
        "title": "Have people always known that a child has one father and one mother? x-post r/AskHistorians x-post r/AskSocialScience",
        "author": "Randomname64",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wgpvw/have_people_always_known_that_a_child_has_one/",
        "text": "Did people generally know that sex lead to pregnancies? And, if they did, how exactly did they assume the parties were involved with the generative process. \n\nI've heard, for example, that Darwin effectively thought that sperm contained homunculi in each sperm. Although I don't know what he thought ovum contained. And I swear I've heard someone say that Aristotle thought that women were effectively soil for a child to grow in but did not necessarily attribute to them much power over the traits of the children.  \n\nDid people think that both men and women contributed equally to traits and characteristics of the child? Did they think multiple men could (either through intercourse with the mother or through some other process) or did they think that other women could (through co-nursing or something)? \n\nThis is a rather broad question and I assume that it will vary from place to place and time to time.",
        "created_utc": 1518211226,
        "upvote_ratio": ""
    },
    {
        "title": "How possible is it that the latest discovery about early British settlers is distorted to fit a political narrative?",
        "author": "elo3800",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wgib1/how_possible_is_it_that_the_latest_discovery/",
        "text": "I have read a few articles today about the latest discovery and most of them if not all of them have mentioned or implied that the early British settlers in general all had dark skin, and that they became lighter in color only after the migration of Middle Easterners. First this article says that humans settled in Britain around 40 000 years ago, but then it implies that first settlers had brown skin color because a 10 000 year old man found in Britain had brown skin. Isn't it theoretically possible that this man was part of a migratory group that started leaving Africa much later than the early settlers of Britain left Africa? If for example the ancestors of this 10 000 year old man started migration to Britain about 15 000 years ago, wouldn't this already mean that we cannot generalize this one finding and apply its appearance to all of the early Brits. \n\nAlso, somewhat related but a little off-topic. This article says that Middle-Easterners had lighter skin. As far as I know, humans migrated out of Africa 60 000-70 000 years ago and obviously the first settlements on their path would be created in the Middle East. Considering that first humans in Britain appeared around 40 000 years ago, this means that Middle Easterners had around 20-30 thousands years more to get a lighter skin color, but the Middle Eastern climate would really make it harder for a human to get a lighter skin tone than someone in Britain (even considering the ice age, it would still be much less sunny in Britain than in the ME). Why was it that Middle Easterners got a lighter skin tone than Brits did? Wouldn't the 20-30 thousand year gap be somewhat compensated by the colder and less sunny climate in Britain, therefore meaning that the difference in skin tone wouldn't be much different? ",
        "created_utc": 1518209442,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a difference between rite and ritual ?",
        "author": "CreativeThienohazard",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wg8kj/is_there_a_difference_between_rite_and_ritual/",
        "text": "Is there a definitive difference between two of them ? I somehow find it confusing because they can be used interchangeably. Also is ritual or rite universal ? and if yes is there an universal  definition for them ?",
        "created_utc": 1518207185,
        "upvote_ratio": ""
    },
    {
        "title": "What is really the difference between field work and participant observation?",
        "author": "Oskar2323",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wg2n2/what_is_really_the_difference_between_field_work/",
        "text": "I am reading Bronislaw Malinowskis book Argonauts of the western pacific.\nBut there is one thing i dont really understand, the difference between field work and participant observation. ",
        "created_utc": 1518205854,
        "upvote_ratio": ""
    },
    {
        "title": "In what ways (if any) did early Puritanism in American colonies lead to or influence current American “conservative ideas” in comparison to Western Europe?",
        "author": "THCarlisle",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wbu4m/in_what_ways_if_any_did_early_puritanism_in/",
        "text": "As an American, it seems to be commonly accepted fact (from other Americans but also from visiting Europeans) that Puritanism is the culprit for everything supposedly wrong with U.S.A. culture, from our taboos about bare female breasts in public, to our supposed shaming of most discussions about bodily functions. How much truth is there in this? Were United States culture and laws truly influenced more than European laws. Were Puritan influences really more conservative than Catholic and other influences in Europe of the 1600s? If Puritan culture did not influence conservative politics in the USA then what is considered to be the origin? Thanks in advance.",
        "created_utc": 1518160730,
        "upvote_ratio": ""
    },
    {
        "title": "Starting in the XIX century there is a chain discovery of Palaeolithic caves. What witnesses do we have of pre-XIX discovery and exploration of caves?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wasxz/starting_in_the_xix_century_there_is_a_chain/",
        "text": "[deleted]",
        "created_utc": 1518148453,
        "upvote_ratio": ""
    },
    {
        "title": "Starting in the XIX century there is a chain discovery of Palaeolithic caves. What do we know of pre-XIX (or, better, pre-palaeontology) discovery and exploration of caves?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wanbe/starting_in_the_xix_century_there_is_a_chain/",
        "text": "[deleted]",
        "created_utc": 1518146760,
        "upvote_ratio": ""
    },
    {
        "title": "Starting in the XIX century there is a chain discovery of Palaeolithic caves. What do we know of pre-XIX (or, better, pre-palaeontology) discovery and exploration of caves?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wajmw/starting_in_the_xix_century_there_is_a_chain/",
        "text": "[deleted]",
        "created_utc": 1518145763,
        "upvote_ratio": ""
    },
    {
        "title": "When did humans outside of Africa start developing features that were different from their ancestors, such as lighter skin?",
        "author": "EvanderHolyghost",
        "url": "https://www.reddit.com/r/AskHistorians/comments/7w9gmo/when_did_humans_outside_of_africa_start/",
        "text": "",
        "created_utc": 1518143502,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between a band and a tribe and their economic and social structure? Also how they handle politic quuestions like power, leadership and conflicthandling?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7w7r9t/what_is_the_difference_between_a_band_and_a_tribe/",
        "text": "[deleted]",
        "created_utc": 1518120961,
        "upvote_ratio": ""
    }
]