[
    {
        "title": "What do anthropologists mean when they talk about body height/stature?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zv0w7z/what_do_anthropologists_mean_when_they_talk_about/",
        "text": "I often see anthropologists talking about body morphology of different populations in their papers and their descriptions seem rather vague to me. They'll often talk about a population being massively-built or being tall in height but measurements are never included in the paper. What population are they comparing them against when describing the physiques of people? Are there specific categories (e.g. short - 5'0-5'4 medium 5'5-5'9 tall 5'10-6'2 etc.)",
        "created_utc": 1671984598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gods Directly in an Object",
        "author": "Ill-Software8713",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zuwojf/gods_directly_in_an_object/",
        "text": "I’m curious about the veracity of a summary in a passage used to illustrate a philosophical conception of ideality.\n\nBelow the author states that people experienced an object not as a representation but directly as a God. What were such objects typically? \n\nhttps://www.marxists.org/archive/ilyenkov/works/ideal/ideal.htm\n“It is quite true that the “real talers” are in no way different from the gods of the primitive religions, from the crude fetishes of the savage who worships (precisely as his “god”!) an absolutely real and actual piece of stone, a bronze idol or any other similar “external object”. The savage does not by any means regard the object of his worship as a symbol of “God”; for him this object in all its crude sensuously perceptible corporeality is God, God himself, and no mere “representation” of him.\n\nThe very essence of fetishism is that it attributes to the object in its immediately perceptible form properties that in fact do not belong to it and have nothing in common with its sensuously perceptible external appearance.\n\nWhen such an object (stone or bronze idol, etc.) ceases to be regarded as “God himself” and acquires the meaning of an “external symbol” of this God, when it is perceived not as the immediate subject of the action ascribed to it, but merely as a “symbol” of something else outwardly in no way resembling the symbol, then man’s consciousness takes a step forward on the path to understanding the essence of things.\n\nFor this reason Kant himself and Hegel, who is completely in agreement with him on this point, consider the Protestant version of Christianity to be a higher stage in the development of the religious consciousness than the archaic Catholicism, which had, indeed, not progressed very far from the primitive fetishism of the idol-worshippers. The very thing that distinguishes the Catholic from the Protestant is that the Catholic tends to take everything depicted in religious paintings and Bible stories literally, as an exact representation of events that occurred in “the external world” (God as a benevolent old man with a beard and a shining halo round his head, the birth of Eve as the actual conversion of Adam’s rib into a human being, etc., etc.). The Protestant, on the other hand, seeing “idolatry” in this interpretation, regards such events as allegories that have an “internal”, purely ideal, moral meaning.”",
        "created_utc": 1671968894,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Iroquois come to use corn as a staple in their diet?",
        "author": "NoviceNotices",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zur65s/how_did_the_iroquois_come_to_use_corn_as_a_staple/",
        "text": "Met an Iroquois leader who said the scientific belief on the movement of people out of Africa and into North America through a land bridge in the north is wrong as they have a long oral history regarding growing and using mais in their diet. They said that their ancestors came from the south and brought corn with them into Canada, not from the north.\n\nIs there any genetic analysis that shows a link between Canadian Indigenous peoples and South Americans? What could be the historical movement of people in the Americas?",
        "created_utc": 1671944949,
        "upvote_ratio": 1.0
    },
    {
        "title": "The film 'Where the Green Ants Dream' mentions Aboriginal counting abilities. Where can I read about this?",
        "author": "Poo-In-Mouth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zuokyw/the_film_where_the_green_ants_dream_mentions/",
        "text": "In one of the courtroom scenes an expert giving testimony says something along the lines of, 'The aboriginals only have terms for one, two, three and many. If they have 600 cows and 2 are missing then they instantly know. This is a skill we have almost lost but is still sometimes used.'\n\nIs the part about the cattle true? Where can I read more about indigenous people's versions of counting / maths?\n\nI understand that higher numbers were only needed really to count money or large amounts of produce / stock a Government might have but don't know more about it.",
        "created_utc": 1671935096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone knows what is the context for this image?",
        "author": "Fantasyneli",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zun16j/someone_knows_what_is_the_context_for_this_image/",
        "text": "[https://drive.google.com/file/d/1ctFSLZ\\_tYnMzHFC\\_8DvsqsGhsRsLEeSs/view](https://drive.google.com/file/d/1ctFSLZ_tYnMzHFC_8DvsqsGhsRsLEeSs/view)",
        "created_utc": 1671929481,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the chances that the date if the earliest civilization gets pushed back?",
        "author": "Beeker93",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zukab0/what_are_the_chances_that_the_date_if_the/",
        "text": "I usnderstand text books and the consensus on things in tge scientific community don't change until enough compelling evidence comes out. No doubt the age of a number of events has been pushed back, like the date of modern humans arrising, the date that humans crossed the barring straight and settled the Americas, etc.\n\nHow likely do you think it is that the date that civilization started could get pushed back a number of millenia?\n\nI have heard about the site called the Göbekli Tepe. I am no archeologist or anthropologist, but it seems much older than the earliest civilizations. Idk if it was simply a site similar to stonehenge, like some sirt of calendar, or even if it was a site of worship or like a community center, and if it is any of those sites, if having a building like that as a center of a settlement constitutes calling it a modern civilization by what ever standards are used currently. Are there other sites which may point to an earlier civilization? I have hears of some ancient cities and early civilizations built on the ruins of older ones. Idk if Mesopotamia is one, but have heard of Mayan and Aztec cities that are like this (I understand thise civilizations are much more recent though).\n\nI get there would have to be enough compelling evidence to change the consensus on something, and we can only go by what we know now as evidence, but are there any sites which go against what we know now that we mught not know enough about?",
        "created_utc": 1671920529,
        "upvote_ratio": 1.0
    },
    {
        "title": "art and human development",
        "author": "ripIdkagoodusername",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zui6jm/art_and_human_development/",
        "text": "Hi all! I had a question maybe someone could help me with or some sources they could direct me too! I got my undergrad in Anthropology with an emphasis in archaeology but it has been awhile since I've been in school. I vaguely remember a professor talking about how art was an important aspect of human development and the development of culture. I was hoping maybe someone could provide norepinephrine insight on that or disprove it! Anything really! Much thanks!",
        "created_utc": 1671914111,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is Hans Peter Duerr's \"Dreamtime: Concerning the Boundary between Wilderness and Civilization\" regarded in academic anthropology?",
        "author": "attic-orator",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zufb4t/how_is_hans_peter_duerrs_dreamtime_concerning_the/",
        "text": "As an \"ethnographic study,\" is it well received, or has this study been superseded by others of greater importance still?",
        "created_utc": 1671905574,
        "upvote_ratio": 1.0
    },
    {
        "title": "what explains the gap between evolutionary modernity and the first civilizations",
        "author": "FallDouble9505",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zubwgi/what_explains_the_gap_between_evolutionary/",
        "text": "So I've always been into history and one thing that always bugged me was the big \"gap\" in human history.\n\n to my understanding the \"start\" of civilization was the early river valley civilizations  around 12,000 bc.\n\n\nBut we know the first homosapiens appear in the fossil record ~300,000 BC, to my understanding these should be biologically modern humans.\n\nWith hard evidence of \"behavioral modernity\" being present by 50,000 bc. \n\n\n\nSo this presents a problem in my mind if we go with the fossil record that gives us about ~90% of our existence, being unknown, unaccounted for, or in some form of hunter gathering.\n\n\nIf we go with the hard evidence of modernity that's still ~70% of our existence unaccounted for.\n\n\nMy question is  given the insane rapid development of technology from the first civilizations to today, why did it take such an extremely long period of our existence to first settle down?",
        "created_utc": 1671895293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our biological Job",
        "author": "Overall_Purchase_467",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zu8vvw/our_biological_job/",
        "text": "If our ancestors were hunters, then i guess the human body is built to run/walk long distances/fight. Does that mean we would be happier in the long term if we choose jobs with those hunting/surviving elements? Like Soldiers/hikers/explorers and so on. Im studying for a profession where i will work 80% in the office and i always thought that can not be right for an \"animal\" that hunted mammoths back then.",
        "created_utc": 1671884915,
        "upvote_ratio": 1.0
    },
    {
        "title": "excuse me i would like to ask. Did ancient people actually worship their Gods",
        "author": "HoChiMinHimself",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zu7l1h/excuse_me_i_would_like_to_ask_did_ancient_people/",
        "text": "I heard that medieval people arent actually as religious as they are portrayed in movies. Now i wonder did the ancient people of Assyria, Babylon, Egypt, and many others actually believed in their Gods. Or is it just propaganda scripts by the priest class.\n\nThank you",
        "created_utc": 1671879359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peoples Historic Origins and the Physiological Makeup of their Biology",
        "author": "Ill_Percentage9191",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zu50sr/peoples_historic_origins_and_the_physiological/",
        "text": "So I'm not even sure if the Title is conveying what I'm truly trying to ask. It may just be a rambling nonsensical jumble of words. I'm also not even sure if I'm in the right place. I'm curious about why different races have different physical characteristics. I'm not looking to post anything inflammatory, but something either biological or historical that caused those characteristics. I.e.: Do People of African Dissent's hair have it's characteristics (i.e. compact, potentially more \"springy\" in nature, sometimes coarser) as a result of their environment? If so, what was the functional purpose of that evolution? Was it to cast off heat more efficiently or some other purpose?\n\n&amp;#x200B;\n\nI'd love to hear about other fascinating traits and the reasons for their evolution! Apologies in advance if this is so not the right thread.",
        "created_utc": 1671868500,
        "upvote_ratio": 1.0
    },
    {
        "title": "From what I understand, a lot of prehistoric civilizations existed on coasts. Because of rising sea levels in millenia past, I assume some of these civilizations were wiped out by flooding. Have any of these civilizations been recently rediscovered?",
        "author": "TwentyThreePandas",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ztwcn5/from_what_i_understand_a_lot_of_prehistoric/",
        "text": "Like, in the last 20 years?\n\nReally, what I’m trying to get at is: is it possible that there are “lost civilizations” that we know nothing about?",
        "created_utc": 1671839603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody help me understand the Native American concept of “Medicine”/“Bad Medicine”",
        "author": "chefhj",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ztvq97/can_somebody_help_me_understand_the_native/",
        "text": "I am watching the TV show Rez Dogs and am trying to better understand if possible what the characters mean by these phrases. The term seems to be at times interchangeable with karma but then other times be referring to rituals/traditional healing, sometimes what I would consider magic and then also can be western medical procedures. How do I approach this concept?",
        "created_utc": 1671837820,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is currently known about the so called \"lost Amazonian civilization(s)\"?",
        "author": "Leather_Focus_6535",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zttj5b/what_is_currently_known_about_the_so_called_lost/",
        "text": "Recently, as a result of a wave of recent archeological discoveries, there seems to be an increasing awareness of \"civilization(s)\" in what is now considered the Amazonian Rainforest, such as Kuhikugu and Marajoara. From the archaeological records at hand, what is currently known about those people, especially their political systems, relationships with their neighbors, patterns of warfare/violence, substantiate/lifestyles, etc.? What relationship(s) and connection(s) did they have with other Amazonian peoples such as the Jivaro/Shaur (whatever name you prefer), Tupi, Yanomami, Arawakan speakers, etc.",
        "created_utc": 1671831975,
        "upvote_ratio": 1.0
    },
    {
        "title": "WHY move from Hunting&amp;Gathering to Agriculture (at Holocene onset?) ?",
        "author": "Aimaly",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ztmws5/why_move_from_huntinggathering_to_agriculture_at/",
        "text": "Why did we move from Hunter-Gatherer societies to Agricultural societies?  \nAs far as I know, before the climate era of the Holocene, agriculture was looked down upon in all ways. It was not resilient to climate changes which occurred as often as every 2 generations or so\\~ it was constant and difficult work, and the societies were not very happy in general. In addition to that I read that (pre-Holocene I believe) agrarian communities relied on hunter gatherer communities for survival and skills etc when crops did not go well with the more volatile climate at the time\\~  \nI am curious whether those societies had any effective slave structures as well, or was it more of an 'egalitarian' farming situation?  \n\n\nAnyhow, it seems to me as if not only are domesticated crops and animals **THE** centerpiece (but not the only contributing factor) enabling civilization, but also that the climate era of the Holocene enabled domesticated crops and animals themselves\\~  \n\n\nIf this is true, and a new era of consistent warmth allowed for agriculture, what explains our massive shift towards agriculture?  \n\n\nDid the climate remove one of agriculture's key weaknesses? Being instability due to volatile climates?  \nOr are there any other reasons?   \nIn a stable climate, was agriculture more favorable than hunter-gathering? Or did some sort of perpetual competitive runaway effect happen between warring agricultural societies?  \n\n\nI would really appreciate any thoughts! I'm sure there are many facets to this topic, and many answers. Being also very new to this field of observation and thought, please correct me if I am wrong or missing things in any way!!   \n\n\nThank you all and wishing you the best this winter season &lt;3",
        "created_utc": 1671815884,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did the Garamantes call themselves?",
        "author": "pdx2las",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ztke43/what_did_the_garamantes_call_themselves/",
        "text": "",
        "created_utc": 1671811167,
        "upvote_ratio": 1.0
    },
    {
        "title": "were ancient egyptians hairy?",
        "author": "anonymousconsciosnes",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ztfwtn/were_ancient_egyptians_hairy/",
        "text": "Some months ago I took a DNA test and it showed 15% kemetic (ancient egyptian), I was surprised at first but this actually does make sence as I have some sephardic jewish ancestry from my paternal side, I would guess they must of have mixed with egyptians at some point during the diaspora.\nNow, i'm a 16 year old male and i'm quite hairy, I would say that quite more than my friends, i've always wondered why and I would say it has become an obsession overtime, so i've been doing extinsive research on the topic and my own ancestry in an attempt to find out from where does this trait come from as mostly i'm nahua and celtic with a mix of jewish and kemetic ancestry, i've also read that it is believed that some middle eastern people are hairy because it's an adaptation to protect the skin from harsh sun  of the region and also to protect from insect bites, situations that could easily happen on the nile. I'm absolutely not an expert on this so I would like to hear what exoerts think. Thanks.",
        "created_utc": 1671803349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books and sources about ancient Magic and the role it played in ancient religions and cultures",
        "author": "OwNathan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ztc81e/books_and_sources_about_ancient_magic_and_the/",
        "text": "I'm a videogame writer, and I'll soon start working on a setting based on the Late Bronze Age Collapse.  Since I'd like to make it as much historically accurate as possible, and I'm personally tired of seeing the whole concept of magic treated as a way to burn or destroy things, I'd like to include some appropriate magic in the setting. \n\nI'd like to add supernatural elements making them mysterious, hard to grasp, so eerie and subtle that everything magical could be rationally explained by us modern humans with scientific knowledge. \n\nWhile I have some knowledge when it comes to medieval stuff, mostly alchemy, I need some guidance when it comes to Bronze Age cultures. I tried doing a few google searches but found nothing useful or reliable.",
        "created_utc": 1671791741,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is modern-day China authoritarian?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zt5d69/what_is_modernday_china_authoritarian/",
        "text": "We often concern China's human rights violations but we never seem to care about why China is this way, only how to counter China and how to shame China for it. For such a large nation, it is a shame that people don't understand the history behind why China is the way it is. \n\nWhat social/cultural/political developments led to the PRC being authoritarian, especially during Hu Jintao's and Xi Jinping's rule? What necessity, ideology, or conditions led to Chinese leaders needing to become authoritarian?\n\nNot authoritarian in how Chinese citizens have little political rights but authoritarian in social rights? Chinese entertainment has to go through many censors to clean up sexual content, violent content, LGBTQ+ content, and whatever. The Chinese internet is extremely censored with many Western sites being blocked and the Chinese censors taking down posts constantly. \n\nWhile I think political rights can be sacrificed for great economic development, I believe sacrificing social rights is harmful and not as efficient to economic development.\n\nWhy is China like this? I don't want simple explanations such as \"CCP just wants to keep power\" or \"CCP is corrupt\". I want answers that delve into the mindset of core CCP members or the Chinese society.",
        "created_utc": 1671766535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is China authoritarian today?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zt56ya/why_is_china_authoritarian_today/",
        "text": "What political/cultural/social developments led Chinese leaders to consider being authoritarian today? What sort of necessity, philosophy or conditions led to China being authoritarian today?",
        "created_utc": 1671765977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could we think about sub-species of humans ?",
        "author": "unterrien",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zt4f8p/could_we_think_about_subspecies_of_humans/",
        "text": "Like in botany we have for example :    \nHelichrysum italicum with    \nsubsp. *italicum* ;   \nsubsp. *microphyllum* ;    \nsubsp. *serotinum*.   \n\n\nSame for Canis lupus with subsp.  *lupus*  or subsp.  *occidentalis*   \n\n\nCould we propose Homo sapiens subsp. europaeus ; or subsp. articus ; or subsp. americana..   \n\n\nWe could do that based on DNA sequencing like modern phylogeny and more characters. I propose that because we know that for example Inuit people (it's not their name I know) produce more brown fat than us. Or asian people that have particular eyes that came from the reflexion of sun on the ice.   \nI know that it could sound insane because it is the premise of a racist theory that would say : subsp. americana is better than subsp. europaeus (to change a little bit :)). But proposing different sub-species and not saying that this one or this one is superior is not racist. This proposition could obviously hurt the Modern thinking that want to global peace and unity, etc. Why not transfer the diversity that we recognize as a value in itself in the biological domain ?   \n\n\nOpen to hear your answers ! bye :)",
        "created_utc": 1671763515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we have examples of anthropologists that died while on the terrain ?",
        "author": "unterrien",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zt44vf/do_we_have_examples_of_anthropologists_that_died/",
        "text": "title :)",
        "created_utc": 1671762608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Info on the social psychology of gratitude?",
        "author": "Pyropeace",
        "url": "/r/AskSocialScience/comments/zsz81b/info_on_the_social_psychology_of_gratitude/",
        "text": "",
        "created_utc": 1671749171,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of the most ancient peoples that are still around today and have not assimilated or intermarried much?",
        "author": "donrei",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zsyx3s/what_are_some_of_the_most_ancient_peoples_that/",
        "text": "I am wondering what are some of the most ancient peoples/communities that are still around today and have avoided intermarriage. I know most if not all groups will experience intermarriage and assimilation to an extent but what are some examples of the communities that have avoided it the most for the longest period of time, for example, the Sentinelese or certain groups of Jews might fall under this category? Are there any other examples?",
        "created_utc": 1671748383,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for an in depth analysis on british humor, and variation in humor between cultures",
        "author": "fisharrow",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zswvkw/looking_for_an_in_depth_analysis_on_british_humor/",
        "text": "i’m a big fan of british comedy, and the ways that comedy differs between cultures interests me greatly. i’ve tried to find videos on the differences between british and american comedy, but they all just talk about optimism vs pessimism, which is hardly the biggest part to me. there’s a huge difference in display of wit and mannerisms alone that i can see, but i haven’t been able to find any source that really breaks it down.\n\ni can try to describe some examples, but they are subtle and hard to explain. in skits like fry and laurie, there is an interesting trick of wit that they will do, where person A is arguing with person B, but through some clever and subtle means, they will switch it around so person B is suddenly the aggressor, and person A is defending himself. i’ve been watching Taskmaster a lot lately, and even there, among a more “ordinary crowd, they are just so cheeky and sly, and a joke can consist of just an odd look for slightly too long. it’s so dramatically different than american humor, and far more clever. but i don’t want to settle with. just calling it clever, i want to understand it.\n\n i can’t hope to explain it well, which is why i want some really in depth resources about what exactly is going on. something academic, not just a youtube video. is there a sub field that researches humor?",
        "created_utc": 1671743240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Han Chinese people feel greater cultural affinity toward Tibet than toward Xinjiang?",
        "author": "aliensdoexist8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zsvrr9/do_han_chinese_people_feel_greater_cultural/",
        "text": "",
        "created_utc": 1671740396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why were so many mythological gods married to their brother or sister? What did incest had to do with gods or mythology?",
        "author": "Absolutelynobody54",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zspfgr/why_were_so_many_mythological_gods_married_to/",
        "text": "China, japan, egypt, greeks (and more that I don't remember) has many gods that married their siblings but why?\n\nWhat does that mean?",
        "created_utc": 1671724726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any records of people, ancient or modern, who have eaten their children?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zsox69/are_there_any_records_of_people_ancient_or_modern/",
        "text": "I know eating one's own offspring is a behavioural trait in many other animal species and I wonder if it has any representation in primate or human behaviour.",
        "created_utc": 1671723482,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the origins of Russian homophobia?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zsomja/what_are_the_origins_of_russian_homophobia/",
        "text": "The government makes laws that prohibit LGBTQ+ activities while the Russian public is largely still against the practice. What social/cultural/political developments led to homophobia in Russia?",
        "created_utc": 1671722744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to say that we are a hierarchical specie?",
        "author": "karamazzov",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zskxn6/is_it_possible_to_say_that_we_are_a_hierarchical/",
        "text": "It's occure to me that I think we are, but I don't know why I think we are. That been said, I'll appreciate to hear your knowledge about the issue.",
        "created_utc": 1671711907,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep on hearing that the San-Hunter-Gatherers are healthier and have more free time than modernized people, but what about the Khoikhoi cattle herders?",
        "author": "Direct_Solution_2590",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zsbxef/i_keep_on_hearing_that_the_sanhuntergatherers_are/",
        "text": "",
        "created_utc": 1671682711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are rural people more culturally and socially conservative in the modern day?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zsbcg0/why_are_rural_people_more_culturally_and_socially/",
        "text": "I understand why back then rural people are more conservative because they don't experience the interactions with lots of educated people but with the rise of social media, anywhere on earth has connections to anywhere. Despite this, why are rural people still more conservative than urban people?",
        "created_utc": 1671681099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can white caucasians endure direct sunlight throught the day without protection (shade/hats/sunscream?",
        "author": "totalwarwiser",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zs9k7g/can_white_caucasians_endure_direct_sunlight/",
        "text": "Ive been thinking about why hats have been so prevalent throught the ages, and I used to think that it was either due to hygene (protect the hair or stop others from smeling it) or due to rain, but now Ive started to think that one of the main reasons why most people used them was due to the sun. Ive noticed that from the 1930s onward they have fallen out of fashion, and I wonder if it is because most people in big cities find shade very frequently during the day, and most people travel by car or bus.\n\nNonetheless when I see native african tribes with black skin I hardly see them with hats, and it conveys the idea that they dont really neet a hat to.protect them. Meanwhile I see america native population and they dont seem.to favor hats either.\n\nSo I wonder if hats were used by white caucasians because we cant endure daylight direct sunligh or due to other cultural reasons. And if there are studies on how much sunlight our skin can endure.\n\nThanks.",
        "created_utc": 1671676268,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far back could a modern human travel in time and still successfully integrate? Could one possibly integrate with Homo heidelbergensis or an even older ancestor?",
        "author": "RyanKretschmer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zs65je/how_far_back_could_a_modern_human_travel_in_time/",
        "text": "",
        "created_utc": 1671667688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are humans not born with the ability to run/flee, like some animals? And at which point (if there even was one) did evolution eliminate this ability from our gene pool?",
        "author": "MrJimPanse",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zs5vbp/why_are_humans_not_born_with_the_ability_to/",
        "text": "",
        "created_utc": 1671667013,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did the last pockets of western or central European hunter-gatherers live?",
        "author": "Suippumyrkkyseitikki",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrych2/when_did_the_last_pockets_of_western_or_central/",
        "text": "In northern Europe there were Sámi hunter-gatherers until relatively recently. I'm interested to know when the very last hunter-gatherers of western or central Europe or other parts of Europe vanished.",
        "created_utc": 1671651083,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can business management be used in anthropology?",
        "author": "Southern_Corner5668",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrw5ul/how_can_business_management_be_used_in/",
        "text": "I am doing a business management degree for work, business is a passion or mine. I intend to do an anthropology degree after for myself as I love it. Ether broader anthropology or linguistics.\n\nHow can I use my buisness management knowledge in anthropology, I don't want to waste one in ethier subject or keep them separate for work and personal.",
        "created_utc": 1671646391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origins of ethics?",
        "author": "red-andrew",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrs53r/origins_of_ethics/",
        "text": "Anyone know a good book that outlines how humans transitioned from hunter gatherers to villagers? Im curious about the origins of ethics, state, religion but I can’t find any good sources that provide a cohesive outline of all of these things together.\nI also don’t mind reading academic articles such as Gordon Childe’s essay on Urban Revolution",
        "created_utc": 1671638593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are cults like jones town just a sign of civilization?",
        "author": "Valianttheywere",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrqfn6/are_cults_like_jones_town_just_a_sign_of/",
        "text": "Just watched a video by Joe Scott on the worst cults... but its not really an anomaly for this mass slaughter of followers or non followers. Hecatomb is where the death of a ruler is marked by a massacre or mass slaughter of people and or animals. This is considered one of the foundational behaviours of the elites of a civilization (hecatomb being amongst the structures of authority or ruling elite).",
        "created_utc": 1671636244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would this belong in a socio cultural anthropology book?",
        "author": "AtomicFaun",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrpkdz/would_this_belong_in_a_socio_cultural/",
        "text": "I was wanting to know what all is included in an anthropology book written by an anthropologist that lived among the people she/he studied and wrote about. \n\nIs an anthropologist that studies the etiquette, customs, garb, etc… of a living culture put in the social anthropology or sociocultural anthropology category?\n\nIf they also wrote about/included notes on the spoken language would that still be okay to include in social or sociocultural or would it be in a separate book entirely about linguistics?",
        "created_utc": 1671635070,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've often heard that if a local predator kills a member of a tribe, the tribe retaliates and kills the animal. Is this actually a documented behaviour?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrmxpl/ive_often_heard_that_if_a_local_predator_kills_a/",
        "text": "I've heard different motivations from trying to keep the nearby area safe for habitation to exacting revenge on behalf of the mourning party. Has this behaviour been shown to be common amongst hominins?",
        "created_utc": 1671630764,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've often heard that if a local predator kills a member of a tribe, the tribe retaliates and kills the animal. Is this actually a documented behaviour?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrmx5s/ive_often_heard_that_if_a_local_predator_kills_a/",
        "text": "I've heard different motivations from trying to keep the nearby area safe for habitation to exacting revenge on behalf of the mourning party. Has this behaviour been shown to be common amongst hominins?",
        "created_utc": 1671630739,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Chinese emperors convince the Chinese population that Confucianism is a good philosophy to follow?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zrc1zw/how_did_chinese_emperors_convince_the_chinese/",
        "text": "Confucianism to be seems like an uncomfortable philosophy to follow. People have to learn rules of respect and traditions and have to follow them. Women are oppressed by men and youngsters are oppressed by elders. Everyone is expected to do their duties and be confined to their societal roles. \n\nHow did ancient Chinese people manage to think that this is a good philosophy to follow? \n\nI think Mohism is a superior philosophy to Confucianism because it seems like an upgraded version of Confucianism. It encourages logical thinking instead of \"knowing your place\", applies to concept of relationship far outside the family, and puts equal emphasis on both the individual and the collective as opposed to just the collective.",
        "created_utc": 1671602613,
        "upvote_ratio": 1.0
    },
    {
        "title": "We know that dogs were the first domesticated animal, but did early humans learn how to hunt and cooperate together by observing dogs in the wild?",
        "author": "gameboyvaio",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zr9vz2/we_know_that_dogs_were_the_first_domesticated/",
        "text": "",
        "created_utc": 1671595849,
        "upvote_ratio": 1.0
    },
    {
        "title": "We know that dogs/wolves were the first domesticated animals, earning the moniker \"man's best friend\" in the process. But did early humans learn how to hunt and cooperate together by observing dogs in the wild?",
        "author": "gameboyvaio",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zr9ep7/we_know_that_dogswolves_were_the_first/",
        "text": "",
        "created_utc": 1671594473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Sub-Saharan Africa or the Americas have a Paleolithic AND a Neolithic Era?",
        "author": "sea_of_joy__",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zr9bpk/did_subsaharan_africa_or_the_americas_have_a/",
        "text": "Did Sub-Saharan Africa or the Americas have a Paleolithic AND a Neolithic Era, or are these terms only used to describe Eurasia? \n\nIf these terms are only used in Eurasia, then does Neolithic also imply \"Farming?\"",
        "created_utc": 1671594227,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between Cro-Magnons(Anatomically similar humans) and Us",
        "author": "BassMan_199999",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zr7og6/what_is_the_difference_between/",
        "text": "",
        "created_utc": 1671589512,
        "upvote_ratio": 1.0
    },
    {
        "title": "What cultural factors may account for why China has avoided the problems with alcoholism that plagued America and many other European countries?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zr1fc8/what_cultural_factors_may_account_for_why_china/",
        "text": "Alcohol has been around in China for thousands of years, though from my cursory research it appeared to fade in public prominence with each successive dynasty until the arrival of the Portuguese and other European traders. \n\nAnd yet it was smoking, also imported from European traders, that became an enduring public health issue for China. Not alcoholism. So I’m curious as to why this would be the case. I don’t know which sub this would fall under best, r/askhistorians r/asksocialscience or r/askanthropology, so im doing all of them! \n\nThank you for reading!",
        "created_utc": 1671574495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did we start measuring time?",
        "author": "IGetHighAskQuestions",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zqwqtz/why_did_we_start_measuring_time/",
        "text": "And going a bit further, why / when did we (society) start applying certain developmental moments to measure success, worth, etc? (As in you’re “supposed” to go to college in your 20s, meet someone and settle down and have a house and kids before your 30s, retire by your 60s, etc etc etc.)",
        "created_utc": 1671563328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Caught between 2 possible research ideas",
        "author": "a_stopped_clock",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zqtciy/caught_between_2_possible_research_ideas/",
        "text": "I am a Canadian international student studying a masters in cultural anthro in the Netherlands.  For my initial fieldwork I was going to focus on cultural citizenship among non citizens in the uae because my father was posted there for work but now he is being moved to Turkey and I am thinking about doing it in the Netherlands.  The new one would be how local citizen empowerment initiatives in Rotterdam subvert or reproduce neoliberal ideas of citizenship I.e are they places of self making or being made by the state.  I dunno why I’m posting this but maybe thoughts anyone?  I want to somehow get into human geography after this for another masters or ideally a phd.  Thanks lol",
        "created_utc": 1671555202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on cultural evolution",
        "author": "kvitkrull",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zqpxwh/question_on_cultural_evolution/",
        "text": "I am wondering if anyone here knows a specific term or any theorists that have written on a particular anthropological phenomenon. The best way I can describe this is the example of 'cargo-cults' that develop an expansive mythology and culture around decontextualized fragments of lost or ruined objects. This includes a fundamental misunderstanding of the object(s) and their historical meaning. These objects are then imbued with new meaning and significance and evolve over a number of generations, often spiritual or mystical. \n\nAnother example is the cargo cult in Mad Max Beyond Thunderdome. The children of this isolated society build a complex mythological and spiritual belief system around the found fragments of a plane crash.  \n\n\nAny thoughts are appreciated!",
        "created_utc": 1671546476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for a new undergraduate student.",
        "author": "MyManHasNoArms",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zqo4bp/tips_for_a_new_undergraduate_student/",
        "text": "Hey good people, I will start my anthropology journey from next month and i want to start my journey as prepare as possible. Thats why Iwould love to take  your valuable advices \n\nHow to get prepare for a lecture?\nHow to take notes? \nHow should i communicate with Professors?\nWhere to go for sources? \n\nAnd all you can say. \n\nThanks it advance, take love.",
        "created_utc": 1671541879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the root of toxic masculinity coming from the expectation of men going into the military?",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zqa9gw/is_the_root_of_toxic_masculinity_coming_from_the/",
        "text": "",
        "created_utc": 1671499887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fieldwork focused on male sex workers in Brazi",
        "author": "IndependentSwan2086",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zq9tii/fieldwork_focused_on_male_sex_workers_in_brazi/",
        "text": "I am a 4th-year Anthro Ph.D. ABD and I am conducting my fieldwork in Rio de Janeiro about male sex workers in this city and how the ultra-right gov't that is ending now affected ( if so) their work. Anyone has conducted or conducts a research on a similar topic?",
        "created_utc": 1671498824,
        "upvote_ratio": 1.0
    },
    {
        "title": "The impacts of pandemics on culture",
        "author": "PhantomFaders",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zq3r5w/the_impacts_of_pandemics_on_culture/",
        "text": "Hello. I’m really interested in epidemiology, public health, pathology, etc. and their intersections with other fields. I’m pretty familiar with the Black Death, which is what inspired this question. \n\nMedieval culture was, without a doubt, influenced by the Black Death. La Danse Macabre, the rattle bag, the Canterbury tales, etc. are all about or inspired by the pandemic. \n\nTo what degree, if any, do we see this effect on culture from other pandemics? Did the Influenza Epidemic of the 1900s cause a shift in cultural thinking and inspire famous works? What about Ebola or even COVID-19?",
        "created_utc": 1671484456,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a question about pathologies",
        "author": "Key_Okra9682",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zq3gha/i_have_a_question_about_pathologies/",
        "text": "Below are some pictures of pathologies on a specimen.\n\nI believed there is many dental Caries, periodontitis, some sort of infection osteomyelitis?? Attrition, and linear enamel hypoplasia. Is anyone able to confirm these findings or improve on my observations? This is just personal studying not related to school.\n\nhttps://imgur.com/a/IMp9Caa\n\nhttps://imgur.com/a/ZGF2nzV",
        "created_utc": 1671483757,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there any good book about post Soviet Russian anthropology ?",
        "author": "Visual_Revolution843",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zpzkqn/is_there_any_good_book_about_post_soviet_russian/",
        "text": "",
        "created_utc": 1671474884,
        "upvote_ratio": 1.0
    },
    {
        "title": "how is it called when someone study human evolution and biomechanics for physiotherapy?",
        "author": "Aviv352",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zpwkvk/how_is_it_called_when_someone_study_human/",
        "text": "Hello, \nI know i sound like an amateur but what im trying to ask is how is it called when someone study and research human evolution and biomechanics of the han body in order to understand how it work for treating the human body in physiotherapy ,\n\nMeaning the more i tried to read and about these topics of human evolution🧬, archeology etc, they always seem to show that humans developed technology for an easier life but more in the sense of physical easy time meaning if there is a hunter today he can just use a rifle 🔫but before maybe a bow🏹 and arrow and before maybe spears and before probably heavy rocks 🪨so basically the more the technology evolved the less need of physical energy/power/strength\n\n so What im trying to learn is how is the technology effected the human body physically in the sense of movement,posture,issues etc.. since we need it and use it less the more the tech is developing.",
        "created_utc": 1671468316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the idea of ‘race’ nonsense?",
        "author": "Different_Dig6903",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zpdatn/is_the_idea_of_race_nonsense/",
        "text": "I couldn’t begin to understand just how confused a Black man from Zambia is when he’s lumped under the same racial categorisation as an ‘African American’ from New Jersey. I’ve also never met any Pakistani to refer to themselves as ‘Brown’.",
        "created_utc": 1671410724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any happy anthropologist here?",
        "author": "KalaHariz",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zpbvsc/any_happy_anthropologist_here/",
        "text": "So I'm currently suffering from my career choice given that in my country (Chile) it is a varely employable major. I feel undervalued and with very little opportunities. I have read too many comments from people feeling the same way. I'd like to read any of you that is happy with his/her career choice to light me up a little bit and to regain hope about the career path ahead of me.\n\nThank you everyone in advance.",
        "created_utc": 1671406797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for documentaries on tribes?",
        "author": "friedhobo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zp9sth/any_recommendations_for_documentaries_on_tribes/",
        "text": "I’d love a netflix style documentary series where every episode they focus on a different indigenous tribe. Please let me know if you have any recommendations that go that direction!",
        "created_utc": 1671401200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any cultures that do not use names for people?",
        "author": "rabbitfootkeychain",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zp2781/are_there_any_cultures_that_do_not_use_names_for/",
        "text": "I’m wondering if there are or ever have been any cultures which do not give or use names for people, or maybe that use/give names differently than what we typically recognize as standard?",
        "created_utc": 1671380470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did hominins over time become more capable and formidable hunters as evolution progressed?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zoyko5/did_hominins_over_time_become_more_capable_and/",
        "text": "Was it as simple as early hominins were small-brained, short and less sophisticated so they were ineffective hunters and modern humans are large-brained, tall and adaptable so they make good hunters? Was homo erectus a much more capable hunter than late Australopiths/homo-habilis and homo sapiens an even more capable hunter still?",
        "created_utc": 1671369914,
        "upvote_ratio": 1.0
    },
    {
        "title": "where is the push for \"we are a family\" and buddy system coming from in the military?",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zorxj9/where_is_the_push_for_we_are_a_family_and_buddy/",
        "text": "Also, these days there is a lot of evidence that those mindsets are toxic and harmful. Why do they still persist though?",
        "created_utc": 1671344701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a bias towards calendars which ‘start’ in winter?",
        "author": "HillelSlovak",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zonx5k/is_there_a_bias_towards_calendars_which_start_in/",
        "text": "I am trying to broaden my understanding of calendar systems. My thinking comes from the idea that in my country, we operate on the Gregorian calendar however we are in the southern hemisphere and so the seasons are reversed yet we celebrate the same northern, Christian holidays. We have big Christmas feasts in the hottest period of the years and we celebrate Easter (a spring festival) at the end of autumn etc. Imo, this makes no sense and has always bothered me because it feels like we are really out of sync with the natural world. The indigenous calendars for our nation also start in winter, with summer being the middle of the year yet our Gregorian calendar goes summer - summer and we have a cold, dark winter with no celebrations or holidays.\n\nSo I’m wondering, are there any calendar systems which start in summer (I.e. with one full year being from approx. summer solstace to summer solstace). I am also interested in how and what shapes calendars in equatorial places which feature less clear cut seasonal changes. \n\nIf you are familiar with calendar systems outside of the Gregorian calendar, could you explain a bit about why the ‘new year’ was chosen as the day/period it was?\n\nThank you in advance.",
        "created_utc": 1671331419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there evidence of hunter-gatherers hunting hippos?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zomx3h/is_there_evidence_of_huntergatherers_hunting/",
        "text": "Using archaic weapons of course such as spears or bows/arrows. Whether today or the distant past.",
        "created_utc": 1671328418,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most primitive aspect of the human condition?",
        "author": "MrN1ghtStand",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zomavs/what_is_the_most_primitive_aspect_of_the_human/",
        "text": "I ask this because sometimes I find myself thinking along the lines of \"damn, I'm really an ape surviving on planer Earth\". With that thought usually comes the idea that there has to be some kind of behavior, emotion, action or anything else that humans do that our ancestors or genetic cousins could also be found doing.\n\nI think that people get so caught up in the day-to-day that we forget everything that had to happen for us to be here. Especially that there are other species that share so much in common with us, yet are vastly different because of event that occurred millions of years ago.\n\nI always thought the answer to the question was fear or anger but I thought I'd ask people who are actually experts in this field. TIA",
        "created_utc": 1671326561,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any papers about the positive implications of heritage commodification?",
        "author": "bumble___bea",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zogwil/are_there_any_papers_about_the_positive/",
        "text": "There are hundreds of papers about the negative effects of cultural commodification (with good reason!), but are there any studies of the more positive effects?",
        "created_utc": 1671312863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tattoo friendly field?",
        "author": "mountainmamabh",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zodev7/tattoo_friendly_field/",
        "text": "Hi! I’m a student in anthropology. I already work in 2 research labs and they haven’t said anything other than “oh that’s a cool tattoo”. The only really visible tattoo I have is on my chest and it’s not always visible depending on what I’m wearing. I eventually want to be covered in tattoos, including a neck piece. This is what I’ve always wanted since I was a kid. \n\nI want to continue working in research labs and field work after I’m done with school. Anthropology is my passion so I want to make sure I don’t ruin my career opportunities by being coveted in tattoos. I feel like anthropology is probably the most tattoo friendly field but I just want to make sure!\n\nThanks ahead of time!",
        "created_utc": 1671303781,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what situations it participant observation best for?",
        "author": "such-and-such11",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zobzib/in_what_situations_it_participant_observation/",
        "text": " Something specific like gender roles? Or a   society's history?  Or maybe more broadly The way different aspext of people's experiences connect to one another?",
        "created_utc": 1671299997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do humans have the tendency to walk in a big circle in the absence of distinctive landmarks?",
        "author": "sexual--chocolate",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zntc0z/why_do_humans_have_the_tendency_to_walk_in_a_big/",
        "text": "",
        "created_utc": 1671236119,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much might modern personality models apply to humans of the past?",
        "author": "ever_sticky_puppy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/znt2mp/how_much_might_modern_personality_models_apply_to/",
        "text": "Some modern personality models (e.g. the Big 5) seem to have relatively broad validity, though there has been debate about their uses outside of western / educated / industrialised / rich / democratic societies.\n\nHow far back in history could such models be reasonably applied in attempting to understand human behaviour and subjective experience?\n\nHave we had any success in mapping what remains of old cultures (e.g. archaeological remains, oral traditions, stories or myths) to modern personality traits?\n\nDo we have any reasons to suspect that what we today call “personality” functioned and presented similarly / differently throughout human history?\n\nIf anyone has ideas please share and if you’ve read anything on these topics I’d love to read it!",
        "created_utc": 1671235377,
        "upvote_ratio": 1.0
    },
    {
        "title": "When/where was the concept of marriage first introduced?",
        "author": "SloppyCombatSloth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/znkxez/whenwhere_was_the_concept_of_marriage_first/",
        "text": "I am having a polite debate with someone who believes that the idea of marriage comes from the Bible. I personally feel like people were marrying before that, but would really like to hear some opinions from others.",
        "created_utc": 1671213855,
        "upvote_ratio": 1.0
    },
    {
        "title": "How plausible is the theory that South America was settled by people related to Aboriginal Australians?",
        "author": "Icy_Radish_8332",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zni2l2/how_plausible_is_the_theory_that_south_america/",
        "text": "My professor the other day said that it’s likely that the first people to settle in the Americans were an Aboriginal Australian group, and that the oldest skulls discovered in the Americas precisely match those of Aborigines, not those of modern Amerindians (who originally came from Asia). I did some research and it seems like this theory has some support, but I was just wondering what the current consensus is.",
        "created_utc": 1671206535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did we used to pee on ourselves in our sleep back in the caveman days, and only subconsciously figured out how to hold it while sleeping once we became “civilized”?",
        "author": "durrserve",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/znfkmf/did_we_used_to_pee_on_ourselves_in_our_sleep_back/",
        "text": "",
        "created_utc": 1671199893,
        "upvote_ratio": 0.4
    },
    {
        "title": "Human zoo by Desmond Morris",
        "author": "Mrblipblip",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/znczs0/human_zoo_by_desmond_morris/",
        "text": "Hello everyone!\nI just finished reading *the human zoo* by *Desmond Morris* and I'd like to ask some questions.\nI have no background at all in anthropology so , while his book and his views are interesting and thought provoking, I have no idea if what he says is still valid or not. I've tried to find a critique , however i can only find small reviews and some say that it has been proven wrong but no further explanation \n\nHas anyone here read it? What's your opinion? If you think he is wrong about some things, I'd love to know why (for example, a link to an article would be greatly appreciated). \n\nThanks in advance!",
        "created_utc": 1671191961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the ghost archaic human found mostly in West Africans \"originally\" come from West Africa?",
        "author": "NyxStrix",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zn7xf1/did_the_ghost_archaic_human_found_mostly_in_west/",
        "text": "15,000 years ago, North and East Africa were once inhabited by two groups of older humans known as the Nilotics (modern man) and a now-extinct Pygmy-type archaic people. These extinct pygmy-type people were closely related to the remains found in [**Iwo Eleru**](https://journals.plos.org/plosone/article?id=10.1371%2Fjournal.pone.0024024)**,** Nigeria.\n\nWas this ghost archaic human (Iwo Eleru) the original human of North East Africa?",
        "created_utc": 1671171632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend me a book on the history of anthropology as a discipline?",
        "author": "Midi242",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmwpqf/can_you_recommend_me_a_book_on_the_history_of/",
        "text": "Hey! \n\nCan you recommend me a book that shows me the evolution of the discipline from it's roots to today? I've read some works of anthropology (Mauss, Strauss, Clastres, Augé) mostly for my interest in philosophy, but I would really like to see the 'big-picture' with the different schools and important authors.",
        "created_utc": 1671139890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is gift giving viewed positively across all cultures and all time periods?",
        "author": "kazak9999",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmrce0/is_gift_giving_viewed_positively_across_all/",
        "text": "Per the title and the Christmas season, curious about the universality of gift giving from a broader, objective perspective.",
        "created_utc": 1671126666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know of any papers/books that look at consciousness from an anthropological view",
        "author": "Terrance__mckenna333",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmq0kn/anyone_know_of_any_papersbooks_that_look_at/",
        "text": "I’m currently in my first year of school(I know I have a very very long way to go) but I’m planning on becoming a biological anthropologist because I’d like to study consciousness and how psychoactive drugs have influenced evolution and the evolution of consciousness. However it doesn’t appear to be easy to find any information on this topic.",
        "created_utc": 1671123426,
        "upvote_ratio": 0.99
    },
    {
        "title": "Has any member of the North Sentinel Island Tribe ever left the island on their own?",
        "author": "rsplatpc",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmplpl/has_any_member_of_the_north_sentinel_island_tribe/",
        "text": "I was watching a documentary on North Sentinel Island, I see that some people were kidnapped off the island, I was curious if any tribe member ever left the island on their own / made their own boat, etc?\n\n I was not able to find the answer on Wiki or searches.",
        "created_utc": 1671122427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origins of 10th-12th Century Occitan Nobles",
        "author": "Khzhaarh_Rodos",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmi955/origins_of_10th12th_century_occitan_nobles/",
        "text": "I'm wondering what iron-early medieval age ethnolinguistic groups nobles from the Languedoc in the High Middle Ages would've primarily come from? Particularly the paternal lineage in most cases or what would've been the \"dominant\" cultural group they considered themselves as belonging to before Occitan was really a classification. Ik it likely varies from family to family but I'm not asking about specifics just which pools they drew from so to speak.",
        "created_utc": 1671101437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that anyone could be a Brahmin in ancient India? If yes, what is caste now? Is it mere fabrication?",
        "author": "bharath10291",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmejfm/is_it_true_that_anyone_could_be_a_brahmin_in/",
        "text": "",
        "created_utc": 1671086882,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's wrong with Engels, The Origin of The Family?",
        "author": "realniart",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zmay8y/whats_wrong_with_engels_the_origin_of_the_family/",
        "text": "Hello. I just finished reading The Origin of the Family, Private Property, and The State, by Engels. Many people have advised to read it for an understanding of early anthropology and how far it's come, but I'm struggling to find out exactly what's wrong about it and which points have had large updates. People talk about it like it's been completely reworked from cover to cover since 1884, and I was wondering specifically which points Engels makes that are incorrect. \n\nThanks!",
        "created_utc": 1671075050,
        "upvote_ratio": 1.0
    },
    {
        "title": "If there are ancient hunter-gathers in Northern Europe who developed the SLC24A5 and SLC45A2 genes, why did this phenomenon not occur in ancient Native American tribes?",
        "author": "JimmyThreeTrees",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zm7m8b/if_there_are_ancient_huntergathers_in_northern/",
        "text": "Sorry if I sound ignorant in how I am phrasing my question. I am not well versed on anthropology or developmental genetics. I was just curious and wanted to look into why the complexions of First Nations people and Native Americans in colder climates differ so much from those of folks from Northern Europe. E.g. light skin, blond hair.\n\nArticles or books on the topic would be appreciated too!",
        "created_utc": 1671065565,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the earliest known uses of poison / venom in medicine &amp; rituals?",
        "author": "ever_sticky_puppy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zm6p4b/what_are_the_earliest_known_uses_of_poison_venom/",
        "text": "Not sure if this is the right sub to ask this in, but I feel anthropology touches on this.\n\nWhat do we know about the ways in which poison / venom may have been used in prehistory (or as far back as we know anything about this)?\n\nAlso curious about what types / sources of poison / venom may have been used.",
        "created_utc": 1671063092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there aspects of British and Irish folklore that seem to predate the arrival of Celtic culture and language?",
        "author": "allo_eloise",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zm6dod/are_there_aspects_of_british_and_irish_folklore/",
        "text": "",
        "created_utc": 1671062282,
        "upvote_ratio": 1.0
    },
    {
        "title": "What schools should I look into for Linguistic Anthropology grad school (MA)? (and other related questions)",
        "author": "candlesdepartment",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zm1fxd/what_schools_should_i_look_into_for_linguistic/",
        "text": "I am currently about to graduate from undergrad with BAs in Theatre and Linguistics, from a relatively unknown university in Southern California. I plan to take a lot of time off (5-10 years) and work in theatre. However, after that I would like to return to linguistics, particularly anthropological and sociolinguistics. I have fairly good relationships with my professors and pretty good grades (I think I will graduate with \\~3.5 gpa, though I'm currently struggling in a 400s-level ling course), and I am currently working with one of my professors on his NSF research publication. However, I am worried about taking so much time off of school and off of linguistics, and I'm not sure how to explore grad programs/figure out where to go when I come back. I am also worried about the cost of programs, and planning for an MA vs PhD etc. I really love people and culture and society and stories, and would love to spend part of my life studying those things, but everything is up in the air right now. I would love suggestions on what to look into/what to do and timeframes. I would especially like to go somewhere further east (or international) for grad school, as I have spent my entire life in California.\n\ntl;dr do you have suggestions on what schools to look into and when I should look into them/apply to them?",
        "created_utc": 1671050014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any ethnographies/studies of survivalist communities?",
        "author": "Pyropeace",
        "url": "/r/AskSocialScience/comments/zlzldi/any_ethnographiesstudies_of_survivalist/",
        "text": "",
        "created_utc": 1671045404,
        "upvote_ratio": 1.0
    },
    {
        "title": "What hominids are humans mixed with?",
        "author": "GultiGang",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zlnyy8/what_hominids_are_humans_mixed_with/",
        "text": "Supposedly homo sapiens are a mix of ancient hominids like Neanderthals and denisovans. What is this makeup of admixture like across every human group today?\n\nAlso, which groups had more genetic difference between them? Ancient hominids or the modern human races?",
        "created_utc": 1671015239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evidence for age and gender ratios in prehistoric Hunter Gatherer communities?",
        "author": "bellumaster",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zledel/evidence_for_age_and_gender_ratios_in_prehistoric/",
        "text": "Say there is a hunter gatherer community in prehistoric Europe some 35-40,000 years ago that has 50 people in it. What would be the ratio of ages and genders of such societies, and is there any evidence to support it?\n\nObviously infant mortality was an issue, along with deaths from disease and injury. Researchers Gurven and Kaplan estimated around 57% of hunter-gatherers reach 15, 64% of those lived to or past 45. I am looking for general ratios that the tribe's ages and genders could be averaged out to.\n\nUnsubstantiated example: In a tribe of 50, 21 are male. There are seven adult males between 15-40, three over 40, 11 under 15. Of the females ten are over 13, five are over 40, fourteen are under 15.\n\nHow close are those numbers and ages to reality? Are there any resources to support claims such as this?",
        "created_utc": 1670983633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good documentaries about Thai Tree Ordination?",
        "author": "AlexRogansBeta",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zla3h9/any_good_documentaries_about_thai_tree_ordination/",
        "text": "Of any length (5min to 1hr). The ones on YouTube aren't great. Was hoping for something more robust/descriptive.",
        "created_utc": 1670972827,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the culture like along the Chinese-Russian border? Do European and Asian influences bleed into each other, do the borderlands skew towards one culture over another, or are the cultural boundaries rigid?",
        "author": "muttonchoppers",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zl4cpv/what_is_the_culture_like_along_the_chineserussian/",
        "text": "Hi there everyone! \n\nI hope my question is pertinent to this sub. I recently read that China and Russia share over 2,000 miles of border. That's not what one would call an insignificant stretch of land. This fact then had me thinking about how different the two countries are, culturally speaking. Hence my title questions! If anyone has any insight, I would love to hear it.\n\nThanks in advance, guys!",
        "created_utc": 1670959418,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does oral tradition decays over time?",
        "author": "TheCluelessObserver",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zl2kp0/how_much_does_oral_tradition_decays_over_time/",
        "text": "For example if the story of an event is transmitted orally, how reliable the informations will remain over time? I'm asking in the context of groups that doesn't use a writing system. I'm always a bit surprised when I hear a story is a proven fact but also has been passed down orally for centuries before being written down",
        "created_utc": 1670955243,
        "upvote_ratio": 0.99
    },
    {
        "title": "To what extent were paleolithic humans aware of their species differences?",
        "author": "NovaInvicta",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zktomj/to_what_extent_were_paleolithic_humans_aware_of/",
        "text": "It occurred to me that paleolithic human species might not have been fully aware that they were different species. Obviously there were physical differences among groups, but were our ancestors aware that Neanderthals and Sapiens were actually different species?",
        "created_utc": 1670931668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literature on the Philosophy/cosmology of Easter Island",
        "author": "Snoo87294",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zkrxg0/literature_on_the_philosophycosmology_of_easter/",
        "text": "The people of Easter Island is very fascinating. Mostly because of their extreme isolation. But most books and documentaries talks about what happened after 1722 when western people arrived. Is there any good sources on what the people thought about life and the universe before contact?",
        "created_utc": 1670925053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have a career opportunity in archeology? I have a bachelor's degree summa cum laude in sociology with a minor in anthropology, and a master's degree in sociology. I have studied a lot of anthropology works as well.",
        "author": "AsDaUrMa",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zknyxi/do_i_have_a_career_opportunity_in_archeology_i/",
        "text": "",
        "created_utc": 1670910766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were deadly animals ever a life-or-death concern for prehistoric hunter gatherers?",
        "author": "AGcuriousity1998",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zknuxh/were_deadly_animals_ever_a_lifeordeath_concern/",
        "text": "Here in the Pacific Northwest region of the United States you never see deadly predators. The risk of dying from a cougar, coyote, or bear attack is virtually nonexistent, and spider and snake bites are not a major concern either. Was this the same in hunter-gatherer times? How often were they attacked?\n\nIt is strange that humans evolved defense mechanisms such as the fight-or-flight response and adrenaline rushes if they would never be used.",
        "created_utc": 1670910414,
        "upvote_ratio": 1.0
    }
]