[
    {
        "title": "Understanding and beyond",
        "author": "Wrahms",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oq47g/understanding_and_beyond/",
        "text": "In some high-end subfields of science such as (famously) in **Quantum Physics**, admiting that although you know how and why something is \"correct\" nobody really understands it or at least no one is currently satisfied with their understanding. At the same time the search for a better understanding has never stoped.\n\nIn literature you have some works like **Finnegans Wake** which are very difficult to read.\n\nA lot of **philosophers** write in a very **inaccesible** way.\n\nDespite the differences on topics, approaches and reasons why total understanding may be imposible, in all of these cases and more there is a high degree of **abstract complexity that involves many layers and requires many years of good training to master.**   \n\n**So,** ***What are some more notable examples you know of this phenomenon?***\n\n***Will we ever be or should be able to \"solve\" this?***\n\n***What does it mean and how does it feel to just \"go through the motions\", to \"shut up and calculate\".***",
        "created_utc": 1675045434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you draw the line between plagiarism and poor paraphrasing?",
        "author": "JustForMyOCD",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ops2m/where_do_you_draw_the_line_between_plagiarism_and/",
        "text": "It seems really difficult for everyone to agree what is patchwork or 'mosaic' plagiarism and what is just poor paraphrasing. And with certain sentences, especially those that convey facts, there are only so many ways to say them. \n\nFor example would this be considered plagiarism?\n\nHe [George Washington] disapproved of red oranges and their upper-class British association; he disapproved of yellow limes and their resemblance to deformed lemons; and he disliked its links to health problems such as tooth decay.\n\nJohn Smith also observed that George Washington disapproved of yellow limes and its links to tooth decay; he disliked red oranges and their upper-class British association; and he only ate them twice during his life.\n\n\nSo, where do you personally draw the line?",
        "created_utc": 1675044507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic TT salary roughly equivalent to public teacher salary?",
        "author": "AnxiousLock5008",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10opeaf/academic_tt_salary_roughly_equivalent_to_public/",
        "text": "My sister has an MFA, and I have a PhD. She's looking to start teaching as a Chicago public high school teacher, while I have a TT job at a small teaching-focused school (would like to move to an R1 eventually, if possible). My PhD is from an Ivy. Her MFA is from a public state school. \n\nIt seems that her starting salary ($75k) is only $4k less than mine ($79k)! How is that possible? Academia is such a racket, seriously..",
        "created_utc": 1675043438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a good place to find non-sensationalized studies? [USA][Biology][Student]",
        "author": "Reddituser8018",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10onun6/is_there_a_good_place_to_find_nonsensationalized/",
        "text": " So I have noticed this issue with a lot of studies pushed by the media a good example is \"eating 2/3rds a bar of chocolate will help pregnant woman lower their blood pressure!\"\n\nI found the study behind that claim and it was a study with like 15 woman, they didn't have a control group whatsoever, it was just one group eating dark chocolate and another eating milk chocolate. It also wasn't even saying what the media was reporting it was saying, it didn't say 2/3rds of a chocolate bar anywhere in the study.\n\nI want to find a site that doesn't sensationalized studies but does simplify them a bit. I was curious if anyone knows any sites that do this?",
        "created_utc": 1675039254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I ask for more reference letters?",
        "author": "Significant_Rule_763",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ongra/should_i_ask_for_more_reference_letters/",
        "text": "So basically, a few months ago, I did an internship as an undergraduate student, where I had 3 professors as my supervisors. Currently, I am in the middle of my applications to different (Many!) graduate schools.\n\nI  have asked 2 out of 3 of my supervisors to write recommendation letters for me for my grad school applications, and they have happily agreed.  We have already submitted 9 or 10 applications, and a few more are remaining. (My choice of field mostly have direct PhD program as grad programs instead of separate MS, and the acceptance rate of PhD programs is usually very low. Hence, I am sending out many applications. Please  don't judge me.)\n\nSo anyways,  currently while being in the middle of grad applications, I have found some internship opportunities and I want to apply for them since I had only 1 undergraduate research internship experience (the one I mentioned at the beginning).\n\nThese internship applications require me to mention at least 2 people as my reference with whom I have worked. My internship supervisors have already uploaded so many letters (as mentioned above), in good faith. I  am feeling a little uncomfortable / awkward / ashamed to bother them to be my reference for the internship applications as well.\n\nOut of 2 internship references, I can manage 1 letter from one of my undergrad college lecturer, but I still need that other 1 from one of my internship supervisors.\n\nWhat should I do ? How should I ask them ? Or should I not ask them at all ?\n\nI don't want to feel like an irritating bug to them, whom they agreed to help once but is now asking for too much ?\n\nWhat should I do ?",
        "created_utc": 1675038242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you need a doctorate to be an investigator on an NIH R01?",
        "author": "mere-peristalsis",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10omcx6/do_you_need_a_doctorate_to_be_an_investigator_on/",
        "text": "If you're invited to be a co-investigator on an NIH R01, do you need to hold a doctorate degree? Can you be working towards one / have submitted sometime during the application process?",
        "created_utc": 1675035396,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Secret Behind FasterHomework.com's Fast and Reliable Essay Writing Services",
        "author": "AcademicWriterForMe",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10olxbv/the_secret_behind_fasterhomeworkcoms_fast_and/",
        "text": " \n\nWhat’s the secret behind FasterHomework.com's fast and reliable essay writing services? It’s simple - their team of experienced and professional writers.\n\nFasterHomework.com has a team of writers who are experts in their respective fields. They have years of experience in academic writing, and they’re able to produce high-quality and well-researched essays within a short timeframe. This makes them a great option for students who are facing tight deadlines.\n\nIn addition to their team of experienced writers, FasterHomework.com also has a streamlined process for delivering their services. They have a user-friendly website that makes it easy for students to place an order, and they have a fast and efficient support team that’s available 24/7 to assist with any questions or concerns.\n\nSo if you’re looking for fast and reliable essay writing services, be sure to check out FasterHomework.com.",
        "created_utc": 1675034324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cover Letter for Author Submission",
        "author": "GreenEyedTrombonist",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ol5dk/cover_letter_for_author_submission/",
        "text": "Hey All,\n\nI'm preparing my first cold submission (not a cfp response) for a journal. The paper received a top paper award at a conference and I'm wondering if that's appropriate to include in the cover letter, how you would integrate it, or what other information you would say is important to include.\n\nTIA!",
        "created_utc": 1675032419,
        "upvote_ratio": 1.0
    },
    {
        "title": "I owe money to grad school but I dropped out in a month",
        "author": "Cheesukimbab",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ol5d7/i_owe_money_to_grad_school_but_i_dropped_out_in_a/",
        "text": "I went to a CUNY for grad school right after getting my bachelors but I dropped out within a month and talked to the program director and she said she would remove the charges but she never did and it’s been over a year and they haven’t called me or anything to pay but I wonder if I have to pay or not",
        "created_utc": 1675032418,
        "upvote_ratio": 1.0
    },
    {
        "title": "As an early career researcher what are typical short-, medium- and long-term career goals to list in regards to supervising students?",
        "author": "tinzo222",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ok4av/as_an_early_career_researcher_what_are_typical/",
        "text": "I have just moved to new university which requires me to put in an application to register to be a PhD supervisor. I have past experience supervising honours/masters students but am hoping to take on more PhD students. As the title suggests I have been asked to outline my goals as a supervisor and was hoping for some advice on what is typical at this stage in my career?",
        "created_utc": 1675029930,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is photoshop use for generating figures?",
        "author": "charina12",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oiysz/how_common_is_photoshop_use_for_generating_figures/",
        "text": "I'm a current 3rd year PhD student interested in knowing if photoshop is common for figure generation. I currently use R for graphs and powerpoint for timelines and other little things, but are other people using photoshop? Or are people just using GIMP?",
        "created_utc": 1675027191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to go about securing a summer research practicum at ivey league schools in the U.S?",
        "author": "PaintMePanda",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oiicf/how_to_go_about_securing_a_summer_research/",
        "text": "I am a grad student from outside the U.S and am looking to do a summer research practicum - is cold emailing the best way to do this? or should I check out any particular websites? is there a more efficient way to do this?",
        "created_utc": 1675026119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Putting research projects (systematic reviews) on my CV - do I separate them by project under a heading called \"research experience\"?",
        "author": "PaintMePanda",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oigw4/putting_research_projects_systematic_reviews_on/",
        "text": "I have worked on several systematic reviews - some have not resulted in a publication, and some have. Do I separate them by the project and put them all under a heading called \"research experience\" in addition to the publications section?",
        "created_utc": 1675026031,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's some tips you would give to your undergrad self?",
        "author": "Rommyinla",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oh9jc/whats_some_tips_you_would_give_to_your_undergrad/",
        "text": "Hi,\n\nI am a cs undergrad (freshman) student in eu and I am thinking of doing my masters and phd afterwards. But I am not sure if I would fit in. I have never done research or written anything, nor does my uni offer anything for undergraduates. I also think I am not academically smart to participate in anything. I get extremely intimidated by people who are in maths/cs/physics academia. But I really have the desire to try it. \n\nI am trying to mantain my grades and understand the subjects deeply, but sometimes I have a hard time comprehending stuff (especially theoretical stuff - e.g reading my math lecture material). Is that an indicator that I am not cut for academia? \n\nIs there anything to do to help, or get me ready? Or what's some tips you would give to your undergrad self?",
        "created_utc": 1675023211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disability accommodations without a doctors note?",
        "author": "D62616",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ofdly/disability_accommodations_without_a_doctors_note/",
        "text": "TL;DR I am in my last semester of my masters degree, I had a 4.0 before this semester but am failing all my classes so far this semester 😰\n\nI was hospitalized in a coma over winter break (December 2022) and found out I have hypothyroidism, which is/was responsible for making me very tired, out of energy, etc. \n\nI’m on medication and feeling somewhat better but a thyroid doctor in my area has a 2 month long wait.\n\nI have never needed accommodations but right now I am failing all my classes and I know if I don’t get some help I won’t be graduating in the spring \n\nShould I make an appointment with the disability office, ask them to help me with accommodations, and get them a doctors note whenever I can get an appointment with a specialist?\n\nShould I talk to my professors about why I have barely turned in any assignments?\n\nI’ve never done this before, so I’m not sure what to do. The only disability accommodation I would want is to have a few extensions for assignments because I sleep so much still I don’t have enough energy to complete my work \n\nPlease be kind\n\nThank you in advance",
        "created_utc": 1675018727,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about the feasability of a small research work",
        "author": "Hagop99",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oex06/question_about_the_feasability_of_a_small/",
        "text": "I just want to know if something like this would be \"deserving\" for a publication, even if in a small time journal.\n\na descriptive study that would look into the comparative ability of ChatGPT to solve a medical school exam vs medical students.\n\nwould something like this be considered for a publication? or no way",
        "created_utc": 1675017608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are most phd scientists single and childfree?",
        "author": "hdugeo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10od7s9/are_most_phd_scientists_single_and_childfree/",
        "text": "[removed]",
        "created_utc": 1675013539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding Research Papers",
        "author": "raffittee",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10oboqt/finding_research_papers/",
        "text": "Does anyone know a research paper about text classification that has stated dataset size used/needed? Preferably published around 5-7 years only",
        "created_utc": 1675009796,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 weeks in, still no syllabus",
        "author": "fatshake",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10obg86/3_weeks_in_still_no_syllabus/",
        "text": " I'm a non-traditional student in my second year (of 3) MS program at a small mid-level east coast university. We are 3 weeks into the semester and one of my professors still has not released the syllabus for the course. I have asked 3-4 times, and each time was told it would be forthcoming within the week. I have already had issues with this professor changing class times - our first 6-9pm class was changed to 9a-5p at a location an hour and a half away with no discussion and no accommodation for those that could not attend. \n\nThis professor is the chair of a related program but not my program. My question is what should I do? I feel like it's disrespectful and unprofessional to act like this but also do not want any retaliation.",
        "created_utc": 1675009184,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get into a top 10 ranked marketing PhD programme?",
        "author": "AdMuch5895",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10o9g9h/how_do_i_get_into_a_top_10_ranked_marketing_phd/",
        "text": "I’m an Indian with MBA ( 2021 graduate)from a top 30 college ( in India) with average academics. I fell in love with consumer psychology side of the marketing and currently working in a brand management role in a Consumer Goods company. What are my chances to get into a Ivy League PhD in marketing, if there any. What other ways I should explore? I don’t want to do a PhD from India. I have done my bachelor’s in Engineering.\n\nI was trying to find a consultant or something similar who can evaluate my profile and help me in right direction to prepare. But I could not find any good consultants for this niche. Most work in undergrad and masters applications.\n\nIf you are someone ho’s currently doing a marketing PhD from a top tier university outside of India would help me pls!",
        "created_utc": 1675004047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pregnant on the Job Market",
        "author": "macademialife",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10o9c5i/pregnant_on_the_job_market/",
        "text": "[removed]",
        "created_utc": 1675003740,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do dean search committees look for at R2s?",
        "author": "Jumpy-Jellyfish-7239",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10o7u0z/what_do_dean_search_committees_look_for_at_r2s/",
        "text": "Have you ever served on Dean search committee? As department chair,I am considering what comes next. If you have certain committee, what really impressed you? What about particular candidates letters stood out or turned you off? \n\nAnd in interviews, when I ask questions like tell me about a conflict you resolved, or other behavioral questions, what were you looking for. \n\nFrom what I can see, and all the time seems like most are internal hires, even when there is an external search. So I want to be as prepared as possible.",
        "created_utc": 1674999489,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Europe] How to say during a postdoc interview that I'm still looking for other options?",
        "author": "croissantdechocolate",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10o5etr/europe_how_to_say_during_a_postdoc_interview_that/",
        "text": "My thesis defence will happen very soon, so I decided to start applying for postdoc positions for after that.\n\nMy first ever postdoc interview ended turning out great, and they want a second one, with someone else who is also a part of the project.\n\nThis is my first ever interview, and I'd like to have a better look at other available projects before deciding.\n\nIf this second interview ever goes well, and they decide to take my application, how can I say, tactfully, that I'd like to look for other opportunities before giving a final decision?",
        "created_utc": 1674990883,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between a manuscript and a pre-print?",
        "author": "myillusion13",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10o1bek/what_is_the_difference_between_a_manuscript_and_a/",
        "text": "Hi,\nI am still confused about the difference.",
        "created_utc": 1674975017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it viable to be a researcher in Ancient History still?",
        "author": "misanthropicsuccubus",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nzjbh/is_it_viable_to_be_a_researcher_in_ancient/",
        "text": "I would like to know the career viability of being a researcher in Ancient History in Australia. I mainly have a history in Sumerian/Canaanite/Assyrian/Hittite/Babylonian/Carthage history but I'm willing to also study Egyptian and Greek history. What would be the viability of getting a job? I would like people to be as realistic as possible before I commit to a masters of research.",
        "created_utc": 1674968807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting Letters of Recommendation",
        "author": "Delpen9",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nzc90/getting_letters_of_recommendation/",
        "text": "Hello everyone,\n\nI'm a 3rd years student of the Online Masters in Computer Science at Georgia Tech (concentration in machine learning).\n\nAfter finishing my undergraduate degree in Electrical Engineering, I began working at a Fortune 50 company while simultaneously pursuing my masters degree part-time.\n\nHere are my stats:\n\n- Published 3 papers (IEEE AIPR, ArXiv [this may not count for some people], and IESTOC)\n\n- GRE: 320 (160 Verbal, 160 Quant), I'm working towards improving this score.\n\n- Undergraduate GPA: 3.4\n\n- Antipated Graduate GPA: 3.3 (working full-time makes getting A's at Georgia Tech difficult for me)\n\n- My job involves Python software development with docker/pylint/git. Additionally, I heavily use seaborn, matplotlib, pandas, numpy, and beamer.\n\n- I've taken a 9 month bootcamp on statistics.\n\n\nMy current research interests are in reinforcement learning and symbolic regression.\n\nHere is my problem though: I have not been able to establish relationships with professors at Georgia Tech due to being in an online program. Because of this, my letters of recommendation would only be from professors from my undergraduate institution which I graduated from 3 years ago.\n\nI'm looking for ways to get research experience and garner better letters of recommendation from people who have first-hand experience on my research capabilities.\n\nDoes anyone know what I can do get research experience which can lead to good letters of recommendations? I'm very passionate about this field and want to get into a school such as University of Alberta in Canada for their reinforcement learning department.\n\nThank you!",
        "created_utc": 1674968164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will academics be affected by the recession",
        "author": "mspalaks",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ny23q/will_academics_be_affected_by_the_recession/",
        "text": "I am an RA at a public university and my contract ends in summer. It is important for me as my PhD funding completely depends on my RA/GAship. Any guidance as to how I can start finding another RA or financial security would be much appreciated 🙂",
        "created_utc": 1674963929,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are professional boundaries for college professors and students?",
        "author": "sabaping",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nxxsf/what_are_professional_boundaries_for_college/",
        "text": "Hi, for some background info: I went to an underfunded public highschool, so the teachers had to be a lot of kids' parents/only adult who loved them. I had close friendships with my teachers and leaned on them personally as well as academically. This would mean getting to know them, hanging out/talking outside of class, exchanging numbers, gift exchanges etc. On top of that, I am autistic. \n\nI'm new to in person university and its the first time I'm actually developing relationships with the professors since we *see* each other. The problem is, due to my background, I really don't get what the boundaries and social rules are. One of my required classes is by nature not meant to be super engaging and isn't relevant to most of the students' interests, but I am actually interested in the material &amp; the only one in the class who is. As a result my professor and I talk after class about the subject, email, and office hours just started but I did attend the only one theres been so far and do plan on attending, well, every week. \n\nMy question is, what are the boundaries for professor student relationships? I am curious about my professor's personal life, but I keep my personal questions related to his academic career. I'd like to share more about myself and have shared a bit about my past. I also am a baker and would love to share some baked goods. Is this kind of thing normal or overbearing? He did mention he came to my small liberal arts college because he could have a stronger impact on the students. I just worry about if I'm doing the right thing or not, I don't have bad intentions.",
        "created_utc": 1674963547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terrible master's thesis",
        "author": "bikunoob",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nwlgt/terrible_masters_thesis/",
        "text": "My master's thesis is just plain bad and terrible. It has so many mistakes due to lack of computational resources at that time (it was a CFD topic) and I made some stupid assumptions (which are wrong) to simplify the problem (my supervisor had not even read my thesis during the entire period and the examiners did not bother as well). At present I am pursuing my PhD and I have published my first paper in a good journal. However now I am worried about the future. Will my terrible joke of a master's thesis affect my career post PhD?\n\nMy master's supervisor has no know knowledge about CFD nor he was guiding me in any manner. I was very tempted to attempt this endeavour and thus ended up creating this dogshit 2 years back. I did learn the basics about the broad subject of CFD but that particular topic requires very high computational resources. At the end of the day it is my responsibility to be accountable for these mistakes.\n\nIt is highly unlikely that anyone is in this situation or has gone through this.\n\nCFD: Computational Fluid Dynamics \nI had 4 cores with 8 gb ram",
        "created_utc": 1674959405,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does everyone stay healthy?",
        "author": "Bilinguallipbalm",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nwf99/how_does_everyone_stay_healthy/",
        "text": "I've given up on mental health but how is everyone staying physically healthy? I'm glued to my desk when I'm not in class, lunch is whatever junk I can snarf down in 10 minutes and I can't sleep because I work 2 part jobs to make ends meet. I feel sick and weak all the time and need to know how to stay healthy enough to keep going for another year or so.",
        "created_utc": 1674958862,
        "upvote_ratio": 1.0
    },
    {
        "title": "DO YOU WANT TO SEE CHANGE IN HIGHER EDUCATION????",
        "author": "camarie27",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nv7sr/do_you_want_to_see_change_in_higher_education/",
        "text": "https://docs.google.com/forms/d/1EOLoMl86F59J2qMiitkZXjOJbtFm_HcuRUQEvRDgnRA/edit",
        "created_utc": 1674955180,
        "upvote_ratio": 1.0
    },
    {
        "title": "DO YOU WANT TO SEE CHANGE IN HIGHER EDUCATION?????",
        "author": "camarie27",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nv5pb/do_you_want_to_see_change_in_higher_education/",
        "text": "TAKE THIS SURVEY!!!!\n\nhttps://docs.google.com/forms/d/1EOLoMl86F59J2qMiitkZXjOJbtFm_HcuRUQEvRDgnRA/edit",
        "created_utc": 1674955004,
        "upvote_ratio": 1.0
    },
    {
        "title": "DO YOU WANT TO SEE CHANGE IN HIGHER EDUCATION???",
        "author": "camarie27",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nv4ek/do_you_want_to_see_change_in_higher_education/",
        "text": "TAKE THIS SURVEY!!!!\n\nhttps://docs.google.com/forms/d/1EOLoMl86F59J2qMiitkZXjOJbtFm_HcuRUQEvRDgnRA/edit",
        "created_utc": 1674954901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please take this survey for our senior year capstone class!",
        "author": "camarie27",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nuz58/please_take_this_survey_for_our_senior_year/",
        "text": "[removed]",
        "created_utc": 1674954461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Negotiating benefits for non-academic partners?",
        "author": "Due_Sir_2052",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nupcl/negotiating_benefits_for_nonacademic_partners/",
        "text": "Does anyone have experience with negotiating benefits into their TT job contracts for non-academic spouses? I have a couple of friends who were able to do things like negotiate a free MA or some kind of technical training for their spouse at the university they were hired at. My issue is a little more complicated though because my partner doesn't speak English. I'm from the US, I'm graduating from a US university, and I'm applying to jobs in the US--but we've lived outside of the US (where he is from, and where my research is based) for our whole relationship. He's come with me to the US for several months at a time and has picked up on a lot of English from those trips, but he's never had any formal English training and wouldn't be able to pass a TESOL test. He's fairly conversational in English, but we tried a practice test and the grammar skills that one needs to pass those tests just aren't there yet. I'm also based in a major city in the US where lots of people speak Spanish so he's had a great time when we go there, but some of the schools I've interviewed at are located in places with much less linguistic/cultural diversity. \n\nA big draw for staying in academia is that we would be able to come back to his country during the summer spend a lot of time with his family (I also plan to continue doing research here). However, we know that it won't be easy for him to relocate and start working right away. He's an architect and depending on where we end up we've talked about him doing an MA in architecture or urban planning or something like that, but obviously the English thing is a big issue. He does want to move and is excited about it, but obviously very nervous and it would be a huge sacrifice for him. It doesn't help that the job market experience lacks transparency and I really just don't know what will happen and what our options will be. \n\nI'm finishing my PhD this year and on the job market, and I've had much better luck than I expected so far, at least in terms of January Zoom interview invites. I'm not sure if I'll actually end up getting a job this round, but it has become obvious to me that we might actually end up moving back to the US soon and I'm trying to study up on what some of my options could be if I do end up getting any TT offers. Is it reasonable to request English/TESOL training for my partner in a contract? A couple of the schools I've interviewed at are (well-funded!) SLACs, but they don't seem to have ESL programs like bigger public schools do. If I ended up getting an offer at one of those places, would it be reasonable to try and get them to pay for ESL classes for him from a different university? \n\nI'm interested in hearing about ways that people have negotiated for non-academic spouses across the board, not just language training. I'm also shortlisted for a couple of postdocs and I don't expect that I would have a lot of spousal negotiating power with those, but if you have any experience with that I'd love to hear about it too.",
        "created_utc": 1674953680,
        "upvote_ratio": 1.0
    },
    {
        "title": "I called out on my friends for being Sexist",
        "author": "mspalaks",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nug8u/i_called_out_on_my_friends_for_being_sexist/",
        "text": "During a post-NYE celebration, my classmate/friend and her BF came over for drinks and my BF made a sexist comment and I called him out to refrain from using such wordings. Him and I can have this sometimes.\nMy friend was on a roll with her drinking spree and she picked up a verbal disagreement with me defending my BF, saying that \"I know he is not sexist\". To which I said, I didn't say he was sexist but that what he was saying, was sexist. \nShe infact went to an extreme of literally yelling at me at the top of her volume in my porch and then her BF dragged her back home.\n\nLong story short, should I refrain from putting my mind out during social events and bare with the idiocy and not correct my people?\nDoes other academics experience such things? How do you handle it?",
        "created_utc": 1674952935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Redoing a master degree is a crazy idea?",
        "author": "CivilWorth6910",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nq0k6/redoing_a_master_degree_is_a_crazy_idea/",
        "text": "Hello, I live in France and I want to become a researcher in mathematics. I did my bachelor, and my master in the same university. I'm in my second year of master degree in Mathematics. Last year, I had a severe depressive episode, I could not work and concentrate, my grades dropped out highly and I had to retake exams. I managed to \"overcome\" this (a bit too late though), see a psychiatrist, take medicaments, and to pass but barely... I should probably have repeated but I did not take the best decision. \n\nUnfortunately, my grades are not good enough this first semester and I don't think I can get a PhD in what I want. So, maybe I should restart my Master degree in another university - perhaps in another EU country.\n\nI think I should start at the first year - I do not feel confident enough. I know it can sound like a bad idea and is badly seen and I do not know any of my professors who did not have a straight path with excellent results but I have a bitter taste of not being able to do what I want for mental health reasons.",
        "created_utc": 1674941138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Left out of acknowledgments-rant",
        "author": "Any-Obligation9761",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nozs6/left_out_of_acknowledgmentsrant/",
        "text": "I just found a paper recently published, where I had been a tech for 3 years (the duration of the data collection). I had been responsible for assisting on ⅓rd of the content of the paper (for which I had carried out ~70% of the data collection. I had also done 100% of the data management, a good chunk of the math/development of methods, and assisted on parts of the other ⅔s of the paper’s content).\n\nI can understand not being included as an author—but I definitely contributed a massive amount to the dataset, and was completely left out of the acknowledgements. There were a dozen other techs acknowledged by name, who had only helped for a couple days over the 3 years. \n\nI’m just frustrated. Anyone else been forgotten?",
        "created_utc": 1674938541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Auckland declares emergency after heavy rains",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10noy3b/auckland_declares_emergency_after_heavy_rains/",
        "text": "[removed]",
        "created_utc": 1674938422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can undergrads publish articles and have them taken seriously? (Humanities)",
        "author": "fluffyhappysheep",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nksb1/can_undergrads_publish_articles_and_have_them/",
        "text": "**Note: I can't ask in the academic publishing subreddit because you have to be approved to post there and despite messaging the mods, I am not approved.**\n\nHi everyone, I'm an undergrad intending to apply to grad school within the next 2 years. I'm very interested in publishing in my field (humanities) and would like to know if it is possible for undergrads to publish journal articles.\n\nA few questions:\n\n* Is it common for undergrads to get published? \n* Do people take them seriously, or would they be laughed out of submissions? \n* How do I get started? Do I have to \"know someone who knows someone\"?\n\nI am doing this all on my own, with no real connections in academia yet, so I've been lurking here to try and learn more about what life is like in the academy.\n\nThank you for taking the time to respond.",
        "created_utc": 1674927828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highly publishing scientists",
        "author": "StefanFizyk",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10njwbk/highly_publishing_scientists/",
        "text": "There is something that is bothering me lately: every year there are lists made of the most cited and most published scientists. If one looks closely there are people who publish several papers a week.  It is clearly not possible to have any reasonable creative or technical  input to so many works. To me this is clearly a hoax. They are added to papers that they have likely never even read.\n\nNow such behaviour is agains any university ethical guidelines, yet those individuals are celebrated instead of facing any sort of adversity due to highly unethical behaviour. Why is that?",
        "created_utc": 1674925480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I Quit My Undergraduate Thesis",
        "author": "Proper-Ad1770",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10njexh/should_i_quit_my_undergraduate_thesis/",
        "text": "Hello,\nSenior Sociology student in their final semester of undergrad. I was accepted into the honors program at my University this fall, which entails conducting an independent research project and writing an undergraduate thesis (about 35 pages). We also have the opportunity to present our research at a formal academic conference in the Spring. However, the professor in charge of the honors program has so far made this experience one of the worst and most stressful of my life. They are not just a harsh and punitive grader, but also give incredibly unclear and contradicting feedback. When I ask for clarification or assistance, I am met with responses that are unhelpful and confusing delivered with a “you’re stupid” tone. Then, often times, when I do make the suggested changes (that my professor recommended), I am told they are all wrong (what were you thinking??) and to basically put everything back the way it was originally. Finally, this professor has also made mean and disparaging comments about my classmates behind their backs, both to us and to our other faculty mentors in the department. They have shared personal information about my peers that should not have been shared, and have pitted us against each other and compared us to one another. At this point half of the cohort is considering dropping. My experiences with this professor have shattered my self confidence and caused me severe mental distress. \n\nSo, my dilemma is: do I gut it out for last three of months of my undergrad career so that I can have a completed undergraduate thesis to put on my resume, or do I prioritize my mental health and leave the program?",
        "created_utc": 1674924255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good average score with one/a few bad grades for masters admissions",
        "author": "dominimal",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nigff/good_average_score_with_onea_few_bad_grades_for/",
        "text": " I'm   studying Computer Science BSc at a Hungarian university, our grading   system goes from 1-5 with 5 being the best and 1 meaning you failed. I'm   in my second year, and so far i managed to get all 5's with one   exception, when I got a 4. This semester went pretty well for me, but   currently I am feeling completely burnt out, and I have one exam coming   up in two days, which I will probably be able to pass, but only with a 2   or a 3 if I get lucky. It is a pretty important class (Numerical   Methods I.), but in our system the classes are actually split in two   parts, practice and theory, and I already got a 5 from the practice part   of this class.\n\nI know a good   average score is essential for getting into a good masters programme,   but does one bad grade (or maybe a few, if this would happen again in   the future) with an otherwise good average affect my chances for   admissions?",
        "created_utc": 1674921810,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhD at the University of Glasgow - Post-PhD reflections of those who stayed in academia?",
        "author": "Razkolnik_ova",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nf2ic/phd_at_the_university_of_glasgow_postphd/",
        "text": "I'm an international PhD student at the University of Glasgow working in the field of clinical neurology. \n\nAre there any people out there who did their PhD at Glasgow uni and stayed in academia? Were you happy with your experience and the opportunities that you created; did you think the university was a good place to do your PhD? In case you managed to secure a postdoc, how was that for you? Did you move to a better/worse institution and did you think that the research group/supervisor that you worked with/under played a role?\n\nThanks in advance for sharing any reflections :)",
        "created_utc": 1674912451,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do academics split the workload on a collaborative paper?",
        "author": "RonWeasley_is_a_Mood",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ncxwf/how_do_academics_split_the_workload_on_a/",
        "text": "Basically, I'm currently researching for an paper and have reached a point where I can't focus so this question popped up in my head and now I'm curious. I've been reading several articles today that are a collaborative work and I've been trying to detect stylistic changes in the writing, to try and guess if different people wrote different sections, because apparently I have nothing better to do.\n\nSo, here's my question, how do collaborative papers work? Does everyone research a little bit and write a little bit or does one person do the writing but everyone does the research/brainstorming/planning aka the behind the scenes bits?",
        "created_utc": 1674905127,
        "upvote_ratio": 1.0
    },
    {
        "title": "4 reviewers for a manuscript, is this normal?",
        "author": "throooooow_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nck0v/4_reviewers_for_a_manuscript_is_this_normal/",
        "text": "I submitted my very first manuscript, which has been \"under review\" for 3 months, so I emailed the editor to ask about some info and when I could expect a status change. I was told that they received 2 reviews, and sent the manuscript to 2 more reviewers and should receive these soon. I've heard that sometimes editors send a manuscript to a third reviewer when the first two reviews highly contradict eachother, but what's up with two more reviewers? Do you have any hypotheses as to why this may happen? Or has that ever happened to you? Thanks!",
        "created_utc": 1674903663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yesterday I packed my stuff and walked out",
        "author": "NnoNonoNoYess",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10nas33/yesterday_i_packed_my_stuff_and_walked_out/",
        "text": "I'm a Postdoctoral Researcher. I gave my resignation a month ago because of a number of issues. They can largely boiled down to having a horrible PI who had absolutely no ethical boundaries.\n\n2 days ago  I found out he contacted my partner (partner was a colleague 2 years ago )  and told him that we shouldn't be dating, didn't know what he saw in me and that he wished we ended the relationship.\n\n\n My response :\n\nYesterday I went in early, took my last remaining holidays, made an official complaint to the head of department, packed my bags and walked out.",
        "created_utc": 1674896936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applied to Fellowships in October and still haven’t heard anything. Normal?",
        "author": "Thoth_ismyPatron",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n7ugn/applied_to_fellowships_in_october_and_still/",
        "text": "I applied to some US based Humanities Fellowships in October 2022 but haven’t heard anything from a bunch. Should I assume rejection at this point? This is for scholar fellowships (I hold a tenured position) at major institutions but not huge ones (think Getty, National Art Gallery). I logged back on one and my application isn’t there any more to check on. But I never received any communication. I assume, like most things I apply for, that I didn’t get it but is this normal to just not hear back with Fellowships? First time applying for sabbatical fellowships. I know there are jobs out there I was never rejected from when I applied a decade ago but just assumed for some reason fellowships would be a bit more organized. Doesn’t seem to be a lot of info on my normal go to sleuthing sites such as academic jobs wiki. Are there other sites to hear about fellowships?",
        "created_utc": 1674885920,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I memorize a large chunk of information within a short time?",
        "author": "ThatOneFourGuy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n52py/how_do_i_memorize_a_large_chunk_of_information/",
        "text": "Got an exam on Monday, its Friday night now. We were given the questions, but there is quite a few questions. 58 to be exact, so how do I memorize all that within two days? \n\nIm thinking of just going through each question asking myself, If I know it I move on if not I right it down then just study the ones I wasn’t sure about and repeat. Is that a good idea? \n\nIm asking so someone smarter can let me know if there is a better/more effective way I can review this.\n\nNote: have no clue if I’m posting this In the right sub or not. ( ask academia ) though will share post to other sub",
        "created_utc": 1674877000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduate research paper help",
        "author": "yaksha00",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n4dxg/graduate_research_paper_help/",
        "text": " let's say I have the following hypothesis: There is a significant impact of Foreign exchange rate, GDP per capita, Inflation, and Foreign reserve on Export.  After applying regression analysis, the p-value of the model is less than 0.001 but the p-value for the exchange rate, GDP per capita, foreign reserve, and inflation is higher than 0.05. Based on this information is that hypothesis accepted or rejected?",
        "created_utc": 1674874968,
        "upvote_ratio": 1.0
    },
    {
        "title": "confused graduate",
        "author": "savorybi",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n22xp/confused_graduate/",
        "text": "hi! so i graduated with a b.s. in neuroscience over the summer and i am taking a gap year before applying for grad schools. i have been working in a lab at my prev uni for a while and my PI has offered me a position as their masters student this fall. i love the lab and love my PI, but this school only has psyc grad programs and very few neuro faculty. I'm aiming for a phd in neuro so it wasn't even on my application list, but it will save me from having to relocate. should i take the easy way out, skip interviews &amp; relocation for now, and accept? or am i shooting myself in the foot by getting a degree in experimental psyc when what i really want is neuroscience?",
        "created_utc": 1674868514,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you choose professors strategically? Maximise connection and minimise risk of drama",
        "author": "GoodArtichoke1559",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n1l86/how_do_you_choose_professors_strategically/",
        "text": "I had a professor last semester who was extremely nice and friendly. \nI don’t know how well connected she is or how generally ambitious but I appreciated not having to worry about her ego and just being able to appreciate the texts and the work. I’m registered for another class with her this semester and it’s an enjoyable A that won’t contribute to graduation requirements but will be easy on my mental health. \n\nContrast this with a professor who had a very fragile ego but was more published. \n\nContrast this with famous or highly published professors who everybody is trying to impress already. \n\nEspecially as an ambitious individual, who wants to be challenged but also wants the space and freedom to explore, how do you choose professors intelligently?",
        "created_utc": 1674867231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Publishing a reworked UG thesis - Help please.",
        "author": "roy2roy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n0yrw/publishing_a_reworked_ug_thesis_help_please/",
        "text": "Hello,   \n\n\nI don't want to publish the thesis as is, but rather rework it into an article. Is this doable, or wise? I just want to try and at least get one publication out there since I have 8 months before I start grad school.   \n\n\nMy thoughts were to email my adviser who helped me with it on the possibility of reworking it, since I used their site as part of my research.   \n\n\nIs this something worth trying, or should I let my UG thesis lay as is?   \n\n\nThanks!",
        "created_utc": 1674865577,
        "upvote_ratio": 1.0
    },
    {
        "title": "To PhD or not to PhD?",
        "author": "q0rry",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10n0upb/to_phd_or_not_to_phd/",
        "text": "[removed]",
        "created_utc": 1674865286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we live in an \"age of interdisciplinary research\"?",
        "author": "CorrigeMonFrancaiSTP",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mxjx5/do_we_live_in_an_age_of_interdisciplinary_research/",
        "text": "I was reading this article by Nathan Ballantyne, \"[Epistemic Trespassing](https://philpapers.org/rec/BALET-2).\" It's a really interesting article that discusses people that make judgements about subjects that lay outside of their field of expertise. However, several times the author says that \"\\[epistemic trespassing\\] is ubiquitous in this age of interdisciplinary research.\"\n\nI was surprised by the statement that we live in an age of interdisciplinary research — but maybe I am biased because of my particular field. In political theory/political philosophy, there isn't much interdisciplinarity and I feel that, on the contrary, the field in general is increasingly narrow and compartmentalized.\n\nIs your field very interdisciplinary? Do we live in an age of interdisciplinary, as Nathan Ballantyne says?",
        "created_utc": 1674857175,
        "upvote_ratio": 1.0
    },
    {
        "title": "LVMH sales soar despite losses in China",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mwtp6/lvmh_sales_soar_despite_losses_in_china/",
        "text": "[removed]",
        "created_utc": 1674855418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philippines: Onions become a Luxury",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mwdty/philippines_onions_become_a_luxury/",
        "text": "[removed]",
        "created_utc": 1674854353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robbers Made off with 5000 Chickens from Rawalpindi",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mumdn/robbers_made_off_with_5000_chickens_from/",
        "text": "[removed]",
        "created_utc": 1674850035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Publication taken out of context",
        "author": "womanreading7",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10muerq/publication_taken_out_of_context/",
        "text": "Hi everyone, I’ve never posted here so apologies in advance if this isn’t the correct place for my question. I published an article back in 2020 as the first author and I was recently reviewing it to prepare for my PhD interviews in case I was asked any questions about it. I noticed it had been cited a few more times since I had looked at it last, so I went to check out the articles that were referencing my paper. \n\nIn one of these articles, my research is cited twice and is summarized completely incorrectly in both places. The authors are using my paper as an example of findings which support their theory that folks who experience early life adversity build resilience to stress. While my paper does have to do with stress/anxiety, this is not what I was testing whatsoever. My research never even mentioned anything close to what they are suggesting. \n\nMy question is, should I do anything about this? It doesn’t particularly bother me, but I am a bit confused. Would it be worth it to contact the corresponding author or should I just leave it alone? Is it common for people to mistakenly cite papers like this?",
        "created_utc": 1674849553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jeremy Hunt to unveil growth plans in the face of mounting criticism",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mucub/jeremy_hunt_to_unveil_growth_plans_in_the_face_of/",
        "text": "[removed]",
        "created_utc": 1674849423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can airresistance overcome the tire's grip?",
        "author": "GiantGrape11",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mtujh/can_airresistance_overcome_the_tires_grip/",
        "text": "Maybe I just stand on the hose, but I came up with this question. \n\nWhen having indefinit engine power, can a car get so fast that the airresistance is so large that the tires do not have enough grip to overcome that to accelerate the car more?\n\nTheoretically this should be the case, but is the a easy way to calculate the speed at which such a phenomena would occur?",
        "created_utc": 1674848208,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the current and future uses of AI by academics?",
        "author": "Wrahms",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mtgwf/what_are_the_current_and_future_uses_of_ai_by/",
        "text": "My question comes about from the fact that this technology is growing exponentially and will probably change everything very rapidly.\n\nDespite this, save a few exceptions like its use in solving protein folding, I hear little of its serious use from the media.\n\nI'm personally only half-baked in academia, having only reached a few years of tertiary education in chemistry which were interrupted years ago because of my severe lack of emotional preparation to deal with the hard requirements/demands of university.\n\nI'm currently planing on using ChatGPT for writing a piece of literature with a structure roughly analogous to [this](https://en.wikipedia.org/wiki/Le_Marteau_sans_ma%C3%AEtre) iconic piece of avant-garde music. I think \"anonimous hypercomplexity\" will become a thing.  \n\nAnother thing I've toyed around is, for example, creating new spellings of the English language trying them to be closer to the phonetics of Received Pronunciation without it resulting in an ugly mess.",
        "created_utc": 1674847325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where is a good place to find an academic willing to advise me as I right a history paper?",
        "author": "Smart_Hovercraft_142",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10msxpx/where_is_a_good_place_to_find_an_academic_willing/",
        "text": "The subject is The Chinese Exclusion Act. It'd be cool to find someone willing to advise my journey in writing it through an online advising sort of relationship. It should only be like ~8 pages long",
        "created_utc": 1674846123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Long-term adjuncts?",
        "author": "Much_Conversation426",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mrssv/longterm_adjuncts/",
        "text": "Curious if anyone here is a long-term adjunct. I’ve been adjuncting for two semesters after about a year spent away from academia in the non-profit world. Though I found that work meaningful, I have a difficult time with work that doesn’t actively engage my intellectual and creative pursuits. I’ve been able to supplement my adjunct work with other university work and have made a livable wage thus far and find purpose in it that I’ve yet to find elsewhere. Though the work can be precarious with cancelled courses and such, I’d be content to do this for the foreseeable future. I suppose it depends on your level of financial comfort, sense of connectedness with your work, competencies being utilized, etc., but have any of you been adjuncting for say, 5+ years, and are content and financially solvent?",
        "created_utc": 1674843444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Ph.D programs: are they reputable?",
        "author": "agawl81",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mrfi7/online_phd_programs_are_they_reputable/",
        "text": "I am looking around trying to decide if I want to pursue a Ph.D in education with emphasis in policy and analysis or something similar. \n\nI have a master of art of secondary teaching, and am finishing an Ed.S in special education and administration. I’m realizing that I have no interest in running a building or district but I enjoy the idea of working on using data to refine policies and I enjoy compliance work with ieps. \n\nSo in my looking around I see that most phd programs are in person. But I’ve seen a few offered in an online format. \n\nMy question is: are these legitimate or are they pay for diploma? \n\nBonus question: does anyone know of any really good Ed research, analysis, policy programs?",
        "created_utc": 1674842575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong to ask for recommendation letters for different majors?",
        "author": "JollyLifer",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mqk55/is_it_wrong_to_ask_for_recommendation_letters_for/",
        "text": "I asked for a recommendation letter for business school. I got it and submitted applications for business school MBA because there is a scholarship for it that was going to also provide PhD scholarship upon graduation from MBA, I couldn’t miss such an opportunity. \n\nNow I’m thinking about applying for PhD in engineering (my undergrad+masters was in engineering). I didn’t do this because no scholarship but I found one now and I’m thinking of applying for it. Should I ask or should I wait 2 years where I’ll be working an engineering job and then reach out again for letters for a PhD in engineering? \n\nI just am trying to end up in academia because it’s where I thrive, got two papers out in Q1 journals and graduated top of my class; I just love research.",
        "created_utc": 1674840511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Many people tell me that academia is currently \"broken\" but I don't understand why?",
        "author": "Toen6",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mo1na/many_people_tell_me_that_academia_is_currently/",
        "text": "Just to be clear, I am a master's student currently finishing up his thesis and considering going into academia but dreading doing so because of all the horror stories.\n\nTime and time again, both online and with the academics I speak to in real life, I keep hearing that academia is \"broken\". That the pressure on publishing as much and as fast as possible is too high for too little pay and that there are too few available positions.\n\nWhat isn't entirely clear to me is:\n1. Why is this the case?\n2. If it wasn't like this in the past, what has changed and why?\n\nAny thoughts on this would be greatly appreciated.",
        "created_utc": 1674834452,
        "upvote_ratio": 1.0
    },
    {
        "title": "What software do you use to make presentations?",
        "author": "CuyiGuaton",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mnw2c/what_software_do_you_use_to_make_presentations/",
        "text": "Hi y'all. \n\nI've been using Latex beamer to make all my presentations, and IPE to make my figures.\n\nAnyway, I feels that it is an arcaic way to make my presentations. I'm doing a presentation for a math conference in latex, and I think that it take to much time.\n\nWhat modern software do you recommend for do presentations?",
        "created_utc": 1674834082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Science sites",
        "author": "Paslaer_flurt2154",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mnnl7/science_sites/",
        "text": "What",
        "created_utc": 1674833504,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been basically cheated out of one of my degrees",
        "author": "Embargo_44",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mmnss/i_have_been_basically_cheated_out_of_one_of_my/",
        "text": "This is my first year at university where I was supposed to do a double degree in mathematics and computer science. But after joining the university due to a stupid regulation change I can no longer get a degree in mathematics and will have to only study computer science. (Don't ask me to explain the whole system just trust me on this). I've been very passionate about mathematics for a long time so I've always wanted to have a degree in math (from like 8th grade I've been studying extra mathematics on the side, and being involved with all the math clubs) . I also know and enjoy programing but math is my true passion so I thought this was the perfect arrangement. Complete this double degree, them move onto studying mathematics as a masters and live my happily ever after. Now I've found out the university has swindled me out of my mathematics degree. I've sent out my applications for transfers in many universities but since I got the news too late I missed a deadline for many of them. So even if I want to transfer I'll have to send my applications next year and transfer on my third and final year which sounds dumb. So what would you do in my shoes? Can I still continue my masters in mathematics if I just study CS. I don't want to spend 3 years without studying mathematics even though I really enjoy CS. And even though the CS course is decently focused on mathematics (its around 30-40% math) I still want more. (Also I am in Europe)\n\nP.S - I've already finished the first semester, the double degree (so mathematics) was supposed to come in from the second semester.",
        "created_utc": 1674831028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it make sense for me to a master's in History if I probably don't want to go into Academia?",
        "author": "Tigercat44",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mlu7e/does_it_make_sense_for_me_to_a_masters_in_history/",
        "text": "So for context I graduated with a First in History from Oxford last June and was due to study a Social sciences masters at the LSE but changed my mind. I decided that maybe I'd like to do more History so I applied and now have an offer for a master's in Modern British History at Cambridge. But the thing is that I'm pretty sure I don't want to go in academia and am potentially interested in a career related to politics, maybe in public affairs or working for a think-tank etc. \n\nMy question is whether it makes sense for me to do this master's, even though I love History and think it'd be a great experience, or whether it would make more sense to study something more related to Politics at a perhaps slightly less reputable university or do no master's at all? I know this is a decision that ultimately I have to make but I'd be grateful to hear other's opinions",
        "created_utc": 1674828867,
        "upvote_ratio": 1.0
    },
    {
        "title": "a bending question.",
        "author": "Aelitethinker",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mlq92/a_bending_question/",
        "text": "Why do no ancient or modern religions talk about dinosaurs? Are religions man-made?",
        "created_utc": 1674828582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Citation help",
        "author": "hqu139",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ml6up/citation_help/",
        "text": "Hello,\nDoes anyone know how to cite a publisher’s overview of a book (e.g., an about page of a book/product page)? I'm gathering background information about an excerpt my professor assigned, but I can't figure out how to cite the publisher’s page. I've checked Purdue Owl, but nothing has come up.",
        "created_utc": 1674827172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a note-taking software which allows you to smartly tag information (like a twitter hashtag) (not Zotero)",
        "author": "productivesuz",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ml2n3/looking_for_a_notetaking_software_which_allows/",
        "text": "Hi all, \n\nI'm a law &amp; political science masters student about to start writing my thesis. \n\nI want to be able to use a kind of hashtag/label note-taking system wherein, while note-taking on sources, I can create labels which I can filter by or generate notes based upon them. Think like a twitter hashtag.\n\nI've spent the last few months trying out Zotero. Prior to this, I was using on OneNote where I would hashtag information and then use the search function to see information from a variety of sources relating to that theme. Onenote also has labels but it has always frustrated me that you could never make custom labels or have words as labels.\n\nThe key appeal of Zotero was the ability to tag quotes (which you could then filter) and the ability to generate notes. However, Zotero didn't quite work for me.  It encourages you to highlight which made my note-taking process lazy and I want a more sophisticated labeling software which allows you to see labels across sources and could generate notes based on those labels.\n\nDoes such a software exist? It feels like it should be a pretty basic tool for qualitative research.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_EXAMPLE\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPage 1: Smith (2001) Revisiting the Withchunts\n\n* p.6 religion was key to the witchhunts  **#causes**\n* p8 \\[random other info\\]\n\nPage 2: Allan (1987) The Witchhunts in Context\n\n* p.81 transition to capitalism was a factor in fueling the witchhunts **#causes**\n* p84 \\[random other info\\]\n\nand then be able to \n\n1. click on **#causes** and see all the different times I had used that label across all sources I had read\n2. generate a compilation of all bullet points made with **#causes** in its own a separate page (bonus points if it could automatically update)",
        "created_utc": 1674826849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Australian Cattle dog",
        "author": "akvsangli",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mjsm5/australian_cattle_dog/",
        "text": " The Australian Cattle Dog is a strong, compact, and sturdy dog, enabling him to combine great endurance with bursts of speed and the extreme agility necessary in controlling unruly cattle. They give the impression of a dog that is tough, alert, and capable of quick and sudden movement. The weather-resistant coat consists of a short, dense undercoat and a moderately short, straight outer coat of medium texture.  Height: Male 46–51 cm, Female 43–48 cm Weight: Male 15–16 kg, Female 14–16 kg",
        "created_utc": 1674823089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Project deadline coming up - stats holding me back",
        "author": "rem0401",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mhlqa/project_deadline_coming_up_stats_holding_me_back/",
        "text": "As title says. I have a project due soon and need to submit a paper by the summer - I’ve worked for 3 months to do the stats but still having trouble with it. I need to do logistic regression (i think?) and have understood the concept by now but the minutiae of reporting the outcome is hard for me. I’m worried about missing something like reporting “cohens d” or something similar.  Mentor says I’m unable to share our data a third party statistician due to IRB. \nTips and resources? \n\nIf not the right subreddit please let me know where I should go",
        "created_utc": 1674814904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mendeley… help!?!",
        "author": "Accurate_Fly9803",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mhh9t/mendeley_help/",
        "text": "I have a document written by someone who used Mendeley. Is there any way to convert fields to plain text *without* installing Mendeley?\n\n\nI did attempt to install Mendeley for the sole purpose of erasing all trace of Mendeley from the document, but the Word plugin just sent me in a loop of errors. I don’t have time to troubleshoot that problem for a program I have no intention of using.",
        "created_utc": 1674814410,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know if I will ever regret if I didnot get my PhD",
        "author": "Naive_While_6177",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mgl8g/i_dont_know_if_i_will_ever_regret_if_i_didnot_get/",
        "text": "Without going to so much details I have been facing bullying and harassment by my supervisor, I have documents and evidence.\n\nThe ombudsman had a meeting with the supervisor but it seems it goes nowhere I will have a meeting on Monday with the ombudsman.\n\nI have PTSD and I do already suffered a lot, it supposed one year left but I don’t trust them I don’t feel safe. They stalk online and my social life. It seems university want to protect them.\n\nI have one paper in a highest impact journal and I cannot work anymore, I am beyond mentally sick seeing them again.\n\nI wish I was stronger, recently I am sickness leave and the best thing ever to not see them.\n\nHowever next week all this should be finalised and it seems scary.\n\nI don’t know if I will ever regret all these things.\n\nNot having a PhD would mean lose my academic job back home, I don’t want already there be anymore.\n\nI am now working part time for industry and I love it I meet bright and great people and I felt happy.\n\nI am also science communicator and I got to know many companies talk to great minds and now hopefully having bee sponsors.\n\nAlso I am not young 32 I wish I can soon start a family and being in academia give me so much pain.\n\nI just need to know I will be ok or not, how maybe it having my phd would affect me. Will people consider me less credible.",
        "created_utc": 1674810613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are most phd scientists single and childfree?",
        "author": "hdugeo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mga9c/are_most_phd_scientists_single_and_childfree/",
        "text": "[removed]",
        "created_utc": 1674809341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do I get unaffiliated college advise?",
        "author": "idahocowgirl5",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mg88t/where_do_i_get_unaffiliated_college_advise/",
        "text": "I have a BS degree and I am wanting to go back to college for a significant career redirec but I am struggling with finding a direction. Masters degree vs second bachelors degree? Which college? Online or campus? I am so overwhelmed!",
        "created_utc": 1674809099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Alternative of Turniitin, Grammarly &amp; Quetext.",
        "author": "Nice-Day-7495",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mfpdh/free_alternative_of_turniitin_grammarly_quetext/",
        "text": " Hey 👋 everyone! I honestly need your #help because we have launched free alternative of turnitin, Grammarly &amp; quetext.  \n\n\nHere is the link: [https://plagiarismchecker.ai/](https://plagiarismchecker.ai/)   \n\n\nIf you have any suggestions on how to improve it, please let me know.",
        "created_utc": 1674806869,
        "upvote_ratio": 1.0
    },
    {
        "title": "law in the uk for a foreign national and is it worth it",
        "author": "IllustriousBasis6311",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mdfv0/law_in_the_uk_for_a_foreign_national_and_is_it/",
        "text": "Hey y'all I'm a 17 year old year 11male from india i aspire to be a lawyer some day and i was considering British legal practice there's not much clear information about the scope demand and also the market for young solicitors there if any one of you could give me a idea about is it worth it , how is the pay for young solicitors , how much capital i would require",
        "created_utc": 1674798291,
        "upvote_ratio": 1.0
    },
    {
        "title": "faculty job applications that have you fill out your cv/resume info - how necessary?",
        "author": "bluesmaker",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mccbf/faculty_job_applications_that_have_you_fill_out/",
        "text": "I'm applying for faculty positions and some colleges and universities have you fill out your cv/resume info. Like entering your work experience and ranges of dates. How necessary is it for me to fill these things out? Since the process of getting a job as a professor is pretty unique, it seems odd to fill things out in this standard way. Anyone have a sense of this? Like I assume the search committee would never look at this stuff but maybe some people working for the admin would. Or no one at all. \n\n(also was not sure  what flair makes sense for this topic).",
        "created_utc": 1674794602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaving an ivy league postdoc early can I get a liberal arts college professor position?",
        "author": "Excess-human",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10mbqvj/leaving_an_ivy_league_postdoc_early_can_i_get_a/",
        "text": "I have a PhD in biology from a top ranked school and am doing a postdoc at an ivy league institute but have realized that I would prefer a teaching focused position with some undergrad level research. There is a position at a smaller college in my home area I would love to work at and am considering applying. I have a strong research and publishing background but an unaccomplished postdoc relatively. I have TA'd several different courses throughout my career but no lecture experience. Would I be considered for this position if I applied? How would I ask my current PI if he would support this move as well?",
        "created_utc": 1674792688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pass/Fail before grad school",
        "author": "cw044",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10m6196/passfail_before_grad_school/",
        "text": "I'm a second semester senior and I've already submitted all my grad school applications (MS Environmental Science). I'm taking in Calc 2 this semester and it would be a huge load off my shoulders if I took it Pass/Fail. It would also mean I have more time to work on my senior thesis. I know I'm going to get admissions decisions before they get my final transcript, but is it likely I would have to take remedial Calc 2 if I take it P/F this semester?",
        "created_utc": 1674776026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Political Science/Public Policy Research Journals - Your Thoughts?",
        "author": "Cultural-Newt9673",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10m3bh1/political_sciencepublic_policy_research_journals/",
        "text": "Does anyone know of any political science/public policy research journals where high schoolers can publish their work? There do seem to be a few general high school journals but are there any other ones I can look into - preferably of a higher level that has published highschool work? My research was done at the university level under mentorship and of the corresponding caliber.",
        "created_utc": 1674769171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have this book? Economics 11th edition by Michael Parkin",
        "author": "Mysterious-Appeal246",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10lx386/does_anyone_have_this_book_economics_11th_edition/",
        "text": "[removed]",
        "created_utc": 1674753584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions to the research/academia field...Undergrad/Biochemistry major/ USA",
        "author": "tstross",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10lwnp7/questions_to_the_researchacademia/",
        "text": "Hi, I am currently and undergrad student and was wondering about a few questions from those way higher than me.\n\nI am deeply \"passionate\" and interested in the field of science &amp; research, specifically medical science and neuroscience. My current major is biochemistry, and I plan to minor in neuroscience. \n\nI am deeply divided between the \"chase passion or chase money\" dilemma. I absolutely love everything I've seen/done in the lab now, but I'm aware (correct me if I'm wrong) that the pay can be quite miserable.\n\nSo my question to those who are in this field: do you enjoy what you do? Is your pay decent? Would you rather have done a different path in a high-paying field? Is it worth the debt/time to get where you are?\n\nAlso, as far as a major goes, would it be wise to dual major in a high-demand field, such as software engineering/computer science? I certainly want to do what I love, but at what cost...\n\nWhat about the pharmaceutical industry?\n\nThank you.",
        "created_utc": 1674752492,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find a romantic partner while in academia?",
        "author": "procellosus",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10lwk8p/how_do_you_find_a_romantic_partner_while_in/",
        "text": "I want to become a professor after getting my PhD, which means I'll probably need to move quite a bit from where I am now, not to mention moving around for postdocs. I'm currently single but I'd like to change that, and I'm looking for a long-term thing, so it's going to be relevant, though I've got some time between now and then (actually getting my PhD, for one…) \n\nHow do you find someone willing to move (potentially internationally) with you? When do I bring it up? Should I put something in my profile on dating apps? Does it not really matter until I start actually applying for positions?",
        "created_utc": 1674752281,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really messed up my grades in community college, but now I want to go back. Need advice from graduates on how to save what I have.",
        "author": "tornbonobo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ltbvc/i_really_messed_up_my_grades_in_community_college/",
        "text": "[removed]",
        "created_utc": 1674744116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Archive research in Germany + permits",
        "author": "Status_Tradition6594",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10low0j/archive_research_in_germany_permits/",
        "text": "I’m a history PhD (Australian, so have relevant passport) planning on accessing archives in Germany mid year for approx 3 weeks. I am a bit confused about the requirements for researchers, and the “visa for research”. Is that relevant for me? I would not be with any particular research institute, and the way the visa for research is structured makes it sound like it’s relevant to work and not for short term “going to look at archives” type situations. Is this correct? (This may be a silly question, but I am triple checking because the other place I am doing fieldwork in is Indonesia which DOES need a research permit for any work, so as you can imagine my mind is fried navigating logistics between both of these places)",
        "created_utc": 1674729226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does a circle and square of same length have different area? We can prove this mathematically but is it true practically and if yes pls explain how? Because when circle is made into square its like pushed inside however area should remain the same ryt?",
        "author": "CreativeBread9404",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10loekn/why_does_a_circle_and_square_of_same_length_have/",
        "text": "Sorry for the silly question. Just curious",
        "created_utc": 1674727138,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have only a part of some PhD thesis written in French and the name of its author. How could I find the whole thesis online and/or the corresponding article [details below]. Thanks!",
        "author": "viii_chemsey",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10lnwi0/i_have_only_a_part_of_some_phd_thesis_written_in/",
        "text": "Author: Gilles Millerioux\nChapter 1: Feuilletage du plan de phase des transformations non inversibles bidimensionelles\nChapter 2: Bifurcations des ensembles invariants \nChapter 3: Bifurcations des bassins spécifiques aux transformations non inversibles.",
        "created_utc": 1674724806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal for journal’s “experts” making reject decision based on comments that are clearly wrong and imply that “experts” didn’t even understand the work?",
        "author": "KrisssWu",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10lm5h4/is_it_normal_for_journals_experts_making_reject/",
        "text": "I mean at least give some correct/useful/ technical comments that I can use to improve my work. What’s with this?",
        "created_utc": 1674717128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tracking / productivity software recommendations for academic journal editors?",
        "author": "Edhalare",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10llwsl/tracking_productivity_software_recommendations/",
        "text": "Hi everyone,\n\nI recently started working as a co-editor of a smaller academic journal. Always though I was good with deadlines and such but turns out I was wrong; I am struggling immensely with keeping track of the production cycle.We don't use any special software outside of a couple of spreadsheets, and the solution I'm looking for is for me personally, not for the whole journal ecosystem.\n\nI have to keep track of deadlines on a rolling basis, in an environment that will ideally allow me to lay out the timeline of each paper I am working on visually, add notes, and mark tasks as completed or in progress. It also need to sync to my Google calendar (if it's not on the Calendar, it doesn't exist in my world, there are just too many things going on).\n\nSo I am looking for a technological solution that can:\n\n\\- help me visualize the timeline of my work tasks\n\n\\- allow adding notes (not just keep track of dates)\n\n\\- allow marking tasks as completed\n\n\\- syncs to Google calendar\n\nI'm willing to pay for the software (within reason), and if it has a mobile version, that's even better.\n\nDoes anyone have any suggestions or recommendations? Alternatively, what's your system of dealing with such situations?",
        "created_utc": 1674716193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I continue my PhD?",
        "author": "Stray_Shantay",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ljr9n/should_i_continue_my_phd/",
        "text": "A little bit of context: I am an international student. My best friend and I were accepted in the same program, so we have been classmates since the beginning. We finished our coursework, but last semester we had an issue with some Professor. According to her, we could work together in our homework and share information as long as we submit each other an individual answer. So, of course we worked together and each of us send the answer with our own words. However, she accused us of cheating, well, that my best friend copied my homework. I tried to explain it was not the case and she finished the subject saying that she just wanted the best for me because she saw my potential and that she was thinking of letting this know to the Department, but that she preferred to talk to me instead. Time moves forward and then, we had to make  a presentation, we followed the instructions from the Syllabus, and she said we did not complete the assignment as it was intended, that she was disappointed and that something like this never occurred to her before. Until then, I was a little bit pissed off, but nothing else. However, last week, someone from the university I have my bachelor from (back in my home country), told me that my university in the U.S. sent a letter to my university in home country asking them to inform their students that they will not be receiving any more applications from them because they had the worst experience ever with us, that we cheated and stuff like that. So I am out of my mind right now, I feel that how they managed things was so unprofessional and that they could at least try to talk with us before doing something like that. But I am also worried that they might leave us without our stipend, do not let us teach or create difficulties for us to do our research (maybe nobody will want to be our advisor because they will think we are not good students and “cheaters”). Because of it, I was wondering if I should keep studying at this university? Or if it would be better to try to transfer to another one? Besides possible trouble with the people in my Department, I am worried that once I am in the job market, they give bad references of me and nobody will try to hire me. Is this possible? I am even considering going back to my home country. Sorry for the long text.",
        "created_utc": 1674708454,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often do grad students get expelled or dismissed if they admit guilt and show true remorse during their Academic Integrity hearing?",
        "author": "TopParsnip6488",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10lil3b/how_often_do_grad_students_get_expelled_or/",
        "text": ".",
        "created_utc": 1674704683,
        "upvote_ratio": 1.0
    }
]