[
    {
        "title": "How were the children of the Hitler youth “denazified”?",
        "author": "Xeluc",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9hb0r4/how_were_the_children_of_the_hitler_youth/",
        "text": "With all the kids and youth having spent their lives being brainwashed with Nazi propaganda, was it difficult to denazify them? How was it done?\n\nAny occurrences of these young nazis trying to reinforce nazism? ",
        "created_utc": 1537406612,
        "upvote_ratio": ""
    },
    {
        "title": "“Moral economy” - other similar concepts that understand the culture, norms and obligations in a certain context outside of traditional economic transactions?",
        "author": "mountainmover234",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ha830/moral_economy_other_similar_concepts_that/",
        "text": "Hello ! I am interested in learning more on economic anthropology and frequently come across the term “moral economy”. One of these studies defines this as “'Moral economy' might be defined as a kind of inquiry focussing on how economic activities of all kinds are influenced and structured by moral dispositions, values and norms, and how in turn these are reinforced, shaped, compromised or overridden by economic pressures”\n\nI’m interested to hear about terms similar to the this concept. However, I am looking for alternative phrases or terms to moral economy. I feel that analyzing a context with this phrasing sounds slightly judgmental.  \n\nI know this is very vague, partly due to my confusion on how anthropologists understand the differences underlying the behavior and actions of individuals within a society. \n\nFor example, why do some societies seem to operate at an individualistic level versus other that seem to be more collective? How do you explain and compare these differences? How can you better understand the factors that lead a society to be more individualistic versus collective? \n",
        "created_utc": 1537400015,
        "upvote_ratio": ""
    },
    {
        "title": "How has the field of anthropology changed?",
        "author": "staplerx300",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9h9h5f/how_has_the_field_of_anthropology_changed/",
        "text": "For all the people here who have been on campus studying or teaching in the last few years, have you had any experiences with professors or heads of departments pushing certain conclusions? How much academic freedom is there at your institution?\n\nI left early in about 2013 and didn't finish my anthropology degree, so I'm curious how things have changed.",
        "created_utc": 1537394086,
        "upvote_ratio": ""
    },
    {
        "title": "Empathy in Men",
        "author": "Singularis_Lupus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9h3bps/empathy_in_men/",
        "text": "This thought just popped up in my mind, but do you guys think that maybe men have become sociologically and maybe even genetically less empathic due to their role in society( i am talking about the 199900 years Homo Sapiens have lived without machines that drastically changed roles in society). This is not a verified theory, just a thought of mine.\nEmpathy could be an obstacle in war and hunting, it could create hesitation which would result in death or injury. Which would result in a natural selection of a gene which creates less empathy if there is such a thing, or more likely a social trend that would have a much bigger effect.\n\nWhat are your thoughts on this ?",
        "created_utc": 1537345243,
        "upvote_ratio": ""
    },
    {
        "title": "Why people think western people 'have no culture'",
        "author": "gorge_r9k",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9h285u/why_people_think_western_people_have_no_culture/",
        "text": "Do you think its because we are forced by society to ignore the fact that the modern culture that the whole world is attempting to adopt is a product of the west and no other like it? If we are forced to believe that its not inherently 'ours' then we will have no reason to have a sense of superiority that would come from seeing everyone else wanting to adopt our culture?\n\nI would say this modern culture which is from the west is a culture based on democracy, rule of law and where science is placed above all other things including tradition. No other culture in the world held these tenets before globalization.",
        "created_utc": 1537332647,
        "upvote_ratio": ""
    },
    {
        "title": "The Gift by Marcel Mauss",
        "author": "kpm99",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9h0wt1/the_gift_by_marcel_mauss/",
        "text": "I hope this doesn't constitute as homework help, but I read this book for my Sociocultural Anthropology class and I'm a little confused about some of the details. I wanted to discuss it with other people who understand the subject. I'm probably going to have a test or essay at some point and I want to be sure about what I'm reading.\n\n\nedit: got the help I needed \n",
        "created_utc": 1537321077,
        "upvote_ratio": ""
    },
    {
        "title": "Why getting your hair cutt by an enemy is associated with great shame?",
        "author": "AMugofCoffee",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gyovh/why_getting_your_hair_cutt_by_an_enemy_is/",
        "text": "Latley I have noticed that pre islamic arabian tribes, native american and japanese tribal societies associate getting your hair cut by an enemy with great shame and am wondering why is that a thing?",
        "created_utc": 1537304120,
        "upvote_ratio": ""
    },
    {
        "title": "Help me prepare this syllabus - https://www.civilserviceindia.com/subject/Anthropology/main-syllabus.html",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gxlgl/help_me_prepare_this_syllabus/",
        "text": "[deleted]",
        "created_utc": 1537296571,
        "upvote_ratio": ""
    },
    {
        "title": "Why are our sinuses so bad? Do other animals (e.g. apes) have sinus problems at a similar frequency to humans?",
        "author": "nikuk_nukakiwaa",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gw3gn/why_are_our_sinuses_so_bad_do_other_animals_eg/",
        "text": "Having been bedridden for the past four days with cold and resulting sinus problems, I've had time to think about the fact that *everyone* I know has had some kind of sinus issue at some point in their life, and a significant portion have a chronic sinus problem that regularly impedes on their day-to-day functioning. I've also taken up nasal irrigation and I hear that it works for pretty much anybody, so all that's made me wonder - is it just human sinuses that are this bad? Why did they evolve this way, and what did they evolve for?",
        "created_utc": 1537286414,
        "upvote_ratio": ""
    },
    {
        "title": "I want to leave something useful for Anthropologists in the year 3,000.",
        "author": "Biks",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gw0fz/i_want_to_leave_something_useful_for/",
        "text": "What kind of message/observation from the past would be the most helpful or interesting? What methods should I be using? Videos? Write a book? Chisel it on a rock?",
        "created_utc": 1537285849,
        "upvote_ratio": ""
    },
    {
        "title": "Y haplogroup and linguistic correlation",
        "author": "kesascarfman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gvzlw/y_haplogroup_and_linguistic_correlation/",
        "text": "I do t know if this subreddit is the right place to ask. Is haplogroup partially correlate d with language family.\n\nIf not what are some source for linguistics diffusion?\n\nIf so are r1b related to spread of Proto Indo European or early Stone age farmer?",
        "created_utc": 1537285677,
        "upvote_ratio": ""
    },
    {
        "title": "Sources for Early Iron Age in the Mediterranean",
        "author": "mario_eco",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gvnpv/sources_for_early_iron_age_in_the_mediterranean/",
        "text": "I'm looking for books, articles, anything dealing with the aftermath of the Bronze Age collapse, and the first two centuries that followed (around 10th-8th c. BCE). I'm particularly keen on society and social structure, human life, and religion. What would you recommend me? Thanks!",
        "created_utc": 1537283385,
        "upvote_ratio": ""
    },
    {
        "title": "Databook through history for agricultural productivity, living standards etc.",
        "author": "redditrasalghul",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gvif0/databook_through_history_for_agricultural/",
        "text": "Hi, \n\nI am looking for a source that provides data for agricultural productivity through history, let's say in Anatolia or Italy during Ancient, Roman, Islamic ages. And the same thing for average age, population, living standards as well.\n\nIs there such a source? If not, can you at least lead me in the right direction?\n\nI know the book \"why the west\" by Ian Morris has \"energy capture\" figure, but I am also looking for the elements above.\n\nThanks in advance.",
        "created_utc": 1537282394,
        "upvote_ratio": ""
    },
    {
        "title": "Some of the posts/questions on here are real cringy. Any way we can update the rules to highlight the importance of informed and specific posts?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9grmxx/some_of_the_postsquestions_on_here_are_real/",
        "text": "[deleted]",
        "created_utc": 1537244681,
        "upvote_ratio": ""
    },
    {
        "title": "What did/do indigenous people from around the world think the shape of the Earth is?",
        "author": "MumblingFish",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gohhw/what_diddo_indigenous_people_from_around_the/",
        "text": "",
        "created_utc": 1537219590,
        "upvote_ratio": ""
    },
    {
        "title": "Modern humans?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gnlva/modern_humans/",
        "text": "[deleted]",
        "created_utc": 1537213532,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice in pursuing a masters/PhD?",
        "author": "HYUCCINSON",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gnfxe/looking_for_advice_in_pursuing_a_mastersphd/",
        "text": "Has anyone here received a degree in any subgroup of anthropology? What was your experience like? Did your field require you to study in other fields or subjects? I’m interested in hearing your story and any advice, tips, or pointers you can give for an undergrad looking to dive into anthropology full time ",
        "created_utc": 1537212405,
        "upvote_ratio": ""
    },
    {
        "title": "Ethnicity &amp; ability (causality)",
        "author": "lazebwudder",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gkg7z/ethnicity_ability_causality/",
        "text": "[I'm not sure if this is the right place to ask this and i rly hope no one thinks im racist cos this is a legit thought/question i have]\n\nHi! I'm a history student (from singapore) and in my notes, I've always seen how govts view certain ethnic grps eg Chinese and Indians as threats due to their perceived dominance in the economy. I'm rather puzzled by this as im not sure if ur ethnicity/culture plays a part in ur ability. Well, many ppl puts it off as mere stereotypes esp with the entertainment industry always portraying Asians as supposedly the smart ones.\n\nHence, i rly wanna know if theres any link...perhaps in terms of cultural beliefs that could be linked to say...religion too (im not into \"oh its just natural\" There shld be reasons for it) Or isit just a stereotype so deep that it becomes too hard to unravel? And im also interested in knowing any examples of such \"beliefs\" other than the usual ones we see and how has it affected ur society? Thks!",
        "created_utc": 1537192080,
        "upvote_ratio": ""
    },
    {
        "title": "Why does a traditional society end up with more men?",
        "author": "the-other-otter",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gk8bp/why_does_a_traditional_society_end_up_with_more/",
        "text": "There was a discussion either here or on Anthropology about polygyny and it was mentioned that it had been seen two men married to one woman in the Amazonas in a period when there were around 140 men to 100 women in the area. I understand why there are more men than women in our modern world, but why would there be more men than women in a traditional society were the premature babies don't grow up and the women don't smoke? Did so many women die in child birth, or was it a case of not giving the girl children quite as good nutrition as the boy children?",
        "created_utc": 1537190256,
        "upvote_ratio": ""
    },
    {
        "title": "Scholarly texts on Mobile phones and how humans behave around them?",
        "author": "gimiliismylover",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ggtzc/scholarly_texts_on_mobile_phones_and_how_humans/",
        "text": "Hey everyone. I have an assignment where I pick an object and have to discuss how people behave around it, using my own observations and other scholarly sources. Is mobile phones a good one to do, if not, do you have any other suggestions? Also if you have any links to scholarly sources on how people behave around/when using mobile phones that would be much appreciated :) ",
        "created_utc": 1537154171,
        "upvote_ratio": ""
    },
    {
        "title": "The Fashionable Body image-based survey - male participants needed (40-60 years of age)",
        "author": "femalebody88",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9gd7oi/the_fashionable_body_imagebased_survey_male/",
        "text": "[removed]",
        "created_utc": 1537124960,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find references of all ethnicities/races ?",
        "author": "oohara",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9g9ugd/where_can_i_find_references_of_all/",
        "text": "Hi, I'm trying to do a project, where I draw pictures of people from every country of the world. I tried searching on google with keywords from ethnicity world maps I found, but I can't be sure if google shows me exactly what I wanted. For example If I search for a mongolian guy, it might show me a chinese dude, and I won't know the difference, as I'm not an expert in the field. (that's one of the reasons I'm doing this project, to learn the diffences, to make my drawings more life-like)\n\nSo.. Is there a reliable database or something with people by country images in it? Or some trick on google that I can use to find only what I want ?",
        "created_utc": 1537096983,
        "upvote_ratio": ""
    },
    {
        "title": "If you could get a snapshot of human culture at a single period of time, which century would you choose?",
        "author": "gorge_r9k",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9g8y97/if_you_could_get_a_snapshot_of_human_culture_at_a/",
        "text": "I think I would choose 30,000 years ago. ",
        "created_utc": 1537084558,
        "upvote_ratio": ""
    },
    {
        "title": "What evidence of homosexuality is there in early societies?",
        "author": "Tinypenguin29",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9g6vqn/what_evidence_of_homosexuality_is_there_in_early/",
        "text": "",
        "created_utc": 1537062026,
        "upvote_ratio": ""
    },
    {
        "title": "Are there texts that document how Hunter Gatherer peoples view agricultural/civilizational peoples and our way of life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9g4d64/are_there_texts_that_document_how_hunter_gatherer/",
        "text": "[deleted]",
        "created_utc": 1537040837,
        "upvote_ratio": ""
    },
    {
        "title": "The Fashionable Body image-based survey - male participants needed (40-60 years of age)",
        "author": "femalebody88",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9g1y7y/the_fashionable_body_imagebased_survey_male/",
        "text": "[removed]",
        "created_utc": 1537022358,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any explanations/theories for modern sexual fetishes such as cuckoldry? Any articles about it?",
        "author": "BenjaminDalt0n",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9g17qi/are_there_any_explanationstheories_for_modern/",
        "text": "",
        "created_utc": 1537015777,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best (short) description of modern biological anthropology?",
        "author": "humanbrian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fx0fi/what_is_the_best_short_description_of_modern/",
        "text": "There is a common perception that biological anthropology is just about the study of fossils, non-human primates, genes, or skeletal remains. In my experience these subjects are *part* of what biological anthropologists work on, but that the field is broader than this. So what kind of general subjects and themes do you think should be added to the standard list of what biological anthropologists are working on? Serious answers would be appreciated.",
        "created_utc": 1536968806,
        "upvote_ratio": ""
    },
    {
        "title": "Where Nomadic People more egalitarians compared to settled agricultural ones?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fv1nu/where_nomadic_people_more_egalitarians_compared/",
        "text": "",
        "created_utc": 1536953501,
        "upvote_ratio": ""
    },
    {
        "title": "Why were mountain tops sacred to so many ancient cultures, in the Near East especially?",
        "author": "just_the_mann",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fo2e4/why_were_mountain_tops_sacred_to_so_many_ancient/",
        "text": "",
        "created_utc": 1536890334,
        "upvote_ratio": ""
    },
    {
        "title": "Are ancient erotic cave paintings and carvings porn?",
        "author": "thapopjackson",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fo06h/are_ancient_erotic_cave_paintings_and_carvings/",
        "text": "",
        "created_utc": 1536889818,
        "upvote_ratio": ""
    },
    {
        "title": "What is an Ethnographic Background?",
        "author": "Milla_Shadowhelm",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fn6ee/what_is_an_ethnographic_background/",
        "text": "I am supposed to be writing a paper for Anthropology and it asks for an Ethnographic background. What exactly is this?\n\nEdit: thank you! I figured it out and I got a good grade on it. :)",
        "created_utc": 1536882947,
        "upvote_ratio": ""
    },
    {
        "title": "Term for the kind of tools that haven't significantly changed over history",
        "author": "eridanired123",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fmffi/term_for_the_kind_of_tools_that_havent/",
        "text": "These kind of items first uses usually date from humanity's early days, haven't changed much in form or function across the times and are still widely used.\n\n\nSpoons or needles are the kind of items that the term can be used on. And may be used in this way:\n\n\n    \"Needles are an example of a _______ tool\"\n\n\nNote: *If I recall correctly, the age of the item isn't the point, and the unchanging characteristic of the objects (or little change across large periods) is far more important in the definition of this word; one can even be very adventurous and say that email, spoons and needles all could belong to this type of tools (You know how everyone have wanted to change or kill email but couldn't).*\n\n*Like spoons that have preserved its basic shape and function for milennia even if they are ergonomic now and the materials they are built with aren't the rocks in your yard any more.*\n\n\n\nI heard the word in a history of art lesson more than a decade ago so my definition may be a bit off... Also the part about the email is mine; needles and spoons however were examples given by the professor at that time.\n\n\nI've asked at [Stackexchange](https://english.stackexchange.com/questions/464218/term-for-the-kind-of-tools-that-havent-significantly-changed-over-history) too and the community over there have given me some replacements for the word I can't remember like **\"primitive\"** or **\"ur-tool\"**. But those words even if usable aren't the specific term I'm looking for, hopefully you guys can lend me your help too, I would really appreciate it.",
        "created_utc": 1536876969,
        "upvote_ratio": ""
    },
    {
        "title": "When did humans first reliably cultivate fire?",
        "author": "MonsenorTickles",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fi0wl/when_did_humans_first_reliably_cultivate_fire/",
        "text": "Something I was thinking about not to long ago was the importance of fire for early man. Obviously humans have known how to make fire for some time, but most ancient methods seem slow and/or inefficient. My question is, when did it become possible for any given human to reliably start a fire at any given camp, and what tools allowed this? ",
        "created_utc": 1536845681,
        "upvote_ratio": ""
    },
    {
        "title": "How much would the innovation of rock-chipping associated with the Mushabian culture have improved people's lives, qualitatively speaking? Does improving basic Paleolithic tech make a huge difference?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fhvbs/how_much_would_the_innovation_of_rockchipping/",
        "text": "",
        "created_utc": 1536844460,
        "upvote_ratio": ""
    },
    {
        "title": "Was human society historically matriarchal? With priestesses and Mother Earth worship the status quo?",
        "author": "Thebadgamer98",
        "url": "https://www.reddit.com/r/AskHistorians/comments/9feae4/my_humanities_teacher_claims_that_in_prehistory/",
        "text": "",
        "created_utc": 1536820196,
        "upvote_ratio": ""
    },
    {
        "title": "What do you imagine first contact between Sumer and Egypt would have been like?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9fae0i/what_do_you_imagine_first_contact_between_sumer/",
        "text": "Do we have any evidence that might provide the scantest clue on what it would have been like for the first civilization in the world to realize it wasn't, in fact, alone? (\"Alone\" in the sense of being a superpower?)\n\nWe can't know for sure, unless there is some stone-etched record and we've absolutely lucked out. But what does your knowledge as an anthropologist (or someone who studies the subject) suggest to you?",
        "created_utc": 1536777332,
        "upvote_ratio": ""
    },
    {
        "title": "What anthropology books would you recommend to a layman that are basically a short auto-biography of an anthropologist living abroad?",
        "author": "Iskandar11",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9f9342/what_anthropology_books_would_you_recommend_to_a/",
        "text": "I'm not sure what you would call that. ",
        "created_utc": 1536768386,
        "upvote_ratio": ""
    },
    {
        "title": "Come join the LIVE conversation with Anthropologist Louise Barrett (TODAY at 12PM)",
        "author": "iloveescience",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9f92nk/come_join_the_live_conversation_with/",
        "text": "[https://www.youtube.com/watch?v=PKvy40xLU14](https://www.youtube.com/watch?v=PKvy40xLU14)",
        "created_utc": 1536768316,
        "upvote_ratio": ""
    },
    {
        "title": "What anthropology books would you recommend to a layman?",
        "author": "Iskandar11",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9f7y2i/what_anthropology_books_would_you_recommend_to_a/",
        "text": "",
        "created_utc": 1536760390,
        "upvote_ratio": ""
    },
    {
        "title": "Pottery is fucking boring. How do I trick my brain into approaching it differently so I can (1) learn more about ancient people from studying it and (2) appreciate the role and significance of pottery in human life in a new way?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9f6spt/pottery_is_fucking_boring_how_do_i_trick_my_brain/",
        "text": "From what I can tell, a lot of archaeology is devoted to analyzing shards of things that used to be pots made out of clay. Whole cultures seem to be named about the type of pottery they left behind, as it's some of the only evidence that characterizes them. Your average person is going to compare pottery to temples, architecture, weapons, myths, even things like ancient agriculture or foraging or road-making, and find it to be pretty damn monotonous. It's just shards of clay in the ground, and when the pottery is reconstructed, it's not very visually striking a lot of the time either. It's hard to appreciate what pottery did for people besides providing replacements for baskets or liquid skins.\n\nHow do you view pottery differently so you can really get a taste of what it meant for people at the time? Lindybeige has done that for me when it comes to other things like [cloaks](https://www.youtube.com/watch?v=yN8cYd3poIk) and [brooches](https://www.youtube.com/watch?v=XFKiTrBMGGE). It's all about perspective and making connections with what we find meaningful in life, even if the artifact seems to be boring. Can you do that when it comes to clay pots?",
        "created_utc": 1536750920,
        "upvote_ratio": ""
    },
    {
        "title": "What's the current consensus on the Indus Script?",
        "author": "fieldcady",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9f27f7/whats_the_current_consensus_on_the_indus_script/",
        "text": "I've been reading about the Indus script.  Most of what I am seeing takes the position that it's a written language but \\[this paper\\]([https://pdfs.semanticscholar.org/419f/d9cefad84cb597af3396828106e4fbf48da6.pdf](https://pdfs.semanticscholar.org/419f/d9cefad84cb597af3396828106e4fbf48da6.pdf)) makes a strong argument that it isn't based on the brevity of inscriptions and the rarity of repeated signs within a given inscription.\n\nWhat is the current scholarly consensus?  I ask partly because I have a math research background that would lend itself to statistical investigations of the script, and I'm strongly considering getting into it if it looks like it's truly language.\n\nThanks!",
        "created_utc": 1536706275,
        "upvote_ratio": ""
    },
    {
        "title": "Enthography suggestions!",
        "author": "whatwayy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9f094r/enthography_suggestions/",
        "text": "I am having an operation on my ribs leaving me immobile for quite sometime. I am looking for suggestions on ethnographic/anthropologic books regarding Oceania, or anywhere! Thanks folks!",
        "created_utc": 1536691748,
        "upvote_ratio": ""
    },
    {
        "title": "Hey, pretty simple question: if I wanna study anthropology, just as a hobby, where do I start?",
        "author": "CyniKay",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ez9ko/hey_pretty_simple_question_if_i_wanna_study/",
        "text": "Any recommendations on books, resources, etc?\nI wanna get into all the good stuff! Linguistics, culture, civilizations of the past, all of it!",
        "created_utc": 1536684666,
        "upvote_ratio": ""
    },
    {
        "title": "Did the Mayans likely have a distinction between temple religion (official gods) and vernacular or common religion (especially fertility deities worshiped in the home as distinct from the city gods) as was common in the Old World?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9exyw3/did_the_mayans_likely_have_a_distinction_between/",
        "text": "",
        "created_utc": 1536675634,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any book out there that just picks an ancient city and goes straight into an evidence-constrained speculative account of EVERYTHING that might have gone on there?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ex8c3/is_there_any_book_out_there_that_just_picks_an/",
        "text": "I know this has to involve a lot of speculation, but I'd really like to see any city--be it Egyptian, Sumerian, Babylonian, Greek, Indian, Chinese, whatever--given a full multi-perspective tour with colorful pictures but very detailed logistical information. What were the responsibilities of the priest caste? What did people wear? Where were the shops? What were the major taboos? How did commoners greet each other on the street? What did people use to carry items of importance from place to place? Where did the military train? What weapons were made, and where were they forged? Where did the caravans come from?\n\nI want to actually get a well-rounded look at all the technology, the whole society, different walks of life, different motivations, different religious ideas, everything. There probably are a couple of really exhaustive but accessible books that attempt this, right? Have you found any?\n\n(To be clear: I mean everything that went on there *at a given moment*, not everything that *ever* went on there.)",
        "created_utc": 1536670007,
        "upvote_ratio": ""
    },
    {
        "title": "What evidence do we have for gender division of labor in Neolithic societies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ewdic/what_evidence_do_we_have_for_gender_division_of/",
        "text": "[deleted]",
        "created_utc": 1536662209,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know what documentary this childbirth clip is from?",
        "author": "nexusoflife",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9etkxd/does_anyone_know_what_documentary_this_childbirth/",
        "text": "[https://www.youtube.com/watch?v=IR1XkWsSQic](https://www.youtube.com/watch?v=IR1XkWsSQic)",
        "created_utc": 1536633326,
        "upvote_ratio": ""
    },
    {
        "title": "How did Buddhists, who have historically treated all life well, react to mosquitoes after it was learned they carry life threatening diseases?",
        "author": "nsjersey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9eqkbp/how_did_buddhists_who_have_historically_treated/",
        "text": "Even the Dali Lama [is on record](https://www.youtube.com/watch?v=W083nSzx1Rc) saying that they can be killed after too many occurrences\n\n&amp;#x200B;\n\nEDIT: Formatting ",
        "created_utc": 1536609842,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a Lévi-Strauss' lecture transcript",
        "author": "Gecatto",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9eq4uw/looking_for_a_lévistrauss_lecture_transcript/",
        "text": "Watching a lecture from David Graeber, P. Descola brings the topic of the relationship between critical thought and anthropology. Regarding that, he refers a lecture given by Claude Lévi-Strauss in 1938 to a think tank of the CGT, in which he argued that anthropology is a revolutionary science because it provides with a gaze from afar and allows us to  see our own institutions from a distance and thus to be able to extract ourselves from the immediacy of these institutions.\n\nI was curious about this particular lecture from L-S so I've been looking for a transcript, but I have found none. Does anyone know where I could find it? I'd prefer an English version, but I could try to read it in French.\n\n[Link to recording of the lecture (College de France, 22nd of March 2018) - Reference starts roughly at 1:05:10](https://www.youtube.com/watch?v=o-WWw1wydwI)",
        "created_utc": 1536606945,
        "upvote_ratio": ""
    },
    {
        "title": "Literature about non-physical/dualist explanations of physical phenomena?",
        "author": "BerenCy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9emqvj/literature_about_nonphysicaldualist_explanations/",
        "text": "During our history, we tended to give non-physical/dualist explanations of physical phenomena (a god that causes the rains, spirits of alchemy, vitalism, maybe souls). Is there any empirical or philosophical research that talks about these tendencies? I am curious why we are so inclined to give non-physical/dualist accounts for phenomena that we cannot, at that time, give any other causally and explanatory complete account. ",
        "created_utc": 1536583176,
        "upvote_ratio": ""
    },
    {
        "title": "Why are pretty much all societies patriarchal? Are there any successful egalitarian societies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ehswz/why_are_pretty_much_all_societies_patriarchal_are/",
        "text": "[deleted]",
        "created_utc": 1536537667,
        "upvote_ratio": ""
    },
    {
        "title": "What role do Kiwis the bird play in New Zealand culture?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9egok8/what_role_do_kiwis_the_bird_play_in_new_zealand/",
        "text": "",
        "created_utc": 1536528493,
        "upvote_ratio": ""
    },
    {
        "title": "Why did witchcraft seemingly remain more of a feature of modern daily life in Eastern Europe and the Near East as compared to Western Europe?",
        "author": "Dickpics_please_thnx",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9efahv/why_did_witchcraft_seemingly_remain_more_of_a/",
        "text": "In my conversations with my fiance, who is a Turkish PhD student here in the US, I am always amazed by how he has strong beliefs in the power of pagan witches. He explains that these beliefs are common and a part of everyday life in Turkey.\n\nI also have seen a few documentaries on Eastern European witchcraft, whose traditions are well and alive in areas such as Romania and Bulgaria.\n\nI know shamanism and witchcraft are a big part of daily life around the world (or so it would seem from my limited experience). But it seems odd that Eastern and Western Europe would have such different modern folklore related to witchcraft/shamanism when they were exposed to Christianity around the same time and have closely linked histories.\n\nThese questions came to a head last night when we watched Hereditary. To me it showed the type of witchcraft I'd expect to see in Eastern Europe (using idols, female driven, casting spells behind the scenes, etc.), and made me realize that the same types of traditions do have a history in the West.\n\nSo is it a function of education and wealth?If so, when did the West turn more fully away from witchcraft?\n\nOr was Catholicism more effective in matriculating pagan ritual/demonizing witchcraft than the Eastern Orthodox Church and Islam?",
        "created_utc": 1536518229,
        "upvote_ratio": ""
    },
    {
        "title": "How is it that humans have been able to interact with so intimately with chimps and gorillas in the wild?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9eet9b/how_is_it_that_humans_have_been_able_to_interact/",
        "text": "[deleted]",
        "created_utc": 1536514565,
        "upvote_ratio": ""
    },
    {
        "title": "Why did the Sumerians believe the afterlife sucked for everyone? Isn't that just depressing?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ed7gs/why_did_the_sumerians_believe_the_afterlife/",
        "text": "The only thing I can think of is that the idea of a sucky afterlife encouraged the Sumerians to make the most of the time they had while they were still alive, which in turn encouraged them to be productive members of society, reinforcing the belief. But are there any solid hypotheses from experts on this matter? Or does anyone who knows a lot about the period or religious theory have a good lead?\n\nAccording to Wikipedia, there were some ways to potentially make the afterlife a bit better (pouring drinks out for dead family members/having a high social status in life), but the impression I get is that it basically sucked all around. That's why it's fascinating.\n\n&amp;#x200B;\n\nInterestingly, a look at the article about the Greek underworld seems to suggest some similarly bleak ideas:\n\n&gt;In the Greek underworld, the souls of the dead still existed but they are insubstantial and they flitted around the underworld with no sense of purpose.  \n&gt;  \n&gt;...  \n&gt;  \n&gt;The idea of progress did not exist in the Greek Underworld – at the moment of death, the [psyche](https://en.wikipedia.org/wiki/Psyche_(psychology)) was frozen, in experience and appearance. The souls in the Underworld did not age or really change in any sense. They did not lead any sort of active life in the Underworld – they were exactly the same as they were in life.[\\[50\\]](https://en.wikipedia.org/wiki/Greek_underworld#cite_note-alb-50) Therefore, those who had died in battle were eternally blood-spattered in the underworld and those who had died peacefully were able to remain that way.[\\[51\\]](https://en.wikipedia.org/wiki/Greek_underworld#cite_note-51)  \n&gt;  \n&gt;Overall the Greek dead were considered to be irritable and unpleasant, but not dangerous or malevolent.  \n&gt;  \n&gt;...  \n&gt;  \n&gt;The Greeks accepted the existence of the soul after death, but saw this afterlife as meaningless.[\\[57\\]](https://en.wikipedia.org/wiki/Greek_underworld#cite_note-57) In the underworld, the identity of a dead person still existed, but it had no strength or true influence. Rather, the continuation of the existence of the soul in the Underworld was considered a remembrance of the fact that the dead person had existed, yet while the soul still existed, it was inactive.[\\[58\\]](https://en.wikipedia.org/wiki/Greek_underworld#cite_note-58)However, the price of death was considered a great one. Homer believed that the best possible existence for humans was to never be born at all, or die soon after birth, because the greatness of life could never balance the price of death.[\\[59\\]](https://en.wikipedia.org/wiki/Greek_underworld#cite_note-59) The Greek gods only rewarded heroes who were still living; heroes that died were ignored in the afterlife\n\nSame exact problem, eh? What's going on here?",
        "created_utc": 1536502170,
        "upvote_ratio": ""
    },
    {
        "title": "Hunter gatherer conceptualization of human anatomy?",
        "author": "piezoelectron",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ebm8c/hunter_gatherer_conceptualization_of_human_anatomy/",
        "text": "I was just reading a paper by Signe Howell mentioning how the Chewong see the liver as the inner seat of fundamental human states &amp; personality traits. This got me thinking: *why the liver?* And (how) are the Chewong aware of the liver's existence and (possibly) function?\n\nI know anthropologists have always studied indigenous concepts of self, person and body, but it seems that what we find is that outside of natural science, people almost always combine metaphysics &amp; physiological/empirical evidence when talking about bodies. \n\nFor example, Unni Wikan's description of the Balinese person as the intersection of body, soul and life-force.\n\nSo my question is: is there any research that describes indigenous systems of knowledge that are very close, if not identical to, what the natural sciences may call human anatomy? What evidence backs up these concepts? (E.g. Myths, dead soldiers' cadavers, exhumed ancestral relations etc.)\n\nIn short, when a certain hunter-gatherer tribe talks about the liver, how do we know it's the liver *we* know?",
        "created_utc": 1536482662,
        "upvote_ratio": ""
    },
    {
        "title": "How many vocal accents are there in the world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ea6he/how_many_vocal_accents_are_there_in_the_world/",
        "text": "[deleted]",
        "created_utc": 1536464724,
        "upvote_ratio": ""
    },
    {
        "title": "Any recommendations for books or detailed articles on the evolution of body language?",
        "author": "turncloakforwhat",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9e87g5/any_recommendations_for_books_or_detailed/",
        "text": "I’m curious as to what things have been consistent throughout much of history (liked nodding or hugging) and what things evolved and when (ie thumbs up). I am specifically interested in universal but niche body language modes of communication like pointing your fingers at your eyes and then at someone else to indicate that you are watching them etc \nThank you! ",
        "created_utc": 1536446360,
        "upvote_ratio": ""
    },
    {
        "title": "Articles and books from non-white and scholars outside of WEIRD countries.",
        "author": "Tnznn",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9e698j/articles_and_books_from_nonwhite_and_scholars/",
        "text": "Every now and then I stumble upon an article about discrimination in academia, mainly how non-white and scholairs outside of Western countries lack visibility among other things. I must admit I could hardly name 10 contemporary social science scholars who aren't white western ones. I'm not here to discuss the reasons, implications, and why I believe it should change, others have one it better.\n\nI'm looking for some databases, journals or websites and/or specific articles/books that could expand my ressources in such a way. My main interests are the cultural industry (Pokémon mostly) , online communities and audience, emotion. Also interested in anything related to \"education studies\". \n\nI can read English and French mostly. \n\nAs for the last article that reminded me of the issue : https://activisthistory.com/2018/08/29/academic-racism-the-repression-of-marginalized-voices-in-academia/",
        "created_utc": 1536430719,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any mention that our ancestors understood the effects of interbreeding between family members within their community?",
        "author": "foxtrousers",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9e4ln1/is_there_any_mention_that_our_ancestors/",
        "text": "",
        "created_utc": 1536415895,
        "upvote_ratio": ""
    },
    {
        "title": "why does the Venus of Willendorf's head look the way it does?",
        "author": "JBredditaccount",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9e3zc4/why_does_the_venus_of_willendorfs_head_look_the/",
        "text": "[https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Venus\\_von\\_Willendorf\\_01.jpg/220px-Venus\\_von\\_Willendorf\\_01.jpg](https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Venus_von_Willendorf_01.jpg/220px-Venus_von_Willendorf_01.jpg)\n\n&amp;#x200B;\n\nIs she wearing some kind of hat? Does she deliberately have an inhuman head? Is it supposed to be hair, like in this amazing knit recreation? \n\n&amp;#x200B;\n\n[https://media.boingboing.net/wp-content/uploads/2018/04/Screen-Shot-2018-04-26-at-2.47.24-PM.png](https://media.boingboing.net/wp-content/uploads/2018/04/Screen-Shot-2018-04-26-at-2.47.24-PM.png)\n\n&amp;#x200B;\n\nI guess, what I'm asking is... I'm creating a comic book in which she appears briefly and we don't know how to draw her head. The best case scenario for us is to draw her with a face, so she can be expressive, but we'd prefer to be as faithful to the figurine as possible. We just can't figure out what her head is supposed to depict.",
        "created_utc": 1536409758,
        "upvote_ratio": ""
    },
    {
        "title": "What were some of the causes of some civilizations, like ancient Athens, to be incredibly misogynistic and others like most Native American ones?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dzb5z/what_were_some_of_the_causes_of_some/",
        "text": "[deleted]",
        "created_utc": 1536360078,
        "upvote_ratio": ""
    },
    {
        "title": "Is there reasonable evidence to suggest that people have and are expected to have more opinions now than previous generations did?",
        "author": "Jelly_Jim",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dz3ag/is_there_reasonable_evidence_to_suggest_that/",
        "text": "Not an anthropologist here, so I may not be using correct terminology or being as precise as might be expected.\n\nFor 'people', I mean those in industrialised societies with access to media and communications. 'Previous generations' could be, say, 75, 100, 150, 250 years ago; I don't have a meaningful range in mind. If a specific example helps, compare a working Briton today with ones from the Victorian and Elizabethan eras.\n\nI'm wondering if contemporary individuals are expected to have opinions on issues and events that, if they were part of previous generations, they wouldn't have an opinion on or be expected to have one. It feels like people are expected to have a ready position on whatever issues happen to be trending on social media that day, without necessarily having the opportunity to think carefully and extensively about it. Maybe it's obvious, but presumably previous generations with a narrower flow of information held fewer opinions individually? Could the number of opinions held by previous generations of individuals be quantified, then?",
        "created_utc": 1536358387,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any specific methodologies for uncovering the truly special and unique aspects of a town or region's culture, heritage or traditions?",
        "author": "TheLocalist",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dxxg8/are_there_any_specific_methodologies_for/",
        "text": "Many people tout aspects of their hometown, state, etc. as being unique; when in reality, these are merely shared aspects of the greater culture. Example. I follow a facebook group from my high school and people constantly say things like \"You might be from \\_\\_\\_\\_\\_\\_, if everyone in town knew everybody's business!\" While these people might think that was unique to them, it is clearly a common element of living in ANY small town. A truly unique part of the culture would be an oddity: \"You might be from \\_\\_\\_\\_\\_\\_, if your entire senior class dressed up like unicorns and pranked the Mr. Peabody  EVERY YEAR.\"\n\nAs a former ethnographer, in the past, I dealt with people every day who told me what they personally felt. What they wanted, liked, experienced, etc. However, I usually had to dig deeper to truly find what would suit their needs. What their underlying wants, and enjoyments were.\n\nI now volunteer with community organizations and work as a property developer.  I want to \"play to the room\". When i develop a property, I want to truly be able to speak to the community and give a true \"sense of place\" to every project I work on in their town or neighborhood.  By doing this I can celebrate their heritage, while still helping them look to the future with a sense of confidence and identity.\n\nFor instance, the townsperson might say,\"everyone knows us by our water tower. our town symbol should be that water tower.\" Further inspection shows that EVERY small town in this region has a water tower like that. What is truly unique is that, this town gets all their water from an artesian well, and actually there are vehicles lined up down the road at all hours of the day, getting water from the well. Only people from this town know about this artesian well, but it is a truly unique aspect of their environment and culture. Therefor, perhaps the town should promote the natural water source and create branding around that.\n\ntl;dr: So my Question again is: Are there specific methodologies to find the truly unique character of a community without the bias of an uneducated opinion? Specific questions to ask that reveal great qualitative information. Are there cues to look for that would lead to these unique cultural aspects?",
        "created_utc": 1536350199,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any theories on why Ancient Egypt (allegedly?) had less patriarchy than contemporary civilizations like Sumer?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dumlv/are_there_any_theories_on_why_ancient_egypt/",
        "text": "The best I've seen suggested is that they honored female gods more, but from an armchair perspective I don't think something as simple as that is enough to modify the whole social system. My uneducated guess would be the opposite: the social system and the religion are indistinguishable, and both were probably influenced by a third outside factor. What that factor is, I don't know. China was incredibly populous and patriarchal. Greece was incredibly hilly and segmented with distance between its city-states, but it was also incredibly patriarchal. Sumeria seems less patriarchal (from what I've read) than its successors Assyria and Babylonia, but it's hard to compare. Almost everything I've read emphasizes the unusual, perhaps unprecedented level of individual rights women and wives had in Ancient Egypt. (But what I've read could also be wrong too, of course.)\n\nI have read that patriarchy is linked to agriculture practices, since mothers naturally spend more time with children while pregnant or breastfeeding them (indoors), but agriculture is labor-intensive and requires work in the fields.\n\n&gt;This led to a division of labor within the family in which the man used his physical strength in food production, and the woman took care of child rearing, food processing and production and other family-related duties. The consequence was that women's role in society no longer gave her economic viability on her own(p.32).  \n&gt;  \n&gt;In essence, the general shift in the division of labor, associated with the Neolithic revolution, aggravated women's outside options (outside marriage) and this increased male bargaining power within the family, which, over generations, translated into norms and behavior which shaped the cultural beliefs on gender roles in societies.  \n&gt;  \n&gt;[https://pdfs.semanticscholar.org/acac/6ede1b35492215f07824c05c01a824dc467c.pdf](https://pdfs.semanticscholar.org/acac/6ede1b35492215f07824c05c01a824dc467c.pdf)\n\nEgypt was the bread basket of Rome and [incredibly fertile](https://www.ancient.eu/article/997/ancient-egyptian-agriculture/), so did the abundance of the Nile freeing more men to live at home with their wives rather than go out and do the hard work of farming have anything to do with this, for example?\n\nOn the other hand, I also saw it suggested by /u/[Nora\\_Oie](https://www.reddit.com/user/Nora_Oie) that because people could settle down and accumulate resources rather than engaging in mandatory sharing relationships in hunter-gatherer bands, warfare and conflict became inevitable in the Neolithic. That would correspond with the lack of warfare and homicide evidence from the Paleolithic. Warfare, of course, creates a need for higher-testosterone humans to protect the humans with wombs so the society survives, and the need to keep women and children in enclosures as a preventative measure for if a raid does break out.\n\n&gt;Interestingly, it can be argued that the \"domestication\" of women, crops and animals run parallel. Having to stay in one place to feed penned animals or grow crops leads to vulnerability to attack/raiding, defenses must be built. The fortified village is born and women stay inside when raiding is a risk, men go out and still forage, or take the herds from place to place.  \n&gt;  \n&gt;[https://www.reddit.com/r/AskAnthropology/comments/5nilo5/what\\_is\\_the\\_current\\_consensus\\_for\\_the\\_emergence/dcfsb70](https://www.reddit.com/r/AskAnthropology/comments/5nilo5/what_is_the_current_consensus_for_the_emergence/dcfsb70)\n\nSince Egypt had plenty of natural defenses with being surrounded on both sides by a desert, and Egypt was very politically unified a lot of the time, could a comparative lack of war produced a comparative lack of patriarchy? (I know Egypt did have civil wars, kingdom divisions and an invasion by the Sea Peoples, but I'm not sure if that invasion is the exception that proves the rule. Here is a [list of conflicts in Egypt](https://en.wikipedia.org/wiki/List_of_conflicts_in_Egypt#Early_Dynastic_Period_of_Egypt).)\n\nI decided to ask this here and not in /r/askhistorians first, since it seems like this is something that would have formed during prehistory.\n\n&amp;#x200B;",
        "created_utc": 1536328982,
        "upvote_ratio": ""
    },
    {
        "title": "Book donation campaign to rebuild Brazil's National Museum's anthropology library",
        "author": "vladesko",
        "url": "https://www.reddit.com/r/Anthropology/comments/9dsjwo/book_donation_campaign_to_rebuild_brazils/",
        "text": "",
        "created_utc": 1536312239,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some African populations have monopod eyes, similar to East Asians?",
        "author": "HayaoMituyo135642",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9drcwe/why_do_some_african_populations_have_monopod_eyes/",
        "text": "",
        "created_utc": 1536299451,
        "upvote_ratio": ""
    },
    {
        "title": "Has many submerged cultures been studied in details, and if so, what do we know about these cultures?",
        "author": "tnk9241",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dq3ac/has_many_submerged_cultures_been_studied_in/",
        "text": "Only 20,000 years  ago, the sea levels were 400 or so feet below where they are now. There was a **lot more land**, and the coasts of that time were bigger than they are today. \n\n[There was a land mass back then called Doggerland](https://en.wikipedia.org/wiki/Doggerland) which was the pre-submerged lands east-of-England and connected it to modern day Europe. Doggerland was quite large, but it started becoming submerged about 8,000 years ago. \n\nSame way, the Black Sea changed shapes around this timeframe, and according to one researcher, it started filling up with water at 200 times the rate of the Niagara Falls. \n\nAnyways, given that most of humanity lives by the coastline or by rivers, I'm convinced that there has been so many submerged civilizations that should be easy to discern. \n\nDo we have any information about the peoples who were submerged around:\n\n* Modern day Indian coastline?\n* Around Italy and the Adriatic Coast?\n* Caspian Sea or Black Sea area? The civilization that became submerged around the Black Sea/Caspian Sea maybe particularly interesting, because they may have been the original Proto-Indo-Europeans. \n\n",
        "created_utc": 1536288474,
        "upvote_ratio": ""
    },
    {
        "title": "Anthropologists, I am looking for a career in cultural tourism in America. Do you have any experience in this field?",
        "author": "jacksonthedawg",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dpss4/anthropologists_i_am_looking_for_a_career_in/",
        "text": "Like above, I am looking for jobs relating to cultural resource consultation, cultural tourism and related fields. I have just graduated undergrad with a BA in English/Anthropology. Any experience or advice in this would be extremely helpful.",
        "created_utc": 1536286311,
        "upvote_ratio": ""
    },
    {
        "title": "Why is World War 2 such an irrevelant topic to Western Europeans, but continues to hold great importance to Eastern Europeans?",
        "author": "anthrpnqr12845",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9do8b3/why_is_world_war_2_such_an_irrevelant_topic_to/",
        "text": "Among Western Europeans, such as Belgians, Dutch, and the French, World War 2 seems to have faded into the obscurity of history, and has no more importance for them, than say, the Napoleonic Wars in the early 19th century.\n\nBut in Central and Eastern Europe, such as Poland, Russia, Hungary, and Slovakia, World War 2 seems to be a topic of everyday life. Indeed, even young people seem to have the notion that it \"only happened yesterday\" and seem to have extensive historical knowledge of the era.\n\nFor example a common Hungarian curse even nowadays is \"May Mengele be your doctor\", and a kind a of thick marmalade that was a part of Axis soldiers' rations back in the 40s, and is available in Hungarian markets nowadays, is still called \"Hitler's bacon\" in a somewhat ironic way.\n\nWhen talking to young Europeans, it seems to me that Western Europeans seem to treat WW2 as a \"historical era\" with no personal connections, while Central- and Eastern Europeans seem to treat it as a natural predecessor of their past, and have the notion that not much has really changed since then, so they would feel right at home in the 1940s.",
        "created_utc": 1536275269,
        "upvote_ratio": ""
    },
    {
        "title": "Urban Culture Question",
        "author": "TheCuriousAtom",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dl79m/urban_culture_question/",
        "text": "I’m studying Rasta culture. Part of it is “ritual drama” - tensions between police and Rasta’s become almost scripted. Born into nyc poverty, throughout high school I hung out with people older than me “in the hood” and I now see that this “ritual drama” exists in urban/ “ghetto” societies - different people take on different almost archetypical roles - the “crooked cop,” the “plug”, the “snow bunny.” Conflict exists constantly in minor and major ways (I understand the major conflict is a reflection of poverty stress but there are also times  when conflict is created just for the hell of it, enough for it to be considered “ritual drama”) is there a term for it, have any studies been made on this? ",
        "created_utc": 1536256720,
        "upvote_ratio": ""
    },
    {
        "title": "head covering and respect for the dead",
        "author": "ExoticCommunity",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9dicje/head_covering_and_respect_for_the_dead/",
        "text": "In Western culture removing one's hat is a sign of respect for the dead. Can anyone cite a society where respect for the dead is conveyed by covering one's head? Asking for a friend.",
        "created_utc": 1536239075,
        "upvote_ratio": ""
    },
    {
        "title": "What cities throughout history have had the highest percentage of all of humanity living in them?",
        "author": "CanPolandBeRelevant",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9deijr/what_cities_throughout_history_have_had_the/",
        "text": "At any given point throughout history, have there been cities that contained a major portion of all the humans on Earth, or at least a sizeable amount moreso than any other city at the time? Adjusted for population growth, was there a city in particular that held the highest percentage of all living humans at any given time?",
        "created_utc": 1536206070,
        "upvote_ratio": ""
    },
    {
        "title": "In animism, how often are \"superpersons\" corresponding to natural objects identified with abstract ideals like war, wisdom and justice, and how often are they just extra-powerful beings who occupy the subjective essence of the rock, plant or tree they happen to \"be\"?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d9x9g/in_animism_how_often_are_superpersons/",
        "text": "I'm curious about both modern animist societies (which have been animistic for centuries, that is) and anything we know (or can reasonably speculate about) from the past, including the far past. Thanks!\n\nI've read elsewhere on this forum that the Mongols had numerous animistic \"war gods\"/\"war spirits,\" so that's a start if true. At the same time, a lot of the material I'm reading on Wikipedia and elsewhere focuses more on animists attributing sentience to rocks and trees than attributing abstract ideals to them in the same way Athena is attributed with the abstract ideal of civilized society.",
        "created_utc": 1536175227,
        "upvote_ratio": ""
    },
    {
        "title": "Why did some Native American tribes stick to hunting/gathering while others practiced farming?",
        "author": "CharlieKelly_CatKing",
        "url": "https://www.reddit.com/r/AskHistorians/comments/9d8h67/why_did_some_native_american_tribes_stick_to/",
        "text": "",
        "created_utc": 1536174202,
        "upvote_ratio": ""
    },
    {
        "title": "Out of wedlock childbearing throughout history?",
        "author": "deathiswaitingforme",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d9os6/out_of_wedlock_childbearing_throughout_history/",
        "text": "Are there any studies or records for how common out of marriage childbearing has been throughout history and in different cultures? Just curious.",
        "created_utc": 1536173837,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have these books in pdf, if you do would you send it to me?",
        "author": "shay_tal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d6o1l/does_anyone_have_these_books_in_pdf_if_you_do/",
        "text": " Eliot Oring, On the Concepts of Folklore, Folk Groups and Folklore Genres\n\n Alan Dundes, The Fabrication of Fakelores ",
        "created_utc": 1536155030,
        "upvote_ratio": ""
    },
    {
        "title": "What should I be doing as an undergrad with an Anthropology major?",
        "author": "DreamyStripes",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d6cat/what_should_i_be_doing_as_an_undergrad_with_an/",
        "text": "Anthropologists! What did you do as an undergraduate to help network and get into the field of Anthropology? I'm currently an undergrad with that major and I'd like to see what other good anthropologists did to improve themselves and get their names out there. Clubs? Societies? Currently studying at University of Tennessee at Chattanooga btw. ",
        "created_utc": 1536152665,
        "upvote_ratio": ""
    },
    {
        "title": "What books/essays about Maya culture do you suggest?",
        "author": "LukeJuror",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d5nhb/what_booksessays_about_maya_culture_do_you_suggest/",
        "text": "Hi Guys,\n\nI'm a Political Science student and I'll spend 6 mounths near a [Maya Quiché](https://it.wikipedia.org/wiki/Maya_Quich%C3%A9) village in Gutemala.\n\nI want to prepare to this adventure reading something about their culture and how behave amont them\n\n&amp;#x200B;",
        "created_utc": 1536147482,
        "upvote_ratio": ""
    },
    {
        "title": "What was the purpose of fairytales in the medieval era?",
        "author": "MrFranx",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d5868/what_was_the_purpose_of_fairytales_in_the/",
        "text": "Many many fairytales have horrible endings or bloody events,things inappropriate for children. The grandma is eaten alive by the wolf, one if Cinderella’s stepsister cuts her toe to fill the shoe...and much more. So I have two questions:\n\n1)Why did the brothers Grimm,Andersen and the other authors write those stories? Are those tales originally intended to be for children?\n\n2)Why did the parents read those stories to their children if they are so creepy?",
        "created_utc": 1536143805,
        "upvote_ratio": ""
    },
    {
        "title": "Did most ancient animists animize everything? If not, what may have been [some of] their criteria for determining what non-organic object does or doesn't have a personality?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d4kfp/did_most_ancient_animists_animize_everything_if/",
        "text": "[deleted]",
        "created_utc": 1536137213,
        "upvote_ratio": ""
    },
    {
        "title": "What is the earliest society that could have solved a Rubik's cube?",
        "author": "eligodfrey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d3hev/what_is_the_earliest_society_that_could_have/",
        "text": "",
        "created_utc": 1536126213,
        "upvote_ratio": ""
    },
    {
        "title": "Question about the transition from animism to polytheism: When a society starts believing in powerful abstract gods rather than immanent animism, why are the rocks, trees and streams less personalized?",
        "author": "spermwhalejail",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d2jd0/question_about_the_transition_from_animism_to/",
        "text": "Why do they have to be mutually exclusive? For example, isn't it true that the Greeks, Sumerians and Egyptians considered rocks, trees and streams less \"alive\" than their hunter-gatherer ancestors probably did, and many modern hunter-gatherer tribes probably do? I realize that the adoption of highly powerful gods goes hand-in-hand with the creation of a priestly class and a general worldview of hierarchy. But even if your worldview has hierarchy in it, what's to stop all of the objects which were \"animized,\" or personalized, before from having that same personal essence, just existing in the realm below gods?\n\n&amp;#x200B;\n\nTo be clear, I know that the Greeks had nymphs (for example) and that nature spirits are a very common belief even in agricultural states. But it seems like nymphs or fairies or Tomb Bombadil-like things are few in number compared to every tree or rock being alive like in the belief systems of hunter-gatherers.\n\n&amp;#x200B;\n\nIs it simply the case (according to our very limited speculation) that the more people focus on the realm of the abstract for their spiritual and religious ideas, the less they're able to focus on associating spiritual ideas with the world around them?\n\n&amp;#x200B;\n\nPlease let me know if I've gone way wrong in any way when asking this question.",
        "created_utc": 1536117301,
        "upvote_ratio": ""
    },
    {
        "title": "What is the opinion of most mainstream/academic anthropologists on Clastres?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d09n0/what_is_the_opinion_of_most_mainstreamacademic/",
        "text": "[deleted]",
        "created_utc": 1536099119,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know what Australopithecines looked like?",
        "author": "TreyHughes",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9d07us/how_do_we_know_what_australopithecines_looked_like/",
        "text": "I’m not sure if this is the right sub, but I’ll ask it anyway. I understand we have many fossils of australopithecines, but how do we know about the anatomy of them in regards to hair, skin, etc.? Is it a matter of inference or do the fossils tell us more? Is it based on ancient genome testing, or the environment that the fossils were found? Is it because of the tooth enamel of these fossils that we can understand the distribution of certain nutrients that lead to such things as skin or hair? Or something else?\n\nAny thoughts or suggestions would be greatly appreciated. :)",
        "created_utc": 1536098739,
        "upvote_ratio": ""
    },
    {
        "title": "Exactly how far distant am I from my hunting and gathering forbears?",
        "author": "yoyoyoyoyoyoy0",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cxk9b/exactly_how_far_distant_am_i_from_my_hunting_and/",
        "text": "Evolutionarily speaking of course. I am a European male from north-west England, so presumably I am a mix of neolithic farmer stock &amp; the native hunter/gatherer population. I'm lactose tolerant. Are there any genetic barriers that would make me less effective as an endurance runner/hunter? I've always been fascinated by the persistence hunting Bushmen.",
        "created_utc": 1536080546,
        "upvote_ratio": ""
    },
    {
        "title": "How old is the practice of assigning names to ships? And other maritime-cultural questions.",
        "author": "slukeo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cwhq6/how_old_is_the_practice_of_assigning_names_to/",
        "text": "Were ships in ancient times assigned names?  Do all seafaring societies give names to ships and boats? \n\nAnother big one: how long have ships been referred to as female (ie: \"she sailed for Liverpool two weeks ago\").",
        "created_utc": 1536073869,
        "upvote_ratio": ""
    },
    {
        "title": "How Romanized were the Germanic peoples who invaded the Late Roman Empire?",
        "author": "badgers1987",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cvhka/how_romanized_were_the_germanic_peoples_who/",
        "text": "Franks, Goths, Lombards, Burgundians, Saxons...\n\nHow many of them had adopted Roman customs before the invasion? Were they still pagans? \n\nIt seems the Lombards in Italy, and even more the Jutes/Angli/Saxons in Britain, were the least romanized and exercised an harsh right of conquest while the Franks wanted to legitimize their rule through marriages with the Gallo-Roman elites.",
        "created_utc": 1536066859,
        "upvote_ratio": ""
    },
    {
        "title": "How to study Prehistory?",
        "author": "AKilesIN_46",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cs36k/how_to_study_prehistory/",
        "text": " What are some good books for someone interested in studying the Stone, Copper, Bronze and Iron ages?\n\nPrehistory always fascinated me, i'm looking for book recomendations and your opinions on how to approach this topic.",
        "created_utc": 1536032321,
        "upvote_ratio": ""
    },
    {
        "title": "Let's talk about warrior women!",
        "author": "oleka_myriam",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9co7n2/lets_talk_about_warrior_women/",
        "text": "Hello everyone!\n\nOne of my favourite observations of David Graeber is that no matter what universalist statement you are making (\"History has *always* favoured capitalism\", \"femininity has *always* been seen as meek and submissive\", etc.), anthropology can help with debunking it by the huge and awesome number of cultures which have been extensively studied which show the opposite.\n\nUnfortunately most of my knowledge of this stuff is more about political cultures and I really don't know too much about how different societies have conceived of masculinity and femininity or of the differing roles of women.\n\nFor example, I made a post on /r/AskFeminists recently about how women simply have not had the same universal roles at all even within the same culture, let alone in different cultures. I was wondering:\n\n* Which cultures have existed where women did most of the fighting? There may be something about warrior women on the Uzbek steppes in ancient times but sources seem vague, as do historical reports from Brazil and South America. The closest I've been able to find have been the warrior women of Dahomey who were an elite kingsguard but that's not exactly the same as a society where women made exclusively the highest ranks of military. But given the huge variety of human culture in virtually all other aspects of society, I'm really struggling to believe this has *never* happened even if its through some strange accident of history or geography like the all-female society in Walking Dead, or Mad Max.\n\n* Which cultures saw femininity as dominant, assertive and aggressive? I got the Tchambuli and the Mundagamor both from Margaret Mead and a fascinating [article](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3826207/) about aggressive women in Western societies but surely there must be a lot more?\n\n* Has sacred prostitution and holy women been practiced in more recent times or is that exclusively an old-world phenomenon?\n\nIs there anything else I should know and be talking about when it comes to sex differences and construction of gender between cultures?\n\nThanks in advance!",
        "created_utc": 1536001442,
        "upvote_ratio": ""
    },
    {
        "title": "classification of stone artifacts",
        "author": "xXbee_lover88Xx",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cnj1t/classification_of_stone_artifacts/",
        "text": "I'm currently studying archeology as a \"minor\" and been having some difficulty with identification of ancient stone artifacts. I've been using Leroi-Gourhan's  *Prehistoric Man* as a main source, but i don't like the way he explains things. Could anyone point me in the direction of a good \"general\" prehistory book?",
        "created_utc": 1535996682,
        "upvote_ratio": ""
    },
    {
        "title": "Are Finns, Estonians, Hungarians, Koreans, and Japanese related to eachother?",
        "author": "qstnfntrh9472",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cmtvg/are_finns_estonians_hungarians_koreans_and/",
        "text": "[removed]",
        "created_utc": 1535991827,
        "upvote_ratio": ""
    },
    {
        "title": "Why do humans prefer early nighttime to late nighttime?",
        "author": "Uzalud",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9clu92/why_do_humans_prefer_early_nighttime_to_late/",
        "text": "It's taken for granted that on long (summer) days contemporary humans sleep through the early hours of daytime and stay awake through the early hours of nighttime. During the shorter (winter) days people keep staying awake during the first half of nighttime rather then waking up hours before the dawn. If they can choose, it seems that humans prefer early nighttime to late nighttime. Is this universal across cultures and epochs? Why is it so?",
        "created_utc": 1535984456,
        "upvote_ratio": ""
    },
    {
        "title": "How far back does belief in a mother goddess of some kind probably go, in relation to Animism, according to studies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ch5be/how_far_back_does_belief_in_a_mother_goddess_of/",
        "text": "[deleted]",
        "created_utc": 1535936462,
        "upvote_ratio": ""
    },
    {
        "title": "I've read that ancient hunter gatherers probably practiced Animism as the original proto-religion. How does Animism relate to the worship of Mother Earth/the Great Goddess who appears to be depicted in prehistoric stone statues?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ch2vr/ive_read_that_ancient_hunter_gatherers_probably/",
        "text": "[deleted]",
        "created_utc": 1535935842,
        "upvote_ratio": ""
    },
    {
        "title": "In ancient societies, was hearing people have sex a common occurrence, or did couples somehow seek out privacy for intimate relations?",
        "author": "NakedJaked",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cgjht/in_ancient_societies_was_hearing_people_have_sex/",
        "text": "",
        "created_utc": 1535930861,
        "upvote_ratio": ""
    },
    {
        "title": "12 Month Calendar",
        "author": "chinchabun",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cgh3s/12_month_calendar/",
        "text": "Why did all civilizations develop a twelve month calendar? Are there any that developed, but their calendar has since fallen out of use?",
        "created_utc": 1535930241,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any towns in the United States which have unique traditions or festivals?",
        "author": "question4477",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9cfjub/are_there_any_towns_in_the_united_states_which/",
        "text": "Only confined to that one town and only celebrated or has participants of those in said town (not the other towns or cities of the county)",
        "created_utc": 1535922477,
        "upvote_ratio": ""
    },
    {
        "title": "Can anybody recommend some up-to-date documentaries on globalization’s effects on religious practice, preferably in a place other than the United States?",
        "author": "julianmcdaniel",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/9ce8df/can_anybody_recommend_some_uptodate_documentaries/",
        "text": "Hi! I’m currently helping a former professor of mine update the syllabus for her Intro to Cultural Anthropology course and I could use some help. As the title of this post suggests:  do any of y’all have recommendations for any films with themes pertaining to globalization, religion, and religious practice? I would really appreciate any/all input.\n\nThanks!",
        "created_utc": 1535912275,
        "upvote_ratio": ""
    }
]