[
    {
        "title": "Problem in revised paper",
        "author": "tugberk21",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94ze4b/problem_in_revised_paper/",
        "text": "Hi! I've sent an article to elsevier journal and reviewers asked for minor revisions. Most of the revisions were about missing symbols or misplaced alignment in tables. I've corrected the errors and my professor send back to the journal. When I checked the submission, I find new errors occured in tables. All of these errors probably occured while merging uploaded documents to the single manusicript. What will happen to my submission will it be rejected? or What can I do to inform editors or reviewers? This is my first journal paper and I'm a bit anxious.",
        "created_utc": 1533542132,
        "upvote_ratio": ""
    },
    {
        "title": "[Weekly] Office Hours - undergrads, please ask your questions here",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94z9o3/weekly_office_hours_undergrads_please_ask_your/",
        "text": "This thread is posted weekly to provide short answers to simple questions, mostly from undergraduates to professors.  If the question you have to ask isn't worth a thread by itself, this is probably the place for it!",
        "created_utc": 1533540669,
        "upvote_ratio": ""
    },
    {
        "title": "What sites hold onto your professor rec letters (for applying to grad school, etc) question, thank you!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94y3yf/what_sites_hold_onto_your_professor_rec_letters/",
        "text": "[deleted]",
        "created_utc": 1533528375,
        "upvote_ratio": ""
    },
    {
        "title": "My Boss Sent Me A Journal Article to Read and I Can't Understand It...",
        "author": "toxic_wastebasket",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94x6up/my_boss_sent_me_a_journal_article_to_read_and_i/",
        "text": "Hello everyone,\n\nThis is my first time posting in this sub so please bear with me.\n\nSo, I graduated with my BA in Psychology this past May. A couple of weeks ago I started a job as a Research Assistant working with a highly distinguished professor in the field of cognitive science and abnormal psychology. Now, cognitive science (or any science for that matter) was never my strong suit.  I also fulfilled my science requirements in undergrad 2 years ago, so I forgot a lot of information. I was hired mainly to work on one of his projects that has nothing to do with his primary research interests, but aligns perfectly with my interest of abnormal psychology and working with a completely different population.\n\nLast week, I got hired to work on another project. So now I'm working part-time in both projects. My boss sent me a lengthy article to read, and I can't understand a majority of it. My boss mentioned that if I had any questions, I can just ask. But, I'm afraid that I'll look incompetent and that I really don't belong in the lab. The paper was way too advanced. I've been researching key terms, going on websites and reviewing notes from years ago. Although it does help, I feel so inept and that I don't really belong in this lab. \n\nImposter syndrome has already got the best of me. I'm one of the youngest working in the lab. Most of my co-workers have PhD's. It's so intimidating. I know the common sense answer here is to just ask my professor questions, but I've had demeaning professors before and I'm trying to prevent a poor situation. \n\nWhat do you suggest I do? I'm not considering dropping out of this project, considering my boss really needs an RA for this project. I definitely still want to work in this project because I love learning new things. I'm just overwhelmed with imposter syndrome symptoms and I'm not sure where to begin. \n\nAny advice would be greatly appreciated!",
        "created_utc": 1533520147,
        "upvote_ratio": ""
    },
    {
        "title": "Surviving a volatile coauthor",
        "author": "elcaballitico",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94w8k2/surviving_a_volatile_coauthor/",
        "text": "TL;DR: My coauthor thinks I am trying to force her off of a paper, and nothing I say/do at this point will convince her otherwise.  About 50% of our meetings are coauthor telling me what a bad coworker and bad collaborator I am, and me trying to pacify her.  How am I supposed to finish an assigned paper like this?  \n\n\nLong post, sorry.  This post is half vent, half call for suggestions.  I am in an academic STEM wet lab.  I was assigned to write a review along with a coauthor, who is a few years my senior.  As such, she was assigned the role of lead author.  To make a very long story short, coauthor has accused me early and often of trying to take over the project and force her out.  These accusations started almost immediately after the first meeting with the PI.  Before that meeting, I wrote out a rough outline of several possible sections/topics that we could cover in the review, along with the affiliated references.  \n\nAs it turns out in our later meetings, coauthor RESENTED the fact that I had made an outline at all.  She brought it up multiple times as evidence that I was trying to just do things without her, despite the fact that I had placed it on a shared file that she was authorized to edit.  She even said things like \"well you just went and wrote the whole thing already\" and  \"maybe we can't work together.  that's disappointing, I was hoping to prove that we could\".  I was so confused.  I thought we were butting heads a little bit, and she thought that we were in an nearly un-resolvable conflict.  During one meeting, she told me \"you write YOUR section, and I write MY section, do not dare do anything on my section.  Not everyone writes from an outline.\"  Of course, it's very hard for me to write \"my part\" and stay away from \"her part\" when she refuses to use an outline...\n\nThings deteriorated.  In one meeting, she exploded at me and berated me for wasting her time, for having too much free time myself, for being a tyrant, and for manipulating her to not be involved in the work process.  Things got better for a while, and then she chewed me out, in  front of several people, for a trivial reason.  This was a blessing, because for once I got someone to take me aside and say \"Don't worry, everyone knows that you aren't doing anything wrong\" which was very helpful to convince me that I am NOT some manipulative bastard that coauthor viciously insists I am.  It also helps that someone else who worked with her on a similar project told me \"yeah... we've all been there before with her.\" The level of antagonism is starting to become comical.  Recently, she sent me an email with snarky criticism of my writing style. Honestly, my first thoughts when I saw that email were \"OK, that you might be right, let's see what changes you made to fix it\".  She had made some minor word and phrasing changes.  The email she wrote criticizing me was longer and more extensive than the actual edits she made.\n\nI don't know how much longer I can keep working like this.  I don't think anything I can say at this point will change her narrative of how I have been plotting to take over this paper from her since day one. About half of our meetings are just a string of accusations.  I also have no idea if she is feeding this narrative to my PI, and if I need to take defensive action to protect my reputation, or at least warn him that she pulls this shit sometimes.  From a distance, it looks like total author amateur hour, and I am not happy to have that be the first thing my PI sees me try to produce.  I know I am not perfect, and perhaps could have done certain things differently, but I really think this situation is past the point of reasonable behavior.\n\nEdited for length, and to make some details intentionally vague.",
        "created_utc": 1533511742,
        "upvote_ratio": ""
    },
    {
        "title": "Does this sound like too much to do in one semester?",
        "author": "SocialWorky2017",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94w6bc/does_this_sound_like_too_much_to_do_in_one/",
        "text": "Hello,\n\nI was offered a TAship after a spot has opened. It's 90 hours for Fall. I was not expecting to get one because I am a master's student and was lower on the priority list. I would like to accept it, but I'm also going to be a research assistant and a fellow to an institute. I only have the writing of my thesis planned for next year (including recruitment, focus groups, transcribing).\n\nDoes this sound like too much to you for a master's student in the social sciences? I am used to jungle with lots of commitments and have always managed but I'm hesitant. I wonder if I should push back the RAship to the Winter semester. ",
        "created_utc": 1533511186,
        "upvote_ratio": ""
    },
    {
        "title": "Foreign Language and Area Studies Fellowships",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94w0kn/foreign_language_and_area_studies_fellowships/",
        "text": "Does anyone know how competitive Foreign Language and Area Studies (FLAS) fellowships are? I'm a graduate student with a focus on Russia/Eastern Europe, and I've applied for a FLAS at my institution. I'm particularly concerned about my quant GRE score weighing my application down, though my verbal and writing scores are very high.\n\nI've posted this on the grad students forum, but I'm looking for the feedback of faculty members with knowledge of the fellowship. Thanks.",
        "created_utc": 1533509774,
        "upvote_ratio": ""
    },
    {
        "title": "How To Get Accepted Into An REU?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94vsi7/how_to_get_accepted_into_an_reu/",
        "text": "[deleted]",
        "created_utc": 1533507853,
        "upvote_ratio": ""
    },
    {
        "title": "TA vs RA Funding",
        "author": "hidden_wildflower19",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94vnen/ta_vs_ra_funding/",
        "text": "Is it a bad idea to take a PhD that has promised funding for its duration but it is all under TA? Should this be any kind of warning sign or is this pretty common?",
        "created_utc": 1533506694,
        "upvote_ratio": ""
    },
    {
        "title": "What do you keep on your desk?",
        "author": "tommeetucker",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94vjk4/what_do_you_keep_on_your_desk/",
        "text": "I'm just starting my PhD - what do you find are handy or fun things to keep on your desk?",
        "created_utc": 1533505841,
        "upvote_ratio": ""
    },
    {
        "title": "First office, tips?",
        "author": "dataispower",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94to60/first_office_tips/",
        "text": "I am starting a NTT teaching position in the Fall. Office assignments will be going out sometime within the next week or 2. This will be my first office ever (I do not count cubicles as an office) and I'm really excited about it.\n\nAre there any tips about having an office you'd like to share? Are there any things you wish that you had known way back when you first got an office? Any hard lessons learned? ",
        "created_utc": 1533491215,
        "upvote_ratio": ""
    },
    {
        "title": "how to add articles to Endnote that arent part of the usual research sides",
        "author": "Michael_Jackson_Fan",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94tkam/how_to_add_articles_to_endnote_that_arent_part_of/",
        "text": "So i am writing this homework and have to set up a bibliography with all the studys i am refering to. My prof wants us to use Endnote but all the articles that are relevant for my topic are from indepent organisations publicated on their own websites they arent on Pubmed or smth like that. is it somehow possible to still add them to the bibliography ? thanks alot for any help !!",
        "created_utc": 1533490380,
        "upvote_ratio": ""
    },
    {
        "title": "[Advice] Rules for grad students, creative workers, and others",
        "author": "specific_account_",
        "url": "https://www.reddit.com/r/getdisciplined/comments/94rdbk/advice_rules_for_grad_students_creative_workers/",
        "text": "",
        "created_utc": 1533479944,
        "upvote_ratio": ""
    },
    {
        "title": "[Academic][Casual] The effect of personality and individual differences on roommate matching (People who are living/lived in a shared household)",
        "author": "TomRiddle2411",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94s4uk/academiccasual_the_effect_of_personality_and/",
        "text": "[removed]",
        "created_utc": 1533478463,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to help my fiancee with her PhD topic",
        "author": "parter_of_academic",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94rzm0/trying_to_help_my_fiancee_with_her_phd_topic/",
        "text": "Hello /r/AskAcademia,\n\nI've subbed here some time ago to learn about how the life of the academics go, to be able to support my fiancee better, but now I'm using a new account because my main could be very easily tracked to me. She's doing a PhD in consumer behavior. The degree she's doing is more of a program, where you join the department first, then you choose a professor. She already had her supervisor in mind, and she's currently working with her. The supervisor was appointed as the dean for the department, and now she has no time for my fiancee - they meet around once every month. There's another prof that my fiancee is consulting with, but her topics are not interesting to my fiancee. \n\nIt's my fiancee's 2nd year in her PhD program, but she still doesn't have a specific topic that she's working on. She has tried a couple ideas, but they were put on hold by her professors. Currently, she's in a rather 'creative rut', and cannot find a direction.\n\nFrom my own experience and observations, PhDs tend to start with an idea for a project, or at least a specific sub-topic, but it might just be my area, or even the groups that I've been close to. Both the professors have said that they have an idea for some research, but they would like for my fiancee to find something herself. I understand that finding a topic yourself would motivate you more, but it still sounds quite weird to me that they wouldn't share their research ideas.\n\nI would like to help my fiancee find her way, what are some things I can do to get her out of this creative rut, or to help her solve this issue? I've read a bunch of stuff online about getting over your creative rut, or about finding a topic for a PhD, and we've tried a couple, but none have worked.\n\nThank you already for your responses. Keep rocking, Academia is very hard from what I've seen, and be proud!",
        "created_utc": 1533477135,
        "upvote_ratio": ""
    },
    {
        "title": "Personal projects as a PhD student - should I save them for my Postdoc?",
        "author": "Empty_Yam",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94quox/personal_projects_as_a_phd_student_should_i_save/",
        "text": "I'm a 2nd year PhD student. \n\nThere is little interaction with me and my supervisor/boss. She gave me a few projects when I started, and they are nearly finished.  These yield four publications, which would be enough for me to defend my thesis. \n\nWhat my PhD studies lack in mentorship it wins in freedom. I've done what I have been asked and more, but my main motivation has been in pursuing my own interests. It has been an interesting process of learning to balance the game of explore-exploit, and I love it. The topics I have discovered and learned are quite cutting edge and my research could have a lot of impact. As I've stumbled on these ideas and projects completely independently, I feel bit wary of giving my supervisor co-authorship on the work - especially if they could be monetizable.\n\nRight now I'm employed by her, but I'm applying for my own funding for a few years to hopefully get more of that cool freedom juice. I'm treating the rest of my PhD as a series of mini-postdocs: independent research with my own funding, and doing a few 1-3 month long research visits to top groups.\n\nAnother option would be to graduate and pursue a postdoc. Unfortunately, that'd mean going abroad, which is not viable due to family reasons.\n\nSo that's the case. Here are some questions:\n\n1. Is my supervisor entitled to co-authorship without any contribution to the work?\n\n2. Is this mindset of treating my PhD studies as a series mini-postdocs dumb? Should I just bite the bullet and jump to the next level, or enjoy the huge amount of freedom I now have?",
        "created_utc": 1533463309,
        "upvote_ratio": ""
    },
    {
        "title": "[ACCOUNTING] Opinion on my proposed research topic",
        "author": "TurbulentAct",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94qh1y/accounting_opinion_on_my_proposed_research_topic/",
        "text": "I am planning on proposing to undertake research  for PhD on the 'effect of implementation of a particular accounting standard which has already been released and the companies' response'.\n\nI have a feeling it's not PhD level or something that really requires 3 years.. opinions?",
        "created_utc": 1533457827,
        "upvote_ratio": ""
    },
    {
        "title": "How did you find your grad school/program?",
        "author": "no_juans",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94o85j/how_did_you_find_your_grad_schoolprogram/",
        "text": "The options just seem so limitless! I'm pursuing a masters degree in neuroscience and with undergrad my motivations were mostly geographical and financial, but it seems grad school is different in that it is where we fledge out our specializations in our field, making programs far from home more viable.",
        "created_utc": 1533432619,
        "upvote_ratio": ""
    },
    {
        "title": "My PhD Supervisor is being accused of sexual harassment. Should I change the supervisor?",
        "author": "kozmicbluezz",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94nsbx/my_phd_supervisor_is_being_accused_of_sexual/",
        "text": "Hi there.\n\nHave a really stupid situation and just don't know what to do. In short, my PhD supervisor is being investigated at university for possible sexual harassment or disrespectful behavior in general. If he's going to be fired from university, what should I do? Should I change the supervisor (I am on my first year of this PhD program)? Or if the university will let him stay, should I continue working on my thesis under his supervision?\n\nI just feel so stuck... I know it's not my fault, not my problem that my supervisor got involved into some sort of shitty scandal... But I feel so ashamed now that he happens to be my supervisor... I mean, if he continues to be my supervisor, what impact it will have on my, as a doctoral student's (I am a female), reputation? On the other hand, if he stays, maybe I should just calm down, work on my thesis and don't start any supervisor changing shit... I am also having some sort of ethical dilemma: he didn't do anything bad for me particularly so why would I want to change him or say anything bad about him? However, it's not the first time as he's being reported by students (and colleagues from another workplace) for behaving inappropriately... I didn't know that till this scandal situation...\n\nAny suggestions?..",
        "created_utc": 1533428443,
        "upvote_ratio": ""
    },
    {
        "title": "[Humanities] What is the difference between an analytical approach and an empirical approach?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94nas2/humanities_what_is_the_difference_between_an/",
        "text": "[deleted]",
        "created_utc": 1533424087,
        "upvote_ratio": ""
    },
    {
        "title": "[Humanities] Difference between Analytical and Empirical Analyses",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94naeu/humanities_difference_between_analytical_and/",
        "text": "[deleted]",
        "created_utc": 1533423996,
        "upvote_ratio": ""
    },
    {
        "title": "Is it rude to ask for an increase on a tuition award?",
        "author": "MaxDemian_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94mwhn/is_it_rude_to_ask_for_an_increase_on_a_tuition/",
        "text": "It's an international student tuition award given by the university, not the department, and it doesn't come out of my advisor's funds. The award is for \"up to $3,000\" and I have received the award for $2,000. I'm meeting with my advisor this week, and I was wondering if it'd be rude/entitled to ask them if it's possible to have it increased to the full amount. My first tuition payment isn't for another month, and I don't have to accept the award until then.\n\nI'm living in a very expensive city and my stipend isn't very high. It's not about greed, it's about having a living wage.",
        "created_utc": 1533420599,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with subject prejudice from non-academics.",
        "author": "WillyShakesqueer",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94mkv0/how_do_you_deal_with_subject_prejudice_from/",
        "text": "I am studying literature at university and I am working towards an MA and PhD so that I can work in higher education. All I seem to get from distant relatives, family friends and complete strangers is that studying literature isn't a real subject or its not worthwhile and I should get a proper job. I know i'm not going to be saving any lives or coming up with the next big discovery but my subject is important to me. The only support I get is from academics at the university and my sister who is a Chemistry PhD (even her colleges are at the very least respectful to me and the literature department but that might be office politics).  I genuinely want to become an academic in this field but it frustrates me that I can't defend myself and my chosen field. How do academics in the arts/humanities deal with these sort of statements?",
        "created_utc": 1533417911,
        "upvote_ratio": ""
    },
    {
        "title": "Professors who use Blackboard, can you tell me if my professor is grading extra credit correctly?",
        "author": "uncreative-af",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94m0w2/professors_who_use_blackboard_can_you_tell_me_if/",
        "text": "First of all I’m not saying my professor is doing anything wrong, I’m just a bit confused and would like some clarification before contacting him. \n\nI’m taking an online class and so far there has been a discussion board post (10 points) and the midterm (30 points). The professor also gave out three extra credit quizzes at 1 point each or at 3 points total. I completed the discussion board assignment and the midterm, so my grade should be 40/40, correct? It is currently at 40/43. Shouldn’t the extra credit be graded as 1/0 and not 1/1? That’s how I’ve had other professors grade it in the past. And yes, I am 100% sure the quizzes are extra credit, I’ve checked the syllabus, his announcements, and the quiz is titled “extra credit”.  I know it’s only three points but still.\n\nUPDATE: I emailed my professor and he said I was right lol",
        "created_utc": 1533413283,
        "upvote_ratio": ""
    },
    {
        "title": "Here's a doozy- caught my advisor sleeping with a labmate.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94lx7m/heres_a_doozy_caught_my_advisor_sleeping_with_a/",
        "text": "[deleted]",
        "created_utc": 1533412457,
        "upvote_ratio": ""
    },
    {
        "title": "Help me think through a dilemma",
        "author": "JangleAllTheWay",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94lwkk/help_me_think_through_a_dilemma/",
        "text": "Hi all,\n\nI run a department at a community college. I have tenure and can go back to faculty (at lower pay) if I need to.\n\nLike most schools, we are strapped for money. My discipline has class caps in the full-timers' union contract. This year we department chairs expect to be asked to raise the caps for part-timers only.\n\nI really don't want to do that. We already pay our part-timers far less. Having different class caps would make us even more of a two-tier society. I am wondering whether, if it comes to it, I should resign rather than raise the caps.\n\nMy replacement would likely then face the same choice, so the caps would probably be raised in the end. Would resigning be grandstanding? Or is this something it would be worthwhile to take a stand on?",
        "created_utc": 1533412306,
        "upvote_ratio": ""
    },
    {
        "title": "How much work do I need to do in order to be eligible for authorship? (Undergraduate research assistant, engineering, USA)",
        "author": "mrpokehontas",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94l8cf/how_much_work_do_i_need_to_do_in_order_to_be/",
        "text": "I'm an undergrad doing (unpaid) work in a lab and helping out a PhD student with his research. I mostly help out with running tests, playing with MATLAB scripts to analyze data, and making pretty plots. The student and his adviser are looking to submit a publication regarding the work that I'm helping with in the next few months. Since I'm trying to go to grad school, I think it would be really awesome if I could get my name *somewhere* so that I can show that I have some experience in doing lab research, but I'm not sure how authorship generally works. \n\n&amp;nbsp;\n\nWould it be offensive/disrespectful to ask if I could get my name on the paper? Or perhaps if I asked if there was anything more I could do in order to get my name on the paper? Is there a way to get some sort of credit without being listed as an author? \n\n&amp;nbsp;\n\nThanks in advance for the advice! ",
        "created_utc": 1533406903,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding possible alternatives to the Japanese Monbukagakusho Scholarship",
        "author": "SoulKingBrook7",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94kkdh/question_regarding_possible_alternatives_to_the/",
        "text": "Hi, after looking carefully into the Monbukagakusho Scholarship system for a graduatee degree on the Japanese universities i got discouraged a lot when i saw the information regarding the bachelors grades. Due to psychological issues from my house although i did get a bachelor my grades are kinda bad (ill receive it in september but i think my average grade is 52) and i am not sure if i can pass with that grade at all which is really sad because i still have a degree in the end. Are there any possible alternatives to this scholarship for Japan or even normal routes to enter a university there without requiring a high degree of bachelor? Even the fact that someone has a degree should at least count towards another method if not the Monbukagakusho.",
        "created_utc": 1533401722,
        "upvote_ratio": ""
    },
    {
        "title": "Applying for lateral TT position - use current institution letterhead for cover letter?",
        "author": "scthrownawayalready",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94ka1h/applying_for_lateral_tt_position_use_current/",
        "text": "It's a minor issue I'm sure, but I'm not sure of the etiquette here. I've been asked to submit materials for a lateral move. They just want a cover letter plus CV. Would you write the cover letter on your current institution's letterhead? ",
        "created_utc": 1533399400,
        "upvote_ratio": ""
    },
    {
        "title": "If your supervisor funds you (graduate student), is it a grant or an award? Really confused about terminology",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94jksi/if_your_supervisor_funds_you_graduate_student_is/",
        "text": "[deleted]",
        "created_utc": 1533393514,
        "upvote_ratio": ""
    },
    {
        "title": "What is it you wish you'd known when you started research?",
        "author": "CrazyFart",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94jcr5/what_is_it_you_wish_youd_known_when_you_started/",
        "text": "",
        "created_utc": 1533391556,
        "upvote_ratio": ""
    },
    {
        "title": "How to get into publishing papers? (Hopefully a useful question for others)",
        "author": "evrem_throwaway",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94i5ho/how_to_get_into_publishing_papers_hopefully_a/",
        "text": "Have a master's from a top institution in my field and I want to get into publishing articles at the least...but it was never made clear to me how to publish. Do I just find journals and send an article to them and see if they will publish it? Similarly, if I want to publish in newspapers, I presume that I just write an article and send it to them and they will decide if it's up to snuff... right? Is it that simple? What about later if I want to publish books?\n\nI know this is probably painfully obvious, but it is something that I just never attempted to do because the people that I asked (classmates) didn't know either.",
        "created_utc": 1533377829,
        "upvote_ratio": ""
    },
    {
        "title": "Just received 'minor revisions' on my first real paper. How do I address the individual criticisms?",
        "author": "WriterOfLetters",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94hlgm/just_received_minor_revisions_on_my_first_real/",
        "text": "I have published in student journals, anthologies, and conference proceedings before but this is my first real double-blind peer-reviewed publication. Yesterday we (me and my co-author) have received the decision of the journal that we only need to apply minor revisions. Yaay!\n\nSo, both reviewers were really nice, we don't need to do a follow-up study or re-write whole sections or anything. They liked pretty much everything but only had a few minor suggestions, such as citing other papers, using different terminology, and putting the statistical stuff at a different part of the paper. So I'm pretty happy. \n\nThe question I have for you is the following: How do I address the specific points that the reviewers raised? Am I supposed to make an extra document, copy their points and respond to them 1 on 1? How extensive should this be, can I just agree and note that I did what they wanted? Or should I write whole paragraphs? Any pointers would be really appreciated, I'd hate to fuck it up now. :&gt;\n\nThank you so much for any help!\n\nEDIT: Field: Moral/Social Psychology, Experimental Philosophy",
        "created_utc": 1533369950,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to pass MEXT scholarship (for research/graduates) if the subject is different than your bachelor?",
        "author": "Syncroniam",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94h9h8/is_it_possible_to_pass_mext_scholarship_for/",
        "text": "I heard that the questions that you are asked to answer in the examination of the Monbukagakusho scholarship system are related to the subject that you want to study. But if the subject you pursue is not related to what you did during the undergraduate degree how are you supposed to pass it? For example if you pick computer science but your bachelor was not related to that how are you supposed to answer questions on that sector before you get the chance to enter it? It kinda seems that you are locked to pick what you previously studied. The same question can be said for future undergraduate students of MEXT that just finished high school and dont have advanced knowledge to a specific subject.",
        "created_utc": 1533365674,
        "upvote_ratio": ""
    },
    {
        "title": "I am applying for a university vice provost position regarding employment/labor disputes as a lawyer; should I disclose that I've been dating a pHD student or is that sufficiently unrelated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94gej2/i_am_applying_for_a_university_vice_provost/",
        "text": "[deleted]",
        "created_utc": 1533356346,
        "upvote_ratio": ""
    },
    {
        "title": "Professor and facebook? Should I report? Suggested steps, if any?",
        "author": "nerdywoman67",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94g49j/professor_and_facebook_should_i_report_suggested/",
        "text": "Last semester, I informed all of my professors the first week that I would be gone the final week of the semester for a religious observation.I also have a disability and accommodations.\n\nMy professor who claimed to give us a timed exam, said I could have extended time (she received my documentation with accommodations btw). It turns out there was no timer because she used Google Forms (another story).\n\n Anyway, she said the earliest she could post the exam was the Friday before the last week.That was the VERY last day that I could work on my papers/exams/etc. before being in South Dakota with limited signal (and obviously I would be busy at the religious observation).Anyway, I sent her an e-mail, very proud with my disability and limited time and said \"Here is my portfolio!! I finished all of this and my final and 3 papers in 1 sitting. My brain is done.\"She has a background in psychology, so I thought she would appreciate the feeling of success for a student with accommodations who often finds it hard to concentrate.\n\nTurns out, she posted what I said (without mention of my name) on her public facebook with the caption \"Things you don't tell your Learning professor:\" I am shocked that she spun what I said, knowing I have a disability and only had a day before my religious observation and had known so since the first day of class.She could have made the exam available beforehand. I am not sure she had finished writing it.\n\nShe also shushed me several times in class when I said the correct answer and it was \"going too far ahead\" (before she got to say it in the slides). I have NEVER in all of my years of school been SHUSHED by a professor. My classmates were appalled, as was I. How are you encouraging learning if you shush your students?\n\nShe also bullied and picked on another student in my class when he did not take a cookie that she gave him, saying \"What's wrong? Are you on a diet?\" and later \"What's wrong now? Would you be in a better mood if you were eating?\"She gave us all grades with no feedback, so none of us know why she gave our particular grades.\n\nI received an A-. I am OK with that (although, now I am not sure if it was bumped down from an A because of her personal agenda/feelings towards me).\n\nI also e-mailed her asking about a particular assignment in which I asked if we have to use our brains and what we have learned in class, or if we just search for random sources on the internet? (because I found the assignment to be so tedious, as did the rest of the class). I feel she was not happy about this question. Retaliation? Not sure.But what I do know is that it is completely inappropriate to post my comment on her public facebook, considering the context and what she knows and twist it and possibly try to embarrass me.\n\nAlso, did I mentioned I found this out through the grapevine? My classmates saw it first and wondered who she was quoting, but since I was away at the religious observation, I missed their original conversation. They put the pieces together and knew it was me.\n\nThe University's code of Conduct states:\n\n**Respect:** The University honors and respects individuality and demonstrates tolerance for the personal beliefs and cultural differences of all individuals. As members of an academic community, we seek to foster a spirit of civility and collegiality through open and honest communication. We strive to protect the health, safety and well-being of all persons. We protect the private and confidential information that is provided by our patients and research participants, faculty, administrators, staff, students, volunteers and others. We value an environment that is free from harassment, intimidation, bullying, incivility, disrespect and violence.\n\n**Professionalism:** The University and its members expect that the professional standards and requirements that are applicable to the academic, research, clinical, engagement\\*,\\* administrative and other professions comprising our community will be followed. We are responsible and accountable for our actions and are expected to make reasonable efforts to comply with all applicable federal, state and local government laws and regulations. As individuals and as an institution, we also strive to follow ethical business practices and to act as good stewards of the resources made available to us.**Civility**\n\n* The University values an environment that promotes a spirit of civility and collegiality, while fostering open and constructive intellectual debate.\n* All members of the University community have a responsibility to treat each other with consideration and respect. Managers and supervisors have an elevated responsibility to demonstrate these behaviors and support their expression in the workplace.\n* Engaging in behaviors that harass, intimidate, bully, threaten or harm another member of the University community does not support a respectful and civil work environment.\n\n**Non-Discrimination**\n\n* The University encourages and respects diversity within the university community and does not allow discrimination on the basis of age, race, national origin, religion, disability, sex, sexual orientation or any other characteristic protected by law in any activity or operation of the institution.\n\n**Harassment**\n\n* The University affirms its dedication to foster a community that condemns all forms of discrimination or acts of intolerance including sexual harassment, intimidation and retaliation.\n\n## Public Engagement and Outreach Standard\n\n* We are respectful of our community members, demonstrate cultural competence in their interactions, and comply with University policies while engaged in and with communities, just as we would on campus.\n\n**Practical Considerations for Public Engagement and Outreach Principles and Standards**\n\n* Have I ensured that the public engagement effort is consistent with the University’s mission and vision?\n* Am I culturally sensitive to the diverse needs of community members and partners, starting with the selection and training of my University team members?\n* How will my actions reflect how the University is viewed in the community?\n* How do I manage, use and share resources of the University in a manner that is respectful to partners?\n* How do I teach and engage my students in the work of the community as they apply classroom learning to real world situations?\n\nI have the picture of the post but I am afraid to share it. I am just not sure what to do, but I feel like this behavior is NOT ok and goes against the code of conduct.Any suggestions?",
        "created_utc": 1533353494,
        "upvote_ratio": ""
    },
    {
        "title": "(in MS Word) Why is there a half inch of space between the last paragraph and the footer and how the fuck do I get rid of it",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94g2zg/in_ms_word_why_is_there_a_half_inch_of_space/",
        "text": "[deleted]",
        "created_utc": 1533353125,
        "upvote_ratio": ""
    },
    {
        "title": "How to hire postdocs and technicians",
        "author": "microMe1_2",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94ctp4/how_to_hire_postdocs_and_technicians/",
        "text": "I'm opening a biology lab fairly soon and I would like to hire a lab technician and a postdoc. It's not that easy because most people don't know my lab exists, though I have just released a website.\n\nDo any of you have any tips for finding good candidates for these positions, or a list of good places to post adverts?",
        "created_utc": 1533325869,
        "upvote_ratio": ""
    },
    {
        "title": "Impending name change for job applications - advice?",
        "author": "musicalgrapes",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94bgol/impending_name_change_for_job_applications_advice/",
        "text": "Thanks in advance for any advice!\n\nI'm currently in the process of applying for positions after finishing graduate school. I'm also getting married in seven weeks, and will be changing my name when married, although legally it will take a few months post wedding (so I'm told). For jobs I'm applying to now, is it \n\na) better to use my married name to avoid the whole \"actually I have one name now but a different name in about a month\"?\n\nb) better to use my maiden name since that's my current legal name and not to misrepresent anything?\n\nIf it matters, all current publications, etc. are in my maiden name, however I will be publishing all upcoming publications in my married name. ",
        "created_utc": 1533316473,
        "upvote_ratio": ""
    },
    {
        "title": "How can I keep research on the cards?",
        "author": "lilgrubbins",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94bg4n/how_can_i_keep_research_on_the_cards/",
        "text": "I'm about to start an MA Social Work in September, I haven't got any formal experience in research but I'm a carer to my best friend, I was there proofreading and helping him with his dissertation and I ended up a bit enamoured with it. \n\nAfter my philosophy BSc I just wanted a solid career path - not to say I chose social work at random, I am passionate about it and I look forward to being a qualified SW. I just can't let go of the idea of being involved some way in research.\n\nI plan to learn R coding with my friend, and see if I can assist with any research projects at my uni so I can get some experience under my belt.\n\nMy question is - is this enough? What can I do to make myself an appealing candidate for research assistant positions? Are there SW positions out there that involve research and data analysis that would be accessible to me with the qualifications and experience listed above? Or should I bite this particular bullet and focus on my SW career?",
        "created_utc": 1533316368,
        "upvote_ratio": ""
    },
    {
        "title": "Do I email again or wait it out :/ ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/94b9a4/do_i_email_again_or_wait_it_out/",
        "text": "[deleted]",
        "created_utc": 1533315133,
        "upvote_ratio": ""
    },
    {
        "title": "How to validate an Index with several dimensions?",
        "author": "sarasustelosantos",
        "url": "https://www.reddit.com/r/AskAcademia/comments/949ve8/how_to_validate_an_index_with_several_dimensions/",
        "text": "My idea was to built an index of customer value with its several dimensions (e.g. service quality, price transparency, etc.) and after applying a survey to more than 200 respondents I used CronBach's Alpha to test for internal reliability of items and of overall index with it's dimensions. How can I validate that I selected the right dimensions (and its items) to compute my Index of Customer Value? I believe it's important to validate it but I am not so sure how to do it, if it's through CFA (?) or a Partial disaggretation approach that I saw in another research. I want to confirm that all items of the dimensions truly represent the corresponding latent construct (Customer Value). How?\n\nThank you in advance, Sara",
        "created_utc": 1533305208,
        "upvote_ratio": ""
    },
    {
        "title": "If you have done any MOOC recently, could you please fill out this survey?",
        "author": "UQBS",
        "url": "https://www.reddit.com/r/AskAcademia/comments/949d6k/if_you_have_done_any_mooc_recently_could_you/",
        "text": "Dear r/AskAcademia community,\n\nMy name is Ruiqi, a researcher from The University of Queensland. My research interests are MOOC, educational technology, and e-learning.\n\nI invite you to participate in a 5-minute survey about the most recent MOOC you enrolled in. Your feedback is very important and will contribute to an improvement in the design of future MOOCs.\n\nTo thank you for your time, you will be given the option to enter a draw to win one of ten $30 Amazon gift cards.\n\nI would really appreciate it if you could help me in this research and take a few minutes to fill out the survey: [http://uqbel.az1.qualtrics.com/jfe/form/SV\\_3CdP6gPzDzYwn77](http://uqbel.az1.qualtrics.com/jfe/form/SV_3CdP6gPzDzYwn77)\n\nIf you know anyone else who has recently studied a MOOC, please feel free to forward it on! It would be a big help! Thanks again!\n\nKind regards,\n\nRuiqi Deng",
        "created_utc": 1533301117,
        "upvote_ratio": ""
    },
    {
        "title": "[deleted by user]",
        "author": "PhDMarkWilson",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9486bh/what_dissertation_writing_services_offer/",
        "text": "[removed]",
        "created_utc": 1533289011,
        "upvote_ratio": ""
    },
    {
        "title": "Berkeley Transfer advice as a CC student for EECS",
        "author": "throwawayUCBerkely01",
        "url": "https://www.reddit.com/r/AskAcademia/comments/947wp0/berkeley_transfer_advice_as_a_cc_student_for_eecs/",
        "text": "Basically, I am starting community college in the fall, and am torn between Psychology and Computer Science, however they seem to be mutually exclusive in terms of course work to take at my Community College in preparation for transfer, I have not yet signed up for classes, and feel as if I select a Psych centric schedule, or CS one it will exclude or reduce my chances of getting into the other. Additionally, I was wondering what the transfer process would be like for Berkeley, with regards to them having L&amp;S and EECS respectively, if I were to transfer would I need to apply to one of these directly? Would I need to apply to Berkeley for general admittance and then petition into one of those marginally? And also if I were to go for Psychology and have a change of heart, I had heard that if admitted to L&amp;S as a transfer, you are not allowed to petition into the EECS department and therefor can only get a BA in Computer Science as opposed to a BS.\n(sorry for the rambling and poor structure/formatting I'm not a native English speaker and I'm very tired, but any advice is greatly appreciated!)\nalso I know my name is misspelled lol sorry \n\nTLDR;\n\n- concerned about my first semester schedule at a junior college\n\n- wondering how the Berkeley transfer application works (Apply to Berkeley L&amp;S then petition into EECS? Apply to EECSDirectly?)\n\n- if admitted to L&amp;S for Psychology is it possible to change my major? Is it possible to get into EECS later? Would I be able to change my major from Psych to CS? And if so\nwould I be able to get a BS, or would I be restricted to a BA? Or would I not even be able to get a BA?",
        "created_utc": 1533285748,
        "upvote_ratio": ""
    },
    {
        "title": "Will my Masters degree increase my chances of being rejected for PhD?",
        "author": "sheeku",
        "url": "https://www.reddit.com/r/AskAcademia/comments/946l0o/will_my_masters_degree_increase_my_chances_of/",
        "text": "I did my Masters six years ago. Due to poor guidance and supervision, I was told much later after I graduated that the topic of my thesis (health promotion) was not in line with the field (health systems management). I have  god work experience in health systems now, but I am worried about my masters degree thesis. I see one of the requirements applying for a PhD in Europe (I am applying to a university in Belgium) is to read and gauge Masters thesis before admitting students for their doctoral programs. I am worried I will be rejected once they see my Masters work. What should I do? Should I get a second Masters before proceeding to PhD? How can I handle this?",
        "created_utc": 1533270936,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on pursuing a career as an English professor",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/945hiq/advice_on_pursuing_a_career_as_an_english/",
        "text": "For what it’s worth, teaching at the university level has been a dream of mine since I was a kid. Both parents were lecturers. I want to be the first in my family to get a doctorate. \n\nI’m starting my first year in an MFA program this fall. I have received full funding and a fellowship and I am 24. So far only minor publications but I’ve had a lot of support from professors who are prominent in the field of both English lit and creative writing. My undergrad and grad school have good programs but are not top 10. My teaching load has been reduced with my fellowship so I plan on joining as many clubs or organizations as I can along with volunteering in my community. I realize that the likelihood of my ability to become a professor will come from getting a PhD in a top tier school and I want to do everything in my power to get into one. I’m not opposed to relocating anywhere. \n\nI made valuable relationships with professors in my undergrad and I plan to be just as active in grad school. I know my MFA is the highest degree for creative writing, but I have ideas and plans for English lit research as well. I’m hoping this can broaden my chances. \n\nMy main concern is that I’m disadvantaged due to my program’s ranking. What extra steps can I take to increase the likelihood of being accepted into a top tier program for my PhD? Will organizations and volunteering be enough, along with publications and research? I have had professors who haven’t come from top tier schools, and I would honestly be fine working at a university that isn’t prestigious, I just want to have greater chances of landing a position at all since the field is so competitive right now. If I transition straight from MFA to PhD I’ll be done in seven years at the least. Are there chances it could be “easier” then? I’ve heard nothing but bleak things about trying to become an English professor. I have some external teaching experience and I love it. I love writing and researching as well. I know it’s something I wouldn’t regret putting a lot of work into, I just want to maximize my chances for success. \n\nAlso, if I can’t make it as a professor off the bat, could I fall back teaching at a high school or community college? I wouldn’t be opposed to that either. \n\nI just really want to teach. ",
        "created_utc": 1533261393,
        "upvote_ratio": ""
    },
    {
        "title": "Help with CV",
        "author": "GeneralLeeFrank",
        "url": "https://www.reddit.com/r/AskAcademia/comments/945bdm/help_with_cv/",
        "text": "I recently graduated with an MA in Public History. I was thinking of going out of academia but I haven't been able to find any public history jobs. I've seen adjunct positions open up recently for this Fall. I feel like my CV is awful and underwhelming. It comes out to maybe a little over a page, even with a Volunteer section.\n\nMost of my experience is as a TA. Should I list each class I TA'd for? Or would that be too much fluff. I don't have any awards or honors even though I was an A/B student.  \n",
        "created_utc": 1533259964,
        "upvote_ratio": ""
    },
    {
        "title": "Adviser moving -- any advice would be great",
        "author": "anyadviceishelpful",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9451os/adviser_moving_any_advice_would_be_great/",
        "text": "Hello all,\nI am beginning a PhD program in psychology this Fall and am very excited. However, today I found out that my mentor is accepting a position at a new university this Spring. This place is about an hour away and instead of being in the psychology department they will be in the linguistics department (currently they have a joint appointment and students in each department). I’m at a bit of a crossroads, here are the options as I see them:\n1.\tStay here. This is what it sounds like my mentor wants me to do. Their idea to all graduate students (5 total) was that we continue our work here, get co-advised by her at her new institution, and get co-advised by someone at our current institution. I am very apprehensive about this, as no other faculty is doing work I find that interesting. No one in psychology is even doing work similar to my mentor’s. Additionally, they are the entire reason I wanted to attend this university.\n2.\tTransfer with them. This seems unlikely, as the institution they are moving to is far better than our current one (no offence, I like my school!). I would not be able to follow them to the linguistics department as I don’t have the background and want to keep my work more in psychology. I could try to transfer to the psychology department and be co-advised with my current mentor.\n3.\tTransfer somewhere else. Probably at the end of my second year and obtain a Master’s from current university. A friend suggested this, that I start emailing professors soon or this Spring and try to explain to my current adviser why I am doing this.\n\nDo you see any options I don’t see? I know I am pretty lucky as this is coming to me before getting heavily involved in any research. What would you do in my situation or have you seen any similar things happen?\n",
        "created_utc": 1533257683,
        "upvote_ratio": ""
    },
    {
        "title": "Productive, better writer tips?",
        "author": "Whynoshush",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9450ya/productive_better_writer_tips/",
        "text": "Hi all, \n\nI am looking for help on the following:\n\n1) resources and tips for clearer logic and outlining of science journal papers\n2) developing a daily writing practice\n3) ways to carve out truly uninterrupted writing time\n\nAdditional ideas, including time management 'hacks', are greatly appreciated!\n\nPlease and thanks for any help!",
        "created_utc": 1533257507,
        "upvote_ratio": ""
    },
    {
        "title": "Bringing original ideas into a new project / Side projects",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/944dsu/bringing_original_ideas_into_a_new_project_side/",
        "text": "[deleted]",
        "created_utc": 1533252312,
        "upvote_ratio": ""
    },
    {
        "title": "How to build a good profile for a position in academia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/943zmn/how_to_build_a_good_profile_for_a_position_in/",
        "text": "[deleted]",
        "created_utc": 1533249291,
        "upvote_ratio": ""
    },
    {
        "title": "Defended PhD but still a student",
        "author": "anonymouse192938471",
        "url": "https://www.reddit.com/r/AskAcademia/comments/943zim/defended_phd_but_still_a_student/",
        "text": "Ok, I'm in an unusual situation and just wanted to see if anyone has some input...\n\nI defended my PhD in June (biochem), and have been looking for jobs (mostly industry, some academic postdocs) since February.  At my university, we get one extra month of being paid past the defense date to finish up thesis revisions.  I've been really struggling to find a job due to not having any published papers (we submitted one, got reviews, working on revisions, but it's not published yet).  My adviser and I managed to get an extra month of support to finish up thesis and paper revisions while I keep looking for jobs, since I'm independently funded.   So I'll be paid until the end of August.\n\nMy adviser insists that getting a paper published will be my only way to find a job, but she isn't actively working on the paper revisions with me...  and now she's suggesting asking for an extension until December, which means that I'd have to register for the fall semester (for \"dissertation\") in order to keep my fellowship going.  I have savings, but would rather not be unemployed! Especially since I rent and don't have family to stay with in the area. Also, I will lose my health insurance as soon as I'm not a student anymore.\n\nSide note for the below:  I've been shying away from academic postdocs because too many people get stuck in very long postdocs in my field... If I do an academic postdoc, the plan is to do 1-2 years and then continue on.\n\n*Option 1:* There is a new (but established/tenured) faculty member starting at my current university next month who is looking for postdocs; her research is similar to mine.  I'm not crazy about staying in my current city, but I applied.  I'm planning on telling her honestly about my situation, that I'd be looking for something more short term while I keep applying for jobs.  Ideally, it could be a chance to learn a new skill or something for a few months while I wrap up my papers, help her get things rolling after her move, etc., if she's ok with that.\n\n*Option 2:* High-Profile Lab in Far Away City may take me as a postdoc, contingent upon funding, and would like me to apply for fellowships.  But the PI is in no hurry, answers my emails every couple weeks, and the project he mentioned, even though it sounds really interesting, seems high-risk to me: it's part 'fishing' project and part a molecular tools project.   I'm a little leery about this; one of my PhD projects was a fishing project and that's why I don't have a paper from it.\n\n*Option 3:*  Register and continue being a student, keep applying for jobs.  I'd continue to get paid from my own funding, but there's really no work to do in lab.... nothing that would give a useful result(paper) within a few months.   I'm itching for something new to work on!\n\nI don't know what to do!  Any input would be appreciated!",
        "created_utc": 1533249271,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Help｜How to get company managers respond to my questionnaire?",
        "author": "joybry7",
        "url": "https://www.reddit.com/r/AskAcademia/comments/943ylb/seeking_helphow_to_get_company_managers_respond/",
        "text": "**What I've tried:**\n\nI tried making phone calls but always transfer to voice mail and I don't get a chance to persuade them.\n\nI also tried to contact them through LinkedIn by sending an invitation (not saying filling questionnaire directly) but none responded me.\n\nI sent emails but only got one responds. I am so grateful to that person!!!\n\n**My current situation:**\n\nI need managers of small and medium companies in the UK helping me to fill out a questionnaire (about 3 mins). I chose this master dissertation topic because I thought it could have practice value but overlook the difficulties of collecting data.  I am desperate but don't wanna give up for now.\n\n**If anyone could help?**\n\nCould anyone please give me some useful tips on getting responds from people working in the UK?\n\nMany thanks in advance!",
        "created_utc": 1533249083,
        "upvote_ratio": ""
    },
    {
        "title": "Non-residency fellowships for the humanities?",
        "author": "jake0809",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9422hp/nonresidency_fellowships_for_the_humanities/",
        "text": "I'm a rising 3rd-year PhD in the humanities thinking a bit ahead about looking for external funding for my 4th year, which is when working on my dissertation research is my only obligation. I'd prefer to have the option to travel (my partner will likely be 8,000 miles away, and I'd be far happier and more productive if I can go with him), and I don't need to be able to access any particular archives or go to any particular cities in order to do my work. My materials are readily available. \n\nCan anyone recommend any resources for finding fellowships/funding opportunities that don't have a residency requirement? ",
        "created_utc": 1533235923,
        "upvote_ratio": ""
    },
    {
        "title": "My PhD supervisor is negligent, and it's only hurting him",
        "author": "retinal91",
        "url": "https://www.reddit.com/r/AskAcademia/comments/940xdx/my_phd_supervisor_is_negligent_and_its_only/",
        "text": "I'm a senior PhD student in the sciences who's about to defend. When I started, my supervisor was sort of famous in the field, we had a MASSIVE start-up grant, and everyone could pursue the projects they wanted, and go to all the conferences they wanted to go to, etc.\n\nSomething I noticed from the beginning was that my supervisor didn't seem to have a specific direction in mind for his research, and wasn't very involved in our projects (not even coming up with them). Everyone just did what they wanted. He just sort of did his own thing and waited for manuscript...\n\nFast forward to my senior years:\n\nMost of the money has basically been pissed away, and getting standard grants is proving to be quite difficult for the lab. The reality is that his minimal involvement has caused us to just prioritize our own careers over actually doing research that may take this lab somewhere. Most PhD students/postdocs don't even care to finish their projects at a publishable level and just apply for industry jobs. No one seems to give a shit. Some don't even finish their degree, because they got some really good industry offer.\n\nI published/am publishing most of my work and got our lab a small grant, but it's not really anything earth shattering that alone can get this lab the major grant it needs to survive. Nevertheless, my boss seems very happy with me. He wrote me a great reference letter for the postdoc position I wanted, and I got it! I have nothing to complain about, but I feel guilty for some reason about just leaving all this chaos behind...\n\ntl;dr: PI not involved in research. Lab is starting to collapse. I got what I wanted from my PhD, but feel guilty leaving the lab behind in such a bad state.\n\nHas anyone been in such an environment? What happens to groups like this? Should I do something?",
        "created_utc": 1533228355,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true that it is harder to get PhD funding in the UK compared to US/EU?",
        "author": "Remphorapp",
        "url": "https://www.reddit.com/r/AskAcademia/comments/9404bg/is_it_true_that_it_is_harder_to_get_phd_funding/",
        "text": "Somebody in another thread said that it was way harder to get funding in the UK compared to the EU (and I suppose to the US then as well): https://www.reddit.com/r/AskAcademia/comments/93yz5h/advice_needed_on_the_possibility_to_get_a_phd/e3h2fc2\n\nI have never heard this before, is this true? ",
        "created_utc": 1533222815,
        "upvote_ratio": ""
    },
    {
        "title": "Got tenure track but now burnt out",
        "author": "markyask",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93zqfi/got_tenure_track_but_now_burnt_out/",
        "text": "After about 8 years on the postdoctoral/fellowship circuit, I finally got tenure track last academic year. In the UK, tenure is a bit more of a standard route from tenure-track (in truth we don't have tenure track in the same sense as the US system). So for all intents and purposes, this should be good. \n\nHowever, what I found was that somewhere between Years 6-8 of my post-PhD circuit, I was running on fumes. The last year, with the new position and the increased stability, it was like someone told me that I could now stop running. I bought a house, bought a pet, and bought a toaster (those of you who know what it's like to constantly move from place-to-place will understand). \n\nBut now I am truly burnt out. I find it difficult to focus on work, I find my life being split a million different directions. It's like those past 15 years after graduating from school and working so hard and sacrificing so much---have come back to haunt me. Like that child in our minds that we've all suppressed for the sake of our jobs is finally back and banging constantly on the front door.\n\nWhat do I do? How do I regain that edge that I once possessed?",
        "created_utc": 1533220073,
        "upvote_ratio": ""
    },
    {
        "title": "I am just starting my masters in history and am looking into how to make myself the best possible candidate for a PhD program. Can masters students publish in academic journals? What can I do to make my myself a good PhD candidate (besides great grades and a stellar GRE score)?",
        "author": "bethanyrains",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93zp8g/i_am_just_starting_my_masters_in_history_and_am/",
        "text": "I am just starting my master’s degree in history and am looking into how to make myself the best possible candidate for a PhD program. Can masters students publish in academic journals? what can I do to make myself a good PhD candidate (besides great grades and a stellar GRE score)? I’m doing UMass Boston’s online MA in history, so I can’t see my professors or fellow students face to face. Ideas/suggestions?",
        "created_utc": 1533219828,
        "upvote_ratio": ""
    },
    {
        "title": "How to keep track of multiple journals?",
        "author": "bill_lite",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93zehm/how_to_keep_track_of_multiple_journals/",
        "text": " Hey  guys, I've recently started a veterinary pathology residency. A portion  of my board exams will come from recent publications from a list of \\~10  journals. What is your favorite method for keeping track of multiple  journals in your field?\n\nI tried using  Feedly to set up RSS feeds from the journals I need, but only about half  of them have RSS feeds... that I could find at least.\n\nI'm  looking for something like a daily or weekly digest that at least  mentions the high points so that I know there might be something I  should go and read.\n\nAn even more  sophisticated and desirable tool would be one that curates only review  articles from a list of defined journals....but that might be asking too  much. Thanks in advance!\n\nDON'T PANIC.",
        "created_utc": 1533217588,
        "upvote_ratio": ""
    },
    {
        "title": "Advice needed on the possibility to get a PhD position in Europe (UK preferably)",
        "author": "fadhliI",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93yz5h/advice_needed_on_the_possibility_to_get_a_phd/",
        "text": "Hi guys,\n\nI hold a CS master degree from a university in UK. My undergraduate degree is from a Malaysian university in mechanical engineering. I am interested in pursuing PhD in machine learning. \n\nThe reason why I am looking for a place in Europe (UK preferably) is that my wife is currently doing her PhD in UK. I am currently working as a junior data scientist in Malaysia but am thinking of pursuing PhD.\n\nThe current situation is that my master degree result is not that good. I only obtained a pass. Not merit or distinction. I would like some advice on whether I can potentially land a PhD position.\n\nI was also thinking of doing a research internship at a university. But I don't really know whether a university will take me as an intern as I am not a student anymore.\n\nAny advice will be really appreciated.",
        "created_utc": 1533214115,
        "upvote_ratio": ""
    },
    {
        "title": "What does it mean when your paper goes to an 'additional reviewer'?",
        "author": "llosa",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93xhza/what_does_it_mean_when_your_paper_goes_to_an/",
        "text": "I'm in a field where two reviewers are standard, and I've just been told that the current responses necessitate a third reviewer. Does this mean both reviewers rejected the paper, or that they disagree - any experiences would be welcome. ",
        "created_utc": 1533198514,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on choosing a major for a foreign high school senior dedicated to pursuing a career in US/Canadian academia?",
        "author": "BlizzardWake",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93x6e6/advice_on_choosing_a_major_for_a_foreign_high/",
        "text": "Hi. I'm about to be a high school senior and becoming a professor at a US/Canadian university has been my dream for as long as I can remember. The thing is, I'm a Chinese national and as I spent my childhood in the US witnessing my dad(holds two PhDs in Physics and Engineering) doing post-docs for eight years without getting a tenured position, I know this is no easy task for foreigners and the odds depend heavily on my choice of major. \n\nWith my current grades, I'm pretty sure I will attend a top 5 Chinese university for undergrad(not that good globally). Right now I'm a sciences major in high school(in China you are either a liberal arts or sciences major in high school and most people choose sciences) and my math is ok, but I'm actually more interested in liberal arts and the social sciences. To be honest I would love to major in English but then the prospects of me becoming a English professor in the West is probably zero. So my parents think majoring in Finance would be perfect for me, as they say the majority of Finance majors want to go into industry leaving academia positions much easier to find, plus the pay is best (I don't care that much about pay though), but I'm not that interested in it. I'm more inclined towards Economics, but I've heard the undergrad program doesn't learn much \"useful\" stuff, it's way harder to find an academic job and that Finance is pretty similar to it after all. Other majors that I am interested in are psychology and neuroscience (maybe law? but I really don't want to become a lawyer) but those I've heard are even harder roads. \n\nI've looked around this sub and it seems that my career considerations may be a bit early, but I really don't have much interest in doing anything else, especially industry. I would be grateful for any kind of advice to help me with my dilemma, thank you! ",
        "created_utc": 1533194578,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some schools don't do internal hires",
        "author": "BlackSheepGradd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93wbh6/why_do_some_schools_dont_do_internal_hires/",
        "text": "I recently went to a networking event hosted by my program and when someone asked for advice on applying for PhD, the program director suggested that we don't go for it since there are no teaching jobs. Was that an insult or just reality? My school just recently hired a new professor fresh out of PhD who went up against candidates that have taught/are teaching in the program as part-time. Does this mean the new prof have better connections?",
        "created_utc": 1533185349,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have experience in graduate admissions to Japanese Literature/EALC PhD programs in the US?",
        "author": "if_and_only_if",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93vdoe/anyone_have_experience_in_graduate_admissions_to/",
        "text": "I have some simple questions to ask about graduate admissions to Japanese Lit programs in schools in the US. It's a pretty small field, so chances are slim but I figured I'd reach out.\n\nEDIT: Figure I should elucidate more in my post lol sorry about that. I mainly have questions about the best way to demonstrate an attractive level of fluency in the language for entry to the program, because as it stands I may only be able to finish up through second year Japanese language study at my university before they force me to graduate, when most programs demand at least a 3rd year level for entry. If I were to study outside of my university career to that level, what would programs consider the best kind of experience?\n\nA proficiency exam? Would studying language in Japan during that time period make me the most sellable to programs?",
        "created_utc": 1533176758,
        "upvote_ratio": ""
    },
    {
        "title": "What's your advice for first-time teaching assistants",
        "author": "BlackSheepGradd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93v9l0/whats_your_advice_for_firsttime_teaching/",
        "text": "I'll be starting my first TA position for an Undergrad course and am very nervous about it as I am only a few years older than them. What is it like to teach for the first time? Any classroom management advice? How do you teach stuff related to professor's course? How can I act as if I know things even though I probably don't????",
        "created_utc": 1533175526,
        "upvote_ratio": ""
    },
    {
        "title": "Candidate here, hopefully defending in May. How should I approach applying for postdoc positions if I already know that I might only be in the position for 6-12 months?",
        "author": "EarthSciStudent",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93uj8b/candidate_here_hopefully_defending_in_may_how/",
        "text": "As my user name might suggest, I am in the earth sciences, currently staring down my final academic year in my PhD. program should all things go according to plan.\n\nI am starting to look for postdoc opportunities now that I'm getting close to finishing. However, the ultimate direction that I plan to move towards is science advising for policy. I've had a strong interest in environmental policy for a while now (although my research is very much basic research at the moment). Consequently, my first choice for post-graduation plans is to apply for a number of policy-focused fellowships for holders of STEM PhDs (AAAS, among others).\n\nThe issue I'm now wondering about is this:\n\n* I will become eligible to apply to most of these fellowships only upon earning my doctoral degree, likely in May 2019.\n* Most of these fellowships will not begin accepting applications until Fall 2019, and the fellowship periods will not begin until early or mid 2020.\n* As a result, assuming that I take another position immediately after graduating, I will be uncertain from the start about how long I will be in that position. Depending on which fellowship, if any, selects me as a fellow, I might be, say, a postdoc in said lab for an indeterminate period ranging between 6-12 months.\n\nOverall, I'm not even particularly set on doing a postdoc per se (again, my long-term goals don't involve a research career), but it would be helpful for these fellowship applications to maintain a strong research record after graduating, so I'm willing to pursue them seriously in order to be a strong fellowship candidate down the road. For the record, I would also be open to working in a gov't agency as a scientist (or other role) after graduating.\n\nMy question is, how should I handle this situation when applying for postdocs and reaching out to potential PIs? I'd like to be honest about my future plans, but I am curious about whether this might affect my chances. How should I take this possibility of having to leave a lab at an indeterminate time into consideration if I'm thinking about applying for grants?\n\nCan you think of any other considerations that I've missed? Appreciate whatever thoughts you might have!\n\nMany thanks!",
        "created_utc": 1533169022,
        "upvote_ratio": ""
    },
    {
        "title": "How should I approach my professors about writing graduate school recommendation letters?",
        "author": "sydazzles",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93ubuj/how_should_i_approach_my_professors_about_writing/",
        "text": "I am an undergraduate studying student chemistry and will be graduating in December. I am in the process of applying to PhD programs starting in Fall 2019. I do research for two professors who have written recommendation letters for me for scholarships and grants, so I assume they will write letters for me if I ask. The third prof is one I don’t know quite as well but think he will write me a letter too if I ask. \n\nNow, how is the best way to ask? Is it too informal to shoot them an email? If I meet them during office hours, is any conversation necessary other than “would you be willing to write me a recommendation letter”? Is it necessary to talk about the kind of research I want to go into or the specifics of the programs I’m trying to get into? I want to be as tactful and respectful as possible. \n\nThe deadlines for these letters start on December 1, so I have a while to ask but would rather talk to them before the busy semester starts. Any advice for me?",
        "created_utc": 1533167343,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone ELI5 intertextuality?",
        "author": "tencupsoftea",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93tuoe/can_someone_eli5_intertextuality/",
        "text": "It's doing my head trying to get my head around it and I'm trying to figure out if what I'm observing in my data is intertextuality or something else entirely.\n\nWhat I'm observing is people referring to other people's posts on a website. Sometimes they copy the exact text but more often than not they are just aligning with or differentiating their post from other posts.\n\nFor example: \"As I can see in some of the other posts here....\" Or \"Unlike what the other posters are saying\".\n\nIt is important to add that these are not conversational (it's not a discussion board or a social media website) and they aren't linked in any way to the posts they are referring to. They just exist on the same webpage and anyone can add a post.  ",
        "created_utc": 1533163555,
        "upvote_ratio": ""
    },
    {
        "title": "How do I address faculty in a grad school application letter?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93tm2n/how_do_i_address_faculty_in_a_grad_school/",
        "text": "[deleted]",
        "created_utc": 1533161750,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone done a PhD or Masters “by distance”? I’m trying to put what I may want to do in the future into perspective.",
        "author": "PuppyLand95",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93t33b/has_anyone_done_a_phd_or_masters_by_distance_im/",
        "text": "I’m interested in physics and the philosophy of physics. I’m currently an undergraduate studying computer science and physics. I’m not too interested in computer science; it is mainly my back up. I am considering going to graduate school for physics or philosophy of physics, but the more I’ve been thinking about it I may not want to work in academia. A possible plan for me is to work in software and do a part-time masters/PhD in something that I’m interested in. One issue with physics is that there aren’t many “part-time” physics graduate programs. But, it may turn out that I’m more interested in philosophy of physics/science in which I would have a lot more options open to me in terms of part-time study. Has anyone done something similar? I’m mainly afraid of the lifestyle that comes with working in academia. But, I don’t know what it’s like. For those of you in academia, how is the income and lifestyle? Would I have a chance at becoming a philosophy professor if I were to pursue it full time? I’m not so interested in becoming a professor necessarily, I’m just interested in learning. But it may turn out that I don’t like software development, and would be happier working in academia. I’m not aiming to be rich, but I would like to be financially secure. ",
        "created_utc": 1533158011,
        "upvote_ratio": ""
    },
    {
        "title": "How do i get into a good university in Canada if i did poorly in high school?",
        "author": "Tiskin1024",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93swkw/how_do_i_get_into_a_good_university_in_canada_if/",
        "text": "I slacked and skipped all the time. Just graduated with bare minimums. Im now starting to upgrade at the age 21 and I'm actually pretty smart and getting good grades. I plan to go for CS and would die for a chance to go to waterloo. Is there any possible way i could make that happen?",
        "created_utc": 1533156800,
        "upvote_ratio": ""
    },
    {
        "title": "MBA vs MFin (or some variation)? Humanities B.A. debating the next step",
        "author": "throwawayforreddit02",
        "url": "https://www.reddit.com/r/GradSchool/comments/93sgxu/mba_vs_mfin_or_some_variation_humanities_ba/",
        "text": "",
        "created_utc": 1533154606,
        "upvote_ratio": ""
    },
    {
        "title": "How to deal with moving to a new place?",
        "author": "Astro_Biscuit",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93sb3t/how_to_deal_with_moving_to_a_new_place/",
        "text": "I've just got my PhD and moved across the country to start a postdoc job, yay!! I'm really looking forward to the work but I'm a bit scared about the whole life changing process. Maybe I'm just stressed out because I moved today, but I've got a few days before my job starts and I have no idea what to do with myself! \n\nWhat do you do when you have just moved to a new place? Any tips for settling in? I'm lodging in a shared house but haven't met the other people yet, any advice for making new friends?",
        "created_utc": 1533152839,
        "upvote_ratio": ""
    },
    {
        "title": "Help me to get acceptance from a university as international student",
        "author": "rorrz",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93ra7k/help_me_to_get_acceptance_from_a_university_as/",
        "text": "[removed]",
        "created_utc": 1533146047,
        "upvote_ratio": ""
    },
    {
        "title": "Second try. What is the minimum amount of time YOU would need to prepare for YOUR teaching schedule?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93qh6k/second_try_what_is_the_minimum_amount_of_time_you/",
        "text": "[deleted]",
        "created_utc": 1533140820,
        "upvote_ratio": ""
    },
    {
        "title": "Authors on publications and posters",
        "author": "annbrie",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93p7gb/authors_on_publications_and_posters/",
        "text": "Hi all,\n\nI recently participated in a summer research project involving RNA sequencing for lung disease patients. The project had 3 parts; creating a web tool for data analysis, analyzing differentially expressed genes, and designing a course to teach undergraduate RNA-seq. I am the only one who did anything regarding implentation of the course, and did the brunt of the work for data analysis.\n\nThere is a high schooler working on this project (because she is neighbors with the PI) who did not do anything except come to the office and read her own books. My mentor is insisting she be an author on the publication and posters. She did not intellectually contribute to this project and I have an issue with that. I also do not see why I have to put the names of the other people who \"worked\" on this project as well, because they did not offer any intellectual contributions.\n\nWhat would you do?",
        "created_utc": 1533132099,
        "upvote_ratio": ""
    },
    {
        "title": "Self-learning Matlab and Python",
        "author": "khaleesi_onthatbeat",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93p3w3/selflearning_matlab_and_python/",
        "text": "Hey folks, I'm graduating in a year and I'm intending to apply for masters' course in Neuroscience (i'm interested in Neurolinguistics/Neuroscience of Language)  and my courses don't give me the opportunity to learn any type of computational or statistical stuff but I know that this is really important and necessary background if i want to apply for even a basic research assistant position to get more relevant experience. \n\nAny suggestions on programs, online resources, books, youtube series, anything ~~ to help me teach myself? \n\nthanks in advance. ",
        "created_utc": 1533131354,
        "upvote_ratio": ""
    },
    {
        "title": "In-state tuition rules",
        "author": "windhook12",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93os62/instate_tuition_rules/",
        "text": "[removed]",
        "created_utc": 1533128725,
        "upvote_ratio": ""
    },
    {
        "title": "Help+advice needed for a Master's student moving abroad for the first time to study",
        "author": "KanekiFriedChicken",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93o0l8/helpadvice_needed_for_a_masters_student_moving/",
        "text": "Hiya! (Scroll down for the TLDR). So I'm about to start my Master's degree in Physics. A bit more context - I didn't do v great in my undergrad as far as grades went; I'm in first division so I graduated with honors but I'm not in the top 10 of my class, and my Uni isn't that great for the sciences (although it is in the top Unis for science in the country, it doesn't hold a candle ranking or research wise to even the top 100 in the field). I got into a good Uni for Master's mainly because of my recommendations - I got glowing letters because of an Astrophysics internship that I successfully completed and a professor whose courses and labs I did well in. One of the things I wanted to ask was this - How much would my undergrad grades drag me down in the future? If I did well in my Masters (which I plan to, having learnt from my mistakes and having done well in my final year) could it help overcome those undergrad grades? I'm planning to continue until a PhD (if I can do justice to my Masters) and eventually pursue research in an institution (pertaining to particle physics). \nSecondly, what steps should I take to ensure I have a successful and productive Masters? for e.g. how to network with professors properly etc. What mistakes/missteps have you seen Masters students (or students in general) make that could be easily avoided? And what advice would you have for someone who wants to make it in academia/research? (I asked this in the first place because of all the academia horror stories I hear of on this sub, and have heard in first person from acquaintances pursuing their PhDs).\n TLDR - Didn't do too well in my UG grades wise but got into a good Masters because of glowing references. How possible is it that my grades will come back to bite me in the future? Also what advice would you give for someone about to start Masters, and what are some mistakes/common pitfalls to avoid? Thanks a lot everyone. :)",
        "created_utc": 1533121732,
        "upvote_ratio": ""
    },
    {
        "title": "Why do professors do this?",
        "author": "peregrin5",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93mzfi/why_do_professors_do_this/",
        "text": "I am a student and I also work on campus. Though it's my second degree I only finished my first year in my new degree and am pretty green in this area.\n\nPart of my job is giving tours of our maker space and explaining things to people. I've given tours to children, adults, students, professors, alike. \n\nAnyway today an older gentleman came in and was obviously looking around. A coworker directed me to see if I could help him. The man asked for a tour. I tried to be discerning in his level of expertise as I always am so I don't assume ignorance nor assume expertise. The questions he asked seemed to indicate that most of this stuff he was unaware of.\n\nAfter he leaves my coworker tells me to Google his name; apparently he is one of those billed as \"the father of _____\" with degrees from MIT, might as well be a Nobel prize winner.\n\nAnyway now I'm freaking out worrying that I over explained things that were probably obvious to him. According to my coworker this gentleman likes to feign ignorance and that was why he directed me to help him because he didn't want to deal with that.\n\nHe introduced himself with his name and it didn't ring a bell to me and he said everyone calls him by his first name so I did as well. I could have misheard but I thought I heard him say something along the lines of \"everyone calls me by my first name but you will be the exception\" at the end of our tour making me worry that maybe he was mad that I called him by his first name.\n\nRegardless it seemed that the entire exercise of his visit was to set me up for failure. Why pretend to be ignorant so that I misinterpret his knowledge level? Why introduce himself with his first name and then get mad when I use it? Is this a power play kind of thing?\n\nEDIT: Thanks guys! I really hope I'm just blowing things out of proportion. I tend to have cycling manic thoughts right before bed and it usually culminates in a frantic Reddit post just so I can get it out of my head. I need to be told by someone that I'm overreacting sometimes.",
        "created_utc": 1533109892,
        "upvote_ratio": ""
    },
    {
        "title": "Do y’all think I should get the loan?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/personalfinance/comments/93jtqk/should_i_get_a_student_loan/",
        "text": "[deleted]",
        "created_utc": 1533098048,
        "upvote_ratio": ""
    },
    {
        "title": "How To Get Over Undergrad GPA?",
        "author": "superpancreas",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93l9bn/how_to_get_over_undergrad_gpa/",
        "text": "So I graduated with a Math degree and a horrible GPA in a top 50 University. It was like 2.75 or something, I don't even remember. I got a job in a lab and department that are leaders in their field, and worked my way up to be fully employed as a research specialist. On the way, I met a lot of amazing researchers, and managed to get myself on a handful of papers, including ones published in Science and Nature. My current position has me doing research both independent and collaborative. I love research. I might not have been good at school, but I'm pretty good at research and people are always telling me I should pursue a higher degree.\n\nAnd I want to. A masters at least. But I have that GPA haunting me, and I don't really know how to get around it. Every time I get excited about going to grad school to study a topic, I'm always hit with that minimum GPA requirement.\n\nIs there some way I can get into grad school? Some type of program that allows me to raise my GPA or something? Other than getting another undergrad degree which I do not have the time, money, or desire to do.",
        "created_utc": 1533093063,
        "upvote_ratio": ""
    },
    {
        "title": "All Academics and PhD students- please take part in my survey about impostor syndrome",
        "author": "patwodka",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93j5f3/all_academics_and_phd_students_please_take_part/",
        "text": "[removed]",
        "created_utc": 1533076196,
        "upvote_ratio": ""
    },
    {
        "title": "Dear Academics and PhD students-please take part in my survey about impostor syndrome",
        "author": "patwodka",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93j1ba/dear_academics_and_phd_studentsplease_take_part/",
        "text": "Dear all,\n\nI am looking for volunteers to take part in my research investigating the relationship between Impostor syndrome and learned helplessness. I am recruiting Academics ( Research Assistant, Research Fellow, Senior Research Fellow, Teaching Fellow, Senior Teaching Fellow, Lecturer, Senior Lecturer, Reader, Professor or equivalent roles ) and PhD students from all the universities.I will appreciate so much if you could spare 15 minutes of your time to help me in my study, All answers are completely anonymous and confidential and WILL NOT be shared with anyone else.To take part please follow the link to my online survey below. \n\n[https://ltu.onlinesurveys.ac.uk/relationship-between-impostor-phenomenon-and-learned-help-7](https://ltu.onlinesurveys.ac.uk/relationship-between-impostor-phenomenon-and-learned-help-7)\n\nThank you in advance for your contribution!Kindest regards,Patrycja",
        "created_utc": 1533075363,
        "upvote_ratio": ""
    },
    {
        "title": "[Mini rant] What is the minimum amount of time you need to prepare for a new semester worth of classes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93j0oi/mini_rant_what_is_the_minimum_amount_of_time_you/",
        "text": "[deleted]",
        "created_utc": 1533075240,
        "upvote_ratio": ""
    },
    {
        "title": "How commonly do conferences have drastically different fees for international vs. local participants, and why?",
        "author": "AstraGlacialia",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93iya4/how_commonly_do_conferences_have_drastically/",
        "text": "I was looking into a conference and discovered that it has very different fees for international and local participants - e.g., the early registration fee for students from abroad was 80% higher than for students from the same country (I don't know if they count the participant's citizenship or their institution or whoever pays). No accommodation included, no mention of anything extra included for international participants. \n\nThis difference, as well as all the fees being higher than expected and some other things, angered my advisor into cancelling his talk and instructing me not to apply. I am fine with that, just for the future wondering why such a difference, how that works and if or how it can be fair - or if we generally should boycott such conferences. \n\nFor the other conferences I have participated in or considered, including conferences in that same country, the fees weren't dependent on the country of origin or the difference was very small, just because of taxes; I couldn't find any applicable taxes that'd add up to anywhere near 80% (maybe 20%). It isn't a poor developing country, and the local graduate students typically have livable stipends and conference budgets. The official language of the conference is English so not likely that they provide interpreters.",
        "created_utc": 1533074745,
        "upvote_ratio": ""
    },
    {
        "title": "Where to Find Academic Jobs",
        "author": "DistinctTrouble",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93im1v/where_to_find_academic_jobs/",
        "text": "[removed]",
        "created_utc": 1533072357,
        "upvote_ratio": ""
    },
    {
        "title": "Can I get advice on getting a research position?",
        "author": "DatNoobi",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93i9f4/can_i_get_advice_on_getting_a_research_position/",
        "text": "Hello everyone! There's this professor at my university that I really want to do work for. Their research is in the area of Dynamics and Control (Engineering), which is the field that I would like to get involved with in the future. I would like to do undergraduate research in his lab but I just don't know how to approach him, and a number of things make me doubtful on what I should do:\n\n* I emailed him in March with my resume, and he then asked for my unofficial transcript. My GPA at the time was 3.16 (Now 3.31). He then emailed me back thanking me for my interest and telling me that he would save my files in case an opportunity came up. He has not contacted me since then.\n* It seems he has really high GPA expectations (GPA among his students is about a 3.7). I have been improving a lot lately, but I'm afraid if this is a hard cutoff.\n* I've considered just showing up to his office and talking to him, however students that work under him claim that he is very busy and that its best to set up an appointment with him via email. \n* I haven't taken a Dynamics or Controls course yet.\n\nI know that I could search for another lab to work in, but this is the only one at my university that I am interested in and passionate about. I've been studying Dynamics in advance, and my current internship is heavily involved in the realm of Guidance, Navigation, and Controls.  I'm not going to get too specific with his projects, but I follow the videos the lab posts and I am completely amazed at that they do there. I believe that I have skills that I can bring to the lab (hardware and software) that could make me an asset for his projects, but I fear if he turns me away for good this time.\n\nIf you were in my shoes, how would you approach this situation? How would you go about asking? How would you get your foot in the door to open a dialogue between you and the professor? \n\nThank you in advance for helping this newbie. I am currently working on updating my resume to make it relevant to his research and consulting with one of his ex-students on how to do this. \n\nTL;DR: I don't know how to approach a professor to ask him if I can work in his lab. Does anybody have any advice or stories that they're willing to share to help with securing a position in this lab?",
        "created_utc": 1533069960,
        "upvote_ratio": ""
    },
    {
        "title": "How exactly do I write a paper with in text references?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93hhe3/how_exactly_do_i_write_a_paper_with_in_text/",
        "text": "[deleted]",
        "created_utc": 1533064613,
        "upvote_ratio": ""
    },
    {
        "title": "PhD Proposal Length Guidelines",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93ftoi/phd_proposal_length_guidelines/",
        "text": "[deleted]",
        "created_utc": 1533053530,
        "upvote_ratio": ""
    },
    {
        "title": "App or website recommendation for an online journal/log",
        "author": "goingtobegreat",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93ft8r/app_or_website_recommendation_for_an_online/",
        "text": "As the title says, I'm looking for some recommendations for a website or app that I could use as an online log or journal to keep trap of my daily progress. I already use Evernote for notes, but I'm more of looking for something that I can make a daily entry where I record what work I did that day (\"wrote code to do this task on project A\", \"started problem set for class B\",  completed lit review for paper in class C\") and some notes/reflections. Any thoughts? I'm in social sciences if that makes a difference.",
        "created_utc": 1533053445,
        "upvote_ratio": ""
    },
    {
        "title": "Medical Physics Enquiry",
        "author": "ColourOfEternity",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93f82j/medical_physics_enquiry/",
        "text": "I am currently looking at possible PhD's in the UK and EU within the field of medical physics (specifically Biomedical Imaging), but I am wondering what this research typically entails and what possible opportunities are in regards to future careers (I have heard that as Medical Physics is one of the fastest growing areas of research within physics, that money can be high, but places limited). I previously did an internship at the University of Toronto and found that I had a steep learning curve due to my lack of advanced biology and chemistry knowledge, is this generally the case for students coming from a pure physics background?\n\nThanks in advance, ",
        "created_utc": 1533049381,
        "upvote_ratio": ""
    },
    {
        "title": "[UPDATE] failing my PhD - submitted my thesis today",
        "author": "Sadthrowaway667",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93ez8m/update_failing_my_phd_submitted_my_thesis_today/",
        "text": "Link to original post: [https://www.reddit.com/r/AskAcademia/comments/8vryht/failing\\_my\\_phd/](https://www.reddit.com/r/AskAcademia/comments/8vryht/failing_my_phd/)\n\nI posted about a month ago, in a panic, with just 4 weeks and 11k of my crap thesis left to write. This sub gave me a lot of reassuring advice and made me feel like I could do it! I re-read all your comments whenever I started to feel hopeless and it definitely helped. \n\nUnfortunately my request for an extension was not approved by the faculty, so that was not an option, meaning the final stages were quite rushed and I'm not as happy with it as I could have been.\n\nLuckily I was able to use all my remaining holiday allowance to take 2 weeks off work and I wrote the bulk of it during that time. It was an intense 2 weeks - I was living and breathing this thesis. After that, my supervisor returned it with many edits and wanted me to restructure it so that I had fewer, but longer, chapters. \n\nThis turned into another extremely miserable 10 days where I struggled to turn everything around whilst being back at work. My relationship with my supervisors just got worse and worse, we were all so miserable. I was scared to check my email because every time I had an angry email from one of them. I still thought about quitting the PhD every day and frequently thought 'how bad would it be if I just didn't submit?'. But somehow, I submitted today.\n\nI don't have a lot of confidence in my thesis. It's not as polished as I would have liked, and I'm pretty sure there are some formatting errors. The conclusion to my theoretical dissertation is very poor. Overall, it's not strictly finished - and I am only 126 words over the minimum word count threshold! I'm preparing myself for a revise &amp; resubmit. I would be ecstatic to receive major corrections (and I'm not even going to entertain the notion of minor corrections!). Frankly, anything better than failing is more than I'm expecting.\n\nEither way, at least it's submitted and I don't have to think about it right now.\n\nThank you for all your advice and kind words. If I managed to get to this point, anyone can! But I urge anyone who is struggling to communicate with their advisers. Please! If I could go back in time and shake my previous self until she listened to me, I would tell her that! I never told them about the personal problems I was having or the grief I was experiencing because I was scared of their reaction. But they are people, and it's in their best interests for their supervisees to pass, so they would have helped me out. \n\nRight now I'm feeling underwhelmed with a strong vein of panic running through me. I don't think my thesis is good enough, and also I don't know what to do with myself. I'm just going to work really hard at my job and only do nice things in the evenings. ",
        "created_utc": 1533047610,
        "upvote_ratio": ""
    },
    {
        "title": "Post-PhD career plans - interview question",
        "author": "paulietea",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93eytr/postphd_career_plans_interview_question/",
        "text": "I have an upcoming interview for a PhD post in the UK. First time applying and first postgraduate interview so I’m not sure how this PhD interview stuff goes, It’s for a grant-funded post in the life sciences with a project already established. Computational anatomy stuff\n\nOne of the things I’m concerned about is discussing my plans for the future and how this post fits in with my future goals. They also want me to talk about “how you'll take this particular work and yourself forward”. However I do not have any plans at the moment. Ideally, I would like to become an academic, but that’s extremely intimidating, I’m not convinced it will be a great fit for me and I’m also very open to options outside of academia.\n\nBoth PIs are hardcore researchers in academia and very well established in their field, I have a feeling they won’t be impressed to take on a student that 1, isn’t planning a career committed to this line of research, and 2, doesn’t know if academia is ‘for them’\n\nHow would you guys suggest I approach this discussion at the interview? \n\nany other advice about the best way to prepare would be totally fantastic - any/all advice is very welcome!! ",
        "created_utc": 1533047526,
        "upvote_ratio": ""
    },
    {
        "title": "How to master the arts of mathematics as a beginner",
        "author": "dataframes",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93em8a/how_to_master_the_arts_of_mathematics_as_a/",
        "text": "Hello fellow redditors,\n\nas the title says, how could someone \"get better at maths\" or \"how to start learning math the right way\", even if this person, was never really good at it or even close to understand it barely?\n\nBackground info: I'm a student of computer science from germany, 27 years of age, and I've finished my 4th semester and so far, everything works out pretty good so far (except, for math).\n\nIm coming from a family where things like school, jobs, knowledge didnt really matter - it was more like \"survive the current day, tomorrow is tomorrow\", and because I never really wanted to be nor stay like this, I've decided to get into an acadmic path. I've finished a 3 year apprenticeship in computer science  and I've also worked 4 years in the field before actually studying CS - so the lectures and finals are not much of a problem as Im pretty confident in this area, except, math.\n\nI simply never really needed it, but as more as im learning it, I get a bigger picture of and I'm able to \"see things\" which my professor tries to teach me - I also really value that content, like graph theorie, functions, set theory, for example, because these things are making me better with my job and everything gets a little bit easier so its not like I'm simply not interested in this.\n\nThe problem is, that I need time - a really lot of time to understand things or to be able to solve tasks or tests related to maths.\n\nSo what someone may do, at least what I was doing, is to spent alot time with math (linear algebra) - I've actually spent all the time I've got to master it, because I really want to accomplish this goal and get an [B.Sc](https://B.Sc). at the end - no matter what it takes - but even though I've spent all my time with it, I didn't manage to pass the exam, so I guess my kind of \"bruteforce-method\" to get this stuff into my head doesnt really works.\n\nAs the next exam is my final chance (3rd of 3 tries) I'd wanted to ask for tips on how some, maybe with an nearly identical background, managed to accomplish this - any help is very appreciated.",
        "created_utc": 1533044842,
        "upvote_ratio": ""
    },
    {
        "title": "new media communications listservs?",
        "author": "MischievousManor",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93eah1/new_media_communications_listservs/",
        "text": "any links for best listservs or websites to do a job search for [asst.prof/lecturer](https://asst.prof/lecturer) jobs in new media, communications (online  political communication, social/digital media)....looking globally, so anything helps! \n\n\\- already know of [jobs.ac.uk](https://jobs.ac.uk)\n\n\\- timeshighered \n\n\\- university affairs",
        "created_utc": 1533042228,
        "upvote_ratio": ""
    },
    {
        "title": "Dissertation (UG) - Please help",
        "author": "amoah11",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93e8t0/dissertation_ug_please_help/",
        "text": "I start term in September and i have no clue what i want to do for my dissertation, has anyone done a dissertation before or in the process of starting one this September. Like I need serious help, please. Thanks!!\n\nEdit: I'm doing a sociology dissertation, meaning i can dive into anything. - info for those who want to know what course I am doing",
        "created_utc": 1533041874,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, as person living in france how could I get into a US undergrad with finacial aid without having finished highschool...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAcademia/comments/93e0yq/hello_as_person_living_in_france_how_could_i_get/",
        "text": "[deleted]",
        "created_utc": 1533039982,
        "upvote_ratio": ""
    }
]