[
    {
        "title": "At what point did humans become the \"top of the food chain\"?",
        "author": "harrybro",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xkv3c/at_what_point_did_humans_become_the_top_of_the/",
        "text": "",
        "created_utc": 1488683953,
        "upvote_ratio": ""
    },
    {
        "title": "Why didn't the Proto-Austronesians colonize the Ryukuyu Islands?",
        "author": "PETApitaS",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xkhlj/why_didnt_the_protoaustronesians_colonize_the/",
        "text": "It seems to be closer than the islands they would eventually settle.\n",
        "created_utc": 1488678632,
        "upvote_ratio": ""
    },
    {
        "title": "Suppression of the raw, primal female libido",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xipq1/suppression_of_the_raw_primal_female_libido/",
        "text": "[deleted]",
        "created_utc": 1488656552,
        "upvote_ratio": ""
    },
    {
        "title": "Are isolated human populations (such as indigenous peoples) subject to genetic drift?",
        "author": "trashlyfe",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xhpto/are_isolated_human_populations_such_as_indigenous/",
        "text": "",
        "created_utc": 1488645533,
        "upvote_ratio": ""
    },
    {
        "title": "Did Iron age scandinavians believe in money? Or did they mainly trade in goods [x-post from /r/askhistorians]",
        "author": "Vectornaut",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xhnpu/did_iron_age_scandinavians_believe_in_money_or/",
        "text": "When vikings raided villages, they mainly searched for gold and silver (or so I have read) but what value did those things actually have? Did they trade gold and silver to things like food, livestock, grains, etc. or did they have more trading culture (as in I give you chicken for bag of grains)\n\nIf they did put value on gold and silver, did they refine them into coins? Or only jewlery, cups, candelbars and items like that\n",
        "created_utc": 1488644851,
        "upvote_ratio": ""
    },
    {
        "title": "What would the infant/child mortality rate likely have been for Inuit peoples prior to the widespread introduction of western diseases and technology?",
        "author": "akhotsharks454",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xcubs/what_would_the_infantchild_mortality_rate_likely/",
        "text": "I would also appreciate any resources you know of regarding health, mortality rates or motherhood among Inuit people; especially pre 20th century.",
        "created_utc": 1488573375,
        "upvote_ratio": ""
    },
    {
        "title": "Flood myths - Resources?",
        "author": "BethiIdes89",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5xajuf/flood_myths_resources/",
        "text": "I'm really interested in the number of \"Great Flood\" myths in the world, and I was wondering if anyone knows of scholarly resources about the subject. I've seen a few books on Amazon, but I was skeptical of their credibility as there weren't many reviews or the book was out-dated. Thanks!\n\nEdit: Also, a ton of the books out there seem to be \"evidence\" for the specifically fundamentalist Christian version of the myth. I'm not interested in those. ",
        "created_utc": 1488550567,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an estimation of out of all the men who have ever lived, what percentage fought in at least one war?",
        "author": "harrybro",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5x6up4/is_there_an_estimation_of_out_of_all_the_men_who/",
        "text": "",
        "created_utc": 1488497724,
        "upvote_ratio": ""
    },
    {
        "title": "What makes someone or something 'cool' in a culture or a community?",
        "author": "sicnarm",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5x6bi8/what_makes_someone_or_something_cool_in_a_culture/",
        "text": "I'm sorry if this question is too basic. ",
        "created_utc": 1488492231,
        "upvote_ratio": ""
    },
    {
        "title": "What evidence supports the concept of anatomically modern, but not behaviorally modern, humans?",
        "author": "aristidesthejustok",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5x54rx/what_evidence_supports_the_concept_of/",
        "text": "Evidence for anatomically modern humans dates back to approximately 150,000 - 200,000 years. It's seems strangely coincidental that the transition to \"behaviorally modern\" humans occurs around 50,000 to 40,000 years ago - which also happens to be both the limit of radiocarbon dating AND is marked by a dearth of archaeological records of human behavior before that time.\n\nConsidering that Neanderthals may have had cultures, language, and abstract reasoning as far back as 170,000 years ago (suggested by the discovery at Bruniquel Cave), it seems to stand within reason that humans may have been \"modern\" as far back as the transition from *Homo heidelbergensis*, given that some evidence for modernity can be found from Neanderthals, Denisovans, and modern Humans.\n\nSo my question is, what hard evidence do we have for the line between behaviorally non-modern and modern humans? Is it simply the lack of evidence? If so, why would the underlying assumption be non-modernity, given evidence of some degree of modernity from other hominid groups?",
        "created_utc": 1488480930,
        "upvote_ratio": ""
    },
    {
        "title": "How did early humans know what to look for in terms of what food was edible from an evolutionary standpoint?",
        "author": "lilyorwhatever",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5x4c17/how_did_early_humans_know_what_to_look_for_in/",
        "text": "Was it only sense based? Like, did early people just die if they ate something poisonous and there was just a long chain of people dying until they grew immunity to such poisonous stuff? ",
        "created_utc": 1488473520,
        "upvote_ratio": ""
    },
    {
        "title": "Mathematics and counting in cultures.",
        "author": "thoughtfulhooligan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5x3eep/mathematics_and_counting_in_cultures/",
        "text": "I'm in my last year of my undergrad for philosophy. A bit of my focus has been on language/mathematics/logic. \nYesterday, a professor and myself spent a good 20 minutes arguing over whether other cultures could have a different traditional notion of numbers or counting (such that we normally distinguish thing 1 from thing 2 and say there are two things and culture x does something different).\nAre there any texts/articles in which I can look into these kinds of questions?\n\nEdit: for clarity, changed parenthesis statement.",
        "created_utc": 1488463895,
        "upvote_ratio": ""
    },
    {
        "title": "When and why did we start wearing clothes?",
        "author": "Adh_omar",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5x2w4v/when_and_why_did_we_start_wearing_clothes/",
        "text": "Clothing is anything that covers the body but not for the sole purpose of keeping warm.",
        "created_utc": 1488457232,
        "upvote_ratio": ""
    },
    {
        "title": "Why have millennials become so emotionally sensitive ?",
        "author": "IMAKILL3R",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wzojl/why_have_millennials_become_so_emotionally/",
        "text": "",
        "created_utc": 1488411759,
        "upvote_ratio": ""
    },
    {
        "title": "What were the cuisines of south and western Asia like before the arrival of new world produce?",
        "author": "elgringofrijolero",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wy2t9/what_were_the_cuisines_of_south_and_western_asia/",
        "text": "Arbol chiles are popular in Indian cuisine for their heat and flavor, but what did cultures with traditionally hot food use for heat before the availability of chiles? ",
        "created_utc": 1488396097,
        "upvote_ratio": ""
    },
    {
        "title": "Help with my first anthropology essay?",
        "author": "kay19mac",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wvzdl/help_with_my_first_anthropology_essay/",
        "text": "Here are the two different topics im choosing from.\n\n1. reflect on how religion and magic relate to people’s identities and social positions in their social context. How can belief systems and practices be used to address a particular class, gender, or sexual identity? Provide at least two examples (from the readings or drawing on your knowledge and experiences).\n\n2. Based on your understanding identify a rite of passage, explain what happens during the rite and how magic and supernatural power is used to change a person?  How would you define the context within which this rite becomes meaningful?  Contrast the experience of a person experiencing the ritual with the way in which a person’s identity might change over time without her or him going through a rite of passage.\n\nThis is my first anthropology class and I've found some examples but I thought I'd reach out to those specifically interested in anthropology as i already posted it in r/HomeworkHelp. I'm not sure which one im doing yet, I've gone back and fourth, and i've looked through all of my notes countless times trying to dig up some solid examples, im just having a really hard time. if anyone could offer some information on either of these two topics i would really appreciate it.",
        "created_utc": 1488377080,
        "upvote_ratio": ""
    },
    {
        "title": "'About 100% of human diversity exists in a single African population'",
        "author": "AtheistJeww",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wsrlq/about_100_of_human_diversity_exists_in_a_single/",
        "text": "&gt;Long and Kittles find that rather than 85% of human genetic diversity existing in all human populations, about 100% of human diversity exists in a single African population, whereas only about 70% of human genetic diversity exists in a population derived from New Guinea. Long and Kittles argued that this still produces a global human population that is genetically homogeneous compared to other mammalian populations. \nhttps://en.wikipedia.org/wiki/Race_(human_categorization)#cite_note-LongKittles-97\n\nHow can 100% of human diversity exist in a single african population if 15% of differences are actually between races? What am I getting wrong?",
        "created_utc": 1488338756,
        "upvote_ratio": ""
    },
    {
        "title": "What are the differences between kin-relations and friendship-relations?",
        "author": "Wolf_-",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wsiy8/what_are_the_differences_between_kinrelations_and/",
        "text": "As the question says, what are really the differences between these two? I was starting to wonder about it when my professor mentionted Robert Paine, he said that \"For example when we observe behaviour in the field between persons who are known to us to be cousins, we are very likely to analyse this behaviour in our writings as \"cousin behaviour\" it may be no such thing; rather, it may be behaviour between friends\".  How can be actually know that this is kinship-behaviour, and not friendship? Or vice versa? What are the differences?\n\n How can the these different relation-types differ in potential when it comes to forming more complex social units?  I haven't really found much about this, but I am quite fascinated by this, since it is a thought that has never struck me. \n",
        "created_utc": 1488336164,
        "upvote_ratio": ""
    },
    {
        "title": "Digital Anthropology Masters",
        "author": "hayatmemat",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wsb1s/digital_anthropology_masters/",
        "text": "Hi everyone, so I just graduated with an anthropology degree and I am now looking for a masters program that I am interested in. It's been my dream to be able to combine technology with anthropology. Sadly during my 4 years in college, I was not able to take any courses relating to technology and anthropology. \n\nI saw a masters program at the University of Kent called Computing and Social Anthropology. I was wondering if there was anyone who has attended this master program or anyone who knows a thing or two about it.\n\nSecondly, i would love some help about any masters on a subject like digital anthropology or a digital anthropology its self. For me, as a person who literally has no idea on what to study except for a broad concept of combining my two passions, I want to somehow to be in both the technological field and the human field. For a long time, i thought about getting into Big Data, which is now becoming very popular. \nI would love to hear about some ideas you might have, some masters program or Ph.D. suggestions and general help on what to do with my life :)\n\nThanks a lot for any help you can give me...",
        "created_utc": 1488333737,
        "upvote_ratio": ""
    },
    {
        "title": "How did farmers from the earliest forms of agriculture to Sumeria and Egypt irrigate their crops?",
        "author": "BarcodeNinja",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ws5p3/how_did_farmers_from_the_earliest_forms_of/",
        "text": "What are some good examples of archaeological evidence we have?",
        "created_utc": 1488332121,
        "upvote_ratio": ""
    },
    {
        "title": "Did any pre-celtic languages or cultural groups survive the celtic expansion into Britain, or were they all absorbed by the celts?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wqplq/did_any_preceltic_languages_or_cultural_groups/",
        "text": "[deleted]",
        "created_utc": 1488319485,
        "upvote_ratio": ""
    },
    {
        "title": "An ethnography of reddit communities. i.e sub-reddits? (particularly reading based ones)",
        "author": "ethnographemes",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wqhds/an_ethnography_of_reddit_communities_ie/",
        "text": "I discovered reddit only recently as the basis to ask a professional question. However over the last month or so reading through the posts in self.philosophy, askanthropology, askphilosophy and askpsychoanalysis I was struck by how deeply counter to any other experience on the internet reddit is. The beauty of it is that each subreddit seems to have its own view and feeling of community. The extraordinary aspect for example of askphilosophy seems precisely that it marks its limits not only by a certain kind of content but with a certain valorization of philosophical specificity and finesse and also with a certain ethics of reading. I remember complaining over the ten years that I've seen facebook around that mostly the internet seems desinged to reduce attention spans, in a sense many such reddit communities seems designed explicitly with the opposite purpose. It would be interesting to read a kind of phenomenological anthropology, dealing with the lived experience of such reddit communities based explicitly on the rules of such communities and finally of the architecture of reddit in general in comparisn with other general mode of the social media.",
        "created_utc": 1488317109,
        "upvote_ratio": ""
    },
    {
        "title": "How did people know to create cuisines with complete protein before modern biology?",
        "author": "JarJarAwakens",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wn1z8/how_did_people_know_to_create_cuisines_with/",
        "text": "I'm talking about dishes such as rice with beans.",
        "created_utc": 1488273697,
        "upvote_ratio": ""
    },
    {
        "title": "Could the extinction of Homo Neanderthalensis possibly be a result of fecundity?",
        "author": "Smeggywulff",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wkw8e/could_the_extinction_of_homo_neanderthalensis/",
        "text": "Homo Sapiens seems to be an amazingly fecund species with one of the briefest times between breeding. A human female can possibly have one child every ~10 months. In some cultures it's not unusual for a woman to bear 6+ children who survive into adulthood. Compare this to other primates, such as the orangutan which averages ~8 years between offspring and we begin to see a great disparity between the number of viable offspring. \n\nSo, what if Homo Sapiens simply out bred the Neanderthals? If they produced a smaller amount of offspring, they would not have as many to \"spare\" so to speak in times of hardship. A larger brood also means more hands to make tools, to fight, to build, to hunt, etc. Yes, it means more mouths to feed, but historically it's been shown that cannibalism isn't exactly off the table for us Homo Sapiens. \n\nI'm not a scholar. There is obviously a lot I don't know. However, this question has been bothering me for a decade now and I was wondering what those who *are* scholars thought of it.\n\nEdit: A word. ",
        "created_utc": 1488244389,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a factual/historical basis for why homosexuality is condemned in Abrahamic holy books?",
        "author": "IMAKILL3R",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wkk8b/is_there_a_factualhistorical_basis_for_why/",
        "text": "",
        "created_utc": 1488240864,
        "upvote_ratio": ""
    },
    {
        "title": "Why are human societies almost universally patriarchal?",
        "author": "steroid_pc_principal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5weht0/why_are_human_societies_almost_universally/",
        "text": "I mean to ask in the most naively curious way possible. Are there any examples of matriarchal human societies? What are the main hypotheses behind why most leaders have historically been men?\n\nThere are examples of matriarchal animal societies (elephants and bonobos, for example), so I'm interested in the evolutionary and socio-biological factors which determined that homo sapiens would be patriarchal, rather than matriarchal. I apologize if this question is better suited for a more strictly biological thread.\n\nOn a related note, what do we know about the gender roles of neanderthals? Were they similarly patriarchal? Thank you.",
        "created_utc": 1488166884,
        "upvote_ratio": ""
    },
    {
        "title": "Any information on David M. Schneiders stance that that kinship-studies were western ethnocentric and also that he claims kinship is a \"Symbol System\"?",
        "author": "Wolf_-",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5weg5k/any_information_on_david_m_schneiders_stance_that/",
        "text": "Hi Guys.\nWriting this post because of the late David Schneider. The issue is that I currently have problems going through his old articles which is part of uni curriculum. The specific issue is that I struggle to find material where it states/specifies his stance that kinship-studies were ethnocentric towards the west and what he means by this. \nBut the tough nut to crack without doubt is the part where he claims that kinship is a \"Symbol System\", I can't really find any information on this. I thought he didn't really influence this part that much?\nAnswers on this would be highly appreciated - some of those articles are written in a challenging academical english (non native here), much harder than I am normally used to, and because of that, the context is a bit hard to piece together.\n\n:)",
        "created_utc": 1488166288,
        "upvote_ratio": ""
    },
    {
        "title": "Reading Group from 2015",
        "author": "valyu",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wde1a/reading_group_from_2015/",
        "text": "Hello all,\n\nDoes anyone remember the reading group that was proposed sometime in the spring of 2015? I remember that the readings were on post-humanism ethnography and I'd really like to revisit the list. I looked through old posts and found some discourse on starting groups from a year ago, but that's not what I'm searching for.\n\nThanks",
        "created_utc": 1488153738,
        "upvote_ratio": ""
    },
    {
        "title": "How to volunteer/traineeship in the Archeology sector? (Ideally in Chile) Seeking advice",
        "author": "BobbyBarco",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5wd4vh/how_to_volunteertraineeship_in_the_archeology/",
        "text": "Hi All,\n\nI have a Doctorate in Psychology, but I have always wanted to work in Archaeology. Does anyone have any advice on how I can volunteer/intern/traineeship in the sector? Personal interest is in Chile but I would be willing to go where the opportunity arises. \n\nThank you!",
        "created_utc": 1488150816,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't humans have fur?",
        "author": "dtr1002",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5waflg/why_dont_humans_have_fur/",
        "text": "I've always wondered why humans don't have fur. What evolutionary process would devolve fur meaning humans need to cover themselves in animal fur and make shoes for their soft, vulnerable feet?\n\nEdit spelling.",
        "created_utc": 1488121154,
        "upvote_ratio": ""
    },
    {
        "title": "Are there anthropological theories or ethnographies that deal with embodiment in phenomenological terms?",
        "author": "ethnographemes",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5w8tfk/are_there_anthropological_theories_or/",
        "text": "I have so far found only one article by Thomas J Csordas, 'Embodiment as  paradigm for Anthropology' where he argues :\n\n'embodiment begins from the methodological postulate that the body is not an object to be studied in relation to culture but is to be considered as the subject of culture, or in other words as the existential grounds of culture.'\n\nHe takes up the argument for emdodiment in Ponty-ian terms laying out a paradigm for the 'perceptual constitution of cultural objects'.  Csordas takes up the discussion with both Bordieu and Mauss and attempts to move from them by considering embodiment in a non-dualistic form. Mauss famously takes up dualities such as mind-body, sign-significance etc. Bordieu similarly takes up terms such as Field-Habitus. Moreover Bordieu takes up the place of the body in terms of certain social paradigms, arguing for posture as a function of these social paradigms. However I am wondering if there are ethnographies that deal with the body itself as constitutive. For example, I think it would be particularly fascinating to take up Phenomenological perspectives proposed by Samuel Todes in 'Body and World', where the body is seen as describing its perceptual field in motion. Here certain fundamental co-ordinates of the body are taken up, such as its greater facility with moving forward rather than backward, and poise in relation to the bodies ability to balance within a gravitational field. I find this kind of perspective would be fascinating to study in relation to ritual but also in relation to the movement from disembodiment to embodiment as practiced within certain ceremonies of possession. \n\n",
        "created_utc": 1488089157,
        "upvote_ratio": ""
    },
    {
        "title": "Conspiracy Theorists Ethanography",
        "author": "throwaway589398",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5w6qc6/conspiracy_theorists_ethanography/",
        "text": "Hi! I am doing my own ethnography of conspiracy theorists and my professor has required us to do a literature review of previous ethanographies. However, I cannot seem to find any. Is there a good database or article that can point me in some direction? Thank you. ",
        "created_utc": 1488061219,
        "upvote_ratio": ""
    },
    {
        "title": "Any good ethnography focusing on a gift economy? I've already read \"The Gift\" by Lewis Hyde.",
        "author": "punninglinguist",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5w2mto/any_good_ethnography_focusing_on_a_gift_economy/",
        "text": "I'm looking for any book or monograph about day-to-day life in a gift economy: something that describes the social and emotional pressures that operate in a gift economy.",
        "created_utc": 1488001396,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for sources on societal forces that promote the well-being of individuals. I am interested in multiple examples of specific groups from small-scale to large-scale societies.",
        "author": "alanbright",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vs3n6/looking_for_sources_on_societal_forces_that/",
        "text": "And by forces, I mean norms, taboos, beliefs, and individual actions that members of a group participate in to promote the well-being of themselves or others. \n\nI am also interested in other factors that may subvert the aforementioned forces. ",
        "created_utc": 1487874496,
        "upvote_ratio": ""
    },
    {
        "title": "Do we have any evidence for prehistoric civilizations?",
        "author": "mweuste",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vqti7/do_we_have_any_evidence_for_prehistoric/",
        "text": "",
        "created_utc": 1487861883,
        "upvote_ratio": ""
    },
    {
        "title": "What do anthropologists and historians think of Marija Gimbutas' Old Europe theory?",
        "author": "mweuste",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vq491/what_do_anthropologists_and_historians_think_of/",
        "text": "",
        "created_utc": 1487852914,
        "upvote_ratio": ""
    },
    {
        "title": "Have all cultures around the world (ancestral and actual) tended believe and worship a higher entity?",
        "author": "lophophorata",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vq0i8/have_all_cultures_around_the_world_ancestral_and/",
        "text": "What I was wondering is if humanity needs religion. Or an alternative that can fulfill the different roles of religion. Do groups of people always tend to believe in a higher entity? Almost like the group's dynamic and subsistence needs some sort of religion. Have there been many cases where this isn't the case? And were those cultures successful? If so the current decline of belief in God must be due to the advancements in science, replacing religion's role of providing answers.\n\nThank you!",
        "created_utc": 1487851224,
        "upvote_ratio": ""
    },
    {
        "title": "When did we start commonly removing wisdom teeth?",
        "author": "GreensburgZombie",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vmcp9/when_did_we_start_commonly_removing_wisdom_teeth/",
        "text": "",
        "created_utc": 1487806605,
        "upvote_ratio": ""
    },
    {
        "title": "What two ethnicities/nationalities/races have interbred the most? Which ones interbred the least?",
        "author": "AcidicBlink",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vluyn/what_two_ethnicitiesnationalitiesraces_have/",
        "text": "",
        "created_utc": 1487801997,
        "upvote_ratio": ""
    },
    {
        "title": "What are the major works on engaged anthropology? I'm interested in how anthropology can be more directly involved in improving the lives of those it studies.",
        "author": "MilkAndTwoSugarz",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vky2r/what_are_the_major_works_on_engaged_anthropology/",
        "text": "",
        "created_utc": 1487793173,
        "upvote_ratio": ""
    },
    {
        "title": "How well did ancient people understand geography?",
        "author": "deathbryte",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vk2ik/how_well_did_ancient_people_understand_geography/",
        "text": "Many ancient civilizations had stories about how the continents came to their places, they may not have been factual but the stories displayed a great understanding of the placement of the continents and how they got there. I've heard stories in Native American legends about Turtle Island and some even explained other continents, Europe and asia being the elephant, south american being the elephant's head which got \"chopped off\". The story goes that the people lost their faith in the teachings and cut off the head of their god, which was the continent. According to the story the severed head of the elephant caused the ocean currents today because the blood is always flowing from the neck of the elephant. \nThere is a video example of one man's rendition, but this story is seen in lots of Native American legend, though some are different or parts are missing.\nhttps://www.youtube.com/watch?v=u88mfQIhTig\n\nWhat are other cultures beliefs about geography and the placement of earth's land masses? Did any other ancient people have explanations like this? Is it all just made up and not historically true? Was their knowledge of stuff like this and if so who else had this knowledge around that time? ",
        "created_utc": 1487785046,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know about a perfectly preserved Pharmacy that was locked up and not touched since the 1940's or 1950's?",
        "author": "Office_Zombie",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vf58s/does_anyone_know_about_a_perfectly_preserved/",
        "text": "Back in the mid-90s; I was taking an Anthropology class at Boise State and my professor mentioned a pharmacy that had been perfectly preserved for like 50 years.\n\nWhat happened is the pharmacy was run by a single guy. He died suddenly one day and his wife locked up the pharmacy and never touched it. (But left the electricity and heat on.)\n\nAfter she died, someone went in and found a pharmacy that had not been touched since the 1940's or 1950's. There were still perfectly preserved Brownie Cameras in the box on the shelves; the notes were still scattered on the desk of the pharmacist; and there were like 20 years of records of people's illnesses and prescriptions, etc.\n\nLast I heard they were still trying to do with it because there was so much personal information about the people in the town; but it was a great anthropological find because it was truly a snapshot of medicine from that time and the years before.\n\nDoes anyone know anything about that store?",
        "created_utc": 1487720827,
        "upvote_ratio": ""
    },
    {
        "title": "Does the shame/guilt culture distinction have strong scientific evidence? Has it been elaborated on?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vetql/does_the_shameguilt_culture_distinction_have/",
        "text": "Hi, I recently came across a page that referenced Benedict's \"The chrysanthenum and the sword\", in distinguishing shame societies from guilt societies.  Japan would be an example of the former while US would be an example of the latter label.  Elsewhere I also came across a label \"fear society/culture\" which then led me to a wiki page (https://en.wikipedia.org/wiki/Guilt-Shame-Fear_spectrum_of_cultures) which did not elaborate on it much but associated it with African countries. \n\nI find this interesting though bit overly simple and wonder if there are scientific articles backing up these distinctions, how immigration has influenced these differences, etc.  In short, I like to learn more about it, if this way of looking at cultures is still seen as valuable.  Thank you.\n",
        "created_utc": 1487717542,
        "upvote_ratio": ""
    },
    {
        "title": "How are male erections viewed in cultures where social nudity is the norm?",
        "author": "Steve2982",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vdk1b/how_are_male_erections_viewed_in_cultures_where/",
        "text": "In most western cultures, erections must be hidden, even in situations where nudity is appropriate such as locker rooms. Even nudists have an unwritten rule that while penises are okay, erections are sexual and must be covered with a towel, even though men and boys get erections for nonsexual reasons from a young age.\n\nIn cultures where social nudity is common, such as those in Africa and South America, or in Scandanavian countries where sauna culture allows social nudity, or japanese communal bathing, how are erections viewed? Are they seen as simply a biological function? Are they seen as innocent until puberty? Must they be hidden? In cultures where nudity is common, at what point does nudity and erections become sexual?",
        "created_utc": 1487705346,
        "upvote_ratio": ""
    },
    {
        "title": "Sources on violence and polygyny in Australian Aboriginal societies",
        "author": "whatevernatureis",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vdavp/sources_on_violence_and_polygyny_in_australian/",
        "text": "What it says on the tin. I'm interested in papers, books, or publicly available databases on violence (intra- and inter-group) in Australian Aboriginal societies. I'm interested in death rates from different kinds of violence vs. other causes and who is involved in violence.\n\nI'm also interested in levels of polygyny and how polygyny is justified/enforced/maintained.\n\nSince Australian Aboriginal cultures are highly variable on these fronts, I'm interested in sources on different cultures (though I very slightly prefer information on Aborigines who live in highly productive environments).\n\nI know that I'm extremely unlikely to find exactly the information I would like, so I'll take what I can get. I'm interested in behavioral ecology, and I'm familiar with literature on San peoples, but I've found the Australian lit a bit harder to sort through.",
        "created_utc": 1487702990,
        "upvote_ratio": ""
    },
    {
        "title": "Why does is seem that most examples third gender people throughout history were initially biosex males?",
        "author": "cave_de_simia",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vd7xw/why_does_is_seem_that_most_examples_third_gender/",
        "text": "...as opposed to biosex females.\nI've recently had an interest in the concept of third genders throughout history, but I've noticed for the most part, this seems to be a biosex male adopting a more effiminate role. South Asia has always had hijra individuals (born male) since the Kama Sutra period. Of Native American words for Two-Spirit people, more of them literally translate to phrases meaning \"man becoming more like a woman\". Just checking wikipedia for a list of third genders or examples of transgender identities outside of the western world, almost all of these identities refer to people who were born male. People clearly viewed sex and gender differently in the past and in some groups still do (compared to the west).",
        "created_utc": 1487702235,
        "upvote_ratio": ""
    },
    {
        "title": "Was there ever a point where human males fought each other for the right to mate, as we see with many mammal species today?",
        "author": "soggypoophair",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5vc302/was_there_ever_a_point_where_human_males_fought/",
        "text": "",
        "created_utc": 1487691079,
        "upvote_ratio": ""
    },
    {
        "title": "How can us humans really understand the differences between men and women biologically? When no one can experience being both (100% biologically) ?",
        "author": "TheRealNemesis",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5v6bwy/how_can_us_humans_really_understand_the/",
        "text": "I hope this is the right subreddit for this question, and it might be a bit philosophical, but i was just wondering about how we can truly understand the opposite sex? My problem understanding this is since no one can possibly have experienced being both?\n\nA stupid, but  practical example:\n\n* like if a girl tells a guy that all he thinks of is sex, but if the guy uses that it is hormones as an arguement, the girl might just say that is a silly excuse- and then my point comes in: how can the girl possibly know? since she can't experience how it is to being a man biologically?\n\n\nSorry if the question was unclear, english is not my native language.",
        "created_utc": 1487616338,
        "upvote_ratio": ""
    },
    {
        "title": "Many ancient pantheons of gods included brother-sister couplings, while their societies still included some form of the incest taboo. Was these seen as odd by anyone?",
        "author": "newcitynewchapter",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uz710/many_ancient_pantheons_of_gods_included/",
        "text": "While I know that Egyptian rule included periods of brother-sister marriage, it's my understanding this wasn't a common practice. Why wouldn't ancient people have applied their version of the incest taboo to the family structure of their gods?",
        "created_utc": 1487524098,
        "upvote_ratio": ""
    },
    {
        "title": "Was the Cyrus Cylinder and others like it an ancient means of mass producing (not distributing) a decree/propaganda? I.e. ancient printing press",
        "author": "bejonesin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uxptg/was_the_cyrus_cylinder_and_others_like_it_an/",
        "text": "I have not seen the Cyrus Cylinder in person but I have seen several other cylinders in other museums, these left me with the question of why someone would use this as a means of record when tablets were also in use. I could see the utility of a cylinder vice tablet for storage but a lot of the cylinders are extremely small, almost the size of necklace beads.\n\nAfter the storage idea I wondered if these would make for an easy way to reproduce what was on them, acting as a roller for either producing a negative on a tablet that could be used to mass stamp perfect copies. This makes sense to me in an era when I would assume there was a large portion of the populace who could not read/write; dispatching several illiterate messengers with these would be preferred to sending out a literate few, especially to civilizations that were recently conquered. The secondary purpose of the cylinder could be reduced storage space requirements and easier indexing to find the desired text relative to clay tablets.\n\nBack to my question, is there precedence or reason to believe that these cylinders may have been used for rapid production/recreation of histories/decrees/propaganda?",
        "created_utc": 1487500353,
        "upvote_ratio": ""
    },
    {
        "title": "The Orgins of Bathing",
        "author": "BomToody",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uwk67/the_orgins_of_bathing/",
        "text": "(Originally posted on r/AskHistorians, was asked to forward question here.)\n\nI've been seeing a post floating around on various social media sites suggesting that (to quote) \"Europeans didn't know how to bathe until the Moorish people taught them how.\" \n\nThis statement in itself I fairly quickly determined was very likely untrue, but it did get me thinking: when did humanity first start bathing? How did it evolve throughout the years? \n\nThank you!",
        "created_utc": 1487477457,
        "upvote_ratio": ""
    },
    {
        "title": "There have been mines all over the world through time but how did anyone think to start digging there?",
        "author": "DrDew00",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uuvo1/there_have_been_mines_all_over_the_world_through/",
        "text": "Not just iron, but lead, zinc, copper, tin, gold, diamonds, etc. Were there just large deposits of metal- and mineral-containing rocks on the ground in certain areas so people started digging to see if there was more? ",
        "created_utc": 1487455024,
        "upvote_ratio": ""
    },
    {
        "title": "Disappointed in Ask Anthropology",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uuff4/disappointed_in_ask_anthropology/",
        "text": "[deleted]",
        "created_utc": 1487449638,
        "upvote_ratio": ""
    },
    {
        "title": "Ancient humans and \"exchanging children.\" I've seen a few portrayals of this, where adults exchange children between tribes. How fictional or factual is this?",
        "author": "girlwithruinedteeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5us5gr/ancient_humans_and_exchanging_children_ive_seen_a/",
        "text": "I specifically remember an instance of this between 2 Neanderthal groups in a \"historical fiction\" movie called Ao the Last Neanderthal.\n\nWhere these two groups exchanged 2 boys into each others tribe splitting up Ao and his brother(Both juveniles at the time.)\n\nI think I've read something about this before. As an Idea to keep groups from inbreeding too much.\n\nIs this just pure fiction or is there some basis of this in reality?",
        "created_utc": 1487419332,
        "upvote_ratio": ""
    },
    {
        "title": "Does egalitarianism strictly depend on being mobile as opposed to sedentary?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uqvjn/does_egalitarianism_strictly_depend_on_being/",
        "text": "I've recently come across several articles suggesting that the relative egalitarianism in hunter-gatherer bands is, at its core, strictly due to the mobility of the group: egalitarianism disappears once the band settles down, and all mobile groups must be egalitarian, essentially. \n\n\n\nBefore now, I'd typically heard that, in addition to mobility (which would ensure the relative lack of disease, property, and number of young children in the group), whether a band was egalitarian or socially stratified was also the product of the economics/surrounding area of the band: pastoral and predominantly hunting societies being less egalitarian, warlike bands being less egalitarian, bands in areas of sparse resources vs plentiful resources, etc. \n\n\n\nCould someone please explain/give articles over whether mobility is the **main** ingredient of egalitarianism? ",
        "created_utc": 1487393370,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a specific article/study I read a while ago about women and hunting.",
        "author": "girlwithruinedteeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uq79s/looking_for_a_specific_articlestudy_i_read_a/",
        "text": "I'm looking for a study/article I read a while ago about women and hunting, where the data showed that Hunting groups with co-ed teams were more successful than those that were only male and/or only female.",
        "created_utc": 1487383546,
        "upvote_ratio": ""
    },
    {
        "title": "What other momentary divisions of time (other than the second) have existed in human cultures?",
        "author": "PaladinBen",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uka48/what_other_momentary_divisions_of_time_other_than/",
        "text": "When we count time, we do so in the cadence of second to second. Have there been faster or slower paced momentary divisions in human cultures? What were they called? What were their time-counting cadences like?",
        "created_utc": 1487306493,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me find solid arguments against Barry Fell and his bc america series.",
        "author": "deruku",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uk8jq/can_anyone_help_me_find_solid_arguments_against/",
        "text": "I have a family member  who had recently came to belive that Barry Fells is correct in some of his crazier ideas.",
        "created_utc": 1487305846,
        "upvote_ratio": ""
    },
    {
        "title": "I am looking for examples of cultures thinking that a certain sounds are sacred or special, are there any that come to mind?",
        "author": "UnderwaterDialect",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uioi1/i_am_looking_for_examples_of_cultures_thinking/",
        "text": "",
        "created_utc": 1487287197,
        "upvote_ratio": ""
    },
    {
        "title": "When did humans (or our ancestors) begin to name things? When did we start naming ourselves (e.g. John)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ui7m0/when_did_humans_or_our_ancestors_begin_to_name/",
        "text": "[deleted]",
        "created_utc": 1487282590,
        "upvote_ratio": ""
    },
    {
        "title": "Which people groups are matriarchal?",
        "author": "CMPopPunk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ui6cx/which_people_groups_are_matriarchal/",
        "text": "Which people groups in the word/history have been matriarchal--that is, they were ruled primarily by women (sorry if my terminology is too vague here).",
        "created_utc": 1487282260,
        "upvote_ratio": ""
    },
    {
        "title": "Need reading suggestions! - for a project about sustainable customs and societies, past and present.",
        "author": "hans_jacobsen",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uf43p/need_reading_suggestions_for_a_project_about/",
        "text": "I am currently working on a project which attempts to gather together information about sustainable living from both old and new sources. As well as looking into the fields of science and sustainable theory itself, we will try to draw out examples from especially cultures outside of the contemporary western, whose way of life can be considered 'sustainable'.\n\nFor example, I feel I have read about instances in which tribes that live in a sedentary hunter-gatherer existence will evolve customs, rituals and beliefs which effectively are in place to restrict their societies consumption of its limited resources. \nSimilarly, any instances of capture and use of natural energy, or large scale transport and trade in fossil-free societies are also interesting to us.\n\nIf anyone has any idea of books, articles or anecdotes which either deals with this directly or mentions it in passing, it would be greatly appreciated!\n",
        "created_utc": 1487254025,
        "upvote_ratio": ""
    },
    {
        "title": "Toddler tantrums in non-western cultures?",
        "author": "PM_ME_YOUR_GSDs",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ucwoc/toddler_tantrums_in_nonwestern_cultures/",
        "text": "I'm interested in learning if toddler tantrums happen the same way in non-western cultures. \n\nWestern parents often see toddlers aged ~1.5-3 years throw temper tantrums when they don't get their way, and it's considered a pretty normal phase that nearly all kids go through (\"the terrible twos\"). Meltdowns can be triggered by not getting a toy they want, or having to leave the playground, or being given eggs instead of candy for breakfast, etc. Behaviors include throwing themselves on the floor, kicking, crying, screaming, throwing things, and so on.\n\nDoes this also happen among toddlers in other cultures? Do they show the same behaviors? Does it tend to happen at similar ages? How do parents and caregivers respond? ",
        "created_utc": 1487222165,
        "upvote_ratio": ""
    },
    {
        "title": "Why can I usually tell women's and men's writing apart?",
        "author": "ragawi",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ucbsz/why_can_i_usually_tell_womens_and_mens_writing/",
        "text": "I was just looking a stack of forms, each filled out by a different person. When I got to one, I was surprised to find out that it was written by a male, because assumed it was filled out by a female due to the handwriting. I realized I must have correctly assumed the gender for all of the previous forms based on the handwriting, because I only became aware of this assumption when I found one that didn't match. I proceeded to correctly guess the gender of the writer, based on the handwriting, for all of the subsequent forms.\n\nWhy is this? Growing up, I was always told by teachers that I didn't have very nice writing \"for a girl\" (mega-eyeroll). I guess since then, always assumed that maybe women are still largely expected by society to have better penmanship, and perhaps parents or teachers consciously (or unconsciously) spend a little more time on writing form with female pupils. Or, perhaps, if a boy got teased for \"writing like a girl\" (or vise versa), the pupil would change their writing style to avoid further teasing.\n\nIn my informal and unexpected mini-study today, I noticed the gender bias wasn't based on lovely penmanship for women and chicken-scratch for men. In fact, many of the females had penmanship that was very difficult to read. Overall, women's letters were larger, there was less space between letters, and more individual letters touched. Of the men's writing, many had very neat, easy to read writing, and others were messier, but still legible. The overall printing was smaller, and fewer individual letters touched. I wouldn't say I could tell a difference in how curvy or blocky letters were between genders - it differed quite a bit.\n\nWhat anthropological, physiological, psychological factors may be at play, here?\n\nThe \"sample size\" of this no-way planned study was 72, and I guessed 71 correctly.",
        "created_utc": 1487214822,
        "upvote_ratio": ""
    },
    {
        "title": "Most animals have breeding seasons. When did we lose the need to have babies at a certain time of the year?",
        "author": "WalrusWarlord",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5uaoj2/most_animals_have_breeding_seasons_when_did_we/",
        "text": "Most animals give birth in the spring, we give birth all the time. Is this simply due to the fact that we don't move around and we have shelter constantly available? Or is it because we have a more constant food source in agriculture?",
        "created_utc": 1487196727,
        "upvote_ratio": ""
    },
    {
        "title": "How has magic been viewed across different cultures?",
        "author": "rogthnor",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5u8bcl/how_has_magic_been_viewed_across_different/",
        "text": "The popular image of a wizard in the western world today is an old man in a robe chanting in Latin to fling fire and lighting and the like. How have other peoples conceived of magic? How did it function, what were it's rules, and how was it viewed?\n\nI don't need an answer for every possible culture. If people could just answer these questions for whichever culture they have the best knowledge of, I'd really appreciate it!",
        "created_utc": 1487174954,
        "upvote_ratio": ""
    },
    {
        "title": "To what degree is Manifest Destiny a consequence of population growth?",
        "author": "DrippyBeard",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5u80fd/to_what_degree_is_manifest_destiny_a_consequence/",
        "text": "I have a couple of questions within this question, full or partial answers to any of which would be greatly appreciated.\n  \n1. In modern Western society, the affluent have fewer children than the poor. Has this always been the case? Did having more children to work the farm make up for the lack of a social safety net? I guess a specific place and time period would be helpful, but I'm just trying to grasp the trend in general over the history of Western civilization.  \n  \n2. Back before thermonuclear weapons and urban guerrilla terrorists, when wars would last tens of years and involved grueling years long stalemates and blockades and sieges, were there any concerted efforts - overt, through propaganda, or otherwise - to encourage people to have more children to raise more warriors? For example I'm thinking about places like Sparta, whose only business was war, and what their state policy of rearing new soldiers was. Gotta have feet on the ground to expand your kingdom (or did they even want to expand geographically?)  \n  \n3. And lastly, how does manufactured or naturally prosperous population growth tie into periods in countries' lives when the expanded? Did public opinion shift to \"oh man, our cities and farmlands are getting cramped, better take over our neighbor's!\" or was there a more natural progression?  \n  \nSorry if this is such a vague question; I don't exactly know where to start myself.",
        "created_utc": 1487172092,
        "upvote_ratio": ""
    },
    {
        "title": "Uncontacted (Or small, isolated) Tribes and Inbreeding",
        "author": "Lordofdriftmark",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5u7g2e/uncontacted_or_small_isolated_tribes_and/",
        "text": "I find uncontacted tribes very interesting. Recently i asked myself the question whether and if so how a small, isolated, tribe (contacted and uncontacted) would avoid inbreeding. Any related information is welcome.\n\nI would assume that there´s some contact between different tribes and some intermarrying between them. However, this still doesn´t seem viable for very small and isolated tribes. (Like those on the North Sentinel Island. If i recall correctly aerial surveys only showed around 50 people)\n\nConsidering the very negative effects of heavy inbreeding, wouldn´t it also be ethically justifiable to contact those tribes? ",
        "created_utc": 1487166622,
        "upvote_ratio": ""
    },
    {
        "title": "If the 14th amendment had never passed, is it possible that slavery in the US would've survived into modern times?",
        "author": "a1b3c6",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5u5m4l/if_the_14th_amendment_had_never_passed_is_it/",
        "text": "[removed]",
        "created_utc": 1487136339,
        "upvote_ratio": ""
    },
    {
        "title": "How did early cultures gather honey for their local mead/honey wine beverages (or other uses)?",
        "author": "Quasifrodo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5u1nqt/how_did_early_cultures_gather_honey_for_their/",
        "text": "It seems from my reading of various sagas from various cultures that the use of honey was widespread, and its use in brewing beverages would require rather large quantities. What various techniques would people from as early as 7,000 BCE through the age of Beowulf have used to acquire the needed honey? At what point were humans able to domesticate the honey bee and how crucial was that to the development of widespread honey/mead consumption?",
        "created_utc": 1487094233,
        "upvote_ratio": ""
    },
    {
        "title": "Where there different races of neanderthals?",
        "author": "KingLudwigII",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tys5b/where_there_different_races_of_neanderthals/",
        "text": "I realise race is a loaded and ill defined word, but I just mean it in the everyday sense of the word as in populations with different skin tones and/ or facial features.",
        "created_utc": 1487056195,
        "upvote_ratio": ""
    },
    {
        "title": "Do materials need to be underwater to fossilize?",
        "author": "TheRealBaboo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tynmw/do_materials_need_to_be_underwater_to_fossilize/",
        "text": "I heard this on a documentary and just wanted some clarification. Thanks",
        "created_utc": 1487054254,
        "upvote_ratio": ""
    },
    {
        "title": "Why did nomads herd horses?",
        "author": "impfireball",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tygb7/why_did_nomads_herd_horses/",
        "text": "I can't see them as being very economically useful, except for riding.\n\nDidn't they have more horses than people in some tribes?",
        "created_utc": 1487051452,
        "upvote_ratio": ""
    },
    {
        "title": "How much do we know about the life, society and culture of pre-Roman Britain?",
        "author": "Dr-Facilier",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5txgtr/how_much_do_we_know_about_the_life_society_and/",
        "text": "I know that prior to the Roman conquest of the British Isles, the land was occupied by Picts, Britons and Gaels (in Ireland?) and so understand there will likely be some differences between those groups.\n\n With that in mind, I was hoping to get a general picture of what life was like for my ancestors. \n\nHow was their society structured? What do we know about their systems of spirituality and leadership? What was their approach to warfare?\n\nI understand that this is quite a broad question, but anything you can tell me would be appreciated; good sources of reading even more so!",
        "created_utc": 1487039639,
        "upvote_ratio": ""
    },
    {
        "title": "In the US, why and how Southern culture came to be seen as more authentically American, even though the South lost to the North in the Civil War?",
        "author": "ampanmdagaba",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tuxv0/in_the_us_why_and_how_southern_culture_came_to_be/",
        "text": "I am trying to port this question from /r/AskHistorians, as it falls within the 20 years rule in that sub, while the question is very interesting.\n\nhttps://www.reddit.com/r/AskHistorians/comments/5tsanz/why_are_the_former_states_of_the_confederacy_now/\n\nHere's what the OP asked:\n\n&gt; Anyone who's driven around the American South has seen the \"Confederate flag\" somewhere, often hanging or flying near an American flag. Much of Southern culture and identity seems to be focused around patriotism, even while people espouse \"Lost Cause\" ideology. How did this region go from insurrection to fervent patriotism, and how have those two ideas been reconciled so completely in many peoples' minds?\n\nAnd if I could ask a follow-up question from myself, how come Southern sound and Southern pronunciation became so dominant in popular country music? Did the politically right Northerners willingly accept Southern aesthetics as more authentic, or was there (is there) any reflection on the apparent historical incongruity of this self-identification? (Like Yankees in NY flying Confederate flags on pickup trucks) Do you think Country music might have contributed to this cultural shift, or is it just a side-effect?",
        "created_utc": 1487014166,
        "upvote_ratio": ""
    },
    {
        "title": "Was fire independently discovered multiple times, or did knowledge of fire spread from a single discovery?",
        "author": "mkiyt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tujvr/was_fire_independently_discovered_multiple_times/",
        "text": "",
        "created_utc": 1487010415,
        "upvote_ratio": ""
    },
    {
        "title": "How old is the earliest human artistic representation of a frog?",
        "author": "bond___vagabond",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tu8o3/how_old_is_the_earliest_human_artistic/",
        "text": "I understand that medium plays a big role in how long art lasts, so would probably be a cave painting or something more durable than a sand painting or cosmetic makeup worn for one ceremony then removed.  Bonus if you have an image of it.",
        "created_utc": 1487007491,
        "upvote_ratio": ""
    },
    {
        "title": "What were the major differences between New Archaeology and what came before it? How was New Archaeology different?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tnryf/what_were_the_major_differences_between_new/",
        "text": "[deleted]",
        "created_utc": 1486929807,
        "upvote_ratio": ""
    },
    {
        "title": "Any evidence of the use of cardinal directions (or equivalent) in hunter gatherer cultures?",
        "author": "Kushim",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tmir3/any_evidence_of_the_use_of_cardinal_directions_or/",
        "text": "Basically I'm curious if any hunter-gatherer cultures had a concept similar to our cardinal directions or if they primarily saw their routes of travel as point A to B. ",
        "created_utc": 1486919437,
        "upvote_ratio": ""
    },
    {
        "title": "Methods for displaying seriation results",
        "author": "Pachacamac",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tiscu/methods_for_displaying_seriation_results/",
        "text": "I've asked this before but figured I should ask it again, since things are always changing. I need to display several seriation graphs, each with around 300 assemblages. In the past I used a 100% stacked bar graph in excel, which was fine, but it's not the best or most professional way to display seriation results. I am finally getting around to turning my dissertation stuff into journal articles, so I need to come up with a professional way to display my seriation results (I am comparing different seriation methods, so I need to display the same data multiple times. There are way too many assemblages to do this by hand).\n\nDoes anyone know of any newish programs/scripts that I can use for seriation graphs? I assume that R is the best way to do this. I am not very good with R and know nothing about programming, but I can follow an existing script and could probably figure out how to do some basic changes. \n\nSo, how do people display their seriation results these days?",
        "created_utc": 1486861947,
        "upvote_ratio": ""
    },
    {
        "title": "In a prehistoric community of 150-300 members, what would the leadership look like and what would their duties be?",
        "author": "wereslowlymelting",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tfmbl/in_a_prehistoric_community_of_150300_members_what/",
        "text": "In a community of this size I am curious as to if violence could have played a role in selection of leadership, or if it is more likely that leadership was chosen by the members.  How was this person/group treated?  What were their daily duties?  What was expected of them socially?  ",
        "created_utc": 1486828517,
        "upvote_ratio": ""
    },
    {
        "title": "Did language evolve because the tribes got too big?",
        "author": "MaxFischer9891",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tfgx9/did_language_evolve_because_the_tribes_got_too_big/",
        "text": "I heard this theory on Joe Rogan's podcast with Aubrey Marcus. I think it was in [the episode with Steven Pressfield.](https://www.youtube.com/watch?v=4p3tN_iFHY0)\n\n\nThe gist of the idea was that to ensure social stability primates would touch and clean each other. When tribes enlarged, the logistics for that became impossible, so language evolved as a form of verbal bonding.\n\n\nIs there any validity to this theory? If yes, where can I read about it?",
        "created_utc": 1486827256,
        "upvote_ratio": ""
    },
    {
        "title": "How likely is it that modern humans originated from a spot below the Great Pyramid, when that spot was aligned with stars in Orion's Belt. Then the great pyramid was built on top of that spot?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tc185/how_likely_is_it_that_modern_humans_originated/",
        "text": "[deleted]",
        "created_utc": 1486785333,
        "upvote_ratio": ""
    },
    {
        "title": "Did hunters tend to use arrowheads more than once?",
        "author": "ChaosHellTV",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5tbyl9/did_hunters_tend_to_use_arrowheads_more_than_once/",
        "text": "",
        "created_utc": 1486784254,
        "upvote_ratio": ""
    },
    {
        "title": "What should the relationship between the US Military and Anthropology look like?",
        "author": "jadesaddiction",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5t8sh0/what_should_the_relationship_between_the_us/",
        "text": "I recently finished watching an interesting documentary about the Human Terrain System and read some insightful criticisms of the program. This got me thinking about anthropological knowledge being applied to our military operations. A professor of mine studied in Syria for some time as part of her thesis and said she had to ensure her research wasn't interesting enough to be seen as useful to the government, for some of her colleagues have had run ins with governments during their research period. \n\nWhat should this relationship ideally look like (any links to related readings would be appreciated)\"? Should anthropological methods be changed to prevent it being used for military aims? And in that same vein, what anthropological research would be impossible to use for such purposes?\n\nAny further reading would really be appreciated, especially in light of the election and any possible resurgence of such a topic. Thank you!!",
        "created_utc": 1486749496,
        "upvote_ratio": ""
    },
    {
        "title": "What did women use to control their menstruation in the past?",
        "author": "AcidicBlink",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5t8kan/what_did_women_use_to_control_their_menstruation/",
        "text": "I'm specifically interested in the earliest recorded things used. ",
        "created_utc": 1486747306,
        "upvote_ratio": ""
    },
    {
        "title": "The Ancient Egyptians in Modernity; Am I Crazy?",
        "author": "Ipushiron",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5t4e3r/the_ancient_egyptians_in_modernity_am_i_crazy/",
        "text": "For the past two days I've been engaged in a heated argument with an afrocentrist, or a \"truth-centrist\" as they call themself over Instagram. I'll briefly summarize the argument as I feel that this is necessary. I may present a intrinsic bias presenting both arguments so I'll include the link to the post later in this post to provide an alternate reading of both arguments to assure that I don't misrepresent their arguments.\n\nI enter the argument because a lot of people are saying that Cleopatra was negroid when she is rather a Macedonian Greek from the Ptolemaic Dynasty pretty much because the picture depicted the white actor who played Cleopatra in Cleopatra.\n\nI reply directly to a person by the handle of lotus_ellesse who stated that Europeans used Egyptology as a smokescreen to rob \"their\" tombs, and calls European whites \"dirty dogs.\" What caught my attention is that they used \"our tombs\" to suggest that ancient Egypt is a dominant black civilization, I go on to say that it's ridiculous to paint the ancient Egyptians as a heterogeneous negroid group and that you shouldn't be applying a nineteenth century ideology to ancient Egyptians who never even identified with race to begin with. \n\nI unintentionally generalize that mummies are caucasoid based on genetic studies, but I said this because modern Egyptians belong to the Afro-Asiatic and Semitic ethnic groups are shown to be similar to ancient Egyptians through blood-typing studies cited in the Encyclopedia of the Archaeology of Ancient Egypt. \n\nI also bring up craniometry to prove my point that the ancient Egyptians weren't a black civilization, but a person by the handle of godroe goes on to try discrediting craniometry to determine race by listing the Khoisan tribe as an exception. I tell them that they are disreputable for stating that craniometry is ineffective and not useful in discovering the racial origin of an individual.\n\nI listed a few sources that has helped build my arguments and I'll admit that one of which isnot credible in the sense that it is a student blog post, however the information displayed was cited. Anyways, the blog post is from a student in anthropology that explains the racial ideology is modern and claims \"it is impossible to say when black ends and when white begins.\" (Lyon.) The purpose of having this was to show that this entire argument of what the race of Egyptians were is too subjective.\n\nI listed a few primary sources that include the 2005 facial reconstruction of Tutankhamen that's regarded as the \"most accurate forensic reconstruction\" and a bust of Nefertiti which subjectively depicts someone who appears to be of the Near-East/West Asian group. The other primary source I gave was an Egyptian painting that depicts people of different color that would suggest the diverse, heterogenous nature of the ancient Egyptians. This however may be dismissed as symbolic coloring, but I personally doubt this. \n\nI moved on to citing a graduating student's thesis as it provides the modern and early perceptions of ancient Egyptians. The author cited \"Black Athena Revisited,\" with \"Thus, to the critics, the 'ancient Egyptians were Mediterranean peoples, neither Sub-Saharan blacks nor Caucasian whites but peoples whose skin was adapted for life in a subtropical desert environment.'\" The author also provides \"The African Origin of Civilization,\" by Diop who concludes that Egypt is black based on a description from Herodotus. A refutation is cited from a few places, but the most pertinent in my opinion is from \"Black Athena Revisited\" and \"The African Sources of Egyptian Culture and Language.\" The first states: \"To refute this, Bard, cited studies that have analyzed the metrical variations in skulls. Bard concluded that due to geographical proximity, it was not surprising that the Egyptian skulls were not very distinct from the skulls found at Jebel Moya in northern Sudan, but were much more distinct from all others, including those from West Africa.67 However, she also pointed out that the ancient Egyptian skulls also differed from skull samples from Europe and Asia.\" The second states: \"Ancient Egypt, as noted above, had highly mixed population and thus application of “race” on this society becomes not only anachronistic, but more complicated. Thus “the extent to which the antagonists- the Classicists, as we might call them-, on the one hand, and the Diop-influence variety of Afrocentrists on the other –seem unaware of advances in genetic theory...\" The author also cites a DNA study of a Lower Egypt priest and found that \"these sequences when compared to the sequences recovered from the Delta population (Lower Egypt), it were found to be identical to four of the modern Egyptian mitochondrial lineages.\" \n\nThe original poster, mr_mack_a_bitch, labeled all of my citations as \"white-washed Victorian Academia.\" He goes on to state that the first twenty-five dynasties were African in the sense that they are negroid and the Ptolemaic Dynasty was the \"first half African dynasty.\" He asserts a that the archaeologists have even \"tried\" classifying Ethiopians as Caucasians. He also cites that the Egyptians called their land, \"Kemet,\" or the black land. Godroe then states that contemporary archaeologists don't classify Ethiopians as racially caucasian, but claim that they instead use misleading forensic terminology. The original poster also brings up Kemet, and I refute the claim on Kemet as a misinterpretation and that it instead refers to the fertile soil of the Nile River Valley. I say that Ethiopia is irrelevant to the topic of ancient Egyptians, but I do point out that Ethiopia is also a diverse country. I point out that the only correct answers to the Ancient Egyptian Race Controversy is 1) racial ideology cannot be applied to a race-less society. 2) if you did apply racial ideology, you'd discover that Egypt is and always has been a diverse heterogenous civilization as evidenced by the skin colors in paintings and no race has special claim to the Egyptian civilization.\n\nGodroe comes back to refute my citations stating the I didn't list any DNA studies when the thesis did include genetic studies, but I still came back by citing the Encyclopedia of the Ancient Egyptians that states that blood typing mummies show that the ancient Egyptians are similar to modern Egyptians. I go on to point that this doesn't definitively affirm race, but it does point out the existing similarity. They mostly dismissed this argument even though one of them said that blood-typing is significant in determining race -- I then linked a 2013 study that studied five mummies from the Third Intermediate to Ptolemaic Period, the study doesn't say which period this one particular mummy came from (maybe I overlooked), but it stated that the mummy had the haplogroup I2 with a confirmation of 97.5%. They pointed out that because most of the randomly selected mummies were from the Ptolemaic Period, it was invalid.\n\nTaking it as fair criticism, I move on to citing a craniometric study that studied skulls from a Akhmim. Seventeen were from the Ptolemaic Period, but there were ones dating all the way back to the First Intermediate Period. The study’s results only had 12% of the skulls of sub-Saharan origin. Godroe stated that because it was from Akhmim \"a Lower Egypt town\" was invalid as a study to determine the race of all Egyptians. I pointed out that there are sources cited in the study as to why Akhmim was chosen and it was because even during the Ptolemaic Period, the Egyptians maintained their biological \"sovereignty\" for lack of a better word so one may conclude that Akhmim was indeed a majority native Egyptian city.\n\nAfter this last bit, I kind of gave up arguing with the person, so now I'm here asking the question: \"Am I crazy?\" I really do feel like I'm missing something crucial and important when I say that Egypt wasn't a black civilization, so I'd really appreciate someone knows more about the subject of ancient Egyptians to shed some light on who the ancient Egyptians were in terms of physical race. I would also like to thank you in advance as I really do appreciate you helping me deepen my understanding of who the ancient Egyptians were. Here is the Instagram post: https://instagram.com/p/BQKxiUqBNv-/\n\nTL;DR: I argue that ancient Egypt could never be a homogenous negroid civilization, but it was rather a diverse civilization. I'd like if I'm right or wrong to assert this claim.\n\nHere are all of my sources used: http://anthropology.msu.edu/anp455-fs14/2014/09/18/ancient-egyptian-race-debate/\n\nhttp://www.egyptian-museum-berlin.com/c53.php\n\nhttp://news.nationalgeographic.com/news/2005/05/0510_051005_tutsface.html\n\nhttp://m.imgur.com/JR4jXh0?r\n\nhttp://drmsh.com/wp-content/uploads/2015/06/Mwanika-Ancient-Egyptian-Identity.pdf\n\nhttps://www.ncbi.nlm.nih.gov/m/pubmed/26270337/\n\nhttp://essays.backintyme.com/item/44\n\nhttp://mspace.lib.umanitoba.ca/bitstream/handle/1993/23992/Klales_Alexandra.pdf?sequence=1&amp;isAllowed=y\n\nhttp://www.dbc.uem.br/docentes/cida/S10MumiaMetagenoma2015.pdf",
        "created_utc": 1486690289,
        "upvote_ratio": ""
    },
    {
        "title": "Are languages considered to be a type of norm? If so, why/how?",
        "author": "AlexKingstonsGigolo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5t2c87/are_languages_considered_to_be_a_type_of_norm_if/",
        "text": "",
        "created_utc": 1486669709,
        "upvote_ratio": ""
    },
    {
        "title": "Anthropologists of reddit: what could be an interesting framework to study AI and affective computing?",
        "author": "3stamme",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5t1123/anthropologists_of_reddit_what_could_be_an/",
        "text": "",
        "created_utc": 1486658203,
        "upvote_ratio": ""
    },
    {
        "title": "Citation in Fragments of an Anarchist Anthropology",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sxkax/citation_in_fragments_of_an_anarchist_anthropology/",
        "text": "Graeber mentions Kasia Eckholm writing on kings in the Kongo which were effectively neutered by being sanctified. But I can't find the paper he's referring to or any other citation of it. Anybody familiar?",
        "created_utc": 1486610049,
        "upvote_ratio": ""
    },
    {
        "title": "Is what Yuval says in 'Sapiens' about 1000 square km areas for hunter/gatherers true?",
        "author": "impfireball",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sxjt3/is_what_yuval_says_in_sapiens_about_1000_square/",
        "text": "He says there are groups of hunter/gatherers that stuck to 1000 square kilometer areas.  I was always under the impression that they traveled much further, before I read this.  \n\nThough it does make sense - having to learn about which plants are poisonous in a new region, can result in a lot of extra death in the tribe.",
        "created_utc": 1486609867,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a consensus on why Native American names are so often literally translated in English?",
        "author": "208327",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sxegh/is_there_a_consensus_on_why_native_american_names/",
        "text": "It happening across so many tribes and languages rules out a quirk of the culture since they're so diverse and disparate but is there a generally agreed upon reason why names like Sitting Bull, Crazy Horse, Dragging Canoe, Old Lady Grieves the Enemy, etc are so common for those peoples in the English language?",
        "created_utc": 1486608064,
        "upvote_ratio": ""
    },
    {
        "title": "Is it a man's nature to chase a woman's sexuality?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5swtln/is_it_a_mans_nature_to_chase_a_womans_sexuality/",
        "text": "[deleted]",
        "created_utc": 1486601311,
        "upvote_ratio": ""
    },
    {
        "title": "What are the origins of the concept \"Necromancy\"?",
        "author": "FancyVelociraptor",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5svr08/what_are_the_origins_of_the_concept_necromancy/",
        "text": "By necromancy, I mean any form of communication with the dead, bringing the dead back, spirit hauntings, immortality, etc. Are there any old books like the Papyrus of Ani that I could find in a museum or find a complete copy of? What culture was the first to attempt to raise the dead and communicate with spirits? Regardless of the success, what were their methods? Was it tied into their religion/beliefs? What were those beliefs?\n\nEdit: A comment was made that I should ask for the earliest evidence of any attempts to raise the dead. So, exactly that. What is some of the earliest evidence that any culture attempted necromancy and where can I find it? Where was it found? ",
        "created_utc": 1486590278,
        "upvote_ratio": ""
    },
    {
        "title": "I found a reference to the \"The Denouncement of Pátzcuaro\" signed by 30 anthropologists against SIL. I can't find the original document. Can anyone help me?",
        "author": "PokerPirate",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5svqp4/i_found_a_reference_to_the_the_denouncement_of/",
        "text": "The reference in question is\n\n&gt; In 1975, thirty anthropologists signed \"The Denouncement of Pátzcuaro\", alleging that SIL was a \"tool of imperialism\", linked to the CIA and \"divisions within the communities that constitutes a hindrance to their organization and the defence of their communal rights\".\n\nat http://www.akha.org/content/missiondocuments/sil.html",
        "created_utc": 1486590188,
        "upvote_ratio": ""
    },
    {
        "title": "Do anthropologists ever discuss communities where everyone is close or face to face?",
        "author": "ahoyaboy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5su8zz/do_anthropologists_ever_discuss_communities_where/",
        "text": "I'm sorry this question is rather awkwardly worded. It feels like it's common for people to fantasize about communities where, for example, everyone knows everyone else in their neighbor. I'm sure cultures where people live in bands or in medieval villages basically for this description. But I want to read about how communities like this exists and how that contrasts where people don't really know or associate with those around them. Like an anthropology of community.\n\nAlso I would like to read how community exists in cities as wel. Like how they could exist in cities.  ",
        "created_utc": 1486576506,
        "upvote_ratio": ""
    },
    {
        "title": "Why are sounds like a nail across a chalkboard so universally disliked?",
        "author": "creekpop",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5srbtw/why_are_sounds_like_a_nail_across_a_chalkboard_so/",
        "text": "I understand it is basically an annoying high pitched sound, but there seems to be something about even the thought of scratching the board with the nail or even the chalk that seems to be deeper than just auditory.",
        "created_utc": 1486538836,
        "upvote_ratio": ""
    },
    {
        "title": "Are the concepts of 'day' and 'night' universal to all human cultures?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sqtaw/are_the_concepts_of_day_and_night_universal_to/",
        "text": "[deleted]",
        "created_utc": 1486530851,
        "upvote_ratio": ""
    },
    {
        "title": "How much have the physical characteristics of Eurasians changed within specific regions in the past 10,000 years?",
        "author": "fendoria",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sqe7n/how_much_have_the_physical_characteristics_of/",
        "text": "I wasn't sure how to ask this question. Put another way, I'm wondering how conserved physical appearances have been within regions in Eurasia since around 8,000 BC. Are current occupants of a region our best estimate of what ancient peoples in that area looked like? Are there specific exceptions to this rule that come to mind?\n\nFor instance, do we know if Sumerians looked more like present day Iraqis than any other modern group of people?\n\nOne exception I know about is the Indo-European speaking [Afanasevo culture] (https://www.wikiwand.com/en/Afanasevo_culture) and its successors, whose people inhabited modern day western China but had Europid features. Are there any other known dramatic differences between past and present appearances of the major occupants within an area like this one? ",
        "created_utc": 1486525535,
        "upvote_ratio": ""
    }
]