[
    {
        "title": "Are there books on the anthropology/sociology/ethnography of organized crime?",
        "author": "AzrielEver",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/105w8s9/are_there_books_on_the/",
        "text": "Sorry if this question sounds awkwardly phrased. \n\nFor context, I’m an amateur writer trying to write various characters from criminal backgrounds accurately without looking too much like a fool.\n\nWondering if there are books dealing with the subcultures, norms and values as such exist, social organization, and other relevant details of life experience that can be expected for someone within a criminal organization. To be specific, yakuza and Mexican cartels. \n\nThank you ahead of time and I will try posting in other subs for relevant information.",
        "created_utc": 1673116945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books or readings on the peopling of the Americas? Also thoughts in general on the leading theories?",
        "author": "PepinillosFritos",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/105vj17/books_or_readings_on_the_peopling_of_the_americas/",
        "text": "My classes have gotten me intrigued on the topic of the peopling of the Americas. I know of the Ice-Free Corridor/Beringia theory, the Pacific/Coastal theory, as well as the Solutrean theory (though I personally find this one unlikely). It’s my understanding that Ice-Free theory was the leading theory for a long time prior to the discovery of several pre-Clovis sites.\n\nCan anyone recommend any good books or readings on these theories, or other theories on this topic? This great mystery in the story of humanity has me fascinated.",
        "created_utc": 1673115148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hunter-Gatherers post-Neolithic Revolution",
        "author": "skiiiirrt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/105ulik/huntergatherers_postneolithic_revolution/",
        "text": "Where I live in North America, there are indigenous peoples that maintained a hunter gatherer lifestyle after humans had become \"agrarian\". Was this due to a lack of technology relating to farming, or was it simply a sociocultural choice?  \n\n\nBTW: I'm not saying this in a derogatory way, I'm genuinely curious.",
        "created_utc": 1673112870,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did language start to develop in different cultures?",
        "author": "Bostonbruinsfan123",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/105t9v6/how_did_language_start_to_develop_in_different/",
        "text": "[removed]",
        "created_utc": 1673109533,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did liberals manage to create “cultural appropriation” a culturally conservative concept?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/105sfwp/how_did_liberals_manage_to_create_cultural/",
        "text": "Cultural appropriation is a conservative concept in that it tries to limit cultural exchange while liberalism tries to be internationalistic.\n\nWhy should a liberal suggest this idea that limits cultural diffusion?",
        "created_utc": 1673107415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do the modern Turks look European despite the early Turkish tribes at the beginning of the Ottoman Empire having Mongolic characteristics?",
        "author": "Upbeat_Pilot_9077",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/105erml/why_do_the_modern_turks_look_european_despite_the/",
        "text": "",
        "created_utc": 1673062851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were early hominins like Australopithecus preyed upon more often?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1058j5z/were_early_hominins_like_australopithecus_preyed/",
        "text": "Despite having all the same dangers as us living on the land. They were a lot smaller-bodied, had the same brain size as a chimp, far smaller groups that were less coordinated, far simpler communication and virtually no tool use in addition to being poor runners and lacking the ability to make fire. Is there any evidence to suggest that they actually had higher predation rates than later hominins like erectus or paleolithic sapiens?",
        "created_utc": 1673046264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book suggestion for understanding early humans &amp; humanity in general",
        "author": "xPrivateIdaho",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10573np/book_suggestion_for_understanding_early_humans/",
        "text": "I wanted to read The Rise and Fall of the Third Chimpanzee by Jared Diamond, but I am told it is very outdated.\n\nWhat is a good book that will help me understand the history of humans? \n\nSomething accesible and not too academic, if possible!",
        "created_utc": 1673042886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have there been any cultures without a concept of morality?",
        "author": "undefinitive",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10525ve/have_there_been_any_cultures_without_a_concept_of/",
        "text": "",
        "created_utc": 1673031209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Human Remains found on Private Property in Alaska",
        "author": "Major-Panda-1775",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10521h3/human_remains_found_on_private_property_in_alaska/",
        "text": "Good morning! \n\nI was recently listening to a podcast that featured a gentleman named John Reeves from The Boneyard Alaska. Mr. Reeves is a land owner/miner who has stumbled upon an absolutely immense amount of paleontological material from the Pleistocene. During the podcast, Mr. Reeves also alluded to finding Human remains on his property and that he quietly disposed of the remains. Based on all of the information he presented, it seems he could be sitting on an extremely important site that both Archaeologists and Paleontologists could learn an immense amount from.\n\nMy question is: Legally, how big of an offense is this? From my limited understanding, the discovery of human remains on an Archaeological site carries a lot of responsibility, ethics, and local/federal laws to ensure they're handled respectfully and properly. Is this not the case since he is the land owner?",
        "created_utc": 1673030925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Veracity of this claim?",
        "author": "cococrabulon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104udxu/veracity_of_this_claim/",
        "text": "Hi all, was hoping if you could advise on how accurate this claim is. I found it here\n\nhttps://www.washingtonpost.com/archive/politics/1989/05/01/samurai-descended-from-aborigines-anthropologist-says/0d5c7a60-266d-4ab6-a9cc-24f3c1fbe6f9/\n\nAnd it asserts that many samurai showed evidence of being descended from Ainu and you can tell this from measuring their skulls. Additionally, C. Loring Brace asserts their facial features can be found in the modern Japanese royal family and historical depictions. Together this suggests the samurai as a group could be physically distinguished from the common Japanese and that the elite had a distinct appearance.   \n\nI find this… a fishy claim. From my reading on early samurai history, it’s clear at least some early samurai (or bushi) came from Emishi stock, especially in the northern frontiers of the Heian Court’s influence. From descriptions we know Emishi were ‘hairy people’ and there was of course mixing on the frontiers, and modern genetic studies confirm the Japanese population are a mix of Jomon and Yayoi peoples, the latter arriving later from the Chinese mainland and/or Korea and bringing rice cultivation with them. In his defence the Emishi are described as fighting as mounted archers, and the bushi came into their own fighting against them using similar tactics. It’s clear many samurai were likely associated with the Emishi and intermarried during their conflicts, and it was from these conflicts many samurai clans gained prestige. \n\nBut I also find it fishy because:\n\n- Measuring skulls seems… imprecise? \n\n- The study is from the 80s. Surely genetics now provides more of an insight?\n\n- How can you tell who is a samurai/bushi from a skeleton and who isn’t?\n\n- Bushi were recruited from across the country and not always from the Northeast, so it’s feasible the samurai represented a range of appearances and certainly it brings into question that they would all look Ainu. Additionally, many bushi clans such as the Taira and Minamoto were closely associated with the court at Heian Kyo and didn’t represent a purely ‘frontier’ origin. This is in edition to the Japanese elite being based away from the wars with the Emishi. \n\n- Given the variety of potential origins of the samurai, were they really so physically identifiable as a social class? There doesn’t seem to have been any conscious identification from the sources I know with a specific appearance. They were more identified using sumptuary laws and their status as a warrior elite, and later as a discrete class by the Edo Period. But before that the status of samurai was looser. \n\n- Modern Japanese also have a range of appearances.   \n\n- Theatre masks seem like a poor example given they have exaggerated features.    \n\nI also think that saying the samurai are Ainu-descended conflates the Emishi with the modern Ainu somewhat. From what I understand the ‘hairy people’ were not so homogenous. The Emishi homelands were further south than Hokkaido, and the Ainu may well be a more northerly, related but nevertheless separate people to the people the Heian court termed ‘Emishi’. \n\nAny advice on the veracity of this claim would be appreciated.\n\nThe claim has been repeated in the below link and I’m skeptical since I can’t find much else on the subject.   \n\n https://oishya.com/journal/10-fascinating-facts-samurai-female-samurai/",
        "created_utc": 1673012208,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were some of the societies that were not sexually repressed?",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104snd0/what_were_some_of_the_societies_that_were_not/",
        "text": "Tell me more/link me information about them  please. \nI am curious to know how societies like that functioned.",
        "created_utc": 1673007066,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most incredible/important places or artifacts that still exist which most humans can never see in real life?",
        "author": "adumbnerd",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104jxrq/what_are_the_most_incredibleimportant_places_or/",
        "text": " \n\nSome examples that I can think of are:\n\n\\- The Elephants Foot at Chernobyl\n\n\\- The caves at Lascaux\n\n\\- The skeleton of Lucy\n\n\\- The Voynich Manuscript\n\n\\- The Secret Archives in the Vatican\n\n\\- Svalbard Seed Vault\n\nEtc.",
        "created_utc": 1672977177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did early humans hunt by running down animals until they collapsed?",
        "author": "AnyCriticism",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104jbl4/did_early_humans_hunt_by_running_down_animals/",
        "text": "I have just finished reading 'Born to Run' by Christopher McDougall and he claims that the main evolutionary advantage of homo sapiens is endurance running. He recounts a story of hunters in Africa chasing animals for hours until they collapse as an example of early hunting. How accurate is this to present day best theories given the book is quite old and has some dubious other claims?",
        "created_utc": 1672975441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forensic anthropologist in USA",
        "author": "Key_Rip_6640",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104fr61/forensic_anthropologist_in_usa/",
        "text": "Is it possible to work in forensic anthropology (government) if you are not American of EU citizen?  I want to enroll in a master's degree, but I don't know if I have a chance to get a job in this field in America. Does anyone have experience or information?",
        "created_utc": 1672965943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Field work and locations your research and career focus has taken you",
        "author": "MrCayenne101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104bs54/field_work_and_locations_your_research_and_career/",
        "text": "Anthropologists of reddit, what fantastic locations and/or field work have you been able to visit and participate in over the course of your career? Proudest work or moment in your research? Studying or working abroad?",
        "created_utc": 1672956445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anthropological view of games and play - like an update of Huizinga?",
        "author": "xMisterVx",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104bkjx/anthropological_view_of_games_and_play_like_an/",
        "text": "Homo Ludens is a... peculiar classic, to be sure, and shows its age. Are there any follow-up works this century that talk about the role of games, play etc?",
        "created_utc": 1672955999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do Asians mock/hate black people?",
        "author": "ontologicalodyssey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1049fte/why_do_asians_mockhate_black_people/",
        "text": "I've seen asians of all ethnicities talking down to black people. Chinese people yelling \"n*gger\" at NBA players in China. Koreans playing black music in clubs but excluding actual black people from entering said clubs (in Korea). Indians doing blackface. I've seen many Asians propogate caricatures from slavery, claiming black people are uncivilized and basically repeating exact white supremacist talking points from 4chan, damn near word for word. Is this just influence from the West's historical depiction of black people, or is there a deeper more historical reason for why Asians buy into antiblack narrivates about black people?",
        "created_utc": 1672951047,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the subs consensus on the paper published today on cave marks showing reproduction cycles of various animals?",
        "author": "hogger85",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/104733s/what_is_the_subs_consensus_on_the_paper_published/",
        "text": "I was reading an article about the cave marking showing animal reproduction and found the paper https://www.cambridge.org/core/journals/cambridge-archaeological-journal/article/an-upper-palaeolithic-protowriting-system-and-phenological-calendar/6F2AD8A705888F2226FE857840B4FE19#article-tab I was wondering i it made sense. One thing that surprised me is may 1st being month 1.",
        "created_utc": 1672945480,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we add a criticisms section to Graham Hancock's Ancient Apocalypse wiki?",
        "author": "kuriouskatz",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1044xw8/how_do_we_add_a_criticisms_section_to_graham/",
        "text": "So I think it would be immensely helpful for the average viewer of Ancient Apocalypse to see a list of criticisms, episode by episode, on [its wiki page](https://en.wikipedia.org/wiki/Ancient_Apocalypse). Most viewers are not reading archeology/anthropology blogs or articles, so this is probably the best way to reach people.\n\nCarl Feagans has already done a [great job in his blog](https://ahotcupofjoe.net/2022/12/ancient-apocalypse-summary-of-the-series-from-a-professional-pov/), taking notes episode by episode. On the video fronts, Stefan Milo released a [great mega video critique](https://www.youtube.com/watch?v=341Lv8JLLV4), and Kayleigh During is releasing a [video for each episode](https://www.youtube.com/watch?v=UkZ-7dFyAhc&amp;list=PLfwG3lpAr-iUqYwRcTdalSAqLrpc7h5m_&amp;index=3). And let's not forget the [critiques of Hancock's flood myth claims](https://www.youtube.com/watch?v=R9PpokN1b58&amp;list=PLfwG3lpAr-iUqYwRcTdalSAqLrpc7h5m_&amp;index=2).\n\nHowever, these blogs and videos are unlikely to be seen by the typical viewer of Ancient Apocalypse. Putting these criticisms on the wiki page would actually make a difference.\n\nSo how does one go about this? I imagine each criticism would need a source. Is anyone familiar with Wikipedia editing that can give some advice about how best to go make edits to the page that will stick?\n\nIs anyone up for helping with this project?",
        "created_utc": 1672940379,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some examples of ancient people having a myth or legend about a real historical figure?",
        "author": "TacoooJay",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1044eam/what_are_some_examples_of_ancient_people_having_a/",
        "text": "Wording might be a little confusing, but i'm looking for an example of ancient humans having a myth or legend of someone who was (either known or unknown to them) a historical figure. \n\nThe example that got me thinking of this was Sargon of Akkad, the first ruler of the Akkadian empire circa 2400 BC. The Assyrians later had legends about him, such as the below from a 7th century BC text\n\n&gt; My mother was a high priestess, my father I knew not. The brothers of my father loved the hills. My city is Azupiranu, which is situated on the banks of the Euphrates. My high priestess mother conceived me, in secret she bore me. She set me in a basket of rushes, with bitumen she sealed my lid. She cast me into the river which rose over me. The river bore me up and carried me to Akki, the drawer of water. Akki, the drawer of water, took me as his son and reared me. Akki, the drawer of water, appointed me as his gardener. While I was a gardener, Ishtar granted me her love, and for four and ... years I exercised kingship.\n\n\n\n\nI find it interesting that a real human being could become this mythical, deified figure. Any other examples would be appreciated!",
        "created_utc": 1672939051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poverty Point Figurines",
        "author": "Yampitty",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1043fao/poverty_point_figurines/",
        "text": "I'm getting ready to take a Trip to Poverty Point in Louisiana.  When I looked at the state park's web site, I saw figurines very similar to the Venus figurines I associate with paleolithic Europe.  The figurines found in Louisiana are viewable here.\n\n[https://www.crt.state.la.us/dataprojects/archaeology/povertypoint/artifacts.html](https://www.crt.state.la.us/dataprojects/archaeology/povertypoint/artifacts.html)\n\nThe Wikipedia page for Venus figurines is located here:",
        "created_utc": 1672936706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did our hunting and gathering ancestors afford work the same level of importance as our current societies do?",
        "author": "chacaprr",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10403nf/did_our_hunting_and_gathering_ancestors_afford/",
        "text": "",
        "created_utc": 1672928527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instincts left over from early evolution. That affect man an women different today that we’re needed for survival of the human race.",
        "author": "jessmurray911",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/103y1di/instincts_left_over_from_early_evolution_that/",
        "text": "I’ve been going back to school so I’m psychology class discussing got some what off track. My Kids are graduated so not confining my degrees.  When someone asked what traits instinct as  man and women today are left over and Not needed, unwelcome in todays times.",
        "created_utc": 1672922583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acne Theory",
        "author": "Surfootballer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/103sp1x/acne_theory/",
        "text": "I propose that some genetic groups evolved for their adolescents to have a stronger predisposition to acne, as it helped distinguish between those mature enough to start a family.\n\nBy our late teens, most of us are fully grown, or 90% there. \n\nYet fertility (contrary to popular belief) peaks at around 24. \n\nOur brain and our maturity (eg risk-taking, common sense) keeps on growing but this typically stabilizes into our late 20s.\n\nEffectively, we look ready before we are. In many instances there's often not much difference between one's appearance at 20 and 28 apart from a slight reduction in collagen, a slight increase in build.\n\nYes, we can blame modern processed foods and lack of sunlight/fresh air, for acne being worse on a case-by-case basis. But the bottom line is that certain age-groups generally have acne more, and have more acne. There is no cure.\n\nAt some point, did the proclivity for these skin inflammations make young adults undesirable enough to stop them being married off before they were ready? As a marker.\n\nI believe/hypothesize that those who had to wait longer to marry, benefitted from it. They had safer, more prosperous families as a result. So the gene (for sebaceous glands to be overactive) has been reinforced.\n\nWhen putting this forward before, people have claimed that acne is a modern phenomenon, but reports and descriptions of acne date back to the ancient Egyptians and ancient Greeks.",
        "created_utc": 1672903210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Settling an argument with my conservative Mexican dad: are humans considered apes?",
        "author": "AzrielEver",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/103olnt/settling_an_argument_with_my_conservative_mexican/",
        "text": "Is there any *real* justification in classifying humans as a separate family from the other apes? Why or why not?\n\nIf possible, break it in layman’s terms.",
        "created_utc": 1672890349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know if anyone is working on a biography of David Graeber?",
        "author": "greyskiesatdawn",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/103lj9a/does_anyone_know_if_anyone_is_working_on_a/",
        "text": "Read the *The Dawn of Everything: A New History of Humanity* and then went down the rabbit hole of the authors' Wikipedia pages and he seems like a fascinating individual and was wondering if someone one was writing a biography. Thanks for letting me know if you are or know of someone who is. But also if no one is, I would love if this became a thing!",
        "created_utc": 1672881949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Methodology in Anthropology",
        "author": "Known-Wolverine5833",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/103hb9b/methodology_in_anthropology/",
        "text": "I study philosophy, and I wanted to get the thoughts of actual social scientists. It is commonly accepted in science that one follows methodological naturalism (excluding reference to supernatural things in explanations). However many things that are necessary to science are understood to be by philosophers as outside of nature; these include math, logic, normatively, and essences/natural kinds (human nature). If they are correct, that would mean that one cannot make reference to any of those things in scientific explanations; if that is the case I dont know what science would look like. I wanted to see what actual social scientists consider to be a part of nature, and how they make that determination. I was looking if people had books or articles to recommend on methodology in anthropology or any social science.",
        "created_utc": 1672871585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any books or articles on sex and sexuality?",
        "author": "qbookfox",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/103caw5/any_books_or_articles_on_sex_and_sexuality/",
        "text": "I’m very interested in anthropological studies of peoples sexuality, fetishes and sex lives, since I’m of the impression that there’s generally a lack of science and insight into the area, due to taboo in most places, and yet it’s something nearly all adults do.",
        "created_utc": 1672860038,
        "upvote_ratio": 1.0
    },
    {
        "title": "What role does culture play in sensory perceptions?",
        "author": "LD_67",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1035p8j/what_role_does_culture_play_in_sensory_perceptions/",
        "text": "Currently having a discussion with my mum as a 2nd year Uni student studying anthropology. Above the basic answer of different smells and sights in different cultures affecting us, how else does culture affect sensory perceptions? Are there any good examples from ethnographies etc that could be helpful? Any info/ opinion would be helpful!",
        "created_utc": 1672844479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite anthropological book or ethnography?",
        "author": "MrCayenne101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1030qc1/favorite_anthropological_book_or_ethnography/",
        "text": "Trying to invest in my reading. I'm wondering what favorite ethnographies and/or anthropological books you've come across and can recommend. Thank you",
        "created_utc": 1672829767,
        "upvote_ratio": 1.0
    },
    {
        "title": "How/why did some cultures evolve into hero-worshipping while others did not?",
        "author": "Dopmai",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/102rofb/howwhy_did_some_cultures_evolve_into/",
        "text": "Some cultures around us, even today, pratice hero-worshipping like they'd literally worship their sportspersons, actors, or other celebrities. \n\nWhat cultural changes led to this practice being accepted and normalised? \n\nE.g. In South Indian states, people have literally made temples of their favourite actors and politicians.\n\nThanks",
        "created_utc": 1672800256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any evidence to suggest that stories or general information have been shared between different species of hominids?",
        "author": "Agent14557",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/102pd5q/is_there_any_evidence_to_suggest_that_stories_or/",
        "text": "",
        "created_utc": 1672794064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Farming and Cultural Memory/Cultural Healing",
        "author": "PorcusCrassus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/102or9i/farming_and_cultural_memorycultural_healing/",
        "text": "I am a sophemore in college (I have not taken a methods course, although I have been reading books written about ethnographic methods). I am researching farming among Hmong people in Wisconsin. The project emerged last year when I was conducting farm audits and visited multiple Hmong farmers. In addition to there being very clear similarities in what was grown on Hmong farms, farming on rented land, etc, I also spoke to some of the Hmong farmers. Those that I spoke to told me a number of things, including that they do not farm for the money, that they sometimes make only $15 at a farmers market, that they \"farm for culture,\" and that, when they are at home their body aches but when they farm their body feels healthy.\n\nMy current research questions are:\n\n1. Why do Hmong farmers farm?\n2. How is Hmong identity produced/reproduced?\n3. How does farming reproduce Hmong identity?\n4. Why do Hmong farmers plant what they plant? \n5. (Some plants were grown at almost every Hmong farm I visited but were not grown at non-Hmong farms; this finding is also present in the literature)\n6. How and why does farming translate to physical healing?\n7. How does farming allow Hmong farmers to process cultural trauma/bring about cultural healing?\n8. What barriers do Hmong farmers face (ex., very few Hmong farmers farmed on land that they owned) and what are the roots of these barriers?\n\nI am hoping to conduct both ethnographic fieldwork by working on a number of Hmong farms and qualitative interviews (likely after conducting fieldwork).\n\nWhat other research questions might be helpful to ask? Additionally, are there any books/articles that might inform my research or help me in my initial planning stages? Additionally, how should I transform my research questions into questions that can be asked during fieldwork or during interviews?\n\nLastly, how do I write an IRB proposal? I am so confused about this part specifically.",
        "created_utc": 1672792513,
        "upvote_ratio": 1.0
    },
    {
        "title": "units of time of \"recently\" contacted people",
        "author": "thepuksu",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1027hfc/units_of_time_of_recently_contacted_people/",
        "text": "What sort of ways of time keeping was/is done by, hunter gatherers? Especialy in places where the seasons are diffenrent from europe and the middle-east. Like the Papua-New Quinean highlanders or peoples of Amazon rainforest.\n\nDid everyone have years or months?",
        "created_utc": 1672750487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you get a masters in anthropology with a different undergraduate degree?",
        "author": "haevne",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/101yjyw/can_you_get_a_masters_in_anthropology_with_a/",
        "text": "Could a history, indigenous studies, women's studies, sociology, or even general humanities degree lead into anthropology?\n\nNone of the colleges that are accessible to me have an undergraduate anthropology program but some of them do have graduate programs so I'm looking an avenue to get myself into the field via a different undergraduate degree.",
        "created_utc": 1672721514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay I got the books from my last post—I have more to request",
        "author": "aflakeyfuck",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/101wxzs/okay_i_got_the_books_from_my_last_posti_have_more/",
        "text": "Hi I asked for book recommendations on nutrition and got a ton of great recommendations that I’m going to barrel through. I am now wanting to compile a list similar to Exercised by Daniel Lieberman. I already got his book “The Story of the Human Body”.  I’m looking for evolutionary perspectives on human physical activity, exercise, our biomechanics, etc. \nmaybe i don’t know what I’m asking for and y’all can point me in the right direction. Either way!",
        "created_utc": 1672716837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diversity in the Upper Paleolithic?",
        "author": "keyboardsmashjsekgj",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/101jy16/diversity_in_the_upper_paleolithic/",
        "text": "I'm thinking about writing a novel set in a world inspired by the Upper Paleolithic, and I’m interested in how much diversity I can get away with. Presumably people would be very culturally diverse, but how different would people be appearance-wise? I know people were nomadic back then, but they’d have to walk pretty far to reach a group of people who looked drastically different from them. If the local population has (as a random example) light skin, dark curly hair and light eyes, how likely is it that anybody in the area would have dark skin, straight hair and dark eyes? \n\nI guess my issue is that modern audiences are very diverse, and it’d be strange to present them with a novel that is very homogenous in terms of the characters' appearances. Sorry if something like this has been asked before!",
        "created_utc": 1672684706,
        "upvote_ratio": 1.0
    },
    {
        "title": "How efficient was farming technology at the dawn of the neolithic?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/101jn4z/how_efficient_was_farming_technology_at_the_dawn/",
        "text": "How prosperous were the very early farming sedentary communities of the ancient world in terms of their food production? Obviously they were far less prosperous than modern farmers but how hard up for food were they compared to later pre-modern agricultural societies? Was the progression of farming efficacy and technologies a fairly linear process or has farming technology rapidly booned as of recent centuries?",
        "created_utc": 1672683968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Prehistoric Individuals See Themselves as an \"I\" or a \"We\" or...?",
        "author": "Bloginton",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/101fj5e/did_prehistoric_individuals_see_themselves_as_an/",
        "text": "I'm interested in the effects of greed in groups of interdependent individuals.  And, I'm wondering if greed even had the same meaning when people lived in small bands who counted on each other for survival.  Do such people primarily identify as the band they live in.  Or do they experience individualism in something like the same way as we do, now?",
        "created_utc": 1672673928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it that humans developed complex thought patterns, language, and speech before other animals?",
        "author": "EucalyptusBrain",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10171um/why_is_it_that_humans_developed_complex_thought/",
        "text": "It just seems strange that although early proto-humans were doing mostly the same things to survive as other animals species were, we were able to develop complex thought and social relationships while dogs (for example) weren’t able to. Why is this?",
        "created_utc": 1672646361,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point in the history of the genus Homo did sophonce first develop?",
        "author": "JohnWarrenDailey",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1016mby/at_what_point_in_the_history_of_the_genus_homo/",
        "text": "\"Sophonce\" being described as follows, from [The Associated Worlds website](https://eldraeverse.com/2012/02/02/the-s-words-sentience-sapience-and-sophonce/):\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;possessing all of *threshold autosentience*, *sapience*, and *volition*; i.e., being “a self-aware, self-defining entity capable of independent reason and volition”.",
        "created_utc": 1672644796,
        "upvote_ratio": 1.0
    },
    {
        "title": "What family structure is dominant in southern Portugal?",
        "author": "Direct_Solution_2590",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1015q5b/what_family_structure_is_dominant_in_southern/",
        "text": "Which one in the part that isn't labelled [here](https://static01.nyt.com/images/2012/07/17/opinion/17borderlines-map/17borderlines-map-blog427.jpg)",
        "created_utc": 1672641738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking into Anthropology degree, what kind of museum jobs could I get?",
        "author": "Alternative_Indie",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10157v7/looking_into_anthropology_degree_what_kind_of/",
        "text": "Hi! \n\nI’ve always been interested in studying human cultures and history, and not long ago I decided Anthropology would be a great degree for me. Currently, I am finishing up my Associate of Arts degree, but once I transfer, I will be pursing a B.A. in Anthropology. \n\nMy dream job is to be a museum educator—or at least to work in a museum. Will I be able to do any of that with a B.A. in Anthropology? \n\nThanks!",
        "created_utc": 1672640033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has the advent of modern medicine caused people to pick at their wounds/scabs more?",
        "author": "TheForthcomingStorm",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1013mti/has_the_advent_of_modern_medicine_caused_people/",
        "text": "",
        "created_utc": 1672634945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repatriation Ethics and Education",
        "author": "anthro-commie",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100z6qh/repatriation_ethics_and_education/",
        "text": "Sorry if these are weird questions, but I asked my university's department head &amp; he wasn't convinced these were actual jobs - thus, coming to Reddit! Do most Repatriation/NAGPRA Coordinators (or similar titles) have qualifications in Anthropology, or can they have other educations as well, such as Indigenous Studies, American Studies, Museum Studies, Pre-Law etc? Or, do they have to go to an Anthropology program which specializes in ethics?  \n\n\nAdditionally, I know that the idea of repatriation is a hot debate topic outside of anthropology - is it the same within the field, or is there a consensus? Are these specialists respected, or is there more of a culture of resistance against giving artifacts and remains back? My classes haven't covered NAGPRA, other than to say it doesn't apply to U.S. territories, only states.",
        "created_utc": 1672621961,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best books on human evolution and the Paleolithic?",
        "author": "QiPowerIsTheBest",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100wnzw/what_are_the_best_books_on_human_evolution_and/",
        "text": "Popular text and textbook.",
        "created_utc": 1672615235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considering a Minor in Anthropology",
        "author": "dbdbdib_saturday",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100vbaf/considering_a_minor_in_anthropology/",
        "text": "Hello everyone I am currently a freshman in college majoring in zoology. However I also really enjoy history and anthropology. I am not too sure yet whether I will like doing zoology so i wanted to pick up a degree in either history or anthropology so I can do that instead if all else fails. \nMy question is: Can I become a high school history teacher with a degree in anthropology? Or would I be able to go back to school and get a masters in archeology when I got a minor instead of a major in archeology as an undergrad?\nThanks",
        "created_utc": 1672611809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best sites in south France to visit?",
        "author": "BearsBeetsBerlin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100t9pq/best_sites_in_south_france_to_visit/",
        "text": "I am visiting the south of France next year and I know there are a lot of pre-history sites like caves. What are some sites or museums I can visit as a tourist? Thanks in advance!",
        "created_utc": 1672606771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I learn about cross cultural responses to seasonal/physical allergies where the body responds to allergens from the environment?",
        "author": "pigeonstrudel",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100s1k4/where_can_i_learn_about_cross_cultural_responses/",
        "text": "I guess I wonder where to ask this specific question: I want to read some research into cross cultural interpretations and responses to allergies. How are they discussed and interpreted? Accordingly, what sort of area of study addresses this question most?",
        "created_utc": 1672603541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Family History Archive Questions",
        "author": "mtbaga",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100r90b/family_history_archive_questions/",
        "text": "Hello everyone, I am new to this community but I was hoping you all could help me out.\n\nMy grandma passed away this morning, my last grandparent. With her goes the last direct memory of our first generation in this country so this is a huge loss for our family culture.\n\nAbout a week ago I hit on the idea of doing a series of interviews with family members as a sort of video archive of our history and the people in our family - who they were, what they did, what were they like, etc...\n\nThe problem is I am at a loss on how to start something like this. I would appreciate any suggestions on the types of questions I should ask, how to do the interviews, best methods for preservation (YouTube perhaps?).\n\nMy grandparents were truly amazing, hardworking, infinitely loving people and we come from a proud family of immigrants too stubborn to know when we are beaten. I find myself amongst the last 4 people who remember a time before tragedy and upheaval isolated my brothers and cousins from our past. I want to do what I can to preserve what is left.\n\nPlease, if there is any help you can offer it would mean more to me than I can possibly express.",
        "created_utc": 1672601514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do ancient humans smell bad because they have poor hygiene?",
        "author": "Dangerous-Policy-602",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100l2pv/do_ancient_humans_smell_bad_because_they_have/",
        "text": "",
        "created_utc": 1672584317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you help me recall this recent book on trickster, troublemakers, mischiefers as figures in the internet that we live with today?",
        "author": "Khilafiah",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100jryy/can_you_help_me_recall_this_recent_book_on/",
        "text": "My apologies if this is going to sound super vague, but I've been trying to recall this book I initially planned to buy for Christmas. I lost my notes and relevant reviews of the book that I stored last year due to drive failure.\n\nWhat I can remember about the book was the title is styled similar to Bella Coleman's *Hacker, Hoaxer, Whistleblower, Spy* (a couple of figures put together). The book is about how in this \"post-truth\" era we're living with this many figures of tricksters, trolls, conspiracy theorists, and pranksters not unlike Philippines' Duterte. \n\nThe author of the book is a well-known anthropologist who don't usually write something about internet culture... but really can't remember who. I initially thought it was Michael Taussig but it's not him.\n\nCould someone please kindly offer a help? I've been scouring my notes to no avail...",
        "created_utc": 1672579957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Before modern medicine, were people in pain all the time?",
        "author": "crystalcosmos",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100izel/before_modern_medicine_were_people_in_pain_all/",
        "text": "I'm always astounded when I learn about the various diseases and parasites that people seemed to regularly endure a few hundred and few thousand years ago.\n\nFor example, I'm reading about Ötzi the Iceman (frozen body of a man found between Austria and Italy who lived about 5,200 years ago). They suspect he had whipworm (an intestinal parasite), considerable dental deterioration, bone and joint degeneration, and had been sick three times within the last 6 months before he died.\n\nFrom Wikipedia, an evaluation of Chinese noblewoman Xin Zhui, who lived around 200 BC, showed this:\n\n\"As she aged, Xin Zhui suffered from many ailments that eventually led to a heart attack that killed her. Along with schistosomiasis, a parasitic infection, she also had coronary thrombosis and arteriosclerosis, most likely linked to excessive weight gained due to a sedentary lifestyle, diabetes, angina pectoris, liver disease, and hypertension. Lumbago and a compressed spinal disc probably caused her immense pain, which contributed to a decrease in physical activity. She also suffered from gallstones, one of which lodged in her bile duct and further deteriorated her condition. Her arteries were almost totally clogged.\"\n\nI acknowledge that a lot of Xin Zhui's ailments are common today, but she wouldn't have had the same treatments or pain management options available.\n\nA more recent (but still longstanding) example is initiation ceremonies in populations of Aboriginal Australians. An example is circumcision in young men, and scarification in both young men and women of the Wunambal people of Western Australia.\n\nOne last obvious example is childbirth and menstrual cramps, particularly when conditions like endometriosis are involved.\n\nSo my question is, did people before - or without access to - modern medicine experience physical suffering pretty much all the time? Or did they have a significantly higher pain tolerance? Or both? Honestly their quality of life in this regard sounds miserable, but the fact that we're here today means people persevered through it all, somehow. I'm aware that we've always had various forms of pain management from herbs to acupuncture, but for the vast majority of human history, we didn't have access to paracetamol or anaesthesia.",
        "created_utc": 1672577344,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is domestic violence in hunter-gatherer groups?",
        "author": "AGcuriousity1998",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/100gqtt/how_common_is_domestic_violence_in_huntergatherer/",
        "text": "These groups are egalitarian, but it has said that domestic violence still occurs. Although it is difficult to study violence between spouses and relatives, especially in a radically different culture, it is possible to determine the rate of violence by asking the subjects questions and keeping record of random (visible) violent acts among spouses or relatives.",
        "created_utc": 1672568000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me pick a university program",
        "author": "wafsyr",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10044wd/help_me_pick_a_university_program/",
        "text": "So, I find all aspects of anthropology fascinating. But I know I’ll have to narrow down my studies to something more niche in graduate school and so on. I know I’m most interested in bioarchaeology and paleoanthropology, but I’m not sure if I should pick a program geared more toward archaeology or bioanthropology. \n\nI applied to a few undergraduate programs for next fall and I’m having trouble picking a school. Acceptance letters are already being sent out and I’ll have to pick one by February. My top two choices are CSUF or CSUSB. \n\nBased on my research, it appears that CSUF offers more specialized courses for evolutionary anthropology while CSUSB offers more hands-on field work experience in archaeology. Can someone in the field tell me which school would best prepare me for graduate school and/or a career? CSUF has lab courses relating to physical anthropology but I think CSUSB has contacts with an actual field school.",
        "created_utc": 1672522116,
        "upvote_ratio": 1.0
    },
    {
        "title": "What text can improve my understanding of the daily lives of people that live on the streets or in extreme poverty (in a big city)?",
        "author": "Dmaias",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/1003d2u/what_text_can_improve_my_understanding_of_the/",
        "text": "Hello, I'm a doctor that just started to work in a free clinic inside a place that provides food and some services for people that live in the streets.\n\nAnd i find my cultural expertise to be... barely enough, but i'm sure it's costing me rapport with my patiens when they talk about aspects of their daily lives that i've never experienced.\n\n I've always liked to read somethings about basic anthropology. And i'm in the process of looking for ethnographies that talk about this subject, looking for people that got to know the communities, and how they interacted with the state and criminal organizations.\n\nI've found The weight of the world by Pierre Boudeliere, and flamable by Javier Auyero, are these any good? (Found auyero looking foor argentinian/latinoamerican sources)",
        "created_utc": 1672519859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which civilization made human sacrifices to volcanoes?",
        "author": "Noah_748",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/10000yp/which_civilization_made_human_sacrifices_to/",
        "text": "",
        "created_utc": 1672510272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that all non-africans today descended from the same ancestors that left africa?",
        "author": "proudandashamedcurry",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzsvyh/is_it_true_that_all_nonafricans_today_descended/",
        "text": "All my life, I thought there were different waves of human ancestors leaving africa which explains the phenotypical differences of non-africans but turns out every non-african, from asians to europeans shared the same set of ancestors that left.\n\nAlso if this is the case, does that mean every non-african are more related to each than they are to native africans?",
        "created_utc": 1672489023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Combining superstition with modern medicine",
        "author": "RhiaBOX",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzs35p/combining_superstition_with_modern_medicine/",
        "text": "I'm trying to convey to someone a concept that I just remembered that interested me; I swear there was a single term for this that I can't remember. It's where western medicine is integrated into cultures that rely more on medicine folk when turning to answers for illness or disease—you don't just force the medicine, but work with the leaders to faithfully integrate the medicine (vaccines, supplements, you know, whatever is needed) so that the people being treated receive the full benefit of both. What is that called?",
        "created_utc": 1672486046,
        "upvote_ratio": 1.0
    },
    {
        "title": "What in occurred in the transition between the Neolithic and Bronze Ages that lead entire societies to losing thousands of years of information and developing religious narratives centered around the birth of the bronze age civilization?",
        "author": "ReflectionThick6981",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzo17y/what_in_occurred_in_the_transition_between_the/",
        "text": "Was it an unconscious process where one throws away the vestigial bits of information that gets one where they are, while being no longer needed? Like a sort of socially conditioned cognitive bias? When did the concept of the hunter gatherer change from \"atleast I'm not one of them\" to something entirely foreign to the ancient mind?",
        "created_utc": 1672470060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do anthropologists know why humans started building their architecture to align with the solstices/equinoxes?",
        "author": "land-of-theater101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzfy6c/do_anthropologists_know_why_humans_started/",
        "text": "I've always been fascinated by ancient structures that aligned with the solstice and/or the equinox. For example, the sun rising directly above one of the stones in Stonehenge during the Summer solstice, or the sun making a snake pattern on the side of a pyramid in Chichen Itza during the Spring equinox. Do we know why humans were so drawn to these events?",
        "created_utc": 1672445489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there/have there been any cultures without any funerary practices at all?",
        "author": "Cheeseanonioncrisps",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzf5rg/are_therehave_there_been_any_cultures_without_any/",
        "text": "Outside of plagues or other desperate circumstances where there are just too many dead to handle.\n\nObviously corpses have to be disposed of *somehow*, but most cultures seem to have some sort of ritual or symbolic significance attached to the process. Is this a universal thing? \n\nAre there any cultures out there— or have there been any cultures in history— where disposal of the dead isn't viewed as anything special?",
        "created_utc": 1672443478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone ELi5 what a dowry is, vs bride price, and why would anyone do each?",
        "author": "Cyclonestrawberry",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzdokn/can_someone_eli5_what_a_dowry_is_vs_bride_price/",
        "text": "Asking as a Millennial from Canada who did not grow up in this context, I'm looking to understand. Thanks.",
        "created_utc": 1672439716,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the proper academic way to engage with and deploy the terms of a “left-wing” and “right-wing?”",
        "author": "Brojangles1234",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zzb0sy/what_is_the_proper_academic_way_to_engage_with/",
        "text": "These terms are typically utilized in public discourse to loosely delineate certain political orientations or affiliations such as “liberal” and “conservative”, or in American discourse “Democrats” and “Republicans”. I was wondering, what are the implications to utilizing the terms of “left/right wing” and what is the appropriate way to do so academically while considering the variation in local and global interpretations of the terms?",
        "created_utc": 1672433129,
        "upvote_ratio": 1.0
    },
    {
        "title": "If most African Americans have Europeans ancestry, why is the presence of European mitochondrial DNA so rare?",
        "author": "Complete-Ad9266",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zza4dn/if_most_african_americans_have_europeans_ancestry/",
        "text": "",
        "created_utc": 1672430907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Jung’s archetypes still useful today?",
        "author": "WizardArchetype2",
        "url": "/r/askpsychology/comments/zy6q5c/are_jungs_archetypes_still_useful_today/",
        "text": "",
        "created_utc": 1672415531,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is it correct to write that in the Palaeolithic era, “humans changed their behaviour and became more sedentary beings”?",
        "author": "SufficientAdagio914",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zyvh2r/is_it_correct_to_write_that_in_the_palaeolithic/",
        "text": "It’s in the context of a blog about history of naturism (with help from a feminist writer in Venezuela) at [this link](https://www.hokepos.org/a-walk-through-naturism). \n\nThe blog posts are all short and succinct, intended to stimulate reflection and conversation.  They have themes from prehistory to the present day, including examples from Ancient, Western, Middle East, Asian and South American cultures.\n\nI’ve designed the website to incorporate a forum for comments at the end of each topic.  I’m quite new to web design and it’s the first time I’ve tried allowing comments on blog articles. I’d like the blog to be a stimulus to conversation and I wonder if you might help by commenting on its themes or suggesting further ideas?\n\nThanks 🙏",
        "created_utc": 1672389460,
        "upvote_ratio": 1.0
    },
    {
        "title": "where can i find a book on great anthropological finds",
        "author": "LetsGeauxSaints",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zyrtkp/where_can_i_find_a_book_on_great_anthropological/",
        "text": "i would love a book with good quality pictures of the finds and a description of them. where can i find such a book?",
        "created_utc": 1672377257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considering Post Grad in Anthropology, advice?",
        "author": "gucci_stainz",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zycnr4/considering_post_grad_in_anthropology_advice/",
        "text": "I graduated in 2021 with a BSc in Physical Geography (Similar to environmental science) been working since graduation and really not liking the career prospects. Pretty soul draining and I'm not enthusiastic about it at all. \n\nIn my last semester at school I took an environmental anthropology course and fell in love. It was hands down one of my favorite courses. After that course I realized I should've majored in the arts rather than sciences. \n\nSo I'm thinking of going back to grad school for anthropology, but I don't want to take on debt. Would I be able to get in a funded grad school for anthropology with my background? If so is it even something I should do? I hear terrible things about academia and not sure what the job prospects are like for anthropology. Yes I see job postings online but not sure how competitive they are or if they are \"good\" jobs.",
        "created_utc": 1672339116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for book recommendations",
        "author": "Luna0207",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zybnpf/looking_for_book_recommendations/",
        "text": "Hello 👋 \n\nI am looking on book recommendations for ethnographic methods (or qualitative methods in general).\n\nThank you!",
        "created_utc": 1672336698,
        "upvote_ratio": 1.0
    },
    {
        "title": "What field is this within Anthropology",
        "author": "ClassroomSweaty3094",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zxu3jq/what_field_is_this_within_anthropology/",
        "text": "Hello, I am a university student interested in analyzing the genetics/ancestry of certain populations, their migration patterns, and the culture/history of certain ethnic groups and how they evolved to be what they are today. I am not sure what part of anthropology this is, if someone could point it out, I would really appreciate it!",
        "created_utc": 1672283779,
        "upvote_ratio": 1.0
    },
    {
        "title": "ISO: detailed map of Pleistocene coastlines, Americas",
        "author": "OG_ninnyhammer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zxsiam/iso_detailed_map_of_pleistocene_coastlines/",
        "text": "What sub do you suggest?  Reading Kindred and getting into the peopling of the Americas.  How good is our modeling of the west coast of N America?   The Mediterranean?  Should I be asking a cartography sub?\n- Thanks",
        "created_utc": 1672279573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Young Homo Sapien Children and Hygiene",
        "author": "Feeling-Temporary718",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zxlnso/young_homo_sapien_children_and_hygiene/",
        "text": "My 5 y/o son just absolutely despises doing anything that requires grooming. Showering, clipping toenails, combing hair, brushing teeth… You name it… He does not like it. But I also know that this is a stereotype for toddlers and young children. I’m wondering if this is a relic of our evolution in any way? Or perhaps me living in an affluent western society where hygiene is culturally the norm I am forcing upon him habits that he’s not evolved to partake in? I wonder if there is any research or common knowledge about this topic? Thoughts anyone?",
        "created_utc": 1672263109,
        "upvote_ratio": 1.0
    },
    {
        "title": "How extensive is Mexican mythology?",
        "author": "After_Raccoon1735",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zxd7ep/how_extensive_is_mexican_mythology/",
        "text": "Hello everyone,\n\nHope all is well. I was wondering, how extensive is mexican mythology. I am trying to write a book, and well I need assistance to steer on the right direction. I am aware of Nahual and Mayan culture, however I'm sure there are more. Thank you in advance, and happy new years.",
        "created_utc": 1672243265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of wood use in paleolithic time, quick",
        "author": "TheGreatCatnipThrone",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zx3e6b/examples_of_wood_use_in_paleolithic_time_quick/",
        "text": "Some game rules I can think of, feel free to DM for any suggestions\n- Needs to be EXAMPLES, meaning it is a physical artifact I can visit in some museum or archive or whatever preservatorium\n- OF is some glue word thing. I dunno they probably have some fancy schmancy term like connecting word or [bağlaç](https://commons.m.wikimedia.org/wiki/File:Atat%C3%BCrk.jpg) or something to describe what it is\n- WOOD(X)=((🌳🌲🌴🎋🐿️)^T)X*🪓~~🪵\n- USE mean Grug bash things with it\n- IN, see #2, also locational INternal yadda yadda\n- PALEO means preceding a certain time. LITHIC means something to do with rocks or pebbles or whatever calciform thingies pile and Hank or whatever funny word together. \n- Their combination, PALEOLITHIC, means [something like](https://web.archive.org/web/20221110111154/https://en.m.wikipedia.org/wiki/Paleolithic) 3M+ years ago\n- TIME, pictogramized in forms like ⌛⏰🕑, is that temporal dimension thing you might hopefully be familiar with\n- [,](https://commons.m.wikimedia.org/wiki/Category:Commas)\n- QUICK!!!!!!! means if you got something, SHOOT!",
        "created_utc": 1672212152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best ethnographic movies?",
        "author": "Thiag8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zx09r2/best_ethnographic_movies/",
        "text": "In the last couple of months i've been watching some ethnographic films, and i will like to watch more.\n\nSo if you have one film in mind, write in the comments!",
        "created_utc": 1672201814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were Hunter-Gatherer's Religious?",
        "author": "Sidewinder_01",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwvaga/were_huntergatherers_religious/",
        "text": "There is a distinction between religion and spirituality, what I'm asking is, before the first agricultural revolution, when hunting and gathering dominated the planet, did they have any organized religion at all? Tenets? Gods? Beliefs?   \n\n\nBased on some clips I've seen on interviews with current-day hunter-gatherers, they don't seem to show much thought into religion, they have some spiritual beliefs, about the sun and moon, and some believe in an afterlife, but it's all very disorganized and not something I'd consider an actual religion.",
        "created_utc": 1672187651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did it take so long for human society to evolve?",
        "author": "HedgehogRoutine2695",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwv053/why_did_it_take_so_long_for_human_society_to/",
        "text": " If  homo sapiens existed for 200,000 years, why did it take so long to  learn how to farm? Why does history start at 10,000 years ago, when  humans have been alive for so much longer than that? Obviously it's  because that's the earliest civilization we know of, but what took them  so long? Their brains were just as big as ours.\n\nI'm sorry the post isn't longer, I don't have much context to add here.",
        "created_utc": 1672186911,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did people do after defecation before widespread use of toilets, drainage systems, toilet paper etc?",
        "author": "Fallenman7",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwr01p/what_did_people_do_after_defecation_before/",
        "text": "I'm not sure that my quary belongs here (if not, please delete), but I wonder if people were generally wiping/washing themselves and if yes, how? I'm not talking only about hundreds of years ago, but even in the first decades of the 20th century in let's say isolated villages and such (regrettably I hadn't had the chance to ask my grandparents).",
        "created_utc": 1672177135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Podcast or other platform with in-depth discussion of \"The Dawn of Everything\" ?",
        "author": "Psychological_Bag238",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwog5s/podcast_or_other_platform_with_indepth_discussion/",
        "text": "Hi, I saw an earlier thread \"What do trained historians think of Graeber's and Wengrow's new book, \"The Dawn of Everything: A New History of Humanity\" [https://www.reddit.com/r/AskHistorians/comments/qtvjbq/what\\_do\\_trained\\_historians\\_think\\_of\\_graebers\\_and/](https://www.reddit.com/r/AskHistorians/comments/qtvjbq/what_do_trained_historians_think_of_graebers_and/) \n\nand wondered if there were any updates on similar discussions in the anthropology space? \n\nIdeally, I think there should exist a podcast where academics discuss this and other contentious  books. So if any good discussion on this would exist and somebody could point me to it, that would be great (in podcast or other format). Or if anyone knows a good podcast for general discussions on anthropology books and theories, that would also be appreciated :)",
        "created_utc": 1672170989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Young children and hygiene",
        "author": "Feeling-Temporary718",
        "url": "/r/daddit/comments/zwibgp/young_children_and_hygiene/",
        "text": "",
        "created_utc": 1672166723,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the current consensus regard pre-Columbian Polynesian contact with the Americas?",
        "author": "TacoooJay",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwmfou/what_is_the_current_consensus_regard_precolumbian/",
        "text": "Although native to Asia, [remains of chicken bones have also been found in regions of Chile](https://www.pnas.org/doi/pdf/10.1073/pnas.0703993104), which have been radiocarbon dated to 1321–1407 CE. Then you have the fact that the sweet potato, native to the Americas, was widespread in Polynesia. There's even linguistic similarities in the words for the sweet potato in Polynesian languages and South American languages (kumara vs k'umar)\n\nWhat is the current consensus regard pre-Columbian Polynesian contact with the Americas? Seems like a lot of evidence points towards it happening on multiple occasions. Is there any genetic evidence? Is there a reason they never made any permanent settlements in the Americas?",
        "created_utc": 1672165880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are humans designed for monogamy?",
        "author": "AntiAnimeProfilePic",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwlqzj/are_humans_designed_for_monogamy/",
        "text": "*To preface: For the sake of a forum question I over simplified the title. In someways I may be answering my own question but I would like everyone’s take and educated takes if possible*  \n\nI have been interested in human sexuality in relations to monogamy. My anecdotal observation: \n\nHumans seem to find partners for emotional needs and to optimally raise offspring. Humans also have an instinctual desire to produce offspring with many potential partners. This combination creates people participating in the institution of marriage while also being open to affairs. \n\nOf course this is a over generalization to a offensive degree. That being said, I see the K strategy and R strategy idea applied to humans being debunked. While it is invalidated, is there some truth to it determining how someone would engage in monogamy? \n\nTechnology has given us tools for affairs, would this mean technology shows us that we are serial monogamists?",
        "created_utc": 1672164148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Archaeology Field School Question",
        "author": "Archygorl",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwl1k9/archaeology_field_school_question/",
        "text": "Hi! Apologies if this is not the right forum to post on, feel free to point me towards a better one. I am graduating this May with a BA in anthropology and a minor in classical archaeology (not necessarily the type of archaeology I wanted to study, just the type my college offered). Because of the COVID pandemic, I am only now applying for field schools for this upcoming summer. I have narrowed down to three options (all accredited), with one in the US and two in Europe (Ireland and Italy). The Italy school focuses more on museum conservation archaeology and is associated with a museum, while the schools in Ireland and the US are associated with field sites like field schools traditionally are. I am not planning on going into academia, but I am interested in museum work and am planning to get a job as a field technician prior to applying to graduate programs and after field school. All three field schools are approximately the same price (US one is a bit less expensive, especially bc I am American). Any suggestions on which field school to choose? Should I apply to all three and then choose? Is one better than the other two? Or does it really matter if I just want to learn excavation techniques and then settle on a archaeological region through a field technician position?",
        "created_utc": 1672162365,
        "upvote_ratio": 1.0
    },
    {
        "title": "When Bellah uses the term \"ritual\" or \"rite\" in his book, Religion in Human Evolution, is he basically talking about what James Frazer called \"magic\" in the Golden Bough?",
        "author": "invisiblechaircover",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zwgtp5/when_bellah_uses_the_term_ritual_or_rite_in_his/",
        "text": "So I am interested in the connection between what Frazer called \"magic\" and the development of mythology and art. Basically, I just read this:  [ProgressiveChristianity.org : The Golden Bough and Magical Analogs toward the Creation of Humane Symbolism in the Jesus Story](https://progressivechristianity.org/resources/the-golden-bough-and-magical-analogs-toward-the-creation-of-humane-symbolism-in-the-jesus-story/) \n\nNow I am reading Robert Bellah's massive book and he's talking a lot about rites and rituals but seems to be completely avoiding the term \"magic\".  \n\nBasically, as a non-anthropologist who likes reading about stuff that James Frazer initiated over 100 years ago, should I assume contemporary folks are continuing Frazer's tradition while trying to abandon him at the same time because of various controversies?\n\n(I guess the big controversy for Frazer was that he considered contemporary religion a \"superior\" evolution of shamanism and magic - if I understand correctly.)",
        "created_utc": 1672151218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can view photos of all the new Nazca lines?",
        "author": "groovychick",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvx3xe/does_anyone_know_where_i_can_view_photos_of_all/",
        "text": "I'm wondering if there is a single place where I can see photos of all the recently discovered Nazca lines in Peru....also the old ones. Thank you in advance!",
        "created_utc": 1672089306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is South Korea and Japan better than China at football?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvplrk/why_is_south_korea_and_japan_better_than_china_at/",
        "text": "These three countries have heavy emphasis on education and little emphasis on extracurricular hobbies. Yet, both South Korea and Japan are better at football than China. China also has much more people and much more capital.\n\nWhat developments led to China being worse at football?",
        "created_utc": 1672068959,
        "upvote_ratio": 1.0
    },
    {
        "title": "I watched a movie in which a character said that \"an indian sold the path to their secret civilization for some booze\", and I recalled having heard that in some other place before. Is that true? To which civilization is it referring to?",
        "author": "juanxito11",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvmygc/i_watched_a_movie_in_which_a_character_said_that/",
        "text": "",
        "created_utc": 1672060705,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the evolution of marriage like?",
        "author": "sharmashivam784",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvhqoz/what_was_the_evolution_of_marriage_like/",
        "text": "I am asking not from the perspective of marriage as a political tool but rather marriage among the masses.\n\nWas marriage something that was always regulated by the family?\n\nWhy did different marriage customs emerge in Europe vs Asia vis a vis Love and arrange marriage?\n\nI'd also appreciate it if someone can recommend some sources on sociology of marriage and it's evolution",
        "created_utc": 1672039401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old Testament Facts",
        "author": "Homunculus_Grande",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvgqlb/old_testament_facts/",
        "text": "How much of the Old Testament is verifiable? Was there a Moses? Did The Jews wonder the dessert? Was there a great flood?",
        "created_utc": 1672035368,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far in the past do humans have comparable cognitive capacity to modern humans?",
        "author": "SeaBearPA",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvenqb/how_far_in_the_past_do_humans_have_comparable/",
        "text": "Hello all, sorry if this is the wrong sub! I fear this question may be unanswerable but basically I’m wondering, could you plop an infant born 2000 years ago in modern times and assume they would have similar cognitive capacity to others with similar a environment? What about 5,10,15k years?",
        "created_utc": 1672027742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn’t authoritarian countries like China and Vietnam enforce mandatory clothing like Iran and Saudi Arabia?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zveass/why_didnt_authoritarian_countries_like_china_and/",
        "text": "China and Vietnam are almost absolutist states where the government has a monopoly on power. While the citizens can vote the grassroots to power, the leader is selected by the politburo.\n\nThe hijab is mandatory for women in Iran and Saudi Arabia as for purposes of tradition.\n\nMao used to enforce the gender-neutral clothing for women in order to enforce gender equality but it has gone away.\n\nWhy didn’t China and Vietnam enforce mandatory gender-neutral clothing till today? What developments made them able to avoid Iran and Saudi Arabia’s fates?",
        "created_utc": 1672026478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be cultural appropriation for a white guy to wear Thai fisherman pants?",
        "author": "Dizzy-Speech-3576",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zvcgjc/would_it_be_cultural_appropriation_for_a_white/",
        "text": "",
        "created_utc": 1672020242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it correct to say that the ancient Greeks believed in the existence of their deities as real, powerful, and immortal beings, and that the gods and goddesses really had the ability to intervene in the affairs of mortals?",
        "author": "Puzzle_headed_Issue",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zv8oc6/is_it_correct_to_say_that_the_ancient_greeks/",
        "text": "Or did they perhaps see them more as characters, or imagined personifications? How does one determine an answer to this question?",
        "created_utc": 1672008303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anthropology for Software Engineers",
        "author": "kukuroza",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zv7ilu/anthropology_for_software_engineers/",
        "text": "I was reading a book called \"Kill it with fire\" by Marianne Bellotti. The writer was responsible for organizing and modernising obsolete legacy codes in different software firms all over the world. In her book, she said that her little but clear knowledge of the applied anthropology domain helped her on these projects. As is it understandable that Software is created by humans, tested by humans and also used by humans, so it makes sense that knowledge of anthropology is going to definitely help. But, I really want to know how applied anthropology and software engineering are connected more in detail. Are there any resources available about it?",
        "created_utc": 1672004853,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is a culture truly considered dead?",
        "author": "No-Necessary3122",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zv5v1n/when_is_a_culture_truly_considered_dead/",
        "text": "Using an example, the indigenous tasmanian culture is technically considered “dead.” Most of their traditions and language, and dna line has been significantly reduced. There is definitely a hybrid culture that was born in the Bass Straits, retaining some aboriginal traditions, but I’m not sure I would consider that aboriginal Tasmanian culture. isn’t it a creole culture instead? DNA still lives on but it is scant. I’m mentioning this to prove a point. If all that is needed to consider a culture alive is a distant descendant and a couple of traditions, wouldn’t a culture never technically die if it keeps on having a descendant who has some nebulous connection to some kind of tradition? But at what point would there stop being an “indigenous Tasmanian?” When the last person who has like a gggg aboriginal grandmother walks away from those traditions? When is a culture actually dead? \nIf anyone is Tasmanian or Palawa kani, please feel free to correct me on anything I messed up.",
        "created_utc": 1671999865,
        "upvote_ratio": 0.99
    },
    {
        "title": "What are the earliest cultural traces of marijuana use?",
        "author": "UnsleepySleep",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zv219e/what_are_the_earliest_cultural_traces_of/",
        "text": "I am high right now and I want to find out when is the earliest use of marijuana or hemp be it for smoking or other stuff—just when it was discovered, how is weed smoking viewed throughout the ages, and just general recounts of it in human communities",
        "created_utc": 1671988218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there a gender disparity among the prison population cross-cultural?",
        "author": "Arktikos02",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/zv0yan/why_is_there_a_gender_disparity_among_the_prison/",
        "text": "https://en.m.wikipedia.org/wiki/List_of_countries_and_some_dependent_territories_and_subnational_areas_by_incarceration_rate\n\nI'm referring to this link. If you take a look at the gender section you can see that cross-cultural, males are the majority population within a prison. This is interesting. Why is this?",
        "created_utc": 1671984776,
        "upvote_ratio": 1.0
    }
]