[
    {
        "title": "Great at getting into conferences, terrible at getting leaves/awards/etc",
        "author": "ProfessorEm",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zm3vpp/great_at_getting_into_conferences_terrible_at/",
        "text": "Are you good at talking to people outside of your discipline? If so, how did you get that way??\n\nHaving yet again been passed over for an internal fellowship (for which about 25-50% of applicants were selected), I'm convinced that I'm struggling to understand how to communicate to people outside of my field. I routinely have success with conference papers and such where the acceptance rate is far lower, but I can't seem to replicate that success when there's funding/leave on the line. Given that I'm in the humanities and, therefore, always talking to people outside of my field for this kind of thing, I'm guessing that this is the key difference.\n\n(Though, the other major difference is scope. Conference papers are just that, award proposals are usually for a semester's worth of work or whatnot. So, another possibility is that pitching \"I'm going to write articles X and Y\" is not helping me. But, my field is not a book field and I don't want to... lie?)\n\nSo: If you're good at this kind of thing, would you please share any general thoughts or resources you have? I am flailing a bit.",
        "created_utc": 1671055994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is including links in CV for published research a good idea?",
        "author": "bucknellchorho",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zm34fr/is_including_links_in_cv_for_published_research_a/",
        "text": "I am applying to Ph.D. programs in Computer Science this fall.\n\nI have my resume with the citations of the publications that I have had. Is it a good idea to have hyperlinks to these papers (in-text links, so when the reader clicks on the link, they get redirected to the research) ? I am worried that such links may disappear when the program downloads my app for review.\n\n Also, I want to link research on arXiv that has been accepted for publication but has not been published yet. How should I do it? I thought the only way would be to add an in-text link, directing the reader to the arXiv article.\n\nThanks much!",
        "created_utc": 1671054165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a Masters in Digital Humanities worth it?",
        "author": "overtintrovert_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zm0two/is_a_masters_in_digital_humanities_worth_it/",
        "text": "Hi all, I’m not sure if this is the best place to ask and apologies in advance if this subject has already been discussed, but is a masters in digital humanities worth it? I understand it’s sort of an umbrella term for a wide range of specialities and for the past few years it seems like a new sexy field of study, but has anyone completed a program for it?\n\nA bit of background: I have a bachelors in history from UCLA, I graduated with an overall GPA of 3.6 and originally wanted to go straight for a PhD in history but I had several PhD/postdoc friends discourage me as they were struggling to find any jobs in academia (this was in 2019). Then the pandemic happened and I reconsidered my options and thought that a MLIS degree would be a better option (always have been interested in curation/archival studies), applied to UCLA’s program and was rejected. \n\nI have worked in social media as a content creator since I was in college and am now a social media manager and product photographer. I also volunteer at a museum in my free time. I’ve come to the realization that full on academia is probably not the path for me, but I would love to get a masters to help me enter a field in the workforce I’m more interested in long term such as museums/libraries. Which is what has drawn me to digital humanities. \n\nI’ve never tried coding before outside of altering my tumblr theme in high school lol, and learning it sounds exciting/great skill to have in our tech based world. \n\nAny insight or advice is greatly appreciated! Thanks :)",
        "created_utc": 1671048502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduate Funding",
        "author": "Personal_Camel_2417",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlzsp0/graduate_funding/",
        "text": "I had a meeting with a potential supervisor few hours ago and I think it well.Apart from the funding part.\nThe program requires the grad students to secure a professor before the admission.\n\n\nHe specified that before taking me on as a student he wants my transcripts to be evaluated by someone in the admissions committee to get an idea of undergrad marks.The reason he stated for this was to ensure that I was eligible for scholarships as fundings are tight due to covid and he wants to ensure that I have a good experience at the uni.\nHe asked me to connect again within a month.\n\nI had done a good research on his work and his students work too.\n\n2) There were few things that seemed weird to me and I’m not sure if I’m right \n\n\n•The professor is an associate professor and the reason he state that he doesn’t a lab is because of covid stopping his work.\n\n•When I enquired about his students typical work week he said he expects his students to work hard as one should finish their program on time\n\n•Lastly he gave me the contacts of two former students who happen to be successful but not of students who are currently under him.\n\n\n\nLet me know if you all can make a deduction out of it",
        "created_utc": 1671045889,
        "upvote_ratio": 1.0
    },
    {
        "title": "My PI doesn’t respond to my texts/emails",
        "author": "ImportanceOk1438",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlz1ro/my_pi_doesnt_respond_to_my_textsemails/",
        "text": "Hello!\nI am an undergrad doing research with a professor since one year. I’ve been doing well and producing good results that she’s happy with. \nI don’t know why but she never responds to emails or texts within time. She says to reach out to her over slack for quick response, but sometimes doesn’t respond for a week (which delays work, research, recommendation requests, etc)\n\nRecently I asked her for a recommendation for something I applied for and she hasn’t responded and I don’t know what to do about that. I don’t know how to politely (but honestly) tell her that I need her responses to be more quick because it would make it so much easier to work with her like that. I get that she’s busy and all, but still, not getting a response for a week sometimes is inconvenient \n\nAre there any recommendations? What can I do?",
        "created_utc": 1671043999,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling embarrassed to talk about what I'm studying to my friends and other people",
        "author": "Turbulent-Beyond-781",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlykh0/feeling_embarrassed_to_talk_about_what_im/",
        "text": "I'm studying something which is not high paying career or attractive.",
        "created_utc": 1671042828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Warren Buffett: The BIGGEST Investing Opportunity of Your Life!",
        "author": "InformedInvestors",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlxe7b/warren_buffett_the_biggest_investing_opportunity/",
        "text": "[removed]",
        "created_utc": 1671040079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about citing an archival source via a printed collection",
        "author": "Fop1990",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zluqaj/question_about_citing_an_archival_source_via_a/",
        "text": "I have a question about citations (preferably in Chicago style). I would like to refer to a letter that is held in an archive. I have not accessed the archive myself, but the full correspondence of this author is printed in a book, with full reference to where all of the printed letters are located in the original archive. When citing, I feel that I should say X archival source via Y printed collection, but I'm unsure how to format the citation.\n\nHow should I format this kind of thing? I'm finding lots of results for \"secondary citations,\" but this isn't entirely what that is.",
        "created_utc": 1671033698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start-up Funds Budget Proposal Examples/Template",
        "author": "DartsDiscsTeach",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zltl7g/startup_funds_budget_proposal_examplestemplate/",
        "text": "Hello. First time posting here, so please let me know if you need any additional information.   \n\n\nI am applying to an R1 STEM position (chemistry) and I was curious if anyone has a link or resource for how to right a budget proposal for such a position (start-up funds). I have tried googling for some time, but I must not be using the correct search terms. Any help is appreciated!",
        "created_utc": 1671030938,
        "upvote_ratio": 1.0
    },
    {
        "title": "job hunting",
        "author": "Ammolite_eye",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zltdle/job_hunting/",
        "text": "I've only recently graduated and only now am I realizing that job hunting isn't a piece of cake. Much more difficult than it looks.\nEvery other institute wants people with 5+ years of experience.",
        "created_utc": 1671030440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I lean into an academic career that I sort of fell into?",
        "author": "AKing2713",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlsqiz/should_i_lean_into_an_academic_career_that_i_sort/",
        "text": "Not sure if this is the right place to ask this question but thought I would give it a shot. For the past 12 years I was in the US Air Force and the last 4 of those 12 years I was a technical instructor teaching new recruits on how to fix avionics and electronic warfare on jets. During this time I also developed a passion for Data Science and while obtaining my undergrad in Mathematics and Statistics, I did a lot of research and projects on the side about Data Science. Fast forward to present day, I am out of the military and currently a Data Science instructor at a coding bootcamp. I have plans on advancing my education with an MS and maybe even a PhD but been contemplating a career choice. I have always said that being an instructor was just one step towards my goal of working in industry but the more I think about it and take stock in my life the more I realize I am actually happy being an instructor. Also, while I think I have a lot to lean and improve on, the feedback I get from students and other instructors is I am pretty good at it. \n\nJust torn between a career in education and a career in industry. Honestly, I am not sure I would even have a shot teaching at a university as it would be a long road and I am already 32 years old. I know this post is very personal and only I can know which road I should take but I just want to make sure if I start down this path it wouldn't be in vein like I was to old or didn't have a straight line trajectory to being a professor.\n\nThank you for your time!",
        "created_utc": 1671028943,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanna use IEEE for my bachelor thesis… How should titles be? I only find examples and templates for journals and articles, but not theses… (Electrical Engineering)",
        "author": "iamsophiah",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlqits/i_wanna_use_ieee_for_my_bachelor_thesis_how/",
        "text": "In IEEE articles you always find those with two columns and so, is there a template for theses? I don't know how the format for them  should be",
        "created_utc": 1671023336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Citation question",
        "author": "boloobear",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlqe6b/citation_question/",
        "text": "Hi, in my introduction I stated the following: As displayed by his continual use of the phrase 'universal empire' in his attacks upon the French revolutionaries, Burke was a staunch critic. I didn't footnote this because I was making a broad, general point, but in later passages, where he actually uses the phrase, i do footnote it. Should I have footnoted it the first time? did I make a mistake?",
        "created_utc": 1671022954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going from Industry to a Postdoc?",
        "author": "Energia91",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlok1a/going_from_industry_to_a_postdoc/",
        "text": "Hi all,  \n\n\nAfter completing my Engineering Doctorate (EngD), I went straight into the industry. After a year and 2 months, I'm thinking of going into academia for two main reasons. \n\nFirstly, I really want to get out of the UK (my home country), and a postdoc seems like the easiest option (though not easy).  Finding industry jobs seems to be impossible outside of the UK, but quite easy within it. \n\n  \nSecondly, as cliche and naive as it sounds, I want to be at the forefront of my field and develop further as a scientist.   \n\n\nI don't have too much experience pursuing postdoc positions. I remember briefly looking at them after submitting my thesis last year (whilst awaiting the Viva). I sent out emails to professors, and most of them replied. The common misconception is that EngDs only go to industry whereas PhDs go to academia. I didn't really find that to be the case, but only within the UK. I guess they're better aware of what an EngD is.   \n\n\nI also don't have any publication records. Unlike a Ph.D., the EngD program (at least in my center) doesn't require a publication to pass (we have many other hurdles). After passing my viva, I thought of publishing (as my examiners recommended, they really liked my research!), but I was too busy with my new career, and wanted to finally say goodbye to my 6-year-old doctorate!\n\nCurrently, I'm looking at postdoc positions in Asia, namely Japan, Korea, Singapore, Hong Kong, and mainland China. From what I've heard, they tend to be publication centric in that part of the world. Is it impossible to get a position with no publication history? Some positions explicitly state publication history as a requirement, whilst others do not so much.   \n\n\nAny tips appreciated  \n\n\nThanks",
        "created_utc": 1671017323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would junior faculty benefit from mentorship / career guidance?",
        "author": "Specialist_Cell2174",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlkg7k/would_junior_faculty_benefit_from_mentorship/",
        "text": "\nGreetings!\n\nMy question is geared toward both (very) junior faculty and experienced professors **in STEM**.\n\nSuppose you are a freshly minted faculty: just a month ago you were a postdoc sending applications and doing interviews and now you a junior faculty, but faculty nonetheless.\n\n**Questions:**\n1. Do you have a clear **vision** of your career path? I am talking about vision in broadest sense of this word: vision of how to move from tenure-track assistant professor to tenured full professor in  the same institution? or a vision of how to become a full professor in Big-Name university on the East/West Cost while you are starting in No-Name University in the Fly-Over Country?\n2. If you have a vision (a birds eye view!) of your career path, have you envisioned / planned some (or all) steps toward fulfilment of that vision? \n3. Assuming you are a junior faculty with a broad vision and at least a few career steps already in mind, would you benefit from career guidance / mentorship / coaching? Or you confident that you have it all under control and you need no stinking advice?\n\n**A bit of background:**\n\nPersonally, I have seen most of it, if not all: I knew a person whose lab collapsed after missed funding opportunity; I saw a super-successful professor whos lab was buzzing like a factory churning papers (he moved to the USA from Canada). I know a person who became a director of major research centre in California and I know happy people who have never had more that a Ph.D. student and an undergrad at one time in 20 years of their career. I saw people succeeding and I saw people emulating success and failing.\n\nNow I am wondering how much of it is a deliberate choice and what part -- lack of vision or understanding of how to achieve it? \n\nHow many failures could have been averted if mentorship / coaching was in place?\n\nOr I am wrong and anyone jumping from a postdoc to junior faculty has already figured it all?",
        "created_utc": 1671002003,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help Grant mechanisms for human experimental scientists",
        "author": "neurotim",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zlk518/need_help_grant_mechanisms_for_human_experimental/",
        "text": "So I find myself in a bit of a pickle. I'll be applying to TT positions this spring including one I helped design at my current institution. However,  the primary grant mechanisms that have the highest success rates targeted to minority serving institutions (where I currently work) do not support clinical trials. Because of NIH's very broad definition of clinical trial, my primary work and almost any experiment that I can think of is a clinical trial. Do I just have to bite the bullet and try to compete with investigators at ivy league institutions with 10x the resources I have available for R21s and R01s? Or will I have to switch back to bench science? Thanks in advance for any help!",
        "created_utc": 1671000908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do nursing schools and med school mostly teach treatment based information rather than preventive?",
        "author": "MarsupialUpper3061",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zljqze/why_do_nursing_schools_and_med_school_mostly/",
        "text": "As I was in nursing school so much of our program was treatment based, and very little was talked about prevention, for example so many people have never had a full lab test that shows all functions in the body. With the human body being so complex it feels like we arn’t taking advantage of all of our resources to keep our patients healthy.",
        "created_utc": 1670999527,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate the paper of which I’m the sole first author (undergrad, biochem)",
        "author": "mypartytattoos",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zle3xn/i_hate_the_paper_of_which_im_the_sole_first/",
        "text": "I’m in college majoring in chem/bio and I recently submitted a paper. This is my first publication and I’m the sole first author. But I hate it. I know we should do more. Well, I know exactly why we couldn’t do more (money, time, inhibitor we wanted doesn’t exist yet, can’t risk getting scooped, etc). But if I didn’t know those things and read it as a third party I would criticize the heck out of it. I should be happy but I’m not. My very smart, accomplished prof wrote it with me and they approved but… yeah, I just don’t like it.\n\nI guess what I want to ask is, has anyone ever felt this before? Especially when you’re just getting into the field, or maybe even later? Asking for some encouraging words or advice. Thanks!",
        "created_utc": 1670982945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any experience or advice on talking to university ADA office about poor performance at previous university, due to a diagnosed illness???",
        "author": "throwaway_ADA_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zle2ym/any_experience_or_advice_on_talking_to_university/",
        "text": "TL;DR — I went full-blown crazy (diagnosed psychotic disorder, so I’m allowed to say it [lol I have to goof about it or it will eat me alive]). \n\nI flunked out two semesters in a row due to losing my entire mind— (tl;dr on that— extreme agoraphobia + schizotypal behavior, doubled medication doses just to avoid kms, ended up having to move back home). \n\nHow can I approach the ADA office to ask about seeking some form of leniency, or at least a documented reason, for my two failed semesters, considering my GPA prior to them was nearly 4.0, and I had two solid years of great performance?\n\nAm I just fucked?\n\nAny advice / encouragement / similar experiences more than welcome. Thanks in advance to anyone reading; I know this is both a long shot and a rambling mess. \n\nI feel so presumptuous and spoiled for even considering using disability (especially of the “invisible” variety) as an excuse, but I guess it’s worth a shot.\n\n.\n.\n.\n\nI fucked up and had to drop out two semesters in a row due to diagnosed + documented mental health problems. \n\nWas nearly hospitalized more than once during that time (obviously I refused to admit myself, since there’s nothing scarier to a crazy person than a mental hospital, and I could mask just well enough to avoid an involuntary psych hold) —lost multiple family members —was in a bad car crash —was being severely abused by my then-partner —started hallucinating again and spent 90% of the year suicidal— \n— THE WORKS.\n\nThe school psychiatrist agreed that I should just go home, though this was only stated during our session, and it was not documented in my case file. That one psych is assigned to ~1,000 students per semester, and there’s no chance of her remembering anything she said during two 15-minute sessions from over a year ago— so no help there.\n\nI moved back to my home state, took a year away from school, and have been trying to get back on my feet.\n\n.\n\nDue to a grant situation, I was unable to officially withdraw from any classes, and was told by my grant officer that I would basically just have to eat ~30 credit hours of Fs and hope for the best.\n\n.\n\nMy GPA prior to this was &gt;3.5; I was in two honors societies. \n\nMy GPA is now around 2.5.\n\nI was referred to a competitive research program by one of my professors and accepted, but the whole program was scrapped due to COVID.\n\nMy ACTS scores are competitive, but not mind blowing. \n\n.\n\nI could likely still get in, all things considered, but does anyone have experience with or thoughts on pursuing some sort of documentation through the ADA office to explain a year of fucking everything up due to health problems?\n\n.\n\n——ETA; I changed to a completely different major and will most likely not have an opportunity to retake the classes I failed, as they were part of a program which the local university doesn’t offer. Also I’m poor, and my grant won’t cover classes that aren’t required for my major. So no hope right now for retaking the same classes for replacement grades.",
        "created_utc": 1670982877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Handling a bossy/micromanaging colleague (postdoc)",
        "author": "FR3QU3NSY",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zldtpy/handling_a_bossymicromanaging_colleague_postdoc/",
        "text": "Hi!\n\nI am looking for some advice on an interpersonal issue I am having.\n\nI am a second-year postdoc assigned to work on a continuing project. A Ph.D. student and another postdoc have been working on this project. I was given a new but connected part to work on by our PI. \n\nThe issue I am having is with this other postdoc on this project. Specifically, this other postdoc sees himself at a higher rank than me (i.e., the project manager), despite us being both postdocs. This could be because this is a continuation of his Ph.D. work (6 years Ph.D. + 1-year postdoc) or because he has been at the same lab for seven years. I find this “manager behavior” problematic (specifics below). Before I continue, note that I am very receptive to **technical** feedback on my work, which is NOT the issue here.\n\nExamples of this problematic “manager” behavior are:\n\n* Tries to set my weekly deadlines and tasks for me. \n   * Example: I was considering learning a simulation tool. He asked me to contact other people who used the tool and ask them, “How long did it take them to learn it?” The purpose of this question is to set a deadline for me.\n* Always asking: How long is this going to take you? He sends emails and checks up on me constantly, always starting with “have you had the chance to finish \\[insert task\\].” \n* Pushing for a plan: He wants me to write all my tasks for this project and how long each task will take.\n   * I suspect he will present this plan to our industrial collaborators himself as: “Here is what my team will do.”\n   * I do not like these plans as each task in my research takes varying lengths of time depending on complexity, which I cannot estimate. I do not see the point. I feel like this plan will be used later as \"Gotcha! You are late doing this!\".  \n* At some point, he changed pronouns from “I” to “we” in my slides to be presented to our industrial collaborators, where I talked about my progress. He did not contribute to that work and made it seem like that work was a group effort.\n* Very pushy in deciding how things on MY part should be done.\n* Creates a sense of panic and rush (This project is on a short deadline, but still, the behavior is too much). \n* Generally, being a micromanager. \n\nAgain, we are both at the identical rank. \n\nI want to be left alone and not deal with this behavior. He is not my manager, and I handle my tasks in a certain way, and this behavior affects my productivity. Having weekly meetings where I present my work and receive feedback is fine with me and is appreciated, but none of this other BS he is doing.\n\nI have been trying to push back by arguing my points and explaining that I disagree with his approach, but he is relentless and getting on my nerves.\n\nFinal note: Our PI is absent and likely does not want to be involved. The PI never indicated that I should report to this other postdoc. So this behavior is unwarranted from what I can tell. \n\n**Question**: How do I deal with this? I have been trying to remain calm, but it is getting challenging, affecting my productivity as I am constantly angry and frustrated with his behavior. I am afraid I will have to confront him and put him in his place, but I would like to leave that as a last resort and try to resolve this amicably.",
        "created_utc": 1670982203,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to respond to a senior scholar's request to \"pick my brain\"",
        "author": "wishverse-willow",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zl9yr7/how_to_respond_to_a_senior_scholars_request_to/",
        "text": "I'm a junior precarious academic. Years ago, I was working on a very new/niche topic, but then was pushed to abandon it in grad school. I've now been working in a different area, though I really miss my original work.\n\nA tenured prof reached out to me recently because they are developing a project on that niche topic I used to work on and they found my old stuff (because there is literally nothing else to find, it's a very small field and this is a very new research area).\n\nThey asked if they could \"pick my brain\" about it as they develop their project, which they are doing with another tenured prof. I find myself annoyed that the request did not come from a place of potential collaboration, but is instead framed as though I'll just hand over all my ideas/work/experience I had in this area and be done.\n\nHow do you respond to requests like this? Is it normal that I should just...turn over my time and ideas for free? Or is there some way to respond here that indicates that I would love to be helpful if there is a possibility for actually collaborating with them on this project?",
        "created_utc": 1670972518,
        "upvote_ratio": 1.0
    },
    {
        "title": "US PhD in different area from my BSc degree",
        "author": "FunClassroom9450",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zl81dc/us_phd_in_different_area_from_my_bsc_degree/",
        "text": "If I am an international student who has BSc degree in Education and doesn’t have a masters degree. Can I apply for a PhD Program in Business at US ?",
        "created_utc": 1670968081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study about incentives to promote climate-friendly behavior",
        "author": "Ok-Luck-9353",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zl7phs/study_about_incentives_to_promote_climatefriendly/",
        "text": "[removed]",
        "created_utc": 1670967326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing where to submit a review article",
        "author": "3O3-",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zl6a2i/choosing_where_to_submit_a_review_article/",
        "text": "Hello!\n\nI recently finished a review article as part if my first year of PhD, which my advisor wants to publish, and she asked me for my suggestions on where I think is a suitable place for it to go. \n\nI have published some journal articles with her before so I know how the basics of selecting a journal (scope, impact, content types, publish cost/open acess etc.), but theres a few things specific to review articles I dont understand:\n\n1.\tDo editorial decisions typically take longer for reviews? (Would affect how “ambitious” we are)\n2.\tA lot of journals state “reviews are usually commissioned by the editor, but we sometimes accept unsolicited submissions”. Is it worth submitting to these journals, or are the changes if acceptance drastically lower than they would otherwise be? Does anyone have experience with submitting unsolicited review articles to these journals and being accepted?\n3.\tSome degree of publication history/institution bias is surely present throughout academia, however I expect it could be more when submitting a review article since experience matters when it comes to the “authoritative” phrasing. Should I expect to submit to lower-impact journals because I (the first author) do not hold a PhD yet, and will have a very small publication history at the time of submission? Of course, my advisor (and our coauthor) are very well established in the research area.\n\nI appreciate that she gives me a lot of input in suggesting journals myself so im hesitant to ask her advice about this too often, and im also interested to know what reddit thinks!\n\n(Im in human biology / physiology if it makes a big difference)\n\nThanks in advance for the help!",
        "created_utc": 1670964002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would radical life extension be possible with a VR brain chip, that alters our perception of time so that every second felt like a year in VR?",
        "author": "RattyRusty1",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zl5f5k/would_radical_life_extension_be_possible_with_a/",
        "text": "So instead of extending life by increasing the amount of years we live, we reduce the rate at which we perceive time (whilst in a virtually simulated reality from a sensory chip within our brain)... Is this at all possible?",
        "created_utc": 1670961973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you open any investment retirement accounts during graduate school?",
        "author": "Cabadam",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zl05ik/did_you_open_any_investment_retirement_accounts/",
        "text": "Did you contribute to an IRA or some kind of investment account during grad school? If so, can you point me to some resources on how to get started?\n\nIf I'm going to continue into a PhD, Id like to start sooner rather than later.",
        "created_utc": 1670949678,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many articles are required for postdoc admission?",
        "author": "Straight_Duck4589",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkyhrq/how_many_articles_are_required_for_postdoc/",
        "text": " As a Phd student in corrosion inhibition(electrochemistry) in an african country(morocco) in my final year, in addition to Ielts degree :\n\n1-What else should I take in consideration to be accepted in postdoc in germany?\n\n2-Does 2-3 first author articles in a Q1 or Q2 journal enough in the time that you apply for postdoc?\n\nThanks",
        "created_utc": 1670945467,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does applying for a PhD work? Does every university have a call for applications on a certain fixed date (i.e. in July), or can I just randomly contact a university's department that I like and let them know that I would like to apply for a PhD there? What has been your experience? Thank you!",
        "author": "more_guess",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkxifx/how_does_applying_for_a_phd_work_does_every/",
        "text": ".",
        "created_utc": 1670942875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supervisor made a complaint about me to my scholarship institution",
        "author": "anxiousinthelab",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkxi06/supervisor_made_a_complaint_about_me_to_my/",
        "text": "I´ve started my doctoral project in October. For two months I´ve learned the methods that I could use during my project. Then I proceed to do my own experiments mid November.\n\nThe thing is I need to wait for more samples from my supervisor. Meanwhile I go to lab, do somethings, then leave.\n\nIn the lab supervisor and technician told usually the students that we are responsible of our schedule and we could come whenever we wanted to during the day.\n\nI´ve been going to lab around afternoon and I assumed that this wasn´t a problem till I have gotten an e-mail from a person in the uni who´s responsible of the scholarship holders of an institution.\n\nE-mail included that my supervisor wasn´t satisfied with my cooperation and asked me to explain why I don´t go to lab even though it´s necessary for my doctoral project and my scholarships is connected to this cooperation.\n\nThe problem is my supervisor never mentioned this to me before, I had no idea that she wasn´t satisfied with my work. Her going directly do my scholarship institution made me very upset because I am an international student and my income is just my scholarship and without that I would have to go back to my country. I feel like she should have given me a warning first, look you have to come everyday between those hours.\n\nI sent the person that sent me the e-mail and also my supervisor an e-mail explaining that it has been a misunderstanding, I thought lab hours were flexible and I didn´t know there were strict hours. It´s been never clarified to me before. \n\nSometimes I ask questions to my supervisor if it´s ok to do this experiment, she is like you don´t have to ask me, you have to do your own plan, and sometimes she says no don´t start yet. She is not very clear about what she wants from me.\n\nI just want to get done with my project and leave the lab for good tbh.\n\nIs there anything I should  do? This has been my first time in academia so I am kinda lost what to do, I just don´t want to get her on bad side so early on my project even though it was a misunderstanding. I also don´t want to her a bad impression that I don´t come to lab etc. This just caused extreme amount of anxiety and overthinking that I damaged the relationship between us, also from my side, complaining about me to institution that gives me money, basically my financial security, is not nice at all.",
        "created_utc": 1670942842,
        "upvote_ratio": 1.0
    },
    {
        "title": "When in their careers do people typically get an Ed.D (for positions in higher education)?",
        "author": "lagomorpheme",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkwp6u/when_in_their_careers_do_people_typically_get_an/",
        "text": "It seems like a lot of the admin folks at my institution have Ed.Ds alongside other degrees. I'm not sure how common this is, but I'm curious -- at what point in their careers do people decide \"Hey, I want to be a provost some day, better get an Ed.D!\"? Are the people getting Ed.Ds for this purpose generally doing so once they're already tenured faculty?",
        "created_utc": 1670940711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking supervisors not to include me as a co-author on paper",
        "author": "Virtual-Statement448",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkw68k/asking_supervisors_not_to_include_me_as_a/",
        "text": "Sorry for the throwaway account. This is half venting, half asking for advice.\n\n&amp;#x200B;\n\nI am a new phd student and I started less than half a year ago, in a new (EU) country where I'm still learning the language. I was told before being admitted (and before even applying) that communicating in english wouldn't be a problem and that I wouldn't have to take any courses, I would just do research. After joining and moving I learned that I do need to take several courses in the local language and the very few people who \\*\\*do\\*\\* speak to me in english, mostly just ask me when I am going to start communicating in the local language and joking that they should only speak to me in the local language so that I learn faster. To give some background, I have lived in other countries (also within the EU) during the past few years for studying/working and although I did manage to learn the languages of those countries, there wasn't an issue with me speaking english when I first got there. In my current country, I half spoke the language before coming and I am living my very lonely every-day life solely using the local language, I am only using english in the university. That is to set the tone about \\*\\*why\\*\\* I am so overwhelmed so early and about why I am making a big deal about something that should be easy to handle.    \n\n&amp;#x200B;\n\nMy supervisors wanted to dive right in and said that I should read as I go and not allocate any time in the first month(s) mostly for reading about the state of the art in what I am going to work on. I have been reading and playing with easy problems but unfortunately I am not moving fast. We have weekly meetings (which I'm very grateful for!) but the meeting usually ends with them discussing something and me trying to follow but being mostly ignored when I'm attempting to contribute, which is probably fair, I don't feel like I know what I'm doing either. The meetings usually end with me having a problem to work on for the week. During the week I work on the problem, I provide a usually BAD (as in overly-complicated) solution in the next meeting and about halfway through explaining my solution, they interrupt me, they solve the problem for me (in a clearly much better way) and then they give me the proof verbally and ask me to write it down for the next meeting. Then we move to a new problem and so on. Now it has started to look like what \"we\" are working on might lead to a publication but in all honesty I HAVE NOT CONTRIBUTED ANYTHING. I just write down what they tell me to write down. One could remove me from the project at any time, even mid-sentence, and nothing would change. Getting my name on a possible publication without having contributed beside writing, is stressing me out more than anything else and I have no idea about how to approach it \\*if it comes down to it\\* without insulting my supervisors. I have published before and my contribution there is in no way comparable to whatever I am \"contributing\" to this project. At the same time, I don't see how I can ask them not to give me the solutions if they are obvious to them as I don't want to waste their time but I don't see how I'm going to get better if I don't have the time to practice and get feedback. \n\n&amp;#x200B;\n\nI just don't know what I'm doing and if anyone has any comment/advice/approach I would appreciate it greatly.",
        "created_utc": 1670939300,
        "upvote_ratio": 1.0
    },
    {
        "title": "I see no future for myself...",
        "author": "lunar_chrome",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkvepy/i_see_no_future_for_myself/",
        "text": "I constantly feel hopeless about my future while doing graduate programs. I cannot tell my feelings or my thought to my friends or family anymore as they just don't know what to advise in my case because no one works in academia. I know I got depression, but now it's too hard for me to tell anyone thoroughly or in a logic way that they can understand. I feel that I am wasting my times here, doing some nonsense things because I can't even publish a review after 1 year, which is the thing I easily did 5 years ago with high productivity. I have had troubles in eating and sleeping for months since I started the degree. Moreover, after 2 years suspending everything due to Covid, and the contract that I have to serve at public school after my program makes me see no future. In my country, the salary for working in academic is even lower than an office worker (like, ~$150/month).\nI don't know what I am doing now and why I chose this path for my poor future. I am used to love science deeply, but the harsh reality really makes me concerned and hopeless.\nSorry if I am telling some trash things, but I really don't know where to aks for advice anymore.",
        "created_utc": 1670937078,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does APA 7 say about citing two organizations in in-text?",
        "author": "WishConscious3738",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkuwbx/what_does_apa_7_say_about_citing_two/",
        "text": "Hi,\n\nI have hard time finding a response for this. They are two organizations that collaborated on the same project. I can only find for different works.",
        "created_utc": 1670935636,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the limits of ethics using AI to write a manuscript",
        "author": "gabrielbiolog",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zku9ed/what_are_the_limits_of_ethics_using_ai_to_write_a/",
        "text": "Short history: Can I use ChatGPT to rewrite one or a couple of paragraphs to resolve reviewers' comments? Am I cheating?  \n\n\nI just discovered the ChatGPT3 from OpenAI and I'm in love. It has helped me a lot to overcome a creative block I was facing to finish a manuscript from my PhD where 2 of 3 coauthors (the 2 advisors) are quite absent, and for this reason, I stopped working on this manuscript for 1.5 years. Every time I tried to take it back I felt anxious and blocked. However, I'm currently passing a great moment of my life that brings me back to the joying of scientific writing, especially a couple of high-impact manuscript acceptance this last month.  Thus, using the ChatGPT I got the draft of two paragraphs that helped a lot to move fast with this manuscript. Because I'm deeply editing these two paragraphs I think there are no ethical concerns about it. However,  today I ask the ChatGPT to rewrite the paragraph of the objectives in another manuscript that received a minor review. The major concern is the lack of clarity in the objectives. Thus, I just asked to the ChatGPT rewrite this in a clearer manner and nail it. The paragraph is amazing now and I'm planning to use it directly as it is in the manuscript to send back to the journal. My question however is if I'm pushing the ethical line far from the gray area and if I can be punished in the future for this approach.   \n\n\nPlease note that I'm talking about a couple of paragraphs (300 words maximum).",
        "created_utc": 1670933627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you using grammar spelling SW such as Grammarly or Writefull to check your manuscripts; is there anything available for the iWork suite on macOS?",
        "author": "iBo0m",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zktznx/are_you_using_grammar_spelling_sw_such_as/",
        "text": "Thanks for any feedbacks! 😊",
        "created_utc": 1670932756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Might get an F on a History Class at my Community College. I want to transfer to a university, will it be okay?",
        "author": "drumgod_28",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkrlxx/might_get_an_f_on_a_history_class_at_my_community/",
        "text": "Hello guys im not 100% sure if I should be posting here but I think its the right spot so heres to hoping \n\nI needed to complete a history class (History of the US till 1850) and Ive tried dropping it before the drop deadline at my community college but my professor encouraged me that if I keep my work up I can definitely pass with a C- so I believed her. Problem now is its finals week and my grade is at a 60% and my professor has not disclosed how much our finals worth. Im afraid that I might have to take the F for this class \n\nNow I am planning on transferring to a university to finish my undergrad in Bio im only  in CC to get all of my general ed stuff/transfer requirements out of the way. Im not sure if they’ll accept me because of this potential F. If I were to take ANOTHER history class to make up for it would they see pass the F? How likely is that to happen? Thanks in advance for the help I tried looking online for answers but it kept taking me to HS courses for transfer and not CC courses. \n\nTldr; If I take another History class because I failed my first one, is it possible that universities will see the one I passed and accept me or will they reject me because I failed the first time?",
        "created_utc": 1670923771,
        "upvote_ratio": 1.0
    },
    {
        "title": "From a so-so university b.a. in languages to a master's in economics in a Top University?",
        "author": "Academic_Routine_593",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkpwqt/from_a_soso_university_ba_in_languages_to_a/",
        "text": "Hello.\nI'm a recent graduate. I didn't study very well or for whatever reason I got into a so-so university, my mother pressured me into staying in that school.\n\nI focused on studies and completed the school with a 3.47 GPA and in top 20% of my class for the last 2 years out of 4 in school.\nI studied English Translation and Interpretation\nI also did a Minor in international trade and logistics\n\nNow I've graduated and I want to get into one of the Top schools in my country into a different program such as Economics or Tourism Management.\n\nIs this a realistic goal?",
        "created_utc": 1670917225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Cited reference papers are also put to plagiarism check?",
        "author": "Horseman099",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkpa8v/do_cited_reference_papers_are_also_put_to/",
        "text": "My supervisor submitted my journal publication to turnitin and it gave back a report where my research papers reference provided at the end of my work were marked as plagiarism. My manuscript is ok but as I have added 51 references, they are all marked as plagiarism. \n\n&amp;#x200B;\n\nI am confused that why these added references are marked as plagiarism.",
        "created_utc": 1670914992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it ok to ask my professor for the opportunity to revise a group assignment?",
        "author": "a_s_h_1_y_n",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkmxtu/is_it_ok_to_ask_my_professor_for_the_opportunity/",
        "text": "Hi Reddit,\n\nI'm a second year college student in the US and my final project in my honors literature course was to do a group essay. Me and members of my group split the work evenly and today we met up to piece it all together. After seeing the quality of their contributions I really wish I had offered to do more of the work. I'm worried that the essay will score poorly and the members of my group didn't seem at all interested in suggestions I had. \n\nI've put a lot of work into this course and would hate to see my final grade drop because of this assignment. Would it be wrong to ask my professor for the opportunity to redo the paper entirely on my own and get graded on that rather than the group paper?",
        "created_utc": 1670907671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I editing for a predatory journal?",
        "author": "JediHotcakes",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkm5cn/am_i_editing_for_a_predatory_journal/",
        "text": "Some background, I was accepted as a fellow into this [program](https://glp.grassrootsinstitute.ca/) which has been... an experience to say the least. The head of the program has been highly unprofessional and at times has bordered on harassment through chat channels. Regardless, part of the fellowship includes an editorial position at the institute's associated journal, which I will link in the comments. I was recently asked to do a full edit (grammar, syntax, etc) of an \"accepted\" paper which sounds strange to me, as this was never something that was done in any of my previous papers that I submitted for peer review. Is this a normal process? For additional context, the paper I am tasked to edit is of incredibly subpar quality and I am now questioning the entire peer-review process.",
        "created_utc": 1670905371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lets improve academia through salary transparency",
        "author": "pmocz",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkltaa/lets_improve_academia_through_salary_transparency/",
        "text": "I believe salary transparency in academia leads to better pay, and is important for improving the quality of academia in the near future. So I am making a website to visualize salaries and make it all open -- think [levels.fyi](https://levels.fyi/) or glassdoor, but for academia. Here is the link to my website:\n\n[https://academicsalaries.github.io/](https://academicsalaries.github.io/)\n\nThis is just the start. I could use more salary data, which is really hard to come by for certain types of academic positions, although I've already been pointed to great resources I will use to add more data. Consider submitting yours anonymously at the website above.",
        "created_utc": 1670904416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do You Expect PhD Stipends to Increase in the Near Future?",
        "author": "SorryBrick",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkkiil/do_you_expect_phd_stipends_to_increase_in_the/",
        "text": "I am a first-year Masters student (social sciences), interested in pursuing a PhD after a few years in the field. Every time I research stipends, I am horrified. \n\nAt my university (R1, U.S. Northeast), the Grad Student Union is working hard to rally around increased stipends. Given current inflation and a national untick in interest around workers' rights (??) , do you expect stipends to raise in the coming years? (Asking both for selfish reasons, and genuine curiosity.)\n\nInterested in any thoughts!!",
        "created_utc": 1670900775,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those who chose career over love, how did it turn out?",
        "author": "__academic__",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkhv61/for_those_who_chose_career_over_love_how_did_it/",
        "text": "Do you regret it or was ir worth it?",
        "created_utc": 1670893807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I elgibile for this program? I can't tell and I can't find any contact information or email to reach out to.",
        "author": "NoHappy21",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkgxwl/am_i_elgibile_for_this_program_i_cant_tell_and_i/",
        "text": "Hi everyone,\n\nhttps://summerstudent.web.cern.ch/am-i-eligible\nhttps://summerstudent.web.cern.ch/\n\nI would love to apply to this program (linked above). And I can not tell if I am elgibile or not. I am not a CURRENT student, but I have my B.S. in Physics. TIA for the kind souls who answer :)",
        "created_utc": 1670891449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting out in the gym as a trans woman",
        "author": "Carol_lil",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkgw1o/starting_out_in_the_gym_as_a_trans_woman/",
        "text": "I'm a trans woman and I'm starting out in the gym and I'm researching and learning about exercise. I haven't started my hormonal and social transition yet, I'm still in \"male mode\" and so I don't think I can openly ask the instructor to put together a specifically female workout for me.\nCould you send me content about training for women or even some sets to build on while I can't put together my own training specifically for my goals?\n(Sorry for the English, I'm not very good so I end up using google translator to write)\nDid I use the tags wrong? if I ended up using it wrong I'm sorry, I didn't understand very well how they work",
        "created_utc": 1670891324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Caught cheating what should I do",
        "author": "camolizard01",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkg54r/caught_cheating_what_should_i_do/",
        "text": "I know what I did was wrong . I will do better. But for now I want to know what should to get out of my current circumstances. I will make a long story short. I had an online exam. A camera is on me and i camera is behind me because i am in a testing center. I was suspected of cheating days after the exam. I assume the teacher saw me through his end (the camera on the computer not the one in the testing center). The most he would see is me looking down at the table. I was using scratch paper to write stuff as a cover up for looking at these little papers i had wrote stuff on. He will eventually request to see the testing centers footage which is shakey at best and the most they will see is me looking at the papers hidden under the scratch paper they gave me. I have to go to my university and explain my reasonings. What should i say for having those little papers? There was about 6 different little pieces of paper? The computer camera cant see the table. And they have no proof of what was on my paper. I got to a university and they are doing an investigation. Thanks for your help.",
        "created_utc": 1670889491,
        "upvote_ratio": 1.0
    },
    {
        "title": "R2 startup expectations.",
        "author": "Accomplished-Leg2971",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkddnk/r2_startup_expectations/",
        "text": "I'm interviewing for biology assistant professor at several west coasl R2 state colleges. \n\nWhat are _typical_ startup packages people have been offered.",
        "created_utc": 1670883262,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to cite something not listed on any citation guide? Can't find in APA book.",
        "author": "SlightlyDevious",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkbuip/how_to_cite_something_not_listed_on_any_citation/",
        "text": "I greatly apologize for asking a citation question as the submission asks us not to. However, I'm trying to cite a bulleted checklist in APA verbatim as part of my literature review and I cannot find any information on how to in text cite a bulleted list or check list from someone else. This list is a pretty crucial part of my lit review so I would greatly appreciate the help.",
        "created_utc": 1670879976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a hold of Professor for overdue recommendation letter",
        "author": "LHProp1",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zkasd3/getting_a_hold_of_professor_for_overdue/",
        "text": "I asked for letters in early October, but one of my hasn’t submitted (it’s almost a week past my first deadline). They also not responding to my emails. I thought I’d be good because I ran into them a few days before my first deadline and they assured me they’d submit. The rest of my deadlines are in the days. I’m quite frustrated as both overdue programs claim to start reviewing applications immediately. I’m both trying to find another professor to write a letter on zero notice, and trying to reach this one.\n\nFor the one that had agreed to write a letter, I’ve tried sending emails marked urgent, and gone to their office but haven’t found them there. What would be considered acceptable ways of reaching a professor? \n\nSecondary question: how can I politely convey my disappointment so that they take it to heart and avoid doing this to future students?",
        "created_utc": 1670877726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does ranking really matter?",
        "author": "Snape_Prof",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk9p2x/does_ranking_really_matter/",
        "text": "I am preparing my application for applying to some US universities for PhD in Mechanical Engineering.\nDoes the university ranking directly affect the quality of research, courses and opportunities after PhD? Or are there more important factors I should consider when choosing my target universities?",
        "created_utc": 1670875325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obstacles in conducting a Scoping Review",
        "author": "minosplato",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk9jow/obstacles_in_conducting_a_scoping_review/",
        "text": "I am in the process of conducting a scoping review in a field in the humanities. I have selected relevant keywords, databases, and 8 sentinel articles from a google scholar search. Right now, I am trying to conduct a preliminary search in the databases to see if the sentinel articles appear in the search and in that way test the feasibility and relevance of our topic. However, only two of my databases grab the 8 sentinel articles. The other ones just catch 1-4 of them. I have tried different Boolean combinations, modifying some keywords, being more broad, but it doesn't seem to help. \n\nHas anyone been on this situation before? What do you recommend doing to be able to find the target articles and what could be wrong in my process that I am unable to do so right now? \n\nI would appreciate any help or insight on this. Thank you in advance.",
        "created_utc": 1670875021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who should I speak with to make a plan for my college career?",
        "author": "mikey00921",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk8fqg/who_should_i_speak_with_to_make_a_plan_for_my/",
        "text": "\nHey everyone, just had a couple questions. \n\nBackground:\n\nI never did well in highschool. I didn’t even want to go to college (None of my family has ever been and have very normal jobs, so I thought that was destiny). That was where I eventually met my girlfriend that persuaded me to do well in school and then go to college. I was doing it for her and her family as they all are very successful and went to college. Anyways I graduated highschool with like a 3.2 GPA, and went to community college and that’s where I am now. \n\nNow that I am in college, I actually found that I want to be in college and in fact I love it. I took my first class of biology and found that wow, this is very interesting and I love this ( I did well in it, I got B. I definitely could’ve gotten an A, but yet again a lot of family drama was happening that took a lot of my mental capacity). So, I talked to my professor and she suggested that I look into jobs that I want to have and what it takes to get to there. After lots of thought, I want to be a physician. I’m not sure what field and what not but I definitely want to go to med school. \n\nSo to get into med school I plan on transferring to either UCF or U.F after my A.A at my cc, getting a 3.7+ GPA, volunteer at hospital, have a medical related job, do research, and shadow a doctor. \n\nFor shadowing I have a family friend that owns a cardiology practice, that said I can shadow him for how ever long and whenever I want to. I just need to follow through with it. \n\nMy question to you guys is how do I plan this? When do I shadow vs research vs volunteer? How many hours each? Who can I speak to about conducting research? Just in general, if I have a question who do I ask?\n\nThanks guys, sincerely a very lost student",
        "created_utc": 1670872607,
        "upvote_ratio": 1.0
    },
    {
        "title": "CV for MS in Stanford",
        "author": "AssociationOk9073",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk89aq/cv_for_ms_in_stanford/",
        "text": "What does Stanford look for in the CV of it's candidates applying for MS? What all should the CV include? Any extraordinary works?",
        "created_utc": 1670872222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is IJEAST a legitimate journal?",
        "author": "Lucky_Release",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk7u8e/is_ijeast_a_legitimate_journal/",
        "text": "[removed]",
        "created_utc": 1670871331,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you manage with all of this information going around?",
        "author": "wigglytails",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk4ihk/how_do_you_manage_with_all_of_this_information/",
        "text": "This is insane. There is the work that I do and have to do. The papers that I need read. The presentations I have to watch. Checking what everyone is doing on linkedIn and twitter. The meetings I have to attend. The google scholar alerts. The arxiv papers. The programming, the high performance computing, the math, the engineering, the programing libraries... How does one manage within all of this information? This is unreal. \n\nI started my PhD last month and I am working remotely for the time being. Am I overwhelmed because I am alone?  Would being part of a research group help as we carry some of that burden? Still insane though.",
        "created_utc": 1670864216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me with a research query!",
        "author": "UniqueSandwich9972",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk3zi5/please_help_me_with_a_research_query/",
        "text": "I am currently a student of English literature and I am interested in composing a research paper. My topic is showing an individual as an existentialist. \n\nCan you help determine the right theoretical framework and preferable approach? What would've been your strategy if you were conducting a research that involves showing an individual as an existentialist?\n\nThanks in advance for your help.",
        "created_utc": 1670863023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking of dropping out of my PhD program for financial reasons",
        "author": "AphroditeDraws",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk3c8j/thinking_of_dropping_out_of_my_phd_program_for/",
        "text": "As the title says, I’m seriously considering dropping out of my PhD program because I can’t afford to be in it. I have a bachelors degree and a masters degree already and part of me feels like that’s enough. \n\nI just finished my first semester of a PhD program in applied behavior analysis, and it’s taken a bigger financial toll on me than I expected. I’m on a fellowship, but it’s just enough to cover tuition with about $500 leftover which is not enough to live on.\n\n Right now I don’t have a TA or RA position, and getting one depends on me getting a certification that I need fieldwork hours for, but I am not getting a lot of fieldwork hours because I have to work part time. My partner and I are struggling to make ends meet and I feel guilty for not being able to help more. If I were to drop out, I would be able to complete my fieldwork hours much faster, get my certification, and make exponentially more money than I make now. \n\nRight now it feels like it’s not worth the financial burden, the burden on my family (they are supplementing my income), and the burden on my relationship. I am also about to lose insurance coverage (I don’t get insurance under my fellowship). It just feels like the pros of dropping out out weigh the cons. I’m passionate about what I’m doing and have made great connections so far, but it feels like it’s not worth it. \n\nIf anyone else has faced a similar dilemma, I’d really appreciate some advice. Thanks in advance.",
        "created_utc": 1670861619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anybody here ever experienced an issue with your Google Scholar account in which your account does not appear in Google search?",
        "author": "whatisa_sky",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk389w/has_anybody_here_ever_experienced_an_issue_with/",
        "text": "My account would only show up if search for my name in Google Scholar search box, but not in the web search. I think I have my GS account set up for about a year now and it has always been invisible from Google search. It is verified using my current affiliation email, and is public.",
        "created_utc": 1670861375,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEW VIDEO! I made new video about Mars on YoTube 😉 I put ton of information in it so I am sure you will like it 😆! Here is link: https://youtu.be/fzctXB0_xu0",
        "author": "youtuber2508",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk373i/new_video_i_made_new_video_about_mars_on_yotube_i/",
        "text": "[https://youtu.be/fzctXB0\\_xu0](https://youtu.be/fzctXB0_xu0)",
        "created_utc": 1670861302,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to write a research paper?",
        "author": "upsidedownsq",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk33z0/how_to_write_a_research_paper/",
        "text": "I have to write a research paper for my final. I’m doing mine on how emotionally support animals are beneficial. \n\nI’m currently clueless on how to start. It has to be 7 pages…",
        "created_utc": 1670861117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey About The Effects of Father Absence on Development",
        "author": "Isabella434",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk2oh2/survey_about_the_effects_of_father_absence_on/",
        "text": "[removed]",
        "created_utc": 1670860168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Independent IRBs",
        "author": "caprette",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk2eq4/independent_irbs/",
        "text": "Hi all,\n\nI completed my PhD a few months ago in cultural anthropology and I am now settling nicely into my new job--a position as a researcher at a research institution that is *not* a university or degree-granting institution. The thing is, the vast majority of researchers here are plant biologists. I'm the only PhD-level social scientist. So of course, this means there is no in-house IRB. All of my research in the past has always been exempt from full review, but some grants and journals require IRB approval if you do any kind of human subjects research. I want to make sure I am jumping through all the appropriate administrative hoops.\n\nI'm looking into independent IRB firms. Has anyone used any of these companies? Are there any that are easier to work with, particularly for social scientists? (My PhD university's IRB was a *nightmare* because it was focused around medical research and didn't understand cultural anthropology.) Is there anything I should look out for or avoid?\n\nI'm located in the midwestern USA.",
        "created_utc": 1670859560,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you read papers on your ipad without endlessly scrolling up/down between text/tables/figures?",
        "author": "bqtmqn",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk20fz/how_do_you_read_papers_on_your_ipad_without/",
        "text": "As per topic. \n\nFeels like im doing something wrong here.\n\nMy workflow is to upload papers to either dropbox or onedrive then proceed to read from there. The scrolling is making me lose my train of thoughts.",
        "created_utc": 1670858660,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a procrastinator and I often feel guilty because of this.",
        "author": "RobinHoodTh",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zk05il/i_am_a_procrastinator_and_i_often_feel_guilty/",
        "text": "I am doing the  3rd year of my physics PhD and sometimes I enjoy it  pretty much. The first year was catastrophic but then I did some  progress and published two papers. In the last three months I think I  did an okay job but in the last 1.5 week I did almost nothing. I felt   again as I felt when I was at my first year. I am constantly comparing  myself to people who have 3-4 papers a year and working also weekends  and nights. This makes my procrastination even worse. I really like  doing physics but when I am alone or not in the office it almost feels  impossible to work on the projects. I do not know what to do with my  life after I get my PhD. I do not think I would enjoy working for a  company more but also I am afraid that I am too lazy and procrastinate  too much to get a job as an academic. Are here people who suffer from  the same or suffer from this thing but after PhD they found there place  in academy?",
        "created_utc": 1670854266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kindle Scribe",
        "author": "Obvious_Owl_5705",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjzgpe/kindle_scribe/",
        "text": "Has anyone tried the new Kindle Scribe yet? Any early thoughts on how well it would do when reading/annotating research papers and books or when taking notes in general? It looks fantastic, but I’m not seeing anyone talk about it yet.",
        "created_utc": 1670852567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any reliable plagiarism checkers for master thesis?",
        "author": "sloerewth",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjy3nq/any_reliable_plagiarism_checkers_for_master_thesis/",
        "text": "For context, I am conducting my master thesis in Applied Machine Learning. So I have dedicated the first section of thesis just for explaining the basics of the problem I am tackling and the models I am using. I have no idea if this is how it's done, but I first started with copying a lot from various text books and review articles for equations, images and explanation text. My idea was to modify it to reduce plagiarism once I finish writing since I wanted to get done with the massive task of writing first.\n\nHowever, I have no idea how to go about checking for plagiarism. I know about turn-it-in and grammarly but I am hearing mixed reviews.\n\nI don't mind paying for the service, but it would be really helpful if you have any suggestions.\n\nAlso, feel free to critique my methods of going about writing my thesis. I am terrified that I am doing everything wrong.",
        "created_utc": 1670849228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Postdoc Research Fellowship",
        "author": "win_chest_ER",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjukmb/postdoc_research_fellowship/",
        "text": "I am a non USA IMG. I am looking for Postdoc programs in neurology or medicine. What are the programs IMG friendly? #img #postdoc",
        "created_utc": 1670839416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekends",
        "author": "psyguy_91",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjtnep/weekends/",
        "text": "What are the pros/cons of writing on weekends?",
        "created_utc": 1670836820,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Weekly] Office Hours - undergrads, please ask your questions here",
        "author": "ZootKoomie",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjt7qu/weekly_office_hours_undergrads_please_ask_your/",
        "text": "This thread is posted weekly to provide short answers to simple questions, mostly from undergraduates to professors. If the question you have to ask isn't worth a thread by itself, this is probably the place for it!",
        "created_utc": 1670835610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thesis binding in Australia",
        "author": "Accurate_Fly9803",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjsutj/thesis_binding_in_australia/",
        "text": "Looking for recommendations of a quality, affordable binding service in Australia.",
        "created_utc": 1670834549,
        "upvote_ratio": 1.0
    },
    {
        "title": "iPad Air or iPad Pro for reading/annotating academic papers, notes, and grading?",
        "author": "Forsaneth",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjsqx6/ipad_air_or_ipad_pro_for_readingannotating/",
        "text": "I'm trying to decide between iPad Air and the largest-screen iPad Pro for reading academic papers and grading--any advice? My priorities include: handwriting to OCR conversation capability, stylus ease, screen resolution, device weight, screen size, and AirDrop capability. Taking notes without a screen barrier between me and the presenter/interviewee/student/etc. is one reason I'm looking into a tablet. I read other subreddit posts but need more info on tradeoffs including screen size: for grading, I'm thinking the Pro would be better on screen size because it's larger, closer to 8x11 paper size for grading scanned docs. On the other hand don't need all the bells and whistles. Also looked at Remarkable but seems it's hard to reach customer service for it. Thanks.",
        "created_utc": 1670834220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a second Master's good Idea?",
        "author": "rmrjk",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjn8vj/is_a_second_masters_good_idea/",
        "text": "I have a master's from India in IPR and technology laws.  I want to do PhD abroad. But I feel like I need to learn more so I am considering an advanced masters or another master's in technology law. Is this a good idea?",
        "created_utc": 1670819927,
        "upvote_ratio": 1.0
    },
    {
        "title": "PI won't serve as a referee for industry jobs",
        "author": "throwaway02548",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjj6xa/pi_wont_serve_as_a_referee_for_industry_jobs/",
        "text": "I  applied and had interviews for a bunch of jobs (postdoc &amp; tenure track, non-tenure track positions)  in academia recently. This week I decided that I would also start applying for industry jobs, and of course, I talked to my advisor about this. Things suddenly took a really bad turn as my advisor firmly told me that he would not serve as my referee.\n\nTbh I am in the wrong too. Since I joined the lab, I have always displayed that I wanted to be a professor, and my advisor has also helped me connect with many \"big\" names in the field. Not that now I have completely given up the career path in academia. It's just that I want to have more options.\n\nIs it a big red flag for an applicant applying to the industry if the referee list does not include your advisor?",
        "created_utc": 1670810821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help deciding between two MA in Military History Programs",
        "author": "eze9457",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjhks8/need_help_deciding_between_two_ma_in_military/",
        "text": "Hi all,\n\nI am interested in studying for a Master's in Military History. I am currently looking at doing online programs and am between two programs. The Citadel's MA in Military History w/ Graduate Certificate in Military Leadership or Norwich University's MA in Military History. \n\nI am a former military veteran and have a BA in History already. I see the value in both programs but am having a tough time deciding between the two. I think I slightly prefer The Citadel's program because it has the Dual MA and Graduate Certificate in Military Leadership but am definitely open to either. It seems like both are equally as prestigious and cost is about the same. \n\nAny thoughts are appreciated!",
        "created_utc": 1670807430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working while earning a PhD",
        "author": "radicalroyalty",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zjfjp5/working_while_earning_a_phd/",
        "text": "Hi, I am based in the United States. I have my MSW from the #1 program and work full-time at a completely remote organization that is very flexible with hours (as long as the work is done they don't care when I complete it).  I am interested in earning my PhD in sociology or WGST. I'm interested in hearing from people who worked FT remote while earning their PhD. Was this possible? For context, I currently work in a research-ish role, and also worked while writing a book for a University press, which will come out in 2024. Pretty easily completing an academic book while in this role has me feeling confident that it is possible, though I know earning your PhD is a different beast.",
        "created_utc": 1670803345,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do professors feel about teaching lower level classes?",
        "author": "WritingSad442",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zja86t/how_do_professors_feel_about_teaching_lower_level/",
        "text": "To any professors out there. Do you guys actually enjoy teaching the freshman and sophomore level classes or do you prefer teaching the upper level undergrad and grad level courses? For example I would imagine if you got a PhD in math and you had to teach intermediate algebra to a bunch of freshman who don’t want to be there it could be kinda frustrating.",
        "created_utc": 1670794657,
        "upvote_ratio": 1.0
    },
    {
        "title": "A student trick that I encountered and was surprised",
        "author": "Bogdan_Romaniuk",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zja1ho/a_student_trick_that_i_encountered_and_was/",
        "text": "I am a student, and I can get my favorite application for five years for free, but for this, I am asked to invite 5 classmates.\n\nI can't invite fake accounts, why?",
        "created_utc": 1670794370,
        "upvote_ratio": 1.0
    },
    {
        "title": "voice to text transcription?",
        "author": "JMusicTravelLove",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj7wxe/voice_to_text_transcription/",
        "text": "I often have thought it would be nice to use some voice to text transcription software to help me rough out my ideas for early draft papers.  Walking around thinking and speaking extemporaneously to get some ideas or thoughts and connections out of my head in a freeform way.\n\nI would be curious to know if anyone uses such software?  Thoughts on best stages of drafting or researching to use such software?  Does it have an important role in your academic pursuits or is it just a hindrance?\n\nThanks!\n\nI posted this in a different sub reddit but I think it would be most useful in this space.",
        "created_utc": 1670791349,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has the academy changed since the day you arrived ?",
        "author": "Real_RickestRick",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj57zo/how_has_the_academy_changed_since_the_day_you/",
        "text": "All sectors and professions evolve, whether it is because of crises, startups or innovation. In some sectors, the evolutions are clear to everyone, and articles like this one also show that new needs/jobs appear and disappear. However, scientific methods and their rigor are old and some disciplines don't seem to have evolved for thousands of years (I guess a mathematician doesn't need much equipment to do his job). So  I wonder how your work in the academia has changed, and if it has changed for the better or worse.",
        "created_utc": 1670787128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Batch Normalization (BN) and Its Effects on the Learning Process of Convolutional Neural Networks",
        "author": "Puzzleheaded-Ad-5555",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj44z8/batch_normalization_bn_and_its_effects_on_the/",
        "text": "[removed]",
        "created_utc": 1670785321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any search engines that show me a list of scholars who publish in areas related to the search term?",
        "author": "surf_AL",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj1xeh/are_there_any_search_engines_that_show_me_a_list/",
        "text": "I'm at a university where I don't have access to Scopus which was useful for these types of searches. Can anyone recommend a search engine where I enter a keyword, and it gives me a list of authors who have published in this area, and then lets me see their publications that are related to the keyword?",
        "created_utc": 1670781795,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 years since I received my B.S. in Physics. Applied twice for Physics PhD Programs. Rejected twice. Currently working as a High School Physics Teacher. I want to go back to grad school, but I don't know how anymore. My current plan is to build up Summer Research Experience. Looking for advice. TIA.",
        "author": "jonginnie_4_life",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj1mps/2_years_since_i_received_my_bs_in_physics_applied/",
        "text": " Hi everyone,\n\nI am in my mid-20s from the US. I am 2 years out of undergrad with a B.S. And here's my story. Got a full merit scholarship to a public university in a major city. Finished with a GPA of 3.4 and a B.S. in Physics. During undergrad I participated in a research lab doing work on photonics with TMDs and creating hybrid bi-layers using a stacking method. The next two semesters after I graduated I participated in a Science Undergraduate Laboratory Internship (SULI) program at a National Laboratory working in Nuclear Data Science for the first and Theoretical Quantum Mechanics for the second.\n\nDuring these past two years I applied to many PhD programs. The first round of applications I was arrogant. I thought I could apply to a bunch of super duper advanced schools (IVYs and such) and definitely get into at least one. I learned it doesn't work that way. Second round I applied to schools at or lower in ranking than my undergrad. Thought a lower ranked school would be more willing to take a chance on me. Wrong again.\n\nBefore I received my last decision for the second round of applications I made a deal with myself: \"If I get rejected again, I'll take a break and try something else\". I got rejected again and tried something else. I am currently a physics teacher at a private high school in New England. And after a few months of working with uninterested and lazy students, I am so bored and disheartened. I didn't think every student would love math and physics, but the administration just pushes these kids through and I am pressured to walk the line.\n\nI need to try. I need to go back to grad school and see how far I can go. My current plan is to work here for a few more years and save as much money as I can; my family and myself aren't wealthy enough for me to just not have an income while I apply to grad schools. I also plan to accumulate as many accolades, research reexperiences, and letters of rec as I can before I apply again. That is what brings me here. As a teacher I have summers COMPLETELY OFF. I am currently searching for Summer Post-Baccalaureate Internships and Research Programs preferably in Experimental Particle Physics (I prefer theoretical, but I know it's harder to get into) OR PhD Bridge Programs with a stipend during the regular Fall and Spring semesters.\n\nThankfully other than money, I have no obligations or restrictions on where I can work, live, or travel to. I am open to living and working anywhere as long as it gets me closer to my goals.\n\nThank you to anyone who takes the time to respond and good luck to everyone else on their grad school journeys!\n\n**TL;DR - I want to go to grad school for a PhD in Physics. 2 years since my undergrad. A few random research experiences. Currently a high school physics teacher. ISO Summer Physics Research Programs.**",
        "created_utc": 1670781331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice regarding the Defense/ Viva Presentation slides",
        "author": "Wear_Gloomy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj1cdx/advice_regarding_the_defense_viva_presentation/",
        "text": "I have a few questions regarding making the Defense/ Viva Presentation slides:\n\n1. Where do I begin?\n\n2. How long should it be? How many slides?\n\n3. Can anyone share any helpful templates or guides? \n\n4. Can I include images/ charts/ diagrams that summarize some of the sections in the thesis, but are not included in the thesis itself?\n\n5. Any other useful tips?\n\nThanks in advance!",
        "created_utc": 1670780846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should the Review of related literature be limited to the sample group of the study?",
        "author": "badtzmaru_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zj1arx/should_the_review_of_related_literature_be/",
        "text": "I'm sorry for the bad grammar. The review of related literature is a chapter for thesis. The Act that I will study involves basic education students. I will still search which age group will be the sample group, I'm still not sure if it will be primary or secondary education students.\n\nShould I limit my RRL to either primary or secondary education students? or should the RRL include both primary and secondary education students?",
        "created_utc": 1670780766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't the scientists themselves relay their research to the public?",
        "author": "Creepy_Gur_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zizn2r/why_dont_the_scientists_themselves_relay_their/",
        "text": "I watch a lot of popular science videos, but generally you don't learn much about the subject and the studies cited are usually only to support the journalist/youtuber's point... Even when you read an article, there are few or no resources available to learn more about the research process or even to explain the research to an amateur audience. In the end, only the most popular articles are highlighted. \n\nSo I would like to know if you think that scientists should communicate more with the public, or if explaining their work to a non-scientific audience is not important.",
        "created_utc": 1670778038,
        "upvote_ratio": 1.0
    },
    {
        "title": "When citing a journal article in apa 7th do I credit the Journal author themselves or only the writer of the specific article?",
        "author": "Taco_king_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zixc1u/when_citing_a_journal_article_in_apa_7th_do_i/",
        "text": "The specific article has a different author to the journal itself, as I'm only referencing the one article who do I name in my citation?",
        "created_utc": 1670774132,
        "upvote_ratio": 1.0
    },
    {
        "title": "The perfect answer to all questions",
        "author": "quorum-sensing",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zivzx8/the_perfect_answer_to_all_questions/",
        "text": "The perfect answer to all questions being asked in r/AskAcademia is “depending on the field/region/position/uni.”🤣",
        "created_utc": 1670771823,
        "upvote_ratio": 1.0
    },
    {
        "title": "There are Two Openings at University X for My Partner and I, but My Partner Only Wants to Apply if I Get an Interview First. Is There a Polite Way to Ask University X if They Will Make a Decision about My Application in Time for This?",
        "author": "narwhal_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/ziqfxv/there_are_two_openings_at_university_x_for_my/",
        "text": "Sorry if that title is unclear, here is the situation:\n\nI've applied for a job at University X, which had an application deadline of December 1st. University X also has an opening in my partner's field, with an application deadline of January 15th. My partner would move with me either way, but she doesn't want to start putting in all the work to write an application if we find out after her deadline (or just before) that I didn't get an interview. If I don't get an interview, then my partner won't bother applying to the other opening and we'll call it a day. \n\nI'd like to write to the search chair about the position I applied for to ask about their timeline for notifying about interviews. Is this a bad idea? if I should, what is the best way to do this? Should I be honest about the reason/mention my partner at all? Should I just reiterate my interest in the position and ask when they plan to notify their first round of interviewees? Should I ask if they expect to notify for first round interviews by the end of the year?",
        "created_utc": 1670762579,
        "upvote_ratio": 1.0
    },
    {
        "title": "As an American, would masters and PhD degrees from a British uni make me less employable at a uni in the States?",
        "author": "razorsquare",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zipfr6/as_an_american_would_masters_and_phd_degrees_from/",
        "text": "I just finished my masters at a uni in the UK and will go on to do my PhD there as well. Both are Russell Group schools. I plan to return to the US when I’m done. Will having British degrees be viewed negatively by hiring universities in the States?",
        "created_utc": 1670760345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I correct the misprints/errore in my paper?",
        "author": "i_am_6ft_btw",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zip2kb/should_i_correct_the_misprintserrore_in_my_paper/",
        "text": "Hi, I recently got my first paper published as an undergrad. It is a review article. The editors had asked me to make some changes to my abstract, which I did. However, they did not like them and made their own changes which got published. There are a few errors in the published abstract now such as missing punctuations, missing \"and\", \"or\" etc. The actual content is fine though.\n\nThe first line of the abstract literally has an error due to which the abstract now reads \"XYZ material possess both optical and electrical properties\" which is nonsense in this context.  It should call those properties unique or special etc. I want to mention this publication on my CV when I apply for admissions but I'm worried that if admission officers look at my publication and see that the abstract, which I know is often all that is read, is clumsy, it will make a very bad impression.\n\nShould I try to get these errors corrected or hope that the next one or two publications I can get before applying to universities can bury these mistakes?",
        "created_utc": 1670759388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find data that shows how much NSF (basic science) grant money each institution receives?",
        "author": "miningquestionscan",
        "url": "https://www.reddit.com/r/AskAcademia/comments/ziis33/where_can_i_find_data_that_shows_how_much_nsf/",
        "text": "I seem to only find total research expenditures",
        "created_utc": 1670741473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find data that shows home much NSF (basic science) grant money each institution receives?",
        "author": "miningquestionscan",
        "url": "https://www.reddit.com/r/AskAcademia/comments/ziirja/where_can_i_find_data_that_shows_home_much_nsf/",
        "text": "I seem to only find total research expenditures",
        "created_utc": 1670741441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can authors of review papers add their photos in the authors section?",
        "author": "Berserker_boi",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zigino/can_authors_of_review_papers_add_their_photos_in/",
        "text": "can we write a short section about the author in a review paper? like their photo, contact, qualification and a short about them?",
        "created_utc": 1670736491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like my college may be inflating grades",
        "author": "Traditional_Region26",
        "url": "https://www.reddit.com/r/AskAcademia/comments/zig6ap/feel_like_my_college_may_be_inflating_grades/",
        "text": " I go to a small liberal arts school. I got on academic probation a year ago and have since been trying to do better and changed my major from stem to accounting.  However, some of my professors have been crazy lenient. Like I was doing poorly in one class last semester, didn't go to office hours and probably attended 80% of the time. The professor still gave me a c when I really deserved an F. Then this semester I missed about 50% maybe more of the classes for a class where attendance was graded. The professor ended up giving me an 88% for attendance. I also handed in two essays late, one of which was considered the final, and he gave me A for both essays. It even says in the syllabus late essays get penalized a grade but he took off maybe 2 points and nothing else, which is weird cause I know I didn't write those essays perfectly. I'm just feeling really confused about this. I've been hearing that they've struggled financially recently because of covid so could they be trying to keep me there to get more money,make their retention rates look good, or something similar? Nothing major has happened to me recently either, so it's not like they all collectively feel bad for me. \n\n\nThey also all offer extreme amounts of extra credit, and post  almost the exact test online to review( accounting major). Tests get curved constantly by 4-10 points. It just seems way to easy. Even my friends from different schools seem to struggle a lot more in accounting. I know this may sound really conspiracy theory like and I don’t paint myself in the best light, but honestly just want to see if this really does seem weird.",
        "created_utc": 1670735759,
        "upvote_ratio": 1.0
    },
    {
        "title": "MS Science: How to deal with advisor/ also professor who accuses you of dishonesty through a TA?",
        "author": "regard12345",
        "url": "https://www.reddit.com/r/AskAcademia/comments/ziek23/ms_science_how_to_deal_with_advisor_also/",
        "text": "I just got an email telling me that my advisor and professor that he thinks I violated the academic honor code.\n\nEarlier this term, I took an exam as part of a one-year master's program and it's been a matter of policy that I am supposed to turn off my cell phone/ electronics and leave them outside.\n\nI got to my test room late (everyone has their own testing cubicle) and in a rush, and neglected to turn off my phone and put it away, and took the exam. About halfway through, the phone starts ringing incessantly from a close family member, who has no idea that I am in an exam, about an urgent ongoing health concern of another family member. Despite having the ringer off, it keeps vibrating in my pocket and going off, and in order to make it stop happening, I have to take it and manually turn it off. At the moment, I thought to take it out, hold down the power button, and swipe to turn it off, which I thought would not be a big deal, but the TA proctor noticed that I had my phone taken out to turn off (probably a ten second process on iPhone). In retrospect, I am still not sure what I should've done in this situation.\n\nHe then notified the professor, took photos of my exam, and allowed me to finish. I immediately went  to the class's professor and spoke to him about the incident, and he told me that it seemed like not a big deal.\n\nFast forward three weeks, and I receive an email from the professor telling me that after speaking to colleagues and thinking it over, I would receive a zero on the exam (enough to fail me). I understand that on paper, the policy of asking for electronics to be left outside is a rule that I should've followed, but I truthfully didn't use my phone for any assistance or information during the exam, which my professor also verified by taking my phone and looking through recent texts and calls, as well as my camera roll. Given the circumstances of my repeatedly ringing phone, I had no option emotionally or physically at the time, to pretend that something vibrating in my pocket did not exist.\n\nThis is my first time in academia having this happen to me, and I am not sure what I am supposed to do here, as I did make a mistake by getting to the exam late and neglecting to turn off my electronics and put them outside, but I did not use it to cheat in any sense. I reviewed my school's policies on things like this and my only way forward is to bring it up to an appeal committee to review whether or not an integrity violation occurred, and if I do that, how in the world would I prove that something did NOT happen at the master's degree level? I understand that schools probably have a high incentive to maintain reputation and are wary of allowing this appeal to go through. :(\n\nThanks for the advice",
        "created_utc": 1670732191,
        "upvote_ratio": 1.0
    }
]