[
    {
        "title": "How precisely does moral relativism differ from cultural relativism?",
        "author": "AdeptofAlliterations",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z0oxrq/how_precisely_does_moral_relativism_differ_from/",
        "text": "Been reading through some of the stuff posted previously here but couldn't really understand. What I'm getting is that cultural relativism is a method of inquiry which entails not judging (at least outwardly) a cultural practice without a thorough understanding of how it came about, and moral relativism is a philosophical position which states that moral standards are largely dependent on culture. Is that all sounding about right? Also, as an aside, do many anthropologists subscribe to moral relativity or other forms of anti-realism?",
        "created_utc": 1669003562,
        "upvote_ratio": 1.0
    },
    {
        "title": "The \"Fossilized Cultural Memory\" Phemomenon",
        "author": "troyelliszon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z0htoz/the_fossilized_cultural_memory_phemomenon/",
        "text": "I'm making this post in order to inquire about and perhaps to generate wider interest in a cultural phenomenon I've noted but which doesn't seem to have a name, thus leading me to dub it the 'fossilized cultural memory' phenomenon, of which I've uncovered two examples so far.\n\nBasically, there seems to be a phenomenon in which a culture, typically a small and oral one, will have a legend about an animal or a people that might have existed a very, very long time ago in the ancient past, but which following said,  animal or people's extinction, take on a legendary status, being somewhat 'fantasticalized'.\n\nI have two examples:\n\n&amp;#x200B;\n\n1. The Inuit tell of a race of giants called the *Tuniit*. They were supposedly much taller and stronger than the Inuit but who were very shy. Archeological evidence has pointed to these legendary figures as actually being the Dorset culture, the poorly understood arctic people who inhabited the area before the Thule (who themselves became the Inuit). The Dorset culture existed between 500 BCE and 1000 or 1500 CE.\n\n 2. The bunyip is a legendary Australian creature (a cryptid, really) purported to exist by many Australian aboriginal peoples. Descriptions of its appearance vary, but sometimes it as described as being a large, black, seal-like dog creature and other times like a long-bodied, tusked creature with a long neck and small head. There is a theory that the origin of the Bunyip might be an ancient cultural memory of one of the species of Australian megafauna that have gone extinct, such as *Diprotodon, Zygomaturus,* and *Nototherium.* The Diprotodon died out 44,000 years ago, and Aboriginal Australians have inhabited their lands for 50,000 years.\n\n&amp;#x200B;\n\nAnyways, what do you think? I find this to be really interesting.",
        "created_utc": 1668984369,
        "upvote_ratio": 1.0
    },
    {
        "title": "How could the spread of PIE have been peaceful?",
        "author": "nathasnrileyqp",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z0gt96/how_could_the_spread_of_pie_have_been_peaceful/",
        "text": "My understanding is that it was once thought that PIE was spread through violent conquest, however nowadays this is not a mainstream view. The issue is I have a hard time seeing how it could have spread peacefully. Looking at other migrations (for example in the Americas) we have examples of language families spreading, however they usually dont completely dominate the others to the point of driving them to extinction. It also seems like a strange coincidence that the spread of PIE is linked with the spread of wheels and metalworking, which are very useful if they were a conquering people. \n\nA lot of literature will use terms like elite replacement/recruitment but is that legitimately nonviolent? To me it seems more like a different form of conquest than a peaceful spread.",
        "created_utc": 1668981956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the braincase evolve to become more fragile?",
        "author": "sunsmag",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z0grm1/why_did_the_braincase_evolve_to_become_more/",
        "text": "Over time, the hominid neurocranium has become thinner as is apparent by comparing early homo fossils to contemporary sapien ones. I can understand why the browridge, jaw and overall skeleton would become less robust but what is the advantage of having a weaker brain case? Surely any advantage gained by having a lighter skull would be offset by the increased vulnerability. Also the brain is as important if not more important to survival than its ever been, why would the utility in protecting it have diminished?\n\nAll speculation is welcome, thanks",
        "created_utc": 1668981847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orders",
        "author": "TickleBlossomGiggle",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z0f835/orders/",
        "text": "How did grown men take orders from child/teenager kings/emperors?",
        "created_utc": 1668978232,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did Sex become considered “wrong” or “sinful”?",
        "author": "Suggest_a_User_Name",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z0ah6x/when_did_sex_become_considered_wrong_or_sinful/",
        "text": "I hope you know what I mean. When and why did sex become considered dirty",
        "created_utc": 1668966800,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to explain similar symbols/motifs which are found around the world?",
        "author": "aykavalsokec",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/z05zlo/how_to_explain_similar_symbolsmotifs_which_are/",
        "text": "Hello everybody,\n\nHow does one explain the existence of similar cultural motifs or architectural edifices (or even construction techniques) which are found around the world?\n\nOne example I can think of are the statues found in Turkey, Indonesia and Easter Island. Their hands are depicted as being positioned around the navel/genitals. Of course the number of the examples can be multiplied.\n\nAs far as I know, in archaeology, there are two main frameworks in operation; which are diffusionism and evolutionism. \n\nI know the terminologies are more related to archaeology, but upon reading a bit into it, I found out people such as Franz Boas were also using these terms and I think it's also related to anthropology.\n\nDiffusionism suggests most of the important innovations and advances in human culture occurred only once and were transmitted by contact to other areas.\n\nEvolutionism suggests that similar developments in different places are due to the like working of minds under like conditions.\n\nI am wondering if there are any other ideas which offer another perspective to this issue? And I mean not the critiques which are aimed towards the diffusionism and/or evolutionism, but rather something independent of those two.",
        "created_utc": 1668955848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did diapers exist in hunter/gatherer times?",
        "author": "PracticalWallaby4325",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzqwqw/did_diapers_exist_in_huntergatherer_times/",
        "text": "Settle an argument for me, did hunter gatherers have some form of diaper?\n\nObviously not diapers as we know them or even the cloth diapers our grandparents used, but did they have some form of urine/feces catching device they strapped to their babies?            \nIf not, what did they do? Just let the babies go wherever?",
        "created_utc": 1668905279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the Greco-Roman pantheons have multiple gods and goddesses for the same thing?",
        "author": "Reticent_Dorothy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzngew/why_did_the_grecoroman_pantheons_have_multiple/",
        "text": "For example, there are Selene and Luna, but also Artemis and Diana, and then the Greeks even had a third with Hecate. Why were there so many moon goddesses?\n\nHelios and Apollo too are both gods of the sun and sunlight, respectively.\n\nIs this a uniquely Greco-Roman phenomenon, or is this a common thing in other religions as well?",
        "created_utc": 1668895575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about brothers, combat, game theory and the Y chromosome bottleneck.",
        "author": "jollybumpkin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzlpzb/question_about_brothers_combat_game_theory_and/",
        "text": "So let's say I engage in a brutal hand-to-hand battle, such as those that often occurred during the bronze age (and maybe before) and iron age. Let's say that my battle companions are ten men, whom I have good reason to believe are my brothers.\n\nIf I'm not mistaken, if my death in battle makes it possible for two of my brothers to live, I break even, reproductively speaking. Let's say I instinctively understand that. At the same time, I instinctively understand that two of them break even, reproductively, if their death allows me to survive.\n\nThis turns into a big, complicated prisoner's dilemma, as far as I can tell. If everybody cooperates, we will all fight more fiercely than if we were more distantly related, or not related at all. Non-cooperators would likely be punished, or allowed to die, but they would instinctively understand that, and so be inclined to cooperate, even at great cost.\n\nThis would apply to a lesser degree to other kin in battle, less closely related, like half-brothers or cousins.\n\nAre there anthropologists interested in an evolutionary point of view who work on game theory? If so, do they feel that this kind of phenomenon has played a role in human history and culture, and human warfare? What do they have to say? Can you suggest any publications?\n\nI suspect this is related to the Y-chromosome bottleneck, from about 8000 to 5000 years ago, give or take. What have experts, far more qualified than me, said about this?",
        "created_utc": 1668890919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any ethnographic work on non-celebrity 'fandoms' like on Trump, Elon Musk, etc where media and internet plays a big part in shaping their popularity?",
        "author": "Khilafiah",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzjhle/is_there_any_ethnographic_work_on_noncelebrity/",
        "text": "In a way similar to celebrities but they're not celebrity figures. So there's some sort of parasocial interaction between the figure and the fans.\n\nTrump and Elon are just two examples from the top off my head. Duterte being another one.",
        "created_utc": 1668884930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anthropology of \"ordinary\" things like sleeping, pooping, light/darkness..",
        "author": "unterrien",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzim3z/anthropology_of_ordinary_things_like_sleeping/",
        "text": "I found a book on the anthropology of sleeping and another one about darkness which was very interesting but I do not find other topics such as pooping or human fluids in general or maybe rain, the stars, the sun, etc.\nDo you have any recommandations please ?",
        "created_utc": 1668882666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any evidence for the painting of icons (other than more abstract symbols like the cross or Chi Ro) on shields in sub-Roman Britain or elsewhere in Late Antique Europe?",
        "author": "rivtimvs",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzd0ff/is_there_any_evidence_for_the_painting_of_icons/",
        "text": "In Geoffrey of Monmouth’s De gestis Britonum there is this passage \n\n\n&gt;Ipse uere Arturus lorica tanto rege digna indutus, auream galeam simulacro draconis insculptam capiti adaptat, **humeris quoque suis clipeum uocabulo Pridwen, in quo imago sanctae Mariae Dei genitricis inpicta ipsum in memoriam ipsius saepissime reuocabat.** Accinctus etiam Caliburno gladio optimo et in insula Auallonis fabricato, lancea dextram suam decorat, quae nomine Ron uocabatur.\n\nIf you can’t read Latin, this is describing King Arthur’s armour and his shield Pridwen, which has an icon of the Virgin Mary. Regardless of any historical basis for Arthur, Geoffrey was describing him as if he were a real man who lived in the Christian, Romano-British culture of the 5th or early 6th centuries, so on that basis I wonder if we have any evidence for shields being painted with icons in either the Late Roman military or in the warrior culture of sub-Roman Britain or Latin Antique Western Europe. From the Notitia Dignitatum and accounts of particular events like the Battle of the Milvian Bridge we see that shields were often painted and designed with some sort of symbol, including the cross or Chi Ro, but these are all quite simplistic and abstract compared to an icon of the Virgin.",
        "created_utc": 1668867816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any articles or books on how gods are created?",
        "author": "ABCKND",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzcumj/any_articles_or_books_on_how_gods_are_created/",
        "text": "Pretty much title. I recently read Karen Armstrong's History of God, and have been reading a number of articles on Wikipedia and Jstor that chronicle the historical conception of Gods. I was wonder if there were any anthropologists who wrote on this matter.",
        "created_utc": 1668867362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there Indo europeans in ancient Egypt?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yzb34m/were_there_indo_europeans_in_ancient_egypt/",
        "text": "Apparently three Egyptian pharaohs (Tutankhamun, Amenhotep III, and Akhenaten) had the haplogroup R1b. \n\nThis haplogroup is associated with the Indo European expansion along with R1a. How did this end up all the way in ancient Egypt?",
        "created_utc": 1668861956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't americans sing and dance as much as other cultures?",
        "author": "VOIDPCB",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yz64b6/why_dont_americans_sing_and_dance_as_much_as/",
        "text": "One thing that i've always noticed is that song and dance seems more abundant in nearly all world cultures except for American culture. Americans dance at clubs but you don't see people joining together in dance and song at all in public. \n\nMost other world cultures appear to be much more jovial than American culture.",
        "created_utc": 1668842069,
        "upvote_ratio": 1.0
    },
    {
        "title": "When/why/how did humans assign names to individuals?",
        "author": "OLSAU",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yz2tyr/whenwhyhow_did_humans_assign_names_to_individuals/",
        "text": "Today, we couldn't imagine not having a name. It is the very first thing we convey, when meeting new people. It is often the very last imprint remaining after we die, literally engraved in stone. We even assign names to animals and sometimes objects.\n\nWhen and why did names become so tightly bound to us as individuals?",
        "created_utc": 1668829875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are conservatives ultimately correct in their worry that society can change people's sexuality?",
        "author": "SoIcyMicrowave",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yywj08/are_conservatives_ultimately_correct_in_their/",
        "text": "I've come here to ask this question because I feel like this is the correct place to go.\n\nObviously conservatives believe that some biblical representation of gender and sexuality is \"the correct\" one. They see Trans people and gay people as evil, blah blah, they're dumb anyways.\n\nBut it seems like in response to these conservative beliefs, people who see such beliefs as clearly stupid, have reacted in such a way, as to imply that our gender and sexuality is actually rigid and you're born gay or Trans or whatever. And it's only recently where society became more aware and understanding, that those people with those in born traits have been able to come out and be free.\n\nI'm no anthropologist and don't know what I would read to understand it all. But I swear I heard that some African cultures have zero gay people. Some other cultures in the past have had lots of homosexuality.\n\nSo in a sense, conservatives could be right that a society could influence how people's gender and sexuality is shaped. But I don't see a problem with that like they do. But I do see a problem with knee jerk reactions to things conservatives say, desperately searching for am explanation of gender and sexuality, which isn't able to be influenced by society and gender, thus \"proving the conservatives wrong\" when in reality it's they who are wrong for saying that people being gay or Trans is a bad thing in the first place.\n\nHope that makes sense. Sorry I'm not a college educated genius, just a dummy here asking a question.",
        "created_utc": 1668810648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diets in different climates",
        "author": "dontstabmenow",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yyuvb6/diets_in_different_climates/",
        "text": "I remember reading something years ago about plant based diets being more common in fertile (or tropical) regions and a more meat based diet being more common in arid areas? Does this have any scientific evidence or is this fancy?",
        "created_utc": 1668806256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inventing new languages to escape the lies of the old?",
        "author": "piezoelectron",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yyor50/inventing_new_languages_to_escape_the_lies_of_the/",
        "text": "The huge caveat for what follows is that it's 100% baseless speculation, so please know that I'm aware of this fact.\n\nI've been thinking about the idea of schismogenesis lately -- in particular, the tendency of adjacent cultures to define themselves in opposition to each other (e.g. Graeber's paper \"Culture as Creative Refusal\"). \n\nOne instance of this -- correct me if I'm wrong -- appears to be James Scott's proposed concept of Zomia, i.e. upland Southeast Asia, where hill communities explicitly fashion themselves in opposition to valley communities. One example of such dynamics is the prevalence of writing in valleys, contrasted with oral literature in the uplands. Furthermore, hill and valley people also speak different languages.\n\nMy extremely speculative question simply takes this case to the extreme:\n\nCan we think of *some* new languages/dialects as self-conscious responses to the fact that elites have so saturated the present lingua franca with propaganda and deceptive rhetoric as to make it virtually unusable for constructive, peaceful dialogue? Is there any research that considers this question, however tangentially?\n\nAgain, I'm fully aware how outlandish this question is, mostly curious if anyone knows of scholars who might have pursued it anyway.",
        "created_utc": 1668790430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying to Berkeley's Medical Anthro Program",
        "author": "Traditional-Party-76",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxvh5s/applying_to_berkeleys_medical_anthro_program/",
        "text": "Hey anthro people, \n\nCurrently in the process of applying to Berkeley's Medical Anthropology Program. I am very attracted to their program (Also applying to anthro PhD's at Stanford, Chicago) but I understand the program is extremely competitive. I don't have any actual medical experience per se; I have a Bachelor degree in anthropology and am completing an MSc in Psychiatry (theoretical, not Medical school tract) and an MA in Philosophy. I have experience in a couple interdisciplinary \"philosophy/neuroscience\" labs and have a paper coming next year, but it doesn't have to do with medical anthropology per se. I am unsure how this leaves me as a candidate. \n\nDoes anyone who has applied to the program or is currently enrolled (or otherwise has wisdom) have any words of advice or thoughts as to how I might compare to typical candidates? \n\n&amp;#x200B;\n\nCheers in advance.",
        "created_utc": 1668704633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men and women mostly have short and long hairs respectively across cultures, when and how did this differentiation come to be?",
        "author": "UforUranus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxt7xd/men_and_women_mostly_have_short_and_long_hairs/",
        "text": "",
        "created_utc": 1668699087,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was the Indian caste system invented?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxogxr/how_was_the_indian_caste_system_invented/",
        "text": "I heard that the Hindu Varna system had Indo European origins as a social hierarchy (Priests at the top, warriors in the middle, merchants at the bottom). But why was the fourth \"Shudra\" caste added? \n\nAlso, did the caste system have racial origins like some people say? If so, why do modern Brahmins have less Steppe ancestry?",
        "created_utc": 1668686497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to get a straight answer on sex (lol no pun intended)",
        "author": "Youcan_tellme",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxob26/trying_to_get_a_straight_answer_on_sex_lol_no_pun/",
        "text": "[removed]",
        "created_utc": 1668686000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conjecture/story of the origin of money",
        "author": "heyheyitsnotok",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxhhb9/conjecturestory_of_the_origin_of_money/",
        "text": "Does the conjecture/story of the origin of money line up with what we know from anthropology.",
        "created_utc": 1668662350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Formal/mathematical approaches to cultural anthropology?",
        "author": "YouSchee",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxh0x2/formalmathematical_approaches_to_cultural/",
        "text": "Hi all! So I was wondering if there's been anyone who's really tried to formalize cultural anthropology, specifically something like borrowing models from linguistics, computational psychology, or other related fields. I've seen some stuff like it coming out of Oxford's cognitive and evolutionary anthropology school, but I'm wondering if there's any unified school or approach in this. There is of course emerging fields like communication science, information dynamics and the like that have at least attempt to get somewhere. I'm interested in materialist/Marxist frameworks in maybe ecological anthropology, and how changing socio-economic environments effect social structures, norms, beliefs and the likes. Think Gluckman's work but approached more scientifically. If anyone knows of any collected works on methodology, philosophy, or even criticisms that'd be great!",
        "created_utc": 1668660963,
        "upvote_ratio": 1.0
    },
    {
        "title": "On his assertion that barter economy is a myth, how does David Graeber adress to Ancient/Early Medieval authors describing barter economies like Solinus on the Dunmonii (Polyhistor, §22.7)?",
        "author": "ImaginaryDrawingsTwt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yxcjem/on_his_assertion_that_barter_economy_is_a_myth/",
        "text": "",
        "created_utc": 1668648393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why aren’t cooking oils as tastefully rewarding as sugar?",
        "author": "Vegetable_Squirrel_5",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yx3hos/why_arent_cooking_oils_as_tastefully_rewarding_as/",
        "text": "Cooking oils are exceptionally more calorie dense than sugar, or foods containing glucose/fructose etc. \n\nShouldn’t our biological system reward us more for consuming higher calorie substances?\n\nOr has the discover of edible oils been too late in the timeline of humanity to have any effect on our reward systems, yet?\n\nCurious to have this conversation from an anthropological lens…",
        "created_utc": 1668626937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating field work for cultural anthro masters",
        "author": "a_stopped_clock",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ywwgrw/debating_field_work_for_cultural_anthro_masters/",
        "text": "I did my masters in cultural anthro abroad initially in 2018, but unfortunately at the time I fell ill during fieldwork and had to return to my home country for extensive treatment.  My fieldwork at that time was centred around community healthcare in south india- specifically volunteer run palliative care programs.  I was looking at what sort of conditions give rise to such a successful voluntary endeavor i.e. education, polictical involvement etc etc.  Now I am back in university and need to resubmit a thesis proposal and I am debating doing it in the UAE because my dad lives there.  A topic that has always interested me there is the different kinds of migrant experiences i.e. labourers from the global south and skilled professionals from Europe NA etc.  What im trying to gauge is basically has that subject already been done to death.  The masters is highly ethnographic and I can basically research anything.",
        "created_utc": 1668612541,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were the Vedas composed?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ywho5i/how_were_the_vedas_composed/",
        "text": "Was it just a typical oral folk tradition of some tribes that turned into a sacred elaborate text when kingdoms emerged?\n\nHow didn't it get lost to time?",
        "created_utc": 1668567262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why cultures are the way they are",
        "author": "The_News_007",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ywhbg2/why_cultures_are_the_way_they_are/",
        "text": "I am new and uneducated yet very interested in the study of cultural anthropology. I am looking for a book (if one exists) that lays out basic differences among cultures across the world. Basically I want to be an inch deep in detail but a mile wide in scope. \n\nAny suggestions?",
        "created_utc": 1668566290,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the general trends and sociopoliticoeconomic contexts of the late Shang dynasty?",
        "author": "rivalackerman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ywgmrb/what_were_the_general_trends_and/",
        "text": "There's  very little documentation (that I can find) about the Shang dynasty.  What was the general historical context, particularly in Zhou Wang's  time? i.e. the fashion, the aesthetics, the naming conventions, the  socioeconomic divides, the political landscape (for example, the lead-up  to the Zhou dynasty). English- and Chinese-language sources would be  welcome.\n\n(For context: I'm attempting to write a story drawing on the historical and mythical image of Da Ji.)\n\n(Cross-posted from r/AskHistorians. Feel free to suggest other places to cross-post!)",
        "created_utc": 1668564451,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the earliest human ancestor that could survive without tools?",
        "author": "Crowbar-Marshmellow",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yweso2/what_is_the_earliest_human_ancestor_that_could/",
        "text": "",
        "created_utc": 1668559418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Domestication of Crops and Population Increase",
        "author": "thebreakingmuse",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ywecmm/domestication_of_crops_and_population_increase/",
        "text": "hey all. asking this as an historian. im working on an essay and ran into a thought that i wasnt sure of. it regards agriculture and population size. obviously the two are related, but, is it always the case that one precedes the other? in other words, what is the more likely scenario: a group that is already increasing in size and adopts agriculture to support it; or, a group that adopts agriculture and subsequently increases in size? i intuitively feel that the latter is the more likely. is this the common understanding of these two things?",
        "created_utc": 1668558107,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was,or is, the Vedic perception of male ascetic's(saddhu,yogis) manliness as compared to the kushti wrestlers and official military class?",
        "author": "insignificantsea",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yw6xtx/what_wasor_is_the_vedic_perception_of_male/",
        "text": "( I have read 2 related books, \\*bull of a man\\* and \\* the wrestlers body\\*)\n\nconsidering the dharmic idea of asceticism and male celibacy producing manliness and vigour; tapas+verya=Ojas, and the culture of an official military class as its own birth-entry caste:\n\nwere ascetics perceived as manlier than wrestlers and soldiers? did saddhus themselves defend temples and asharams during mugal invasions? Ive been looking at dozens of photos of revered siddhas,yogis,saddhus etc, and (theres nothing wrong with this,tho)they dont look like they are soldiers,or wrestlers or weight-lifting ,heavy calories eaters. How does traditional Vedic thought adress this,this perception of manliness based on the power of celibacy and ascetic penances?",
        "created_utc": 1668540216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Human Biological Variation wrt the Brain",
        "author": "Pedantc_Poet",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yw2gu6/human_biological_variation_wrt_the_brain/",
        "text": "In this age of wokeness, my following question is like to get me hundreds of content karma.  Please understand that I believe everyone has intrinsic worth and with very, very few exceptions, they are all equal (e.g. the sole county doctor in the far, far backwoods of Alaskan town,  or the single guy who knows how  to hunt among a band of washaways has more than equal value).\n\nMy question is the following..\n\nWe know that human biology varies by geography.  Back before people started sailing everywhere and flying everywhere, you could usually distinguish a Mandarin from a Maori.  Environmental pressures have shaped everything about us.  \n\nQuestion\n\nIs there any evidence that it has created variations in the brain?  Maybe Pacific Islanders have a intricate geometry part of their brain while Englishmen (due to coordinating the four seasons with the needs for labor vs. the demands of survsiving the winter) have a more intricate part of the brain that handles algebra? (Let me stress once more that I do not believe that a biological advantage toward geometry is or isn't better than one with an advantage towards algebra.)",
        "created_utc": 1668530444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it likely industrialised countries' birth rates will ever recover? Why or why not?",
        "author": "NandoGando",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yvkur2/is_it_likely_industrialised_countries_birth_rates/",
        "text": "The birth rate in most industrialised countries has declined or remained stagnant, do you think this trend will continue? Why or why not?\n\nIn my opinion, I figured natural selection would mean eventually, genes and cultures that promoted fertility/large families would prevail and so at some point the birth rate would eventually come back up. But I'm not sure what timeframe this would take, if it would even occur.",
        "created_utc": 1668480980,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did South asian hunter gatherers develop Caucasoid features?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yvh3ws/how_did_south_asian_hunter_gatherers_develop/",
        "text": "If Negritos, Andamanese Islanders, Aboriginal Australians, etc lived in similar climates near India, then why didn't they develop Caucasoid features like South asians?",
        "created_utc": 1668470802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has Environmental Enrichment Decreased in Modern Life?",
        "author": "politehornyposter",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yvfes6/has_environmental_enrichment_decreased_in_modern/",
        "text": "So it would be interesting to know whether modern environments such as those of developed nations is more or less enriching than the lives humans lived in the past. First, I suppose we'd have to construct whatever environmental enrichment is. The other thing is we'd have to compare whose life we're talking about. Any thoughts? Any ideas on what literature to search for? [Environmental enrichment - Wikipedia](https://en.wikipedia.org/wiki/Environmental_enrichment)",
        "created_utc": 1668466524,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't get paleo migration to all corners of world",
        "author": "Deepfriedtire",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yv924k/i_dont_get_paleo_migration_to_all_corners_of_world/",
        "text": "I don't understand how Paleolithic humans would migrate to every nook and cranny of the world (save Antarctica), to escape drought and find new pastures.  If that was the case, why did some humans settle permanently in arctic tundra?  It would have made sense to stay in more warm and fertile regions.\n\nIt also isn't obvious to me why humans would island hop in the South Pacific.  \n\nDid pre-agriculture humans just have a drive to explore everywhere?",
        "created_utc": 1668452456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the reason that wolves have a better reputation generally for the Indigenous people of North America because of the lack of livestock?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yv2arh/is_the_reason_that_wolves_have_a_better/",
        "text": "Culturally wolves seem to have much better PR in North America then in Europe. With much less reported attacks then in Europe.\n\nWas this because Indigenous people didn’t engage in large scale livestock rearing that attracted wolves. Leading to less Human/animal conflict?\n\nNot to fall into the trope of the “noble savage”",
        "created_utc": 1668438859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books on the history of Hinduism?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yuzjw2/any_good_books_on_the_history_of_hinduism/",
        "text": "On the history of the Vedic religion, Sanskrit, spread of Brahmanism, caste system, Hindu philosophy, tribal religions, etc\n\nIs there any history book on Hinduism that talks about all of these things?",
        "created_utc": 1668432852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Classical vs Contemporary Theories, What's the Difference?",
        "author": "itenoir",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yuz6wx/classical_vs_contemporary_theories_whats_the/",
        "text": "Most university would divide theory classes into two: classical and contemporary. But, is there any characteristic that must be met in order for a theory to be called classical or contemporary other than time period? Also, is the dichotomy only applies in school curriculum because the more I look into it the more I feel like that this is a curriculum problem, rather than \"theoretical\" problem so to speak",
        "created_utc": 1668432018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are anthropologists really at odds with the interest of indigenous peoples? Or are both mutually compatible?",
        "author": "melonmelon_onthewall",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yundh9/are_anthropologists_really_at_odds_with_the/",
        "text": "I have read the works of David Graeber, Anne Salmond and Nicholas Thomas (all white anthropologists) and all are extraordinary at their professions. I have also read criticisms of anthropologists from indigenous people: Tina Ngata and Linda Tuhiwai-Smith. I find these criticisms rather reductive, as they essentialize all anthropologists as extractive, paternalistic and implicitly racists in the centering of their perspective. It seems to me that knowledge creation in anthropology has become more variegated and has recently shifted to more collaborative, reciprocal, dialectical and dialogical forms of knowledge of creation. Franz Boas. Also, ‘indigenous knowledge’ and ‘anthropological/ethnographic’ knowledge IMO are inter-subjective, plural and non-comprehensive - there is no singular, monolithic construct of those knowledges. No knowledge is ‘complete’ or ‘bound’ to closed systems. \n\nDisclaimer: I am a trained musician, not an anthropologist.",
        "created_utc": 1668395841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who were the AASI?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yun9gt/who_were_the_aasi/",
        "text": "Ancient Ancestral South Indians. Basically, the early hunter gatherers of South Asia.\n\nWhat is their origin? How were they distinct from Negritos, Australoids, and Andamanese Islanders? \n\nDid the AASI vary from place to place in South asia?",
        "created_utc": 1668395516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you tell me what life was like for the earliest humans?",
        "author": "Real_Moon-Moon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yuczpi/can_you_tell_me_what_life_was_like_for_the/",
        "text": "So, I’m writing a history story and I am trying to get it accurate. Can anyone help me with a timeline of events? \nWhen and where did humans originate from?\nWhat was life like for them?\nWhat were the challenges they faced?\n\nI would like as much information as I can on the earliest humans.",
        "created_utc": 1668371065,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the Origin of A Culture in a Given City?",
        "author": "Illusionist100",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yuamvl/what_is_the_origin_of_a_culture_in_a_given_city/",
        "text": "Hello everyone,\n\nI studied some Anthropology. I noticed that most Anthropology I run into involves studying an specific community. Usually a \"subaltern\"type of community. However, I wonder how does a culture develops.\n\nFor instance, say that a given City starts getting funding for video game production. Then a lot of major studios start moving towards that city. The city brings the talent from other areas of the country. At a certain point the City becomes associated with Video Games. There's a relationship between industry, jobs and local people. \n\nI wonder if anyone has studying this topic in more depth? I'm sure but I don't have access to the sources.",
        "created_utc": 1668366134,
        "upvote_ratio": 1.0
    },
    {
        "title": "How egalitarian were hunter gatherer and tribal societies?",
        "author": "alreqdytayken",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yu3v3r/how_egalitarian_were_hunter_gatherer_and_tribal/",
        "text": "I spoke to an anarcho primitivist and she told me that humans are hardwired to be egalitarian and it's natural for us to be altruistic and equal because she said all tribes and societies were equal and egalitarian. And said something about progress and stuff and that high level complex communities and societies are unnatural and against our nature.\n\nSo were all human societies back then before let's say agricultural societies arose egalitarian? And how egalitarian were they?",
        "created_utc": 1668351196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why our conception of risk is cultural, not factual (according to Mary Douglas)",
        "author": "Avesta__",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytzw0q/why_our_conception_of_risk_is_cultural_not/",
        "text": "Making oneself humble before offering an academic presentation is apparently a primordial habit: It's akin to a hunter asking forgiveness of nature before making a kill. So, before asking my questions, I am going to make myself humble: I am a social scientist with a burning passion for the beauty of cultural anthropology. As such, I can only engage with the discipline in an amateur capacity, and I can only ask amateurish questions. Forgive me for this. \n\nHere it goes. \n\nThinking about risk and risk-taking at a societal level, I came across the work of Mary Douglas and her brilliant if contested contribution to this domain. In Purity and Danger (1966), Risk and Blame (1992), and Risk and Culture (1982), she has laid out the foundations of what has come to be known as the \"Cultural Theory of risk\", or simply Cultural Theory. \n\nDrawing from her wide observations in the field, Douglas asserted that what a community considers impure, or risky, has a lot to do with the desire to uphold the social structure. If Nuer women are not allowed to touch cattle when they are menstruating, thinking this would harm the cattle, it has nothing to do with an objective \"factual\" belief about harming the cattle. It's simply part of a strategy for upholding gender roles.  \n\nDouglas observed countless similar modes of behaviour in our modern life, shattering the illusion that we, as moderns, have somehow grown out of the irrationality of the \"primitives\". Our conceptions of risk and impurity, she asserted, are remarkably similar to the pre-industrial tribal patterns. For we also want \"cultural survival\" above all else, prioritising our perception of risk on the basis of what cultural group or structure we are loyal to. \n\nDouglas develops a systematic approach to the subject, proposing that every community and every society is an assemblage of different cultures/subcultures that can be divided along certain dimensions. Two dimensions in particular: social integration (going from individualism to collectivism), and formal institutionalisation (going from egalitarianism to strict hierarchy). \n\nShe put one dimension on the horizontal axis and the other on the vertical, thus producing four different regions, each a different combination of said dimensions. These four regions would constitute major \"cultures\", each with its own self-reinforcing structure and therefore its own perception of risk and purity. \n\nIn today's world, this \"grid-group\" analysis could help us pin climate change deniers, for instance, against those with an absolutely apocalyptic view of climate change, understanding them, at least partly, in terms of their cultural loyalties——or their loyalties to a certain way of structuring society. It is no accident that climate change deniers mostly come from a libertarian/conservative political background while radical, apocalyptic climate activists are usually of a far Left ideological persuasion. \n\nDouglas suggested that scientific facts don't really matter that much for people; only their cultural loyalties. I don't completely agree with her on this, but I think there is still some merit in her contribution. \n\nMy first question is general: Would the kind anthropologists in this group let me know if Mary Douglas' work is still relevant? I know there have been a lot of developments in the discipline since Douglas, the linguistic turn and the post-colonial turn, for instance. But, if I make reference to Mary Douglas and her Cultural Theory in a social scientific project, and if an anthropologist happens upon said project, would he or she scuff and disregard the work? \n\nMy second question is a bit more specific, for those who are possibly already familiar with Cultural Theory: In the grid-group analysis, could we say the group axis corresponds to \"Gemeinschaft\" and the grid axis to \"Gesellschaft\"?  \n\nThank you in advance, and I apologise for the long post.",
        "created_utc": 1668341451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any difference between saying something was made out of Mud(like Mudbrick house) vs terracotta?. Also comparisons with other similar building and shaping materials and their distribution like wattle and doub &amp; variations within the two like mudbricks with fibres and oil would be appreciated",
        "author": "Pecuthegreat",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytz8pf/is_there_any_difference_between_saying_something/",
        "text": "Always saw the later as a way of saying the exact same thing but without the deguratory implications of \"Mudbrick Hut\". I remember getting into an argument sometime ago with someone I disagreed so let me ask the experts what it is.",
        "created_utc": 1668339606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we have examples of voluntary exposure to pathogen to train the immune system ?",
        "author": "unterrien",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytz3d3/do_we_have_examples_of_voluntary_exposure_to/",
        "text": "Title ! (Vaccination being a sub-techniques from this bigger question)\nThank you in advance :)",
        "created_utc": 1668339156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did early humans domesticate wolves into smaller, domestic dogs?",
        "author": "AutomaticDoubt5080",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytrf94/why_did_early_humans_domesticate_wolves_into/",
        "text": "\nA domestic wolf would be able to do so much more than a dog. What were the advantages of selectively breeding them into smaller, more inferior dogs?",
        "created_utc": 1668312671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any literature about ethics in anthropology",
        "author": "Crazy_Berry_4908",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytptlf/any_literature_about_ethics_in_anthropology/",
        "text": "Hi! I’m an anthropology student and ethics in the field has really caught my attention. Are there any books/articles/websites that touch on the subject? Anything that overlaps with design anthropology is of particular interest. Thank you!!",
        "created_utc": 1668307640,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Ancient Greece, Rome, and Japan, young men or boys often took older men as lovers as part of a \"manhood\" ritual. Is there any record of such practices happening with women in any societies?",
        "author": "NovaInvicta",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytozzh/in_ancient_greece_rome_and_japan_young_men_or/",
        "text": "",
        "created_utc": 1668305155,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Does Social Group \"Fission\" Occur?",
        "author": "halabula066",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytofp6/how_does_social_group_fission_occur/",
        "text": "So, to clarify my question more, I am interested in how a given social group \"reproduces\", so to speak. Say, you have a single social group; be they mobile or sedentary, how do they then split into multiple different groups?\n\nReading about the history of various cultures, the broad strokes often gloss over periods of expansion/movement in large historical terms (X group spread over Y area, over Z centuries/millennia). But I am never able to figure out how the individual groups split off from one another.\n\nI've been previously pointed to [this paper](https://www.academia.edu/3535031/Anthony_1990_Migration_in_archaeology_the_baby_and_the_bathwater) on migration, which is definitely helpful. But are there any more (recent) works in a similar vein? Specifically, the application to historic migrations. I want to really wrap my head around such migratory processes.\n\nMoreover, I'm interested in work regarding the social nature of societal fissions. Stuff like the previously linked paper consider migration patterns, and their expression in individual humans. But is there any work specifically into the way a social identity forms, warps, and differentiates, as such migrations occur?\n\nThat is, how do people from, say, a settlement develop a new identity as they migrate, settle, and grow into a separate settlement further away? How does, eg. a city (state) form, and differentiate itself (in identity, culture, politics, etc) from the city (state) that was the source of migration?\n\nMy language does imply a sedentary focus, but I'm just as interested in these ideas for non-sedentary peoples through history. The more specific a focus, the better, but anything you think would be relevant to my questions would be appreciated.\n\nI hope my question is clear enough. If I need to clarify anything, please mention it.\n\nThanks!",
        "created_utc": 1668303438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did all cultures have an Old and a New Stone Age before transitioning to other materials? Or did some cultures just have one Stone Age?",
        "author": "sea_of_joy__",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytlnoc/did_all_cultures_have_an_old_and_a_new_stone_age/",
        "text": "Did all cultures have an Old and a New Stone Age before transitioning to other materials? Or did some cultures just have one Stone Age? \n\n* Also, why don’t we have an anthropogenic era called the concrete age, since that seemed to have allowed amazing civilizations to flourish like the Romans and others?\n* Are there still Stone Age civilizations? If so, have the people there still optimizes for that type of diet and environment?\n* why don’t we have an era commemorating when humans started consuming eggs and dairy products, which was about 50,000 years ago? That was a big jump forward.",
        "created_utc": 1668295589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I learn about gift economies and command economies?",
        "author": "Cs-MoP",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytkrgb/where_can_i_learn_about_gift_economies_and/",
        "text": "I was referred to this subreddit from r/askeconomics. I was wondering where I could learn about some in depth theory on different kinds of economies",
        "created_utc": 1668293266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient apocalypse on Netflix",
        "author": "toph6767",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytkntx/ancient_apocalypse_on_netflix/",
        "text": "Hey everyone, just want to preface by saying I am no means an expert in the field of anthropology and am looking for some better formulated opinions about this show. How accurate are some of the claims in this show? Is it handpicking evidence or is it really possible there was “advanced civilizations during the ice age? Thanks in advance.",
        "created_utc": 1668293007,
        "upvote_ratio": 1.0
    },
    {
        "title": "How reliable is Helen Fisher's work, specifically her claims in the media?",
        "author": "informationtiger",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ytbhv9/how_reliable_is_helen_fishers_work_specifically/",
        "text": "A lot of what Helen Fisher says in the video linked below, reeks of pop-science/pseudoscience/self-help.\n\nJordan Peterson, Dr. Oz, The Secret, Freud type stuff, that might pass as actual \"science\" to the layperson, but when examined critically, lacks gold standard scientific rigour &amp; peer-review.\n\nI'm wondering what serious Anthropologists and/or other people in academia think about her work and the comments she makes when communicating to the public.\n\nAs far as I know, Myers–Briggs type tests and Rorschach tests are considered bullshit or unreliable in academia although still popular and seen as reliable by the general public. Furthermore she makes a lot of unsubstantiated claims (i.e. I can't find any research papers other than her own self-help books when googling), that should raise some eyebrows in academia, regardless of her PhD credentials. \n\nThe video in question: [Biological Anthropologist Answers Love Questions From Twitter](https://youtu.be/6DYgImG1CKo)",
        "created_utc": 1668270096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello!! I'm not well versed when it comes to anthropology and would like to learn more! If you know any good books/essays regarding pop anthropology please let me know. :)",
        "author": "tangerineee_",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yt8awi/hello_im_not_well_versed_when_it_comes_to/",
        "text": "",
        "created_utc": 1668262721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello!! I'm not well versed when it comes to anthropology and would like to learn more! If you know good books/essays regarding pop anthropology please let me know. :)",
        "author": "tangerineee_",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yt88ob/hello_im_not_well_versed_when_it_comes_to/",
        "text": "",
        "created_utc": 1668262569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did early Indo Aryan tribes speak different languages?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yt4c9o/did_early_indo_aryan_tribes_speak_different/",
        "text": "Or did they only speak Sanskrit?\n\nIf not, was Sanskrit the only language that was recorded? Why?\n\nIs Sanskrit just a standardized form of different Indo aryan dialects?",
        "created_utc": 1668252130,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of myth is the story of Prophet Muhammad?",
        "author": "Human_struggle2121",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ysgium/what_kind_of_myth_is_the_story_of_prophet_muhammad/",
        "text": "I’m thinking hero myth but I need some insight! I’m writing a paper on the celebration Mawlid al-Nabi",
        "created_utc": 1668186613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homo Ludens in anthropology?",
        "author": "itenoir",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ysg40i/homo_ludens_in_anthropology/",
        "text": "Hello. I was wondering if there's any anthropological perspective on the concept of homo ludens? If so, what should I read to get the basic of it? If not, does reading about the anthropology of play is enough? \n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1668185768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Manslaughter in Mesopotamian society",
        "author": "TomtheBombadilly",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ys5ogy/manslaughter_in_mesopotamian_society/",
        "text": "What was the cost of accidental murder in Mesopotamian societies? Did they have a concept of wergeld (man-price?), was the accidental murderer executed? Did they find themselves subject to a blood feud?",
        "created_utc": 1668158216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do egalitarian forager societies understand the concept of rape? Do people accept advances from whomever since no power dynamics or strict sexual mores exist?",
        "author": "AGcuriousity1998",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ys1hat/do_egalitarian_forager_societies_understand_the/",
        "text": "In agricultural societies, rape was often outlawed because the woman was the property of her husband, and rape was seen as \"damaging\" the husband's property. There were of course other reasons too.\n\nIn a society where the concept of private property is nonexistent, where virginity is not prized, and where people do not prioritize the purity of the family bloodline, how much of an issue is a random person making advances on another person? Would the person at the receiving end try to prevent or escape the act, or would the act be perceived as a daily chore or someone merely not respecting personal space (to the extent that personal space as a concept existed)?",
        "created_utc": 1668142189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it generally accepted that the next phase of cults will be seen online?",
        "author": "CoffeeDrinkingMacaw",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yrhnkj/is_it_generally_accepted_that_the_next_phase_of/",
        "text": "Is this the trend of modern times, do you think? It’s clear that the internet allows people to transform in ways irrelevant to how a person behaves with people that surround them in real life. Is there any case study or documentary available for an internet cult yet?\nIf y’all are looking for something to do, i imagine the active Andrew Tate discord would be a great place to look into. They have their own vernacular, they influence culture strongly, yet the live among us without most of us knowing. \nI’m imagining a documentary studying what goes on in the discord calls and chats, while also flying out to meet various participants, asking what goes on in their lives, what their relationships are like, and over all finding out what general similarities can be found among most members.",
        "created_utc": 1668092643,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Does Celebrity Occur?",
        "author": "sayhay",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yr3gux/how_does_celebrity_occur/",
        "text": "Is fame or infamy of an individual a product of civilization? Do we see celebrity in hunter gatherer groups? Would we have celebrity in an egalitarian society, or does it require hierarchy?",
        "created_utc": 1668049059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something like the paradox of plenty for unique cultures",
        "author": "incoherentshrieking",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yr15vn/something_like_the_paradox_of_plenty_for_unique/",
        "text": "Something I've just been thinking about and wanted to hear some thoughts. It seems in modern-day the countries and peoples with the richest history and most unique cultures turn out to always be the worst military dictatorships. Anything that's not a white bread sandwich on earth seems to become totalitarian. Eg. Russia, Italy, Hungary, Korea, China, Iran, Iraq (most of the middle east to be fair), the Congo, and about a million more.\n\nI wonder if there's something like the paradox of plenty (countries with abundant natural resources are worse off economically for it) for anthropology? Has anyone written about this before? I'd love to read it. Is there some kind of correlation between interesting history (even though that's pretty subjective) and singularity in government? \n\nJust wondering :)",
        "created_utc": 1668042328,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is there any website or a special way to find an anthropologically relevant low-tier job?",
        "author": "Anakarinarote",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqy404/is_there_any_website_or_a_special_way_to_find_an/",
        "text": "Hi everybody! I am an anthropologist  (linguistic ) student and lover from Venezuela, still working on my final thesis to graduate after a disgustingly long time. A general disappointment with anthropology as a discipline, caused partly by how it was taught in my university and partly by the economic collapse in my country, led me to stray away from social sciency stuff and \"forced\" me to switch to miserable social media marketing jobs to survive. \n\nI quit those jobs and, the past two years have been a struggle financially -for everyone I know-, but little by little I have been reconnecting with my old passion and getting more and more involved in activism in my country. I am finally making consistent progress on my undergrad thesis, and have been able to do some research inside de NGO I lead with my SO.  \n\nSo... is there hope for a 30-year-old, that wants to be involved in any capacity with research and/or making the world a marginally better place and win just a little bit of money to not starve and help build my CV? I know my lack of credentials and experience are not helping, but maybe some of you have some knowledge or experience that may help me.   \n\nSorry for the long post.",
        "created_utc": 1668034206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using the Term \"Advanced\" in an Anthropological and Archeological Context",
        "author": "LeoAsteria",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqsubg/using_the_term_advanced_in_an_anthropological_and/",
        "text": "Hello,\n\nI had a question regarding using the term \"advanced\" when referring to a civilization or culture and if this is an ok practice to do as an Anthropologist. I am studying Anthropology, but I am still learning, and this question came about due to this [Reddit post](https://www.reddit.com/r/worldbuilding/comments/yqdbes/online_encyclopedia_image_of_the_continent_of/) on the r/worldbuilding Reddit.\n\nI was curious to see what others' opinions were on using the term \"advanced\" to describe a civilization and what other vocabulary people would suggest. Also, if anyone has any research or papers about language/communication in the field of Anthropology, I would love to hear about them!\n\nBest,\n\nLeo x",
        "created_utc": 1668021995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello!",
        "author": "ialwayshaveaques",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqs6az/hello/",
        "text": "hi! I have been searching high and low for a Socio-Cultural focused Online Masters in Anthropology program and I can't find anything. It seems like Online Anthro is just not a thing? I've considered looking into Sociology as it seems similar. I prefer and am looking for a more a people focused ethnographic field of study (Anthro) but my end goal would look like teaching at the collegiate level, program management or another people focused teaching or facilitating role. In addition to writing, research and other personal/freelance type things. I plan to also get certification or degree in Human Sexuality/Women &amp; Gender Studies. My end goal is to work/research the areas in which the topics cross over. Its seeming like Sociology is my only option but any direction would be helpful! \n\nLogistics: \n\n\\- Masters in Socio Cultural Anthropology (or general, just not another focus such as archeology) \n\n\\- 100% Online or local to Dallas, TX\n\n\\- I currently have a Bachelors in Education",
        "created_utc": 1668020587,
        "upvote_ratio": 1.0
    },
    {
        "title": "MA proposal",
        "author": "Salma001",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqs2wa/ma_proposal/",
        "text": "MA student here and I study cultural studies with a special concentration on area studies of MENA region. I have to start thinking about my proposal and I have no idea where to start. I'm pretty much interested in everything and Cultural studies being highly interdisciplinary doesn't make that easier. I'm also not the best well read person so I don't have a lot of literature underhand. However, I'm open to suggestions and would love to learn what's trending in today's world in cultural studies and the social Sciences in whole.\n\nFeel free to share your thoughts.",
        "created_utc": 1668020404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were tubers traditionally cultivated in Southern African?",
        "author": "Fantastic_Traffic973",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqpnl3/were_tubers_traditionally_cultivated_in_southern/",
        "text": "I've seen how central and west African cultures have tubers(yam,cassava)as their staple food I was wondering if there are any Southern African cultures that cultivated these cause a lot of people in the region aren't familiar with these",
        "created_utc": 1668015297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use AI to find patterns in myths ? (Joining structuralism of Lévi-Strauss)",
        "author": "unterrien",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqk1oq/use_ai_to_find_patterns_in_myths_joining/",
        "text": "Hello ! I was wondering if any cross-disciplinary study has been done with the help of AI and Natural language processing ? The AI woud read for example thounsands of American myths (like Lévi-strauss did) and maybe find a pattern in them ? Like unsupervised learning on ethnographic text.\nAnd maybe do another one with tons of monography and maybe find patterns like Philippe Descola did with the continuities and discountinuities between humans and non-humans ?\n\nThank you :)\nI have a BSc in CompSci if anyone interested :D",
        "created_utc": 1668003008,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Should Science Look Like",
        "author": "gkavuk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqjfhz/what_should_science_look_like/",
        "text": "I discovered an inspiring content curation on Wiser App that explores the stereotype problems in STEM (science, technology, engineering, and math) for scientists in minority status, namely women and LBTQ+.\n\nCheck out the curation:\n\n[**https://open.wisermedia.com/aV6rrESGmqafmm1M9?utm\\_source=DistributionChannels&amp;utm\\_medium=reddit&amp;utm\\_campaign=Askanthropology**](https://open.wisermedia.com/aV6rrESGmqafmm1M9)\n\n**Do you know any other sources that can add to this curation?**",
        "created_utc": 1668001513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Human and chimpanzee interactions in the wild",
        "author": "The-Dmguy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqhp79/human_and_chimpanzee_interactions_in_the_wild/",
        "text": "We know both chimps and gorillas sometimes meet each others in the wild due to overlapping ranges. Some of these interactions are friendly (like the 2 chimp and gorilla infants playing with each others) while others could be violent if not lethal (chimps attacking gorilla troops and killing the infants). How did chimps and humans interact with each others pre urbanisation times ? Was there conflict between them ?",
        "created_utc": 1667997148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Humans and chimpanzees interactions in the wild",
        "author": "The-Dmguy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqhog7/humans_and_chimpanzees_interactions_in_the_wild/",
        "text": "We know both chimps and gorillas sometimes meet each others in the wild due to overlapping ranges. Some of these interactions are friendly (like the 2 chimp and gorilla infants playing with each others) while others could be violent if not lethal (chimps attacking gorilla troops and killing the infants). How did chimps and humans interact with each others pre urbanisation times ? Was there conflict between them ?",
        "created_utc": 1667997094,
        "upvote_ratio": 1.0
    },
    {
        "title": "When we're under stress (in an argument, say) why do we blame people (others or ourselves) rather than the outside force of stress? It seems it would be counterintuitive for such inherently social beings to act in such a way that would cause friction rather than create community.",
        "author": "persnickety_pirate",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqhld1/when_were_under_stress_in_an_argument_say_why_do/",
        "text": "I kind of go into my own hypothesis on this... So please poke holes and redirect/address my initial thought, as you wish, and are able. I'd prefer to maintain course with the research, so don't want to stray down my own beaten path.\n\nI think about a disagreement or offensive act between friends, family, strangers, acquaintances.   \nFeeling internal stress from the poor or lack of communication. Rather than recognizing that the stress would be alleviated with good communication (which I tend to believe we're not learning to communicate well, another topic for another day), we blame either ourselves for having committed a wrongdoing or causing friction, or we blame the other. This is obviously not true for everyone, but it's common enough that between two people, there is likely to be one person who places the blame on the person rather than the communication, creating friction in that relationship. \n\nMy guess is that we evolved this behavior to protect our \"clan.\" Learning to build walls against difference was an immediate assurance of protection against threat of invasion or manipulation. \n\nFrom what I remember reading, in hunter-gatherer and similar, small, societies such as these, it's not  uncommon to act to be supportive of shortcomings, ignore (shame) bragging, mask one's own successes, all in an effort to maintain a level playing field.\n\nThe opposite seems true in more urban areas, where members tend to look out for themselves and their personal success over community success and sustainability that seems to go along with a level playing field.",
        "created_utc": 1667996876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any studies on why there are so many \"be yourself\" messages in modern western fiction ?",
        "author": "Roundaboutan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yqew55/are_there_any_studies_on_why_there_are_so_many_be/",
        "text": "",
        "created_utc": 1667989737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some anthropologists say that in primitive societies there was no barter within the society itself, only with strangers. How accurate is it?",
        "author": "ImaginaryDrawingsTwt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yq8zkc/some_anthropologists_say_that_in_primitive/",
        "text": "I'm basing myself on this work:\n\n [Toward an Anthropological Theory of Value - Wikipedia](https://en.wikipedia.org/wiki/Toward_an_Anthropological_Theory_of_Value) \n\nThey say that there was no market economy in stateless societies, and this is one of the arguments. It seems that stateless primitive societies operated in a gift economy, with barter so limited that couldn't be said that there was a market economy there.\n\nIt sparked me how reliable is this claim and if with the supposed repeated barter with strangers they would still be complete strangers to these societies.",
        "created_utc": 1667969610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Matthew Restall and Amara Solari argue that there is no evidence of extensive slavery in the Maya world before colonization. Is this true?",
        "author": "BookLover54321",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yq2jpi/matthew_restall_and_amara_solari_argue_that_there/",
        "text": "In their book The Maya: A Very Short Introduction, Matthew Restall and Amara Solari say the following:\n\n“Either way, there is no evidence of a slave trade or of extensive slavery in the Maya world before Spaniards arrived in the sixteenth century and introduced into the area a trade in enslaved Africans, Mayas, and other indigenous peoples.“\n\nThey are both highly respected scholars and specialists in early Mesoamerica, but they don’t elaborate on this or provide a citation. Is this accurate?",
        "created_utc": 1667951273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be correct to assume that the subtlety and strength of consciousness that animals possess would have been proportionate to their capacity for communication, throughout evolutionary time?",
        "author": "Puzzle_headed_Issue",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ypwhap/would_it_be_correct_to_assume_that_the_subtlety/",
        "text": "",
        "created_utc": 1667936865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toxic foods in human cultures: did we not know or not care?",
        "author": "Feisty_Material7583",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ypwbas/toxic_foods_in_human_cultures_did_we_not_know_or/",
        "text": "The Romans used rue extensively and it is still popular in Ethiopia, despite it being thought worth a call to poison control here (lead ore as a spice was also probably a bad move). And the Nuu-Chah-Nulth of the North American pacific coast (Koreans too, to a lesser extent) ate/eat carcinogenic bracken rhizome as a staple, and have high incidences of gut cancer that may be related to this. Even fenugreek has got some bad toxicity press despite being a fave in India.\n\nTraditional diets are widely though of as healthy, varied, and natural, especially those of Indigenous groups.\nIt seems unlikely for some cases but is it possible that nutrition science is extrapolating from incomplete knowledge and that these foods aren't really harmful when prepared the traditional way (like cassava or olives)? \n\nOtherwise what were humans doing guzzling rue, lead, &amp; cancer fern?  Could we not figure it out through trial and error, like we did with most of the plant kingdom? Or did we know but just not care about the slow toxic buildup, because these were abundant sources of calories and flavour? Could these foods have even been antiparasitic?",
        "created_utc": 1667936470,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the reasoning behind religious/cultural diets?",
        "author": "demigodishheadcanons",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ypu36o/what_was_the_reasoning_behind_religiouscultural/",
        "text": "Specifically, vegetarianism in places such as South India as a cultural thing or the concepts of Kosher and Halal eating. I’m not quite sure how that would’ve made sense survival-wise, or if these diets had sprung up as an after effect of complex civilization.",
        "created_utc": 1667931398,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Mild Rant] Professor not Replying My Emails",
        "author": "Merimias",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ypi8e1/mild_rant_professor_not_replying_my_emails/",
        "text": "Hi all. Just wanted to vent a little bit because I’m getting nervous with deadlines coming it. So earlier this year I emailed a professor I took a couple of courses with if they would write reference letters for both law school and grad programs for me. They said yes to both and to email her again after Sep 7th. \n\nI did just that. We went back and forth for a bit and they’ve written and submitted my law school letters. However they’ve been really hard to contact for my grad school applications as they’re currently lecturing overseas. This would normally be fine, except her last email to me on the subject was that I should contact professors that know the subject (linguistic anthropology) better, with no clarification on if she needs anything more to write my recommendation letters.\n\nSo I’m getting a little antsy and nervous, and I hope she replies my follow email soon but it’s been two weeks. Should I send another? A little lost on how to proceed here.",
        "created_utc": 1667903820,
        "upvote_ratio": 1.0
    },
    {
        "title": "The emergence of female-dominated markets in Western Africa",
        "author": "TomtheBombadilly",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ypfmx0/the_emergence_of_femaledominated_markets_in/",
        "text": "I’ve read that market women had higher social standing in regions like Nigeria and other West African nations. How?",
        "created_utc": 1667896204,
        "upvote_ratio": 1.0
    },
    {
        "title": "The reason for the emergence of uxorilocal/matrilocal marriage systems",
        "author": "TomtheBombadilly",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ypf9eu/the_reason_for_the_emergence_of/",
        "text": "Been reading Chet Lancaster’s paper “The Zambezi Goba in the Twentieth Century: New Male-Dominant Institutions and the Declining Status of Rural Women” and I’m wondering how such systems where married couples relocate to live with/near the wife’s family emerged. What caused the appearance of such a system among certain groups around the world, with its attendant use of brideservice (think of the biblical Jacob working 14 years for Rachel and Leah) as a kind of dowry?",
        "created_utc": 1667895143,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Self praise song\" from Cameroon",
        "author": "salute07",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yp88j6/self_praise_song_from_cameroon/",
        "text": "Hey everyone. I was exploring folkways ethnic recordings earlier today, and on the album \"Bulu Songs from the Cameroons\" there was a song entitled \"Self Praise Song\".  Do the Bulu have a culture of self praise? Or is this just a one off thing? It'd be interesting to learn more about. Thanks.",
        "created_utc": 1667873479,
        "upvote_ratio": 1.0
    },
    {
        "title": "What groups of peoples still live as their ancient ancestors did in a “traditional” way? (Such as the Maasai tribe, modern-day nomadic pastoralists) How many such groups exist?",
        "author": "JacksonMcGlothlin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yp0zww/what_groups_of_peoples_still_live_as_their/",
        "text": "Note: I am posting these here after r/AskHistorians redirected me here.\n\n\nGreetings, friends. If there are too many questions here I apologize, I would be very appreciative of an answer to any one of them!\n\nOther related questions:\n\nHow do the way these peoples live reflect when and where they came from?\n\nHow do those that have contact with outsiders and are uncontacted(the Sentinelese) differ?\n\nHow do modern peoples that still live the same as their ancestors differ from those that forewent their old ways?\n\nWhat led to many indigenous groups stopping their traditional living?",
        "created_utc": 1667856426,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Earn Money in Online without any invest, just download these apps, no refferal codes",
        "author": "Beautiful-Relief1004",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yoppal/how_to_earn_money_in_online_without_any_invest/",
        "text": "[removed]",
        "created_utc": 1667833656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Sentinelese forgot the ability to make fire or did they never develop it? Are they the only uncontacted people to not know how to make fire?",
        "author": "Experimentalphone",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yoobpl/did_the_sentinelese_forgot_the_ability_to_make/",
        "text": "I have read that the Sentinelese people do not know how to make fire. \n\n* Did they never developed the ability to make fire? Or did they lose the ability somehow? \n\n* Since they cannot control fire and cannot cook food, are their cognitive and other bio-psychological capabilities lower than other humans? Are they less biologically evolved compared to modern humans? \n\n* Are they the only uncontacted people in the contemporary era who cannot use fire?",
        "created_utc": 1667830798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why weren't Dravidian languages replaced?",
        "author": "sanchi185",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yokn6o/why_werent_dravidian_languages_replaced/",
        "text": "Since Brahmanism and Sanskrit came to South India, why didn't these replace the Dravidian languages? \n\nThe same thing happened to North India, and now the population speaks Indo Aryan languages. Why didn't this affect South India?",
        "created_utc": 1667822309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help defining important places for a fictional setting with high correspondence to the real world?",
        "author": "ArtMnd",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yod5wl/help_defining_important_places_for_a_fictional/",
        "text": " Hey,  Reddit! I'm writing a fictional setting for some RPG campaigns as well  as writing for possible future books, and one element of that setting is  as follows:\n\n^(Cursed  Lands - Places in which a large amount of human negative emotion is  gathered, creating a funnel of spiritual energy from large parts of a  region, country or even the Earth, for similar energies. Oftentimes,  suicide hotspots where too many people kill themselves in the same place  will gather feelings of work or education related stress, or alienation  from a whole nation or even group of nations in one area. This entire  area will be ridden with evil specters, and the surrounding areas will  be a hotspot for haunted terrains (haunted houses, hospitals and other  buildings and areas and even interdimensional rifts (hell rifts and the  like. Examples are the Aokigahara Forest in Japan, the Auschwitz death  camp in Germany and the Golden Gate Bridge in the United States.)\n\nSo,  this doesn't actually need to be suicide hotspots or anything. Could  even be infamous historical places like Auschwitz, and other important  areas filled with negativity for one reason or another. Any reason,  provided there's a lot of negativity surrounding that place.\n\n^(Cursed  Lands are very important in this setting as they can make entire cities  (or, in the case of the Golden Gate bridge in California, an entire  circle around it swallowing a couple counties and parts of counties  across a chunk of the 1st district of California places where adventures  can get especially hot, which unusually high concentrations of  paranormal activity and all the stuff that makes the story happen in  this world. I'd really appreciate suggestions of all kinds of cursed  lands. It's an Urban Fantasy setting with a Masquerade, so from the  perspective of people without supernatural powers and who aren't in the  government or very influential families or corporations/organizations,  the world's history looks almost the same as that from IRL.)\n\nSo  it leads to my question: is this even an Anthropology related  question, this specific writer's research? Should I be asking in Social Science or History instead?\n\nAnd also, what kinds of places would you all suggest for my fictional setting's Cursed Lands and why?",
        "created_utc": 1667796972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite Biological Anthropology Related reddit communities?",
        "author": "leonardsebastianbach",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yo7vg9/favorite_biological_anthropology_related_reddit/",
        "text": "",
        "created_utc": 1667781565,
        "upvote_ratio": 1.0
    },
    {
        "title": "do anthropologists think about the objects, and texts, they find being made just for the fun of it",
        "author": "synstheyote",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yo611g/do_anthropologists_think_about_the_objects_and/",
        "text": "I read recently that human are likely a pedomorphic species, meaning we keep the traits usually only reserved for childhood into adulthood. I read this in a book my Patricia McConnell, and She has a PhD in zoology so it seems to be a legitimate statement. The book was published in 2003; the term pedomorphism doesn't seem to be used much any more, but the definition she uses is very similar to neoteny.\n\nShe claims that this effects our physiology and behavior. The research seems to support this claim:\nhttps://www.pnas.org/doi/10.1073/pnas.0900544106#:~:text=In%20human%20evolution%2C%20developmental%20retardation,of%20human%2Dspecific%20cognitive%20traits.\n\nNeoteny helped us in our survival because we are more willing to embrace change in environment and may have contributed to our creativity and playfulness (behavior that is only seen in youth in most species, including primates).\nAnyways, learning about this made me think about all the things we make and write whose purpose is intrinsically tied to our playfulness as a species:\n\n1) We create elaborate games with even more elaborate objects for those games. Certainly balls can be identified as maybe being involved in group sport, but what about something like a BOP-IP. It's purpose as purely a toy seems like it would be hard to find out if you had no cultural context to compare it to.\n\n2) We creat objects specifically for the fun of making them. Someone buried a bag of cheetos in cement with gold leaf print to play a trick on those who discover it in the future; there could be many more things that were buried purely/partly important for the joy of soneone finding it in the future. \n\n3) We are also very personal with what we like and want to make. It seems to me that mysterious items like the Bagdad battery could have easily been made because someone a long time ago 1) enjoyed the process of putting the objects they had laying around together 2) enjoyed the final product and left it that way\n\n4) Our language is influenced, even in text, with Word play or currently obvious jest. We don't always say what we mean because we like to have fun with our language. Language is a messy thing to begin with; how could you deduce someone being facetious, humorous, or playful with what they say. This would certainly change its meaning. We joke by subverting our expectations, exaggerating, etcetera.\n\nIt seems like it would be impossible to reseson such behavior by examining something unless you specifically lived in the the head of who made it, let alone the culture at the time it was made. I'm really curious on your thoughts in this.",
        "created_utc": 1667776620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grand narratives / explanations of everything",
        "author": "Phr0nemos",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/yo4pfr/grand_narratives_explanations_of_everything/",
        "text": "Im looking for recommendations for overarching grand narrative type of theories. \n\nLike breakdown of the bicameral mind by Jaynes or  ***The Origins and History of Consciousness*** by Neumann.\n\nOf course it isnt too difficult to find fault with such theories in detail, but I do find them stimulating and engaging. \n\nAnyone have any recommendations of the same type?",
        "created_utc": 1667773186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which anthropological scholars should I read if I am interested in drug production, trafficking, and usage?",
        "author": "IamHere-4U",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ynwwbx/which_anthropological_scholars_should_i_read_if_i/",
        "text": "I am keeping the title broad because, although I am interested in medical anthropological research on drug use itself, I am also interested in drug production, trafficking, and markets more broadly.\n\nI am familiar with the work of Philippe Bourgois and have read Righteous Dopefiend and In Search of Respect. I also know of The Pastoral Clinic by Angela Garcia, but I haven't read it yet. \n\nOther than these three texts and authors, what other works or anthropologists should I be familiar with who do research that is related to drugs? \n\n&amp;#x200B;\n\n* *Just for clarification, I am more interested in \"hard\" drugs that are criminalized, stigmatized, and are often associated with adverse health effects, such as addiction or HIV transmission*",
        "created_utc": 1667756499,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of your Favorite Ethnographies and Monographs and why?",
        "author": "IamHere-4U",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ynwpv0/what_are_some_of_your_favorite_ethnographies_and/",
        "text": "What are some of your favorite ethnographic monographs? What ethnographies changed the way that you thought about anthropology, and left a lasting impact on you? What are some of the most thought provoking, well-written, or interesting ethnographies overall? What do you think makes these particular ethnographies special?\n\nFor me, my top 5 favorite ethnographies are:\n\n* *Faith in the Time of AIDS: Religion, Biopolitics and Modernity in South Africa* (2015) by Marian Burchardt\n* *Vita: Life in a Zone of Social Abandonment* (2005) by João Biehl\n* *Life Beside Itself: Imagining Care in the Canadian Arctic* (2014) by Lisa Stevenson\n* *In Search of Respect: Selling Crack in El Barrio* (1995) by Philippe Bourgois\n* *Righteous Dopefiend* (2009) by Philippe Bourgois",
        "created_utc": 1667756083,
        "upvote_ratio": 1.0
    },
    {
        "title": "In his Literature Nobel Prize acceptance speech, Isaac Bashevis Singer said that the yiddish language had no words to express concepts such as 'weapons', 'ammunition', 'muster drill', 'tactics of conducting combat operations'. Is this an accurate statement?",
        "author": "appleflash",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/ynsus0/in_his_literature_nobel_prize_acceptance_speech/",
        "text": "",
        "created_utc": 1667748193,
        "upvote_ratio": 1.0
    }
]