[
    {
        "title": "How did smelting of metals start?",
        "author": "BitPlayerVesti",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5soof2/how_did_smelting_of_metals_start/",
        "text": "",
        "created_utc": 1486506794,
        "upvote_ratio": ""
    },
    {
        "title": "Obsidian Artififacts?",
        "author": "Txrokrt51",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sm9ft/obsidian_artififacts/",
        "text": "I found these in my backyard and went to The Geology sub, did some tests they recommend and it came back as obsidian. One user mentioned that one of the pieces could have been used due to marks and fracturing. Any information or help on this? Also I live in Lincoln,Nebraska.\n\n[1](http://imgur.com/1kMWSxY)\n[ex 2](http://imgur.com/3kRIEWv)\n",
        "created_utc": 1486484084,
        "upvote_ratio": ""
    },
    {
        "title": "What is the current most accepted theory for why humans transitioned from hunter gatherers to farmers?",
        "author": "Gwood81",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sl7rk/what_is_the_current_most_accepted_theory_for_why/",
        "text": "In retrospect it is easy to recognise the benefits of transitioning to a permanent resident agricultural way of life but from what I've read the transition from a hunter gatherer lifestyle to a settled agricultural one was hard; less time, more labour intensive, greater risk from disease etc so what caused early human cultures to move towards an agricultural\nModel? What was the initial incentive? I know it's not clean cut but is there a general consensus reason?",
        "created_utc": 1486471935,
        "upvote_ratio": ""
    },
    {
        "title": "What are the purposes of customs, norms, mores, and other folkways?",
        "author": "AlexKingstonsGigolo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sj1ba/what_are_the_purposes_of_customs_norms_mores_and/",
        "text": "Is it just to establish certain things like acceptable forms of behavior or to reinforce those behaviors as well?",
        "created_utc": 1486437906,
        "upvote_ratio": ""
    },
    {
        "title": "What is the current academic consensus about Antonio Arnaiz-Villena's workshop?",
        "author": "D-Sebastian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5shtg4/what_is_the_current_academic_consensus_about/",
        "text": "I'm specially interested on the current tought on his theory of the sub-saharan origins of the ancient greeks. Have his theories been corroborated or debunked by recent research?\n",
        "created_utc": 1486424056,
        "upvote_ratio": ""
    },
    {
        "title": "Lévi-Strauss comment",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sh8ua/lévistrauss_comment/",
        "text": "[deleted]",
        "created_utc": 1486418299,
        "upvote_ratio": ""
    },
    {
        "title": "Now that we don't all huddle up next to the fire at night, has there been a shift to more isolated, less social behaviors with family?",
        "author": "palmni01",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sgk6s/now_that_we_dont_all_huddle_up_next_to_the_fire/",
        "text": "I don't know if this is too broad of a question or if I should ask a different sub, but I just thought of this while reading about Gottfried Semper's ideas on how the hearth was the origin of society. ",
        "created_utc": 1486411649,
        "upvote_ratio": ""
    },
    {
        "title": "Which race of men has the most masculine physical characteristics?",
        "author": "classwin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sdpvq/which_race_of_men_has_the_most_masculine_physical/",
        "text": "Anthropologywise.",
        "created_utc": 1486380410,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some non-Asian men develop yellow fever?",
        "author": "61280",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5scu8w/why_do_some_nonasian_men_develop_yellow_fever/",
        "text": "[removed]",
        "created_utc": 1486364768,
        "upvote_ratio": ""
    },
    {
        "title": "Why are some non-Asian men develop yellow fever?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sbw29/why_are_some_nonasian_men_develop_yellow_fever/",
        "text": "[deleted]",
        "created_utc": 1486352241,
        "upvote_ratio": ""
    },
    {
        "title": "Is this true about women preferring masculine features for cause they are healthier?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sbbs9/is_this_true_about_women_preferring_masculine/",
        "text": "[deleted]",
        "created_utc": 1486345120,
        "upvote_ratio": ""
    },
    {
        "title": "[xpost r/Askhistorians] Are there any theories as to why patriarchy is (seemingly) so common a feature in cultures across history?",
        "author": "WhereofWeCannotSpeak",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5sakz2/xpost_raskhistorians_are_there_any_theories_as_to/",
        "text": "or, a Question I Would Not Ask the Wider Reddit Community\n\n\nEven with the different ways that genders and gender roles are constructed in various cultures, it certainly seems like many/most have some form of patriarchy. Is this a false impression? Is it, near as we can tell, just a coincidence?",
        "created_utc": 1486335995,
        "upvote_ratio": ""
    },
    {
        "title": "How do I do dental oxygen isotope analysis, step by step?",
        "author": "rimeroyal",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5s4nqn/how_do_i_do_dental_oxygen_isotope_analysis_step/",
        "text": "For you bioarchaeologists out there-- suppose I've got a bag of human teeth and want to find out where their owners have been. Assuming I have access to a university, what steps should I take?\n\nContext: I'm a medievalist postgrad who's seen what isotope analysis can do to track human migration, and I've even spent a summer drilling teeth once, but I'd like to know how to pitch a research project to my department and sound like I know what I'm talking about. If someone were to lend me their bag of medieval teeth.",
        "created_utc": 1486256139,
        "upvote_ratio": ""
    },
    {
        "title": "Is America the only country where it is normal to see a young couple (early 20's) get married before one of them is deployed in the military?",
        "author": "CatLadyAtHeart",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5s2bz5/is_america_the_only_country_where_it_is_normal_to/",
        "text": "I found out a girl I knew in college who is currently 22 or 23 years old just got married to her boyfriend, who is about to be deployed overseas with one of the branches of the U.S. Military. While I consider 22 or 23 a young age to get married, as do many women of my and following generations, I didn't think twice about this marriage because I knew the situation. I grew up learning about this kind of situation in school. Is this something unique to the U.S? Do any other cultures now or historically have a similar practice?",
        "created_utc": 1486235016,
        "upvote_ratio": ""
    },
    {
        "title": "I would like to better understand the phenomenon of conspicuous wealth in our society",
        "author": "Dorindon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5s28j4/i_would_like_to_better_understand_the_phenomenon/",
        "text": "I would be grateful if someone could suggest books or articles on conspicuous wealth, as defined (for the purpose of this question) as spending of money on luxury goods  to publicly display wealth.     \n\nIn our society, conspicuous wealth usually means expensive luxury brands.\n \nI am not an anthropologist but very much enjoy reading the perspective of anthropologists on a variety of topics, especially those pertaining to modern society.  \n\nI have had the opportunity to meet a few very wealthy families and observed that many wealthy people tend to be low key, and prefer not to put their wealth on display. I conclude that there is no automatic association between wealth and conspicuous wealth.    \n\nI also observe that the drive for conspicuous wealth and fads must be very strong: years ago, fur was out of fashion after the anti fur industry showed the deplorable conditions of animals in captivity in the fur industry.  \n\nBuying fur is now in fashion. The impetus to display wealth appears to override any reservations these people harbour about wearing fur. Please note that this is not an anti fur rant. I am referring to some kind of cognitive dissonance.\n\nThank you very much in advance for your time and help\n",
        "created_utc": 1486233961,
        "upvote_ratio": ""
    },
    {
        "title": "Has the human brain really been shrinking for the last 200,000 years?",
        "author": "LeftlnTheDark",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5s0h9j/has_the_human_brain_really_been_shrinking_for_the/",
        "text": "I came across this passage in a book about evolution that I've been reading.\n\n\n\"Chrstopher Ruff (1997), of Johns Hopkins University, and his colleagues thoroughly analysed the fossil record to determine the evolving body mass and brain size of the various Homo species leading up to us. The results show that the assumption of a straight progression from a pea-brained ancestor to the ultrabrinay modern Homo sapiens is decidedly shaky. Hominid brains appear to have rmeained fairly constnat in size for a long period from some 1.8 million years ago until about 600,000 years ago. But then, from 600,000 to 150,000 years ago, fossils show that the cranial capcity of our ancestors skyrocketed. Brain mass peaked at about 1,440 grams. Since then brain mass has declined to the 1,300 grams that is typical today.\"\nI believe it is in reference to this study - https://www.researchgate.net/publication/14074734_Body_mass_and_encephalization_in_Pleistocene_Homo\n\n\nCould you share your thoughts on it? Thanks.\n",
        "created_utc": 1486214015,
        "upvote_ratio": ""
    },
    {
        "title": "How does the practice of one night stands work in the contemporary Western world?",
        "author": "informationanonymous",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5s02g5/how_does_the_practice_of_one_night_stands_work_in/",
        "text": "South Asian here. I am looking for a resource (preferably free) that discusses in a comprehensive manner the practice of one night stands in the contemporary Western world. The resource can be a book, article or documentary but it has to be scientifically accurate. The resource must include the dynamics of a one night stand, that is how one night stands work. How it begins, with whom, how and where the act is carried out, what happens to the parties after and so on. \n\nAny suggestions?",
        "created_utc": 1486207546,
        "upvote_ratio": ""
    },
    {
        "title": "What can we learn from other cultures about sex, sex practices and sexual identity?",
        "author": "neoliberaldaschund",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rz846/what_can_we_learn_from_other_cultures_about_sex/",
        "text": "I'm afraid I don't know enough about gender theory to properly ask my questions. I understand that homosexuality is an unprivileged category, and sex is a still a taboo topic, which makes talking and learning about it to begin with so difficult! I would appreciate patience and working with me.\n\nI took anthropology courses as an undergrad, and it got me to see that there wasn't one way to be. There are hundreds of arrangements of families and sexualities. I remember reading about the Muxe of Mexico who are men, sleep with straight men, but those straight men are not considered gay, and the Muxe do not consider it a choice to be Muxe. This is different from what I understand the way homosexuality works in the US is. Some people think that it's a choice, others think that you're born gay. \n\nThe United States has an individualist culture and I don't mean that in a pejorative way. Here in the US we like to see of ourselves as the makers of our own destiny, and under neoliberal times we are to make ourselves who we want to be. But I know that choosing your sexuality isn't the only way to have a sexuality, and in addition, you can also have a sexuality based not on what you \"are\", but what you do. In Ancient Greece you could have sex with both men and women but there would not be a name for you, that was normal and healthy but it was abnormal and unhealthy if you desired too much sex.\n\nSo what can we learn from other cultures about sex? And is it necessary to have sexual practices be linked to sexual identities? And how else can sex and choice be configured so that one does not choose an identity like an outfit?",
        "created_utc": 1486189879,
        "upvote_ratio": ""
    },
    {
        "title": "How did ancient people learn to process potentially deadly foodstuffs to make them edible- like plants that you have to boil multiple times or ferment to get poison out of them? x-xpost askreddit and askhistorians",
        "author": "buterbetterbater",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ryfnk/how_did_ancient_people_learn_to_process/",
        "text": "Discovered an native plant in the yard that apparently was used for thousands of years as a starch source but requires a great deal of processing before it won't kill you. How did ancient peoples not give up after the first couple of goes that killed someone to come up with the solutions to make deadly foods edible through complex processing? Like polk salad which has to be boiled several times or this plant, the coontie, which has to be leeched and fermented to remove cyanide",
        "created_utc": 1486177765,
        "upvote_ratio": ""
    },
    {
        "title": "What are some alternative strategies of control/administration (ones that don't involve warfare, violence, or oppression) over conquered peoples that were used by ancient civilizations?",
        "author": "PrincessIsababble",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rw7k5/what_are_some_alternative_strategies_of/",
        "text": "For example, the ancient Inkas practiced 'idol capture', which is a strategy in which they kidnapped the physical idols (statues of the representative gods) of a conquered region and brought it back with them to the capital of Cuzco. This unorthodox strategy of integration and appropriation, rather than oppression, allowed them to command a large and diverse population for generations. Are there examples from other ancient civilizations in the world of such alternative strategies to imposing hegemonic power?  ",
        "created_utc": 1486152364,
        "upvote_ratio": ""
    },
    {
        "title": "Why is literacy less prevalent among nomadic cultures?",
        "author": "RingGiver",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rval8/why_is_literacy_less_prevalent_among_nomadic/",
        "text": "",
        "created_utc": 1486143378,
        "upvote_ratio": ""
    },
    {
        "title": "Writing, knowledge, and culture",
        "author": "jonathanrdt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ruihh/writing_knowledge_and_culture/",
        "text": "I am interested in understanding the origin of writing and its impact on culture.\n\nAssumedly, early peoples developed speech that led to oral traditions and knowledge passed through stories and litanies. I believe it is assumed that some stories may trace their origins to preliterate cultures due to common themes.\n\nThen writing began and with it an accumulation of knowledge with greater endurance.\n\nIt is curious to me that much early writing, specifically cuneiform records, are transactions rather than culture. But at times there came to be historic texts that became holy, proscribing behaviors, the nature of gods and men, the nature of the universe and its origin, in essence defining culture itself.\n\nWhile we cannot know for certain, it seems to me that preliterate cultures must have been more free to change and that the origin of writing may actually have stunted cultural advancement at the same time it caused the explosion of knowledge.\n\nWhat are the current theories regarding the impact of writing on the creation of doctrine and its impact on the fluidity of culture? Did writing allow us to accumulate knowledge and slow the change of human behavior? What are the greatest facilitators of cultural change in the last several hundred years that allow peoples to change their behaviors in spite of sacred texts and tradition? Have systems of law become the new tools of codifying behavior and of allowing that gradual change?",
        "created_utc": 1486135654,
        "upvote_ratio": ""
    },
    {
        "title": "Why anatomically modern people did not develop anything significant in the first 100.000 years of our existence?",
        "author": "anadampapadam",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rudgs/why_anatomically_modern_people_did_not_develop/",
        "text": "Homo sapiens sapiens exist for 200.000 years. Agriculture exists the last 10.000 years. Before that there are significant cultural evidence (for example cave paintings) but there is nothing from the first 100.000 years of our existence. Why?",
        "created_utc": 1486134137,
        "upvote_ratio": ""
    },
    {
        "title": "Why are South Indian people identified by an initial rather than their full first name?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rqwvn/why_are_south_indian_people_identified_by_an/",
        "text": "",
        "created_utc": 1486084272,
        "upvote_ratio": ""
    },
    {
        "title": "Paleolithic European mass hunting",
        "author": "Epigravettian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rqfq4/paleolithic_european_mass_hunting/",
        "text": "I have read that both the neanderthal mammoth jump site at jersey and the horse jump site at solutre were false, are there any sites in Europe where animals where driven off cliffs?",
        "created_utc": 1486079231,
        "upvote_ratio": ""
    },
    {
        "title": "Standup comedy as social commentary; Reading suggestions or thoughts?",
        "author": "Jacxk101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ro507/standup_comedy_as_social_commentary_reading/",
        "text": "I'm in the midst of preliminary research for an undergraduate research project. I'm interested in (vaguely) standup comedy as social commentary, specifically how comedy challenges and solidifies social roles, rules, and expectations. \n\nI'll be using Los Angeles as my research location, with potential consideration made to differences in self identified racial groups.\n\nHumor is a pretty ubiquitous subject in many fields, but they often lack the focus on cultural and social theory. \n\nAny suggestions on readings? Books, journals, TED talks, personal academic experience, and online sources are all great.",
        "created_utc": 1486056629,
        "upvote_ratio": ""
    },
    {
        "title": "What is a reproductive bottleneck (based on Y chromosome sequencing) ? How is it possible that between 8,000 and 4,000 years ago, the effective breeding population of women was 17 times that of men.",
        "author": "Dorindon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rmahr/what_is_a_reproductive_bottleneck_based_on_y/",
        "text": "I read this in a serious anthropology article, but am not myself an anthropologist.\nBy breeding population, I assume one means between the age of 12 and 50?\nI assume that Y chromosome sampling is a way to determine if a bone fragment (or other type of fragment) comes from a male.\nthanks very much in advance for your time and help.",
        "created_utc": 1486035953,
        "upvote_ratio": ""
    },
    {
        "title": "Can I move into human genetics research from an anthropology background?",
        "author": "numbersloth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rl8bz/can_i_move_into_human_genetics_research_from_an/",
        "text": "Or is Anthropology increasingly being seen as less and less scientific?",
        "created_utc": 1486016746,
        "upvote_ratio": ""
    },
    {
        "title": "Is organized crime (mafias) also as entrenched in the economy and politics of other East Asian countries as in Japan?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rl5c1/is_organized_crime_mafias_also_as_entrenched_in/",
        "text": "Do the 4 Asian Tigers have anything like what Japan does?\n\nAs side questions, what other countries have such profiles (could Russia and Italy be counted in) and how can Japan have both low levels of corruption (according to [this page](http://www.business-anti-corruption.com/country-profiles/japan)), and yet have its politicians directly involved with criminals?\n\nGenuine curiosity.",
        "created_utc": 1486015473,
        "upvote_ratio": ""
    },
    {
        "title": "How visible is intersexuality in the archaeological record?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rjwaq/how_visible_is_intersexuality_in_the/",
        "text": "[deleted]",
        "created_utc": 1485999821,
        "upvote_ratio": ""
    },
    {
        "title": "Any good monographs on native North Americans?",
        "author": "borkibork",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rhhkb/any_good_monographs_on_native_north_americans/",
        "text": "Hey anthroheads, I'm looking for classic or \"canon\" monographs or ethnographies of native North Americans. My field area is mediterranean Europe and I'm trying to broaden my ethnographic horizons a bit! \nEdit: I'm familiar with the classic anthropologists like Boas etc. I'm really looking for contemporary \"authoritative\" studies.",
        "created_utc": 1485976331,
        "upvote_ratio": ""
    },
    {
        "title": "Has Gobekli Tepe changed the consensus view that humans were hunter gatherers 10k years BP?",
        "author": "Botschild",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rh19u/has_gobekli_tepe_changed_the_consensus_view_that/",
        "text": "The research I encounter has not really explained how this site was built by Hunter gatherers, while other research saying otherwise seems to come from non-academic sources.",
        "created_utc": 1485972154,
        "upvote_ratio": ""
    },
    {
        "title": "Books on hunter gatherer religions?",
        "author": "ladsandgentleman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rfj30/books_on_hunter_gatherer_religions/",
        "text": "I feel like I've often been told the model for all native religions is animism. I feel like that must be innaccurate so I'd like to ask here about religion among hunter gatherers and non complex societies. Are there any good books discussing religions among these peoples? Are these cultures actually diverse religiously or do they all basically fall into animism? ",
        "created_utc": 1485956688,
        "upvote_ratio": ""
    },
    {
        "title": "Do races exist?",
        "author": "Kazjak",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rf32a/do_races_exist/",
        "text": "I have been made aware that many anthropologists today consider race to be an obsolote concept which had its roots only in ideology and politics rather than in science.\n\nHow true is this however? To deny the existence of race, do you not also need to deny the existence of ethnicity? I am very little knowledgeable on this, but as far as I had understood it ethnicity is determined by the extent of similarity in the genetic structure in human individuals, while race is determined by the extent of similarity in the genetic structures in those ethnicities.\n\nHave I misunderstood everything?",
        "created_utc": 1485950661,
        "upvote_ratio": ""
    },
    {
        "title": "Is there evidence of sensory deprivation use in ancient history and today?",
        "author": "LeftlnTheDark",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rdcl4/is_there_evidence_of_sensory_deprivation_use_in/",
        "text": "",
        "created_utc": 1485921935,
        "upvote_ratio": ""
    },
    {
        "title": "How did pre-fire humans manage to survive without the ability to cook their meat?",
        "author": "Over_The_Flows",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rd2sr/how_did_prefire_humans_manage_to_survive_without/",
        "text": "Salmonella, botulism, E. Coli, tapeworms, general illnesses brought on by eating undercooked meats; were these an issue for early humans? Or are they a problem brought on by the (cosmically) recent trend of, ya know, widespread sanitation and general sterilisation of our environments making us more susceptible to things that Grugg The Palaeolithic Gentleman would have simply shrugged off, or failed to even notice, rather than a potentially fatal infection? ",
        "created_utc": 1485918709,
        "upvote_ratio": ""
    },
    {
        "title": "Did alcoholism develop as an evolutionary response to dirty water?",
        "author": "moralprolapse",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5rbus1/did_alcoholism_develop_as_an_evolutionary/",
        "text": "",
        "created_utc": 1485905271,
        "upvote_ratio": ""
    },
    {
        "title": "Why is \"West\" so much more common of a surname than the other compass directions?",
        "author": "SextonMcCormick",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5racc9/why_is_west_so_much_more_common_of_a_surname_than/",
        "text": "My shot in the dark is families being defined by their westward movement across America?",
        "created_utc": 1485890698,
        "upvote_ratio": ""
    },
    {
        "title": "Modern day Peru, Bolivia and the relationship between indigenous people and catholic church, state and international academia?",
        "author": "weird_piano",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5r7aaa/modern_day_peru_bolivia_and_the_relationship/",
        "text": "I recently browsed through a paper by an anthropologist who attempted to interview Quechua-speaking people in Peru. She at first was able to make contact and talk to them but once they learned she was doing research, they suddenly shut down, denied knowing their own language and insisted speaking Spanish only. \n\nThis all seems peculiar to me. As a layman I'd like to know more about the possible reasons behind this kind of behaviour. I believe one of the reasons in this case was thought to be poverty and better employment possibilities for the ethnically Spanish-speaking population. I'm aware that the situation is possibly very different in other areas with different economical dynamics. \n\nAny information about this subject is appreciated. ",
        "created_utc": 1485856393,
        "upvote_ratio": ""
    },
    {
        "title": "Is Jared Diamond's book \"The World Until Yesterday\" accurate? Any good alternatives?",
        "author": "ladsandgentleman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5r6l2x/is_jared_diamonds_book_the_world_until_yesterday/",
        "text": "I asked a similar question yesterday. I feel like this question narrows it down and helps with giving a good answer. I basically want a book which describes what life was like before the emergence of governments. ",
        "created_utc": 1485843933,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we use matrilineal terminology to describe language?",
        "author": "vanwold",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5r5tzt/why_do_we_use_matrilineal_terminology_to_describe/",
        "text": "I am preparing a lecture for class next week on language and realized that we refer to language evolution in matrilineal terms (daughter and granddaughter language) and i never thought of it before, but tonight found it fascinating that, living in a patriarchal society and culture, where we utilize patrilineal kinship, and terminology (forefathers, founding father, grandfather of...etc), we describe languages in matrilineal terminology.  Any thoughts on to why this is?",
        "created_utc": 1485834126,
        "upvote_ratio": ""
    },
    {
        "title": "Origins of aboriginals?",
        "author": "JungleSlang1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5r455i/origins_of_aboriginals/",
        "text": "Important: I'm aware these images (Aboriginal skull vs Caucasian skull) have been spread through the internet by white supremacists over the years. This post in no way supports any kind of racist beliefs. On the contrary, I'd like to know more about one of the most unique peoples on Earth.\n\nhttp://m.imgur.com/0aBbU9n\n\nBefore I get started, I'm in no way an anthropologist, so I'm sorry if it is a stupid question. I saw a post about aboriginals on the front page, so I decided to do some reading. I've studied anthropology on my own before (as a hobby), so I understand some of the basics when it comes to how homo sapiens spread across the world. I came across research that shows that aboriginals and papuans might have mated with an unknown human species before moving to Australia 50,000 YA. Could that species be homo erectus? Even though the Aboriginal skull does fit within what's considered normal for a homo sapiens skull, I did notice some similarities between it and a homo erectus skull (brow ridges, lower wide point of skull,etc). Could erectus have lived more recently than believed? It seems that erectus went as far east as India (where aboriginals first migrated to), but died out 70,000 YA. If they did mate, wouldn't it be possible for some aboriginals to possess erectus features just as Europeans sometime possess neanderthal characteristics (such as brow ridge)? ",
        "created_utc": 1485816072,
        "upvote_ratio": ""
    },
    {
        "title": "Does the hypothesis that fair folk legends originate from clashes between agricultural and pre-agricultural societies hold any water?",
        "author": "giraffe4peace",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5r37a9/does_the_hypothesis_that_fair_folk_legends/",
        "text": "",
        "created_utc": 1485807035,
        "upvote_ratio": ""
    },
    {
        "title": "Does having stereo-typically neanderthal-like features mean you have DNA dictating those features?",
        "author": "JarJar-PhantomMenace",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qzf19/does_having_stereotypically_neanderthallike/",
        "text": "I realize this may sound like a stupid question, but I have noticed people before that seem to look neanderthal-like. I don't mean this in an insulting way. Could some of us have neanderthal genes that effect our appearance?",
        "created_utc": 1485762422,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any good books about what life was like before the state or \"civilization\"?",
        "author": "ladsandgentleman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qzek4/are_there_any_good_books_about_what_life_was_like/",
        "text": "I'm mainly interested in the latter. I think that mainly refers to hunter gatherer societies, but it can also apply to early agricultural societies. I'm actually interested in this as relates to philosophical discussion. ",
        "created_utc": 1485762175,
        "upvote_ratio": ""
    },
    {
        "title": "How common is the idea of \"blessing\" or expressing thanks before a meal among cultures?",
        "author": "-mickomoo-",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qyo65/how_common_is_the_idea_of_blessing_or_expressing/",
        "text": "Topic. I'm only familiar with western countries and Abrahamic religions, but was this something done commonly in history outside religion?  ",
        "created_utc": 1485751129,
        "upvote_ratio": ""
    },
    {
        "title": "How did primates get their physical structure?",
        "author": "toothpick101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qygh6/how_did_primates_get_their_physical_structure/",
        "text": "What motivated a bunch of cells to get arms and legs? Specifically hands?",
        "created_utc": 1485748445,
        "upvote_ratio": ""
    },
    {
        "title": "What did ancient / prehistoric people find funny? [X-Post /r/AskHistorians]",
        "author": "saad85",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qyfgv/what_did_ancient_prehistoric_people_find_funny/",
        "text": "I know there's been some tablets and graffiti from the Roman times, but do we know what people tended to find funny before civilization?\n\nSimilarly, what about tribes like those in the amazon, etc before they were affected by civilization - is there any insight into their sense of humor?",
        "created_utc": 1485748104,
        "upvote_ratio": ""
    },
    {
        "title": "Is it fair to characterize the Taiping Rebellion as a Civil War?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qwuqk/is_it_fair_to_characterize_the_taiping_rebellion/",
        "text": "[removed]",
        "created_utc": 1485731117,
        "upvote_ratio": ""
    },
    {
        "title": "What are some different cultural responses to sneezing? Does every culture have a \"bless you,\" of some type?",
        "author": "theodore_boozevelt",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qvnx5/what_are_some_different_cultural_responses_to/",
        "text": "",
        "created_utc": 1485719225,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Internship/Field School (bioarch/physanth/archaeogenetics)",
        "author": "GingerpithicusFrisii",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qvbyt/looking_for_internshipfield_school/",
        "text": "Long story short: I'm hoping to go to grad school for archaeogenetics (ETA fall '18) and I need an internship or a field school for my degree requirements. I'm looking for something in the bioarchaeology/archaeogenetics area to gain some practical experience. Any suggestions?",
        "created_utc": 1485715730,
        "upvote_ratio": ""
    },
    {
        "title": "Personal Essay on Anthropology?",
        "author": "BeniaminoMalthus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qr2je/personal_essay_on_anthropology/",
        "text": "Recently I wrote a short essay using Harari's work Sapiens as well as a few academic journals I've read over the years to discuss Julian Jaynes' theory in the context of HBO's Westworld. I attempt to give some viewpoints from anthropology that I have gathered. \n\nNow, I am no anthropologist, nor claim to be. Being that I don't know personally anyone knowledgable enough about these subjects, I figured this might be the correct place to get a proper critique on the short synthesis? Even if you find that the insights are shallow, I would definitely appreciate knowing!\n\nhttps://laciadir.wordpress.com/2017/01/28/essay-westworld-part-3-2/",
        "created_utc": 1485651345,
        "upvote_ratio": ""
    },
    {
        "title": "Any recommendations for books (or documentaries if possible) on prehistoric mythology?",
        "author": "swampmonsters",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qqt1k/any_recommendations_for_books_or_documentaries_if/",
        "text": "I'm part way through Joseph Campbell's Primitive Mythology and while I think it's a great book and I have the utmost respect for him, I can't help wondering if there hasn't been an update or breakthrough in the last 48 years. \n\n I feel like I haven't heard much about the mythologies of anything in the last several years, is this field of study not as prevalent to anthropology and archeology as it once was?",
        "created_utc": 1485648141,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that intelligence/behavior varies genetically among different populations?",
        "author": "AtheistJeww",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qo7bh/is_it_possible_that_intelligencebehavior_varies/",
        "text": "I'm not racist nor a race realist, I know race is a social construct. My question concerns the possibility that different populations may differ in their genetic predisposition (I know intelligence/behavior are largely learned) to certain behaviors and levels of intelligence,  does this possibility exist? ",
        "created_utc": 1485618962,
        "upvote_ratio": ""
    },
    {
        "title": "Do most anthropologists believe that races are real?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qn62j/do_most_anthropologists_believe_that_races_are/",
        "text": "[deleted]",
        "created_utc": 1485602673,
        "upvote_ratio": ""
    },
    {
        "title": "Diversity of laughter in human cultures",
        "author": "emmazunz84",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qmsyt/diversity_of_laughter_in_human_cultures/",
        "text": "From my experience living in Vanuatu I am aware that there is at least one form of laughter quite different from what is normal in Western countries, viz. laughter in the form of a coordinated exclamation of cheers or other sounds by a whole company of people at once. In Vanuatu, I have heard a joke made, upon which one audience member would say 'ayyyeee' and all the company answer together 'hey!!!' before dissolving into giggles. Something like this kind of laughter can also be heard from the Aboriginal Australian actors in the film 'Ten Canoes'. My question is, has anybody studied the diversity of laughter among human cultures? How many kinds of laughter are there that are not prevalent in Western society? Is the 'South Pacific laughter' I have noticed a modern or ancient phenomenon? Thanks!",
        "created_utc": 1485594928,
        "upvote_ratio": ""
    },
    {
        "title": "I've read a few articles lately about apes being spotted using stone and wooden tools and building likes rock \"shrines\" in the wild. Does this mean they're evolving?",
        "author": "DwNhIllN00b",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qlfay/ive_read_a_few_articles_lately_about_apes_being/",
        "text": "Also, can humans have an impact on their evolution? Like maybe speed it up somehow by interacting with them and teaching them new things? That question goes for any other intelligent animal.\n\nEDIT: meant to say piled rock shrines",
        "created_utc": 1485571249,
        "upvote_ratio": ""
    },
    {
        "title": "Help save anthropology at one of the few London universities that still offer the course - Sign the petition!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qkmp2/help_save_anthropology_at_one_of_the_few_london/",
        "text": "[removed]",
        "created_utc": 1485561153,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we kiss? why with our lips? why not with another part of our body?",
        "author": "yeezymacheet",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qhymu/why_do_we_kiss_why_with_our_lips_why_not_with/",
        "text": "",
        "created_utc": 1485533677,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any societies that currently don't use a 7-day week? Who are the most recent adopters?",
        "author": "Why-Chromosome",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qeg2h/are_there_any_societies_that_currently_dont_use_a/",
        "text": "",
        "created_utc": 1485481964,
        "upvote_ratio": ""
    },
    {
        "title": "What is Anthropology, and what are key components one should absolutely know about?",
        "author": "So1a1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qcymv/what_is_anthropology_and_what_are_key_components/",
        "text": "",
        "created_utc": 1485466019,
        "upvote_ratio": ""
    },
    {
        "title": "What is Anthropology, and what are key components of the subject i should learn to know.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qcsdv/what_is_anthropology_and_what_are_key_components/",
        "text": "[deleted]",
        "created_utc": 1485464347,
        "upvote_ratio": ""
    },
    {
        "title": "Recommend a book about death and interment for ancient Judaism?",
        "author": "meekrobe",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qbz2h/recommend_a_book_about_death_and_interment_for/",
        "text": "Title says it all, other than the Hebrew Bible please.",
        "created_utc": 1485456444,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good introductory books on the paleolithic era?",
        "author": "peace-monger",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qb9f9/what_are_some_good_introductory_books_on_the/",
        "text": "I really enjoyed reading the [paleolithic Wikipedia article](https://en.wikipedia.org/wiki/Paleolithic) and I'm ready for something a little thicker. Do you have any recommendations? I'm fine with reading speculative theories. \n\nThanks for any suggestions!",
        "created_utc": 1485449631,
        "upvote_ratio": ""
    },
    {
        "title": "Chinese anthropology?",
        "author": "Menego",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qaiye/chinese_anthropology/",
        "text": "I'm interested in how anthropology developed in China and which areas/cultures it focuses/ed on. What are its perspectives? Is it different from \"western\" anthropology? What are some authors you would recommend?",
        "created_utc": 1485442116,
        "upvote_ratio": ""
    },
    {
        "title": "Has anybody documented a transition from hunter gathering to chiefdom?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qadr2/has_anybody_documented_a_transition_from_hunter/",
        "text": "",
        "created_utc": 1485440421,
        "upvote_ratio": ""
    },
    {
        "title": "Surplus in anthropology but outside of a Marxist context?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5qa9lw/surplus_in_anthropology_but_outside_of_a_marxist/",
        "text": "I'm interested in productive systems and surplus recycling. Everything seems to be very Marxist which incorporates a whole bunch of other stuff. Is or was there anyone writing with an eye to how surplus is put to use in anthropology? ",
        "created_utc": 1485439049,
        "upvote_ratio": ""
    },
    {
        "title": "I recently found out that humans were in Pennsylvania around 16000 years ago. What did they look like, if I could see someone from pa 16000 years ago, would they look remarkably different?",
        "author": "mynameisalso",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5q8g1g/i_recently_found_out_that_humans_were_in/",
        "text": "",
        "created_utc": 1485406861,
        "upvote_ratio": ""
    },
    {
        "title": "Ice age effect on humanity",
        "author": "wardaddy_",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5q7fjr/ice_age_effect_on_humanity/",
        "text": "I'm wondering how the last ice age effected human progress, mainly in geographical terms. I know it's thousands of years later but could that be the reason why the most advanced(organized) civilizations at the time were in more southern latitudes then they are today? Was egypt/sudan as hot 5000 years ago as they are now, because that would make the pyramids even more impressive.",
        "created_utc": 1485394393,
        "upvote_ratio": ""
    },
    {
        "title": "What skin color where the first inhabitants of the British isles?",
        "author": "Kutili",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5q6awv/what_skin_color_where_the_first_inhabitants_of/",
        "text": "I talked with a girl today, who told me that she read that the first Britons were actually black. I was wondering, was there any truth to this claim?",
        "created_utc": 1485382339,
        "upvote_ratio": ""
    },
    {
        "title": "Full moons for girls &amp; new moons for boys. | Age reckoning in Mongolia: how does it work and how it came to be?",
        "author": "Coologin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5q4ygv/full_moons_for_girls_new_moons_for_boys_age/",
        "text": "While researching something else I stumbled upon this sentence in wikipedia: \n\n&gt; In Eastern Mongolia, age is traditionally determined based on the number of full moons since conception for girls, and the number of new moons since birth for boys.\n\nAnd that's it. The footnote took me to an article about korea from where they took this one same sentence. \n\nI could not find anything googling age reckoning in Mongolia nor age reckoning and the moon and a couple other related search terms. \n\nI got extremely curious and interested in knowing more about this though. So **please enlighten me about this practice of using the moon and the different counting depending on gender**.\n\nThank you.",
        "created_utc": 1485369570,
        "upvote_ratio": ""
    },
    {
        "title": "What's a good graduate level kinship text?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5q3c2e/whats_a_good_graduate_level_kinship_text/",
        "text": "That gives an overview and comparison of kinship systems?",
        "created_utc": 1485353172,
        "upvote_ratio": ""
    },
    {
        "title": "Age of menarche among Native Americans",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pxdbe/age_of_menarche_among_native_americans/",
        "text": "Is there any data on the age that Native American girls in the 15-17 hundreds typically had their first period? Are there any accounts of Native American life that mention this? Could someone point me in the right direction to find this out?",
        "created_utc": 1485278437,
        "upvote_ratio": ""
    },
    {
        "title": "Has the shift into more and more non-verbal communication (i.e email) physically changed how our brain functions?",
        "author": "mikeyriot",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ptzt9/has_the_shift_into_more_and_more_nonverbal/",
        "text": "",
        "created_utc": 1485230118,
        "upvote_ratio": ""
    },
    {
        "title": "Who is Your Favorite Anthropologist and Why?",
        "author": "GingerpithicusFrisii",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5prbg9/who_is_your_favorite_anthropologist_and_why/",
        "text": "I've got an assignment coming up in my History of Anthro Theory class wherein I am to create a \"trading card\" for an anthropologist, but I don't want to be one of the 23 people who will be choosing Margaret Mead or Franz Boas- I want someone who is not as well-known and has a unique story or contribution. Any ideas? ",
        "created_utc": 1485202321,
        "upvote_ratio": ""
    },
    {
        "title": "How did bunches (unplaited ponytails) come to be associated with little girls?",
        "author": "AlexKingstonsGigolo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pmeb2/how_did_bunches_unplaited_ponytails_come_to_be/",
        "text": "This style is also known as \"twin tails\".",
        "created_utc": 1485147180,
        "upvote_ratio": ""
    },
    {
        "title": "Why did it take so long for humans to develop 3D drawings when they had 3D sculptures for, perhaps, millennia?",
        "author": "cntry82txn",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pmbw8/why_did_it_take_so_long_for_humans_to_develop_3d/",
        "text": "I just can't seem to wrap my head around this... while taking a tour of the Egyptian wing of my local museum the tour guide pointed out that while 3D sculptures were extant, the Egyptians still could only draw in 2D. WTF?",
        "created_utc": 1485146394,
        "upvote_ratio": ""
    },
    {
        "title": "Good Books on PIE Religion?",
        "author": "Khaidu",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5plfza/good_books_on_pie_religion/",
        "text": "I'm interested in an accessible book on speculative reconstructions of the Proto Indo European pantheon and belief system.  The Wikipedia article on the subject had me really hooked and wanting to do more reading.  Just seeing common elements in so many cultures and languages that are so diverse is really exciting.  Any recommendations would be much appreciated.  Also if you're someone who is knowledgeable about this subject matter in particular, what do you find most interesting about it?",
        "created_utc": 1485136636,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a list anywhere of small scale societies that maintain their traditional productive systems?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5plf53/is_there_a_list_anywhere_of_small_scale_societies/",
        "text": "",
        "created_utc": 1485136358,
        "upvote_ratio": ""
    },
    {
        "title": "Evidence that prehistoric women had their first baby between 14-19?",
        "author": "Justincouldbemyname",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pkvoi/evidence_that_prehistoric_women_had_their_first/",
        "text": "I heard a majority they had their first baby as a 14/15/16 and there were prehistoric girls who started their period between 7-12. ",
        "created_utc": 1485130633,
        "upvote_ratio": ""
    },
    {
        "title": "If a early human settlement was on a peninsula in the middle of a Lake with no trees, where do they run when the Lions come?",
        "author": "yourupinion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pkc2n/if_a_early_human_settlement_was_on_a_peninsula_in/",
        "text": "Here is an article that describes the site, upon further investigation this location is at the tip of a peninsula in the middle of a massive lake.\n\n(https://www.newscientist.com/article/dn18018-earliest-evidence-of-humans-thriving-on-the-savannah/).\n\nMy question is would it be likely that the inhabitants were escaping into the water to escape predators on land?\n\nIt seems logical that a peninsula would be the worst place to make a settlement if you were scared of the water!",
        "created_utc": 1485125336,
        "upvote_ratio": ""
    },
    {
        "title": "Is this stone phallus natural or man made?",
        "author": "smallstonephallus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pjozl/is_this_stone_phallus_natural_or_man_made/",
        "text": "http://i.imgur.com/9X5DKyx\n\n This is a small stone phallus my father found in our backyard in southern New Jersey.  Any information on what it could be beyond a curiously formed rock would be much appreciated.  Thank you! \nP.S.  First reddit post sorry for horrendous formatting.",
        "created_utc": 1485119537,
        "upvote_ratio": ""
    },
    {
        "title": "How are these percentages calculated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pitk9/how_are_these_percentages_calculated/",
        "text": "[deleted]",
        "created_utc": 1485111632,
        "upvote_ratio": ""
    },
    {
        "title": "Does conversational volume vary by culture? Like, do some cultures speak more loudly or quietly than others in ordinary conversation?",
        "author": "julia_sugarbaker_",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pidzq/does_conversational_volume_vary_by_culture_like/",
        "text": "Not sure if this is a question for anthropologists or linguists...",
        "created_utc": 1485107580,
        "upvote_ratio": ""
    },
    {
        "title": "Human Migration Sources?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pgg3f/human_migration_sources/",
        "text": "I was doing some research on human migration and and the who, when, where, etc of early cities, towns, or really just places humans gathered and lived together, do you have any reliable and informative sources on this topic? (Also, I'm new to this subreddit, and just reddit in general. I couldn't find anything saying I can't or shouldn't in the rules, but is ok for me to ask for sources like this? or is it considered rude or bad form?)",
        "created_utc": 1485083601,
        "upvote_ratio": ""
    },
    {
        "title": "Are there anthropologists who are questioning multiculturalism?",
        "author": "shocali",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pfj7m/are_there_anthropologists_who_are_questioning/",
        "text": "Because of cultural relativism being at the core of anthropology so is the assumption or fact that multiculturalism should work in most(every?) cultural contexts. Are there any anthro people here or in the academic world that are critical about this concepts? Are there people who use cultural relativism only in their studies but don't believe in it outside of their academic research? \n\n\nI'm asking because it seems that questioning cultural relativism or multiculturalism seems kind of taboo.",
        "created_utc": 1485064634,
        "upvote_ratio": ""
    },
    {
        "title": "Interested in Cultural Resource Management—real info please!",
        "author": "newchevy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5peh7v/interested_in_cultural_resource_managementreal/",
        "text": "Hi all,\n\nI am interested in a career in Cultural Resource Management (CRM).  I have done a lot of research but still have a few questions... I'm hoping someone might be able to answer some of these for me!\n\n1) Realistically, this field is competitive.  Is it actually a viable option, or is it like trying to be a rock star or something?\n\n2) What will I need, education-wise?  I'm interested in graduate programs in Anthropology, is this a good start?\n\n3)  When applying to schools, is this more like a career where the school that you go to matters a lot, or is it more just important to get a degree?  Like, is it one of those fields where the students from the top few schools are getting jobs, and students at the middle or bottom schools have no jobs and a ton of debt?\n\n4) I'm seeing a lot of M.A. options and a few M.S. options... which is better?\n\n5) Are there any resources for schools?  Rankings, etc?\n\n6) Anything else I should know about job prospects, the career, educational options, etc?\n\n7)  Some anthropology programs that I've been look at are telling me that they're placing most of their graduates into CRM jobs.  Is this probably true, or probably a stretch?\n\nPlease be harsh... I would rather know now if my dreams are completely unrealistic.\n\nThank you!!\n\nEDIT:  for question #8)  Online programs?  Good, bad, worthwhile, worthless?  thanks!",
        "created_utc": 1485050504,
        "upvote_ratio": ""
    },
    {
        "title": "Would Stone Age and earlier humans have a way to know what they looked like?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pdg8f/would_stone_age_and_earlier_humans_have_a_way_to/",
        "text": "I'm guessing that mirrors as specific tools came about after metalworking, but beyond possibly looking into moderately reflective water bodies like rivers or ponds which probably weren't super hi-res, did Stone Age individuals have any idea what that individual actually looked like? Would that have affected inter-personal relationships and self esteem and the like?",
        "created_utc": 1485038820,
        "upvote_ratio": ""
    },
    {
        "title": "What are the ethnically mixed race areas of the world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pc2pq/what_are_the_ethnically_mixed_race_areas_of_the/",
        "text": "[deleted]",
        "created_utc": 1485023865,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone take Mircea Eliade to be a serious authority anymore?",
        "author": "WolfDogLizardUrchin",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5pbj1l/does_anyone_take_mircea_eliade_to_be_a_serious/",
        "text": "I am under the vague &amp; poorly substantiated impression that Eliade was once considered a leading authority on the role of myth across people &amp; cultures, but that he has fallen from favor. Am I mistaken, on either half of this? Is there a good explanation somewhere of the hows and whys of his changing reputation over the years? Thanks!",
        "created_utc": 1485017839,
        "upvote_ratio": ""
    },
    {
        "title": "What is the origin of raising the right hand when taking an oath?",
        "author": "only1interest",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5p55ib/what_is_the_origin_of_raising_the_right_hand_when/",
        "text": "",
        "created_utc": 1484932489,
        "upvote_ratio": ""
    },
    {
        "title": "Were any base-10 number systems invented coincidentally similar to ours?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5p2fo3/were_any_base10_number_systems_invented/",
        "text": "[deleted]",
        "created_utc": 1484894743,
        "upvote_ratio": ""
    },
    {
        "title": "Will uncontacted tribes eventually 'evolve' to the level of first world countries technologies and amenities?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5p1bv5/will_uncontacted_tribes_eventually_evolve_to_the/",
        "text": "[deleted]",
        "created_utc": 1484880320,
        "upvote_ratio": ""
    },
    {
        "title": "How exactly do lip plates in Africa work?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ov88i/how_exactly_do_lip_plates_in_africa_work/",
        "text": "[deleted]",
        "created_utc": 1484810005,
        "upvote_ratio": ""
    },
    {
        "title": "When and why did people start nomading in the world's deserts?",
        "author": "jwizardc",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ouvw1/when_and_why_did_people_start_nomading_in_the/",
        "text": "It seems to me that everything about the desert screams 'get out'. Why would people settle/become nomads there?",
        "created_utc": 1484804785,
        "upvote_ratio": ""
    },
    {
        "title": "Humanitarian path",
        "author": "Misanthropicreader",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ou0gx/humanitarian_path/",
        "text": "I am studying for a BA applied anthropology (hold the criticism).  I was curious to hear from anthropologists in the humanitarian field...1) your path to humanitarian work, 2) your choice between a minor in conflict resolution, political science and international studies, and 3) how do I set myself up for federal work (certs, graduate degree choices).... Also any peace corps advice regarding qualification in competativity are very welcome",
        "created_utc": 1484793654,
        "upvote_ratio": ""
    },
    {
        "title": "How do anthropologists deal with the problem of being lied to?",
        "author": "Adorable_Octopus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5otz5q/how_do_anthropologists_deal_with_the_problem_of/",
        "text": "Yesterday there was a post on r/sex from a man who claimed to be Zoophile, and in one of the comments, someone linked to a Vice video about Colombians having sex with donkeys. \n\nI don't think it needs saying that Vice Magazine is probably not a very scholarly publication, but in the little bit of the video I watched, they sat down with Hani Miletski, a sexologist and therapist, who published a book about the topic over a decade ago. While I might be willing to outrightly dismiss Vice Magazine as being a less than reputable publication, she does exist and hold a PhD, although how well regarded is beyond my ability to say, and she seemed to be saying things that supported (in the sense that she had heard similar claims before to what the Vice Host was saying) the claims in the video.\n\nWhile sexologist isn't anthropology, I found myself reminded of *Coming of Age in Samoa* by Margaret Mead, which has a number of controversies over the representation of sexuality in the Samoan Islands (and other things, I believe). \n\nWhich brings me to my question: it seems to me that, depending on how the question was asked, the people interviewed might well just be making stuff up/lying/etc, especially given the subject matter; how do anthropologists working in the field insure the observations and interviews they're taking are not just jokes (or otherwise deliberately wrong information) played on them by those people?\n\n\n\n\n^^I ^^don't ^^think ^^the ^^actual ^^video ^^is ^^all ^^that ^^relevant, ^^I ^^just ^^thought ^^it ^^was ^^important ^^to ^^provide ^^context, ^^particularly ^^for ^^the ^^sorts ^^of ^^questions ^^that ^^an ^^anthropological ^^study ^^might ^^be ^^interested ^^in.\n\n\n\n",
        "created_utc": 1484793229,
        "upvote_ratio": ""
    },
    {
        "title": "When did humans learn to swim?",
        "author": "BoredOfYou_",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ot3f6/when_did_humans_learn_to_swim/",
        "text": "",
        "created_utc": 1484783330,
        "upvote_ratio": ""
    },
    {
        "title": "Are anthropologists still coming up with theories like functionalism, evolutionism etc or they've given up on it ?",
        "author": "JohnnyBeGoodTonight",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5ooh2m/are_anthropologists_still_coming_up_with_theories/",
        "text": "Most of the theories I've read are really old and I've found no mention on new ones, may be because I haven't read much. The last one I read mentioned Post Modernism by Foucault.",
        "created_utc": 1484732489,
        "upvote_ratio": ""
    },
    {
        "title": "Are Australian aborigines biologically that different from the British?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/5onww8/are_australian_aborigines_biologically_that/",
        "text": "[deleted]",
        "created_utc": 1484722664,
        "upvote_ratio": ""
    }
]