[
    {
        "title": "How to write 7000 Words with only 8 Sources allowed?",
        "author": "somit_afghan",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10htard/how_to_write_7000_words_with_only_8_sources/",
        "text": "Hello,\n\nI'm currently writing a scientific paper but am only allowed to use 8 sources.\nUntil now I thought it's best practice to use primary sources, namely referencing directly to a study when making a statement.\nBut with 7000 words it seems impossible to reference each statement with a study when only 8 sources are allowed. How would you solve this problem?\nWhen removing some sources, I have statements in my paper, which could be seen as knowledge, but I am still afraid someone will mark this as inusfficiently cited.",
        "created_utc": 1674313737,
        "upvote_ratio": 1.0
    },
    {
        "title": "a primeira academia portátil inteligente do mundo",
        "author": "Winter-Income9709",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hrzqp/a_primeira_academia_portátil_inteligente_do_mundo/",
        "text": "[removed]",
        "created_utc": 1674309940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have to ask permission to publish email correspondence?",
        "author": "JubileeSupreme",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hr4hg/do_i_have_to_ask_permission_to_publish_email/",
        "text": "For a monograph, what is the procedure for publishing a quote from an email? It is of a non-personal nature pertaining to a research topic.",
        "created_utc": 1674307305,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I need for my 1st meeting?",
        "author": "breakawaythrowaway71",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hlcg7/what_do_i_need_for_my_1st_meeting/",
        "text": "Hi all, I’m currently enrolled in an independent study. This is my first time doing something like this, so I’m not sure what to expect. Is there anything I should do or have prepared before our first meeting?",
        "created_utc": 1674284962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources/Programs/Studying - Archives/Open Access?",
        "author": "99999www",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hjgmc/resourcesprogramsstudying_archivesopen_access/",
        "text": "Hello!\n\nI'm wondering if anyone on this sub might be able to direct me to potentially some resources/ your thoughts and experiences regarding my budding obsession with open access, open source, kind of free educational/solidarity archives and resources?\n\nI'm interested in working for archives such as The Internet Archive, The Anarchist Library, Zlibrary (equivalents; RIP), libgen...platforms like this?\n\nI've already applied to graduate information sci programs specializing in digital preservation and archiving which I hope will serve as good infrastructure for pursuing this interest, but I'm very curious if anyone here has resources/insight/advice regarding this? \n\nHow would I get involved in projects like these? How would I be most helpful?\n\nPlease feel free to DM me as well.\n\nThank you so much!",
        "created_utc": 1674278192,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Wix? Wix is a website builder and a web hosting provider",
        "author": "WesternCorgi8017",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hj2dq/what_is_wix_wix_is_a_website_builder_and_a_web/",
        "text": "[removed]",
        "created_utc": 1674276887,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this person's ethnicity - pic in comments?",
        "author": "anlubi333",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hha4u/what_is_this_persons_ethnicity_pic_in_comments/",
        "text": "(Pic in comments) I know this may seem random but it's part of a larger study I am conducting regarding perception and race/ethnicity. Please take your first guess and, if you're comfortable enough to, include your general location for context. Thanks!",
        "created_utc": 1674270945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think academia is going to adapt to or vilify ChatGPT?",
        "author": "ItsAllAGame_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hgg4r/do_you_think_academia_is_going_to_adapt_to_or/",
        "text": "The ChatGPT panic seems to show that many institutions of higher ed squandered an opportunity over the past three years to reimagine digital learning and meaningfully support faculty—have we learned so very little from the pandemic pivot about care, creativity, and agency?",
        "created_utc": 1674268288,
        "upvote_ratio": 1.0
    },
    {
        "title": "So you think academia is going to adapt to ChatGPT?",
        "author": "ItsAllAGame_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hge4s/so_you_think_academia_is_going_to_adapt_to_chatgpt/",
        "text": "The ChatGPT panic seems to show that many institutions of higher ed squandered an opportunity over the past three years to reimagine digital learning and meaningfully support faculty—have we learned so very little from the pandemic pivot about care, creativity, and agency?",
        "created_utc": 1674268130,
        "upvote_ratio": 1.0
    },
    {
        "title": "What discipline has the most favorable job market and how favorable even is that?",
        "author": "Historical_Score5251",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hfjds/what_discipline_has_the_most_favorable_job_market/",
        "text": "I’m currently an undergrad and I feel like from what I’ve read online the idea of an academic position should be treated less as a viable career plan and more a hopelesss aspiration. But is this more true for some fields than others, and is it really this bad.",
        "created_utc": 1674265549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling very depressed and lonely as a 1st year PhD student.",
        "author": "ianneart",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hfgq2/feeling_very_depressed_and_lonely_as_a_1st_year/",
        "text": "So yeah..pretty much what the title says. I have never been really good at making friends and I was a little more hopeful my first quarter in trying to bond with my cohort but now, I see that happening less and less.\n\nI can talk to the others pretty amicably and by no means do I have unpleasant interactions with any of them but I feel like at the end of the day, everyone gradually started forming their little 'friend' groups and I don't fit in with any of them.\n\nMy wife is pretty much my only support system and she is great but  I still can't help feeling down on myself.",
        "created_utc": 1674265322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I kick out this undergrad with 1 semester to go?",
        "author": "Euphoric_Sound_7944",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hdr05/should_i_kick_out_this_undergrad_with_1_semester/",
        "text": "I run a bio lab that sometimes allows undergrad researchers to volunteer for experience. The spots are very coveted because students need them for med school etc. There are dozens of apps for every opening.\n\nI let a former grad student in my lab select an undergrad to work with. The grad student decided to leave the program, and the undergrad was left for me to supervise. The undergrad has consistently underperformed and is getting in the way of other people's projects (long story).\n\nI've given a lot of feedback. It hasn't gotten better. The undergrad is very sensitive and not resilient when feedback is given.\n\nOn the one hand, the problem will solve itself when the student graduates at the end of the semester. On the other, it causes problems have anyone in the lab who doesn't do what they're supposed to do.\n\nDo I have the uncomfortable conversation and kick the undergrad out of the lab? Or do nothing and let it work itself out?",
        "created_utc": 1674260410,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your system or routine for research and writing?",
        "author": "Ancient_Reply4583",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10hd77t/what_is_your_system_or_routine_for_research_and/",
        "text": "Hello everyone,\n\nI have had a rough few semesters in my PhD so far. (I'm just starting my 5th semester and my candidacy exam is coming up). I haven't published anything, not even close. I keep comparing myself to my housemate who's only one semester ahead of me but has already published 3 papers. (Different field, though. I guess much easier to publish things in science - vs me in Engineering) \n\nI think my issue is that I don't have a solid system. Basically, I've only been writing code and doing statistical analysis, but when it comes to reading papers and writing; I'm so lazy and overwhelmed. I keep downloading papers, sometimes open them up, sometimes read a paper or two a day and take massive notes (each paper takes me 3-4 hours this way) then lose motivation and back to coding and courses and other things... Then I basically forget all of the papers I've already read or my notes. My notes are also scattered across several platforms so it's a whole mess. \n\nI thought maybe knowing what systems other people have in place would be helpful. \n\nSidenote: I have severe ADHD that I take medication for. Have been on medication since highschool.",
        "created_utc": 1674258944,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you know if someone has \"what it takes\" for a career in academia/research?",
        "author": "deepfriedokra",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10haoww/how_do_you_know_if_someone_has_what_it_takes_for/",
        "text": "In more detail, what are characteristics, skills, or \"tells\" that indicates that someone is fit to succeed in a career like this? \n\nFor some context on why I'm asking, I am a Master's student that applied to PhD programs this cycle, it's already not looking so good (this is my 2nd time applying), and I am conflicted between letting go of pursuing a doctorate. The apps were expensive, I'm already 26 years old, and I wonder if I just don't have what it takes to get in and succeed in this career.  I wonder if I am just not a good fit for academia. Since I am finishing my M.A. program, I am torn between getting a research job and trying again in the next cycle, or leaving the field completely to go into industry. I don't want to waste any more time pursuing something that I am not built for.\n\nHow did you know you or someone was fit for this? How did you know that this career aligned with you as a person?",
        "created_utc": 1674253663,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breach of academic integrity – Advice please?",
        "author": "TopParsnip6488",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10h8hnq/breach_of_academic_integrity_advice_please/",
        "text": "Before you say anything, I know I'm stupid, and I deeply regret my actions. I feel suicidal and hopeless right now. I'm posting on this brand new account because I feel so much shame and embarrassment for my behavior.\n\nBasically I have been uploading my school notes to course-sharing websites for years. I am in my second year of a graduate program and three different professors filed formal complaints because I had posted their exams online… (there is concrete evidence). I was not made aware of these complaints until today. My stupid self assumed that the exams were changed every quarter, so I never expected things to bite me in the *ss like this (however, I understand the violation of intellectual property to be a different issue). I worked very hard to get in this program and would never do anything to put my education in jeopardy.\n\nI will be meeting with the faculty panel sometime within the next two weeks, and I intend on being fully transparent and honest. I was haphazard in my actions and quite frankly only uploaded all these documents because these websites were offering $$$ and, as a broke grad student, I was desperate for the money. I understand the severity of my actions now and will be using this as a learning opportunity but the last thing that I want is to be expelled from the program. The tuition is incredibly expensive (private school), I only have one year left, and I don't think I could go on living if this happened. It would literally ruin my life. I will take getting an F in a course, or even having to retake a course, but I would just kill myself if they expel me from this program...\n\nI'm really scared right now, and I don't know what to do. Does anyone have insight into what is likely to happen in this sort of situation? I couldn't find anything online because most cases had to do with cheating/plagiarism.",
        "created_utc": 1674249597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my teacher a good person or is it just what she teaches?",
        "author": "notsosecretdiaries",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10h8fe6/is_my_teacher_a_good_person_or_is_it_just_what/",
        "text": "I have a literature teacher that teaches beautiful texts, and the way she teaches is absolutely impeccable. She is also very sweet and I, along with a majority of the students at school, have high regard for her.\nOne of my friends recently noticed that she's been putting said teacher on a pedestal and that the teacher might not be that great as a person, but the fact that she teaches beautifully is what makes us think so highly of her.\nI have since been thinking about this and I'm not sure if my friend is correct or if my teacher is actually a good person.",
        "created_utc": 1674249445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Breaching academic integrity - What will happen to me...?",
        "author": "TopParsnip6488",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10h75iw/breaching_academic_integrity_what_will_happen_to/",
        "text": "[removed]",
        "created_utc": 1674246221,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the top 10 Master's in Finance programs?",
        "author": "-watermelon_sugar-",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10h6enp/what_are_the_top_10_masters_in_finance_programs/",
        "text": "I tried googling the top master's in finance programs in the world, but there's no article with a definite list I could find. If anyone has a list or a link, please share. Thank you!",
        "created_utc": 1674244329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you know? David Crosby dies at 81",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10h5aio/did_you_know_david_crosby_dies_at_81/",
        "text": "[removed]",
        "created_utc": 1674241596,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to export cited papers from list of papers?",
        "author": "vebaev",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10h1d7n/how_to_export_cited_papers_from_list_of_papers/",
        "text": "Hi all,\n\nI am using export function of Scopus but in its current form it takes a lot of manual copy/paste and it takes a lot of time and I want to simplify my work.  \nI have for example a main list of 20 papers and I need export which contains the 1st paper details (title, authors, pages etc) and then every paper and its details (title, authors, pages etc) that cites the 1st paper; than the 2nd paper from my main list and so on…….  \n\nWhat app or a database to use to do that? Or maybe a script (I can use python and R for example)?     \n\n\nmany thanks!",
        "created_utc": 1674232379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychology master thesis survey - optimism wile using online dating apps",
        "author": "signe_regine",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gy4ze/psychology_master_thesis_survey_optimism_wile/",
        "text": "[removed]",
        "created_utc": 1674224443,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do when your SO doesn’t want you to continue anymore in academia?",
        "author": "vloer-vd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gxuo3/what_to_do_when_your_so_doesnt_want_you_to/",
        "text": "The title may be a bit extreme, but I’m not sure how to name it differently.\n\nI’m currently a second year PhD student living abroad. My SO had lived just as me in many countries, and decided to move to my city to finally stop the whole long distance thingy.\n\nThe problem, he likes it here to much… my plan was always to stay here 4-5 years and move for a postdoc. I want to try to make it in academia. My supervisor is quite impressed by my work and is already trying to link me to professors at quite prestigious universities.\n\nBut the last couple of months, my SO starts to gaslight me into saying that I’ll never have to move. I should just stay here and do a postdoc, or should just stop academia (telling me it’s nothing for me). During Christmas I even found out he told his mom that he would only move to my city for some years and then move back to our home country. She was in shock when I told her, I want to move probably even further.\n\nNow I just don’t know what to do. I love my SO a lot, and I also feel kind of bad for wanting to move again for my career when he clearly wants to stay here or move back to our home country. But academia is my dream..\n\nHave any of you been in this situation?",
        "created_utc": 1674223704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which things should be included in an effective reference/summary managing system?",
        "author": "Laafheid",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gthn0/which_things_should_be_included_in_an_effective/",
        "text": "During my masters' I have mostly worked through coursework and kept things organised by week and/or topic, resulting in a lot of nested directories which seemed organised at the time.\n\nHowever, while I'm working on my thesis now, I notice that what looks like an organised system actually makes it impossible for me to keep track of what I've read, why I've read it and the take-aways because I cannot see or find the wood for the trees. As a new **bare bones** method/attempt for organising I've decided to just keep 1 document full of 1-pagers, which I can search with ctrl+f in a google docs so I can access it from all my devices.\n\nAs a reference for what I might want to include I used Zotero, Mendeley, readcube, Endnote &amp; read the top posts for \"reference manager\" in this subreddit.  The biggest issue people seem to have is automatically reorganising the reference style, but since I work in LaTeX with .bib files that's not really an issue for me. \n\nSo far I have a template with:\n\n&gt;Title (hyperlink source pdf):  \nTags:  \nBinder with paper copy:  \nYear: Lead author:  \nVenue/Journal:  \ncitations@retrieval (how familliar can I assume readers are with the content):  \nBibtex link  \n  \n&gt;  \n&gt;Summary:\n\nWhat kind of features / info do you feel like **you** are missing in your own systems that you wish were in there and what do you think not being included in the above will come back to bite me in the behind?",
        "created_utc": 1674210256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Depression on the tenure track?",
        "author": "melanie2589_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gp94g/depression_on_the_tenure_track/",
        "text": "I’m currently wrapping up my postdoc and will be starting a TT faculty position at and R1 in the fall. I was always back and forth between academia and industry but ultimately decided on academia. I’ve been struggling with crippling depression ever since I finished my PhD and have dealt with suicidal ideation over the past 2 years on and off. I don’t know if I can handle the stresses and constant pressure of the position I accepted and I feel guilty bc my advisors and mentors put their necks on the line for me and will be so disappointed. Not just them but a whole host of people will be super disappointed and confused about me throwing away such a great and prestigious opportunity. The worst part is I’m not even sure what I would be doing instead of the TT job. More and more time is just passing and it’s getting closer and I feel like I will end up just going with the current situation and being miserable. I just feel stuck and I think my future colleagues will hate me when this side of me starts to show on the job",
        "created_utc": 1674194797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finishing Ahead of Schedule? (Dissertation)",
        "author": "ImpishNerd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gp61z/finishing_ahead_of_schedule_dissertation/",
        "text": "It's been less than a year since I've done my qualifying exam. Since that time, I've been trying to get the dissertation done as respectfully as possible, in regards to my committee. I see my colleagues struggling, trying to get their chapters our, whereas I feel like my chair and advisors have helped me finish a dissertation draft within seven months. Now, alas, my chair's suggesting I might be able to get my dissertation done before the year ends, unless I want to take a break, that is.  \n\n\nIs this good, bad? My advisors have been really supportive, but I'm just not...sure what to think, particularly in that they've gotten me here without really engaging the idea of applying for jobs and/or postdocs beyond suggestions for doing the latter.",
        "created_utc": 1674194520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being 'investigated' by a potential PhD supervisor",
        "author": "16H07",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gm5tk/being_investigated_by_a_potential_phd_supervisor/",
        "text": "I'm currently applying for a PhD at an Ivy League school and I had a call with the professor, which went well. I then applied and the supervisor has emailed me again, asking for more writing samples. He's also emailed my professor to ask what I'm like, on top of the reference he already provided. He's even contacted professors I've studied with who I didn't list as a reference. This level of investigation is insane to me - I have near perfect grades and I've never heard of this happening before. Is it a bad sign?",
        "created_utc": 1674185411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Greater value? Major Geography + Minor in Geographic Information Systems OR Certification from well regarded community college - Canada",
        "author": "FundyLoyal",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10gil5z/greater_value_major_geography_minor_in_geographic/",
        "text": "I'm looking to pursue a career that relates to environmental work and conservation. I've had an interest in geography and cartography for a few years now and it's time for me to decide on applying to a school.\n\nI can pursue the traditional academic path, obtain either a BA or BSc in Geography with a minor in Geographic Information Systems &amp; Remote Sensing from a university. Or, I could pursue obtaining accredited certification from the Centre of Geographic Science in Nova Scotia. But this will not be equivalent to a degree.\n\nI'm partially worried about how employers would view a lack of a Bachelors, despite the noted quality of COGS. However I'm also worried about the quality of life at COGS due to its isolated location and small population (~250 students on the entire campus).\n\nAny &amp; all advice is welcome and greatly appreciated.",
        "created_utc": 1674175642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying for research positions - post-application help please!",
        "author": "roy2roy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ght5a/applying_for_research_positions_postapplication/",
        "text": "I'm unsure if this is the right place - so please correct me if so, and sorry in advance!   \n\n\nI just graduated with a BA in my field of study, and have applied for a job in a research lab at my university I graduated from. I also interned at this lab.   \n\n\nIt has been five weeks since I applied through the university careers portal, and I am wanting to see if I can inquire about the status of my application. That said, from what I understand, since it is affiliated with the university it'll probably go through a HR / a hiring manager there?   \n\n\nMy question is, should I inquire directly with the laboratory, or the university's HR department, which has the application portal?   \n\n\nThanks for any help, and sorry again if this is the wrong place / is a silly question.",
        "created_utc": 1674173614,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of my students has an ongoing issue with sexual harassment",
        "author": "riverottersarebest",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ghmar/one_of_my_students_has_an_ongoing_issue_with/",
        "text": "I’m a lady grad student and TA an undergrad senior-level lab section. It’s under 20 undergrad students and my advisor teaches the lecture. After teaching my first lab, a fellow grad student (I’ll call her FGS) approached me and told me to watch out for a certain student as she had taught him the previous semester. I knew who she was referring to without asking. When I met the problematic student (I’ll call him PS) for the first time while teaching, he immediately made me feel uneasy, and I’ve learned to listen when my brain’s alarm bells go off like that. He’s probably 10-15 years older than me, maybe 20 years older than the other students. He constantly interrupted me when I would explain things to the whole class, kept attempting to explain things to me, and lingered at the end of lab when a few students were finishing up — just hovering, making small talk with me.\n\nI coordinated a meeting with FGS and my advisor. FGS told us that four other undergrads, all of whom are in my current lab section along with PS, have complained to her and another faculty member. PS has put his arms around students and has made inappropriate comments (to what extent, I’m not sure. Obviously any extent is bad). The students asked FGS not to report PS — they’re young and I would assume they’re nervous about the whole situation. Having been through a similar situation already in my early 20s, I remember being afraid of retaliation. FGS told the faculty member who taught the lecture, and they reported it at the end of last semester (to who, I’m not sure — I hope it was the Title IX officer though). \n\nFGS also said PS had made inappropriate comments to her and would follow her to her office, which is near the classroom she taught him in. FGS said PS sent her inappropriate emails. My office is also near the classroom and I don’t want PS to find out where it is. \n\nNow I’m stressed as fuck. I’ve been through so much sexual harassment myself over the years. At least this time around, I have a boss (my advisor) who is fully ready and equipped to support me and the undergrads who have been harassed. My advisor and I co-teach the lab section because it’s very hands on, so he’s quite involved.\n\nIn the meantime, PS hasn’t done anything to me after just one lab. But I feel like a train is coming at me and I’m tied to the tracks. I feel like I’m going to have to deal with the creepy emails, the gross comments, maybe an arm around me, and I feel powerless to do anything to stop it before it happens. He seems fucking dangerous and volatile. I also have to be worried about keeping him away from his victims. This brings back such bad memories for me, and so much anger that I have to deal with this absolute shitbag while I just want to focus on teaching, which is challenging enough on its own. \n\nI fully know to document it all. Keep track. But I fucking wish I didn’t have to. I hope the Title IX office does something or that more swift action is taken. I feel like I can’t currently do anything because I haven’t been his victim yet. Please offer advice or even just words of support.",
        "created_utc": 1674173124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are No Cost Extensions viewed poorly by the funding agency?",
        "author": "DevinC0peland",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g9zef/are_no_cost_extensions_viewed_poorly_by_the/",
        "text": "I am a new professor and was recently awarded a small 1 year grant by a federal agency. \n\nI was too ambitious on my timeline, and I think I will need a no-cost extension to complete all of the work I proposed. Will this hurt my ability to get funding in the future? I have been stressing more about this than actually getting work done. I don't want to upset anyone at a federal agency and get blackballed from future funding.",
        "created_utc": 1674154745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about manuscript status",
        "author": "quickdrawdoc",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g9w8h/question_about_manuscript_status/",
        "text": "Hi everyone. I submitted a systematic review to a ScholarOne journal a couple weeks back, was assigned an AE, then another AE appeared on my dashboard the following week, and shortly thereafter the status went from \"Awaiting reviewer selection\" to \"Awaiting EIC processing\". Would you think this is a bad sign, or is it not really possible to read into this yet? Thanks for your feedback!",
        "created_utc": 1674154532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for someone who is not a good fit academia?",
        "author": "Loctrocute",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g7s9t/suggestions_for_someone_who_is_not_a_good_fit/",
        "text": "Hi,\n\nPretty much what the title says. I just joined a SLAC which is the 3rd school. My first job as was at a SLAC, TT position, toxic departmental leadership, didn't pass mid-tenure eval. Moved to a different job, not really SLAC but a teaching-oriented public college, hated the location. Moved to this 3rd school, TT again, SLAC. Location-wise, wouldn't be my preference but it was my only opportunity after sending out 30+ applications. At first I really enjoyed it because expectations were laid back, people seem great and friendly, very accommodating, teaching load very reasonable. But there are some expectations from faculty I absolutely hate being a part of (student recruitment- multiple emails every week regarding meeting with potential students and marketing to them the school basically). At first because I'm new I thought it would be just a couple meetings here and there, but these emails sent to a number of faculty collectively are so frequent and it's causing me unnecessary stress and I absolutely hate it. I just want to teach my classes, do the advising and committee work and that's it. I don't want to engage in anything else. Which makes me think I'm not fit for an academic career (I don't love teaching, it's okay, I like talking to students but times have changed and the current teaching experience in the classroom is not as good as it used to be).",
        "created_utc": 1674149779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching careers - Should I Linkdin?",
        "author": "heaterBW",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g6lj2/switching_careers_should_i_linkdin/",
        "text": " After a 20 year career in restaurants ranging from bus boy to owner, I have decided to switch the medical profession. I am about to complete my licensing in colorado for my CNA, with goals of reaching my RN and even beyond. My question is, at 37 in a new career, is it worth getting a Linkdin account? I have never had one before and just wondered if people still use it at all?",
        "created_utc": 1674147031,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do when you don't have any results?",
        "author": "I-wanna-fdie",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g3bnv/what_to_do_when_you_dont_have_any_results/",
        "text": "I have literally no results. Nothing. Absolutely nothing. \nI'm a master's student and should be defending my dissertation by the end of this year. \n\nThing is, I don't have one single result. I've been trying to standardize our protocols for WB, IF, and cell synchronization... It's been a year and that's ALL I'm doing. I'm always troubleshooting again and again and again and again.... I'm tired. Can never proceed with my actual research. \n\nI believe our problem boils down to bad antibodies. And antibodies take up to 6 months to come in. We also don't have money to spend on many antibodies. \n\nI don't know what to do. At this point, I just want to give up.",
        "created_utc": 1674139184,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to know about what's in all your physical books",
        "author": "Kullenej",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g2wcq/how_to_know_about_whats_in_all_your_physical_books/",
        "text": "Hello\n\nI'm a Lecturer and a director of studies at a Swedish University. I teach Rhetorics and Danish, which means I teach Danish language (grammar, phonetics etc.), danish culture and history, danish literature, literary analysis and theory and of course academic writing. You can understand that I have a ton of books on my bookshelf.\n\nI use Zotero for all of my references (digital and physical) and Obsidian for taking notes on references. My question is the following: How do you keep track of all of your literature? Like what is inside the books, theme, topic, sub-topic. If I for example teach a class about morphology, I would love to be able to just search and see all of the books that contains stuff about morphology.\n\nAt one point I even bought a CZUR book scanner to scan my books so that I could search the content of all my books, but now it is just collecting dust. I have also thought about just scanning the table of content and index for all of the books. Lately, I have been writing the index manually with tags in Zotero, but gave up on that as well. Any tips?",
        "created_utc": 1674138067,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to start applying for jobs as an adjunct for Summer, Fall?",
        "author": "larsonbot",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10g0brl/when_to_start_applying_for_jobs_as_an_adjunct_for/",
        "text": "This is a question for my partner as she is not on Reddit. She is completing her master’s in Literature/English in May and I am trying to help her with the application process. When should she start applying for adjunct positions for the summer? For the fall? We have not been able to information about a timeline for when she should start applying for specific semesters and she doesn’t want to miss the peak time to apply.\n\nAdditionally, is limiting adjunct positions to a specific city (albeit one with lots of colleges/universities) realistic? We really want to stay in our current city for another two to three years.",
        "created_utc": 1674130803,
        "upvote_ratio": 1.0
    },
    {
        "title": "research topics on literature",
        "author": "kiss-me-on-my--",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fzfq2/research_topics_on_literature/",
        "text": "I promise I'm not going to plagiarize...I'm just asking this to get an idea...what are some of the interesting research topics on literature u ever stumbled upon",
        "created_utc": 1674127905,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to put in a CV as a current PhD student?",
        "author": "Razkolnik_ova",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fzcdp/what_to_put_in_a_cv_as_a_current_phd_student/",
        "text": "Heya :), 1st year PhD student here applying for an external placement. I've been wondering how to structure my CV and what to put as 2 pages are starting to not be enough. Right now, I have:\n\n\\- Education\n\n\\- Research Experience (i.e., these are mostly internships that I've done as I did a 3-year extensive Research MSc in Europe)\n\n\\- Employment History (only relevant jobs)\n\n\\- Publications\n\n\\- Conferences\n\n\\- Awards\n\n\\- Volunteering Experience (I have some relevant stuff here too)\n\nI previously had a 'Skills' and ' Extracurricular Activities' sections as I wanted to give the CV a slightly more personal feel, but I've now removed them as there's no space anymore (if I want to keep the CV under 2 pages, which I do). \n\nNo photo, formal outline, I study in the UK, field is clinical neuroscience. \n\nThanks all in advance for any thoughts :)",
        "created_utc": 1674127591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which apps do you use and suggest for the literature review?",
        "author": "myillusion13",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fyp71/which_apps_do_you_use_and_suggest_for_the/",
        "text": "Hello everyone,\n\nI will begin my Ph.D. soon so I was doing research about the things I would need.\n\n&amp;#x200B;\n\nWhich apps do you use and suggest for the literature review? I am also open to any suggestions. Thanks.",
        "created_utc": 1674125250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people in academia share their published works on Mastodon?",
        "author": "Bitter_BubbleTea0930",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fxejm/do_people_in_academia_share_their_published_works/",
        "text": "I see people on Twitter sharing their published work a lot, but not so much on Mastodon. Is it a common consensus? Apart from arXiv sharing bots on Mastodon, are there any servers that share paper regularly?\n\n&amp;#x200B;\n\nThx!",
        "created_utc": 1674120220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not very interested in the projects that my PI wants me to work on",
        "author": "LupusArctos29",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fweu5/not_very_interested_in_the_projects_that_my_pi/",
        "text": " \n\nHey guys,\n\nIm a Masters student and I joined this group 3 months ago, I have been working on another project with a grad student and now my PI wants me to work individually on another project. He pitched me two projects and both projects although related to the project that I have been assisting, are very different from my research interests and the project that I was assisting. When I joined the group, I was briefed on the project that the graduate student was working one and I assumed that I would be working on a similar project, as this aligns with my research interests.\n\nHow do I handle this situation?\n\nThank You",
        "created_utc": 1674116288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental Health &amp; Physical Activity Research Study Recruitment",
        "author": "PA_MentalHealth_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10frhsn/mental_health_physical_activity_research_study/",
        "text": "Recruitment for research studies have been low. Has anyone else found this as of late? We have decided to try out Reddit for recruitment. \n\nWe are a group of researchers from the University of Calgary that are developing an adapted physical activity program that aims to improve the mental health of its participants. To do so, we hope to get the input from both: 1) caregivers of people with neurodevelopmental disabilities (i.e. ADHD, Autism, FASD, IDs, CP, etc.) and, 2) people with neurodevelopmental disabilities themselves. The survey should not take too long to complete. If you know of any caregivers of a child or youth with a disability between the ages of 12 and 25, and any people with disabilities between the ages 14 and 25, would you mind sharing the link below with them? It would be greatly appreciated!!\n\nLink for caregivers: [https://survey.ucalgary.ca/jfe/form/SV\\_74fgeksuMNX5v5c](https://survey.ucalgary.ca/jfe/form/SV_74fgeksuMNX5v5c) \n\nLink for person with disability: [https://survey.ucalgary.ca/jfe/form/SV\\_06uDidnYfmle3Ou](https://survey.ucalgary.ca/jfe/form/SV_06uDidnYfmle3Ou)\n\nAs I am sure you know, people with disabilities are particularly vulnerable to adverse mental health outcomes. Developing an informed physical activity program may be very helpful in improving the quality of life of youth with neurodevelopmental disabilities.",
        "created_utc": 1674099765,
        "upvote_ratio": 1.0
    },
    {
        "title": "How/why did you decide to pursue PhD? (especially as a career pivot)",
        "author": "ellesea32",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fpxtx/howwhy_did_you_decide_to_pursue_phd_especially_as/",
        "text": "I hope this is ok to post here — it’s not related to admissions so much as your journey to academia. Please let me know if I should direct this Q elsewhere though. I am relatively new to Reddit as a poster!\n\nI have a professional degree in a design field and 10 years of experience, split between that field and community development/economic development. I’m currently participating in a 3-year mid-career economic development fellowship and plotting out my next steps. A big part of me feels called towards academia. I just would love to more fully explore and encourage the link between those fields of practice and to more fully investigate questions and common dilemmas that have presented themselves throughout my work in communities.\n\nAll that said — I’m not sure: are those strong enough reasons to pursue a PhD? What were your reasons and in hindsight, how do you feel about your decision?\n\nA little more extra context if anyone is still reading: a PhD would be a pretty big disruption to my life. I’m a mom to two and we are considering a third. My partner has a stable job/career but still, my income would be missed unless he grows to make up the gap (which isn’t out of the question but certainly isn’t a sure thing). We live in a major city with several universities and I would only consider programs within driving distance to our home (where we are well rooted near family) but I know that would certainly limit my options post grad. While I wouldn’t write off teaching/remaining in academia I mostly see myself working as a consultant in partnership with communities, public sector organizations, and design firms.",
        "created_utc": 1674095270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some advice for using Chegg in UK",
        "author": "Eastern-Ad4003",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fpb6u/some_advice_for_using_chegg_in_uk/",
        "text": "[removed]",
        "created_utc": 1674093528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why leave industry research for academia?",
        "author": "scikiwi",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fkfcb/why_leave_industry_research_for_academia/",
        "text": "Have seen so many “I left academic research for industry research”, but I’m on the flip side and have a few PhD interviews coming up. I imagine they’ll ask why I decided to leave or not pursue a higher research position in industry.\n\nCurrent former/PhDs, did you leave industry research? What’s a good reason to share during PhD interviews regarding why you decided to leave industry?",
        "created_utc": 1674080971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conveying publication history in resume for industry position",
        "author": "abstracted8",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fjwb7/conveying_publication_history_in_resume_for/",
        "text": "I am applying (as a recently graduated PhD) for an industry position at a large, well known company. The job listing asks for \"proven accomplishments through recent publications...\", and my question has to do with the best way to convey this on the resume.\n\nFor academic positions/CV I would just list everything as suggested by my advisor (first &amp; co-author publications, conferences, and proceedings). However, I know that industry tends to prefer resumes no longer than 2-ish pages, and listing out all 37 items will certainly exceed this common rule.\n\nShould I list everything? Or just select the few most relevant?",
        "created_utc": 1674079718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer schools for PhD students in Learning Analytics or Educational Data mining field?",
        "author": "radiobullet",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fjw13/summer_schools_for_phd_students_in_learning/",
        "text": "Hello, \n\nAs a second-year Ph.D. student in the field of Educational Data Mining and Learning Analytics (particularly interested in affect detection, motivation, self-regulation, and algorithmic bias work), what are some of the best summer school programs in the world? \n\nWould anyone with personal experience recommend enrolling in them, or sharing their learnings? \n\nDo they focus on methods, or do you work on projects and can actually get some research output at the end?\n\nThanks so much!",
        "created_utc": 1674079700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I cancel an interview if I’m not planning to accept the job?",
        "author": "hsm3",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fhgl7/should_i_cancel_an_interview_if_im_not_planning/",
        "text": "Not sure if this is the best place to ask, I’m finishing my PhD in an applied physics program and looking for postdoc/employment. All the jobs I applied for are research positions at national labs, so it’s academia-adjacent. Scientists at these labs publish a lot and mentor graduate and undergraduate students. \n\nI received a verbal offer earlier today for a post-doc that I 100% intend on accepting once I receive the written offer. This is the ideal situation for both me and my spouse, and will most likely lead to long term employment at this national lab (they hire most of their postdocs). \n\nI also was invited to interview for a full-time staff scientist position at another lab. This interview is 3 hours long on Friday. I don’t want to waste everyone’s time there if I have no intention of accepting the position, but I feel like it would be rude to cancel with just a day’s notice. The interview committee is all people who I interact with professionally, it’s a tiny field. What should I do?",
        "created_utc": 1674072967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conveying publication history in resume for industry position.",
        "author": "clofnihibr",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fdrzo/conveying_publication_history_in_resume_for/",
        "text": "I am applying (as a recently graduated PhD) for an industry position at a large, well known company. The job listing asks for \"proven accomplishments through recent publications...\", and my question has to do with the best way to convey this on the resume.\n\nFor academic positions/CV I would just list everything as suggested by my advisor (first &amp; co-author publications, conferences, and proceedings). However, I know that industry tends to prefer resumes no longer than 2-ish pages, and listing out 37 items will certainly exceed this common rule.\n\nShould I list everything? Or just select the few most relevant?",
        "created_utc": 1674064364,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does having kids impact the career of a male researcher?",
        "author": "ColumbiaGSAlum",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fcmdy/how_much_does_having_kids_impact_the_career_of_a/",
        "text": "There are a lot of researches showing that having kids negatively impact the career of a female but I am curious how much it impacts the career of a male researcher.",
        "created_utc": 1674061692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling lost after finishing my PhD - anyone feeling/felt the same?",
        "author": "louise-99",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fc42c/feeling_lost_after_finishing_my_phd_anyone/",
        "text": "I've finished and passed my PhD in neuroscience/molecular biology now (woo!) but I've decided I want a career away from academia and the lab.   \nI'm struggling to figure out what to do, I really like science but I want to pursue a career where I'm working with lots of people, on a variety of projects, still in the science world, that has a good career progression, is fairly 9-5 and pays well. I'm also looking for jobs in London.   \nHas anyone got any ideas for roles that fit the above?   \nI've been looking at jobs and going through the cycle of either being too experienced or not experienced enough - super frustrating!",
        "created_utc": 1674060521,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some useful AI tools for academic writing and data analysis?",
        "author": "alitebrand",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fbibx/what_are_some_useful_ai_tools_for_academic/",
        "text": "I'm beginning to draft my dissertation and just became aware of AI tools such as ResearchRabbit.ai. Are there other AI tools that folks know about that are good for literature reviews and general dissertation writing? Maybe even help with data analysis? For context, I do a lot of international mixed-methods work as an agroecologist based in the U.S., but I'm open to hearing everything. I am new to qualitative methods, and I don't mind paying for subscriptions either.",
        "created_utc": 1674059086,
        "upvote_ratio": 1.0
    },
    {
        "title": "How bold should I be while interacting with a PI I am discussing doing a master’s with?",
        "author": "Difficult-Turn-5050",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10fas9c/how_bold_should_i_be_while_interacting_with_a_pi/",
        "text": "Hi all! I am first gen so a lot of the academic process is a mystery to me! I’ve been looking for professors at my current undergrad institution to pursue a master’s degree with. My university requires sponsorship from a PI who will agree to fund you before applying for the master’s program. \n\nYesterday I had what I believe was a really great Zoom interview with a potential PI and his lab manager. They complimented me a ton, and invited me to come stop by the lab and interact with some of their other grad students. \n\nSince my university requires the PI’s sponsorship, I am sort of unsure whether or not I should outright ask the PI whether he is interested in taking me in and funding me,  or if I should wait for him to initiate this? Likewise, I am unsure whether or not I should send a follow up email thanking him for the interview and asking what the next steps I should take are, or if it is more polite to wait for him to do this? I feel totally lost, any advice would be amazing. Thanks all!",
        "created_utc": 1674057391,
        "upvote_ratio": 1.0
    },
    {
        "title": "What academic path should I go down given my interests?",
        "author": "silhouetteofthecedar",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f9d3z/what_academic_path_should_i_go_down_given_my/",
        "text": "I’m an undergrad (2nd year) planning to major in classics and global studies (with a focus on Eastern Europe/Russia). I want to be an academic of some sort (ideally a professor), so I need to go to grad school, but I don’t know exactly what I want to study. I like to study too many things, so I haven’t been able to narrow it down. \n\nWhen I think “what would you like to study forever?” this is what I can think of:\n\n1.) The internet as a social force - the ways it has changed global conceptions of class, our relationships with creating and consuming art, and cross cultural communication \n\n2.) Pop culture, specifically global musical and artistic movements (especially as they interact with Russian and/or Japan)\n\n3.)The fundamental ways ideas about Greco-Roman religion differed from Judeo-Christian religions (religion as “amoral” and more naturalistic, etc)\n\n4.) Russian and Japanese literature\n\nAny help or advice you can give about what I should major in/what kind of grad programs I should look at/etc would be really helpful! Thank you!",
        "created_utc": 1674053909,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I’ve learned to be non-creative over the years. How do I relearn how to be creative?",
        "author": "HazzRatt",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f7gp9/i_feel_like_ive_learned_to_be_noncreative_over/",
        "text": "I feel like I’ve learned to be non-creative over the years. How do I relearn how to be creative?\n\nWhen I was younger, I wanted to make movies for a career. I often experimented in film making, recording short snippets of video with an old, low resolution video camera and editing the clips on iMovie. Nevertheless these movies were terrible. However, although my creative output began almost unwatchable, I believe I did improve in this regard as I experimented with different techniques. I learned the creative process through movie making.\n\nThese days I am hopeless at anything creative. Like most people I chose a stable career but I do miss the creative process substantially.\n\nUpon further research I am not the only adult who feels they have lost their creative mojo. In fact, most adults do. Tim Urban mentions the effect of the education system on creativity in his blog:\n\n*In the 1960s, a creative performance researcher named George Land conducted a study of 1,600 five-year-olds and 98 percent of the children scored in the “highly creative” range. Dr. Land re-tested each subject during five year increments. When the same children were 10-years-old, only 30 percent scored in the highly creative range. This number dropped to 12 percent by age 15 and just 2 percent by age 25. As the children grew into adults they effectively had the creativity trained out of them. In the words of Dr. Land, “non-creative behavior is learned.”*\n\n[Link](https://waitbutwhy.com/2015/11/the-cook-and-the-chef-musks-secret-sauce.html)\n\nSo, as an adult, how should I relearn the skill of creativity? Is it just a matter of mindset change or is there another factor to it?",
        "created_utc": 1674048678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing a Novel Script vs Research Manuscript",
        "author": "DangerousRise3225",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f6xu5/writing_a_novel_script_vs_research_manuscript/",
        "text": "Which script is more hassle and exhausting to brainstorm? Writing a Novel or Thesis?",
        "created_utc": 1674047112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work address/Private address on application form: what to use?",
        "author": "MadameMasonDevotee",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f3z61/work_addressprivate_address_on_application_form/",
        "text": "Hello,\n\nSo I am applying for a short term postdoc (3 months) in Germany and on the form they ask me for a work address and a private address.\n\nI am currently an associate member of a German research institute but I am not residing there  (I live in Italy atm): should I put the address of the institution as the work address and my Italian address as the private one, or should I just put the Italian address for both?\n\nThe German institution is very prestigious and would be a great affiliation to show on the application form (my referee is from that institution), but I don't know whether it would be proper since I could not receive mail there, nor I have an office and so on.\n\nThanks!",
        "created_utc": 1674037217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is having publications irrelevant to my field of interest useful for getting into a funded PhD program?",
        "author": "0ian",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f3qc6/is_having_publications_irrelevant_to_my_field_of/",
        "text": "My background is something related to animal science and/or food science. I have publications around those areas. However my interest is to get into cancer research and (human/medical) biotech.\n\nI have graduated (MSc) and my thesis is not related to my field of interest. After graduation, I worked with my PI and have publications irrelevant to biotech. He wants me to work with him again on a similar research project, but I'm not sure if that would add any value to my CV.\n\nI want to get into biotech, and I want to get a PhD, but I can't afford a PhD program unless it's funded.\n\nAre irrelevant publications useful? Am I wasting my time if I keep doing this?\nShould I tell him \"no\", start again and get another MSc degree, or keep working on irrelevant topics hoping they'll help me get a funded PhD position?",
        "created_utc": 1674036301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should you announce your research internship positions on LinkedIn/social media?",
        "author": "desi_estudante",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f3ogb/should_you_announce_your_research_internship/",
        "text": "I recently started working as an intern at a fancy American University. The position in reality is nothing fancy. Just a small internship. But there is an itch in my brain to receive some validation and praise from peers. None of which would mean it, and everything is artificial. I get that.\n\nHowever, I just want to feel good about myself. Are there any downsides that I am not getting right now?",
        "created_utc": 1674036102,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Need Some Help On This Semi-Controversial Paper",
        "author": "nonthephenomenon",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f2bzl/i_need_some_help_on_this_semicontroversial_paper/",
        "text": "I have a research paper that I need to write for English class and our teacher said we could report about whatever topic we're interested in. (Just for everyone to know beforehand I go to a Christian private school) and I decided that I wanted to write my paper about the dark side of Christianity and about all the stuff most teens in my school might not know yet: Sexual abuse from pastors, Homosexuality is not a sin at all, how Christians can be very arrogant, corrupt pastors etc. This topic I chose has a lot of sides and a lot of branches to it and I just can't seem to put my finger on how I could discuss all of these sources in one paper. Another important issue I have is where must I find the right sources? I found multiple online but I want to show much more evidence about this topic, especially on the homosexuality part, I'm scared of writing my paper including this and was thinking of actually leaving it out but this is my only chance to write about it and I need a lot of sources to prove my case. Documentaries, studies, stories, articles, YouTube videos, anything that has relevant information can help, thankyou.",
        "created_utc": 1674030859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tplink Archer Ax50",
        "author": "Much_Ruin_2278",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f1iam/tplink_archer_ax50/",
        "text": "[removed]",
        "created_utc": 1674027647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adjusting to a very noisy environment?",
        "author": "Responsible-Oil-9884",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10f10zn/adjusting_to_a_very_noisy_environment/",
        "text": "I'm wondering if anyone here has ever happily and healthily done academic work in a very noisy environment after having come from a very quiet one. I've just moved to a place which is otherwise perfect, but it's like there are no walls at all. I'm barely exaggerating. I've lived in some loud major cities and had some terrible neighbours (and even been a bad neighbour myself, oops) but I've experienced nothing like this. My tricks don't work. Running a white noise machine AND white noise in my QC35 Bose at max volume is just about enough to drown it out, but that's just more noise. There is constant loud ambient noise: machinery outside, children screaming, karaoke. I'm on the 6th floor but I hear any raised voice outside with almost perfect clarity. (Mercifully I don't understand the language yet so it doesn't register as information, but, I mean, I intend to learn the language lol!) Normally it gets silent at around 23:00 (the latest karaoke has gone so far was a little past 1:00) but that doesn't really help me if I want to work during the day. Highly doubt I can realistically soundproof since the problem is sliding glass doors and windows (although I'll look into it, I doubt it). Coffee shops/libraries/workspaces aren't an option. I've lived in noisy places but just came from staying with my family in the building I grew up with, which is almost silent, so when I got here I kind of threw a hissy fit. But a lot is at stake with me being here and it would be very hard to leave (housing contract, employment contract--I'm not in academia, visa!, an otherwise excellent building/neighbourhood/environment/city/job).\n\nI wanted to hear if anyone has ever sincerely in their hearts adjusted to such a situation or if I should just throw in the towel and break lease and risk my visa and a whole bunch of other things because there is no way for me to be productive like this. I was ready to do all of that because the whole point of the lifestyle I'm trying to build is to not compromise on quiet, contemplative work. But over the last few days I've noticed myself tune things out a little? I'm wondering if quiet is a prerequisite for good, profound work &amp; thinking. I'm not asking if it's strictly possible to get things done in such an environment, obviously you can tough anything out for a while, I'm asking if I can really feel at peace here. A friend of mine said that on the contrary, he needs noise to work and goes crazy in the countryside. But my question is whether you've undergone a change in your preferences and what you're able to tolerate happily.",
        "created_utc": 1674025887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!! Is it appropriate to ask this professor for a letter of rec?",
        "author": "moot-foot",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ezyab/help_is_it_appropriate_to_ask_this_professor_for/",
        "text": "I’m applying for this program that requires a letter of rec from a professor. Unfortunately, i didn’t really get to know any of my professors last semester ( which is definitely my fault and something I hope to improve on in the future) but what’s done is done and I need to obtain a letter of rec soon. I did form a pretty meaningful connection with another faculty member though and we frequently talked about his research throughout the last 4-5 months. He even invited me to see his lab!! He eventually asked if i was willing to join his lab this semester which i was really excited about. I was thinking about asking him to write me a letter of rec. Even though I’ve never been in his class and he hasn’t really seen my academic work, would it be okay to ask him? Also I literally just joined his lab so I haven’t really experienced working with him yet so i dont know if it’s right to ask him. I don’t know!! I’m panicking!! But this is the draft of the email im planning on sending. \n\nEmail Draft:\n\nHi Dr Blank, \n\nI have something I really hope you are able to help me with. I'm currently applying to Blank and I'm seeking a letter of recommendation. This is the only research opportunity close to home-- I find it important to stay close to home this summer in particular due to my family obligations.\n\nIt's unfortunate I wasn't able to get involved in your lab sooner, I truly would've preferred to work with you more before making a request like this, but I hope you understand the timing of this opportunity. \n\nI'm extremely grateful for the chance to get to know you and your research over the past few months, you truly provided me with a clearer vision of what I want to pursue. I appreciate your consideration regardless of your ability to write a letter. \n\nWarmly,\nMy name",
        "created_utc": 1674022215,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle inappropriate colleague who does no work?",
        "author": "yagirlleens_33",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10eycwx/how_to_handle_inappropriate_colleague_who_does_no/",
        "text": "I’m a first year masters student. Due to the nature of my program, 80% of our work is group work. Last semester I was put into 2 groups that included 1 particular student. And this semester I’m in another group with him. \n\nThis is an older international student who does not contribute in any way to our group work. He sleeps through meetings, shows up 2 hours late to a 4 hour class, says because English is not his first language that we need to write his presentation parts for him and skates by getting the same mark when we do all the work. He already has a phd from his home country so we know he’s not unintelligent and we have other international students with language barriers that still manage to contribute to the work. And he’s been here for almost 5 years.\n\nI’ve spoken to him personally and he said he’s only in the program to find a girlfriend and get a job as our program has a mandatory coop placement. We’ve brought up concerns with our profs and they recognize that they know he’s doing this but say their hands are tied by the director of the program and they say just to give him a lower mark on our group evaluations. \n\nI spoke to the director (a white women) and she scolded me (a bipoc women) for not being welcoming to other minority students and accused our cohort of being cliquey bc no one wants to work with him. He also says questionable things to the women in our program. For example, I wore a dress once and he asked if I had a boyfriend and that if I do, he’s lucky because my legs are beautiful and shapely.\n\nToday we had to present a progress report on a research project we’re working on and he just didn’t show up to class. An hour into class he msged and said he wouldn’t be there and to present his part for him which we were not prepared for.\n  \nOfc I empathize that it’s challenging being an older student in a completely different culture but that doesn’t mean that we should not be able to hold him to certain standards. Any advice on how to navigate this?",
        "created_utc": 1674017316,
        "upvote_ratio": 1.0
    },
    {
        "title": "IB Chemistry IA",
        "author": "ScholarBae",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10evq1l/ib_chemistry_ia/",
        "text": "I’m thinking about doing my IA on something about radon using a spectrometry. Has anyone done/seen anything similar? Where can I find past IB IAs?\n\nThanks everyone!",
        "created_utc": 1674009775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished my New Grad Job Hunt and I’m Exhausted (119 apps -&gt; 4 offers)",
        "author": "unsaturatedgoods",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10eth61/finished_my_new_grad_job_hunt_and_im_exhausted/",
        "text": "Hey all! My college career is coming to an end and I wrapped my NG job hunt during these crazy times and I wanted to share my experience.\n\n**applications**: 119, used [this](https://github.com/coderQuad/New-Grad-Positions-2023) Github repo to find all my jobs.\n\n**prep**: blind 75, neetcode, and company specific questions w/ lc premium\n\n**background**: cs undergrad @ purdue, 3 internships (2x JPMC, 1x Textron), teaching assistant, 3.8 GPA\n\nI added a video [here](https://youtu.be/tz-3Ho29yN8) for those that don't want to read (mods lmk if this isn't allowed and I'll remove it).\n\n**applied/ghost (51/119):**\n\nNothing much to talk about other than rip me thinking I had a chance to pass the resume screen for some of these companies. Some of the notable companies that I haven’t heard back from are Databricks, Google, Apple, Datadog, Netflix, Uber, Twitter (ty for ghosting me Elon in hindsight), Oracle, and PayPal.\n\n**in progress (6/119):**\n\nI probably got ghosted by all of these companies as well tbh\n\n* Morgan Stanley haven’t reached out after their HireVue\n* submitted a perfect OA for Blackrock &amp; matched with them on Ripplematch\n* did mediocre on TikTok’s OA, so not surprised\n\n**rejected (58/119):**\n\nFirst, I declined interviews for 11 companies (IMC, Vanguard, Walmart, Gap, Hive AI, etc). This was because i wasn’t fond of the interview style (ehmm IMC's one way interview) or i didn’t want to commit my time for on-sites.\n\nAnother 11 companies rejected me because their headcounts were filled for the recruiting season (C1, Figma, Pinterest, Visa, Roblox, etc). I applied as quickly as i can for these companies, so I guess my resume wasn’t strong enough to get picked\n\nNext, I got rejected from 13 companies after at least one round of interviews/OAs. I had an 813 codesignal score, but it wasn't enough for companies like Circle and ZipRecruiter. I submitted a perfect OA for Goldman Sachs and had a recruiter reach out to me, so I don’t know what went wrong there. SpaceX’s assessment was only offered Python or C++ and I use Java for my interviews, so that didn’t turn out well. For Palantir, DraftKings, FactSet, etc, I submitted terrible OAs, so I wasn't surprised getting rejected. Finally, I got rejected after my final round of Mathworks. I got asked a system design question, and didn’t prepare for that, so again, wasn’t surprised getting rejected.\n\nFinally, i got rejected from 23 companies after the resume screen (Microsoft, Adobe, Scale AI, Zoom, Twilio, Doordash, Lucid, Niantic, etc)\n\n**offers (4/119):**\n\nFinally, the part most of you guys probably were interested in.\n\n**JPMorgan Chase &amp; Co.**\n* First, I was able to get a return offer from my internship at JPMC. A pro with banks is that for the most part they are pretty recession proof. The compensation package was 110k base, 20k sign-on, and 10k performance. 140k 1st yr and 120k reoccurring\n\n**StubHub**\n* Their process was a behavioral phone round, a technical interview, and a final demo presentation. I’d say the technical interview was trivial given that you know your data structures. The final was like me being on Shark Tank, so it definitely was a bit weird, as I was expecting a technical interview. After negotiating with StubHub, I was able to get an offer of $170k base, $320k RSUs split evenly across 4 years, and a 10k sign-on. The tc was 260k for the first year, and 250k reoccurring. Before you guys go crazy, the TC is a bit misleading, as StubHub is still a private company, so till then, the stock is paper money. Moreover, with the current state of the economy, i personally don’t think they will IPO any time soon.\n\n**General Motors**\n* The process was 2 rounds, a hirevue and a final round that only consisted of behavioral questions. Their compensation package was Base: $87k Bonus: 10% of base Sign-on: $5k TC: $100.7k (1st year), $95.7k (reoccurring). So, if you guys don’t like technical interviews, make sure to apply to general motors. Their process also took around 3 weeks.\n\n**Bloomberg (accepted)**\n* Their process was a technical phone interview, a virtual onsite consisting of 2 technicals and 1 behavioral round. For me, solving Bloomberg tagged questions on leetcode was enough prep for me. After negotiating, I was able to get an offer of $155k base, 30k bonus, and 10k relocation bonus. So, the tc was 195k first year, then 185k reoccurring. Their process took around 2 months, and this was apparently due to a lot of people applying.\n\n**final thoughts:**\n\n* Definitely apply as fast as you can, as much as you can. I hate to say it, but at the end of the day it’s a numbers game\n* [Join](https://discord.com/invite/cscareers) cscareers.dev’s discord server so that you can connect with other new grads. They definitely helped me secure valuable information.\n* Leetcode. I think getting lc premium for the duration of your job search is worth it bc it allows access to see specific company’s questions. Think of it as an investment to yourself and it’ll pay off when you get an offer.\n\nlmk if you guys have any questions, and I'll try to answer as many as I can!",
        "created_utc": 1674003787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online learning platform contracts at a public university",
        "author": "rhymes_like__dimes",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10esn8c/online_learning_platform_contracts_at_a_public/",
        "text": "Does anyone have information about the process of contract negotiations between nursing schools and these OPMs (online program management) like ATI and coursepoint? I go to a public institution and we are paying so much out of pocket for access to these platforms that it raises our total tuition costs by about 50%. On it’s face it seems unethical for a public school to outsource so much education management to a private company, but I’m also wondering if the administrators at the school are receiving financial or other types of incentives. I’d be grateful for anything you know, even if it’s anecdotal! Thank you &lt;3",
        "created_utc": 1674001672,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was accused of plagiarism",
        "author": "Poodlepotato",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10es4h4/i_was_accused_of_plagiarism/",
        "text": "I received an e-mail today from my teacher stating that I had plagiarized one set of reading questions. The only reason I received this e-mail was because I had been e-mailing teachers in the department for almost a month, asking why I was the only student that had yet to receive a final grade in this course. This e-mail came as a huge shock to me. I also don't understand why he didn't tell me about this when he found out so I could explain what happened. I asked the teacher to clarify how I had plagiarized and he said I had turned in another student's work. This is simply not true. \n\nWhat happened was that I did indeed receive answers from another student to help me understand the assignment. Subsequently, I answered the questions myself with paraphrasing but I stupidly answered the questions in the same document the student sent me so the student's name ended up being at the top of the document when I turned it in. \n\nWhat can I do? I have explained this to the professor and I am still waiting for a reply. I am so scared that my whole career in academia is over now. No one will want to work with someone that has been accused of plagiarism. I had no ill intent whatsoever. I will never put myself in a situation like this again. I want to pursue a Phd but I fear it will not be possible anymore. I am absolutely devastated.",
        "created_utc": 1674000388,
        "upvote_ratio": 1.0
    },
    {
        "title": "If an instructional assistant professor is listed as promotion eligible, what would that promoted position potentially be?",
        "author": "stackofwits",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10erpl2/if_an_instructional_assistant_professor_is_listed/",
        "text": "Would this lead to performing research, getting tenure, etc.? I’m sorry if this is a naive or stupid question - I’m a first generation. I’ve already emailed to ask but wanted your opinions as well. Thanks in advance!",
        "created_utc": 1673999396,
        "upvote_ratio": 1.0
    },
    {
        "title": "What might happened when my professor agreed to write me a letter of recommendation but keep ignoring my email and it's 2 weeks from deadline already? [STEM, 2023, US -&gt; Canada]",
        "author": "AlassesLome",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ep6r0/what_might_happened_when_my_professor_agreed_to/",
        "text": "I'm currently applying to graduate school, and previously I asked one of my undergraduate professor to write me a LoR, and he agreed. Later on during winter break he told me he will finish my letter during the break. But he keep ignoring my email since the spring term started last week, I sent him 2 follow ups as reminder of all application deadline a week ago, and 1 separate email to ask if he had any problem on writing the letter for me and if anything I can help at beginning of this week. All email sent out recently got no responses, I even send him a message on LinkedIn, I assume he definitely saw that message since he updated some activities on LinkedIn. \n\nFor back-up plan, I already emailed another professor to check if she can help me with the LoR instead. I'm not sure if I should go talk to the professor ignoring my email, and I'd really like to know if anyone had similar experience with me and what could be happening here?",
        "created_utc": 1673993390,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an army?",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10eozi9/what_is_an_army/",
        "text": "[removed]",
        "created_utc": 1673992918,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Meta?",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10eox7t/what_is_meta/",
        "text": "[removed]",
        "created_utc": 1673992792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving from PhD to postdoc - what is something you wish you knew at the time but you didn't?",
        "author": "Razkolnik_ova",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10enlg0/moving_from_phd_to_postdoc_what_is_something_you/",
        "text": "Share away! :) Thanks in advance to all.\n\nMy field is clinical neuroscience/neurology. I'm doing a PhD in the UK at the moment.",
        "created_utc": 1673989716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find visiting scholar positions?",
        "author": "dizznik",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10encfh/where_can_i_find_visiting_scholar_positions/",
        "text": "I am interested in being a visiting scholar at a business school overseas for the summer. Does anyone know if there is a resource with a list of positions? Or do I have to check with individual schools?\n\nThanks!",
        "created_utc": 1673989155,
        "upvote_ratio": 1.0
    },
    {
        "title": "COLLEGE STUDENTS",
        "author": "toiletbombb",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ekq7n/college_students/",
        "text": "[removed]",
        "created_utc": 1673983103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got My First Doctoral Rejection Letter :(",
        "author": "caitdiditagain",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ekbfw/got_my_first_doctoral_rejection_letter/",
        "text": "So I got rejected from this school I applied to for the fall and it has me really nervous about the other application I submitted. (Side note: I only applied to two schools because apps fees are ridiculously expensive &amp; I couldn’t get approved to waive the fees). \n\nMy question is, for the other school I applied to would it be wise to reach out to a direct advisor of the program to show them that interested? You know put my foot out there so to speak. \n\nLately, I’ve been getting rejection emails from job positions I’ve applied to and now this just adds to my constant feelings of failure and hopelessness.",
        "created_utc": 1673982127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit Professors: When you were an undergrad, did you think about your profs, \"there is no way I could know as much / be as smart as this prof\"? and how have things changed?",
        "author": "RevenueStatus8869",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ei8gp/reddit_professors_when_you_were_an_undergrad_did/",
        "text": "I mean the idea that the professors would need knowledge beyond what most average college students have to teach could possibly mean that they are smart? or am i being to narrow minded.",
        "created_utc": 1673977235,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask my supervisor for a PhD?",
        "author": "Lotar31",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ehbts/how_to_ask_my_supervisor_for_a_phd/",
        "text": "I am currently doing my Master thesis (Biology) in a group, and I plan on pursuing PhD afterwards. So far I enjoy working here. So I wouldn't mind at all to do a PhD with them as well.\n\nWhat would be the best way to ask my supervisor regarding the prospect of doing a PhD? What are the Do's or Don'ts?",
        "created_utc": 1673975082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hot vs cold research area",
        "author": "Herschel132",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10eewqh/hot_vs_cold_research_area/",
        "text": "For an early career researcher, is it generally better to work in a 'hot' research area or 'cold' research area? By 'hot' I mean a research area that multiple groups (5+) are working on, and 'cold' only maybe 1-2 groups are working on.\n\nIt seems to me a hot research idea is less advantageous as there will be more competition when it comes to publishing, and the advantages I can think of (like easier to obtain funding) generally don't apply to the early career researcher doing the work and trying to get papers published? \n\nFor context my own experience so far have been in relatively 'cold' research areas, but I have the opportunity to transfer to a 'hot' research area.",
        "created_utc": 1673969108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any CS PhD's here with an open position in their lab?",
        "author": "acageinsearchofabird",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10eekae/are_there_any_cs_phds_here_with_an_open_position/",
        "text": "I'm an Indian CS student looking for a research internship of 3-6 months from August 2024. I'm interested in systems research, but I have experience in machine learning too.",
        "created_utc": 1673968207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literature review and overal confused",
        "author": "rosejsj",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ee8dp/literature_review_and_overal_confused/",
        "text": "Help with lit review\n\nI don’t know whether this is the right place to ask. I have 5 days to finish my thesis. \n\nI’m stuck with the lit review. I think I have allowed myself to change the thesis question/statement too many times which caused a lot of confusion.\n\nI have to write a thesis based on labour mismatch. We have a big database we are supposed to use. I want to see what the effect of being a first or second generation immigrant is on labour mismatch. \n\nShould I find an article that already supports what it is that I’m doing? Should I find articles that show me other aspects that have an effect on labour mismatch such as country of origin etc? Should I find articles that show me how to analyse? I lost the plot, completely lost it and this is my last chance. \n\nAlso should I already find the methodology? They mentioned some theories we could use such as human capital theory, should I already mention that one in lit review or should I find something about it? Or is that for the methodology? \n\nI don’t know where it goes wrong in my brain or why it doesn’t make sense.",
        "created_utc": 1673967380,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Closely to the Accepted Abstract Does a Conference Presentation Need to Adhere?",
        "author": "cherrycitrea",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ed5py/how_closely_to_the_accepted_abstract_does_a/",
        "text": "I submitted an abstract to a conference a couple months back and it was accepted. At the time of submitting the abstract, I had approximately zero words of the paper written (I recognize this was probably not the wisest choice). Now that I am writing the paper and preparing for the presentation, my paper is veering a little away from the exact outline of the abstract. I still cover both the topics I state I will address in my accepted abstract, I just change the emphasis I put on the two topics. That is, the abstract I submitted made it sound like I would talk 60% about Topic A and 40% about Topic B while the actual paper is turning out to be 60% Topic B and 40% Topic A. \n\nWill the conference organizers be upset if I don't deliver exactly what it sounded like I was going to deliver in my abstract?",
        "created_utc": 1673964559,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Meta?",
        "author": "likelytoday",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ecmlm/what_is_meta/",
        "text": "[removed]",
        "created_utc": 1673963114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working as research assistant for two months on a new project",
        "author": "MortalSquid",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ebm8o/working_as_research_assistant_for_two_months_on_a/",
        "text": "Been working on project and details of the job were catfished.\n\nHi all,\n\nI work for my old university where an old professor contacted me and asked if I would be available for a job regarding research assistant, to where he gave me more info.\n\nHe left teaching to work for a company that is partnered with my old university to connect  and provide startups with research assistants, and other marketing needs etc.\n\nI was told the pay would be £20 an hour for 20 hours a week, with the hiring agency deducting £2-3 so the final pay would be £16-17 hourly. It is now only £14.19. A pay rise is not part of the equation, and I automatically need to input the hours I worked in a week, with approval pending up to two weeks for some. I only received my contract a month after starting, and now,  2 months in, I have been contacted by a company which I applied for that works with my mother's company (she doesn't own it, just works there) and have received an offer for the job.\n\nHaving said that, I would like to inform my hiring manager that I'd like to quit, due to having been lied to about certain details of the job. What would be the best way to go about it? I am currently the only research assistant that is part of the team and the others are just there to monitor the meeting between myself and the head of the project. My professor is also present in meeting but has no major impact or input.\n\nMany thanks",
        "created_utc": 1673960185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please talk to me?",
        "author": "TheUndergiver",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e9lhp/can_someone_please_talk_to_me/",
        "text": "I’m having a breakdown. PhD related.",
        "created_utc": 1673953450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do extracurricular activities during your PhD matter when applying for postdocs?",
        "author": "Razkolnik_ova",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e8n5p/do_extracurricular_activities_during_your_phd/",
        "text": "We all hear about publications being the most important thing, creating a good network, attending a good program. I wonder if those of you who have been through postdoc applications can shed light on the question in the title: does doing extra stuff during your PhD matter for after? I'm at a Russel group university in the UK, clinical neuroscience as a field, but had an option to attend Oxbridge that could not materialize. I am trying to make the most of my current program (perhaps to compensate to some extent, as the whole thing has been bothering me mentally); I am the class rep of my cohort, I did and will do a few external data academies/camps (allowed on my DTP), I might spend some time abroad as we have an external partnering institution, etc., I basically keep busy and try to take opportunities as I go.\n\nDoes that even matter for postdoc applications (mostly in the UK, I don't mean internationally so much)?",
        "created_utc": 1673949926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I have to repay the allowance I received when I drop out ?",
        "author": "Soggy_Ad6925",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e7jvs/do_i_have_to_repay_the_allowance_i_received_when/",
        "text": "Hi everyone, I have to drop out from a PhD program in South Australia to go back to my country to support my family (I cannot rearrange it) . I started my program just under 3 months.\n\nI read from conditions of award (basically it's an RTP scholarship) file, it states:\n\n&gt; Scholarship recipients who wish to intermit or suspend their studies must complete the request in the PhD management system and submit it at least four weeks before the *proposed change*.   \n&gt;  \n&gt;Scholarship recipients who suspend their studies without the approval of the HDR Scholarships Committee will be required to repay *any award payments to which they were not entitled.*\n\nI don't know what is the *proposed change* here means?\n\nAnd what is *which they were not entitled* ?\n\nI already spent a lot for the trip and settlement to Australia so I mean if I have to repay all, then it's a huge lost for me. So I'm really worried about this before deciding to tell to my supervisor.",
        "created_utc": 1673945910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Error in work",
        "author": "Lyrebird_korea",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e6wcf/error_in_work/",
        "text": "\\[Rant\\]\n\nSeveral years ago, I reviewed a manuscript that claimed to measure a specific substance in the human body. They performed measurements on healthy subjects who have this substance and people with a specific disease who did not have the substance, and they confirmed their results on the isolated substance, in vitro. The results presented in the manuscript were clear and conclusive, and it was subsequently accepted for publication. Later, several other papers on the same topic were also published.\n\nI then conducted my own experiments using a similar setup to measure the substance in humans and found that this setup did not accurately measure the substance. We tested both younger and older subjects and found that the signal associated with the substance only appeared in a few older subjects and not in younger ones. This contradicts the original premise that any normal healthy person has the substance. We carefully worded our conclusion in light of this.\n\nIt was difficult to get the results published, partly due to errors in my own analysis, but after several rejections, the paper was eventually accepted and published. However, it was largely ignored by others in the field. Recently, the original group published another paper on the subject, but they have now watered down their original claim that the signal they measured was associated with the substance. My work was not referenced in the paper. They now claim it could also be associated with \"similar substances\".\n\nIn the meantime, I continued my research on the topic and discovered that the signal is actually associated with a very different substance. I have evidence from a larger group of well-characterized subjects, and I have a good explanation for why the signal is associated with this different substance. My conclusion is that the original group either fabricated their data or were extremely unlucky that it did appear in the healthy subjects and not in the subjects with the disease, and that the signal popped up when measuring the substance in vitro. That is the scientist in me speaking; looking at their track record, they fabricated their results.\n\nThis is an extremely small field. It is likely that my new work will be closely scrutinized by the authors of the first manuscript. In previous work, I have tried to exclude them as reviewers by pointing out to editors that they have a conflict of interest, but this is ignored, probably because there are only a few reviewers who can review the work. Their default is to reject anything that I submit for review. Not *resubmit with (mandatory) revisions*, but *reject* (typically accompanied by a putdown message such as: \"This work does not contribute anything new to the field\" and pointing at their own published results).\n\n\\[/Rant\\]\n\n&amp;#x200B;\n\n1. How do I get my own work published?\n2. How do I tell the journal of the original article that there was a mistake in the first paper (and follow-up papers), without getting beaten up at the next conference by this group?",
        "created_utc": 1673943439,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long before your expected PhD defense or graduation do you apply for jobs or post docs?",
        "author": "pennylane4444",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e4roa/how_long_before_your_expected_phd_defense_or/",
        "text": "I’m ideally looking for research positions or government science positions though I’m not ruling out industry. (I’m not interested in long term academia like a professorship down the line.) I am hoping to defend next year and want to have a job lined up but I recognize it’s unreasonable to apply this summer and then ask them to hold the position for me for a year.",
        "created_utc": 1673935829,
        "upvote_ratio": 0.99
    },
    {
        "title": "Do you all think it would be appropriate to text a professor I haven't talked to in almost a year a question about grad school when they gave me their number?",
        "author": "minimalmaple28",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e3rok/do_you_all_think_it_would_be_appropriate_to_text/",
        "text": "I did a bit of research with this professor about a year ago, but have not had any sort of relationship with them since. While I was doing research with them, they gave me their number. I am currently waiting to hear back from the grad school at my university about being admitted to a Masters program, and I have narrowed it so that this specific professor is one I would want as my advisor/mentor for the Masters. Do you all think it would be appropriate for me to text them, reintroduce myself, and ask to meet or call so I can ask them some questions about their program?",
        "created_utc": 1673932639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coursework-based Masters Pathway to PhD? (Public Policy)",
        "author": "Important_Welder_268",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e2phx/courseworkbased_masters_pathway_to_phd_public/",
        "text": "I'm looking to begin a Masters in Public Policy in Victoria, Australia. I have two questions regarding my pathway.\n\nCurrently, I'm unsure if I should apply for a Masters by research or by coursework. I would eventually like to work in academia, so I am prepared to do a PhD, however the Masters by coursework is significantly shorter (1 year instead of 2), and would allow me to start my career in government faster. \n\nAlso, I am having trouble deciding between two universities. One is regarded as one of the best in the state, although if I were to be accepted, I'm unsure if I would be good enough to be accepted into a PhD pathway. The other is the school I finished my bachelors at, and I believe I would see better results. However, it is regarded as more of a mid-tier school, not bad by any means, but not near the top. \n\nTLDR my questions are:\n\nA.) Would not doing a Masters thesis eventually hurt my chances at getting accepted into a PhD program or should I just choose the faster (and cheaper) option?\n\nB.) Should I try to complete my degree at a well-regarded university where I'm not 100% sure I will receive great marks (and may not be accepted into the PhD program), or should I stay at the university I completed my bachelors at?\n\nThanks in advance and sorry if some things aren't quite clear, I have trouble wording stuff like this sometimes.",
        "created_utc": 1673929449,
        "upvote_ratio": 1.0
    },
    {
        "title": "where can a indian mechanical engineer pursue his PG in abroad?",
        "author": "AswinRCR",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e2981/where_can_a_indian_mechanical_engineer_pursue_his/",
        "text": "I need a clarification about my career",
        "created_utc": 1673928113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Retrospective Ethics Approval for Publication",
        "author": "katchibird",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e0q5w/retrospective_ethics_approval_for_publication/",
        "text": "Hi all!\n\nI am currently a Master’s student from the U.S. studying at a university overseas in Korea. My research involved interviews (on a sensitive subject, at that) which under normal circumstances I know would have required IRB approval. \n\nThroughout this process and long before I conducted any of the research, I have questioned my advisor time and time again regarding the ethics approval requirements and specified that beyond fulfilling thesis requirements for graduation I have had the intent to publish. Long story short, my current institution lacks any ethical approval board or approval process for research involving human subjects; the only board in place simply reviews academic misconduct. I wish I was joking!\n\nI have written and signed consent forms from interviewees that followed the precedent of other students with similar methodology, but as far as I know none of these students have attempted to publish.\n\nI presented my work at a symposium a few weeks back and have since been extended an offer for publication. I reviewed the journal’s policies and it looks like they will be requesting some sort of ethics approval documentation - if not IRB, then whatever board the researcher’s institution has in place. \n\nI reached out to the chair of my department as one last cry for help and the simple answer was I’ll have to simply “wait and see” in the peer review process and that “it reflects poorly on the institution’s part, but there is nothing to be done.” I am assuming my paper will have to go through some sort of retrospective ethics review in the coming months.\n\nSo my question is, if anyone is familiar with this process, what can I expect and what does a retrospective ethics approval entail exactly?",
        "created_utc": 1673923799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone filed a formal complaint against a professor and won?",
        "author": "ItsAllAGame_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10e0lfq/anyone_filed_a_formal_complaint_against_a/",
        "text": "My cohort is considering filing a grievance with the university ombudsman for a professor who has committed multiple code of conduct violations. Of course no one wants to face retaliation so they can finish the program. \n\nI was just wondering if anyone has had success filing a formal complaint (maybe even anonymously).",
        "created_utc": 1673923423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is software architecture a specialisation?",
        "author": "Wild_Dragonfruit1744",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10dzi08/is_software_architecture_a_specialisation/",
        "text": "I have been working as a developer for past 3 years, there is a lot of weightage given to architecture, experienced people become software architects, is this a specialisation which can be learnt, are masters more focused on architecture ?",
        "created_utc": 1673920457,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just quit teaching after 25 years",
        "author": "rjhinkle",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10dz4qi/i_just_quit_teaching_after_25_years/",
        "text": "During and after the pandemic students changed. There is no longer a care about getting an education. Parents just want you to pass them, and administration is working for parent donations. My latest district screwed up my benefits so I have been without healthcare for 5 months. Why does anyone want to do this job anymore?",
        "created_utc": 1673919472,
        "upvote_ratio": 1.0
    }
]