[
    {
        "title": "Because of the subtle differences and non-direct translations, would you be a different person/think differently if every factor was the same apart from the language you were raised with when growing up?",
        "author": "random252329",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zvelp/because_of_the_subtle_differences_and_nondirect/",
        "text": "",
        "created_utc": 1531919787,
        "upvote_ratio": ""
    },
    {
        "title": "Are films about anthropology \"bad\" because we are a bunch of jerks who critique each other as is and therefore there is no good way to do it?",
        "author": "hockeyrugby",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zs3qv/are_films_about_anthropology_bad_because_we_are_a/",
        "text": "[removed]",
        "created_utc": 1531885974,
        "upvote_ratio": ""
    },
    {
        "title": "What is the earliest evidence for war?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zrund/what_is_the_earliest_evidence_for_war/",
        "text": "There is some debate as to whether war predated the earliest villages and agriculture around 11,000 years before present. I am aware of 1 site in Nubia (Wendorf) that dates to about 13,000 years before present. Is there anything convincing for hunter/gatherers that is earlier?",
        "created_utc": 1531883646,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't Americans like American folk tales?",
        "author": "meradorm",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zqnap/why_dont_americans_like_american_folk_tales/",
        "text": "A couple of things have been eating me lately.\n\na) American folklore appears to me to be strongly focused on people in working class professions, like lumberjacks or railroad workers, but working class people don't seem to be held in quite the same esteem anymore in real life. (I guess this is subjective, and it may be entirely unrelated to the answer to this question, but I was wondering if it was connected and this is the thought that inspired me to ask.)\n\nb) As an American, I can say with some confidence that we really like fairy tales and folk tales in our entertainment. Disney movies, comedic or more adult retellings of popular stories like Cinderella and Snow White, Bluebeard retakes, they're everywhere. But these stories are European imports. While obviously they're firmly embedded in American culture due to immigrants from Europe taking their stories with them, and so they don't seem particularly foreign, they're still European in origin, and we seem to be much less interested in stories that are *specifically* homegrown American - that is, I don't hear much about Pecos Bill or Paul Bunyan, and I have trouble recalling any stories about these figures off the top of my head. On the other hand, if presented with a five-year-old, I could easily tell her Rumpelstiltskin and the Princess and the Pea and whatever else she'd like to hear.\n\n(Obviously this is just my personal experience, but to me it appears to be the case for many Americans.)\n\nc) We really like our cryptids. We've maintained a healthy interest in Bigfoot and Mothman and so on, but not the human beings. I don't know if it's because frontier outlaws and mountain men are unrelatable to a modern audience, because I figure that if that's the case then knights and princesses should be unrelatable too.\n\nSo, why are only the European folk tales remaining a major part of our culture?",
        "created_utc": 1531873442,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many creation myths have their divine beings making \"beta\" versions of humanity?",
        "author": "Neato_Orpheus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zq6wd/why_do_so_many_creation_myths_have_their_divine/",
        "text": "I don't know if this is a askanthropolgy question but I will try it here.\n\nI have noticed that a lot of creation myths have their gods creating (or attempting to create) different versions of humanity before settling on what is the current version. \n\nThe greeks had the men of gold, the men of silver and the men of iron. Theirs were all downgrades\n\nThe Mayans had a similar type of progression but theirs were upgrades\n\nChinese creation myths also have these failed attempts.\n\nIs there some underlying reason for this?",
        "created_utc": 1531869817,
        "upvote_ratio": ""
    },
    {
        "title": "Graduate School Transition (Public Health -&gt; Anthropology)",
        "author": "RamaLama787",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zmott/graduate_school_transition_public_health/",
        "text": "Hello everyone, I had a question: Would it be possible to transition from public health to anthropology for graduate school? I currently am in a B.S. program for Public Health with a minor in anthropology. Double majoring would be very difficult at this point, but I enjoy the theoretical nature of anthropology and have been helping with an anthropological related project through the college of public health. Would medical anthropology programs consider me a viable candidate? If not, what could I do to reach that point?",
        "created_utc": 1531845412,
        "upvote_ratio": ""
    },
    {
        "title": "Are cities categorized by 'generations'?",
        "author": "UTFan23",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zm5kt/are_cities_categorized_by_generations/",
        "text": "My boss told me to look at comparable \"first generation cities\" and used Seattle and San Diego as examples of first generation cities. When I google \"first generation cities\" and \"city generations\" I get mostly articles about generations of humans and their relationship with cities (ex. \"Babyboomers prefer Suburbs to Urban areas\"). \n\nCan anyone give me some more info on this? Is there another name for this that I should be googling instead? I'm ideally looking for a list of 1st gen cities, 2nd gen cities, 3rd gen cities etc.",
        "created_utc": 1531841760,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any Megaliths in the US?",
        "author": "LionelSlothrop",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zl4in/are_there_any_megaliths_in_the_us/",
        "text": "I'm in the Northeast and was watching a great documentary about Eurpoean Megaliths. That got me thinking about over here in the States. Any big rock things from 2,000 years ago?",
        "created_utc": 1531834145,
        "upvote_ratio": ""
    },
    {
        "title": "If the modern human originated from Africa, what led to Asia having the highest population today?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zhfvk/if_the_modern_human_originated_from_africa_what/",
        "text": "[deleted]",
        "created_utc": 1531795719,
        "upvote_ratio": ""
    },
    {
        "title": "Concept of Property and the State of Nature",
        "author": "AnonUser8509",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zh364/concept_of_property_and_the_state_of_nature/",
        "text": "Not sure if this is more suited for /r/Philosophy but I have been reading about the different ideas about the \"State of Nature\" (Hobbes vs Locke vs Roussseau) and their entire political philosophies seem to lie on what they think the \"State of Nature\" is. Hobbes seems to have the most cynical view of it and thinks that the life of man in this state is \"solitary, poor, nasty, brutish, and short\" while Rousseau, on the other hand, seems to think that freedom and equality reigns in this State (Locke seemingly having a more of a middle ground in comparison to the two). \n\nWhat does this have to do with anthropology? Well, I was wondering if any of you were aware of cultures that have no property rights. I'd like to read a little more about these cultures and make a little bit of a better judgement on which of these philosophical premises makes more sense (I have a feeling that Hobbes' might be least correct).\n\nMy Google searches only yield blog posts on cultural appropriation.",
        "created_utc": 1531792680,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a Pan-African culture? How was it shaped by colonialism how was it shaped by the decades since? To what extent are music, language, and philosophies shared across African nations?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zg2z1/is_there_a_panafrican_culture_how_was_it_shaped/",
        "text": "I understand that Fela Kuti was a strong internationalist who avoided both his native Yoruba language and overly complicated English lyrics, because he wanted his music to be as resonant to somebody in Johannesburg or Nairobi as it would be in Lagos. \n\nUnfortunately, I know very little about contemporary African culture. While I'm aware that Pan-Africanism was a major political cause, especially during and immediately after decolonization, I'm not sure if Fela's cultural efforts were unique. Did other musicians, writers, or religious leaders seek to create a new African culture that was distinct from both the immediate colonial background and the distant, more localized precolonial societies?\n\nI know that modern Africa is full of religious and musical innovation, and that African literature has been flourishing for the past few decades. To what extent are these movements, at least in theory, Pan-African rather than representing the interests of a particular culture or nation? To what extent can Pan-Africanism be considered a success?",
        "created_utc": 1531784370,
        "upvote_ratio": ""
    },
    {
        "title": "GRE for PhD in medical and/or social anthropology?",
        "author": "daisyben10",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zc7mb/gre_for_phd_in_medical_andor_social_anthropology/",
        "text": "Hey folks, apologies if this is in the wrong place (and if it is, please feel free to redirect me). New to reddit.\n\nHoping to gain some insight about what kind of GRE scores are needed for top PhD programs in medical and social anthropology? I have pored over GRE-specific forums and can't really find much on the role of the GRE in anthro admissions. Most programs don't seem to list scores of previously admitted students. Also, I have heard rumors that the GRE is used when evaluating funding per student? Is this true? If I aim for above a 160 in each section is that sufficient (assuming I do everything else \"right\" or to the best of my ability?) I would love to know others' experience with the GRE and the PhD application process. Applying this cycle!",
        "created_utc": 1531757672,
        "upvote_ratio": ""
    },
    {
        "title": "What book should I read to learn about the origins of the Irish culture?",
        "author": "carnivalcrash",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zc6sk/what_book_should_i_read_to_learn_about_the/",
        "text": "I've always liked the Irish. They seem so careless but at the same time assertive. I especially would like to understand why drinking and fighting is a thing in the irish culture given the fact that they seem to be highly religious at the same time. Is the \"alcoholism gene\" more widespread in Ireland than it is in let's say England or Germany? ",
        "created_utc": 1531757514,
        "upvote_ratio": ""
    },
    {
        "title": "What is a good book for understanding the irish culture?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zc39v/what_is_a_good_book_for_understanding_the_irish/",
        "text": "[deleted]",
        "created_utc": 1531756859,
        "upvote_ratio": ""
    },
    {
        "title": "What are some future potentials of studying Anthropology in university?",
        "author": "_BigOcean",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8zakpx/what_are_some_future_potentials_of_studying/",
        "text": "Hi there! Anthropologists and students of Anthropology, I’m about to apply for college this year and I’m really conflicted about whether to go into Anthropology major... Have always been interested in archaeology and human evolution in general, but I’m worried that if I go in this field, I’ll not be able to find any jobs besides in the museum. So... Please offer some insights? Thanks in advance! ",
        "created_utc": 1531744833,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good raw data resources for ethnography?",
        "author": "krishkhubchand",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8za1cf/what_are_some_good_raw_data_resources_for/",
        "text": "Other than people-watching/talking in a live setting, are there any digital resources that enable you to be a fly in the wall and just observe living? IE CCTV archives or non-fake reality TV etc. \n\nI’m going through an amateur ethnography book and I’d like to start in a low stakes situation. \n\nCheers 🙂",
        "created_utc": 1531739535,
        "upvote_ratio": ""
    },
    {
        "title": "A post grad with some (existential?) questions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8z9mnh/a_post_grad_with_some_existential_questions/",
        "text": "[deleted]",
        "created_utc": 1531734963,
        "upvote_ratio": ""
    },
    {
        "title": "Is saying why didn’t the polyasians or other people’s had monuments and flags",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8z7bq9/is_saying_why_didnt_the_polyasians_or_other/",
        "text": "[removed]",
        "created_utc": 1531709098,
        "upvote_ratio": ""
    },
    {
        "title": "2 tons under water is 3kg: my Megaliths-on-Rivers Hypothesis",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8z4zzt/2_tons_under_water_is_3kg_my_megalithsonrivers/",
        "text": "[removed]",
        "created_utc": 1531688536,
        "upvote_ratio": ""
    },
    {
        "title": "What area of Anthropology is fascinating to you currently?",
        "author": "manjomandino",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8z4gx5/what_area_of_anthropology_is_fascinating_to_you/",
        "text": "",
        "created_utc": 1531684310,
        "upvote_ratio": ""
    },
    {
        "title": "Do anthropologists have identity issues?",
        "author": "kstanman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8z37ck/do_anthropologists_have_identity_issues/",
        "text": "Watching a documentary about bones connecting Australopithecus to Homo habilis gave me a few perspective points I never really had before: we're all animals like all the others, where descendants from distinctly violent apes, our survival is highly correlated with our distinct character of cooperation. \n\nSo we are different but still the same in some way. We are violent but cooperative. I just imagined people going into paleontology thinking they will study some interesting scientific topics and then having a similar epiphany of I'm an animal, a descendant of violence, our survival depends on our cooperation.\n\nThese issues are very new to me I don't have my curiosity finely-tuned yet but I welcome your thoughts along these lines. Thank you.",
        "created_utc": 1531674777,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the Mother Earth and father sky myth so common across creation stories?",
        "author": "Anemone-kid",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yzb8o/why_is_the_mother_earth_and_father_sky_myth_so/",
        "text": "I’ve been looking into Maori myths recently and it struck me that they have the story of the earth and the sky being the mother and father to all life. These two beings were then pushed apart by their children to let in life and light, iirc this is a similar story as the ones told in Greek, Egyptian and certain Asian religious/spiritual beliefs as well. So my question is, what other groups have similar stories and why is this particular myth so common and wide spread  across the globe?",
        "created_utc": 1531630004,
        "upvote_ratio": ""
    },
    {
        "title": "A few questions about human evolution",
        "author": "DarthNightnaricus",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yyibg/a_few_questions_about_human_evolution/",
        "text": "1. Are Homo erectus and Homo ergaster separate species or is ergaster a subspecies of erectus?\n\n2. Which member of *Australopithecus* are we generally believed to have evolved from? Australopithecus africanus?\n\n3. Are Homo antecessor, Homo heidelbergensis, Homo rhodesiensis, Homo neanderthalensis, Homo denisova, and Homo sapiens separate species or subspecies of one species?",
        "created_utc": 1531621453,
        "upvote_ratio": ""
    },
    {
        "title": "Did the Inca/Indigenous Andean Civilizations use entheogens?",
        "author": "VeryVeryCum",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yy9u1/did_the_incaindigenous_andean_civilizations_use/",
        "text": "",
        "created_utc": 1531618992,
        "upvote_ratio": ""
    },
    {
        "title": "How did ancient Summer influence other ancient civilizations?",
        "author": "hatebacon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yy8uw/how_did_ancient_summer_influence_other_ancient/",
        "text": "I'm really interested in studying ancient civilizations and I know that what I learned from school is eather vague or outdated. Some sources give the Summers credit for some fundamental inventions like agriculture, writing, the weel, astronomy and so on. But I don't see many sources on how did this discoveries spread and influence on  other ancient civilizations, specially ancient Egypt, witch has a history almost as old and according to some discussions maybe even older than that of Summer. Is there any reliable source I can look up into?",
        "created_utc": 1531618710,
        "upvote_ratio": ""
    },
    {
        "title": "From an objective standpoint, why has religion endured throughout history?",
        "author": "overthinker356",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yy3v6/from_an_objective_standpoint_why_has_religion/",
        "text": "Reposted from r/askhistorians\n\nSomeone recently said to me in a discussion about Christianity that \"it's lasted and grown for thousands of years, so there must be something to it.\" Though I'm personally nonreligious, as a historical enthusiast this got me thinking. What makes societies so predisposed to religion, and why is it the one thing that they never really shake over thousands of years of philosophical and scientific change? How has Christianity lasted and grown as long as it has with so much dominance from it's early spread in Anatolia, and how have other religions endured in a similar fashion? Why is it so uncommon throughout history to see civilizations geared towards atheism or agnosticism? I know that many ancient Greek and Enlightenment philosophers professed atheistic, agnostic, or deistic beliefs or, in Voltaire's case, resistance to organized religion. How widespread were these beliefs among the average nonwealthy person at those times, and what caused those beliefs to fade out?",
        "created_utc": 1531617321,
        "upvote_ratio": ""
    },
    {
        "title": "Is this \"map of white people\" accurate in this blog..",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yxb8e/is_this_map_of_white_people_accurate_in_this_blog/",
        "text": "[deleted]",
        "created_utc": 1531609943,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the earliest recorded instances of nail polish and/or nail care?",
        "author": "softerthansilence",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yx0s2/what_are_some_of_the_earliest_recorded_instances/",
        "text": "Nail polish and nail care is kind of a cultural phenomenon at this point, and there are so many different options if you want your nails to be done up. I just got acrylics, as an example. \n\nThat being said, when did nail polish and caring about how your nails look in general become a thing? I can't imagine it being an ancient thing, but how long ago did people look at their nails and start buffing them, clipping them, doing all of that?",
        "created_utc": 1531607273,
        "upvote_ratio": ""
    },
    {
        "title": "Whom put teh alphabet in alphabetical order?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ywueg/whom_put_teh_alphabet_in_alphabetical_order/",
        "text": "I ben thinking about this for a long time. Did he get paid or was he just real bored? Did he have help, like a uncredited woman like the dna girl? This sub really expands my mind so i look forward to finding out.",
        "created_utc": 1531605709,
        "upvote_ratio": ""
    },
    {
        "title": "Evidence of slang in ancient writings?",
        "author": "maalco",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yvb7m/evidence_of_slang_in_ancient_writings/",
        "text": "Four languages for which we only have written evidence, did those languages ever use slang?",
        "created_utc": 1531592699,
        "upvote_ratio": ""
    },
    {
        "title": "Unarmed combat?",
        "author": "ThermiteMan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ys39c/unarmed_combat/",
        "text": "Is there any evidence to suggest that early humans fought with their fists/other body parts (before pugilism and boxing) or did they stick to making weapons and tools to fight? I know human hands are extremely fragile and can be broken very easily, especially when it comes to fighting. I guess then a bonus question would be why did we start to like participating in things like pugilism and eventually sports like boxing and MMA if we're so fragile?",
        "created_utc": 1531560144,
        "upvote_ratio": ""
    },
    {
        "title": "I need help finding a book! (Cultural Anthro)",
        "author": "ggarcimer15",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yrt24/i_need_help_finding_a_book_cultural_anthro/",
        "text": "Hi everyone! It's been a while since I finished my introduction to cultural anthropology, and my memory of titles is quite fuzzy. We were supposed to read the whole book, but for some reason  we ended up modifying the syllabus and not getting around to it. \n\nThe book is an ethnography of Sherpas, in Nepal. I thought it was called \"Life and Death in the Shadow of Everest\" but that doesn't bring any results. Does anyone know any titles related to the topic, or any authors specializing in Himalayan cultures? I'm considering a long term trip and would really like to learn more about the area.",
        "created_utc": 1531556072,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for book recommendations on the evolutionary history of laughter, and/or cultural and social books about laughter.",
        "author": "MancombQSeepgood",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yrnb7/looking_for_book_recommendations_on_the/",
        "text": "",
        "created_utc": 1531553888,
        "upvote_ratio": ""
    },
    {
        "title": "Where do Berbers come from?",
        "author": "lunes8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yqjma/where_do_berbers_come_from/",
        "text": "I’m personally half Berber and my father often told me that in school they said that they came from Arabia, which he sees as a lie. He believes that Berbers went straight up from the Horn of Africa, along the Nile to the rest of North Africa. Yet most sources I’ve found imply that Berbers are a migratory movement from the Middle East, which doesn’t make much sense to me. Can someone please clear this up for me?",
        "created_utc": 1531540832,
        "upvote_ratio": ""
    },
    {
        "title": "What are the evolutionary reasons that women tend to be more tired/less energetic than men?",
        "author": "dothebork",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yqaoi/what_are_the_evolutionary_reasons_that_women_tend/",
        "text": "",
        "created_utc": 1531538321,
        "upvote_ratio": ""
    },
    {
        "title": "Beliefs regarding rotting before science?",
        "author": "PumpPumper",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yq750/beliefs_regarding_rotting_before_science/",
        "text": "What did people used to think was the mechanism behind rotting? What did they think was the reason dead things rot?",
        "created_utc": 1531537336,
        "upvote_ratio": ""
    },
    {
        "title": "On Ancient Libyans, Basques and Berbers",
        "author": "D-Sebastian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ynrei/on_ancient_libyans_basques_and_berbers/",
        "text": "So first I'd like to apologize in advance if my questions sound stupid. I've always found curious that some northern berber populations have quite caucasoid features, and that the egyptians sometimes painted ancient Libyans with a fair skin. I've also recently found out that there were some theories a few decades back about the basques being the remaints of some pre-indo-european populations. So I put those thoughts together with the idea that maybe people way back then might also jave been crossing from Iberia to North Africa, and began thinkinh whether there is any relation between the very old populations of Iberia and the ancient population of North Africa. Do modern archeology/historical linguistics/dna studies point to any thing like that happening during ancient times? ",
        "created_utc": 1531515783,
        "upvote_ratio": ""
    },
    {
        "title": "Does UC Berkeley owe it to Native Americans to return their ancestors' remains?",
        "author": "xfileluv",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yn5r5/does_uc_berkeley_owe_it_to_native_americans_to/",
        "text": "[There is a struggle taking place right now with Native Americans and UC Berkeley](https://www.kqed.org/news/11680078/native-american-tribes-clash-with-uc-over-bones-of-their-ancestors?utm_campaign=kqedmain&amp;utm_medium=socialmedia&amp;utm_source=twitter). Going against the law, UC is keeping the majority of the bones they have acquired, instead of returning them to their (the bones') tribes. UC is holding onto the bones (and associated funerary items) for continued research, and they make their case in the above article.\n\nDoes the collective knowledge to be gained from studying these bones outweigh the tribes' rights to their elders' remains? Which side is right?\n\n*a letter",
        "created_utc": 1531511386,
        "upvote_ratio": ""
    },
    {
        "title": "Stagnant Life",
        "author": "littlechestnutk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ympg2/stagnant_life/",
        "text": "Right now, I'm at a stagnant point in my life. I studied Anthropology in undergrad/grad school.  I had a bad relationship with my faculty adviser who didn't have time for any of his students. I burned that bridge. I managed (through my own will) to obtain a Master's degree in Cultural Anthropology, 2011. At the time, I knew my husband wanted to go to graduate school, so I stayed at my retail job. I figured we would move soon. He was accepted to graduate school in California (we are from Ohio). I believe I made the right decision at the time not to commit to anything job wise. Then in California, I became pregnant and I was working at the bookstore. All this time, I was trying to find an adjunct or college job at the university. No luck. During my pregnancy, I picked up a marketing research job at a nation wide company that allowed me control of my schedule. When I had my son, I had two jobs, the bookstore and the researcher job. Mostly I worked at the bookstore because I couldn't be too far from my baby. Then I quit my bookstore job because my husband couldn't watch him the two days I worked. Truly, he was very busy. I was left with my researcher job until Fall 2014 when my husband graduated. He was looking for jobs at this point, and he found one which allowed us to stay in California. From 2014 to 2016 I stayed with my marketing researcher job. I became fed up with the intercept interviews and rude people, so I stopped taking projects on. I was miserable and dislike anything related to selling. At present, I am mostly a full time mother, managing the household and finances. My son will start kindergarten in the Fall. Now, I feel this urgency to work, but I don't want to do marketing anymore. The most logical thing would be to go back to anthropology. I applied to many adjunct jobs etc. with no luck. I think the reason is my lack of teaching experience AFTER graduate school. I wonder if anthropology is something I should still care about or pursue, or find a totally different career. I still have appreciation and passion for anthropology and its related issues. I have passion for religious studies/anthropology of religion, indigenous peoples and rights etc. My question is keep trying to teach anthropology? Should I pursue a Ph. D. Should I just go for something else with money? a lot of openings? Should I suck it up and continue with marketing? I love being a Mom, but I will have more time on my hands soon, and is that even a bad thing? I just don't know. There has been no personal changes for myself and I need something to change. ",
        "created_utc": 1531508142,
        "upvote_ratio": ""
    },
    {
        "title": "\"Here try this\" and related to it...",
        "author": "JSav7",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ymo5m/here_try_this_and_related_to_it/",
        "text": "I've realized in all my work, I've accepted an idea I actively question. People who cooked or ate something first. For example, acorns are toxic unless they're cooked so who figured that out... is it trial and error, or so far in the past just really oral tradition at this point? Anyone have any literature or anecdotes on this? ",
        "created_utc": 1531507878,
        "upvote_ratio": ""
    },
    {
        "title": "I've always been told that indigenous Tasmanians didn't use bone awls, nets or spear throwers, yet this account claims they did exactly that.",
        "author": "Epigravettian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8ylfk4/ive_always_been_told_that_indigenous_tasmanians/",
        "text": "Its pages 113 and 115 of the Tasmanian Journal of Natural Science, Agriculture, Statistics, Etc, Volume 1\nhttps://books.google.com/books?id=0cgRAAAAYAAJ&amp;pg=PA113&amp;lpg=PA113&amp;dq=tasmanian+kangaroo+skin+drum&amp;source=bl&amp;ots=olTwDXT5LO&amp;sig=5zvaPWsCzYHHwMEScIqH4o6MzdA&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwji24GTuJzcAhWKNd8KHd8ZCxcQ6AEwFnoECAEQAQ#v=onepage&amp;q=tasmanian%20kangaroo%20skin%20drum&amp;f=false",
        "created_utc": 1531499359,
        "upvote_ratio": ""
    },
    {
        "title": "Would your ideal society allow sex robots, to which there is a scientific basis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yl0dc/would_your_ideal_society_allow_sex_robots_to/",
        "text": "[removed]",
        "created_utc": 1531496459,
        "upvote_ratio": ""
    },
    {
        "title": "Why did hauntings, paranormal events etc die out at the end of the 20th century?",
        "author": "ellisel",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yi5xq/why_did_hauntings_paranormal_events_etc_die_out/",
        "text": "Is there a cultural reason, like advancements in technology, for why the epidemic of the supernatural in the 20th century (hauntings, past life regression cases, people claiming to be psychic etc) has all but stopped? I'm talking from a western perspective.",
        "created_utc": 1531469638,
        "upvote_ratio": ""
    },
    {
        "title": "What do you guys think about this discourse?",
        "author": "Upupandawaywego1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yhfgq/what_do_you_guys_think_about_this_discourse/",
        "text": "[https://www.cell.com/trends/ecology-evolution/fulltext/S0169-5347(18)30117-4](https://www.cell.com/trends/ecology-evolution/fulltext/S0169-5347(18)30117-4)  \n\n\nI'm not anthropology savvy and I'm mainly just interested in your opinions. ",
        "created_utc": 1531461229,
        "upvote_ratio": ""
    },
    {
        "title": "Evolution?",
        "author": "Glenn1112",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yfshb/evolution/",
        "text": "[removed]",
        "created_utc": 1531446031,
        "upvote_ratio": ""
    },
    {
        "title": "I'm gay, I'm wondering why evolution would allow that when it's so difficult to reproduce?",
        "author": "Tychobrahe2020",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yf4lv/im_gay_im_wondering_why_evolution_would_allow/",
        "text": "I'd really like an anthropological perspective on this.",
        "created_utc": 1531440590,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the most useful language to learn when studying anthropology at a university?",
        "author": "wutwlduknw",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8yeu45/whats_the_most_useful_language_to_learn_when/",
        "text": "",
        "created_utc": 1531438071,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best anthropology books in the style of pop science books you would recommend to a general audience?",
        "author": "Iskandar11",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8y57ph/what_are_the_best_anthropology_books_in_the_style/",
        "text": "",
        "created_utc": 1531356952,
        "upvote_ratio": ""
    },
    {
        "title": "If intelligence is such an important trait which can dictate survival, why haven't people with less intelligent genes been replaced by the more intelligent people through the process of evolution?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8y56wz/if_intelligence_is_such_an_important_trait_which/",
        "text": "[deleted]",
        "created_utc": 1531356779,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if we time travelled 40 thousand years ago, found a just abandoned Neanderthal baby, and brought it back today to be raised like one of our own?",
        "author": "Robert_Jarman",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8y4i1b/what_would_happen_if_we_time_travelled_40/",
        "text": "Assume that we have a middle class lifestyle in Germany, just like where Neanderthals actually were, and they had some good helpers in school and language. Would we notice much of a difference aside from speech capacity perhaps? ",
        "created_utc": 1531351107,
        "upvote_ratio": ""
    },
    {
        "title": "Why is color black associated with negative aspects of life? Is it a racist practice or there is another reason for this?",
        "author": "manavpreet",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8y18hr/why_is_color_black_associated_with_negative/",
        "text": "Black is associated with many negative activities and aspects like black market, blackmail, black magic etc. Was the origin of this practice inspired by racism or is there any other reason?",
        "created_utc": 1531327730,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about postmodernism",
        "author": "le57percent",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xxgf7/questions_about_postmodernism/",
        "text": "Postmodernism was largely in response to WWII and modernism which was thought to have led to totalitarianism.\n\nHow did postmodernism come to be the dominant response? In the past, ideologies/beliefs resulted in terrible things happening but the response wasn't to attempt to ditch meaning and become nihilistic. What were alternatives to postmodernism, if there were any noteworthy alternatives? Also, how much has postmodernism effected non-Western cultures?\n\nAre we still in the postmodern era? Some people say we're entering a post-postmodern era. Is this a valid claim? There are many aspects of our current culture, and the way people generally view the world, that seem postmodern to me. What is a post-postmodern era supposed to look like?",
        "created_utc": 1531292843,
        "upvote_ratio": ""
    },
    {
        "title": "From 1500-1750, when the Spanish \"settled\" the so-called New World and persuaded many cultures to embrace Christianity, how well did most native people understand its concepts and the notion of God?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xxbyv/from_15001750_when_the_spanish_settled_the/",
        "text": "The Spanish converted--or attempted to convert--many dozens of cultures.  \n\nGiven the cultural gap between the Spanish and native peoples, especially language barrier, how many years or decades did it take for these peoples to even understand the religious concepts being imparted?  \n\n*(I am not just  suggesting a lack of comprehension by these people; it seems their outlook would also have included skepticism, as well as distrust towards a people [the Spanish] who behaved with disrespect and violence toward their culture--as the Spanish were much prone to do, wherever they ventured.)*  \n\nAre there explanations as to why some cultures like the Filipinos strongly embraced Christianity, while others rejected it?\n",
        "created_utc": 1531291471,
        "upvote_ratio": ""
    },
    {
        "title": "Is the traditional use of mind-altering or intoxicating substances found in all societies throughout history, or have there been societies that seemingly never developed such practices?",
        "author": "JustinJSrisuk",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xx9sk/is_the_traditional_use_of_mindaltering_or/",
        "text": "",
        "created_utc": 1531290830,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any first-hand accounts about changes in English pronunciation during the great vowel shift?",
        "author": "adum_korvic",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xx9m4/are_there_any_firsthand_accounts_about_changes_in/",
        "text": "",
        "created_utc": 1531290765,
        "upvote_ratio": ""
    },
    {
        "title": "Has any society, modern or historical, big or small, ever lived with such an ease as to be well-known for it?",
        "author": "Ws6ml1T0Eb",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xsd5l/has_any_society_modern_or_historical_big_or_small/",
        "text": "I have a friend who I admire greatly that asked me - recently - a question for his next novel. I perused /r/AskHistorians for an answer, though upon recommendation I believe /r/AskAnthropology to be the more apt place for it. The question was thus: \"**Was there ever a society where life was lived with such an ease as to be legendary for it?**\"\n\nHis analogy, colorful as it was: a land where men walk barefoot and might lounge anywhere at leisure, where food is readily available without work (\"fruit falls from the trees, and none work in fields to feed the populace\"), and where no feared natural predators exist. (A romantic picture, though obviously built out with slight hyperbole.) \n\nAny thoughts on this? I have searched this subreddit's archive for a similar question have have - thus far - found no parallel. ",
        "created_utc": 1531250235,
        "upvote_ratio": ""
    },
    {
        "title": "Have first names always had a strongly gendered division?",
        "author": "erl_queen",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xr1ts/have_first_names_always_had_a_strongly_gendered/",
        "text": "In every culture I can think of (which I'm sure excludes many of them), it seems that there are names that are considered \"girls' names\" and \"boys' names\" and then some that are unisex. Has this always been true as far as we know going back into history? Are there cultures that don't follow this pattern? ",
        "created_utc": 1531241561,
        "upvote_ratio": ""
    },
    {
        "title": "Five most important hominids?",
        "author": "DemonEggy",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xp3b0/five_most_important_hominids/",
        "text": "Not the usual kind of question for this sub, but I hope it's okay...\n\nI've been looking for a project to do with my new(ish) 3d printer. I printed a 1/2 scale Cro Magnon skull, and it turned out so cool that I want to print a whole series of full size hominid skulls. I am going to do a Homo Sapien, obviously, but want to do five or so others. I have found plenty of resourced online where they have 3d scans of skulls, but there are so many different hominids that I was hoping someone who knows about this field can help me narrow it down. \n\nSo here's my question: What do you think are the five most important stages in our evolution? Which are our five most important ancestors? Preferably that we have good fossil records of (I don't just want to print a bit of a finger bone!). If there's a \"dead end\" (like, I believe, Neanderthals may have been...), that's fine too. \n\nIf it's impossible to narrow down to 5, then I am happy to do 6. :)\n\nI'm planning on doing a lot of reading about them as I print them. They should take a good 15 hours to print each, so I can fit quite a bit of research in while the printer's doing it's thing. :D",
        "created_utc": 1531229238,
        "upvote_ratio": ""
    },
    {
        "title": "Book recommendations for human evolution",
        "author": "anneomoly",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xoy4c/book_recommendations_for_human_evolution/",
        "text": "I'm looking at \"The Origin of Our Species\" by Chris Stringer.\n\nThe questions I have are:\n\n1) Is this a good intro text for the subject, and\n\n2) Given that I understand this is a field that's shifting and changing fast, is this still up to date given it was published 7 years ago? and\n\n3) Has anyone got any better suggestions? Or if this is a good intro text, what to read after this?",
        "created_utc": 1531228227,
        "upvote_ratio": ""
    },
    {
        "title": "The promise land pre-1900? kind of Archaeology question",
        "author": "GManDH",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xod1s/the_promise_land_pre1900_kind_of_archaeology/",
        "text": "In modern time there are a couple of countries that most of the world immigrants to in the hope of a better life. Is there any proof of something similar happening in the world pre-1900. Please don't count the period where everyone came to the Americas since it was a new land.",
        "created_utc": 1531223853,
        "upvote_ratio": ""
    },
    {
        "title": "Why are so many Irish names 3-syllables?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xjcf8/why_are_so_many_irish_names_3syllables/",
        "text": "In Ireland and among the Irish diaspora, [many surnames](https://www.irelandbeforeyoudie.com/ranked-top-100-irish-surnames-and-meanings/) that lacks a patronymic prefix (Mc- or O') have the same 3-syllable scheme.\n\nExamples include Sullivan, Gallagher, Kennedy, Callahan, Kavanaugh, Donovan, Doherty, Flanagan, Buchanan, and Doneghy.\n\nWhy is this? ",
        "created_utc": 1531186896,
        "upvote_ratio": ""
    },
    {
        "title": "How do/did Islam culture treat cats",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xgqu4/how_dodid_islam_culture_treat_cats/",
        "text": "",
        "created_utc": 1531173393,
        "upvote_ratio": ""
    },
    {
        "title": "If an ancient settlement were completely submerged underwater for 10,000 years, how much would be recoverable?",
        "author": "spauldeagle",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xgkth/if_an_ancient_settlement_were_completely/",
        "text": "It's known that sea levels have risen dramatically since the Ice Age, yet there's only a handful of supposed submerged settlements off of Israel, Japan, and Florida (though of different ages). If we found one off the coast of Ethiopia per se, how much information could we get from it, if any at all?",
        "created_utc": 1531172395,
        "upvote_ratio": ""
    },
    {
        "title": "What made some of you pursue a higher education in Anthropology?",
        "author": "Odins_mace",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xfx4n/what_made_some_of_you_pursue_a_higher_education/",
        "text": "Note: Currently doing my bachelors in Anthropology with a minor in global leadership\n\n1. Was there a article or a specific study that made some of you purse a higher education in Anthropology? \n2. Why Anthropology?\n\nIf this is not the proper place to ask than I apologize. Thank you",
        "created_utc": 1531168521,
        "upvote_ratio": ""
    },
    {
        "title": "Horses were extinct in Pre-Columbian America before domestication began, largely from human predation. If so, why didn't old world humanity render horses extinct before domestication as well?",
        "author": "malariadandelion",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xe9tl/horses_were_extinct_in_precolumbian_america/",
        "text": "Also, I'm not sure if this is the best sub to ask this. I couldn't find a sub for paleo-anthropology. ",
        "created_utc": 1531159312,
        "upvote_ratio": ""
    },
    {
        "title": "What race are Somalis, Ethiopians &amp; Eritreans? Where are Cushites originally from?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xcy71/what_race_are_somalis_ethiopians_eritreans_where/",
        "text": "[deleted]",
        "created_utc": 1531151666,
        "upvote_ratio": ""
    },
    {
        "title": "What cultures praticed Cannibalism?",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xbu1b/what_cultures_praticed_cannibalism/",
        "text": "In any way.",
        "created_utc": 1531144713,
        "upvote_ratio": ""
    },
    {
        "title": "Are there different dietary needs/preferences for humans dependent on race?",
        "author": "WeinMe",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8xalph/are_there_different_dietary_needspreferences_for/",
        "text": "TL;DR: I'm half Inuit and have noticed huge appetite and food reaction differences between me and my N. European friends. \n\nSo I'm half Danish and half Inuit (ancestors from Scoresbysund, northernmost city in Greenland), which probably has the diet that varies the most from the rest of the world. \n\nSo I have noticed 2 very significant things about differences in what I feel the need to eat compared to my peers. I generally can't consume milk, only small amounts of whole milk and I don't really like it the way my Danish friends do. My mom can't at all, she becomes a pure flatulence monster. \n\nMost importantly and notably is the difference of meat consumption, I go without meat for a period I get an insatiable hunger for it. Like I could take a bite out of an animal, even if I'm fed fine by oatmeal, fruits, nuts, vegetables etc.\n\nEveryone I know talk about a feeling that eating too much meat makes them feel tired of or nauseous by the thought of meat. I have never felt that, I can eat meat diet only for 3 days straight and still be wanting more. My mom and sister feel the same way in all these aspects.\n\nThese two things have me questioning: are there racial differences in appetite? In nutritional needs and ability to digest certain foods?\n\nSorry for the long text. I hope you can enlighten me. Thank you very much!",
        "created_utc": 1531134716,
        "upvote_ratio": ""
    },
    {
        "title": "How fast is the process of genetic drift? Does the archaeological record reveal any genes or genetic disorders that modern human populations no longer exhibit?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8x8hip/how_fast_is_the_process_of_genetic_drift_does_the/",
        "text": "I'm wondering if people in Ancient Egypt, for instance, may have suffered from different genetic disorders than we do today. Did genetic disorders like Tay-Sachs, usually associated with Jewish and Cajun populations, exist among humans before Jews and Cajuns existed?",
        "created_utc": 1531113389,
        "upvote_ratio": ""
    },
    {
        "title": "What is the earliest evidence of humans systematically killing off predators?",
        "author": "Dent7777",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8x7yg6/what_is_the_earliest_evidence_of_humans/",
        "text": "So I've read about wolf hunts in Britain and about the killing of large predators throughout Europe, Asia, and the ME. I believe I have read that many \"Savanna\" predators once ranged over swaths of Southern Europe, Central Asia, and the ME.\n\n(genetically) Modern humans have always competed with and (I believe less commonly) been hunted by large *carnivora*, but do we know when we began to eliminate these threats from the nearby environment?",
        "created_utc": 1531109242,
        "upvote_ratio": ""
    },
    {
        "title": "Did South Asia have their version of Doggerland before the oceans rose?",
        "author": "tnk9241",
        "url": "https://old.reddit.com/r/AskHistory/comments/8x7jo2/did_south_asia_have_their_version_of_doggerland/",
        "text": "",
        "created_utc": 1531106410,
        "upvote_ratio": ""
    },
    {
        "title": "Why are the majority of US smokers lower income, but in Europe, smoking is common across the socio-economic spectrum?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8x6lcx/why_are_the_majority_of_us_smokers_lower_income/",
        "text": "",
        "created_utc": 1531098892,
        "upvote_ratio": ""
    },
    {
        "title": "Is Culture of Critique Reputable?",
        "author": "throwawayeventually2",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8x5iss/is_culture_of_critique_reputable/",
        "text": "I've seen a lot of talk about this book (I specifically mean the third book in the \"Culture of Critique\" series), but I haven't seen clear information for supporting one position or another outside of the content of the book itself. That is to say, I have seen people speak very critically of it, but I haven't seen a clear exposition of evidence for it being wrong. I ended up down a Group Selection Theory rabbit hole and what I got were articles from Dawkins and Dennet that are at best circuitously related to a single set of claims in the book. Could someone kindly explain to me evidence-based criticism of the book's academic/anthropological integrity in a more direct manner than my floundering research has managed?\n\nFull disclosure:  I posted this elsewhere first, I somehow didn't realize this sub existed, but it's clearly the best place for the question.",
        "created_utc": 1531090071,
        "upvote_ratio": ""
    },
    {
        "title": "Would anybody here be willing to answer a few questions for my BA research?",
        "author": "SufficientBeginning",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8x0syb/would_anybody_here_be_willing_to_answer_a_few/",
        "text": "Hey guys,\n\nI'm currently writing my bachelor thesis about Reddit at the University of Göttingen in Germany. Part of my thesis will consist of ethnographic research regarding reddit's fight for net neutrality and gatewatching processes on reddit. I did a couple of face-to-face interviews already, but since the debate around net neutrality is set mainly in the US, I still need an American (or non-German) perspective on the topic. Would any of you guys be willing to answer a few questions for me? That would be a big help!\n\nIf you have any questions or concerns regarding my research etc. feel free to PM me. Thanks in advance!\n\nEdit: Thank you guys a lot, I appreciate it! I will send a respective set of questions to you all by tomorrow.\n\nEdit2: I made a very basic survey and sent it to all of you via pm. If you have any problems taking the survey or if you  have any survey-related questions you can pm me at any time. Thanks for taking the time guys, it means a lot!",
        "created_utc": 1531048733,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any common traits or trends among cultures that widely embraced meditation-centered religions, such as Buddhism?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wvxt5/are_there_any_common_traits_or_trends_among/",
        "text": "",
        "created_utc": 1530993959,
        "upvote_ratio": ""
    },
    {
        "title": "Do or did the Sami people ever use poison-tipped arrows or blow-darts?",
        "author": "SilverCloud73",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wujfy/do_or_did_the_sami_people_ever_use_poisontipped/",
        "text": "EDIT: Could they have obtained lethal poison through trade? I’m posting this after seeing something similar to this in a TV show recently.",
        "created_utc": 1530982442,
        "upvote_ratio": ""
    },
    {
        "title": "How did under bites evolve in human history?",
        "author": "ThermiteMan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wqvnh/how_did_under_bites_evolve_in_human_history/",
        "text": "If underbites cause so many problems, why do a lot of Asian communities have higher rates of underbites? Are/were there any benefits to having one in those areas of the world or is it just a coincidence? Or did they not become a problem until after fecundity. I've heard the explanation of it being because of Asian diet, but I'm not sure if underbites could evolve so quickly in that short period of time.",
        "created_utc": 1530940679,
        "upvote_ratio": ""
    },
    {
        "title": "I've noticed...",
        "author": "imtoughinreallifetoo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wp5ha/ive_noticed/",
        "text": "[removed]",
        "created_utc": 1530923455,
        "upvote_ratio": ""
    },
    {
        "title": "Stone it is, but has tech in it as simple as a conveyor system, and it is as thick as a dime, and can be seen as stone, to a nail of 4 inches thick.",
        "author": "Glenn1112",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wozje/stone_it_is_but_has_tech_in_it_as_simple_as_a/",
        "text": "[removed]",
        "created_utc": 1530921996,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence to suggest early humans cleaned their teeth?",
        "author": "ThermiteMan",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wniq7/is_there_any_evidence_to_suggest_early_humans/",
        "text": "With how stressed oral and dental health are in the modern world, it makes me feel like my teeth would all fall out by 30 if I didn't actively take care of them. Would early humans have cleaned their teeth in any way or was the lifespan of early humans just not long enough for it to matter?",
        "created_utc": 1530909639,
        "upvote_ratio": ""
    },
    {
        "title": "When and what sparked the rise of religion?",
        "author": "Amayax",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wijdr/when_and_what_sparked_the_rise_of_religion/",
        "text": "Forms of religion go thousands of years back, but what is the first form of religion we know of? And is religion something that is created by the homo sapiens or is it just something that evolved along with us?",
        "created_utc": 1530867137,
        "upvote_ratio": ""
    },
    {
        "title": "How egalitarian are fishing villages?",
        "author": "theAlphaBeth",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wfao4/how_egalitarian_are_fishing_villages/",
        "text": "In my world history class, we learned that agriculture allowed state societies to centralize power, create distinct social classes, make specialized labor forces (ex. the farmers, the craftsmen, the soldiers, etc.), institutionalize slavery, and emphasize/make exclusive the role of men as political rulers. \n\nDoes this apply to fishing villages? I just can't really imagine a massive empire being founded on just fishing, but I also can't imagine a sedentary people being as egalitarian as hunter gatherer societies are/were (unless I guess you would count the Inuit or Chukchi as \"fishers\"). Are fishing villages just not isolated, and are always ruled by an agricultural state society? Fishing must have come along before agriculture, right? ",
        "created_utc": 1530834090,
        "upvote_ratio": ""
    },
    {
        "title": "If humans evolved in Africa, then why do we blush?",
        "author": "undercovercatlover",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wf1ly/if_humans_evolved_in_africa_then_why_do_we_blush/",
        "text": "Note: I am African American\n\nI’ve heard the theories that blushing evolved as a way to show submission or embarrassment before language properly developed. However, we know that humans evolved in sub-Saharan Africa and naturally had very dark brown/black skin. Therefore, it would be very hard if not impossible to see facial flushing in most early humans. African and African descended people can also blush/experience facial flushing even if it isn’t visually apparent. This means that the ability to blush/flush must have developed long before light-skinned pigmentation did. Therefore, there must be some other biological reason for the evolution of blushing. ",
        "created_utc": 1530831963,
        "upvote_ratio": ""
    },
    {
        "title": "What is the primary motor behind cultural change and evolution?",
        "author": "Arcaness",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8we5dy/what_is_the_primary_motor_behind_cultural_change/",
        "text": "I'm talking with someone who says that culture is preservationist first and foremost, and only evolves when faced with crisis or by necessity. I disagree; my understanding of the anthropological consensus is that necessity isn't always precipitant of every cultural change, and that culture is adaptive and evolutionary first and foremost—a sort of middleman for the facilitation of environmental adaptation between genetics in the long term and the individual lifespan in the short term, but which adaption isn't out of *necessity* so much as out of a tendency of culture to change as knowledge is passed down and norms are modified.\n\nAm I correct in thinking that most anthropologists would agree that cultural change is more dynamic than the \"evolution out of necessity\" theory would have you believe? If so, I'd be interested in seeing research papers or data which argue that. ",
        "created_utc": 1530824915,
        "upvote_ratio": ""
    },
    {
        "title": "Good documentaries and documentary series?",
        "author": "VeryVeryCum",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wdskz/good_documentaries_and_documentary_series/",
        "text": "I'm looking for some good anthro documentaries to watch. Preferably long form. Any field is fine.",
        "created_utc": 1530822344,
        "upvote_ratio": ""
    },
    {
        "title": "If you ask the wrong question, do you think that there might be a effort of some type that where you might hide something if it goes against the current theories of science?",
        "author": "Glenn1112",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wde6q/if_you_ask_the_wrong_question_do_you_think_that/",
        "text": "[removed]",
        "created_utc": 1530819469,
        "upvote_ratio": ""
    },
    {
        "title": "I found this on another reddit thread is it bullshit",
        "author": "Konradleijon",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wbwdn/i_found_this_on_another_reddit_thread_is_it/",
        "text": "[removed]",
        "created_utc": 1530808650,
        "upvote_ratio": ""
    },
    {
        "title": "Would you hide the truth if it did not agree with history?",
        "author": "Glenn1112",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8wa1ia/would_you_hide_the_truth_if_it_did_not_agree_with/",
        "text": "[removed]",
        "created_utc": 1530793654,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone explain the variance in 'age of consent' laws worldwide?",
        "author": "moralprolapse",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w8piv/can_anyone_explain_the_variance_in_age_of_consent/",
        "text": "I am not a pervert, but I heard on a podcast recently that age of consent in most US states is under 18, which shocked me, as it did the hosts. Looking at the map of North America referenced in the podcast, many parts of Mexico go as low as 12... Then I look at Europe, which has a similar variance. So I actually have two sub-questions:\n\n1. Is there any sort of common thread  throughout organized societies as to when one becomes an adult capable of having sexual agency, beyond puberty itself....\n2. In your personal opinions as academics (and at risk of breaking the relativist credo), do you think there is an age that makes sense across cultures, or does it make sense that it continues to be fluid?",
        "created_utc": 1530777363,
        "upvote_ratio": ""
    },
    {
        "title": "Newbie sociocultural anthropologist wants some advice:",
        "author": "graciegal96",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w74gi/newbie_sociocultural_anthropologist_wants_some/",
        "text": "Hello Reddit! :) I am an undergraduate Anthropology Major (focusing on the sociocultural subfield) carrying out ethnographic research for a grant I was awarded. I care so much about this work, but I've been in a bit of a data (at least, the type I had planned to collect) slump, and it's getting to me a bit. My mentor/supervisor is a great source of advice and support, but I also wanted to reach out to you all, and ask: Do you have any advice that would have helped you starting out; that you wish you would have known back then? How do you make the most of what you are experiencing, when things aren't going as planned? How do you handle the pressure to collect exactly what you said you would, when it seems that might not happen? How do you know when its right to buckle down and commit to a particular line of inquiry/direction? Any thoughts or personal experiences you might care to share, would be so helpful! Thank you! ",
        "created_utc": 1530758904,
        "upvote_ratio": ""
    },
    {
        "title": "Do our genetics play a big role in mate selection?",
        "author": "enigmantics",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w5vmq/do_our_genetics_play_a_big_role_in_mate_selection/",
        "text": "",
        "created_utc": 1530746170,
        "upvote_ratio": ""
    },
    {
        "title": "How Free am I?",
        "author": "Enoch327",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w4c52/how_free_am_i/",
        "text": "What per cent of my behavior is dictated by my culture?   Or the average person in the average culture? My guess is that ninety per cent of the things I do are to conform to the culture I live in.  Am I off base?",
        "created_utc": 1530732848,
        "upvote_ratio": ""
    },
    {
        "title": "Stone pillars in the Magdalenian.",
        "author": "Epigravettian",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w35ja/stone_pillars_in_the_magdalenian/",
        "text": "I've heard that in some places people of the Magdalenian culture built these stone pillars https://m.imgur.com/FNAMalc I can't find much information about them and was hoping someone could tell me what sites these where found at or otherwise help shed some light on them.  ",
        "created_utc": 1530723416,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any other countries that have exhibited self-ironic nationalism the way some Americans do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w2f06/are_there_any_other_countries_that_have_exhibited/",
        "text": "By which I mean all of the \"Murica, fuck yeah!\" type stuff.\nIf not, what do you think makes this a uniquely American phenomenon? ",
        "created_utc": 1530717663,
        "upvote_ratio": ""
    },
    {
        "title": "Japanese culture notable for once practising ritualized suicides, seppuku. What was the attitude toward non-ritualized suicides in Pre-Modern Japan?",
        "author": "Kerkinitis",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w1f3n/japanese_culture_notable_for_once_practising/",
        "text": "In the society where killing  themselves  is socially acceptable in certain conditions, the overall  attitude  toward suicide probably different than in Christian or Islamic worlds where taking own life, with some exceptions, is sinful.",
        "created_utc": 1530708831,
        "upvote_ratio": ""
    },
    {
        "title": "those who know about asia and america",
        "author": "chris_s9181",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8w0xol/those_who_know_about_asia_and_america/",
        "text": "hey i have a question i was thinking of when the native americans migrated to america wouldn't the natives be technically asian since china has been around during the time they crossed over? me and australian friend was talking about it since majory of the filipino people have alot of spanish blood in their dna after hundreds of years of colonization would they be spanish insted?",
        "created_utc": 1530703695,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to robust crania in Africa?",
        "author": "AndeanRebozo",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8vyx6k/what_happened_to_robust_crania_in_africa/",
        "text": "I'm talking about the general rugged cranial shape seen in Herto, Florisbad, and Jebel Irhoud. Massive brow ridges and a somewhat sloped forehead, unlike the sharp curving frontal bone seen in today's Africans. \n\nArchaic Africans:\n\nhttp://humanorigins.si.edu/sites/default/files/styles/full_width/public/images/square/NHB2014-03436%20Florisbad_sq.jpg?itok=VB4CMmBn\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Jebel_Irhoud_1._Homo_Sapiens.jpg/1200px-Jebel_Irhoud_1._Homo_Sapiens.jpg\n\nhttps://boneclones.com/images/store-product/product-1420-main-original-1416943968.jpg\n\nA sample African modern person:\n\nhttps://scilogs.spektrum.de/blogs/gallery/6/skull-negroid.jpg\n\nIt is said that Africa holds 95% of the genetic diversity of Homo Sapiens. Yet the 5% of the Out of Africa (Caucasians, and especially people from Australia and Papau New Guinea) group seems to still contain remnants of the \"rugged\" cranial shape. Is this simply the product of selecting for domesticate-like genes (i.e., bones not growing to \"adult\" shape due to lack of neural crest cells), or were the relatively \"archaic\" groups in Africa wiped out by the more gracile groups due to various bottlenecks?  \n\n\n",
        "created_utc": 1530679923,
        "upvote_ratio": ""
    },
    {
        "title": "What is the latest thinking on when human speech and language emerged?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8vw4py/what_is_the_latest_thinking_on_when_human_speech/",
        "text": "What I had read in the past was that Neanderthals did not have the throat structure to speak as we do. And separately that Homo Sapiens probably had language from the earliest time (of our species). Have we got any further in what is known?",
        "created_utc": 1530654266,
        "upvote_ratio": ""
    },
    {
        "title": "Did Africans sell their beards/head hair to Mesopotamians/East Asians? Why are the statues' beards/head hair SOO African?",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/8vux0r/did_africans_sell_their_beardshead_hair_to/",
        "text": "[removed]",
        "created_utc": 1530644902,
        "upvote_ratio": ""
    }
]