[
    {
        "title": "Advice for an Undergrad?",
        "author": "confusedUndergrad01",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vhh0p/advice_for_an_undergrad/",
        "text": "Hey everyone, I'm coming up on my senior year of undergrad and am feeling pretty lost, so I thought I'd ask for advice here. I am double majoring in neuroscience and computer science at an R1, and have always been really interested in research, working in neuroscience labs since high school and always assuming that I would aim for a PhD in some neuroscience subfield. \n\nMy goal has always been to enter neuroscience academia as a PI. However, as I actually approach that future I'm really not sure if it appeals to me anymore. I love both neuroscience and computer science, but I guess I'm getting a little tired of the academic environment, and am admittedly a little worried about career prospects as a neuroscience PhD in academia from things I've heard from those around me. I really don't want to sound arrogant here, but I also know that I'm a person who cares a lot about recognition for the work I do (both in terms of salary and social recognition), and have been told that academia isn't the best environment for someone with a personality like that. A love for science and learning more about the world around me is still my primary motivation, don't get me wrong, but as I grow older I'm realizing that I just wouldn't be happy in a job where I don't feel validated to some degree. (again, I'm sorry if that sounds bad-- it's just who I am and I feel like I have to keep it in mind while making these kinds of career decisions) I guess I just want to try something new.\n\nI know people will say that I'm young and still have time to figure it out, but I'm not used to feeling this aimless, and it's sapping me of a lot of motivation. I know that 'what do I do with my life' is kind of a big question to ask Reddit, but I'd really appreciate any kind of guidance from knowledgeable outside perspectives on where to go from here. Mainly on the following questions:\n\n\\- Is academia right for me? \n\n\\- Should I be pursuing a PhD? \n\n\\- If the answer to either of these questions is no, what alternate career paths should I be thinking about? \n\n\\- Are there any undergraduate/postbac opportunities that I should take a look at?\n\n\\- Is my attitude towards my career/the future part of the problem? \n\nTLDR: I am an undergrad who (surprise) doesn't know what he's doing, and would really appreciate some advice from people who know more than me about this stuff. \n\nThank you all :)",
        "created_utc": 1675715942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pierre Elliott Trudeau Scholarship App?",
        "author": "LenaBeansBallroom",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vgnz9/pierre_elliott_trudeau_scholarship_app/",
        "text": "Hey Canadian PhD students! I applied for the Pierre Elliot Trudeau Scholarship in December last year and received an email confirming that my application went through. Yet, when I checked the portal today - it's showing that no submissions have been made (Portal says \"0 submitted, 0 pending, 0 admitted/declined\"). Is anyone else experiencing a similar issue? Is this just a glitch?\n\n(emailed the foundation but no response, I've emailed them before about a different question and they didn't get back either!)\n\n(Canadian first PhD Student at US university, Philosophy)",
        "created_utc": 1675714116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for burnout?",
        "author": "accountfortheq",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vfjj1/suggestions_for_burnout/",
        "text": "I am on the last leg of a masters degree and I have suddenly hit a wall with being able to sit down and actually work on my thesis. I work full time as well, so this was somewhat expected to happen eventually. Any recommendations to combat burnout while working full time? I am a professional planner which is very computer based, so my screen time between school and work has been in excess of 16 hours a day for months.",
        "created_utc": 1675711582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Importance of the name of your school?",
        "author": "yjduckling",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vefow/importance_of_the_name_of_your_school/",
        "text": " \n\nI am debating doing my PhD between two different schools.\n\nOne school is not super highly ranked in the field (\\~80th), but the advisor that I would work with has multiple patents, a high h-index, lots of funding, respected in his subject and we get along very well with values and way of mentor-student expectations.\n\nThe other school is an ivy (top 10 program in the field) - and the advisor that I will most likely work with is a fairly new professor, average h-index but has steady publications coming out in his field. I also got along very well with his ideals and mentor-student expectations, and he seems like a great advisor too. He seems to have okay funding, but is definitely still a promising up and coming professor.\n\nI would like to get into academia after my PhD - and I would like to know your honest opinion. How far does the name of the school where you got your PhD take you when applying for academic positions? Does it differ if you want to go into industry, or does it still provide the same advantages? Most people seem to agree that going to an ivy will open way more doors for me but I also don't know anyone in the academia field, so I wanted to ask here. Thanks in advance!!!",
        "created_utc": 1675709028,
        "upvote_ratio": 1.0
    },
    {
        "title": "what am I doing wrong?",
        "author": "Moon_Raider",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vdupm/what_am_i_doing_wrong/",
        "text": "3rd year thinking of quitting. I can't do field work until I get my proposal in accordingly to advisor. I've had many versions that advisor liked, but when I said I was going into the field he asked \"wait what's the plan?\" I've come up with several plans because last time he said that I had to plan for everything to go wrong. So I categorized data into tiers; vital field data vs opportunistic sampling. I wrote several grants with budgets. I have funding to go. Spoke in front of the department. They liked the idea too. He suggests I don't go until we talk about the plan.\n\nMeanwhile major burnout hits. Something bad  happened in the field that caught up with me emotionally. Can't tell advisor, we don't have that kind of a rapport. A year passes. I haven't been back to the field. We both decide I don't need to go bc of the datasets I put together (even though he spent some time telling me initially that I didn't have any data after I sent it to him via email).\n\nI seek a lot of feedback. Proposals look great in the first round individually. Second round in committee meetings or in talks with others I hear the following responses. I change my proposal each time to meet these critiques and the goal post seems to always remain out of reach via a different:\n\n a) you have no hypothesis, exploratory isn't science, b) you didn't collect the data firsthand and so what you're using as evidence is useless, c) you don't have enough to answer that question, d) the question isn't good enough, e) narrow it down, that's too broad, f) that doesn't look like two chapter, it looks like one. g) how are you original from former works? h) \"your proposal will change from the diss, just get it draftable to the department\" and then \"is this method still the current plan? Change this to reflect that.\"\n\nI always provide an answer. But I'm not sure if I come off as over or under confident.\n\nNow my advisor says he can't help me bc I'm not studying something under his expertise. His last edits are \"change all the times you say \"we or us\" to \"I\". He suggested maybe I revisit the field work idea (which I would totally do, I just wish we'd agreed on this back then before he suggested that I didn't go last time even though I don't feel safe. And now I'm in year 3). He liked my last draft though but he says he can't evaluate it so he sent me to a colleague of his who I spoke with and questioned the validity of my work. The colleague told me I needed to convince him my work was important. I did and then he said I need to be careful of criticizing former works. I mentioned that wasn't my goal, I meant to review prior works towards a consensus that hadn't been revisited in a while. Then shredded my methods (which is fine, bc I don't know what I don't know. Still I see other publications on this topic that use these apparently terrible methods. So it was good enough for former works but I get backlash for trying to use them which is also confusing because I am supposed to pick a model paper whose methods I should follow). Then told me it's your PhD, you should know what your data can do for you and find the methods...\n\n...but I had only begun asking, \"what do I do?\" more often because I no longer understand which parts of my project sucked. To clarify, I am confident in my project but I am willing to put it down and let it go if it's not workable. If it sucks the it needs revision. I just don't know which is which or what the revisions should be at this point. So I came up with all these backup plans and now it looks like I have no sense of direction and I want to study too many things. But honestly this is a fear based tactic to compensate for the fact that I still have no idea which project garners the most confidence from a consensus or at least my advisor bc he changes his mind.\n\nI'm trying to be goal focused here, I like all my proposed projects, I don't mind working hard, get the dissertation and move on, I got it. I have already hit the \"I love my work/I hate my work\" wall. I just don't know what's feasible anymore. \n\nI was asked most recently, \"what do you want to do, not just today but in the future as a researcher?\". The answer used to be definitive. Now, I lie because the current answer is \"I don't care anymore. I just want to go home.\"\n\nShould I just go home? This feels very much like I'm nowhere at all and my advisor only expresses that he's proud of my work when I am most confused about what he wants from me. I do want my PhD. But when my funding runs out, there will not be anything left in my body to be a full-time TA in year 5.",
        "created_utc": 1675707699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Publishing under a pseudonym",
        "author": "vantreysta",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vdjhf/publishing_under_a_pseudonym/",
        "text": "Hello everyone! I just received my master's degree and my supervisors suggested trying to publish my thesis results. Since I am the first in my family to reach this level of education and I am seriously considering pursuing a PhD and/or a research career, I would like to hyphenate my last name so that it includes my mom's surname (my parents are divorced) to honor both of my parents. Does anyone know if this is something that publishers allow?",
        "created_utc": 1675707010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Follow up email after meeting with a professor?",
        "author": "jjeenniiffeerr",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vcyqp/follow_up_email_after_meeting_with_a_professor/",
        "text": "I had a meeting with a professor for an honours thesis position that I feel went quite well. I’m going to visit the professors lab sometime this week to meet the students and get a feel for the environment. However, I was quite nervous throughout the meeting and when she asked me to speak on what I learned at a previous co-op position, I kind of blanked and just word vomited whatever came to mind for a minuet. \n\nLooking back now I really wish I actually spoke more about my co-op and what I did day to day. I was thinking about explaining that and including my responsibilities and the methods I learned in my follow up email. Would this be weird? Would she really care if there’s already a decent chance I’ll be working in her lab? She does have my resume and could definitely see what I did, just wondering if it would be beneficial to reiterate that? Maybe I’m over thinking this lol, but any thoughts are appreciated.",
        "created_utc": 1675705732,
        "upvote_ratio": 1.0
    },
    {
        "title": "UK Protein Supplement research",
        "author": "AdventurousCow2989",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vc2pb/uk_protein_supplement_research/",
        "text": "Hi everyone. I'm conducting a survey on Protein Supplements for my class project. The survey is in English and completely anonymous. It should take about 1 minute! At the end there is a link for SurveySwap which will reward you with free survey respondents [https://surveyswap.io/surveys/7fed1220-7133-4ca9-9009-6046cdb51373/take-a-survey](https://surveyswap.io/surveys/7fed1220-7133-4ca9-9009-6046cdb51373/take-a-survey)",
        "created_utc": 1675703680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which tools is used for security risk management for organization ?",
        "author": "ictsewa",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10vanjg/which_tools_is_used_for_security_risk_management/",
        "text": "Please suggest anybody....",
        "created_utc": 1675700359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conference Concern",
        "author": "MomoPoPo8",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10va7dw/conference_concern/",
        "text": "Hi I recently got my abstracted accepted in International Conference on Medicinal Chemistry &amp; Rational Drugs - (ICMCRD-23) that’s in Taipei. I was wondering if anyone have any experience with this conference? Or is it a scam. Just their website seems a bit odd to me.",
        "created_utc": 1675699297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you find the books you'll review for a book review?!",
        "author": "Dik_titus",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10v9szr/where_do_you_find_the_books_youll_review_for_a/",
        "text": "Hi folks,\n\nThis might seem like a bit of a dumb question, but I'm just starting out trying to get published in some things that aren't my home university journals. So, in order to do that, I figured a safe bet to wet my toes would be doing some book reviews.\n\nWhat I am curious about - what I've always been curious about - is how people spot these new, and often \"non-popular\", books in which to review so quickly? Like, I'll often hear about them later on or when looking at a particular research topic but these reviewers seems to know exactly when someone releases something on some obscure university press and then can jump straight on the review.\n\nI use the term \"non-popular\" in the sense that it isn't something that necessarily showing up on Amazon, not in the sense that it is work that isn't liked or discussed in the field.",
        "created_utc": 1675698356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Undergraduate Research in Germany",
        "author": "Matsukaze11",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10v8kmg/undergraduate_research_in_germany/",
        "text": "Chemistry major here. In the US, it's pretty typical for us to work part time in a lab during undergraduate. If the university or the professor has enough funding, we'll usually get paid for it. \n \nIs this the case in Germany as well? I'll be spending a semester abroad, and I'm wondering if its typical for German undergraduates to work on research during the semester and be paid for it.",
        "created_utc": 1675695321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hierarchy?",
        "author": "isabellajc",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10v5kt3/hierarchy/",
        "text": "Hi everyone,\n\nI im my third semester of grad school, and my first semester as a PhD. I work very closely with my supervisor (obviously) and another post doc.\n\nQuestion is: Post doc and I have great rapport but I am wondering what is the relationship between PhD candidate and post doc mean to be? Is post doc my “boss”/“superior”. Sometimes when he asks me questions, I feel like he is not really asking, but quizzing me as another proxy supervisor. He also seems to have his hands on the wheel of my PhD project. \n\nNo conflict or rancor, just curious because I am new to academia.",
        "created_utc": 1675687043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone made a website for the literature of the research group?",
        "author": "Super-Government6796",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10v3yw0/has_anyone_made_a_website_for_the_literature_of/",
        "text": "So we have been a little messy with our projects and I've been trying to organize things a little bit, something my PI is quite happy about. He's letting me choose how to organize things, so I usually just pitch an idea and he says whether he likes it or not. A while back I suggested doing a notion like website for organizing literature, something like topic X and then links to the articles/books along with a summary from the paper. I'm not sure if notion might be the best idea anymore because people would have to register. Does anyone know a framework where it would be easy to set up something like that.\n\n&amp;#x200B;\n\nPS: We don't use mendeley or zotero because we quicky run out of space if storing the pdfs and if we are to going to include it we would like something that looks appealing",
        "created_utc": 1675681637,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Weekly] Office Hours - undergrads, please ask your questions here",
        "author": "ZootKoomie",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10v221x/weekly_office_hours_undergrads_please_ask_your/",
        "text": "This thread is posted weekly to provide short answers to simple questions, mostly from undergraduates to professors. If the question you have to ask isn't worth a thread by itself, this is probably the place for it!",
        "created_utc": 1675674012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emailing a professor at my grad program prior to start on academic / career advice?",
        "author": "roy2roy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10v1o6d/emailing_a_professor_at_my_grad_program_prior_to/",
        "text": "Hello all!  \n\n\nI'll be starting a MSc program this Fall. It is my #1 choice, the top 10 in the country it is in and top 20 in the world for this specific program. One reason I applied was a scholar I really admire in the niche area of my field works here, and teaches several modules that are right up my alley. She and I have been emailing off and on for about a year now and even ended up writing a grant LOR for me.   \n\n\nAs most people starting out in grad school, I have insane imposter syndrome and because of that I want to do everything I can to be successful. I really want to reach out to her and tell her I was accepted into the program and ask for advice on how to best prepare for the program, how to plan for long-term success in the program for our career field and prepare for a PhD (likely at the same school), and generally how I can best prepare myself for researching in this field.   \n\n\nWould it be preemptive or presumptuous to ask her to help with all of this, before I am even officially a student? I just want to make myself as competitive as possible in this career. It's a social science so my chances are already stacked a mile high against me.   \n\n\nApologies if this came off as half-baked and disorganized. It also partially took the form of a rant; as you might be able to tell I am stressed lol. Thanks!",
        "created_utc": 1675672410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are professors allowed to skip/be excused to skip teaching their lectures for a certain period of time of time to focus on super important research?",
        "author": "Winston2469",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uwrqp/are_professors_allowed_to_skipbe_excused_to_skip/",
        "text": "Say if a professor was researching, and they believe they are coming on something huge or very important in their research that they need/want continued attention on. Is it a thing for them to be allowed to skip their lectures so that they can focus on it? Would their superiors allow them or would it be something never allowed to happen?",
        "created_utc": 1675655305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Washington State University accept late applications?",
        "author": "Significant_Rule_763",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uwfdw/does_washington_state_university_accept_late/",
        "text": "The priority deadline for Physics grad program for Washington State University is mentioned as 10 January.\n\nDo they accept late applications?",
        "created_utc": 1675654259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tool to Facilitate The Use of PDF Files When Creating Educational Content",
        "author": "parserflow",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uvxhg/tool_to_facilitate_the_use_of_pdf_files_when/",
        "text": "Hi everyone, Could I please get your feedback on a tool I'm building?\n\nWe are working on a tool that helps Professors and Teachers use PDF files to create educational content. It's built for educators who use PDF files as a source to prepare their slides on PowerPoint or other formats, saving time and facilitating the process.\n\nIf this is something you do, please answer this 2min anonymous survey below:\n\n[https://www.surveymonkey.com/r/K9SR7C6](https://www.surveymonkey.com/r/K9SR7C6)  \nI'd like to make sure I'm building something as useful as possible, so your feedback would help a lot.\n\nThank you!",
        "created_utc": 1675652814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-isolation interfering with master thesis",
        "author": "11needtotalkplease11",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uu000/selfisolation_interfering_with_master_thesis/",
        "text": "I don't know if it's okay to ask for this in this subreddit, but long story short, I need some advice from people maybe suffering a similar thing than me. An incident involving death in my immediate friends circle in November kicked me in a deep deep hole of self isolation until now (currently writing masters thesis). Does someone have any advice on how to get out of it? I almost feel like its impossible to do. And I have no clue how to tell the whole story to my PI, who is now reaching out to me.",
        "created_utc": 1675647377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conference Presentation",
        "author": "hireen_the_sin",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10utsc6/conference_presentation/",
        "text": "I'm about to represent my research group in a ML conference hosted and attended primarily by East, South East and Pacific Asia firms and researchers. \n\nWe are asked to do a conference-wide 3-min presentation. I studied in Australia, in a different field, so this is an audience that I'm not familiar with. My question is how should I structure my presentation and approach this audience?  \n\n\nShould I not try to break the ice and just approach it formally (since my assumption is that they are more formal and conservative than what I'm used to?) to avoid looking unprofessional, or is there any helpful tip in this situation?",
        "created_utc": 1675646807,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about contacting professors about research projects",
        "author": "nomarkoviano",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ushf2/a_question_about_contacting_professors_about/",
        "text": "Hi r/AskAcademia. 1st Year PhD student from Latin America, Stem, Physics (Quantum Info).\n\nI have a question about etiquette in academia. \n\nRecently it came to my attention that a professor from a reputable institution, from Poland, posted a PhD oppening in his department for a project I'm deeply interested in, and which is closely linked to my own PhD project. However, I am already enrolled in an institution here in my home country I'm deeply satisfied with, with a really good PI, good salary, close to family and the likes, and I do not really feel like semi-permamently moving half-way across the world would suit me.\n\nHowever, since the project deeply interests me, I was wondering if it would be well received to contact said professor, introduce myself and talk to him a bit about my own research -since i'm already in the process of publishing my first paper so I think I could \"build\" a strong case on how this bridge could benefit the both of us-. All of this in the hopes for a future collaboration. \n\nIs this something that can be done in Academia or would I be overstepping a bit?\n\nThanks so much for reading.",
        "created_utc": 1675643384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resource/book recommendations for traditional printmaking",
        "author": "Artists_proof",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10urqor/resourcebook_recommendations_for_traditional/",
        "text": "[removed]",
        "created_utc": 1675641539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Korean Mix Hindi Songs 💗 Korean Drama 💗 Korean Lover Story 💗 Chinese Love Story Song 💗 Kdrama World",
        "author": "Significant_Use_3639",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ukr4n/korean_mix_hindi_songs_korean_drama_korean_lover/",
        "text": "[removed]",
        "created_utc": 1675624601,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"read\" even really mean??",
        "author": "NotnotNeo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ujtoa/what_does_read_even_really_mean/",
        "text": "PhD student here. My best reading is slow. But we're expected to read a lot. The most rigorous reading regimens I see is 3-4 papers/week with a 2-page write up, per class.\n\nThere's no chance that actually works out for me. I tend to read maybe half-3/4 of each of 3 of the assigned 4 and then I write fine write ups. \n\nDo you actually read everything? Are we actually expected to? Or are professors really just throwing some papers at you and seeing what sticks (i.e. we self manage our own output)?",
        "created_utc": 1675622425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone transitioned from teaching chem/bio to industry? How did you do it? 5 years trying and still hasn't worked for me.",
        "author": "il_chimico",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ujf2k/has_anyone_transitioned_from_teaching_chembio_to/",
        "text": "I'm sure you've seen variations of this question before, but I am trying to pin down a tangible and doable strategy to transition out of academia and into an industrial position. I need to know how to actually make myself desirable for an industry position because it seems that my current profile doesn't even get me to an interview anymore. I need to know from those who made it across what worked for them. If you say networking, what do you mean exactly? Talking to strangers on LinkedIn and asking for their advice or getting insights from them on their day-to-day work tasks hasn't helped me. Asking them straight for career advice/help with referrals is repulsive to them. Going to career fairs full of people in my shoes competing for the same positions was a waste of time. I have changed my resume in so many ways following the advice of \"career experts\" to no avail. I'm now considering paying for one of those overpriced career coaches to help me with it, but I need to know if they are even worth it. Why is it nearly impossible to move out of teaching science to doing it? I have learned a ton about how things work in industry, including the difference in pace, the teamwork, the needed humility and lack of ego, the can-do mindset, the ability to drop ideas and projects on short notice, the extended work hours and lack of time-off, etc. \n\n**Should I just give up and stay in a career I hate? Should I quit my job and get a postdoc first (50+% pay cut) to make myself more marketable? Should I lie on my resume and say I don't have a PhD just to get an entry-level position? Thank you.**\n\nFor context, here is my story...\n\nThroughout my Ph.D. (synthetic and inorganic chemistry) I always thought that I would get a job in industry right after graduation as a synthetic or analytical chem scientist, chemist, or something of that sort. Visa and work authorization were never an issue for me luckily. I started applying in the last few months before graduation (2017) and was quite optimistic. Attended conferences, networking and career fairs, grew my LinkedIn network to 500+, and followed career advice from \"experts\" on resumes, interviews, etc. However, over a year later after graduation, I was unemployed, still looking and nothing was working for me. None of the interviews yielded anything and the closest I got was making it to the third interview for an applications scientist. I ended up taking a job at a very prestigious high school to teach chemistry so I can pay the bills. It's now 2023 and I've been teaching high school while applying for industry positions all throughout this time. I did teach a couple of college courses during this time just because I was missing higher-level chemistry. I have been doing research on the side with some of my students (my school is rich enough to spare a small grant) and I do have recent publications, even though I realize they are useless for industry jobs. I'm now very close to giving up on industry because it seems like I have no way out of teaching. Is there a way out?",
        "created_utc": 1675621458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need huge help for literature review",
        "author": "imabouttolloseit07",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ujbrj/need_huge_help_for_literature_review/",
        "text": "Hi everyone, I don't know if this is the most appropriate sub but I am trying everything. I need to do some kind of \"literature review\" of several very broad and general topics, specifically for each of them I should find the most widely used technologies and the functions enabled by them and possibly some application cases in the literature. I don't really have a specific thesis or research purpose, I just have to describe the field in a general way. \nThe problem is that I have never done such work, have no guidance from my professors, and have been given very little time to do it.\nI would like some advice on how to approach the work and how to find the most relevant papers. Any advice is welcome as the situation is really desperate.",
        "created_utc": 1675621238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduating in Computer Science but unsatisfied; Have an interest in graduate school but have some worries.",
        "author": "max10lock",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uiwjg/graduating_in_computer_science_but_unsatisfied/",
        "text": "Hello, I am graduating in computer science in a year however, coding to me is sadly no longer my passion. I had an internship last summer and I realized this while working. I tried very hard to get back into it but I have to just accept that it's not for me. The problem is that I am graduating and I feel (financially) like it's too late to switch my major. I've always been an avid reader and I have over the last year reignited an intense passion for humanities. My last few months have consisted of hours and hours a day of reading literature and learning a language. My mom, who worked in academia, has been telling me that graduate school is very open and that I should finish undergrad and then I can pursue what I am really passionate about (for far less money than undergraduate school). I don't really have anybody to talk but I'd like to know if what my mom says is true and that I can redirect my career once I graduate undergrad. How realistic is it for someone who studied computer science to end up studying a subject in the humanities in college? To me, it sounds ridiculous yet I feel my desired future is depending on such a possibility.",
        "created_utc": 1675620240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing a region to specialize in",
        "author": "veryquietdon",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ui8si/choosing_a_region_to_specialize_in/",
        "text": "I’m currently a first year student studying international relations. I still haven’t decided which region to specialize in. I don’t fill particularly strong sympathy or antipathy to any region, but some have always been more interesting for me because of their exoticism (notably Southeast Asia and South America). I can speak English, Russian and Modern Greek to various degrees. Should I choose Eastern Europe as my specialization since learning Ukrainian and Polish won’t be too difficult? Or MENA is still the most critical area in the subject? An important note is that the most critical factor for me is marketability and ease of finding either a job or an academia position",
        "created_utc": 1675618640,
        "upvote_ratio": 1.0
    },
    {
        "title": "This one weird trick (/s)",
        "author": "berryaroberry",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uhmlk/this_one_weird_trick_s/",
        "text": "If you in cs, join a research place somehow where you can get interns and do ml stuff. earn research paper currency like heck.  /s",
        "created_utc": 1675617179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduating in Computer Science but unsatisfied; Have an interest in graduate school but have some worries.",
        "author": "MSan10x",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uhln4/graduating_in_computer_science_but_unsatisfied/",
        "text": "Hello, I am graduating in computer science in a year however, coding to me is sadly no longer my passion. I had an internship last summer and I realized this while working. I tried very hard to get back into it but I have to just accept that it's not for me. The problem is that I am graduating and I feel (financially) like it's too late to switch my major. I've always been an avid reader and I have over the last year reignited an intense passion for humanities. My last few months have consisted of hours and hours a day of reading literature and learning a language. My mom, who worked in academia, has been telling me that graduate school is very open and that I should finish undergrad and then I can pursue what I am really passionate about (for far less money than undergraduate school). I don't really have anybody to talk but I'd like to know if what my mom says is true and that I can redirect my career once I graduate undergrad. How realistic is it for someone who studied computer science to end up studying a subject in the humanities in college? To me, it sounds ridiculous yet I feel my desired future is depending on such a possibility.",
        "created_utc": 1675617112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supervisor who micromanages is wearing me down",
        "author": "Comprehensive_Bus575",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ugx7u/supervisor_who_micromanages_is_wearing_me_down/",
        "text": "Hi.\n\nSo, I'm an MSc student  and my PI/supervisor is too hands on, in my opinion. First of all, we are a bioinformatics research group. The work that we do does not necessitate us to be at campus everyday, however she insists we go. In the morning when I see her, she wants to have a 'quick' chat about an idea she had about either my project or someone else's. These 'quick' chats more often than not turn into 6 hour long meetings leaving me so exhausted at the end of the day. This happens EVERYDAY. Every semester we decide on a regularly meeting schedule but that is never adhered to because of her seeing us everyday. She has her own office but she refuses to use it and has a desk where all the MSc and PhD student sit. One of her PhD students has a desk next to hers. This disables me to make any meaningful progress with my work.\n\nThe way I describe her is 'a bull in a china shop. She'll come in the morning and shout my name. And when she sees me she'll want to talk about some concept she thought of and before I can even respond she'll want to sit next to me and go over said article together. With paper and pen out drawing diagrams to explain things to me which are so simple its embarrassing. Everything we do, every line of code we write she first wants us to run it by her before doing it or she'll want to do it with us. Simple things like unloading items off a truck she wants us to write down step-by-step how we plan on taking the items off the truck. \n\nMany times when she gives me a task, before I can even start she'll wave for me to sit down with her and she'll teach me how to do a spreadsheet. One time she was standing over my shoulder when I was trying to gather some paper on a subject teaching me how to do a lit review:\n\n\"Look for the paper. Yes, now highlight the results section. Yes, now copy and paste it into a word document. There! Thats a lit review!\"\n\nIt was so embarrassing one other supervisor was looking on in confusion.\n\nOne of her previous students, when she gave her her MSc thesis draft, they spent an entire month editing the manuscript together, staying at campus till late at night. She'll have students stay at her house to finish documents etc together till late at night. One  student had to sleep in her son's bed.\n\nShe doesn't get along well with the other PI's and there's one PI who will tell me \"good luck\" before mine gets to campus.\n\nAt first I though I was an idiot but all of the members in my groups go through all of this with her.\n\nHow common is my situation? Am I complaining too much or is there valid concern to take this up with the Head of the Department?",
        "created_utc": 1675615465,
        "upvote_ratio": 1.0
    },
    {
        "title": "MPhil Biological Science at Cambridge vs Masters at Manchester/King’s College",
        "author": "Sea-Fix-4464",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10uf17e/mphil_biological_science_at_cambridge_vs_masters/",
        "text": "Hii Guys, I am a physician from an LMIC and to pursue my research interests, I decided to go for a master’s. I have received offer from all 3 of these, however I am not sure as to which would be better. The coursework in Manchester is more comprehensive and looks better on the surface whereas at Cambridge it is rather more specific towards one particular field. I am not sure which of these would be more beneficial considering that I would prefer to pursue a PhD in mainland Europe. However just the thought of being a part of Cambridge is exciting. Also, I am yet to hear from the Swedish Universities (Karolinska, Uppsala, and Lund).\n\nAny advice from you all is appreciated on student life, support system, tie ups with industry and other institutions, future prospects, and worldwide reputation.",
        "created_utc": 1675610691,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am an English Literature postgrad student, need help with masters thesis.",
        "author": "tempestinforest",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10udp60/i_am_an_english_literature_postgrad_student_need/",
        "text": "I am trying to do my master's thesis on the villainisation of female sexuality in Hollywood. \n\nWill anyone please suggest certain films accordingly? Also, I am worried that this may already be an explored area, will anyone suggest how can I make this authentic and unique?",
        "created_utc": 1675607204,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Non-US] What is academia like in your country? (Physics)",
        "author": "guava_appletime",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ua2cf/nonus_what_is_academia_like_in_your_country/",
        "text": "Hi all, I'm studying Physics &amp; Astronomy and I'm in my second year of undergrad here in the US. I've wanted to emigrate for a while now for personal reasons, and as I get older my desire to do so has only grown, and I've also only become more willing to put in the effort to see this through. While I do have a few specific countries in mind already, I want to know more generally -- what is academia like in *your* country? Both the good and the bad, please. Responses from physicists are obviously the most relevant, but I'll still appreciate input from everyone :)\n\nMy current plan is to graduate from my current institution, then apply to foreign Master's programs and either attend right away if granted a scholarship, or stay in the US saving up money until I have enough to attend. After that I want to get a PhD, and while the dream is to work in academia, I know that it's pretty saturated and I have no qualms with ending up elsewhere after my PhD.",
        "created_utc": 1675595080,
        "upvote_ratio": 1.0
    },
    {
        "title": "International Lab Tech at a US University/Institution? (Biomedical)",
        "author": "NorthAd7013",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tzfnw/international_lab_tech_at_a_us/",
        "text": "Has anybody at a US university/institution ever hired/worked with a lab technician (e.g. a recent college graduate before going to grad school) from abroad? My guess was that it would be difficult to sponsor a visa for a lab technician, but I would like to hear about others' experiences.",
        "created_utc": 1675566706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is that possible enough to achieve this without much experience?",
        "author": "Jarod-TheTaxiDriveR",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10txwn0/is_that_possible_enough_to_achieve_this_without/",
        "text": "I will get my master's in May this year and want to start a teaching career at a college level in the STEM field. Ofc, I will be having 2 years of teaching experience as a TA. However, I'm concerned that it is not gonna be enough to start at the college level due to a lack of experience, especially in large class settings although many community colleges and some colleges include masters in their faculty members. I want to ask your opinions about this considering your past experience or anyone you know, who managed to do this in the past.",
        "created_utc": 1675562227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would I seem desperate if I extend a position to two years?",
        "author": "not_throwaway3357",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10twdnu/would_i_seem_desperate_if_i_extend_a_position_to/",
        "text": "I emailed a professor about an RA position and she asked for the duration of time that I would be able to hold the position. I said 1 year and I haven't gotten a response since I replied three days ago. Should I follow up and update the duration to two years? I think I'm fine with taking a longer leave of absence, I just didn't consider the option before. Would I seem too desperate?",
        "created_utc": 1675557916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I reach out to a professor on Facebook Messenger who is on sabbatical about writing a letter or recommendation?",
        "author": "potatomawnster",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tvn30/can_i_reach_out_to_a_professor_on_facebook/",
        "text": "Title pretty much explains it. I graduated in 2017, I moved across country and back for employment reasons. My current employer offers education benefits so I want to use that for an applied math MS since I am now settled down. My previous role in the same company had me constantly moving throughout the country, making grad school difficult. My current manager agreed to write a letter for me. For the other two letters, I intend to contact the two professors that were leading an undergrad research project that I was part of. I intend to submit my application for Summer 2023 —finalized before May.\n\nIn the 5 years time gap, I have reached out to these two professors several times to talk about the research, etc. and we are on pretty good terms. I have also stated multiple times that I intend to eventually go into grad school. They've both agreed to write me letters of recommendations every time I've brought it up. I tried to visit them recently and one of the professors agreed. However, I learned that the other professor is away on sabbatical until the end of this year; their work email and phone cannot be used to contact them in this time period.\n\nI desperately looked all over to find ways to reach out to this professor. I found his Facebook profile. Would it be inappropriate and weird to reach out to him via Facebook?\n\nA few things about the profile:\n\n* He lists his profession on his Facebook profile.\n* The profile doesn't seem personal; mostly work content and his pets.\n* The profile was recently updated with pics of his sabbatical; it is an active profile.\n* There were many of other faculty members, current and former researchers interacting with his profile.\n\nGiven this context, would it be weird to reach out to him and ask for the letter of recommendation via Facebook? I can ask the other faculty members if there's any other way to reach out. Otherwise, Facebook is the only way. If it's weird, what other alternative is possible to obtain that third letter of recommendation?",
        "created_utc": 1675555894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it ok to email most profs in a department?",
        "author": "not_throwaway3357",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tuzjf/is_it_ok_to_email_most_profs_in_a_department/",
        "text": "Trying to become a research assistant. Genuinely interested in all things psychology related and would like to get into basically any psych lab. It would be so much better than getting into a bio lab for example. Would it be ok if I emailed most profs from one school's psychology department? I spend a lot of time on individual emails to make them personalized and read through one research paper from each professor. Honestly I feel like I might get into a lab a long time before I get to email everybody because many don't seem to have many co-authors so I'm assuming they have a lot of open positions, but just asking in case this scenario happens",
        "created_utc": 1675554153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just bombed an interview for a tenured track assistant prof position",
        "author": "smndoo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10ttv19/just_bombed_an_interview_for_a_tenured_track/",
        "text": "I'm a postdoc, and I recently did an interview for an open position from the same faculty that I'm in. My supervisor gave a strong reference to the chair, legit he said 'I'd hire her if I can'.\n\nSo I believe that's how I got the interview scheduled.\n\nDuring the interview, I think I answered research related + teaching related questions pretty well. But the very last question was about the EDI (e.g., what can you contribute to the school's practice relating to EDI). \n\nSurprisingly, I didn't expect the question, and I didn't have a prepared answer, so I literally said 'all my research is about EDI (which is true, since my research topic is all about it), and then I started coughing because I'm still recovering from Covid and the chair knew about it. My brain went empty, so I basically then said, 'My background is more than, no sorry, I'm sure everyone is inclusive... 'I'm sorry, I'm sweating,' Then the chair pretty much said, \"I'm sure doing this with Covid is challenging... do you have anything you want to highlight for us?\"\n\nThen, I stupidly asked a question about a department plan in return... I don't know why I did that... \n\n&amp;#x200B;\n\nSigh...\n\nNow, as far as I can guess, there were about 15 candidates in this round, and there are three positions, and I heard about 5 are going to the next round... What's the odd chance here for me..? I'm pretty sure I looked like an insane person at the end, but can this mark to the search committee a strong No ..? even though my research is all about, and is at the top tier..?",
        "created_utc": 1675551234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reaching out to former professor to say thank you — weird?",
        "author": "harmlesshumanist",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tt3e1/reaching_out_to_former_professor_to_say_thank_you/",
        "text": "This was an undergrad physics professor from about 15 years ago.  \n\nWe were not especially close but we had a good rapport and I took several courses from them (my major).\n\nThey were a fantastic educator and an amazing person.  \n\nI ended up shifting to a different field but I’ve done pretty well and my current role has me teaching a fair amount - this professor is definitely someone that I try to channel when I teach.  \n\nWould it be weird to reach out and thank them?  \n\n(ie given length of time that passed, our relationship was great but probably not notable or special for them, I’m not in the field anymore)",
        "created_utc": 1675549264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sensitively criticising grammar in a manuscript",
        "author": "Chlorophilia",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tsvgi/sensitively_criticising_grammar_in_a_manuscript/",
        "text": "I am an ECR and am quite new to reviewing manuscripts. The manuscript I am currently reviewing has been written by authors whose first language is not English. Almost all of the manuscript is understandable (with a couple of exceptions that I have obviously had to mention explicitly). However, there are many sentences that are grammatically incorrect (in the sense that a native speaker would immediately pick up on it), but it is still clear what they mean.\n\nWhat is the etiquette in situations like these? I have had co-authors in the past who have been very upset by reviewers criticising their English, and I am obviously not going to be rude. But should I mention this at all (aside from situations where a sentence is genuinely not understandable), or should I just leave it? I am not sure whether fixing grammatical mistakes is something that takes place during the copyediting process.",
        "created_utc": 1675548707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ways to find a postdoc position for a 2019 graduate",
        "author": "Slima-s",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tsq2s/ways_to_find_a_postdoc_position_for_a_2019/",
        "text": "I am a doctor in applied mathematics, specializing in control theory. I am looking to join a research team in the fields of control and delay dynamic systems. \nI live in Morocco, but I am open to all proposals.",
        "created_utc": 1675548335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problem if Poster and Abstract are Incongruent?",
        "author": "Ps1kd",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tsk2s/problem_if_poster_and_abstract_are_incongruent/",
        "text": "I've got my abstract accepted for an upcoming poster presentation. Unfortunately it's too late to edit my abstract at this point, but in my original abstract I highlighted some findings that I'm thinking of not including on the poster. Would this be an issue? Obviously they're not going to reject my presentation, but is this frowned upon and/or would it impact competing for poster awards?\n\nFor one set of findings it's because including it on the poster would make it too cluttered in my opinion. The other set of findings being left out are because new data does not support the conclusions we drew in the abstract (nothing I can do about this now other than present the new data which goes against the abstract's conclusions anyways).",
        "created_utc": 1675547951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused - when do I start PhD applications [EUROPE - Master's student]",
        "author": "la_valse_",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10trb37/confused_when_do_i_start_phd_applications_europe/",
        "text": "Note: This is for PhD studies in Europe.\n\nThis summer I will finish my master's degree (natural sciences) and my wish is to continue with a PhD right after. I asked my professor about it, and he said that it's pointless to make PhD applications before I have my master's degree. But is it generally like this in Europe? If so, it seems rather impossible to get a PhD starting in autumn -23, because I would (best case scenario) get my master's degree perhaps mid summer since all the administration and documentation takes time.\n\nWhat's your experience? Is it worthwhile for me making applications now, or is it just a waste of time? Have you been able to get a PhD position right after your master's (in Europe), before actually getting the master's certification?\n\nThanks.",
        "created_utc": 1675544806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Public health career with interest in endosymbionts",
        "author": "BacillusBoss",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tqpzo/public_health_career_with_interest_in/",
        "text": "Does anyone here work with Rickettsia/ Wolbachia/other endosymbionts and/or within the sphere of medical entomology/intracellular bacteriology in general? I’m an undergrad hoping to hear about career trajectories if anyone has time!",
        "created_utc": 1675543318,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some useful websites relating to academia like webofscience or pubpeer?",
        "author": "srisri01",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tq3ty/what_are_some_useful_websites_relating_to/",
        "text": "Like websites you use on a regular basis plus websites where you can get useful information and insight",
        "created_utc": 1675541804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Informal notice of admission",
        "author": "BlueHorizonAhead",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10toevl/informal_notice_of_admission/",
        "text": "Question: do PIs generally let you know they’re going to admit you prior to requesting funding for you? Or after/once you get funding?",
        "created_utc": 1675537625,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Use AI to Find The Best SEO Keywords",
        "author": "Puzzleheaded-Ad-5555",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10to0zd/how_to_use_ai_to_find_the_best_seo_keywords/",
        "text": "[removed]",
        "created_utc": 1675536724,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m writing an introduction for a lab report and I’m wondering if I would need to cite the following information: “Prokaryotes are widely known to lack introns.” I believe this is common knowledge but don’t know if I should cite it.",
        "author": "Jolly_Flounder_9285",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tn6e9/im_writing_an_introduction_for_a_lab_report_and/",
        "text": "☝️",
        "created_utc": 1675534648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Like my current research work but do not feel I fit in the location...?",
        "author": "orangecat2022",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tmluz/like_my_current_research_work_but_do_not_feel_i/",
        "text": "I am a staff researcher at a research institute in a relatively remote city. Tbh I like the research topic, my manager is a supportive person, even for my crazy research ideas, and is willing to give me growth opportunities. I've been in this institute for 3 years. First two years as a postdoc then transitioned to full-time staff. \n\nI feel the location &amp; environment -outside- of the lab have been draining me inside out though. \n\nThe city is at the other end of the spectrum from all of the places I lived in before in terms of size, culture, and diversity. I have a hard time fitting in and finding similar-aged groups. My hobbies that I've been doing for decades almost do not exist here. \n\nI am constantly thinking if this is a sign that I am not dedicated enough to my research...? Cuz a lot of research institutes sit in remote/small cities, like college towns etc. And a lot of researchers seemed to be self-entertained and do not need to hang out with people as much. \n\nSwitching job immediately is probably not a good strategy for my career pathway. My solution for right now is to load myself with research work 7 days a week because by nature research work can extend on and on. Not the healthiest but at least I don't have room for feeling unsatisfied. \n\nI was wondering if anyone has been in a similar situation before. How did you cope with this situation?",
        "created_utc": 1675533295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters in cognitive science of language use",
        "author": "maxy333k",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tmcdu/masters_in_cognitive_science_of_language_use/",
        "text": "Hey Everyone :)\nI am finishing a bachelor's degree in education, specialized in teaching English as a second language, and I am thinking about doing a Masters in cognitive science of language use. I love the field of language acquisition, bilingualism, and linguistics in general. Is this Masters a good track to take? Has anyone done that degree and can specify what you learn in it? What are the careers I can take after that degree besides academia?",
        "created_utc": 1675532671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my PI being inappropriate towards me?",
        "author": "whimsicalthots",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tli99/is_my_pi_being_inappropriate_towards_me/",
        "text": "Hello! Any input and/or advice is appreciated here. Thanks in advance!\n\nI’m a Senior undergraduate (F23) working with a faculty mentor (M51) on an independent research project. I’ve known this professor for close to two years now and have been working with them closely for one. As we’ve begun working together more closely, our relationship has changed and I’m not sure whether it’s inappropriate.\n\nWe meet every other week and have been doing so consistently for the past 10 months. When we first started meeting regularly, our meetings would last about an hour and stayed strictly on the topic of research. However, over the past few months, our meetings have gotten progressively longer (~2 hours) and are becoming less research-oriented and much more personal.\n\nAt first, we’d end our meetings by talking about a shared hobby of ours, but recently the topics of conversation have become far more personal, particularly on his end. For instance, he’s told me about his previous marriages, his childhood trauma, history of self-harm, and relationship troubles, all without me prompting or asking, or being forthcoming about my own personal issues. \n\nAs I said earlier, these meetings are now running two hours or more, and we’re often among the last people to leave the department for the day. And these meetings are getting less and less about my research project. In fact, we spend less than 15 minutes, on average, discussing my project in our meetings, and we won’t talk about it unless I bring it up.\n\nI don’t necessarily mind having personal conversations with him, but am confused as to why he’s decided to share all this information with me. From what I can tell, he doesn’t talk to his graduate students this way. Is something bad happening here? Or am I just being weird about it?\n\nNote: As far as I can tell, he’s not trying to hit on me or come on to me in any sort of way. He doesn’t contact me excessively outside of meetings and has never made me feel uncomfortable in any other way. He’s just like this when we meet in his office. \n\nTLDR: My faculty mentor/PI has started sharing a lot of personal things with me during our now multi hour meetings that are supposed to be about my research project. What’s going on? Is this appropriate?",
        "created_utc": 1675530683,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to ask for postdoc offer extension",
        "author": "LiquidNitrohen",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tlfi5/how_to_ask_for_postdoc_offer_extension/",
        "text": "Hi all, I'm looking for a STEM postdoc position and got leads in two ivy league universities (A and B). A has just offered me a position with two weeks to decide but I really like B better (location, project, PI). I've let B know my situation and the PI suggests that I ask A to extend the offer for two more weeks so he can confirm his funding. I really would like to follow through B but A is too good to throw away too. How can I properly handle the situation??",
        "created_utc": 1675530507,
        "upvote_ratio": 1.0
    },
    {
        "title": "negotiation",
        "author": "ProtectionOk2116",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tizyg/negotiation/",
        "text": "I just had a campus interview for a TT position at a top regional university. During the meeting with Dean, he told me the exact salary, along with other benefits (such as start-up fee and moving expense). He said clearly that the salary is not negotiable. However, does that mean the other benefits (like start-up) are also not negotiable?",
        "created_utc": 1675524446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on publishing a paper",
        "author": "Diplocriterion",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tenwf/question_on_publishing_a_paper/",
        "text": "I'm a PhD student and I'm gonna submit my paper in about 3 days time.\n\nDuring this time I had to make many revisions for my toxic supervisor who has poor communication skills.\nHe gave me the green light to submit my paper already.\n\nLets just say there are five versions of this paper. I wrote the first 4 intensely. For the fifth he kind of put his input on it and he's totally butchered it and it has become a horrible paper that he is somehow confident with.\n\nSince the 4th version is best. I am going to submit that one instead of the 5th.\n\nMy question is, when I submit a paper, does the journal send a copy of what I submitted to all co-authors or just the corresponding author? \n\nIf they send a copy to co-authors, then my professor will figure out that I've sent my 4th version and not the 5th which could potentially lead to an argument (he can get argumentative).\n\nKind regards",
        "created_utc": 1675511530,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice for business students taking law classes",
        "author": "iGlinavos",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10te1m3/advice_for_business_students_taking_law_classes/",
        "text": " I teach a lot of students from the MBA who are taking a law module for the first time. Here is my advice on how to cope. I hope you find this useful and tell your friends about these tips, as it will help ease a lot of anxiety [https://youtu.be/KMa4lAH5RJI](https://youtu.be/KMa4lAH5RJI)",
        "created_utc": 1675509143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently got an offer, but afraid of the job market later on",
        "author": "VladimiroPudding",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tdsy9/recently_got_an_offer_but_afraid_of_the_job/",
        "text": "First off all, I apologize for this post because, due to this season, I suppose this sub is being filled with similar posts of people who got just got offers.\n\nThis week I got an offer from a good PhD program in Political Science. Perhaps I have read too much pessimistic stuff on the internet in the last years, but the truth is that instead of celebrating, I am silently terrified I might be doing a mistake. It might come as a ridiculous take, but truth is that I'm deeply afraid I'll end up unemployable in my mid-to-late 30s, with a diploma that will be of zero use in the third world country I am from in case I have to go back home after my PhD. So I come here to hear from you guys and make an informed decision.\n\nAdditionally, I'd like to be better informed on how to build a plan B. It might sound bad to think about a plan B and I didn't even accept an offer yet, but other than being aware of the reality of the academic job market, I also know that during my PhD I might discover academia is not for me (as much as I love research, I know there's a possibility I end up not liking the so-called \"publish or perish\" culture). Ideally, I'd like to have some assurance I would find any related job in the US after graduation as coming back is a bad idea due the aforementioned reasons.\n\nIf this information helps, I have years of experience with legislative analysis for the private sector as a government affairs professional, and a solid quantitative experience as well, especially with my years as RA for economists. The program also is well regarded as strong in methods (I hope to follow the Methodology path), so I don't know if (and how) I can leverage that for a \"Plan B\".\n\n&amp;#x200B;\n\nThanks for any advice!",
        "created_utc": 1675508289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would that breach ethics or not",
        "author": "Feniks_Gaming",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10tdrvr/would_that_breach_ethics_or_not/",
        "text": "I have an essay to write on a topic \"Explain the legislative framework for health, safety and risk management in the work setting\"\n\nSo here are steps I take and please read to the end because this isn't your standard post on getting bot to do your homework.\n\n1 I ask chat gpt what would be a good outline to cover this topic. I modify this outline and use is as my base. \n\n2 I use ChatGPT to list some legislations worth covering and give me a brief summary of each based on that I evaluate which are worth looking at\n\n3 I then go to each legislation website on government website read on each of them and based on that I write the essay. \n\n4 I provide sources and citation as usual \n\n5 I use chatGPT to read my essay and suggest improvements it comes up with a list of 5\n\n6 I do the Changes chat suggest like expand paragraph X, add more examples in paragraph Y and rewrite introduction to be clearer. \n\n7 I repeat step 6 few times till I feel I have a good essay and suggestions improvements aren't worth the effort\n\nI had someone say it's unethical and others say it's fine. 100% of my work is hand written and uses sources that I cite. Only work Chat does is a brainstorming session I don't copy any work from it and always go to the source chatGPT suggest to verify accuracy \n\n4 Using information",
        "created_utc": 1675508175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a bias against Independent Researchers in Academia",
        "author": "davebothehobo",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t8932/is_there_a_bias_against_independent_researchers/",
        "text": "Title says it all. \n\nI live in the united states and my research is at the intersection between Political Science and Computer Science (with some Econometrics thrown in for good measure). I'm currently organizing my research and visualizations in preparation for writing a paper. However, I've been worried that my unaffiliated status would make being published more difficult. Is there a bias against unaffiliated researchers in academia? If yes, are there things that I could do to mitigate the bias?\n\nSome extra info:\n\n* There are almost no papers studying this \n* This is the first paper that I am submitting for publication\n* I do not have a master's/phd\n* I do have an advisor (who was my department chair ) who is guiding/mentoring me through this process",
        "created_utc": 1675496631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navigating a Challenging Ph.D. Journey: Seeking Advice on Quitting or Persevering",
        "author": "khandriod",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t7rev/navigating_a_challenging_phd_journey_seeking/",
        "text": "am currently facing a challenging predicament in my Ph.D. journey and I am in dire need of guidance on whether to persevere or to abandon my Ph.D. journey. I am in a Ph.D. program in an Asian country.\n\nTo provide some background information, I was awarded a home scholarship from my home country that covers my living expenses and tuition fees. Unfortunately, the amount from my home scholarship was not enough to sustain my living expenses and tuition fees. To mitigate this issue, my Principal Investigator (PI) provided additional financial support. In addition to my home scholarship, I was also awarded a matching scholarship upon admission to the Ph.D. program. This scholarship covered 100% of my tuition fees, with 50% being provided by the department and 50% by the university.\n\nMy relationship with my supervisor has been fraught since the beginning of my Ph.D. journey. My supervisor is an Assistant Professor, and I am his first Ph.D. student. Over the course of three semesters, my supervisor had high expectations of me but failed to provide constructive feedback or direction when I encountered challenges in my research. Instead, he frequently micro-managed me by requiring daily research reports and holding meetings with me three times a week.\n\nIn the second semester, my supervisor abruptly cut off the financial support he had been providing me. When I asked for the reason for the cut, he became angry and told me to leave the lab or work for free. He then put my belongings outside the lab when I attempted to leave. I attempted to seek out other advisors, but due to the strong cultural influence in the Asian community, no one was willing to supervise me. Eventually, I was able to convince my supervisor to continue working together, but he restricted me from using any lab resources, providing financial support, or seeking help from my lab mates. After taking a one-month vacation, I returned to the lab and was given a new research topic with only two keywords. Despite my efforts to communicate my progress through weekly reports and conference paper ( that he did not submit), my supervisor criticized my work and eventually terminated my scholarship and financial support.\n\nI have recently involved the department to address this issue, and I have a meeting with the department chair scheduled for next week. The absence of support and feedback has left me feeling discouraged, and I am struggling to pay my tuition fees for the final coursework I need to complete. However, I have already completed the required credit hours for my degree, and I am now paying high fees for zero credits.\n\nIn conclusion, I am in a difficult and stressful situation, and I am seeking advice on whether to continue my Ph.D. journey or to abandon it. Any guidance would be greatly appreciated.",
        "created_utc": 1675494732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any websites like PubMed for nonmedicine topics?",
        "author": "fucose-kinase",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t4yqi/any_websites_like_pubmed_for_nonmedicine_topics/",
        "text": "Hello,\n\nI have been working in medicine a lot and I found PubMed has been extremely helpful in collecting resources for literature review. I often use its import function, marking the articles, and download a csv list of all the files. Also, the filters are very easy to help me follow my study constraints (must be not older than 5 years, etc.)\n\nHowever, as I am now working on grad school, I am shifting into machine learning and chemistry for my next lab project. I think Google Scholar is a little bit limited for my usual task in PubMed, and I might need a better alternative.\n\nAny suggestions would be kindly appreciated. Thank you.",
        "created_utc": 1675484958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best paying MFA in writing?",
        "author": "Potential-Berry9059",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t4k39/best_paying_mfa_in_writing/",
        "text": "Been trying to get some answers on this. I'm going through the application process now and it seems like most MFAs generally pay a pretty standard 15k or so for teaching stipends. Which is fine, but I was curious: what's the highest paying one? Not that money is the only reason to apply or anything, but it can't hurt to know where the money is. \n\nHighest paying ones I've found:\n\n1. Northwestern MFA+MA=37k now\n2. Michigan MFA=35,000\n3. Cornell MFA=30k\n4. Virginia MFA=30k\n\nAny I'm missing here?",
        "created_utc": 1675483643,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get started on a big research paper?",
        "author": "StillSilentMajority7",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t2trz/how_to_get_started_on_a_big_research_paper/",
        "text": "I'm tasked with writing a 50 page paper on finance.  Needs to have original research.\n\nI'm ok with picking a topic, but having a hard time organizing my thoughts, and just getting started.\n\nAre there good websites, or Apps, to help one organize a thesis-type paper?\n\nGrateful for any tips",
        "created_utc": 1675478319,
        "upvote_ratio": 1.0
    },
    {
        "title": "MSc International Relations at LSE or MPhil International Relations at Oxford University?",
        "author": "0nismic",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t2aej/msc_international_relations_at_lse_or_mphil/",
        "text": "Hi! This is my first time posting on Reddit so sorry if this isn't the right place to get advice on this topic, or if I've formatted anything weirdly. \n\nBasically, I just got accepted to the MSc International Relations program at the London School of Economics and Political Science for next year, but I am conflicted about what to do if I also (somehow) get accepted into the MPhil International Relations program at Oxford University. Both are amazing, but the Oxford University program is 2 years, which I think I might prefer to the 1-year master's degree at LSE. I also plan to enter a Ph.D. program in the future and I've heard they often prefer 2-year master's degrees over 1-year master's. Career-wise, I hope to go into academia/research, rather than any governmental position. \n\nDoes anyone have suggestions on what program would be best to attend if I happen to get into Oxford? Will doing the 1-year master's at LSE put me at a disadvantage in getting a Ph.D. in the future? Which is better for my career plans? \n\nAny advice is super appreciated :)",
        "created_utc": 1675476706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you an academic \"nepo baby\"?",
        "author": "OwnEntertainment99",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t0ugh/are_you_an_academic_nepo_baby/",
        "text": "[\"\\[F\\]aculty are up to 25 times more likely to have a parent with a Ph.D. Moreover, this rate nearly doubles at prestigious universities and is stable across the past 50 years. Our results suggest that the professoriate is, and has remained, accessible disproportionately to the socioeconomically privileged, which is likely to deeply shape their scholarship and their reproduction.\"](https://www.nature.com/articles/s41562-022-01425-4)\n\nAre you one of these? If not, how did you end up in academia?",
        "created_utc": 1675472548,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a good idea to join a lab just as it is getting started?",
        "author": "bioluminescent-bean",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10t09w2/is_it_a_good_idea_to_join_a_lab_just_as_it_is/",
        "text": "specifically as a lab manager or research coordinator\n\nI know it may be a huge learning opportunity but am worried it could be stressful and overwhelming",
        "created_utc": 1675470937,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does a Bachelor's degree affect graduate degrees?",
        "author": "AlpsVegetable9592",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10szue6/how_much_does_a_bachelors_degree_affect_graduate/",
        "text": "I hope you don't interpret the following as arrogant or naive.\n\nI'm in my first year of university majoring in engineering. I always wanted to become and considered myself an engineer, but I never felt that I could earn that title without a degree for some reason.\n\nTo keep this short, I basically have significant knowledge and expertise in computer science, and a sizeable amount of knowledge in physics. I can learn things at exceptional speeds, but only because I learn alone and am an extremist (I once decided to learn machine learning for example and finished a 4 months course in around 80 hours in a row with a few naps), and I basically can't focus in lectures or routinely and consistently study something at a normal, healthy rate.\n\nNow here's the thing: I want to be an engineer. I want to work in my fields of interest, which are Computer Science, Physics, and Electrical and Computer Engineering.\n\nOn one hand, I think I should get an engineering degree and follow a consistent study rate over the next 4 years. On the other hand, I think I should get a computer science degree, which I can complete in around 3 terms, but I wouldn't get the electrical engineering degree and title that I want, and I feel like I would be taking an easy way out since computer science is such an easy field for me and I have so much experience in it that I will barely learn anything new. There's also the possibility that I double major in physics as well, in both cases.\n\nI'm not sure if this is vague or stupid, but what should I choose? The path that would lead me to the title that I want, but take many years and have to follow a consistent study plan and non-guaranteed academic exceptionalism, or a path that I've prepared for so much (out of interest and curiosity, nothing more) can finish in barely any time, with barely any effort, and guaranteed exceptionalism, but not to the title I want (I'm already learning most of the engineering stuff on my own, I just feel like I don't deserve the title without the degree)?\n\nCan I follow the second path, and then get a graduate degree in engineering, that way I can be called an engineer? (say someone has a B.S in Math, can they for example have M.S or PhD in other areas like physics or engineering? and will they be considered/called an engineer?)\n\nIf the above text sounds stupid, the author is just young (and hopefully not stupid).",
        "created_utc": 1675469761,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to graduate, when do you apply to assistant professorship positions?",
        "author": "confusedgrad23",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10szr0f/about_to_graduate_when_do_you_apply_to_assistant/",
        "text": "A bit of a silly question, but would love some insight into this ridiculously opaque process. (Advisors are Very Old and Very Established in their positions).\n\nI'm  planning to defend my dissertation sometime April 2024. When does one  officially begin the process of applying to jobs? Scrolling through job  listings for assistant professor positions in my discipline, for  example, most postings have a start date of fall 2023.\n\nI'm  beginning to get my materials together but am somewhat confused about  the timeline. When do institutions traditionally begin listing positions for the following year (in this case, fall 2024)?\n\nHelp a confused grad student out. Thanks!\n\nUSA",
        "created_utc": 1675469500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grant suggestions, please!",
        "author": "goldmorgane",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10szp09/grant_suggestions_please/",
        "text": "Before I go down the rabbit hole, I thought I'd ask if anyone here could please recommend a grant format for my PhD comprehensive exam! \nI study regenerative bioscience and my research focus is biomedical, so the obvious answer is the R21, but my teaching practice is also a huge component in my program. My dissertation will be about 2/3 lab research and 1/3 discipline-based education research. Do you have any suggestions for a grant format that would allow me to include STEM education? It doesn't have to be at the pre-doctoral level either - my committee is cool with early/mid career scientist grants, even if I can't submit it currently.\nThank you for your insight!\n*Cross-posted to r/PhD*",
        "created_utc": 1675469355,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to do semi-independent research after a masters?",
        "author": "jetdarkstar",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10sz4bs/how_to_do_semiindependent_research_after_a_masters/",
        "text": "I am working on my thesis and final semester of my master's degree. I am not wanting to pursue a PhD at this time, but I literally have an overflow of topics and research questions I would like to work on for publication after I graduate. I am super passionate about my subject area (mental health) and want to continue research and maybe even non-profit work/NGO creation. My issue is that I don't really know how to go about this. I am relatively new to academia, so I don't know of what institutes would host me as an independent/semi-independent researcher. Is there an area of employment that supports this? Or does anyone have suggestions for a career I could pursue while doing independent research and publication on the side?\n\nAn additional struggle is that I'm trying to do this in South Korea as that is my population of interest. Obviously, I would have to get more niche with my job search depending on this, and I don't expect many people here to know specifics about this, but a general place to start would be helpful.",
        "created_utc": 1675467844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Classmates Have Student ID #s (+ Grades) of Other Students",
        "author": "Steel_Swallow",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10sw8mm/classmates_have_student_id_s_grades_of_other/",
        "text": "Found out from a buddy of mine that at least 5 classmates got the student ID #s of an unknown amount of our other classmates. Our ID #s are tied to stuff like our grades and other personal info. That group of 5 always seemed to know grades that they had no business knowing. Somehow they would know grades that people hadn’t even said aloud so it wasn’t from overhearing. The people affected also don’t talk to any of the 5 nor any fo the 5’s friends.\n\nMy buddy had spoken to the 5 and it came up in casual conversation that they knew IDs of other classmates but wouldn’t say who (aside from one specific person) or how many IDs they had. \n\nAt the moment, only evidence we have is them admitting to my friend that they have student ID #s, know which individuals the #s are associated, and knowing people’s grades. So no physical evidence that we know of.\n\nIs this worth reporting and are there any steps admin can do?\n(Currently studying in the US for a Master’s Degree)",
        "created_utc": 1675460699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Postdoc life and after - how does it continue?",
        "author": "Razkolnik_ova",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10svx3m/postdoc_life_and_after_how_does_it_continue/",
        "text": "Out of curiosity - how does post-postdoc life typically go? How many postdocs are normal to do? 2, 3? When is it 'normal' to get a permanent contract? What if you get into the 'constant' postdoc trap? \n\nIn case you manage to secure a very decent postdoc at a top uni with an important PI in your field, how much of a foot in the door is that for a future career in academia?\n\nThanks all for sharing any insights :)",
        "created_utc": 1675459930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defense/Start Date [job market]",
        "author": "DramaticPush5821",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10svqns/defensestart_date_job_market/",
        "text": "Hello all. \n\nI am on the job market as an ABD. My university has a strict April 1st cut off for defenses for a diploma dated in May. Some of the faculty have told me that its normal for people to defend after and still start a TT job in the fall with an Oct. dated degree, provided they have defended by the start date. What have you seen? I am at a large public R1 in education, and interviewing at R1s and R2s. I had some very good campus visits that I think might result in an offer so I am wondering how much I should rush to defend before April 1st (my committee is having a hard time finding a date which is my main issue). \n\nThank you!",
        "created_utc": 1675459508,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 21 and a Freshmen and College and I can't think of anything I'm an expert in. Is there a difference between being knowledgable and being an expert?",
        "author": "Dark_Lord_Randy",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10svpdy/im_21_and_a_freshmen_and_college_and_i_cant_think/",
        "text": "I'm a Freshmen, but for one semester. I have trouble remembering shit where I feel like I'm an expert at nothing? Like I said in the title, is there a difference between being knowledgable and being an expert?",
        "created_utc": 1675459419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quillbot premium at rates that you can decide!",
        "author": "Interesting-Elk9053",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10su5nn/quillbot_premium_at_rates_that_you_can_decide/",
        "text": "hey guys! i have a quillbot premium account that I'd like to use for helping everyone out. I'll be charging very basic rates that you guys change according to your budget so let me know! &lt;3",
        "created_utc": 1675455690,
        "upvote_ratio": 1.0
    },
    {
        "title": "What stipend for a Ph.D. student is high?",
        "author": "bucknellchorho",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10stfzt/what_stipend_for_a_phd_student_is_high/",
        "text": "I got accepted to the PhD in Computer Science program at WashU in St. Louis. They have offered me $34k per year. I was wondering what the average stipend is for Ph.D. students and how my quality of life would be with $34k. (over breaks, I want to travel and go home, which is outside the US). Is $34k high for a PhD student who lives alone? I'm not too sure how costly it is out there to manage a living because all my life, I've either been living with my parents or in a dorm.",
        "created_utc": 1675453973,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the etiquette behind asking for recommendations for graduate school, especially if it's been years since I graduated? Other related questions inside.",
        "author": "Ber_Mal_Ber_Ist",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10spagf/what_is_the_etiquette_behind_asking_for/",
        "text": "Hi, all. A bit of a longer post, so I put the questions in bold.\n\nI really want to get back into academia. I graduated in 2020, and had been accepted to a graduate school. Because of a combination of the effects of the ongoing pandemic at the time, as well as my personal fear of change, I decided against going to graduate school that year. Honestly, part of it was also that I didn't want to go in debt just to have online classes. In hindsight, I wish I went, but I digress. \n\nI want to get back to academia and obtain a masters degree to start, possibly going forward to get a PhD down the road. In my undergrad, I was one of the quiet students who did well but didn't really interact with folks (big mistake again). If I had to guess, I'd say my professors remember me, but barely. I already felt bad asking for recommendations the first time, because I knew they'd be difficult to write for me since I wasn't a very notable student. The last piece of information is that I haven't really maintained contact with my professors afterward. I returned a book last month to one of them, but beyond that I have had no interaction with them. \n\nNow my **main question** is, 3 years later, **should I just go ahead and ask the same professors for recommendations that wrote them for me the first time**? I'd feel guilty asking for something when I haven't really stayed in touch. At the same time, I feel that I really have no other choice if I want to go to graduate school. \n\nA couple of **side questions**: As I said, I graduated in 2020. I have OCD and the pandemic really took a negative toll on my mental health during my last semester. I emailed my advisor, who was also teaching my final mathematics course, and told her that I was worried I wouldn't graduate and that I was having trouble focusing on the coursework. She was very kind in her response and stated that many others were having the same issues and that I shouldn't worry. However, I feel shame that I reached out like this. I almost feel like I came off as trying to use my mental health as an excuse. **Do you think that telling her about my worries was overstepping** (when really I should've told a psychologist or close friend)? I feel really guilty about this. I actually liked her a lot, but part of the reason I haven't reached out to her is because I feel ashamed that brought up my mental health to her like that when it really wasn't her burden to bare. \n\nAnother question is, I haven't been in school for about 3 years, just working a retail job in the meantime and paying the rent, basically is all I've been doing. I'm worried that graduate schools will see this gap and it'll be harder to get into schools because of it. **How big of a deal is this gap in studies?** If it matters, my degree is in math with a minor in computer science, and I intend to go to graduate school for a math degree.",
        "created_utc": 1675443711,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I get grad school payed for?",
        "author": "MAthmAn1112121",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10soz0t/how_do_i_get_grad_school_payed_for/",
        "text": "I graduated with a bs in computational mathematics and would like to go to grad school (for Cs). I work as an engineer and my company will pay for up to 6 credits per semester. I want to quit my job and see if I could focus fully on school and get some type of scholarship as this would be the quickest possible way for me to get through my masters. What are the prospects of getting compensated fully by the university? I graduated with a 3.52  (not great but decently competitive). Any info is greatly appreciated.",
        "created_utc": 1675442956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any group chats of colleges and universities there?",
        "author": "work-make-work",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10smzug/is_there_any_group_chats_of_colleges_and/",
        "text": "Wondering, how do people communicate in uni/college?\n\nDo they just form small groups and never talk with somebody else?\n\nNo dorm chats, no local major chats?\n\nReally curious",
        "created_utc": 1675438055,
        "upvote_ratio": 1.0
    },
    {
        "title": "confused about pursuing PhD (Biology)",
        "author": "purple_confetti",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10si7u5/confused_about_pursuing_phd_biology/",
        "text": "Disclaimer: Long post and a bit of ranting\n\nHi. I am a biology masters student planning to pursue PhD in biology in Europe. I have always thought of pursuing academia, but I am having second thoughts after my master's thesis. I enjoyed doing work initially but I have not been getting good data and my thesis is about to end. I had little guidance from my PI as she was on maternity leave the entire team, she did try to do her best, but I think I need more attention from PI. \n\nThe reasons why I want to do PhD is that I enjoy it, I want to move to Europe and since I did my masters from my native country I think it would be better to get into a PhD programme and then work in industry (I no longer want to stay in academia for long term), I also low-key think I don't have any other choice since I have laboratory skills in only confocal micro and mouse handling and I do not have experience with cell culture and Mol bio (except for a lab course in case of latter). I am considering shifting to dry lab to have a better work life balance after teaching myself some programming languages and undertaking projects and internships.\n\nNow the reasons why I don't want to PhD. I had to work over the weekends and late till night during my thesis. I do not want to do the same again for the next 3 to 4 years of my life that too for a lower pay. Secondly, there are way to many PhD students I am wondering if it's worth it. Thirdly, I struggle with depression so a PhD might do me more damage than I can maybe recover from. Especially so because I will be moving to another country and can no longer run back to my family if in need. I might want to pursue PhD later tho once I am better. \n\nAlso I would rather do an MBA or shift to data analytics if it offers me better pay honestly.  Cause I don't want to pursue a PhD and end up broke still. I also feel a little betrayed cause I got into one of the top schools in my country, had scholarship. I do lack in my laboratory experience, it was hard because of Covid and lockdown and I did an internship in maths in my first year of college which is not of much use to me now. \n\nSorry for the long post. And thanks if anyone sticks around to read till the end.\n\nSo any advices please on what aspects I should consider and what aspects I should not.",
        "created_utc": 1675424058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should referees be paid for their service?",
        "author": "cybersatellite",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10scjo2/should_referees_be_paid_for_their_service/",
        "text": "I saw this being debated on Twitter. Some journals are having a hard time getting enough referees to publish in a timely manner. Some journals are for-profit and use free labor, while others are community driven. What are your thoughts on the issue?",
        "created_utc": 1675403207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics of being listed as co-author with minimal contribution",
        "author": "jerch",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10sbp9q/ethics_of_being_listed_as_coauthor_with_minimal/",
        "text": "I'm a PhD student in a natural science. My advisor is currently working on finalizing a resubmission of a paper led by a former postdoc in the lab. In the process there was a problem recreating one of the plots from the datafiles left by the postdoc. My advisor asked me to try and see if I could figure out where the problem was, and said I'd be added as co-author for it.\n\nIn the end just doing a fresh run of the  code on my computer reproduced the data without the problem (was probably a file conversion problem in the existing data file). Took me ~30min total time, with no change to the analysis or  paper itself. Obviously they were happy there wasn't a deeper problem with the code/data \n\nUp until now I have had no direct role in this project other that some discussion and thoughts in lab meetings. Today they said I'm still getting added as co-author. While I am certainly not complaining about it, I mean to be cynical we all know the pressure to produce and having an opportunity to be on a cool paper in a good journal is hard to pass up. And I was completely ready to do more extensive work on the issue if it was needed. \n\nBut It did make me think about how others approach problems like this. I know for example there are definitely papers in my last lab that I likely added more to (not in the paper itself but aspects of initial lab work/some useful but not central data) that I was not included on (and didn't feel slighted in any way for). \n\nSo I wanted to know if others here have encountered similar situations, and how you've reasoned through it. And if you can imagine any downsides to being included in this manner",
        "created_utc": 1675400479,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly is considered the behavior of a “difficult” PhD student that nobody wants to work with?",
        "author": "palimpsest_4",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10saqaz/what_exactly_is_considered_the_behavior_of_a/",
        "text": "I do know that nobody wants a PhD student who literally violates federal regulations, or is unethical or something. \n\nI also know it’s bad to say bad things about other professors even when it’s the whole truth, and you can back it up with hard evidence. Sometimes it is unfortunately necessary. \n\nWhat else am I missing here?",
        "created_utc": 1675397548,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to write in a follow up email to a professor who didn't send a recommendation letter",
        "author": "Normal_Kaleidoscope",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s9nso/what_to_write_in_a_follow_up_email_to_a_professor/",
        "text": "Hello\nSo I am in this situation and I am confused and I do not know how to behave. I'll try to sum it up.\nI participated in a call for a postdoc fellowship which required two support letters from two prospective hosts, and two recommendation letters from two referees (so two separate sets of letters from four separate people in total).\nI write my project, ask two prospective hosts, and they both accept to supervise my project. They also write the required support letters for me.\nThen I ask two prospective referees four months in advance if they could write a recommendation letter for me, and they both accept. One of them uploads their letter one month before the deadline - I can see it from the application platform.\nThen I wait for the second letter to be uploaded by the second referee. This second referee was my MAs supervisor, the person who introduced me to research, and a person who I always admired and respected. I sent them a couple of mails four and two weeks before the deadline to remind them of the letter. \nThe deadline for letters was one week later than the deadline for the project, but once I submitted the project, the status for letters was no longer visible on the platform. So one week or so before the deadline for letters I email my second referee, and ask whether they had uploaded the letter. Their answer was that yes, they had done so, and even that they had submitted it 'right away' so that they didn't forget.\nThis immediately sounded fishy to me. I was 100% sure that one week before the deadline they still hadn't uploaded their letter. Also when I first asked if they were available to write a letter for me, their answer was super excited and positive. I had also sent them several reminders, so I thought that maybe... They would upload the letter at the last minute.\nAnd so I waited.\nThen I get an email from the application platform saying that my application was rejected because one of the letters was never uploaded. I felt my heart sinking. This person knew that my project involved at least two prospective hosts from two different countries and that this required effort, coordination, and luck, and still chose to forget about my letter.\nI'm saying 'forget' because this is the least depressing scenario I can imagine.\nI never liked recommendation letters and this episode magnified my distrust towards the process. The work of three different people trashed in the bin because a person external to the project didn't upload the recommendation letter they promised to upload.\nNow the thing is: I know they lied when they said they had uploaded the letter. They should have known that eventually I would've found out. Or maybe they knew but didn't care. I don't know what's more depressing honestly.\nThen I had to tell my prospective hosts, who had accepted to supervise my project. This was so embarrassing. Telling them that someone didn't upload a letter for you. They must have thought I am the person to blame somehow. \nNow the question is: what should I say to this person? How do I behave? I've found out one week ago but I still haven't said anything to them. This was such a disappointment it took almost 10 days for me to process before I could talk about it to anyone.\nI'm mad, sad and hurt.",
        "created_utc": 1675394445,
        "upvote_ratio": 1.0
    },
    {
        "title": "high safe assign match",
        "author": "No-Patience-6462",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s92e0/high_safe_assign_match/",
        "text": "\nSo basically this was a cs assignment where the professor provided code for two classes and told us to write the code for the third class. So when I submitted the assignment, I copied the code the professor provided in the question and alsp wrote my own code for the 3rd class which was the question. The code the professor provided came up as 74% match to the institutional database. My own code came to match with 20% to internet source and I did copy from any where. Im freaking out rn. Should i email me prof and tell him I want to resubmit with only the code i wrote and not the code in the question he provided?",
        "created_utc": 1675392788,
        "upvote_ratio": 1.0
    },
    {
        "title": "How \"red flaggy\", for all purposes, are institutions that have a faculty of professors who all have completed their education at the same institution?",
        "author": "HotPieceOfShit",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s7m1d/how_red_flaggy_for_all_purposes_are_institutions/",
        "text": "ti'le",
        "created_utc": 1675388750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-funding a summer internship",
        "author": "West_Strain_8825",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s76hj/selffunding_a_summer_internship/",
        "text": "I'm looking for some advice. Last summer, I completed a research internship with the NIH. My PI has asked me to return this year and says he already has a project in mind for me, but he also says that the SIP funding has been promised to another student and his institute won't pay for a second intern.  It seems like the deadlines for most summer scholarships and grants have already passed. I'm in a position where self-funding my stay in Bethesda would be difficult, but doable. I'm not sure what to do-- in a situation like this, is it worth it to volunteer my time? Will it reflect poorly on me and my worth if I'm not getting paid a stipend? Would I still call this an internship on my CV?\n\nFor more context, I enjoyed my time last summer and would love to return. Based on my previous experience, I would genuinely head a small project and be able to add another presentation to my resume. Also, I'm currently a senior and in the process of interviewing for PhD programs for this fall, so if nothing works out it would be great to be in a position where I can visit with PIs and try to arrange a post-bacc with an NIH lab.",
        "created_utc": 1675387573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I demoted? (Visiting to Adjunct)",
        "author": "CarefulStructure1246",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s60o1/am_i_demoted_visiting_to_adjunct/",
        "text": "I have been teaching for small art college where I graduated from for 3 years as visiting lecturer. When VAP job came up last year, I applied it internally but failed to have an interview even. Then what happened next was my job title changed, from visiting to adjunct exact when two new VAPs came in. Is this demotion? I am still looking for TT job and would apply for them this years but worried this shift on my CV would hurt me as candidate. I graduated in 2014 and started lecturing life from 2017, so whatever job titles I have had, it’s been already 6 years after I received MFA in painting. I am wondering if my boat is now sailing away…. Any advice?",
        "created_utc": 1675384465,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhD right after a BSc",
        "author": "DeezelWeazel",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s48o7/phd_right_after_a_bsc/",
        "text": "Hi everyone! I’m a recent Computer Science grad from a university in UK. I plan on pursuing a PhD in SE/CS (or something relevant) straight after my BSc. I do have a few questions.\n\nFor more background, after graduation till now, I’ve been working as a Mobile Dev where I’ve also been writing a review paper. I’ve been holding back on the thought of applying for PhDs based on the status of this review mainly because I have very little research experience apart from a wacky second year project (published on IEEE), my final year project (paper in writing) and this survey. The review paper was just accepted into a top journal in CS, so I’ve made the call to start applying. So the questions/concerns I have are:\n\n1. Is a review paper considered research. More importantly, since it was accepted to a journal ranked in the top 5 in CS (IF ~15), will that provide me enough merit, since I’m still documenting my Final project?\n\n2. Our bachelors degree’s modules were very application oriented with basically no theory. Will this significantly impact my performance assuming that i start a PhD?\n\n3. Related to point number 2, we had barely any theory, so we barely had to use math/understand much math. So I’ve forgotten a lot about it. I’ve seen a lot of papers with mathematical conclusions so will my now reduced knowledge on math effect me adversely?\n\nI would appreciate any response that can help me clarify these questions. Thank you very much in advance :)",
        "created_utc": 1675379941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reporting program chair and assistant chair",
        "author": "moondogy42",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s3cvy/reporting_program_chair_and_assistant_chair/",
        "text": "How do I go about reporting a chair and their assistant for incompetence? I asked for class substitution back in November 2022. They are just now resolving the issue today after much hassle,ignored calls, emails and back and forth. Essentially, I would email the chair, the chair would be confused, I would contact co chair, he would then understand my request. Instead of speaking to the chair directly, he always ordered me to email the chair again. This game went on for several months. All because the chair didn't understand the process at all, and the co chair refused to assist. \n\nThank you",
        "created_utc": 1675377824,
        "upvote_ratio": 1.0
    },
    {
        "title": "[PhD] Is it a good idea to ask when admission decisions are getting released?",
        "author": "bucknellchorho",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s20ah/phd_is_it_a_good_idea_to_ask_when_admission/",
        "text": "\\[This is for Computer Science PhD programs\\]\n\nI had an interview with a POI mentioned in my SoP a couple of weeks back in mid - Jan. He stated that admissions decisions would be released by late January or early February. Since its Feb 2nd currently, is it a good idea to ask if the university has a certain fixed timeline to release its decisions? Or should I just not say anything and keep waiting -- just anxious that I haven't heard anything at all since then.",
        "created_utc": 1675374660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Communication Related Conference Question",
        "author": "meanttobean",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s0pio/communication_related_conference_question/",
        "text": "Hi there,\n\nI'm a new PhD student and I was accepted into a seemingly small academic conference: International Conference of Communication and Media Studies.\n\nI don't know a lot about it and my advisor hasn't heard of it. Has anyone been or know more? \n\nThanks!",
        "created_utc": 1675371577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics PhD to do-good-save-the-world job",
        "author": "Stochastic_Loki",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10s0efm/physics_phd_to_dogoodsavetheworld_job/",
        "text": "Looking for words of wisdom: \n\nI am about to start a PhD project doing some fancy-shmancy advanced optics (with the possibility of combining the project with some CS stuff). I decided to do this because I'm nerdy, I enjoy the intellectual challenge of research and I like the academic lifestyle. The position is fully funded. I'm not passionate about the research topic but I find it interesting enough, the PI and research group seem like people I can get along with, and the salary is comparable to the other jobs I could get with my educational background (theoretical physics with hardly any real world application) and in my current location.  I worked for a few years after my Masters, so I'm starting the program at a relatively late age (35), but in a good financial position. I own the apartment I live in, I have no debt, I have a nice amount of cash saved up, and my kids are old enough to take care of themselves. We enjoy living simply but comfortably in a LCOL area. I also have a teaching credential and a few years of teaching experience, so in the worst-case scenario I can fall back to teaching public school STEM.\n\nMy problem is that deep down inside me I have this little flaming idealist do-gooder, and my true aspirations lie somewhere on the spectrum of \n\na) start some kind of independent business, hopefully related to sustainability, craftsmanship or fair trade.\n\nb) find some kind of job that isn't all-consuming and leaves me with enough time and energy for art\\\\tinkering\\\\homesteading\\\\volunteering\\\\activism. Basically, doing solarpunkish stuff.\n\nc) do some kind of humanitarian, economic development or environmental conservation work (maybe in policy, the NGO sector, or communications such as science writing). \n\nd) switch to some kind of helping profession that involves working with people (but hopefully not going back to teaching in public schools unless I'm strapped for cash... I just can't handle a mob of over 20 kids at the same time). Or some kind of work that is intellectually stimulating, but still provides the essential goods and services without which a healthy society can't function.\n\nAt the moment the PhD is one of the best employment options I have in my geographical area, and I think it would be a nice 4-year waystation, but I can't really see how it ties in to my long-term aspirations. I can't help thinking that those four years could be put to better use trying to work toward making one of my artsy or bleeding-heart idealist goals a reality.\n\nI don't see myself becoming a PI, since I feel like academia in general rewards the wrong metrics, and generally involves too much stress over problems that aren't very important in the grand scheme of things. If I do decide to devote my days and nights to playing politics, attending conferences and writing grants, I'd rather do it for an organization that is truly trying to accomplish something meaningful, like saving the environment or lifting people out of poverty rather than playing the academic prestige game. It seems that academic positions that would allow me to actually work toward more altruistic goals are rare. Instead, most PIs get stuck on a treadmill of chasing grants just to keep their labs afloat, and most granting agencies want to fund silver bullets that will win some militaristic arms race or generate spin-off startups, patents and economic growth.  It seems like most of the research projects in academic physics that have the buzzwords \"sustainability\" or \"healthcare\" tacked on, like renewable energy, pollution control, or biomedical applications, actually get shelved after publication since they're based on out-of-touch hopium that would never scale or translate to the real world.\n\nOn the other hand, most industry jobs in my area seem too bullshitty or soul-sucking. A lot of physicists in my area end up in jobs in the defense industry or in hi-tech companies that popped up around the data-science\\\\ML hype (most of which feel super bullshitty). \n\nBasically, I'm allergic to work that 1) isn't aligned with my values, 2) feels meaningless and futile  and, 3) is repetitive and doesn't exercise my intellect or creativity. \n\nI guess I'm looking for advice, reassurance or stories from people who have gone off the beaten path or shifted into radically different occupations after doing STEM PhDs. Did you know where you wanted to end up when you started your PhD? Did you have a career path in mind? How did you make the transition to where you are now? Were you able to leverage your PhD years to further your goals, or did you end up where you are despite your PhD, not because of it? Would you have done the PhD in hindsight? Are there particular skills that you honed during your PhD that were instrumental in getting you to where you are now? How did you handle having goals that were not necessarily aligned with your PI's goals?\n\nTo preempt suggestions to switch to a different research group doing something that I'm more passionate about: I checked out a LOT of PhD projects that are currently available with funding and that are a reasonable match for my current skill set, and the project I'm about to begin seems the best of the lot.",
        "created_utc": 1675370831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need organisation advice for my dissertation/ethics approval",
        "author": "stardust1771",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10rzluz/need_organisation_advice_for_my/",
        "text": "\nHello!\n\nSo I’m a MSc Organisational Psychology student about to start my dissertation. Normally, in my school, this is a solo project, meaning you organise all the research - and the nature of my school means that the ethics approval only covers typical work related studies e.g., surveys and interviews.\n\nI am interested in human factors psychology, an albeit smaller branch of organisational psychology, and by pure luck I managed to land an internship at an aerospace organisation, doing some human factors research on cockpit performance(!). Anyway, the study is an experimental design, and unfortunately is not covered by my schools ethics approval, meaning that I have to seek approval through the central ethics board at the university. On top of this, the research I will be conducting is outside of my home country, so not only am I gaining approval from my university, but also from the organisation itself.\n\nIn order to meet the timeline of my internship, I am now bound by a very tight deadline, and have to get many affairs in order (proposal, ethical consideration etc) as well as liaising between both my university and the organisation, and I am well and truly in over my head. I have never done this before, and the limited research experience I already have did not include ethics applications. My suggested deadline is 8th March.\n\nSo, what I need advice on is organisation. How can I organise myself in such a way that I can be both flexible if something goes wrong, but also able to meet my deadline. For me, this is a once in a lifetime opportunity and if successful, will open up many doors for myself in the future, but I feel as though I’ve been thrown in the deep end. Please can anyone suggest ways of organisation that maximise productivity and working to a tight deadline?",
        "created_utc": 1675368917,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if a student got drunk and harassed a Professor in e-mail?",
        "author": "-CharlotteBronte",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10rxub7/what_would_happen_if_a_student_got_drunk_and/",
        "text": "Would they get expelled or in trouble? If a student kept e-mailing and yelling at a professor while drunk? Just wonder if anything that extreme would cause a student to get in serious trouble?",
        "created_utc": 1675364697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peer review for scientific articles",
        "author": "kodasdad94",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10rx39e/peer_review_for_scientific_articles/",
        "text": "Hello Redditers,\n\nI need some serious help right now, as part of my college requirement. I have to serve as the peer reviewer of 5 scientific articles. I have dedicated 6 months and have 0 peer review requests. How do I get started on this ? I have 1.5 months and If I don't I might fail.  \n\n\nAny help would be appreciated! Thankyou.",
        "created_utc": 1675362914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice with stubborn prof",
        "author": "Tofu_tony",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10rw1e0/advice_with_stubborn_prof/",
        "text": "My prof wants to be the one working on a specific topic very badly. He's tried to get me to work on a project that I've told him multiple times is not novel and will not work. Other students have tried and failed. I just waste all day doing stuff that doesn't work. He doesn't even want me writing papers, just working on this. \n\nDoes anyone have any advice on how to deal with this? I've already told him it didn't work and isn't novel he just pretended like he didn't hear me and repeats what he wants.",
        "created_utc": 1675360394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can my friend's professor not give her credit on an assignment because she was late to class?",
        "author": "Affectionate_Hat494",
        "url": "https://www.reddit.com/r/AskAcademia/comments/10rvz08/can_my_friends_professor_not_give_her_credit_on/",
        "text": "My friend is an undergrad sophomore business major. She's taking a 200 level class, and a few days ago, she had a big essay due for class. She had to turn it in online and turn in a paper version in class. She turned in her online essay, and she had her printed essay, but she arrived to class two minutes late. Two other of her classmates were also late. However, the professor said that because she was late to class, therefore, the assignment was late, and she wasn't going to get any credit.",
        "created_utc": 1675360221,
        "upvote_ratio": 1.0
    }
]