[
    {
        "title": "I am looking for information or tutorials on how to do some web design",
        "author": "YnotX",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hnjjy/i_am_looking_for_information_or_tutorials_on_how/",
        "text": "[removed]",
        "created_utc": 1497629917,
        "upvote_ratio": ""
    },
    {
        "title": "I Don't like dealing with databases. What are the opportunities in programming jobs for me?",
        "author": "cnetworks",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hm946/i_dont_like_dealing_with_databases_what_are_the/",
        "text": "Hi readers. I like software programming languages and software engineer jobs. I am beginner about to enter in job. However, i realised that i'm not interested in databases and database oriented applications (Example: Most of the web applications we code in .Net or java involves complete dealing with databases in backend).\n\nSorry i really don't like database, connecting to it, saving and dealing with it.\n\nSO, i am interested in C. I am interested to know, do i have any opportunities if i ignore databases.Do you've any ideas/experiences for me on what languages should i learn and what would be my career path.\n\nApart from C, what other languages should i get into.Please, also point various job domains associated with them.\n\n(P S: Please, don't discourage by saying that i am not fit for coding, etc. I just expressed my interest.Hoping to get some advice.) Appreciate your responses.Thank you in Advance.",
        "created_utc": 1497616637,
        "upvote_ratio": ""
    },
    {
        "title": "I Don't like databases. What can i do on programming jobs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hm5kk/i_dont_like_databases_what_can_i_do_on/",
        "text": "[deleted]",
        "created_utc": 1497615395,
        "upvote_ratio": ""
    },
    {
        "title": "I Don't like dealing with databases. What can i do with programming jobs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hm3u8/i_dont_like_dealing_with_databases_what_can_i_do/",
        "text": "[deleted]",
        "created_utc": 1497614789,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find reading material on how machine code/binary gets turned into electric signals in a CPU?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hj7wl/where_can_i_find_reading_material_on_how_machine/",
        "text": "[removed]",
        "created_utc": 1497573753,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a common linearity checking framework or format?",
        "author": "sstewartgallus",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hhx3y/is_there_a_common_linearity_checking_framework_or/",
        "text": "[removed]",
        "created_utc": 1497560410,
        "upvote_ratio": ""
    },
    {
        "title": "Help using IBM Watson NLP tools?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hchww/help_using_ibm_watson_nlp_tools/",
        "text": "[removed]",
        "created_utc": 1497496704,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling understanding APIs/GraphQL with Python for Internship",
        "author": "strugglingCSmajor",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6hb12l/struggling_understanding_apisgraphql_with_python/",
        "text": "Is anyone up for explaining how these work? I'm having a hard time understanding how this all works, and I think my coworkers are getting annoyed with my questions/incredibly slow progress.",
        "created_utc": 1497480060,
        "upvote_ratio": ""
    },
    {
        "title": "Somebody Please Help - Questions about Applying a Neural Network",
        "author": "BaconWrappedShrimpp",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h873p/somebody_please_help_questions_about_applying_a/",
        "text": "Hello, I have limited experience in coding and I am looking at predictors of postoperative recovery after a specific surgery.\n\n\nIf I have very large dataset of patients who have \npreoperative characteristics (blood pressure, sodium intake, age, race, gender, etc) and I have their postoperative results (how much their BP decreased, changes in sodium level, etc)   can I train and use a neural network to make a predictive model? How so? Can i derive a math formula from this?\n\nAlso, can someone explain the whole hidden layer thing2",
        "created_utc": 1497453968,
        "upvote_ratio": ""
    },
    {
        "title": "Why are certain GPU architectures better for certain mining (hashing) algorithms?",
        "author": "oarabbus",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h5ic0/why_are_certain_gpu_architectures_better_for/",
        "text": "I have read online that AMD GPUs provide faster hashrates for hashing the Scrypt algorithm, while nVidia is better at the equihash algorithm. \n\nWhere can I learn more about GPU architectures, hashing algorithms, and what's really going on here? I've tried googling but most hits are to cryptomining forums where it is simply stated X manufacturer is better at Y algorithm without going into detail about the architecture or algorithm calculations. I read something about bit shifting but I'm pretty lost overall and would love to be pointed towards some resources. ",
        "created_utc": 1497417985,
        "upvote_ratio": ""
    },
    {
        "title": "Pursuing Computer Science as Second Degree but Bad at Math",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h496n/pursuing_computer_science_as_second_degree_but/",
        "text": "[deleted]",
        "created_utc": 1497402462,
        "upvote_ratio": ""
    },
    {
        "title": "Should I get a BA or BS in CS?",
        "author": "I_luv_spacedicks",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h1lro/should_i_get_a_ba_or_bs_in_cs/",
        "text": "[removed]",
        "created_utc": 1497376663,
        "upvote_ratio": ""
    },
    {
        "title": "(2, 3) tree where each insert and delete operation costs log n (therefore the worst-case)",
        "author": "ichunddu9",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h1epv/2_3_tree_where_each_insert_and_delete_operation/",
        "text": "Hey,\n\nI'm looking for an example for a (2,3) tree where each operation, insert and delete costs log n (which means that it changes the treestructure). I assume that the leaves should only have one key, because else deletion would be trivial. But how would the complete tree with the nodes look like?\n\nCould someone give me an example for said conditions?",
        "created_utc": 1497374921,
        "upvote_ratio": ""
    },
    {
        "title": "PC randomly makes noise \"fluer de lise\" to be exact, any ideas how to stop it?",
        "author": "cxbu",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h1307/pc_randomly_makes_noise_fluer_de_lise_to_be_exact/",
        "text": "[removed]",
        "created_utc": 1497372111,
        "upvote_ratio": ""
    },
    {
        "title": "LangSec and other security TOE (Theories of Everything)",
        "author": "QuirkySpiceBush",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6h0544/langsec_and_other_security_toe_theories_of/",
        "text": "[removed]",
        "created_utc": 1497363475,
        "upvote_ratio": ""
    },
    {
        "title": "Turning 30 next year. Too late to go back to university? Quarter-life crisis that I would like to turn around.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gzl3h/turning_30_next_year_too_late_to_go_back_to/",
        "text": "[deleted]",
        "created_utc": 1497357446,
        "upvote_ratio": ""
    },
    {
        "title": "Are \"coding boot camps\" worth it?",
        "author": "A-uni-student",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gyyvd/are_coding_boot_camps_worth_it/",
        "text": "I'm not a CS major although I've taken 6+ programming courses at my university, both in the math department and in the engineering school. I have experience in mostly high level languages: Matlab, Java, and C/C++.\n\nI want to make the transition from \"computer programming\" into web development--I think as a front-end developer. I see these \"become a full-stack web developer\" programs from places like Udacity and more recently from the UCLA Extension school being aggressively marketed online.\n\nAre these programs a scam? Would an employer really hire a \"web developer\" who only has 3-6 months of programming experience?\n\nOn the other hand, I notice the Harvard Extension School has two graduate certificates, one in Front End Web Development, the other in Back End Web Development. I have more faith in a university like Harvard to deliver the goods, as it were, particularly because enrollment in such a program requires a bachelor's degree. Is my faith misplaced?\n\nShould I wait until I'm finished with my (liberal arts) bachelor's degree before pursuing a web development program? What resources are there now for me to learn about github, JavaScript, and HTML/CSS?",
        "created_utc": 1497348980,
        "upvote_ratio": ""
    },
    {
        "title": "Help with developing a model of computation",
        "author": "exampanicthrowaway56",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gys3v/help_with_developing_a_model_of_computation/",
        "text": "Hi, not sure this is the right place to ask this question, let me know and I'll delete the thread.\n\nBasically, I have an exam for my Theory of Computation class very soon, and the exam is a presentation of a model of computation of my own design. It can be a new model or anything based on what we have studied (Turing machines, finite automata, cellular automata, Wang tiles, recursive functions, lambda calculus, tag systems, string rewriting etc etc).\n\nI'm thinking about something similar to Langton's ants (or a turmite in general), which are similar to Turing machines except on a 2D grid with a set of rules https://en.m.wikipedia.org/wiki/Langton's_ant. I'm trying to think of cool variations of it that would also be capable of some computation. For some reason, my brain is stuck on something like a game of snake, where the \"ant\" would also grow under certain conditions, but so far I haven't been able to think of anything else that might be useful and I'm afraid I'm digging myself into a hole here. \n\nI know this isn't much to work with, but any input or ideas would be very helpful. \n\nThank you! ",
        "created_utc": 1497345946,
        "upvote_ratio": ""
    },
    {
        "title": "The bandwidth equation?",
        "author": "CrepuscularPizza",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gxo4c/the_bandwidth_equation/",
        "text": "Computer Science student here. Currently taking a \"Computer Organization/Structures\" class and I found myself confused over an example in the book. The example is as follows in my textbook:\n\n\"The Bandwidth of a DMA channel between the hard drive and main memory in a computer system is quoted as 3 Gb/s. How long would it take to do a DMA transfer from the hard drive to main memory of the 400-MB thumbnail database from the photo library in your computer?\"\n     time\n=     {Solve bandwidth equation for time}\n     information/(information/time)\n=     {Substitute values with 8 bits per byte for information}\n     8 X 500 X 10^6 /3 X 10^9\n=     {math}  \n     1.33 s\n\nI'm having a hard time following their work here. Like where does the 500 come from in their equation? Am I going crazy or is that an error?\n",
        "created_utc": 1497328847,
        "upvote_ratio": ""
    },
    {
        "title": "How to describe a permutation of a list in as few bits as possible?",
        "author": "646463",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gxa3e/how_to_describe_a_permutation_of_a_list_in_as_few/",
        "text": "I'm wondering if anyone has any pointers on the following problem:\n\nYou have a known list of n candidates on a ballot. In the act of voting, the voter must number each candidate from 1 to n, using each number once. The voter is thus describing a transformation on the list of candidates into a particular permutation. What is the minimum number of bits needed to exactly describe any order, and the method?\n\nMy naive approach is to count (from the left) the number of 'jumps' each candidate must take to arrive in their ranked position _skipping any previously ranked candidates_.\n\nSo if we had 3 candidates: `cs = ['c1', 'c2', 'c3']` and a list of ranks `rs = [2, 3, 1]` we'd do this (where `zip(cs, rs)` matches candidates to ranks):\n\n* First, `c1` should be in the 2nd position, which is 1 move from the far left open spot. Since `c1` _could_ move 2 positions though we need to use 2 bits. Record `01`\n* Second, 'c2' needs to be in 3rd position, which is also 1 move from the far left open spot (since we skip over the filled position from step 1). Because 'c2' could _only_ move a maximum of 1 jump, we only need 1 bit: record `1`.\n* Third, 'c3' trivially fits into the last space, so we need 0 bits.\n\nOur final result is `011`.\n\nTo decode the permutation, take N bits in the sequence `ceil(log(2, n)), ceil(log(2, n-1)), ceil(log(2, n-2)), ..., ceil(log(2, 2))`, which is [2, 1, 0] in our case. Use those bits (in this case `['01', '1']`) to move each candidate into open spots.\n\nBy numerical analysis this method very closely fits O(n Log n) space complexity. (`total_bits = 0.89 * n * log(2, n)` seems to describe the pattern very closely).\n\nThe exact number of bits used will be `t = Sigma(i=2, n)( ceil(log(2, i)) )`.\n\nIt occurs to me that simply listing the positions is `O(n log n)` too, but the exact number of bits required is `t = ceil(log(2, n))*n` which is more than my method.\n\nIn any case, are there any better algorithms out there? I tried googling for some but can't seem to nail down the right terms. Any hints would be appreciated.\n\n**Edit: found the optimum solution**. [comment link](https://www.reddit.com/r/AskComputerScience/comments/6gxa3e/how_to_describe_a_permutation_of_a_list_in_as_few/div4om9/). \n\nBasic idea is to use [factoradics](https://en.wikipedia.org/wiki/Factorial_number_system) - sort of like \"base factorial\" where the k^th integer is in [0, k] and to convert back to base 10 you'd multiply it by `k!`. e.g.: `3210` is `0*1! + 1*2! + 2*3! + 3*4!`. Also `4321 + 1 = 10000` which is `1*5! = 120` in base 10.\n\nThese numbers uniquely enumerate permutations for a list of n unique elements and allow one to 'read' the permutation from the number. e.g. `[a, b, c, d, e]` in permutation `2310` leads to `[d, c, a, e, b]`. Put `a` in 2+1th free slot, put `b` in 3+1th free spot, put `c` in 1+1th free slot, put `d` in 0+1th free slot, put `e` in the last spot.\n\nThis means we can map all integers in [0, n!-1] to a unique permutation (via modulo-ing and subtracting successive factorials), and back again quickly and efficiently (though arbitrarily sized integers (e.g. in python or haskell) make this much easier than small integers - `150!` is like 110 bytes long as a raw integer)\n\nFinally a sanity check: for a list of k elements we have a maximum count of `(k-1) (k-2) ... (k-k+1)` where each bracketed expression is a digit. If we add 1 we end up with 1 followed by k zeros, which corresponds to `k!`, and so our maximum integer is 1 less at `k!-1` which is what we expect :)",
        "created_utc": 1497324084,
        "upvote_ratio": ""
    },
    {
        "title": "What precisely/concisely is the “head” of a singly linked list? I ask bc of ambiguity online",
        "author": "JohnChrissy",
        "url": "http://i.imgs.fyi/img/r7a.jpg",
        "text": "",
        "created_utc": 1497321694,
        "upvote_ratio": ""
    },
    {
        "title": "Developing a Desktop based Learning Management System, worth it?",
        "author": "iprincess191",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gx1ii/developing_a_desktop_based_learning_management/",
        "text": "Hi, my summer just began and I thought of starting a project for my college, which is to make a LMS. Most LMSs out on the internet are web-based, I thought a desktop one would be much better, what do you think? And which programming language do I begin, I've heard that JavaFX has a lot of bugs since its new. Thanks",
        "created_utc": 1497321298,
        "upvote_ratio": ""
    },
    {
        "title": "Is somebody logging on remotely?",
        "author": "rando1meh",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6guwfk/is_somebody_logging_on_remotely/",
        "text": "Hi, I'm wondering if someone can help me. I think someone is logging on remotely (my work computer). Here's what happens. I have a lap top and two connected monitors. Two of my connected monitors freeze, all my windows appear on my lap top. \n\nWhen I check Eventviewer under TerminalServices-LocalSessionManager &gt; Operational, this is what I get: \n\nThis AM: \n\nRemote Desktop Services: Shell start notification received:\n\n9AM today: \nUser: myusername\nSession ID: 1\nSource Network Address: LOCAL\n\n2PM today:\nRemote Desktop Services: Session logoff succeeded:\n\nUser: myusername\nSession ID: 1\n\n2PM (when I restarted my computer): \n\nLocal multi-user session manager received system shutdown message\n\nthen :\n\nPlugin RDSAppXPlugin has been successfully initialized\n\nBegin session arbitration:\n\nUser: myusername\nSession ID: 1\n\nAgain after I restarted: \nRemote Desktop Services: Session logon succeeded:\n\nUser: myusername\nSession ID: 1\nSource Network Address: LOCAL\n\nJust now: \nRemote Desktop Services: Shell start notification received:\n\nUser: myusername\nSession ID: 1\nSource Network Address: LOCAL",
        "created_utc": 1497299182,
        "upvote_ratio": ""
    },
    {
        "title": "Why does WiFi link speed change randomly?",
        "author": "SerialK1ll3r",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gt2kt/why_does_wifi_link_speed_change_randomly/",
        "text": "[removed]",
        "created_utc": 1497282770,
        "upvote_ratio": ""
    },
    {
        "title": "Why do tiny applications have x64 versions?",
        "author": "SerialK1ll3r",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gsykh/why_do_tiny_applications_have_x64_versions/",
        "text": "[removed]",
        "created_utc": 1497281722,
        "upvote_ratio": ""
    },
    {
        "title": "Using Google geolocation API",
        "author": "explosivedot",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gso2i/using_google_geolocation_api/",
        "text": "Really basic question, since I have no practical programming experience: I have a list of a few thousand addresses (in an excel document) and need to find their latitude and longitude. I can't figure out how to actually utilize the Google geocoding API in some sort of bulk method, though, and I have no knowledge of JSON whatsoever. Any ideas on how I can do this, or where I should start looking? ",
        "created_utc": 1497278982,
        "upvote_ratio": ""
    },
    {
        "title": "How to show that a turtle graphic language is not regular?",
        "author": "Anarachon",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gsec7/how_to_show_that_a_turtle_graphic_language_is_not/",
        "text": "I have to prove with the pumping lemma that L is not regular or to give a regular expression for that.\n\nLet L be all combinations of commands such that in the complete drawn result no line is drawn above another. At the starting point the pen is down.\n\nThe turtle graphic is created by the following commands:\n\nu - pen up\nd - pen down\ng - go \nl - move 10° left\nr - move 10° right\n\nI think think that the language is not regular because I think there is an expression that crosses a line for a big enough n∈N\n\nSo far I have that g^n r^9 g r^9 g^m r^9 g r^9 g crosses a line iff n≥m.\n\nIf I use the PL and m&lt;n is that a prove that L is not regular ?",
        "created_utc": 1497276186,
        "upvote_ratio": ""
    },
    {
        "title": "Why would I embed python in an C/C++ desktop application when I can write the app itself entirely in python?",
        "author": "catalinCostel",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gscdm/why_would_i_embed_python_in_an_cc_desktop/",
        "text": "I have to create a GUI application with basic drawing functionality which needs to comunicate with a microcontroller and I am thinking that would be \"cool\" to extend it with python (user would be able write a script to draw a fractal for example). And now I realize that I could write the entire application in Python.\n\nI think that my C/C++ app extended with python will benefit only by a \nslightly stable GUI and a \"nice\" exe.\n\n Will be worth to take this approach only for this two advantages ? Are there others benefits?\n(My app isn't CPU intensive)",
        "created_utc": 1497275620,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding bit states on basketball scoreboard",
        "author": "ms01dos",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gsaqr/question_regarding_bit_states_on_basketball/",
        "text": "Hello, I started reading Patt/Patel Intro to computing systems and I came across something regarding basketball scoreboards. It says that for each score there is a need for 7 bit states, which, according to my understanding represents the 7 strokes to form 0-9. 1 bit for possession and 1 bit for halftime. \n\nWhat I don't understand is it states that 5 bits for minutes and 6 bits for seconds. Did I get my understanding wrong or is it the old version scoreboard? Can anyone explain it to me? Thanks!",
        "created_utc": 1497275150,
        "upvote_ratio": ""
    },
    {
        "title": "Does there exist a terminal text editor that gives NO visual feedback when typing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6got2c/does_there_exist_a_terminal_text_editor_that/",
        "text": "[deleted]",
        "created_utc": 1497226130,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best laptop I could get right now that would have the best specs for running computer programs, and in general everyday life tasks?",
        "author": "ishmootfiga",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6goqpx/whats_the_best_laptop_i_could_get_right_now_that/",
        "text": "",
        "created_utc": 1497225337,
        "upvote_ratio": ""
    },
    {
        "title": "Why is caps lock a problem for password verification?",
        "author": "B4dA1r",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6glys3/why_is_caps_lock_a_problem_for_password/",
        "text": "Why can't it just check what you entered, and then what you entered if the caps lock was toggled from the current state? That wouldn't reduce the search space too much, and the user would still have to be holding shift for the correct keys.",
        "created_utc": 1497195220,
        "upvote_ratio": ""
    },
    {
        "title": "Programming Languages Zeitgeist",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gkvlj/programming_languages_zeitgeist/",
        "text": "Sometimes I have an idea for a language, but I know in my disappointed heart that something better probably already exists in the vast programming language universe. I'm looking for a folk education in programming languages so that I can one day make a useful contribution.\n\nDoes anyone have advice on tapping into the programming language community? As far as skills, I have never truly designed a language/written a compiler, but my Data Structures class's projects were about parsing and acting on what was parsed.\n\nThere is a somewhat active sub here, but I'm looking for something like a 'FLOSS Weekly' (it's a TWiT podcast) source, if one exists. I'm also an ACM member, and I probably wouldn't mind subscribing to another journal, depending on price.\n\n",
        "created_utc": 1497179708,
        "upvote_ratio": ""
    },
    {
        "title": "If two transactions do not interact, then it is possible that the user cannot control their effec- tive order of execution. Why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gkjds/if_two_transactions_do_not_interact_then_it_is/",
        "text": "[removed]",
        "created_utc": 1497172857,
        "upvote_ratio": ""
    },
    {
        "title": "Is installing and running your browser in Windows 10's BASH more secure?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6giy1g/is_installing_and_running_your_browser_in_windows/",
        "text": "[deleted]",
        "created_utc": 1497145373,
        "upvote_ratio": ""
    },
    {
        "title": "What do academic computer scientists think about bioinformaticians/computational biologists?",
        "author": "Zeekawla99ii",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gh3j3/what_do_academic_computer_scientists_think_about/",
        "text": "Normally when you speak to computer scientists, they have general opinions about mathematicians, programmers in industry, etc. \n\nWhat do most computer scientists think of computational biologists in academia and industry? ",
        "created_utc": 1497123122,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to enter a good MSCS without BSCS.",
        "author": "sasuke_chan",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gcs3z/trying_to_enter_a_good_mscs_without_bscs/",
        "text": "Current plan: self study for 12 months and apply. \nMajor : math/ stats high GPA from UNC\nIf I learn everything here Self study for Stanford's MSCS Foundation courses. will I know enough?\nhttps://backdoorgraduteschooladmissions.quora.com/Self-study-for-Stanfords-MSCS-Foundation-courses\n\nCould you tell me if that Stanford list is exhaustive for what an undergrad should know out of CS major?\n\nBasically, I want to be caught up or even ahead of what an undergraduate at a BSCS program knows. Theoretical mathematical concepts aren't difficult for me so I believe i can accomplish this in 12-16 months. Any advice is appreciated!\n",
        "created_utc": 1497059716,
        "upvote_ratio": ""
    },
    {
        "title": "Books/Aids to Imptove Logical Thinking",
        "author": "ZenBound",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gc1xn/booksaids_to_imptove_logical_thinking/",
        "text": "[removed]",
        "created_utc": 1497050679,
        "upvote_ratio": ""
    },
    {
        "title": "Interested in getting more into Computer Science and need some advice.",
        "author": "JuanPRamirez",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gc0gj/interested_in_getting_more_into_computer_science/",
        "text": "So background: I am a highschool student in his Junior year right now and I find the aspects of coding to be really intriguing. While I have gotten some books about programming (currently working on python) I do feel like I don't necessarily want to do full programming. I am mainly interested in different areas in computer science such as; networking, pentesting, machine learning, and artificial intelligence. \n\nI was wondering what steps I should take to start applying myself to some of these topics (my main interests are machine learning and pentesting). I was also wondering what I should be studying in college-- when I get there of course-- so i don't spend any unnecessary time doing courses that I want need.\n\nAny help is welcomed and would be greatly appreciated. ",
        "created_utc": 1497050222,
        "upvote_ratio": ""
    },
    {
        "title": "Soft question: name for moving work from hardware to software?",
        "author": "JimH10",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gbalb/soft_question_name_for_moving_work_from_hardware/",
        "text": "[removed]",
        "created_utc": 1497042577,
        "upvote_ratio": ""
    },
    {
        "title": "Is there is a problem whose runtime is tightly bounded below but for which no algorithm achieves that runtime?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6gb1rp/is_there_is_a_problem_whose_runtime_is_tightly/",
        "text": "I mean, does something like this ever occur: there is a problem and \n\n1. every algorithm that solves the problem is Ω(n^(c))\n2. no algorithm that solves the problem is Θ(n^(c))\n3. if c &lt; d, there is an algorithm that solves the problem in time O(n^d).\n\nedit: tweaked question. I think the exact formulation is whether there's a problem st. every solution is Ω(f), none is Θ(f), and some is O(g) for every g with f = o(g).\n\n(Not sure this is right subreddit...)",
        "created_utc": 1497040214,
        "upvote_ratio": ""
    },
    {
        "title": "What are some interesting non-computer-related insights from CS?",
        "author": "QuirkySpiceBush",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ga6wh/what_are_some_interesting_noncomputerrelated/",
        "text": "[removed]",
        "created_utc": 1497032107,
        "upvote_ratio": ""
    },
    {
        "title": "Which undergrad major should I choose? Computer Science or Technology &amp; Information Management!",
        "author": "leotheleopard11",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g8cl3/which_undergrad_major_should_i_choose_computer/",
        "text": "Hello,\n\nI plan on transferring to University of California, Santa Cruz within the next year, since I live in San Jose, CA, which is close by. \n\n&amp;nbsp\n\nThis past semester I passed data structures &amp; algorithms with an A, so programming is not a very big issue with me. Although, I must admit I'm not an great programmer, by far, and it takes me a while to learn things, but I try hard.\n\n&amp;nbsp\n\nTwo majors at UCSC have caught my eye:\n\n&amp;nbsp\n\n[BA in Computer Science] (https://ua.soe.ucsc.edu/sites/default/files/CS_BA_16-17.pdf) (Includes Calc I &amp; II, discrete math, Linear algebra, etc) but I just dread some of the upper division courses and the capstone project or thesis option.\n\n&amp;nbsp\n\nSecondly, [BS in Technology &amp; Information Management] (https://ua.soe.ucsc.edu/sites/default/files/TIM_16-17.pdf) (TIM for short). Overall, it's certainly not a \"frowned upon\" or \"basic\"  IT or IS degree (I have seen people on many CS related subreddits say CS people don't respect IT or IS people) after viewing the course requirements. It includes taking up to Calc IV, discrete math, many economics courses, and all the very important foundational CS course like data structures &amp; algorithms, Computer systems and assembly, etc.\n\n&amp;nbsp\n\nI'm just so torn on the two majors. BA CS has many tricky/very time consuming upper division courses and a required senior capstone project or thesis. TIM is a jack of all trades master of none, with no large senior thesis or project and can provide other marketable skills. \n\n&amp;nbsp\n\nI'm not 100% sure if I want to be a programmer, neither am I 100% I want to be in tech management. Most of all, I want a worthwhile degree that won't hold me back from being in tech or have me looked down upon.\n\n&amp;nbsp\n\nWhich major should I choose? \n\n&amp;nbsp\n\nThanks for all the help!!",
        "created_utc": 1497014335,
        "upvote_ratio": ""
    },
    {
        "title": "How do you design a multithreaded program with pthread in C?",
        "author": "TheSickestCuntMate",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g6040/how_do_you_design_a_multithreaded_program_with/",
        "text": "[removed]",
        "created_utc": 1496979807,
        "upvote_ratio": ""
    },
    {
        "title": "Working basic client server chat in java???",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g5ktn/working_basic_client_server_chat_in_java/",
        "text": "[deleted]",
        "created_utc": 1496974586,
        "upvote_ratio": ""
    },
    {
        "title": "What programming language, regardless of my interests, should I learn before entering the workforce?",
        "author": "elFrostenstein",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g4fyb/what_programming_language_regardless_of_my/",
        "text": "I have some experience in python, more experience in java, and a small amount in HTML and JS",
        "created_utc": 1496961804,
        "upvote_ratio": ""
    },
    {
        "title": "Have computer apps become more inefficient?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g4cht/have_computer_apps_become_more_inefficient/",
        "text": "[removed]",
        "created_utc": 1496960778,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any math to prove that it's impossible for an AI to \"do software development\", unless that was fully generally AI?",
        "author": "iProgramSometimes",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g3mdh/is_there_any_math_to_prove_that_its_impossible/",
        "text": "Does the problem of creating software programs, applications, games, etc fall into some NP-Hard category of sorts?\n",
        "created_utc": 1496953842,
        "upvote_ratio": ""
    },
    {
        "title": "List of Industry technology conferences/trade shows?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6g0cvb/list_of_industry_technology_conferencestrade_shows/",
        "text": "[removed]",
        "created_utc": 1496921284,
        "upvote_ratio": ""
    },
    {
        "title": "How should I improve my problem solving skills?",
        "author": "EntangledAndy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fwfve/how_should_i_improve_my_problem_solving_skills/",
        "text": "[removed]",
        "created_utc": 1496870213,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the difference between a tensor and a matrix?",
        "author": "ToplessTopmodel",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fuugs/whats_the_difference_between_a_tensor_and_a_matrix/",
        "text": "[removed]",
        "created_utc": 1496855706,
        "upvote_ratio": ""
    },
    {
        "title": "Searching for a programmer (skilled in Java, Python) and an app/surface designer near Munich",
        "author": "Jack_86forreal",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ftyko/searching_for_a_programmer_skilled_in_java_python/",
        "text": "How can I find a programmer and an App designer to develop my App idea, when I am not from this Job field?\nI would appreciate someone who lives near Munich and would like to join my idea for a new social media app.",
        "created_utc": 1496847627,
        "upvote_ratio": ""
    },
    {
        "title": "How did iChat's Bonjour video chat work?",
        "author": "mildlycustard",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fru49/how_did_ichats_bonjour_video_chat_work/",
        "text": "When Apple still supported local video chat, how did it work?\n\nIs there an Apple developer library for sending video over the network (AVFoundation?)?",
        "created_utc": 1496818843,
        "upvote_ratio": ""
    },
    {
        "title": "helow , which is the best business events and services listing and directory web template",
        "author": "walt240",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6frppw/helow_which_is_the_best_business_events_and/",
        "text": "Am looking for the best business, event &amp; services listing &amp; directory \nwhich is responsive and comes with its android and apple apps ,which allow full customization  and i can download it and host it on my own server and play around with it if i want it to ,it will also helps if its organised  due to location and has map ",
        "created_utc": 1496816999,
        "upvote_ratio": ""
    },
    {
        "title": "Samsung Smart Switch &amp; C++ packages?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fqee3/samsung_smart_switch_c_packages/",
        "text": "[deleted]",
        "created_utc": 1496800172,
        "upvote_ratio": ""
    },
    {
        "title": "C++: Im coding the classic game of Snake, and i want to the user to be able to progress through levels. Is there an easy way to achieve this with visual representation?",
        "author": "titanmp9",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fplqt/c_im_coding_the_classic_game_of_snake_and_i_want/",
        "text": "[removed]",
        "created_utc": 1496791347,
        "upvote_ratio": ""
    },
    {
        "title": "What do I need to know in order to share bitmap files effectively?",
        "author": "PlazaOne",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fp1q7/what_do_i_need_to_know_in_order_to_share_bitmap/",
        "text": "[removed]",
        "created_utc": 1496785786,
        "upvote_ratio": ""
    },
    {
        "title": "I need help thinking of an algorithm for a project due tommorow!",
        "author": "forkness",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fmcpr/i_need_help_thinking_of_an_algorithm_for_a/",
        "text": "Here is an imgur folder with the projects description (my apologies for the awfully wrinkled paper):\nhttp://imgur.com/a/a2vQM\n\nThere are a set of pegs, numbered from 0 to n - 1. Each peg can have a connection to another peg with a rubber band.\n\nBasically, the program is given an adjacency list with all of the pegs and the ones they connect to. The idea of the project is to come up with an algorithm that returns a permutation with the all of the rubber bands stretching the least distance.\n\nIt's my understanding that this program will take a long time to run. Our teacher implied that the algorithm should run multiple times to get the best answer; each result of the algorithm should improve the overall \"cost\". (The cost is the distance spanned by all of the rubber bands, measured in pegs. For example, a set of 5 pegs in numerical order that has one rubber band between peg 1 and 3 has a cost of 2).\n\nI've been struggling to come up with an algorithm that returns a \"good\" result. What I need is an algorithm that, when run an infinite amount of times, will improve the cost each time. If anyone recognizes the problem or has any suggestions, please let me know. Thanks!",
        "created_utc": 1496761647,
        "upvote_ratio": ""
    },
    {
        "title": "How would I go about making a home network, connecting two computers (win 7 &amp; win 10)? I have some things already, written in description. [X-post r/networks]",
        "author": "tikvan",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fm12s/how_would_i_go_about_making_a_home_network/",
        "text": "**They haven't responded as of yet, so everything below is a copy-paste off the post on r/networks. The last paragraph also applies, sorry for any mistakes/wrong sub :))**\n\n---\n\nI have a Huawei home gateway HG530 *(we call this a modem where I live)*, which has an input ADSL port for internet input from phone outlet *(and I don't have that internet here, only mobile on one computer)*, and four LAN ports, which are the same as on the computers' ethernet ports. Also has WiFi *(written as WLAN on it)*.\n\n&amp;nbsp;\n\nI also have a few cables, UTP I think they're called, which we used to connect the LAN &amp; ethernet ports back when we lived in town where we had the ADSL connection. I do not have crossover cables, and it's most preferred I network the computers without buying anything.\n\n&amp;nbsp;\n\nAlso will the internet be shared through the network? Due to the very slow and weak connection, it is important to keep the internet on the win 7 computer only *(not even WiFi, though that's togglable on the modem)* while it is also in the network with the offline win 10 computer. I mostly need this setup for two-player gaming via the network.\n\n&amp;nbsp;\n\nSorry if this is the wrong subreddit. Also sorry for any mistakes, I am not a native speaker. Also note I might update this with more info. Thanks in advance :))",
        "created_utc": 1496758584,
        "upvote_ratio": ""
    },
    {
        "title": "Old pocket computer software question for machining.",
        "author": "[deleted]",
        "url": "https://i.redd.it/ib4j772k712z.jpg",
        "text": "[deleted]",
        "created_utc": 1496757695,
        "upvote_ratio": ""
    },
    {
        "title": "Operating system and CPU questions",
        "author": "hypocryt",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fkwz7/operating_system_and_cpu_questions/",
        "text": "Hey guys, I took an OS class a while back and I forget how a few things work. I have a couple of questions I'm curious about and I feel dumb not knowing these answers. I hope this is the right place to ask. \n\n1. Is the operating system a process just like all the other processes that run on the CPU? \n\n2. How does it schedule processes? I remember there being different algorithms,but on a low level, but does it take blocks of code from the different processes and arrange them in the part of memory that holds instruction for the cpu to run? \n\n\n\n3. Does a standard instruction set found on common processors like an Intel processor look like the MIPS instruction set? How do they differ? \n\n\n\n4. How does the standard computer know to run 64 and 32 bit instructions? how are they different?\n\n\n\n5. How is the operating system loaded first from memory at boot? \n\n\n\n6. By what factors are CPUs being improved nowadays? Clock time? Number of instructions? Branch prediction? \n\n\n\n7. How are microprocessors made? e.g. What if I wanted to build a simple counter, or a thermostat, or a coffee brewer (from what I understand even basic appliances have microprocessors?) I've spent some time designing a custom processor and was wondering if I could use this knowledge to create anything. \n\n\n\n8. When a cpu is manufactured, how can you choose the operating system for it to run? e.g. How does a brand new cpu know to run Windows? \n\n\n\n9. Are the terms kernel and OS interchangeable? \n\n\n\n10. Are data and instructions stored in the RAM? Like when a CPU interacts with memory, does memory mean RAM? \n\n11. Are most microprocessors designed to have a smaller instruction set? Are they all pipelined, or are some still single cycle? \n\n\nI just need help finding resources that will help me answer these questions, if not direct answers. Any answers help, thank you",
        "created_utc": 1496744791,
        "upvote_ratio": ""
    },
    {
        "title": "What's Siri's request protocol? Can it be emulated?",
        "author": "mildlycustard",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fknc8/whats_siris_request_protocol_can_it_be_emulated/",
        "text": "There's a lot on the 'older' versions of Siri, and ways to set-up proxies etc but Apple's since changed the way Siri works; so I was wondering, does anyone know the 'new' way Siri works? Can a non-legitimate source make a request to Apple's Siri servers with a correct device ID?",
        "created_utc": 1496740378,
        "upvote_ratio": ""
    },
    {
        "title": "Image Interpolation",
        "author": "Daft_Science",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fj9an/image_interpolation/",
        "text": "Hey ho. Astronomer here.   \n  I've been working on a project where I'm attempting to model the background of a supernova remnant by interpolating over the supernova so it appears it was never there in the first place. I've been using a linear interpolation and it works kinda okay but I thought maybe I'd make a shout into the void to see if anyone knows a better direction to run in.  \nMy adviser has suggested that there may be some planar interpolation algorithms that could work better... but I'm just having trouble finding resources that pertain to something like a scientific 2D Image array.   \n  \nAny thoughts or suggestions would be really appreciated! Thanks! ",
        "created_utc": 1496719285,
        "upvote_ratio": ""
    },
    {
        "title": "Need help you smart bunch you",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fi77j/need_help_you_smart_bunch_you/",
        "text": "[deleted]",
        "created_utc": 1496707443,
        "upvote_ratio": ""
    },
    {
        "title": "Hash Table vs BST",
        "author": "stoptrippin81",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fgp8t/hash_table_vs_bst/",
        "text": "Hi guys. I have to implement a data structure for a project in my CS class, and I'm trying to decide between using a Vector of Binary Search Tree's or a Vector of Hash Tables.\n\nThe program will be scored based on speed and performance, since the correctness of the program is easy to achieve. Which data structure is likely to be more efficient, robust, and faster? Thank you!",
        "created_utc": 1496693051,
        "upvote_ratio": ""
    },
    {
        "title": "Trying out my own version of algorithmic trading, need help!",
        "author": "jappyboy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fgkn3/trying_out_my_own_version_of_algorithmic_trading/",
        "text": "So the bulk of a scoring system (our algorithm) is written but I'm having trouble coming up with ideas on writing a python code that extracts data from stocks and inputs into a csv file. I would like to parametrize how often to refresh the csv file (in seconds) and also somehow update the csv file rather than creating a new file overall. How do I do this? (Keep in mind I'm a beginner at Python)",
        "created_utc": 1496691920,
        "upvote_ratio": ""
    },
    {
        "title": "Recommended books to learn the fundamentals of computer science?",
        "author": "ZacharyVincze",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6fbvep/recommended_books_to_learn_the_fundamentals_of/",
        "text": "As the title states, I'd like to learn the fundamentals of computer science.  Are there any good books out there that can help me get started?",
        "created_utc": 1496634580,
        "upvote_ratio": ""
    },
    {
        "title": "Home VR Pilot",
        "author": "TrinityLennoxza",
        "url": "http://vrpilot.com/",
        "text": "",
        "created_utc": 1496629415,
        "upvote_ratio": ""
    },
    {
        "title": "Question on user controls",
        "author": "AlexMLOL",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6f914o/question_on_user_controls/",
        "text": "Hello, I'm working on a c# project where I'm trying to change a user control label in another form of another project. I have already implemented the uc in the form and although I can change the value of it, it won't change the text of the label while running. I'm using visual studio and the language is c#. Any help is much appreciated!",
        "created_utc": 1496602373,
        "upvote_ratio": ""
    },
    {
        "title": "I have a question about getting help from peers...",
        "author": "throwiey",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6f8u13/i_have_a_question_about_getting_help_from_peers/",
        "text": "I know some people who literally get entire pseudocode to do assigned problems in college. As in, the only thing they have to do is code it up without thinking.\nMy ego has never allowed me to do this.\nBut these guys get better grades and probably even learn more than me given a set of problems.\nI was just wondering if I should suck up my pride and just do it like those guys, although I know that doing it mostly by myself will help me in the long run, I'm just having a hard time seeing it.",
        "created_utc": 1496600296,
        "upvote_ratio": ""
    },
    {
        "title": "How hard would it be to design a machine learning system to give probabilities that a person is on some Performance Enhancing Drug based on their picture?",
        "author": "McKennaJames",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6f8njf/how_hard_would_it_be_to_design_a_machine_learning/",
        "text": "[removed]",
        "created_utc": 1496598379,
        "upvote_ratio": ""
    },
    {
        "title": "Mealy machine",
        "author": "Derschulz",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6f2pna/mealy_machine/",
        "text": "I have three questions regarding mealy machines. \n\n\n1 &amp; 2: Where are they used and why would you use a mealy machine instead of a moore machine or some other finite-state machine?\n\n\n3: Are mealy machines efficient compared to others, and in which case?\n\n\n\n\nPlease explain your answer, if you have one. I would be happy about any bit of advice you could give me. ",
        "created_utc": 1496514732,
        "upvote_ratio": ""
    },
    {
        "title": "Coursework Ideas",
        "author": "KendrakDoUrden",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6exulp/coursework_ideas/",
        "text": "I need to come up with an idea for a project for my computer science coursework (AQA A-Level Computer Science 7516, 7517) but have no ideas that feel suitable. Can you guys throw some ideas at me, with a suitable language to use if possible? Thanks. :)",
        "created_utc": 1496444789,
        "upvote_ratio": ""
    },
    {
        "title": "History of the Throbber",
        "author": "benijuice",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6erngt/history_of_the_throbber/",
        "text": "My dad is a newpaper editor and wants to do a brief history of the [throbber](https://en.wikipedia.org/wiki/Throbber). He is not content with what wikipedia has to offer and requested I \"ask the reddits.\" So r/AskComputerScience, can anyone tell me any more about this thing than what is on Wikipedia? Or at least point me in the right direction?",
        "created_utc": 1496370524,
        "upvote_ratio": ""
    },
    {
        "title": "What does the '3' in \"Single User\" stand for ?",
        "author": "[deleted]",
        "url": "https://i.redd.it/zpjs1eftg11z.png",
        "text": "[deleted]",
        "created_utc": 1496324989,
        "upvote_ratio": ""
    },
    {
        "title": "Substituting bureaucrats with technology?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6emr1r/substituting_bureaucrats_with_technology/",
        "text": "[deleted]",
        "created_utc": 1496323927,
        "upvote_ratio": ""
    },
    {
        "title": "What's the cheapest netbook with at least 1gb ram and 32gb storage?",
        "author": "Harukama",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6eg2bv/whats_the_cheapest_netbook_with_at_least_1gb_ram/",
        "text": "",
        "created_utc": 1496247895,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, I'm looking for some information.",
        "author": "A_Mad_Liberator",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6efj9n/hello_im_looking_for_some_information/",
        "text": "I have no idea about computers. Like none at all. But I would like to know if this is the correct sub for something like my problem and if not could anyone direct me to a source that could help.\n\nI'm hoping to set up a website. One that is rather complex. It would require logins, and credit card transfers. Nothing illegal, lol, just a form of shopping site like AliBaba or ebay.\n\nThing is, I don't know anything about computers. Or how to go about doing this.\n\nIf anyone could help me, I'd very much appreciate it.\nThanks !",
        "created_utc": 1496243142,
        "upvote_ratio": ""
    },
    {
        "title": "What is VR and How Does Virtual Reality Work In Modern World?",
        "author": "GabriellaSaybert",
        "url": "https://thinkmobiles.com/what-is-vr/",
        "text": "",
        "created_utc": 1496241189,
        "upvote_ratio": ""
    },
    {
        "title": "Security procedures using a USB stick.",
        "author": "Imjustmean",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ecs8e/security_procedures_using_a_usb_stick/",
        "text": "Hi everyone,\n\nI work for a company that is just starting to take security seriously. Right now I'm searching for options to help protect our computers if they get stolen, unathorised use etc. I've heard of a system that will now allow a computer to be accessed without some sort of USB inserted. I would like to know the name of these systems. I've tried googling with no luck. If anyone has used a system like this and has experience I'd love to hear about it. 1any other advice would be greatly appreciated. Thanks",
        "created_utc": 1496206513,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explai to me how bitwise operations might be used to perform simple calculations? Like arithmetic and multiplication?",
        "author": "InsidiousIntentions",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6e9vk4/can_someone_explai_to_me_how_bitwise_operations/",
        "text": "",
        "created_utc": 1496175257,
        "upvote_ratio": ""
    },
    {
        "title": "Why is everything built up by ones and zeroes? Why didn't it be threes and fours?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6e9136/why_is_everything_built_up_by_ones_and_zeroes_why/",
        "text": "[deleted]",
        "created_utc": 1496167383,
        "upvote_ratio": ""
    },
    {
        "title": "Finding The Largest Missing Element In An Array, Using O(nlog_2 n)?",
        "author": "MrMockRock",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6e6623/finding_the_largest_missing_element_in_an_array/",
        "text": "I'm tasked with creating an algorithm which returns the largest missing element in an array of size n, which ranges from values 1-k.\n\nExample: An array containing 1,1,3,1,3 has k=3, n=5, and the return should be 2.\n\nIf time complexity isn't taken into account, this is easy; just scan the array searching for k-1, k-2,...2, and the first time a value isn't found, return that value (or -1 if no such value exists). However, this loop in a loop will be O(n*k) complexity.\n\nI'm specifically asked to achieve O(nlog_2 n) in my result, and being new to algorithm design, I'm not sure how to handle this. I know that a heap sort, for example, is O(nlog_2 n), and it seems intuitive, but after doing the sort I would still need to scan through the sorted array looking for a missing element. So that's not going to cut it. I've been stuck on this for awhile, and if anyone has some insight on how I should be approaching a O(nlog_2 n) like this, I'd love to hear from you.",
        "created_utc": 1496134368,
        "upvote_ratio": ""
    },
    {
        "title": "Creating Inventory Database for equipment for a big Church in my area for internship, few questions.",
        "author": "Blazinginfern0X",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6e47j7/creating_inventory_database_for_equipment_for_a/",
        "text": "Hey guys, so I just landed a little internship at a local mega church and they asked me to create a database for all theyre musical, video, and audio equipment. No problem, but they run only on mac computers so I was wondering what program would be best for creating this inventory database. All I ever used in my database class was Mircrosoft access and as you may know that is not compatable with Mac OS. Thanks for the help!",
        "created_utc": 1496106696,
        "upvote_ratio": ""
    },
    {
        "title": "Performance of Service Tests vs. Unit Tests",
        "author": "political_issues",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6e0n4u/performance_of_service_tests_vs_unit_tests/",
        "text": "How does the Performance of Service Tests vs. Unit Tests usually compare for the two for services written in code. I am a newbie and have often heard/from experience noted that the service tests/functional tests and more tedious and slower to run than unit tests. ",
        "created_utc": 1496069187,
        "upvote_ratio": ""
    },
    {
        "title": "Beowulf cluster for bioinformatics applications",
        "author": "khachbe",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dzrxs/beowulf_cluster_for_bioinformatics_applications/",
        "text": "I'm double majoring in Computer Science and Biology and I'm about to get involved in a research project with a Bioinformatics professor. He wants me to help him set up a cluster at first but my knowledge of distributed computing is very narrow. I am looking up resources online and it seems that a Beowulf cluster is the best solution for the type of applications we are planning to run (mostly bioinformatics scripts dealing with NGS and the likes). However, I am afraid of screwing things up, I don't know which linux distro would be the best, I'm not sure how much swap space I should allocate. The professor ordered some new hardware so I'm a bit scared to screw things up yet the challenge of dealing with something I'm not familiar with gets me excited to work even more.",
        "created_utc": 1496057580,
        "upvote_ratio": ""
    },
    {
        "title": "Are there jobs in tech for liberal arts majors with a coding background?",
        "author": "A-programmer",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dxe4x/are_there_jobs_in_tech_for_liberal_arts_majors/",
        "text": "I am deciding whether to major in religion or philosophy to pursue my own interests. The thing is, I have programmed computers as a hobby since my teenage years--from the age of 12 or 13...I'm about to be 22--and I really can't imagine going into academia or working in any sector of the economy besides tech. (I've taken 6+ coding intensive courses at my university for reference, in addition to basic math.)\n\nI have many friends in engineering going to work at big name companies--I have one friend who is a C. S. major going to work at SpaceX, for example--but I don't think I'll ever be at the point that they are where I can write code all day for a living. I'm too enveloped with the English language.\n\nWhat sort of career opportunities would appeal to somebody with my background? I could pursue either a programming minor as an undergrad or a software engineering certificate/master's degree as a graduate student...but I don't want to send employers the wrong message.\n\nI don't want to be a programmer/software engineer, even if that's what I'm most clearly acclimated to...I want to make art.",
        "created_utc": 1496020532,
        "upvote_ratio": ""
    },
    {
        "title": "How can I modify a MST algorithm to find the shortest path to all vertices and then back to the starting location?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dvn01/how_can_i_modify_a_mst_algorithm_to_find_the/",
        "text": "[removed]",
        "created_utc": 1495999616,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone help explain how this works to me?",
        "author": "the_little_duckling",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dty1k/can_someone_help_explain_how_this_works_to_me/",
        "text": "I'm trying to make a palindrome generator. This is the program online that I am basing it off of: \nhttp://palindromegenerator.com/\n",
        "created_utc": 1495980357,
        "upvote_ratio": ""
    },
    {
        "title": "Would somebody mind checking my runtime complexity analysis for a code challenge I am trying to solve (javascript)?",
        "author": "ModulationLobbyist",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dsfwt/would_somebody_mind_checking_my_runtime/",
        "text": "I am trying to learn Big O notation as a fresh web dev bootcamp grad. We didn't cover any time-complexity.\n\nThe [codewars challenge (3kyu)](https://www.codewars.com/kata/56a1c63f3bc6827e13000006/train/javascript) is a performance and scaling challenge.\n\nThe task is to return an array that finds how many elements in an array to the right are smaller than each array[i]. I'm guessing the solution is to write an algorithm at least better than O(n^(2)) since I believe my basic solution is O(n^(2)). The challenge uses arrays larger than 100k elements and you are given a max runtime of 1200ms. Unfortunately large arrays can only be tested directly on the challenge website because I didn't know how to set it up in codepen but for basic tests, I have included a codepen: [here.](https://codepen.io/anon/pen/OmYWop/left?editors=0011)\n\nOriginal basic solution O(n^(2))\n\n    function smaller(nums) {\n      let smallArr = [];\n      let cur;\n      for (let i = 0; i &lt; nums.length; i++) {\n        cur = nums[i];\n        let counter = 0;\n        for (let j = i + 1; j &lt; nums.length; j++) {\n          if (nums[j] &lt; cur) {\n            counter++;\n          }\n        }\n        smallArr.push(counter);\n      }\n      return smallArr;\n    }\n    \n    smaller([1, 1, -1, 0, 0]) //[3, 3, 0, 0, 0]\n\nThe basic solution wasn't efficient enough so I tried to refactor by rethinking the process using sort and came up with the following and I'm wondering if I actually made a worse solution than the basic one.\n\nSecond Solution\n\n    function smaller(nums) {\n      let origNums = nums.slice(); //O(n)\n      let smallArr = [];\n      let sortedNums = nums.sort( (a,b) =&gt; { return a - b} ) //avg O(n log n) worst O(n^2)\n      while (origNums.length) { //O(n * 1 * n * n)\n        let sortedIndex = sortedNums.indexOf(origNums[0]); //O(n)\n        smallArr.push(sortedIndex); //O(1)\n        sortedNums.splice(sortedIndex, 1); //O(n)\n        origNums.splice(0, 1); //O(n)\n      }\n      return smallArr;\n    }\n\n    smaller([1, 1, -1, 0, 0]) //[3, 3, 0, 0, 0]\n\nSo I'm thinking: \n\n    O(n + n^2 + n * 1 * n * n)\n    O(n + n^2 + 1*n^3)\n    O(n^3)\n\nOr maybe:\n\n    O(n + n^2 + n * (1 + n + n))\n    O(n + n^2 + n * (1 + 2n))\n    O(n + n^2 + n + 2n^2)\n    O(n^2)\n\nI'd like to verify if my second attempt is indeed O(n^(3)) or O(n^(2)).\n\nAlso, if I am way off in my thinking on how to solve the challenge, any tips on pointing me in the right direction to solve the code challenge would be greatly appreciated but I do not want the actual code solution.\n\nThank you.\n\nEdit: Adds another Big O attempt",
        "created_utc": 1495952980,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody recommend the Jon Duckett books?",
        "author": "Karcz95",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dowfl/does_anybody_recommend_the_jon_duckett_books/",
        "text": "I'm looking at the HTML/CSS and the JavaScript/jQuery books specifically. I'm in my third year of college, and I just got an internship that works with a lot of the JavaScript/jQuery. I'm looking to familiarize myself with the basics of the languages so I can understand what I'm looking at.",
        "created_utc": 1495906291,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure this is the career for me...",
        "author": "blacktinyrick",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dl952/not_sure_this_is_the_career_for_me/",
        "text": "I am currently attending a community college for the computer science program. I have just recently finished calc 1 (with a D+) and dropped computer science 2 because i couldn't complete a single program. Also the last few classes I've taken i really struggled trig (barley C),college algebra (solid C), computer science 1( C). seeing that those are the main things i need to know should i think of another career path, keep trying, or maybe take a step back? I have been going part time for a few years and took a year off because of financial issues. I honestly feel like i should be on my way out of school and in my field already but these setbacks are really making me doubt myself and future.\n\nP.S: i know the choice in the end is mine to make but i would like to know if others are or were in a similar situation as me.",
        "created_utc": 1495851364,
        "upvote_ratio": ""
    },
    {
        "title": "How would someone make a generic USB device and a program which uses it?",
        "author": "Sanders0492",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dkkh1/how_would_someone_make_a_generic_usb_device_and_a/",
        "text": "I'm mostly trying to find out where to start reading. I have a few ideas of what I'd want to make, but instead I'll make a hypothetical example:\n\nLet's say I tossed together a circuit board with some buttons, pots, lights, etc. and wrote a program which I would like to communicate with the board. The program would output info to the board (the board would use that info to decide which LEDs to light up) as well as receive input from the board (when a button is presses or a pot value is changed). The program would respond to the input accordingly.\n\nWhere should I start reading on this subject? I'm assuming an Arduino would make this a lot easier, and I'm not opposed to that at all, but I also wouldn't mind learning without the Arduino. My EE skills are minimal, but I'm always down for a learning project.\n\nThanks for any help!\n",
        "created_utc": 1495842825,
        "upvote_ratio": ""
    },
    {
        "title": "I read that page table is stored in kernel and TLB is in chip. The latter is used as a cache for faster translation of virtual to physical address. So, how can TLB cache those translations if they've already happened in kernel software?",
        "author": "sergio471",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dhzbu/i_read_that_page_table_is_stored_in_kernel_and/",
        "text": "",
        "created_utc": 1495815914,
        "upvote_ratio": ""
    },
    {
        "title": "[Questionnaire] Looking for participants for my Computing BSc degree survey. General questions on CS careers and experience.",
        "author": "DefinitelyNotBisasam",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dg59v/questionnaire_looking_for_participants_for_my/",
        "text": "Hi all,\n\nFor my Computing BSc degree I'm developing a SQL Server database to meet client requirements. The problem is I don't have a real-world client to work with, so the requirements have been materialised by me. As such, I'm in need of participants who have knowledge/experience in applications development and database dev/admin (and other fields, too) to answer a few questions on their career experiences.\n\nAny participation would be very helpful! Here's the link: https://goo.gl/forms/ALWo0OozONGud7Vg1",
        "created_utc": 1495794761,
        "upvote_ratio": ""
    },
    {
        "title": "Is this Information retrieval?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6dfpbq/is_this_information_retrieval/",
        "text": "[deleted]",
        "created_utc": 1495787310,
        "upvote_ratio": ""
    },
    {
        "title": "Working with DB datetime/date columns in Go",
        "author": "Tatta360",
        "url": "http://pliutau.com/working-with-db-time-in-go/",
        "text": "",
        "created_utc": 1495782409,
        "upvote_ratio": ""
    },
    {
        "title": "A Note Taking Web App for Computer Scientists: snippets, links, todos and notes on steroids.",
        "author": "sandcrain",
        "url": "http://codeowl.io",
        "text": "",
        "created_utc": 1495737492,
        "upvote_ratio": ""
    },
    {
        "title": "Hey guys, I'm a recent computer science graduate class 2016, I live in Texas, and I haven't been able to find a job for over a year. I got a minor a mathematics, I was wondering what should I do, go for my masters, or just become a high school teacher?",
        "author": "KingShabba",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6d8w3p/hey_guys_im_a_recent_computer_science_graduate/",
        "text": "",
        "created_utc": 1495709971,
        "upvote_ratio": ""
    },
    {
        "title": "Which laptop to buy for a compsci student?",
        "author": "jamb0l",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6d6z9x/which_laptop_to_buy_for_a_compsci_student/",
        "text": "I'll be a sophomore in the fall and I plan on declaring a compsci major. I've taken Java and I'm taking C++ in the fall, and I need a new laptop pretty badly. I thought I'd come here to ask for input on what would be a good investment to last me through the next 3 years.\n\nI've sort of narrowed it down to the Razer Blade (Late 2016), Dell XPS 15, and the MacBook Pro 13 Touch Bar. I definitely want the 512GB SSD option regardless of which one I buy. But considering these are all hefty investments that I want to last me at least until I graduate, I wanted some input on what others think would be the best option for a compsci student with 3 years to go.",
        "created_utc": 1495680866,
        "upvote_ratio": ""
    }
]