[
    {
        "title": "I want to work in industry. I like coding, CS theory, and mathematics. How and where are these skills used?",
        "author": "kovlin",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v9sgh/i_want_to_work_in_industry_i_like_coding_cs/",
        "text": "I don't really know the breadth of my career options with focuses in those fields. I assume *someone* must find these a valuable combination of skills, but I don't know how they might be applied to industry applications.",
        "created_utc": 1517780070,
        "upvote_ratio": ""
    },
    {
        "title": "Grouping people based on defined restrictions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v9hxz/grouping_people_based_on_defined_restrictions/",
        "text": "[deleted]",
        "created_utc": 1517777518,
        "upvote_ratio": ""
    },
    {
        "title": "What is the name of the 2D/3D Indexing method that places neighbors closer together?",
        "author": "GoogleBot42",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v8v1o/what_is_the_name_of_the_2d3d_indexing_method_that/",
        "text": "Note: This is my first post on reddit.  Let me know if I am doing something stupid or wrong.  Thanks!\n\nI recall reading somewhere on the interwebs that there is a method of dividing the space of a flattened array (eg a 3D array flattened into a 1D one) differently so that neighbors are closer together in memory in the average case since it is better for caching and can overall increase performance.  Although, I cannot seem to remember what it is called.\n\nHere's a picture (from memory) of how a 2D array might be split.  Perhaps what I remember is incorrect but it should illustrate the point.  Thanks! [4x4 Zig Zaggy thing](https://i.imgur.com/VFnbsRo.png)",
        "created_utc": 1517772107,
        "upvote_ratio": ""
    },
    {
        "title": "Confusion around dynamic linking and compilation.",
        "author": "PedoDorf",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v8uig/confusion_around_dynamic_linking_and_compilation/",
        "text": "So I've just found out dynamic linking isn't what I thought it is and so I would really appreciate help from anyone with making sure what it is.\nStatic linking is when you compile your code and the compiler puts/links (which word is better?) all the machine code (all symbols are replaced by actual machine code) into one file right? So after\n\n     g++ main.c\n\nall I get is single a.out file. Did that compilation use dynamic linking or static linking?\nHow can I choose and should I?\nI mean when dynamic linking is so much better then why would I even want to use static linking?\n\nI read that you can either create executable, library or object file. How can I choose which one I want?\nIsn't object file partially compiled library?\nWhy would I want to make library file then?\n\nFrom this line on wikipedia \"Many operating system environments allow dynamic linking, that is the postponing of the resolving of some undefined symbols until a program is run.\". Does that mean that compiler created a.out but didn't fully link it?\nIf so how can the compiled file (a.out) know which libraries to load and where they are or does it ask the OS to provide XY libraries defined by that symbol? (or object files is the right word?)\n\nWhat if during development you use some framework?\nThere is no way the end user has that framework. How do you deal with that?\n\nIf all that I said is somehow right. Are most of the files that get created during installation of something like Firefox, those object files that get linked after running the a.out file because it is dynamically linked?\nIf yes, is there something between dynamic and static linking? You replace some symbols with code that other computers don't have but you leave symbols for standard libraries that everyone should have. So that you save at least a bit of a storage.\nAnd if yes... why would you not just ship everything in one a.out file? Symbols get replaced with standard libraries that everyone has after running a.out and the code you wrote will be already in there.\n\nPlease point out everything I got wrong or I'm forgetting or missing. I would really appreciate it.",
        "created_utc": 1517771981,
        "upvote_ratio": ""
    },
    {
        "title": "Does which college I go to school for CS matter?",
        "author": "flyrom",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v4qgm/does_which_college_i_go_to_school_for_cs_matter/",
        "text": "Trying to decide between UIUC(Out of state) for Stats + CS and OSU(in state) for CSE. Do you think going to UIUC for 15k more each year would be worth the education/name on resume?\n\nThanks :)",
        "created_utc": 1517719605,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for help on research ideas for research in my undergrad",
        "author": "aussy16",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v0xgy/looking_for_help_on_research_ideas_for_research/",
        "text": "Hi! I’m going into my 4th year of computer science next year, and I need to choose a research topic soon for my honours research courses. I was having trouble finding topics, as I wasn’t sure what would be above my level of expertise considering I have to do the research while doing other courses, and I will only have 4-8 months to do it depending on if I do it for both semesters.\n\nI was looking into bioinformatics, computational biology, and systems biology as a possibility, but I wasn’t sure if those were more biology than computer science, so if anyone knows anything about those topics it would be great! Other topics that interest me are AI and games. Any feedback or ideas would be greatly appreciated, Hanks!",
        "created_utc": 1517681263,
        "upvote_ratio": ""
    },
    {
        "title": "Doctors office gave me a CD with a computer virus. Now what?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v0gwm/doctors_office_gave_me_a_cd_with_a_computer_virus/",
        "text": "[deleted]",
        "created_utc": 1517677068,
        "upvote_ratio": ""
    },
    {
        "title": "CS217",
        "author": "rightclickerrrr",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7v0fv1/cs217/",
        "text": "Can anybody please let me know should i take this course, it requires basic knowledge in C++ and all i took is java script. I am arleady enrolled in it and semester starts next week. Should i try to drop it and take another course or can i learn C++ on the go while i take the course",
        "created_utc": 1517676812,
        "upvote_ratio": ""
    },
    {
        "title": "WWU csci 247 &amp; 301",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uy0j7/wwu_csci_247_301/",
        "text": "[deleted]",
        "created_utc": 1517643101,
        "upvote_ratio": ""
    },
    {
        "title": "Help with Desktop Setup for running algorithms",
        "author": "stasuke",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uxqlk/help_with_desktop_setup_for_running_algorithms/",
        "text": "Hey all, as the title says I need some help with customizing a desktop for running optimization (metaheuristics and integer programming) algorithms. I have always used basic desktops up until now so I am not sure what to focus on. I do know memory is a key issue as sophisticated algorithms (like dynamic programming) really used to freeze my PC during computational experiments, with 16 GB of RAM. HP has the Z series (http://www8.hp.com/us/en/campaigns/workstations-desktop-mlp/index.html) but they are expensive and I think I could do better if I build the system myself.\n\nWould a Xeon processor be better than the intel core series? What about the GPU? Is that really needed for running optimization algorithms? Thanks!",
        "created_utc": 1517638946,
        "upvote_ratio": ""
    },
    {
        "title": "What is the first useful program you ever made?",
        "author": "bobloblaw692",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uukhq/what_is_the_first_useful_program_you_ever_made/",
        "text": "I decided to start learning to program and I am not very certain on when I will actually learn how to make this skill something beneficial to my life. In order to get some motivation I was hoping I could hear some stories from anyone out there that made some useful programs on there own and how they benefited your life.\n\nLooking forward to hearing from you guys!! ",
        "created_utc": 1517605905,
        "upvote_ratio": ""
    },
    {
        "title": "Project ideas for a group database project? (Undergraduate)",
        "author": "Tennislife",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ut43c/project_ideas_for_a_group_database_project/",
        "text": "Hi everyone, for my Databases classes this semester, we have a large collaborative project with 5 students per group. Our group was considering doing something related to healthcare that helps the community. Anyone have any application in mind that they think would be beneficial to the community? The data required for the project must be publicly available.\n\nThanks in advance!",
        "created_utc": 1517594140,
        "upvote_ratio": ""
    },
    {
        "title": "8 to 3 Priority Encoder",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7up1vd/8_to_3_priority_encoder/",
        "text": "[deleted]",
        "created_utc": 1517547999,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting OSI layer 3/4 issue",
        "author": "Bad_Laika",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uox1e/interesting_osi_layer_34_issue/",
        "text": "Hi r/AskComputerScience, for the last week or so I have had a rather interesting issue with my desktop that I seem to have come up short on solving. The issue is that I am receiving a wireless internet speed of 1.2 Mbps, on both our 2.4 and 5 Ghz networks. This just recently happened as my normal speed was ~50 Mbps. I cannot figure out why it has changed. Here are the details so far: \n1: on our guest network, I have a speed of ~30 Mbps\n2: Nothing about my PC has changed between normal funcitonality and the current problem (no updates, malware etc) \n3: My wireless adapter works perfectly fine (tested it in another pc)\n4: There is no improvement in speed with an ethernet cable (cable has been verified working on another machine)\n5: My PC works fine on an entirely different network (60 Mbps on a friends network)\nDo you all have any suggestions for what to try? I did a restore point for before the issue started, no dice. I updated the firmware on my router and made sure there was nothing out of the ordinary in the settings (my initial thought was that my roommate was throttling me). I am pretty stumped here.  \nThanks!",
        "created_utc": 1517546468,
        "upvote_ratio": ""
    },
    {
        "title": "Voice Search Study - Does Alexa / Siri dislike certain accents?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uo4jz/voice_search_study_does_alexa_siri_dislike/",
        "text": "[deleted]",
        "created_utc": 1517538162,
        "upvote_ratio": ""
    },
    {
        "title": "How do I solve these problems?",
        "author": "Major_Fang",
        "url": "https://i.redd.it/dw72zryvjod01.jpg",
        "text": "",
        "created_utc": 1517525154,
        "upvote_ratio": ""
    },
    {
        "title": "How to learn Data Structures/Algorithms",
        "author": "RushLegend",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7um7np/how_to_learn_data_structuresalgorithms/",
        "text": "Hi,\n\nI am a relatively new programmer and I'm curious whats the best way to learn Data Structures &amp; Algorithms. I usually use Python to program and was curious if you guys have any recommendations on how to approach learning these concepts. \n\n",
        "created_utc": 1517520727,
        "upvote_ratio": ""
    },
    {
        "title": "Should a fraction of the Millenium Prize Problem for P vs NP be forkable to a proof of the complexity class of Graph Isomorphism?",
        "author": "BenRayfield",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ulpl6/should_a_fraction_of_the_millenium_prize_problem/",
        "text": "For example, if someone proved Graph Isomorphism is below NPComplete, they would get x fraction of the million dollars, leaving 1-x fraction of it for the rest, or if someone proved P != NP or P = NP first, the whole million dollars.\n\nSubgraph-isomorphism is npcomplete, but graph-isomorphism is unknown complexity class.\n\nBTW I think of the connection between isomorphism and max-clique as, an undirected graph is a triangle-matrix of bits where any 2 adjacent parts of the diagonal can be swapped (or in generally a permutation), and to find max-clique you solid pack the nondiag bits into the corner of that triangle matrix, as if the nondiags are the bits of an integer. Cliques are sorted highest (or lowest), and within that same sort, isomorphism can be binary-searched, but as far as I know it costs exponential for each compare of 2 graphs (unless P=NP which is unlikely). Since there is a consistent sort order of graphs, I find it hard to believe that equality could be measured exponentially faster than comparing less/equal/more.",
        "created_utc": 1517516720,
        "upvote_ratio": ""
    },
    {
        "title": "What are some ethical issues/dilemmas in computer science?",
        "author": "TheUnknownLazuli",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ul0u3/what_are_some_ethical_issuesdilemmas_in_computer/",
        "text": "I’m trying real hard to find a topic for a paper I have to write for an International Baccalaureate (IB) class. The topic has to be about an ethical issue or dilemma that is occurring in computer science.\n\nTwo topics I’ve found so far are ‘How much protection is enough for web users’ and ‘Are victimless crime better received than crime with human victims’ (for example is hacking someone as bad as physical assaulting them).\n\nThank you to anyone who helps!",
        "created_utc": 1517511349,
        "upvote_ratio": ""
    },
    {
        "title": "Where to learn about app creation?",
        "author": "poomaloof",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uj8og/where_to_learn_about_app_creation/",
        "text": "I hope this is in the correct subreddit. if not please point me in the right direction. Subreddits around my question will be helpful.\n\nI am looking for some online resources on how to make my own phone apps and/or web apps? What coding language do I need to learn? Is there a starting place where I can learn? Any information will be helpful. \n\n-Thanks ahead of time for your help! ",
        "created_utc": 1517496869,
        "upvote_ratio": ""
    },
    {
        "title": "efficient algorithm for finding isPowerOfTwo",
        "author": "al_pal_in_space",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ueqy8/efficient_algorithm_for_finding_ispoweroftwo/",
        "text": "trying to give an algorithm that determines whether or not an Integer N is a power of 2. I wanted to implement something along the lines of a binary search mixed with modulo, but am having trouble connecting the two ideas. Any advice on how to get started?",
        "created_utc": 1517445193,
        "upvote_ratio": ""
    },
    {
        "title": "Does minesweeper keep its npcompleteness if instead of numbers 0-8 we use even/odd quantity of mines?",
        "author": "BenRayfield",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7udoyk/does_minesweeper_keep_its_npcompleteness_if/",
        "text": "Like Conways Game Of Life is turingcomplete in a 2d grid, minesweeper is npcomplete in a 2d grid. Minesweeper has 11 states per square: unknown, certainly mine, certainly not a mine and of the 8 adjacent squares 0-8 of them are mines.\n\nCould we reduce the \"certainly not a mine and of the 8 adjacent squares 0-8 of them are mines\" to \"certainly not a mine and of the 8 adjacent squares theres an even number of mines\" or \"...odd...\"?\n\nLogic gates in minesweeper seem to have very little \"wiggle room\" adjacent to each cell such as at http://www.formauri.es/personal/pgimeno/compurec/Minesweeper.php\n\nTheres an alternate form of npcompleteness in a 2d grid, where each square has 16 possible states, which describe the possibilities allowed in each local 2x2 grid of bits, which is more compressed in how it can cross wires at opposite corners or tops/bottoms or lefts/rights of 2x2 or at any 3 of those 4 do a nand or nor logic, but minesweeper has the advantage of instantly scoring player's action (given a hidden 1 bit per square state which generates the numbers 0-8 or boom mine found) instead of waiting until potentially near the end of the game when player proves a contradiction. So as a testcase for AI, I find minesweeper more interesting and useful.",
        "created_utc": 1517436164,
        "upvote_ratio": ""
    },
    {
        "title": "Best way to learn Python?",
        "author": "ZhouDa",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ucowz/best_way_to_learn_python/",
        "text": "I'm a CSCI student who only has 9 credits this semester, and a professor has asked for help on a paper. I've volunteered, and it basically going to be doing some tasks in Python, which I haven't learned yet. What is a quick cheap route for learning Python?",
        "created_utc": 1517428410,
        "upvote_ratio": ""
    },
    {
        "title": "Is integral calculus required to understand time complexity and algorithmic design ?",
        "author": "throwaway93hundred",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uc650/is_integral_calculus_required_to_understand_time/",
        "text": "Hi, I posted a question some time ago on Trigonometry and algorithmic analysis. I'm reaching the end of my differential calculus course and while I do want to study integral calculus (out of curiosity) at some point I'd like to move on to more \"relevant\" topics (namely discrete math and combinatorics). For those of you who have studied time complexity and algorithm design,  are there any bits that require knowledge of integral calc ? (I'm studying through Coursera and MIT ocw / khan academy, so I'm not a college student). Thanks in advance. ",
        "created_utc": 1517424372,
        "upvote_ratio": ""
    },
    {
        "title": "What programming language does Costco use for in-house systems?",
        "author": "mp38661",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7uak74/what_programming_language_does_costco_use_for/",
        "text": "After looking at few Costco systems, I see they have a \"green screen\" UI. Now, I'm just wondering what programming language is used to program these systems. \n\nThanks!",
        "created_utc": 1517411706,
        "upvote_ratio": ""
    },
    {
        "title": "Is Computer Science immune to high textbook prices for some reason?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ua2fj/is_computer_science_immune_to_high_textbook/",
        "text": "[deleted]",
        "created_utc": 1517407263,
        "upvote_ratio": ""
    },
    {
        "title": "C++ code assistance",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7u8e6g/c_code_assistance/",
        "text": "[deleted]",
        "created_utc": 1517385704,
        "upvote_ratio": ""
    },
    {
        "title": "How to make the most of a hackathon?",
        "author": "jnzq",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7u8af9/how_to_make_the_most_of_a_hackathon/",
        "text": "I've been to several hackathons now, but at each one, I can't say I've been able to do much. I'm already into my third year in computer science, but all the curriculum has taught me has been just programming logic and problem solving.\n\nI've only gotten a few opportunities to build something from the ground-up, so I have no idea what to do when it comes to implementing something as complex as the submissions that win hackathons.\n\nSo what's the best way to make the most out of a hackathon experience?",
        "created_utc": 1517384192,
        "upvote_ratio": ""
    },
    {
        "title": "How to convert a decimal integer into a 16 bit binary integer",
        "author": "UnfitPirate",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7u5suv/how_to_convert_a_decimal_integer_into_a_16_bit/",
        "text": "In class we're going over how to convert binary into hex and decimal, and visa versa. I've got 8 bit covered, but need help converting a decimal into 16 bit. Say I have the decimal integer 10924 and have to convert it to an unsigned binary integer. What's the process for doing that? ",
        "created_utc": 1517358976,
        "upvote_ratio": ""
    },
    {
        "title": "Laptop Suggestions?",
        "author": "scramblejam",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7u3ze2/laptop_suggestions/",
        "text": "Starting a computer science major in the fall and definitely need a new laptop. I'd preferably like to stay at a max budget of $1000. Any suggestions would be great and appreciated! ",
        "created_utc": 1517343716,
        "upvote_ratio": ""
    },
    {
        "title": "is it normal that you get so tired after 5 hours in front of your pc, working in the cs industry?",
        "author": "laffa-yett",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7u2942/is_it_normal_that_you_get_so_tired_after_5_hours/",
        "text": "guys right now im studying, and i work as an admin in a company, where im responsible for the computer stuff.\nright now im doing stuff with the website and im sitting like 7 hours a day in front off my laptop.\nin the last 2 weeks ive realised that after 5 hours i get really tired.\nits like i can throw the last 3 hours of my worktime in the trash can, because i do stuff i normaly need 5 minutes for in 30 minutes.\nis that normal?\ndo you guys have some tipps for that, besides sport.\ni do sport 3 times a week.\nalways before going to work i hit the gym.\n",
        "created_utc": 1517330179,
        "upvote_ratio": ""
    },
    {
        "title": "Is this something common with Comp Sci majors?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tz4x0/is_this_something_common_with_comp_sci_majors/",
        "text": "I've heard of Comp Sci majors being cold individuals, but never put stock into it. I'm going to a class with some student who said he'd major in Comp Sci. He also said people who didn't live in states like Texas were \"cocksuckers\". Are most comp-sci majors this conservative?",
        "created_utc": 1517294071,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice on a project involving web development, data management, ios development, and android development",
        "author": "swagner648",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tyrgn/looking_for_advice_on_a_project_involving_web/",
        "text": "So I am looking to create a service that can facilitate rideshares for my university. We currently operate using a facebook page where people post either looking for rides or giving rides. It is a messy system with no accountability or ability to comment on a bad driver or rider. My goal is to create a service that can easily allow rides to be found and allow users to rate and review drivers in order to allow the riders to be more confident in their driver. I am looking for advice on which languages or packages to look into for completing this project. I have listed below the main parts of the service as I am understanding.\n\n1. A management system for the data that will be required to be stored about users, reviews, rides, etc.\n\n2. A website that will include a user login, notifications, integration with maps, a messaging service, and be mobile friendly.\n\n3. An application for both Android and iOS that would be able to do the same things the website does but packaged up into a mobile application.\n\nI have experience in java and python. I am just hoping for a little bit of guidance as to where I should go from here. I was considering using SQL for the database side of things, Python Django for the website, and Swift for the iOS application. Other than that I am unsure. Any and all help would be greatly appreciated!\n\nEdit: Any advice on working with these types of tools in a team setting would also be appreciated. I have done programming on my own, but am unaware of tools used by teams that would allow them to easily collaborate on projects.",
        "created_utc": 1517289649,
        "upvote_ratio": ""
    },
    {
        "title": "How to prove L= a* ba( ba* )* is context-free using pumping lemma?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ty4jq/how_to_prove_l_a_ba_ba_is_contextfree_using/",
        "text": "[deleted]",
        "created_utc": 1517282958,
        "upvote_ratio": ""
    },
    {
        "title": "What is an expression that tests if some variable a is outside a range (like between 10 and 20)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7txw49/what_is_an_expression_that_tests_if_some_variable/",
        "text": "[deleted]",
        "created_utc": 1517280624,
        "upvote_ratio": ""
    },
    {
        "title": "Pumping lemma to prove a language is not context-free",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7txoe9/pumping_lemma_to_prove_a_language_is_not/",
        "text": "[deleted]",
        "created_utc": 1517278530,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling in class",
        "author": "WiggWamm",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tx8gt/struggling_in_class/",
        "text": "Hi I’m a comp sci student and I’m struggling in a data structures and algorithms class. I was just wondering if there’s anyone here who’s ever had to retake a class or anything like that cause I’m feeling pretty lost rn",
        "created_utc": 1517274294,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling with Alphabetizing a BST.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tv710/struggling_with_alphabetizing_a_bst/",
        "text": "[deleted]",
        "created_utc": 1517257074,
        "upvote_ratio": ""
    },
    {
        "title": "How do you stay up to date in A.I related topics",
        "author": "fo0barz",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tujq5/how_do_you_stay_up_to_date_in_ai_related_topics/",
        "text": "Hey everyone. I have been out of school for 5 years now, so my self learning has slowed down a but, but I usually use a combination of HackerNews, Medium, and TechCrunch to stay up to date in what is happening in computing as well as start-up land. \n\nRecently, I am getting the feeling that I am missing out on some of the latest news around A.I / machine learning. Given how fast the field is moving, there is probably a lot of information being put out there, but I am not seeming to see a lot of it daily or weekly.\n\nAre there any particular sites / mediums you use to keep up to date with news in the A.I field? Are there any great conferences coming up that might be worth attending? Thanks!",
        "created_utc": 1517251949,
        "upvote_ratio": ""
    },
    {
        "title": "What am I doing wrong....",
        "author": "[deleted]",
        "url": "https://i.redd.it/7s66nkskc1d01.jpg",
        "text": "[deleted]",
        "created_utc": 1517244239,
        "upvote_ratio": ""
    },
    {
        "title": "New to CS and stuck here, can anyone help?",
        "author": "Thewhitemagic",
        "url": "https://i.redd.it/gizus1qpxxc01.jpg",
        "text": "",
        "created_utc": 1517202918,
        "upvote_ratio": ""
    },
    {
        "title": "Going from Object Oriented to embedded in C. Most previously used architecture patterns don't apply very well. Tips/Advice for resources on software architecture?",
        "author": "jollytopper",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tp4de/going_from_object_oriented_to_embedded_in_c_most/",
        "text": "",
        "created_utc": 1517192574,
        "upvote_ratio": ""
    },
    {
        "title": "Help with a function.....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tnjlc/help_with_a_function/",
        "text": "[deleted]",
        "created_utc": 1517177474,
        "upvote_ratio": ""
    },
    {
        "title": "Question about nyquist theorem",
        "author": "o1_complexity",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tipu3/question_about_nyquist_theorem/",
        "text": "in nyquist's theorem `Max Rate= 2B * log_2(V)`\n\n\nwhen calculating V, it should always be a power of 2.\nI obtained V = ~10.0. Now the question, which should I use: 2^3 or 2^4 discrete levels?",
        "created_utc": 1517121205,
        "upvote_ratio": ""
    },
    {
        "title": "[Algorithms and data structures] Time complexity",
        "author": "eddie_g2020",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tfln6/algorithms_and_data_structures_time_complexity/",
        "text": "Our goal was to find the theta notation for the following for loops. Is there any flaw in my logic? If not, how would I go about verifying my answer? Sorry for the picture quality, for some reason it is more compressed than the original.\n\nThanks. https://imgur.com/a/SR1Zy\n\n",
        "created_utc": 1517087266,
        "upvote_ratio": ""
    },
    {
        "title": "[Help] Proving a language is regular (or non-regular) with Myhill–Nerode theorem, where to find some examples?",
        "author": "denierCZ",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7te93q/help_proving_a_language_is_regular_or_nonregular/",
        "text": "I am looking for some examples to test my knowledge on, but I did not find any.\n\nI know the theorem very vaguely, and I did try an example or two from my professor's written notes...\n\nand I think I understand it, it has to have a finite count of subclasses, or else it is not finite (regular..).\n\nThe problem is I don't have the intuition to find those contradicting examples in case of proving non-regularity.\n\nI tried searching youtube for some myhill nerode examples but I found only incomprehensible Indian videos.\n\nIf you know some examples with explanation (solved) or any video lecturing sites with this kind of matter (myhill nerode, FA minimalization) could you please point me in the right direction?",
        "created_utc": 1517075225,
        "upvote_ratio": ""
    },
    {
        "title": "How Does Electric Sheep work, generally?",
        "author": "BagelKing",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7tawv7/how_does_electric_sheep_work_generally/",
        "text": "(Sorry if this is not the place for this kind of question, please refer me to the right place) \n\nI don't know a lot about [Electric Sheep](https://www.youtube.com/watch?v=t6jlhqNxRYk) except that it's a screensaver that works by sharing user CPU resources over a network to collectively render extremely intricate images and somehow broadcast the result back to users. It occurred to me while I was watching it on my screen that I don't know of any way it could be doing this except via video streaming, which I am 99% sure it isn't doing because there is never any kind of buffering or lag. But, if it isn't doing that, then the only other thing I can think is that it's sending instructions to be executed on my GPU, but then where is the contribution from other machines coming from? Can anyone shed light on what I'm missing?\n\n**Edit:** Oh, I forgot to mention that ES also allows voting on any given 'sheep,' which the server uses to determine which sheep survive and evolve and which ones die. This also suggests to me that it's not a simple video stream",
        "created_utc": 1517032829,
        "upvote_ratio": ""
    },
    {
        "title": "Big Data Cluster",
        "author": "Jiggabachi",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t85lv/big_data_cluster/",
        "text": "A professor at my university is working on a big data cluster to prepare for a big data class and is having a meeting with students who want to work on it. He plans on assigning different parts to students and I was wondering what all is involved with this project.",
        "created_utc": 1517004912,
        "upvote_ratio": ""
    },
    {
        "title": "Is “Introduction to Computing Systems: From Bit and Gates...”",
        "author": "WindowsKidd",
        "url": "https://www.reddit.com/r/computerscience/comments/7q6ycu/is_introduction_to_computing_systems_from_bit_and/",
        "text": "",
        "created_utc": 1516997374,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the complexity class (above turingComplete) of a func of [self possibleNextSelf] to bit (is this transition allowed) looping until some halting state?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t75pg/whats_the_complexity_class_above_turingcomplete/",
        "text": "[deleted]",
        "created_utc": 1516996488,
        "upvote_ratio": ""
    },
    {
        "title": "Simple Big Oh notation question",
        "author": "dman10345",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t6e6o/simple_big_oh_notation_question/",
        "text": "I just started learning big oh notation in my CS 2 class and was taking an online quiz. The question on the quiz was as follows\n\n_____\n\n**How many of the following formulas are O(n^2 )?**\n\n- n^3 - 3n^2\n\n- 0.25n^2\n\n- 2n^2 * 14n\n\n- (n + 2)(n - 2)\n\nA) 1\n\nB) 2\n\nC) 3\n\nD) 4\n\n_____\n\nCorrect answer is B) 2.\n\nMy question is why is (n+2)(n-2) not of the type O(n^2 )? I would assume you would simplify this before being able to tell which would give n^2 - 4 leaving a factor of n^2 .",
        "created_utc": 1516990158,
        "upvote_ratio": ""
    },
    {
        "title": "Any tips for Solving Algorithm programming assignments?",
        "author": "Marorin",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t5r0p/any_tips_for_solving_algorithm_programming/",
        "text": "So one thing I've found myself having issues with are programming assignments that implement an algorithm taught in a class. Given the challenge these courses tend to give, what sort of tips or suggestions would you give when first starting out such an assignment? Would considering an IPO chart help for instance or writing down pseudocode? ",
        "created_utc": 1516984967,
        "upvote_ratio": ""
    },
    {
        "title": "Is trigonometry necessary for algorithmic analysis ?",
        "author": "throwaway93hundred",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t4qp5/is_trigonometry_necessary_for_algorithmic_analysis/",
        "text": "Hi Guys,\n\nI'm a programmer (I've been doing mostly backend DevOps, to give you some background) and found an interest in the theory behind everything I do. So I decided to learn CS through MITs open courseware platform. Right now I'm doing single variable calculus which I think is fun but for you guys who have already graduated can you tell me if trigonometry is important and plays a role in big O analysis ? (I'm not at that point yet, after Calc I, Ill need to complete a discrete math course) but just curious. Thanks in advance ",
        "created_utc": 1516975987,
        "upvote_ratio": ""
    },
    {
        "title": "Need pointers for quantitative methods in Design Research in Software Engineering.",
        "author": "nakafi",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t4e1b/need_pointers_for_quantitative_methods_in_design/",
        "text": "To convince reviewers about a proposed software architecture.\n\nThanks.",
        "created_utc": 1516972187,
        "upvote_ratio": ""
    },
    {
        "title": "C++ reading from a file into an array of structures",
        "author": "JerichoJely",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t0xyi/c_reading_from_a_file_into_an_array_of_structures/",
        "text": "I'm trying to read a text file into an array of structures. Right now I'm just focusing on filling one array. \n\nHere's a link to my code:\nhttps://gist.github.com/anonymous/f79cbf9cbcb21a9852716004d96c2eef\n",
        "created_utc": 1516928166,
        "upvote_ratio": ""
    },
    {
        "title": "C++ reading from a file into an array of structures",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7t0v4m/c_reading_from_a_file_into_an_array_of_structures/",
        "text": "[deleted]",
        "created_utc": 1516927412,
        "upvote_ratio": ""
    },
    {
        "title": "What to look for in a good programming laptop?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7syqbi/what_to_look_for_in_a_good_programming_laptop/",
        "text": "[deleted]",
        "created_utc": 1516909458,
        "upvote_ratio": ""
    },
    {
        "title": "Clarification on Union-Find Interview Q",
        "author": "freneticpony21",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sya02/clarification_on_unionfind_interview_q/",
        "text": "**\nQuestion below:\n**\n\nGiven a social network containing N members and a log file containing M timestamps at which times pairs of members formed friendships, design an algorithm to determine the earliest time at which all members are connected (i.e, every member is a friend of a friend of a friend...of a friend). Assume that the log file is sorted by timestamp and that **friendship is an equivalence relation.** The running time of your algorithm should be M log N or better and use extra space proportional to N.\n\n**My question\n**\n\nHow is friendship an equivalence relation?\n\n`3.if a ~ b and b ~ c then a ~ c. (Transitivity)`\nhttps://en.wikipedia.org/wiki/Equivalence_relation\n\nMy counter-example: \n`\nJohn is friends with Tim. \nTim is friends with Ross. \nJohn isn't friends with Ross. `\n\nThis violates transitivity, but is a realistic social-network situation. Am I misunderstanding `friendship` in this context? Thanks!",
        "created_utc": 1516905878,
        "upvote_ratio": ""
    },
    {
        "title": "How much is today's CS study different from this ACM paper from 1989 ?",
        "author": "rajesh8162",
        "url": "http://denninginstitute.com/pjd/PUBS/CompDisc.pdf",
        "text": "",
        "created_utc": 1516847551,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help shed some light on this puzzle?",
        "author": "Sinka",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7srrkz/can_anyone_help_shed_some_light_on_this_puzzle/",
        "text": "Hi, ran into this earlier today, been cracking my brain all day trying to solve it with some friends but we've gotten nowhere. All the info we have is that its related to CompSci/SoftwareDev, the puzzle is:\n&gt; Can you figure out what's the message? \nA Key Could bE...\n\n&gt; 91 81    68 93 70 8 34 35 53    27 75 31 0 2 8 77 86 2 50 99    77    50 86 35 4 11 57 79 46 29 2 57 75    102 46    66 53 34 63 60 70 53 17    53 91 35 30      11 60 99 28 42    99    33 46 62 46    42 84    18 50 46 35 46    63 44 49 30    91 81 4 35 46    101 69 75 35 33 14    37 53 57 13 92 81 20 62 14    67 46 81 91    29 36 53 94 46 51 8 86 2 30    19 17 46 34\n\n\nCopy-pasted exactly as we found it, figured the 'bE' might be a hint but didn't see where it leads if it is.",
        "created_utc": 1516839018,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about cache.",
        "author": "Catralitos",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sotce/questions_about_cache/",
        "text": "I just had a final and it was a disaster, gonna redo it, so I'm going through the stuff I know I got wrong or didn't fully understand. One of them was cache. \n\nFirst off, I stil don't understand all these tables about contents of cache after access and hits and misses\nhttps://personal.denison.edu/~bressoud/cs281-s10/Supplements/caching2.pdf \n(not my teacher's powerpoint but he used the same graphics) \n\nEspecially because I had a question on my final that went something like:\n\n\"Consider a 32KiB cache, associative in 8 ways and with 64 byte blocks in a 32-bit architecture. Considering the cache is empty, write a sequence of 5 32bit addresses (in hexadecimal) resultant of memory reading operations that correspond always to the same index (nº of block) and produce the following result on the cache: insucess, sucess, insucess, sucess, insucess.\"\n\nI had no idea what to answer. If someone could explain it to me I'd be so glad. Sorry if anything sounds weird, English isn't my first language.\n\nThank you in advance.",
        "created_utc": 1516815748,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the Big-O of cryptocurrency? Are existing systems already at the optimal Big-O (only a constant times slower than perfect)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sohxt/whats_the_bigo_of_cryptocurrency_are_existing/",
        "text": "[deleted]",
        "created_utc": 1516813319,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding Run-time algorithms; rule of thumb from complexity to run time.",
        "author": "Geekronimous",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sna38/understanding_runtime_algorithms_rule_of_thumb/",
        "text": "Hello people. Maybe this is a really dumb question but it has been bugging me for a while.\n\nLet's say I have GCD algorithm implemented, according to wikipedia it has a run time of O(n^2); with n the number of digits. How could I know how long it would take on a computer as a function of its processor and memory. \n\nFor example; say I have a 'normal' computer 2.8 GHz i5 with 8 GB of RAM (I barely know what that means) and I want to know how long do I have to wait for GCD(x,y) where x and y are numbers 100 digits long, 200 digits long and 1000 digits long? \n\nI assume at some point RAM will not be enough; what would happen then?  [I know this might sound super dumb to ask, so patient please, me slow].",
        "created_utc": 1516802723,
        "upvote_ratio": ""
    },
    {
        "title": "Single vs MultiProcessor vd clustered System",
        "author": "TheSmilingLad",
        "url": "https://m.youtube.com/watch?v=lcFUq4DzDLg",
        "text": "",
        "created_utc": 1516763036,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any known examples of input overlap in modern hashing functions?",
        "author": "tiersin",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sjko9/are_there_any_known_examples_of_input_overlap_in/",
        "text": "For example, are there any two know inputs for something like SHA256 that gave the same output? I would figure this could only be discovered through random trial and error. ",
        "created_utc": 1516757421,
        "upvote_ratio": ""
    },
    {
        "title": "byte addressing",
        "author": "al_pal_in_space",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sjb4z/byte_addressing/",
        "text": "Suppose we have an architecture where:\n\naddresses are 8 bits every byte has its own address\n\nSuppose we have an array of 4-byte integers\n\nint[] X;\n\nThe first element X[0] starts at address 0x20. What is the starting address of X[4]?\n\nThis is confusing the hell out of me and I have no idea how byte-addressing works. Please help!",
        "created_utc": 1516754927,
        "upvote_ratio": ""
    },
    {
        "title": "Question about universal hashing",
        "author": "theKGS",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sernp/question_about_universal_hashing/",
        "text": "I understand why universal hashing is good. It prevents an adversary from being able to preduct the behavior the hash function in order to clog up a single bucket, causing the performance to degrade to that of a linked list.\n\nWhat I don't understand is how a hash table is useful with a random hash function since you can't guarantee that you get the same every time.\n\nExample: Suppose I have hash functions A and B and an object x where A(x) = 1 and B(x) = 2.\n\nThis means that depending on chance I get a random hash function. Hence if I put an object in using A, then I cannot retrieve it with B.",
        "created_utc": 1516718081,
        "upvote_ratio": ""
    },
    {
        "title": "Operating System Tutorials for Beginners",
        "author": "TheSmilingLad",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7sb2ha/operating_system_tutorials_for_beginners/",
        "text": "Operating System Tutorials: https://www.youtube.com/playlist?list=PLW2ssKJ5EDP9kp4yvCSBORrOTiR2enkn7",
        "created_utc": 1516673256,
        "upvote_ratio": ""
    },
    {
        "title": "Does an LCD screen refresh pixel-by-pixel like a CRT screen?",
        "author": "Bastilli",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7s9xkk/does_an_lcd_screen_refresh_pixelbypixel_like_a/",
        "text": "CRT screens go from top to bottom row by row and each row they go from left to right, since the ray can only light a single spot at a time.\n\nI know LCDs go from top to bottom, but does the whole row refresh at the same time? Or does each individual pixel get refreshed from the left to right?\n\nBonus question: How much before the next frame does the last row of an LCD get refreshed? If I have a 60 Hz LCD (16.666... ms), is the last row refreshed at around 5, 10 or 16 milliseconds?",
        "created_utc": 1516662764,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best way to use a NAS ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7s9um7/whats_the_best_way_to_use_a_nas/",
        "text": "[deleted]",
        "created_utc": 1516662077,
        "upvote_ratio": ""
    },
    {
        "title": "what grammar can generate this language?",
        "author": "goodthings3",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7s9ivz/what_grammar_can_generate_this_language/",
        "text": "I have to find a grammar that can generate this language\nbut i'm not sure on  how to do it\nL = {a^n b^m c^k\n| m &gt; 1, n + k &gt; m + 2}",
        "created_utc": 1516659376,
        "upvote_ratio": ""
    },
    {
        "title": "linux aircrack-ng -j option is not working",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7s3u8z/linux_aircrackng_j_option_is_not_working/",
        "text": "[deleted]",
        "created_utc": 1516601332,
        "upvote_ratio": ""
    },
    {
        "title": "What models of computing could describe the whole Internet instead of just the computing of an individual computer, cloud account, or owner of one of the clouds?",
        "author": "BenRayfield",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rzpkp/what_models_of_computing_could_describe_the_whole/",
        "text": "An incomplete model I'm hoping to use some variation of is... Every computer (source of compute cycles and memory), at each time, has an immutable state. Each state includes 2 functions: one that looks at any possible input and scores it, and the other which takes the previous state and the highest known scoring possible input and returns the next state.\n\nAn input could score higher because the score func is only looking for things, with times, signed by a certain publickey (defining score as max time of anything signed by that key so always take the most recent), testcases, or any turingComplete interpretation of the possible input, especially those specificly optimized for.\n\nSuch functions would have to count compute cycles and memory used of possible inputs since they're untrusted at least until they score high.\n\nIf somehow a network could organize to get immutable objects to wherever they might score high in those looking for things like that, then the Internet could be viewed as the interactions of goal directed systems. In the simplest case, their goal would be to send bitstrings and times to eachother signed by the https keys.\n\nWhat other models could possibly describe the whole Internet?",
        "created_utc": 1516561740,
        "upvote_ratio": ""
    },
    {
        "title": "Please help. Which pathfinding algorithm is this?",
        "author": "danialm99",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rz3hi/please_help_which_pathfinding_algorithm_is_this/",
        "text": "/** returns shortest path from startRow to startCol 0 up, 1 right, 2 down, 3 left*/\npublic final Path findShortestPath\n(int startRow, int startCol, int goalRow, int goalCol) {\n    clear();\n    Position initial = new Position(startRow, startCol);\n    Position goal = new Position(goalRow, goalCol);\n\n    BinaryHeap list = new BinaryHeap(200, new Path(goal), goal);\n    list.add(new Path(initial));\n    Position [] successors = new Position[4];\n    int trie = 0;\n    for ( ; ! list.isEmpty() &amp;&amp; trie &lt; 20000  ; trie++) {\n        Path first = (Path) list.remove();\n        Position firstPos = first.head();\n        int r = firstPos.row; int c = firstPos.col;\n        if (r == goalRow &amp;&amp; c == goalCol) {\n            return first;\n        } else {\n            int successorsCount = 0;\n            Position secondPos = new Position(r-1,c);            \n            if (secondPos.bp(board) != null &amp;&amp; noFenceMoveChecker.validMove(firstPos.bp(board), secondPos.bp(board))) {\n                successors[successorsCount++]\n                = secondPos;\n            }\n            secondPos = new Position(r+1,c);\n            if (secondPos.bp(board) != null &amp;&amp; noFenceMoveChecker.validMove(firstPos.bp(board), secondPos.bp(board))) {\n                successors[successorsCount++]\n                = secondPos;\n            }\n            secondPos = new Position(r,c-1);\n            if (secondPos.bp(board) != null &amp;&amp; noFenceMoveChecker.validMove(firstPos.bp(board), secondPos.bp(board))) {\n                successors[successorsCount++]\n                = secondPos;\n            }\n            secondPos = new Position(r,c+1);\n            if (secondPos.bp(board) != null &amp;&amp; noFenceMoveChecker.validMove(firstPos.bp(board), secondPos.bp(board))) {\n                successors[successorsCount++]\n                = secondPos;\n// Is it Dijstaks algorithm or A*? or something else? // This accesses another class for the priority queue called binary heap //I would be extremely grateful if you could help me to understand what type of algorithm this is. It's needed for a board game, if that helps",
        "created_utc": 1516556461,
        "upvote_ratio": ""
    },
    {
        "title": "How much slower does 2^n run if you double n?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rwis8/how_much_slower_does_2n_run_if_you_double_n/",
        "text": "[deleted]",
        "created_utc": 1516521278,
        "upvote_ratio": ""
    },
    {
        "title": "What's the difference between Graceful Degradation and Fault Tolerance?",
        "author": "TheSmilingLad",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rw4a1/whats_the_difference_between_graceful_degradation/",
        "text": "Please explain in detail with examples if possible!",
        "created_utc": 1516515048,
        "upvote_ratio": ""
    },
    {
        "title": "Amazon.com: Mummys Miracle Baby Wash and Shampoo 8 ounces.: Health &amp;amp; Personal Care",
        "author": "marybethuurumle",
        "url": "https://www.amazon.com/Mummys-Miracle-Baby-Shampoo-ounces/dp/B016X6ZR16",
        "text": "",
        "created_utc": 1516507265,
        "upvote_ratio": ""
    },
    {
        "title": "Great answer for \"why Linux?\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rv2w7/great_answer_for_why_linux/",
        "text": "[deleted]",
        "created_utc": 1516502243,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about a possible Senior Project for Computer Science",
        "author": "duckquackattack",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rt8fe/questions_about_a_possible_senior_project_for/",
        "text": "Hello! I'm looking for help/suggestions for my Senior Project for my Computer Science Degree. I'm part of a group where we're practicing team development, but we also have until June to make a individual project. Here's my idea:\n\nI'm thinking of using phones to play the game of Assassin https://en.wikipedia.org/wiki/Assassin_(game)\n\nThe main criteria is that we do something with a language/s we've never used before and can't use any pre-made graphic engines like Unreal or Unity, but that shouldn't be a problem. \n\nMy main question is, how feasible is this? Should I do Swift and do native iOS or learn QT and do cross-platform? Basically, I want to somehow have the assassin get their target by either using the camera or just being in range of a person and pressing a button to comfirm their kill, etc. \n\nThanks for any help!",
        "created_utc": 1516483447,
        "upvote_ratio": ""
    },
    {
        "title": "algorithm for sorting in O(sqrt(n)*n) (by partitioning data into k=sqr(n) parts with k elements)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rrm9x/algorithm_for_sorting_in_osqrtnn_by_partitioning/",
        "text": "[deleted]",
        "created_utc": 1516468397,
        "upvote_ratio": ""
    },
    {
        "title": "Why OCR algorithms struggle with memes?",
        "author": "b1zguy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rq9dx/why_ocr_algorithms_struggle_with_memes/",
        "text": "I'm referring to the traditional memes that often utilise the Impact font (ie. top &amp; bottom text overlaying image, [eg](http://m.memegen.com/gff5z6.jpg)). When playing around with softwares that have OCR built-in, I find it cannot read such text. However, no system have trouble with the more modern memes ([eg](https://i.pinimg.com/736x/9a/20/42/9a204219da09e9efe77d9494030a99f9--so-true-pictures.jpg)).\n\nI thought this may have something to do with text overlaying an image (ie. complex colours), yet the text is clearly defined from the background and the Impact font is clean. \n\nI'm concerned OCR systems may struggle with other seemingly simple images (receipts, web clipping, ads, etc) if it can't even extract text from memes.",
        "created_utc": 1516453360,
        "upvote_ratio": ""
    },
    {
        "title": "Can a PNG image be converted to binary code?",
        "author": "meme_guy1",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rpbu8/can_a_png_image_be_converted_to_binary_code/",
        "text": "Is there software that does this? Can the raw binary code be converted back into a .PNG?",
        "created_utc": 1516438181,
        "upvote_ratio": ""
    },
    {
        "title": "Help please! CS student",
        "author": "PFDRmark",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rnuar/help_please_cs_student/",
        "text": "What does it mean to draw a diagram of the variables and memory regions (along with their values) of a python program. ",
        "created_utc": 1516418320,
        "upvote_ratio": ""
    },
    {
        "title": "Storage classes in c",
        "author": "TheSmilingLad",
        "url": "https://youtu.be/jv_HL5mOviw",
        "text": "",
        "created_utc": 1516414540,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: If compilers are themselves written in a high level language, what compiles the compiler code?",
        "author": "M_JPB",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rmqve/eli5_if_compilers_are_themselves_written_in_a/",
        "text": "Hopefully not a silly question. LLVM is written in C++ for instance. But surely this just defers the problem of turning a high level language into a low level language.\n\nAdditional question: When performing optimisations such as constant folding, does the compiler generate and execute low level target code itself or are computations on the intermediate representation (IR) handled somewhere else?",
        "created_utc": 1516406991,
        "upvote_ratio": ""
    },
    {
        "title": "rotating an image in racket",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rmnqe/rotating_an_image_in_racket/",
        "text": "[deleted]",
        "created_utc": 1516406113,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone know an IP Sniffer (comparable to Cain and Abel) that is compatible with iOS?",
        "author": "conistideology",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rme6k/anyone_know_an_ip_sniffer_comparable_to_cain_and/",
        "text": "",
        "created_utc": 1516403565,
        "upvote_ratio": ""
    },
    {
        "title": "an appropriate data-structure to represent a family of sets (Which supports exactly MAKE-SET(x), UNION(S1,S2), REPORT(S) and nothing more)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rlt8o/an_appropriate_datastructure_to_represent_a/",
        "text": "[deleted]",
        "created_utc": 1516398462,
        "upvote_ratio": ""
    },
    {
        "title": "Using an new IDE like Atom",
        "author": "imperchaos",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rllcl/using_an_new_ide_like_atom/",
        "text": "Hey everyone!\n\nI'm just starting my second semester of computer science. Last semester I wrote C++ code using a VM and Code::Blocks. My friend suggested I start using a more versatile IDE like Atom, so I scrapped my VM and installed Atom on my Windows 10 laptop.\n\nNow I realize that Code::Blocks had a lot of things built in that I took for granted. Can anyone help me or direct me to a tutorial for getting packages for Atom?\n\nThe two things I'd really like are a syntax error checker and gpp compiler if possible. I'm still a new programmer and make a lot of mistakes, and having to compile and run through powershell to find mistakes one at a time is something I'd like to avoid.\n\nThanks for any help in advance!",
        "created_utc": 1516396620,
        "upvote_ratio": ""
    },
    {
        "title": "So I’m trying to creat a high priority qos for my Xbox through the modem advanced setup page cause the WiFi drops horrible when someone is on it and I know nothing about this, what do I enter in the source/destination netmask and source/destination port range",
        "author": "Mizzoumax11",
        "url": "https://i.redd.it/jcuqjisaa3b01.jpg",
        "text": "",
        "created_utc": 1516395994,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Chinese room argument an argument from ignorance?",
        "author": "MajorCriticism",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rjjj3/is_the_chinese_room_argument_an_argument_from/",
        "text": "I've been thinking about this argument for awhile now and it seems to me that its an argument from ignorance:\n\n1. We don't know exactly what causes consciousness. \n\n2. Consciousness may require the ability to act independently of others.\n\n3. People require bootstrapping (TL;DR language is required for humans to be 'smart': Though I can't cite the source: My psych class had an example in one of the books years ago of a child that was only fed and left entirely alone (the parents were arrested for abuse) it wound up dying despite there being no known physical cause, seemingly to have died of loneliness. It requires attention and love. Either way: Humans who don't learn a language may very well not be sentient. Deaf children before the development of modern practices around teaching deaf people sign language were always mentally retarded. Hints the phrase \"Deaf and dumb.\"(I don't know the exact etymology of that phrase, but I've heard it parroted that its because of that.))\n\n4. If we had an exact layout of my brain, and how it worked 100% and that were in a computer it wouldn't be 'me.' It would be a representation of me, a flawless one, but feasibly both myself, and the computer could exist, and interact. And in the same sense this could be the case with a computer that seems to be self-aware, and the Chinese room. Does that mean my consciousness wouldn't exist as 'true' sentience? What if it were just a person acting on a written version of the program emulating me?\n\nBasically there are way to many unknowns, possibly due to vague definitions, and the argument seems to be relying on that. If someone can refute this I think I can resend my current view (That computers could be created that are intelligent.)",
        "created_utc": 1516379857,
        "upvote_ratio": ""
    },
    {
        "title": "SCOPE, VISIBILITY and LIFETIME",
        "author": "TheSmilingLad",
        "url": "https://youtu.be/GQn46bSZE1g",
        "text": "",
        "created_utc": 1516379240,
        "upvote_ratio": ""
    },
    {
        "title": "Are there suboptimal pathfinding algorithms faster than A*?",
        "author": "smthamazing",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7riup2/are_there_suboptimal_pathfinding_algorithms/",
        "text": "I've been looking for one to use in a video game I'm making, but I am also interested in some computer-theoretic perspective.\n\nAs I understand, A* is the fastest algorithm in general that finds an optimal path between two points on a graph.\n\nBut if we get rid of the optimality requirement, is there an equally general algorithm that gives a suboptimal path on any arbitrary graph, but has lower algorithmic complexity than A*?",
        "created_utc": 1516374064,
        "upvote_ratio": ""
    },
    {
        "title": "Whats the cost (exponential, subexponential, etc) of reversing n compute steps to find any set of inputs which have a certain return value?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7ri3y6/whats_the_cost_exponential_subexponential_etc_of/",
        "text": "[deleted]",
        "created_utc": 1516366404,
        "upvote_ratio": ""
    },
    {
        "title": "Can you examine perform a lookup on your local DNS server without being a network/system administrator?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rgr4m/can_you_examine_perform_a_lookup_on_your_local/",
        "text": "[deleted]",
        "created_utc": 1516347180,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure what computer to get for computer science course",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rfrr7/not_sure_what_computer_to_get_for_computer/",
        "text": "[deleted]",
        "created_utc": 1516335286,
        "upvote_ratio": ""
    },
    {
        "title": "Designing PDA to reject a^n b^n c^n",
        "author": "Maide28",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7reu41/designing_pda_to_reject_an_bn_cn/",
        "text": "I am trying to design a pushdown automata that accepts this language:  \n  \nL(M) = a^* b^* c^* - {a^n b^n c^n | n &gt;= 1}   \n  \ne.g. accept aab, abbc, aaabbbccc but reject abc, abbac, aabbcc\n  \nI realize that you cannot design a pushdown automata for a^n b^n c^n and this requires a Turing Machine.  I have started with the 3-state PDA for a^n b^n and have modified it to accept the strings aab, abbc and aaabbbcccc, but it accepts abc which is incorrect.  I'm struggling to understand how to design a PDA which rejects a^n b^n c^n without having some memory of a, b and c.",
        "created_utc": 1516325872,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis of this for loop",
        "author": "eddie_g2020",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7req3a/analysis_of_this_for_loop/",
        "text": "      int j, k, t;\n      for(i=1; i&lt;=N; i=i*2)\n        for(k=1; k&lt;=2*i; k=k+1)\n          for(t=0; t&lt;7; t=t+1)\n            printf(\"A\");\nI've tried looking for resources online about problems like this but haven't seen many examples. This was also the only example my teacher posted. Any help with online resources and this specific problem would be helpful!! ",
        "created_utc": 1516324808,
        "upvote_ratio": ""
    },
    {
        "title": "Expected outcome of program",
        "author": "kerne1_pan1c",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7re94m/expected_outcome_of_program/",
        "text": "I am working on [(c) of this problem](https://imgur.com/a/1MN9H) After finding (a) to be minimum winnings -5.99 with probability 1/(n+1) and (b) to be maximum winnings -6.00 + 0.01n with probability 148/(n+1), since after index 148, each index has a probability of not having 148 of n/(n+1).  If you find errors in either of those solutions, please let me know.\n  \nCurrently, I am stuck on (c).  I have tried the following:  \n  \nE(winnings) = (sum from i=0 to 147 of (1)(0.01) + sum from i=148 to n of (0.01)(148/(n+1))) - 6.00  \n  \nBut the second series looks to be a harmonic series that cannot be simplified so it must be incorrect.  Can anybody help me with this?",
        "created_utc": 1516320501,
        "upvote_ratio": ""
    },
    {
        "title": "Assumptions of Classification Algorithms?",
        "author": "applingu",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/7rc7ab/assumptions_of_classification_algorithms/",
        "text": "Hi everyone, \n\nRecently I have had a little talk with a computer scientist friend about using classification algorithms for educational research, and I am in need of confirmation since I am not an expert of the field. Here's what I've understood from the talk:\n\n1. Classification algorithms like SVO, Random Forest, Naive Bayes etc (the ones available in Weka, in short)... do not assume the normality of residual distribution.\n\n2. Both continuous and categorical data can be included in a prediction model and it does not violate any assumptions. \n\nI am still looking for some publications regarding my question, but I would like to ask, do you agree with my conclusions that I listed above or do you think I got it completely wrong? \n\nThanks a lot! ",
        "created_utc": 1516303569,
        "upvote_ratio": ""
    }
]