[
    {
        "title": "Learning how to create, train, and use neural networks",
        "author": "philCScareeradvice",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ajc2q/learning_how_to_create_train_and_use_neural/",
        "text": "Hey all,\n\nI am in my junior year of my CS undergrad degree and am interested in learning about neural networks. Unfortunately I don't have the space in my schedule to take my school's neural network elective, so I've decided to try and pursue neural networks as a side project\n\nMy end goal for this project is to create a neural network that can output basic(or not so basic) guitar solos given a chord progression and key. I am fairly sure I can handle the inputs(like reading .tef files) and outputs(writing to a PDF tab) but the in between is the hard part.\n\nSo I was wondering if any of you could point me to a simple neural network tutorial, ideally one that uses c++ or java. Let me know if I've left out any important information here(neural networks are a big unknown-unknown for me so I'm not sure what I even need to include to get a good answer) and thank you!",
        "created_utc": 1523119964,
        "upvote_ratio": ""
    },
    {
        "title": "Doing my first ever project and need some guidance",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ahzpj/doing_my_first_ever_project_and_need_some_guidance/",
        "text": "Hey guys I'm currently studying CS in high school right now and so far we've been doing mostly theory (OOP and the like) but haven't really done any actual coding other than quite basic HTML and java.\n\nHowever in our course we have what we call the IA where we have to design and code something to solve a problem, most people tend to do the classic \"I want to be entertained as my problem therefore I'll make a game\" but I've decided to make something that can pull data from an XML document and display a table of information, something along the lines of Name-DOB-attendance-any other information what can be edited without opening the original XML document and has some form of GUI.\n\nThe issue is that i have no idea where to start. do I just start learning XML and then I'll understand it or should I focus on something else?",
        "created_utc": 1523107256,
        "upvote_ratio": ""
    },
    {
        "title": "Top 5 Best Desktop Computers 2018 | Best Desktop Computer Review By Jump...",
        "author": "jumypyexpress",
        "url": "https://www.youtube.com/attribution_link?a=fEUbD1Y4aZA&amp;u=%2Fwatch%3Fv%3DWqIJe1qmXak%26feature%3Dshare",
        "text": "",
        "created_utc": 1523102938,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to fix starvation in SSTF disk scheduling algorithm?",
        "author": "NemosCene",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ahh5v/is_there_a_way_to_fix_starvation_in_sstf_disk/",
        "text": "I was reading about disk scheduling algorithms and I came across SSTF. It was said that SSTF has a bias for tracks which are closer to the head thus making those tracks that are further away prone to starvation. Is there a way to fix this issue, or an improvement in the SSTF algorithm to avoid starvation from happening?",
        "created_utc": 1523100616,
        "upvote_ratio": ""
    },
    {
        "title": "Have there been any recorded cases of governments controlling certification authorities?",
        "author": "OwenFarrel",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ag3ji/have_there_been_any_recorded_cases_of_governments/",
        "text": "Don't know if this is the right subreddit, but hope that you know something about it.",
        "created_utc": 1523079256,
        "upvote_ratio": ""
    },
    {
        "title": "About to graduate with a BS in Software Development, should I go masters in CS or bachelors in CS?",
        "author": "Squiggyline91",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ae0u2/about_to_graduate_with_a_bs_in_software/",
        "text": "I graduate this semester with a BS in software development, I would like to move more into computer science after, specifically somewhere within the AI domain. If I attend school for a second bachlors in CS, it will be about 30 additional credits for the second degree. I know when you go for a graduate degree often it requires pre-reqs and in this instance, lots in math which I have never taken anything further than algebra 2 in college. Would it be better to snag that second bachelors first? Or just go right to a grad program? (my GPA is high enough for a grad program)\n\nThanks",
        "created_utc": 1523056778,
        "upvote_ratio": ""
    },
    {
        "title": "18 React things you probably want to know about",
        "author": "SebastiaanEssen",
        "url": "http://blog.jexia.com/react-master-world-issue-1/",
        "text": "",
        "created_utc": 1523033957,
        "upvote_ratio": ""
    },
    {
        "title": "Im not rich or anything I scrape by ok but I want a job quickly and am very interested in joining this coding boot camp at Northwestern university of anyone has advice for me that'd be really appreciated.",
        "author": "gjesus116",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ab40c/im_not_rich_or_anything_i_scrape_by_ok_but_i_want/",
        "text": "[removed]",
        "created_utc": 1523033414,
        "upvote_ratio": ""
    },
    {
        "title": "How Do I Get Better At Algorithms?",
        "author": "quaker19",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8aawxp/how_do_i_get_better_at_algorithms/",
        "text": "Hi,\n\nI am a Junior taking a Algorithm Design and Analysis class. I don't have too much trouble following analysis and recreating proofs on my own, but I think I am below average at designing my own algorithms (especially, when related to graphs). I put in a lot of work though. Specifically, I attend all my classes, read CLRS, recreate proofs on my own, and do PSets on my own. I really want to improve, so my questions are\n\nTo all those who are skilled at solving algorithm design problems, what is your thought process?\nHow did you get good at it? Was it practice or were you always better than your peers?\nHow do you process new algorithms you learn about? Do you write out examples to gain intuition on concrete cases? Does abstract reasoning alone serve to help you understand everything about the algorithm?",
        "created_utc": 1523031981,
        "upvote_ratio": ""
    },
    {
        "title": "Crazy printing problem",
        "author": "new_world_border",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8aabj5/crazy_printing_problem/",
        "text": "We print utility bills once a week - always more than 2000, less than 2500.  We recently had a maintenance kit applied to our laser printer (IBM 1552).  I missed the first printing after that, but yesterday when we printed, I was given 5 pages to reprint because the lower 2/3 of the form (8.5x14\") printed,  but so light as to be illegible.  The five pages were 414, 828, 1241, 1655 and 2069; or every 414 pages, with the exception of 1241, which is 413 pages later than 828.\nIt must be the new fuser, but how odd.  Can anyone explain this?",
        "created_utc": 1523027739,
        "upvote_ratio": ""
    },
    {
        "title": "Advantages of recursive functions",
        "author": "pearisgreen",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8a9jqj/advantages_of_recursive_functions/",
        "text": "I would like to hear some opinions on the advantages of solving problems with recursive functions rather than with loops gotos etc. \nI am thinking that recursive functions just add a lot of overhead if the recursion is very deep, because tons of unnecessary stuff like basepointers etc gets put on the stack (in languages like c etc.). ",
        "created_utc": 1523021767,
        "upvote_ratio": ""
    },
    {
        "title": "Can https websites be partially blocked?",
        "author": "OwenFarrel",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8a6or2/can_https_websites_be_partially_blocked/",
        "text": "I was reading [this wikipedia page](https://en.wikipedia.org/wiki/Censorship_of_GitHub#China) and it is said \"a spokesperson for GitHub said: \"It does appear that we're at least being partly blocked by the Great Firewall of China\".  \".\n\nHow do you partially block a website if the location within the site is sent using https? The headers with the location are encrypted, no?\n",
        "created_utc": 1522988897,
        "upvote_ratio": ""
    },
    {
        "title": "Idk if it’s true https://www-shellypalmer-com.cdn.ampproject.org/c/s/www.shellypalmer.com/2017/04/id-pay-500000-year-cant-work/amp/",
        "author": "mraza007",
        "url": "https://i.redd.it/xgn7ozjpa7q01.jpg",
        "text": "",
        "created_utc": 1522982284,
        "upvote_ratio": ""
    },
    {
        "title": "The Exact Cover Problem / Set Cover",
        "author": "robot_melting_pot",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8a274u/the_exact_cover_problem_set_cover/",
        "text": "Hi,  \nI'm struggling to get my head around the idea of the exact cover problem, and more specifically if and how it is different to the set cover problem.   \n\nA basic definition of the exact cover problem would also be really appreciated, thanks.",
        "created_utc": 1522952844,
        "upvote_ratio": ""
    },
    {
        "title": "Why are chunked parallel uploads faster than a single sequential upload?",
        "author": "joe_mikkel",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8a1ki5/why_are_chunked_parallel_uploads_faster_than_a/",
        "text": "I'm uploading a 1GB file to a remote file storage. When the file is split into a hundred 10MB chunks, which are uploaded in parallel, the upload takes ~35 seconds. When the file is uploaded in one go, the upload takes ~60 seconds. However, by my thinking, when transferring 100 chunks at the same time, each one should have 1% of the available bandwidth. The 1 GB file should be using 100% of the available bandwidth. Either way, we end up with the same amount of data transferred over the wire in the same amount of time - and that's ignoring any overhead associated with starting/stopping 100 uploads vs just one. So why is it that the parallel chunked uploads are so much faster?",
        "created_utc": 1522948515,
        "upvote_ratio": ""
    },
    {
        "title": "What are raid0, raid1",
        "author": "saif9971",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89zr81/what_are_raid0_raid1/",
        "text": "What are raid in storage like raid 1 configuration and what are there use?",
        "created_utc": 1522935473,
        "upvote_ratio": ""
    },
    {
        "title": "When I buy a domain name, what am I actually paying for?",
        "author": "Torty3000",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89yrpo/when_i_buy_a_domain_name_what_am_i_actually/",
        "text": "It seems to me that I haven't 'bought' my domain name(s) I just rent them. It doesn't make sense to me why I should have to renew something that is supposed to be my property. \n\nIs there another service that I'm paying for in the background? And is there a way I could buy my domain name to stay mine forever and not expire?",
        "created_utc": 1522926480,
        "upvote_ratio": ""
    },
    {
        "title": "How is data on my phone/laptop safe/encrypted?",
        "author": "QuirkyAsparagus",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89y598/how_is_data_on_my_phonelaptop_safeencrypted/",
        "text": "And where does the passcode come into play?\n\nIs the entire hard drive encrypted? I didn't think it was.  Is just the user's \"home\" folder (or ~) /Users/bob/* encrypted and only visible after Bob types in his password.  If it's not encrypted is it just the kernel of the OS that makes sure a password was typed in before showing the contents of the ~/ folder? ",
        "created_utc": 1522918716,
        "upvote_ratio": ""
    },
    {
        "title": "TIL that in 2017 Russia had some kind of military Olympics with (mostly) allied countries, called International Army Games 2017. The disciplines range from Tank Biathlon, Sniper Frontier, Seaborne Assault, Masters of Artiller Fire to the totally cute named doggy event True Friend. We need this too.",
        "author": "[deleted]",
        "url": "http://armygames2017.mil.ru",
        "text": "[deleted]",
        "created_utc": 1522910399,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way of naming numbers written in binary notation that is built around a binary scale, rather than a decimal one?",
        "author": "-a-y",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89wcpg/is_there_a_way_of_naming_numbers_written_in/",
        "text": "Feel like it would be easier to talk about, for example, 11 as something other than three. The cutoffs as you add 1 to an almost full numbers place to reset that numbers place and the number places smaller than it to zero don't match up with terminology born of decimal counting, so it makes the terminology a bit non-intuitive. Has someone solved this problem?\n\nEdit: As u/adipisicing put it, I am looking for a linguistic representation, not a notational one. For example “twenty-one” is inherently base 10.",
        "created_utc": 1522898290,
        "upvote_ratio": ""
    },
    {
        "title": "If bitcoin is decentralized, then on which node is 'proof of work' administered?",
        "author": "SiddharthG5",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89v2xv/if_bitcoin_is_decentralized_then_on_which_node_is/",
        "text": "I have come to an understanding that there is a hash puzzle given to miners to solve.. As there is no central authority of bitcoin, where is this puzzle generated and verified? ",
        "created_utc": 1522887465,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any benefit to using CAPTCHA on a log in screen?",
        "author": "Adrenalchrome",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89rifq/is_there_any_benefit_to_using_captcha_on_a_log_in/",
        "text": "I get how using CAPTCHA can be helpful in some instances. But Some websites have CAPTCHA as part of their login process. I'm submitting my username and password, is there any good that comes from having to pass CAPTCHA as well?",
        "created_utc": 1522862557,
        "upvote_ratio": ""
    },
    {
        "title": "I am working on a project to help college students with their first CS class, and I need your help.",
        "author": "HotSuccess",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89r46z/i_am_working_on_a_project_to_help_college/",
        "text": "I found a study that says 650,000 students fail their first CS/programming class globally and I am researching what are some of the difficulties students may have, the things people wish they knew, etc. So I created a short 7 question survey that you guys can help me with, the only requirement is that you have gone through your first CS/programming class. [Programming Research Survey](https://victorlgomes.typeform.com/to/Iz5R4e). Thank you!",
        "created_utc": 1522860000,
        "upvote_ratio": ""
    },
    {
        "title": "As someone who has or is studying computer science at one of the top English Universities, what GCSE's and A-levels did you do and what did you get?",
        "author": "einstein242",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89qzct/as_someone_who_has_or_is_studying_computer/",
        "text": "I'm about to take my GCSE's in month and I'm planning on taking Computer Science for A-Level and some guidance would be really helpful. Thanks!",
        "created_utc": 1522859097,
        "upvote_ratio": ""
    },
    {
        "title": "Which area in CS that combines security and algorithms?",
        "author": "Jenna1_",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89ptdl/which_area_in_cs_that_combines_security_and/",
        "text": "I really enjoy algorithms and I wanted to ask if there is a sub field within CS that intersect Algo with Security/privacy somehow?\n\nCryptography is the closest thing I can think of but I would like to know more that I might be missing.",
        "created_utc": 1522851246,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone who majored in computer science, I need advice...",
        "author": "Ice_Tiny_Princess",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89lazw/anyone_who_majored_in_computer_science_i_need/",
        "text": "So I'm 18 years old and currently majoring in computer science. At first I liked it but I'm starting to realize my abilities for math aren't that great... should I even continue? Should I consider IS/IT as my back up major?",
        "created_utc": 1522807779,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Cartesian product defined for a set containing the empty string?",
        "author": "TheSickestCuntMate",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89kcge/is_the_cartesian_product_defined_for_a_set/",
        "text": "For example, I want to find `{ε} x A` where A is a plain old nonempty set and `{ε}` is the set containing the empty string.\n\nIs this a defined operation? What would it return?",
        "created_utc": 1522800983,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the Windows login take longer to identify incorrect passwords?",
        "author": "WhatisAleve",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89ji4i/why_does_the_windows_login_take_longer_to/",
        "text": "If I enter the correct password on the Windows login screen, I am notified immediately. \n\nIf I enter a correct or incorrect password on a website, I am notified immediately. \n\nIf I enter an incorrect password on the Windows login screen, it \"loads\" for a number of seconds, then notifies me. \n\n\nAlso, follow-up question:\n\nWhy does Costco gas take longer to accept my credit card than any other gas station? I swipe my card, it asks me for my zip code, then thinks about it for 10 seconds before allowing me to select fuel grade. Other gas stations approve my card immediately. ",
        "created_utc": 1522794913,
        "upvote_ratio": ""
    },
    {
        "title": "&lt;Help&gt; UML Diagram",
        "author": "tamagochicken661",
        "url": "https://i.redd.it/i8620gop1qp01.png",
        "text": "",
        "created_utc": 1522773882,
        "upvote_ratio": ""
    },
    {
        "title": "Does my stack make sense?",
        "author": "_____flamingo",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/89a0m7/does_my_stack_make_sense/",
        "text": "I'm an amateur data scientist building my first app. It's based around an NLP algorithm I wrote in Python. I've been doing research into all the tools I'll need, but comprehensive guides are surprisingly scarce.\n\nWhat I'm currently thinking is\n\n* Ionic front end (AngularJS)\n* Google App Engine Python Environment\n* Google BigQuerey\n\nDo these all fit well together? Does that cover everything, or do I need something to tie it all together?",
        "created_utc": 1522732375,
        "upvote_ratio": ""
    },
    {
        "title": "Which Class should I take for Aerospace: Computer Simulations, Computer Vision, or Machine Learning",
        "author": "scutum_guy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/896uzj/which_class_should_i_take_for_aerospace_computer/",
        "text": "I am a Mechanical Engineer getting a Minor in CS, and want to go into the aerospace industry doing Systems Engineering (different from CS systems engineering). I have only one slot left for classes next semester and was wondering which class I should take?\nThe course outlines for each:\n\nComputer Simulation:\nA first course in computer simulation. A project based course emphasizing the rigorous development of simulation applications. Topics will include random number generation, Monte Carlo simulation, discrete event simulation, and the mathematics behind their proper implementation and analysis. To a lesser extent we may discuss, time-step simulations and parallel simulations. The course uses journaling, programming projects and exams for assessment.\n\nComputer Vision:\nComputer vision is the process of using computers to acquire images, transform images, and extract symbolic descriptions from images. This course provides an introduction to this field, covering topics in image formation, feature extraction, location estimation, and object recognition. Design ability and hands-on projects will be emphasized, using popular software tools. The course will be of interest both to those who want to learn more about the subject and to those who just want to use computer imaging techniques.\n\nMachine Learning:\nThe goal of machine learning is to build computer systems that improve automatically with experience, which has been successfully applied to a variety of application areas, including, for example, gene discovery, financial forecasting, and credit card fraud detection. This introductory course will study both the theoretical properties of machine learning algorithms and their practical applications. Students will have an opportunity to experiment with machine learning techniques and apply them to a selected problem in the context of term projects. \n",
        "created_utc": 1522715924,
        "upvote_ratio": ""
    },
    {
        "title": "Robin Hood Adventures",
        "author": "8aled",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/895vkd/robin_hood_adventures/",
        "text": "Greetings,\nI have the following problem as a homework and i have been struggling understanding it, we have to use Queues (in c++) to solve it and i'm afraid i am not understanding the question so well, and i can't think of an idea to solve it, i would really appreciate getting some ideas/suggestions. Thanks in advance.\n\nThe problem:-\n\nRobin Hood steals from the rich people in order to help the poor.\nRecently, Robin has chosen a village where all the houses are placed around a circle. Robbing starts at some house placed in the circle and continues in a fixed direction. At each step, some houses are skipped and the next house is robbed. In the end, there is only one house that remains and that is not attacked. You can choose the algorithm based on which the houses are skipped or robbed.\n\nConsider yourself one of the rich people who wants to remain with all the fortune untouched.\n\nDisplay the set of actions, so that by selecting the first house to be robbed you are the last to escape.\n",
        "created_utc": 1522708051,
        "upvote_ratio": ""
    },
    {
        "title": "I’ve been meaning to implement a chat bot into my website, does anyone know of any good ones for someone who might not be a programmer?",
        "author": "Gastolino",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8949l1/ive_been_meaning_to_implement_a_chat_bot_into_my/",
        "text": "",
        "created_utc": 1522698646,
        "upvote_ratio": ""
    },
    {
        "title": "Computer scientists, reasons you're for and against bubble sort?",
        "author": "ImportantGarlic",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/890dpx/computer_scientists_reasons_youre_for_and_against/",
        "text": "I'm writing a research paper and wanted to get some others opinions on whether bubble sort should be used, and what scenarios it should't be used in!",
        "created_utc": 1522684671,
        "upvote_ratio": ""
    },
    {
        "title": "Studying CS/Software Engineering as an international student",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88zqet/studying_cssoftware_engineering_as_an/",
        "text": "[deleted]",
        "created_utc": 1522679556,
        "upvote_ratio": ""
    },
    {
        "title": "How often is an Alternate DNS server is ever used?",
        "author": "gabefair",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88ziwq/how_often_is_an_alternate_dns_server_is_ever_used/",
        "text": "When we specific a DNS server we are always asked for an alternate. Has anyone come across a study to see how often that secondary server is actually used? I imagine that 8.8.8.8 or 9.9.9.9 has never been down before.",
        "created_utc": 1522677847,
        "upvote_ratio": ""
    },
    {
        "title": "How do things like Google's search API make money when people can easily just scrape results?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88wydq/how_do_things_like_googles_search_api_make_money/",
        "text": "[deleted]",
        "created_utc": 1522645188,
        "upvote_ratio": ""
    },
    {
        "title": "Old and obscure",
        "author": "Whiskey_The_Drunk",
        "url": "https://i.redd.it/9ky5n3zloep01.jpg",
        "text": "",
        "created_utc": 1522636077,
        "upvote_ratio": ""
    },
    {
        "title": "prove NP-hard",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88vhxw/prove_nphard/",
        "text": "[deleted]",
        "created_utc": 1522630064,
        "upvote_ratio": ""
    },
    {
        "title": "expired pdf help",
        "author": "skltllghtnng",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88utbo/expired_pdf_help/",
        "text": "I have to submit my transcript before tomorrow for a scholarship that I really need. I have a pdf I got from student clearing house. I get the error message: \"This document is locked. Your permission to view it has expired. If you want to open this document, contact the person who sent it to you and ask them to extend the expiration date.\"\n\nI don't have time to order another one and if I had known the file itself (not just the download link) was going expire I would have just printed it when I originally got it. None of the steps to unlock a pdf (e.g. wikihow) have worked for me. Any help would be greatly appreciated!",
        "created_utc": 1522623775,
        "upvote_ratio": ""
    },
    {
        "title": "Are vectors faster than arrays?",
        "author": "leiget",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88tcgf/are_vectors_faster_than_arrays/",
        "text": "I ask this just out of curiosity.\n\nLet's say you need an array of three floating point numbers. Would making them a 3D vector be faster because of things like SIMD/3Dnow?",
        "created_utc": 1522611043,
        "upvote_ratio": ""
    },
    {
        "title": "After you leave a company, where is line between your code, their code, and code that was heavily inspired by your time at the company?",
        "author": "ebolanurse",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88s494/after_you_leave_a_company_where_is_line_between/",
        "text": "If you leave a job without signing an NDA, or noncompete, where is the line between the code you wrote for them, and starting a new project that was very similar?\n\nIf you wrote tools to scrape websites for a company, would you be getting into hot water if you started writing new code that scraped websites?\n\nAt first glance, it would seem egregious that the company could stop you from working on something vaguely defined as \"similiar\" but at the same time, there must be common sense protections for companies, no?",
        "created_utc": 1522601102,
        "upvote_ratio": ""
    },
    {
        "title": "Help finding a computer for my mom",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88rz7u/help_finding_a_computer_for_my_mom/",
        "text": "[deleted]",
        "created_utc": 1522599961,
        "upvote_ratio": ""
    },
    {
        "title": "What sensors are used to detect speed of a vehicle ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88r8o8/what_sensors_are_used_to_detect_speed_of_a_vehicle/",
        "text": "[deleted]",
        "created_utc": 1522593719,
        "upvote_ratio": ""
    },
    {
        "title": "Branded QR codes",
        "author": "Redstoner7",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88p5y6/branded_qr_codes/",
        "text": "I've been interested in branded QR codes like Snapchat's snapcodes, shazam's codes, Facebook's codes and so on, does anyone know any more places like Snapchat where it will let you make your own codes to contain urls or text like the snaochat ones or Facebook ones where it has its own design?",
        "created_utc": 1522566904,
        "upvote_ratio": ""
    },
    {
        "title": "Branded QR codes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88om24/branded_qr_codes/",
        "text": "[deleted]",
        "created_utc": 1522559840,
        "upvote_ratio": ""
    },
    {
        "title": "Brand we codes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88ok25/brand_we_codes/",
        "text": "[deleted]",
        "created_utc": 1522559214,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an easy-to-use virtual machine that I can target with a toy compiler?",
        "author": "bkushigian",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88narv/is_there_an_easytouse_virtual_machine_that_i_can/",
        "text": "I would like to have a simple VM with good docs built with an eye towards clarity/pedagogy versus efficiency to tinker around with (preferably with code available). I'm not sure what's around, but if possible it would be nice to have some debugging features as well.",
        "created_utc": 1522545698,
        "upvote_ratio": ""
    },
    {
        "title": "How many calculations can a computer perform in one clock cycle?",
        "author": "Schinkey",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88l617/how_many_calculations_can_a_computer_perform_in/",
        "text": "",
        "created_utc": 1522525787,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to use GSON to parse JSON. Installed Maven, but Intellij can not recognize symbols in build.gradle file?2",
        "author": "jawadb0199",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88d25w/trying_to_use_gson_to_parse_json_installed_maven/",
        "text": "I installed maven using this video (https://www.youtube.com/watch?v=EoXImdzlAls&amp;ab=&amp;ab_channel=AutomationStepbyStep-RaghavPal) and made a build.gradle file in intellij, but it can't recongnize any symbols. Should I be changing some settings in intellij?\n\nAlso is it easier to do this using a .jar file? I'm not sure how to do it like this. Thanks",
        "created_utc": 1522438464,
        "upvote_ratio": ""
    },
    {
        "title": "The shift of websites becoming self contained software that can even run without an internet connection by being served from cache in the browser after an initial visit/download",
        "author": "kamronkennedy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88cl53/the_shift_of_websites_becoming_self_contained/",
        "text": "[xpost](https://www.reddit.com/r/compsci/comments/88cics/the_shift_of_websites_becoming_self_contained/) Seems here may be a better posting ground than /r/compsci....\n\n---------------\n\nIsn't there a term/name for this type of approach to web app development?\n\nA couple projects ago, I was speaking with some recent grad's who had mentioned these types of web apps becoming more of a thing in academia (edit: and elsewhere I'm sure, sadly I find my head buried in the sand more often then I'd like admittedly....). I personally have no degree, so now with more time on my hands I'm trying to dig in more but google is no help so far.",
        "created_utc": 1522434672,
        "upvote_ratio": ""
    },
    {
        "title": "Stable and unstable sorting algorithms",
        "author": "idontknow005",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88b4k4/stable_and_unstable_sorting_algorithms/",
        "text": "What is the difference between stable and unstable sorting algorithms?",
        "created_utc": 1522423381,
        "upvote_ratio": ""
    },
    {
        "title": "On android studio how to disable old activity if statement that it doesn't work when I'm on another activity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/88athr/on_android_studio_how_to_disable_old_activity_if/",
        "text": "[deleted]",
        "created_utc": 1522420817,
        "upvote_ratio": ""
    },
    {
        "title": "JAVA help",
        "author": "Helpfulman_com",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8871jl/java_help/",
        "text": "how do you update the loop control variable based on a user's input?\nExample would be appreciated..if not it's cool.",
        "created_utc": 1522376251,
        "upvote_ratio": ""
    },
    {
        "title": "I completely failed an algorithms exam yesterday. The test has been given back. Could you please offer solutions to these algorithms?",
        "author": "wtfsmyravioli",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/886riu/i_completely_failed_an_algorithms_exam_yesterday/",
        "text": "I have never done so poorly on an exam before.  I'm realizing that I need serious help in order to improve.  My problem is that I am pretty new to programming and I have trouble writing algorithms on the fly.  Not only that, but the questions on this exam were unlike any of my homework problems.  These are not homework questions.  The following questions are from an exam which have already been returned to the students.  If you could lend me a hand, I would greatly appreciate it.  I don't expect an answer for each question, but if you see one that you are sure of, please explain a solution.  I'm devastated by how bad I did on this exam.  I really just want to understand these concepts better.  Here are some of the exam questions:\n\n*Given an array A[1..n], give an O(n) time algorithm to output a number that IS NOT an element of A.\n\n*Give an O(nlogn) algorithm to find the mode of an array with n elements (the mode is the most frequently occurring element).\n\n* a) Let G be a TREE given in adjacency matrix form.  Describe how to count the number of leaves in the tree.  ANALYZE THE RUNNING TIME of your algorithm.\n   b) Explain whether (and if so, how) we could solve this problem if we use an adjacency list for G.\n\nBonus: give an O(1) time algorithm to find a vertex in graph G such that the deletion of that vertex would result in G still being connected.  [A connected graph is one in which there is a path between each pair of vertices].\n\n*You are given an array A of n-1 distinct integers, each between 1 and n (so all the numbers are different).  In O(n) time, find the integer between 1 and n that is not in the array.  Bonus points if your algorithm uses O(1) additional space besides A.",
        "created_utc": 1522373561,
        "upvote_ratio": ""
    },
    {
        "title": "UPenn or Georgia Tech for a Computer Science undergraduate degree?",
        "author": "dna1403",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8860is/upenn_or_georgia_tech_for_a_computer_science/",
        "text": "I would love to go to both schools, but I have to make a decision and would like further input. How do these two universities compare in terms of education, name, employment, startups, and research (especially in AI and/or Computational Biology). ",
        "created_utc": 1522366689,
        "upvote_ratio": ""
    },
    {
        "title": "Freshman interested in Computer Vision path for my passion, what do your daily jobs consist of? What specific major, coursework, and REU should I push towards? I'd like to work in an industry/research lab in the future.",
        "author": "ThinDeep",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/885ng3/freshman_interested_in_computer_vision_path_for/",
        "text": "Finally made an account, long time lurker.\n\nI am a freshman (20) completing general education classes at community college (taking Chemistry and C++ this summer). I have not settled on where to transfer as I am still researching professors/faculty, universities, and miscellaneous details of this path. I know the top tech schools are out of reach so hopefully graduate school and a Ph.D could get me there to contribute. Therefore, I have some questions I did not find an answer for.\n\nSome background:\n\nMy interests come from computer vision, graphics programming, and embedded devices. I enjoy facial/object detection [YOLO9000](https://arxiv.org/abs/1612.08242), real-time operating systems/graphics/detection, machine learning for neural nets (CNNs) and digital image processing. I cannot stop thinking and looking up these concepts. Companies like Magic Leap with AR seems like something I'd like to do or the Face2Face research project. The new demo shrinking and enlarging objects fascinated me.\n\nQuestions:\n\nWith these, I am unsure if I should do a double major in CS/Math or Applied Math?\n\nI'd like to contribute to research and possibly industry labs as I have had internships in the industry/college and did not enjoy it. It made me realize I'd like to do research on the exit interviews. I believe I'd like to go deeper and specialize in real-time detection or image/facial/object recognition. I now know I have to look for REUs, what can I do for contacting professors/companies? Read papers and conduct my own project this summer or contribute to open source? (I was thinking of picking up open source anyway for experience to be taken seriously) It would seem like a reach for a community college student to go for but I'd like to if feasible.\n\nI am low-income but I would be interested in attending/volunteering CVPR. It would seem like a great experience and something to add to professors and college admissions. I even thought about starting an online club or something to keep talking about it since I cannot find a single person interested here.\n\nMy school does not have enough people interested in Linear Algebra to offer it, so I'd have to take it at a four-year. I am going to take trigonometry, calc I-III, diffeq, and physics...rigorous courses needed for transferring and the foundation.\n\nI am unsure what else to do besides studying hard, reading papers, asking to be an RA, and continuing side/research projects. I'm reaching out to one of my professors to hopefully start a project or with a nearby university (we are big on robotics in this area apparently)\n\nI hope this is a good place to ask this since I see this as my CS career more so than getting a degree and just getting a job (nothing wrong with that, I respect those who can because I can't). I'd like to focus on topic to be an expert and push it forward. I am sure this is something I want to do so I'd like to at least have some plan for school/experience.\n\nIf it helps, I've been working with openCV. Next up is tensorflow, Ng's courses, and setting up some ML since I do not have a lot of processing power (T460 Fedora distro, raspberry pi, and an old Windows 7 computer...which I may use for an image file server) to fill my free time. I was even thinking of doing basic graphics with Blender.\n\nAdvice and criticisms appreciated, thanks for reading! Trying to get a head start on this grind.",
        "created_utc": 1522363471,
        "upvote_ratio": ""
    },
    {
        "title": "Need Advice - I don't know in which direction I should head",
        "author": "CAP-3",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/884euv/need_advice_i_dont_know_in_which_direction_i/",
        "text": "Hi To start off, I'm currently studying compsci at an OK university in europe. In high school I was really disoriented and newer knew what I should do. After some hickups I eventually found my way into the university I am in right now.\n\nFirst off, I really like my courses right now, with the only problem that I find them to easy. I spend literally no time learning or revising, and it takes me no more than 3 hours per week for all the homeworks. I'm also one of the top people in the class...\n\nI dont want to brag in any way, and I really don't like that I'm one of the best without studying much. I personally find that most of my classmates seem unmotivated. (I get along really well most of them outside of university)\n\nMy Question is: should I switch to another, probably more demanding university? Or should I finish my bachelor (2 more years to go) at this university with really nice grades an then go for a masters somewhere else? In the moment I realy feel that I am wasting my potential as I have a lot of time, and while I do work on school and personal projects, I still have to much time to spare.\n\nThank you for reading, and I hope I explained my situation in a way that I do not seem like an arrogant asshole. I really just want some people, maybe in similar situations, giving me advice.",
        "created_utc": 1522353549,
        "upvote_ratio": ""
    },
    {
        "title": "What's the simplest way a computer program can compute Pi?",
        "author": "MulticulturalHound",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/884bbd/whats_the_simplest_way_a_computer_program_can/",
        "text": "Hey Guys,\n\nI'm trying to explain to my 11 year old brother how a computer can compute Pi. I'd rather not explain infinite series to him, so I was wondering if there are any simpler/more intuitive algorithms computers use to approximate Pi? Thanks. ",
        "created_utc": 1522352816,
        "upvote_ratio": ""
    },
    {
        "title": "Help with Unity Install",
        "author": "Dunkaroo-Senpai",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/883dd6/help_with_unity_install/",
        "text": "I've installed Unity 2017.4.0f1 (64-bit) for my Windows PC.\nI run it and a windowed grey screen appears.  I've followed the instructions on how to fix this according to these instructions:\nhttps://forum.unity.com/threads/unity3d-5-3-not-working.372682/#post-2415582\n\nThe node_modules file I create is removed after I run Unity (and still get the grey screen).\n\nAccording to the npm-debug file found in the AppData package:\n\n1440 error Error: EPERM: operation not permitted, rename 'C:\\Users\\akash\\AppData\\Roaming\\Unity\\Packages\\node_modules\\.staging\\unity-editor-home-cd8e0a6e' -&gt; 'C:\\Users\\akash\\AppData\\Roaming\\Unity\\Packages\\node_modules\\unity-editor-home'\n1440 error     at Error (native) parent: 'unity-editor' }\n1441 error Please try running this command again as root/Administrator.\n\nApparently it doesn't have permission, but I try running it as Admin and/or in compatibility mode and it makes no difference.",
        "created_utc": 1522345947,
        "upvote_ratio": ""
    },
    {
        "title": "How much network packet processing is done on CPU?",
        "author": "terrrp",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/880wmv/how_much_network_packet_processing_is_done_on_cpu/",
        "text": "When I get, say a TCP packet, how much processing of the headers, encoding, etc. is done in HW vs kernel vs userland?\n\nDoes a NIC just hand an entire buffer representing identically start-to-end of the sent packet, or does it do any decryption, or lay out the data in a struct, etc? ",
        "created_utc": 1522327031,
        "upvote_ratio": ""
    },
    {
        "title": "Could you use a state of the art supercomputer for video Games?",
        "author": "mechakingghidorah",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87xqds/could_you_use_a_state_of_the_art_supercomputer/",
        "text": "If some billionaire bought a zetaflops supercomputer and wanted to create a custom modded Elder Scrolls game just for himself,would it be possible?\n\nSay he wanted to make Tamriel at a real scale with 12,000,000 square kilometers and thousands of buildings and NPCs,could it be done, if weather was reduced to three or four patterns and you had the seasons, could it be done?",
        "created_utc": 1522290037,
        "upvote_ratio": ""
    },
    {
        "title": "ELI 5: Proof of Rice's Theorem for Computation",
        "author": "zed925",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87w398/eli_5_proof_of_rices_theorem_for_computation/",
        "text": "Hi, can anyone simplify the proof of rice's theorem?\nSo from my notes you can do a map reduction to the halting problem but I don't fully understand what this means and how to do it",
        "created_utc": 1522275301,
        "upvote_ratio": ""
    },
    {
        "title": "How do RPG game devs figure out prices, damage, HP, etc. ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87vvlp/how_do_rpg_game_devs_figure_out_prices_damage_hp/",
        "text": "[deleted]",
        "created_utc": 1522273596,
        "upvote_ratio": ""
    },
    {
        "title": "CS Major Minors/Double Major Dilemma",
        "author": "GlassSession",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87vk5f/cs_major_minorsdouble_major_dilemma/",
        "text": "Hello!\n\nI am currently a CS major and I was thinking about any potential minors/second major I could add on. The things that interested me were stats, econ and math.\n\nSo this is what I could possibly do: Major in CS and double minor in two of stats, econ and math. Or I could double major in CS and econ. Unfortunately, it won't be possible to double major in either CS and math or CS and stats.\n\nSo I just wanted to know what you guys would recommend? I've heard that stats would be particularly useful for many areas like data science and machine learning/AI. I've heard econ is useful for things like the financial aspects or for participating in an MBA in the future. I guess math would have similar advantages to Stats.\n\nI was leaning towards a double minor in Stats and Econ because I felt that a double minor in Stats and Math would be a bit redundant. But then again, econ will cover stuff like econometrics which is quite similar to stats. So I'm not entirely sure.\n\nSo I just wanted to know what you guys felt? Which combination will be the best for career prospects and general real life applicability?\n\nThank you!",
        "created_utc": 1522271046,
        "upvote_ratio": ""
    },
    {
        "title": "What can I google to find out more information on this question about the number of bits on each line of a circuit?",
        "author": "avgsuperhero",
        "url": "https://i.redd.it/sfgihvvljko01.jpg",
        "text": "",
        "created_utc": 1522271008,
        "upvote_ratio": ""
    },
    {
        "title": "Prove NP completeness",
        "author": "Houble00",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87vboc/prove_np_completeness/",
        "text": "I am working on this problem:  \n  \nThere are k baskets which each carry a weight of up to 1kg.  There's also a set of k items S = {s1, s2, ..., sk} where si is the weight of the ith item.  For all i, 0 &lt; si &lt;= 1.  We need to place items in the baskets to use the fewest baskets possible without going over any weight capacities.  \nBasket Prob = {&lt;S,k&gt; | S can be completely loaded using k or less baskets.  \nProve that the Basket Problem is NP complete.\n\nCould anybody check if my work is correct?  \nFor the verifier just reject if it doesn't use all items, a basket is overweight or the certificate uses more than k baskets.\nFor the reduction I used partition so assume a solver for Basket Problem and just give partition's S and k=2 into it.  If it accepts  accept.  If it rejects reject.",
        "created_utc": 1522269288,
        "upvote_ratio": ""
    },
    {
        "title": "I Would Love Your Feedback",
        "author": "InsaneRaspberry",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87ukmk/i_would_love_your_feedback/",
        "text": "Hi all!\n\nI recently developed a K-nearest neighbors algorithm that outperforms the Scikit-Learn K-NN algorithms in terms of both classification speed and accuracy on the MNIST data set (repo linked below).  I am not in college yet and don't have anyone to talk to about this, and I am wondering if this small project is perhaps something I could use as a piece in my portfolio when applying for jobs/research positions?\n\nThanks!\nhttps://github.com/samgrassi01/Cosine-Similarity-Classifier",
        "created_utc": 1522263733,
        "upvote_ratio": ""
    },
    {
        "title": "In a game program, do bullets check if they hit an enemy or do enemies check if they are hit by a bullet?",
        "author": "twofirstkinds",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87qcq6/in_a_game_program_do_bullets_check_if_they_hit_an/",
        "text": "",
        "created_utc": 1522226747,
        "upvote_ratio": ""
    },
    {
        "title": "When will quantum computers be able to break RSA",
        "author": "hermlon",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87pw6z/when_will_quantum_computers_be_able_to_break_rsa/",
        "text": "I guess there will be a time where large companies have quantum computers but normal people don't. I heard quantum computers have the ability to break RSA but there is also a similar encryption method for quantum computers between each other.\n\nBut this won't be usable with normal devices so will there be a time where there is no secure asymmetric encryption for the public which can't be broken by governments and big companies? And if there are no alternatives when will this possibly happen?",
        "created_utc": 1522220602,
        "upvote_ratio": ""
    },
    {
        "title": "How good is this course on artificial intelligence?",
        "author": "mahanthathreyee",
        "url": "https://i.redd.it/v4zaawjy5go01.jpg",
        "text": "",
        "created_utc": 1522218094,
        "upvote_ratio": ""
    },
    {
        "title": "Reading in a file, but each part is separated by semi-colons",
        "author": "JerichoJely",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87ogoe/reading_in_a_file_but_each_part_is_separated_by/",
        "text": "So I have a file that I have to read in that looks like this (and due to reddit, the formatting is weird but after the first line of numbers each line starts with the person's full name and ends right before the next person's name):\n 8:0:0:0;4;9.3 \nPaula Radcliffe;123;0;0;8:1:30:0;1;3.1;8:16:15:45;2;6.2;8:32:45:59;3;9.3;8:48:15:12 \nGeoffrey Mutai;1;0;0;8:0:0:0;1;3.1;8:14:39:0;2;6.2;8:29:33:0;3;9.3;8:43:12:2 \nJane Smith;111;0;0;8:12:1:0;1;3.1;8:40:30:0;2;6.2;9:7:45:9;3;9.3;9:31:3:25 \nJohn Doe;456;0;0;8:9:12:9;1;3.1;8:33:45:0;2;6.2;8:57:59:0;3;9.3;9:21:30:30 \nSlow Moe;432;0;0;8:15:0:0;1;3.1;9:00:0:0;2;6.2;9:45:0:0;3;9.3;10:30:0:0 \nMs. Cheater;987;0;0;8:0:0:0;1;3.1;8:7:23:0;3;9.3;8:21:45:1\n Mr. Cheater;6789;0;0;8:1:0:12;1;3.1;8:3:45:0;2;6.2;8:9:32:1;3;9.3;8:15:32:15\n\nWhat that all stands for is this:\n\nhour:minute:second:millisecond;total number of sensors;total number of miles in race\n\nracer name;racer number;sensor number;sensor mile marker;sensor time[:more sensor info]\n\nI don't really have much of an idea of where to start so any suggestions would be much appreciated\n\nEDIT: I’m using C++",
        "created_utc": 1522204576,
        "upvote_ratio": ""
    },
    {
        "title": "Reading in a file, each part separated by semicolons.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87o8ck/reading_in_a_file_each_part_separated_by/",
        "text": "[deleted]",
        "created_utc": 1522202435,
        "upvote_ratio": ""
    },
    {
        "title": "Will we have household quantum computers in the future?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87nteu/will_we_have_household_quantum_computers_in_the/",
        "text": "[deleted]",
        "created_utc": 1522198607,
        "upvote_ratio": ""
    },
    {
        "title": "What is the complexity-class of isomorphism between 2 sets of 3sat constraints?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87mnuv/what_is_the_complexityclass_of_isomorphism/",
        "text": "[deleted]",
        "created_utc": 1522188642,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone here knows tetcos netsim?I have some questions.",
        "author": "vigneshvelu",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87mflw/anyone_here_knows_tetcos_netsimi_have_some/",
        "text": "I am doing my bachelor degree. I have a project based on manets. Netsim is my college official software. I have some questions.",
        "created_utc": 1522186807,
        "upvote_ratio": ""
    },
    {
        "title": "A few questions for folk familiar with the ISP business",
        "author": "sillybob86",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87l0sm/a_few_questions_for_folk_familiar_with_the_isp/",
        "text": "I am doing a project for class. I am finding some of the local businesses rather tight-lipped about info (I may be asking it wrong). Anyway, its a project for my Principles of Management class. Im of the impression that this would be a horrible business to try to start up from the ground up, but its my job :)\n\nI know the answers wil likely vary because of things like taxes and regulations however, as \"uniformly as possible\"\n\n1) If a city has 35,000 citizens, and 2,000 business, how might a ISP decide how many \"Phone support, programmers, Line installers, salesmen, managers, IT guys, etc\" to hire?\n\n2) From what I have been able to find, the cost of going into a new city seems to vary widely. I seem to remember hearing about a City(govt) that spent billions becoming fiber ready, and I seem to remember hearing google spent 100 mill to bring fiber to a city? Is there anyway to come up with a basic, \"realistic\" sounding number? 100mill &lt; 1 billion, seems too wide a dispersion there.\n\n3) my understanding is that sometimes, a new company or competitor will buy bandwidth? from an existing cable company? Example, Company \"A\" has line installed and supplies services to region 123. Company B would like to compete in region 123, so buys _____ from company A? for how much? Basic rates, industry standards, as close as we can get now... Right now im floating in the galaxy, and would at least like to find planet earth, if not my particular geographic location.\n\n4) in the same vein as question 1, and this is where my knowledge gets even fuzzier, but how many servers, routers, switches, miles of cable? Is there a basic formula like \"2 servers per every 100 people\" 5 miles of cable for every square mile, etc?\n\n(Also posted in a different forum too, in case yall see it twice)",
        "created_utc": 1522176744,
        "upvote_ratio": ""
    },
    {
        "title": "Can I get some help/ feedback?",
        "author": "__logix",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87kk51/can_i_get_some_help_feedback/",
        "text": "https://imgur.com/a/cmTcW",
        "created_utc": 1522173442,
        "upvote_ratio": ""
    },
    {
        "title": "How does kismet work, as in, what is the actual science of what it does?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87jdi8/how_does_kismet_work_as_in_what_is_the_actual/",
        "text": "[deleted]",
        "created_utc": 1522165043,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Science Student Project Allocation",
        "author": "quantitativepanda",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87i7dh/computer_science_student_project_allocation/",
        "text": "I work at a UK university, and I'm trying to rethink the way we allocate student projects. At the moment, potential supervisors put a list of possible topics online, students contact supervisors they are interested to work with, and supervisors decide on students. \n\nThe process is quite inefficient for large groups of students (200+), and results in lots of frustration for students (lots of email sent around). \n\nAny suggestion on what could be done to improve the system, or how it is done elsewhere? ",
        "created_utc": 1522155511,
        "upvote_ratio": ""
    },
    {
        "title": "Algorithm",
        "author": "idontknow005",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87gixs/algorithm/",
        "text": "What does gready  algorithm  means?",
        "created_utc": 1522135780,
        "upvote_ratio": ""
    },
    {
        "title": "Please help me find this C. West Churchman quote.",
        "author": "haoooo",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87bzqd/please_help_me_find_this_c_west_churchman_quote/",
        "text": "Okay maybe you're not my *only* hope but I need a huge favor from whoever has access to \"The Systems Approach\" by C. West Churchman. I don't have access to a library at the moment otherwise I would do it myself. Please please help me.\n\nI'm looking for this specific quote:\n\n&gt;For the scientist a model is also a way in which the human though processes can be amplified. This method often takes the form of models that can be programmed into computers. At no point, however, the scientist intend to loose control of the situation because off the computer does some of his thinking for him. The scientist controls the basic assumptions and the computer only derives some of the more complicated implications.\n\nC. West Churchman (1968). The Systems Approach. New York: Dell publishing. p.61\n\nThis was taken directly from wikiquotes and as you can see, there are several typographical and grammatical errors.\n\nIf anybody could quickly grab the book, flip to page 61 and just confirm for me what the actual quote is, I would be so happy. A photo would be nice as well.\n\nThank you in advance!",
        "created_utc": 1522093114,
        "upvote_ratio": ""
    },
    {
        "title": "looking for an online data structures class over the summer.",
        "author": "jacked_on_stacks",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/87a8e7/looking_for_an_online_data_structures_class_over/",
        "text": "so I have a local option, but it requires me to drive a bit and would be around a grand just for the one class. I really need to take data structures this summer because it's required for a lot of upper level courses at my school and because I'm double majoring, the only way for me to complete everything on time is to load up on CSC courses next fall, most of which require 307. \n\nAnybody know an accredited school that offers it over the summer online that would cost the same or less? community colleges are preferred. ",
        "created_utc": 1522080106,
        "upvote_ratio": ""
    },
    {
        "title": "Is a MacBook Air ok for a computer science undergrad?",
        "author": "cohen489",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/875ioo/is_a_macbook_air_ok_for_a_computer_science/",
        "text": "I'm a teacher in a very low-income area and am about to upgrade my computer. I'd like to gift my old-but-still-very-functional MacBook Air to a student who was accepted to a computer science program but isn't able to afford a laptop for a variety of reasons. I don't know ANYTHING about computer science/coding/classwork expectations, but I definitely have a mental idea that PCs are way better for computer science. Will he be able to complete his coursework on a 2013 MacBook Air, or would giving it to him be a waste?",
        "created_utc": 1522028796,
        "upvote_ratio": ""
    },
    {
        "title": "Remotely accessible small business server",
        "author": "dj_benito",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/873yh8/remotely_accessible_small_business_server/",
        "text": "I'll start off by saying I hope this is a good place to post this, if not please let me know and I'll go elsewhere.\n\nSo basically my question is how to set up a server to store business files that I can access from my house. \n\nA little background:\nMy family owns a bar/restaurant/casino in a small town in montana. Right now my dad has a notebook at the bar he uses for daily bookwork. For a while he was using Google drive to access files from home. He isn't a fan of the update to backup and storage and is looking to set up something that he can use to save business files to and access from home. He also wants to make it so other people, like my uncle and me, can access the files as well. \n\nHe wants me to figure out a way to put something together that we can use for this and possibly expand if necessary. We are going to be upgrading to a POS system in the near future and are hoping to be able to access it's files as well. \n\nI know my way around windows pretty well but don't have much coding knowledge. I'm looking for something that would be pretty simple to set up and use but if that's not possible, I'm not one to back down from a challenge. \n\nAny help would be greatly appreciated. ",
        "created_utc": 1522013965,
        "upvote_ratio": ""
    },
    {
        "title": "JSON and JSONiq Predicate Logic",
        "author": "codykboo",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/873qt8/json_and_jsoniq_predicate_logic/",
        "text": "Hello I am working with predicate logic queries and I need to code them in JSONiq. I am having problems with questions #2 and #3. I was hoping someone could please help. I was able to complete the first one, but I don't understand how to set a cap for an amount. I posted my answer to #1 which is working correctly.\n\n    Department (dcode, dname, chair)\n    Course (dcode, cno, title, units)\n    Prereq (dcode, cno, pcode, pno)\n    Class (class, dcode, cno, instr)\n    Faculty (ssn, name, dcode, rank)\n    Student (ssn, name, major, status)\n    Enrollment (class, ssn)\n    Transcript (ssn, dcode, cno, grade)\n1. Find classes (class, dcode, cno) in which at least two students are enrolled\n2. Find classes (class, dcode, cno) in which at most two students are enrolled\n3. Find classes (class, dcode, cno) in which exactly two students are enrolled\n    \n          let $dataQuery9 :=\n              for $class in $im:allClasses,\n                  $dcode in $im:allDcodes,\n                  $cno in $im:allCnos\n              where\n                  some\n                    $instr in $im:allFacultySSNs,\n                    $ssn1 in $im:allStudentSSNs,\n                    $ssn2 in $im:allStudentSSNs\n                  satisfies\n                    im:class($class,$dcode,$cno,$instr) and\n                    im:enrollment($class,$ssn1) and\n                    im:enrollment($class,$ssn2) and\n                    $ssn1 != $ssn2\n    \n              return { class:$class, dcode:$dcode, cno:$cno }\n\nThank you very much.",
        "created_utc": 1522012112,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good Operating System mini projects which can be done in around 2 weeks time and give a good understanding of the concepts involved ?",
        "author": "magnetar97",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/871278/what_are_some_good_operating_system_mini_projects/",
        "text": "Language preference : C/C++/Java/Python ",
        "created_utc": 1521988782,
        "upvote_ratio": ""
    },
    {
        "title": "Which type of sensor or IoT device should I use in an IoT emergency evacuation system that can detect a structural part of a building that collapsed (or an obstructed fire exit) so that it could reroute an alternative exit path?",
        "author": "vonnP",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86zpad/which_type_of_sensor_or_iot_device_should_i_use/",
        "text": "",
        "created_utc": 1521969473,
        "upvote_ratio": ""
    },
    {
        "title": "How do websites handle requests at the same time?",
        "author": "intergalactic_priest",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86x8wf/how_do_websites_handle_requests_at_the_same_time/",
        "text": "For example say I'm on reddit, and I decide I want to create a thread.  Another user from the same state decides to make a new thread.\n\nWe both hit submit at the exact same time.  How does a website handle this?",
        "created_utc": 1521937402,
        "upvote_ratio": ""
    },
    {
        "title": "Binary search tree",
        "author": "Kushagra12_97",
        "url": "https://www.youtube.com/attribution_link?a=wqMKpCjUP6Y&amp;u=%2Fwatch%3Fv%3DlxjJ38FZcuw%26feature%3Dshare",
        "text": "",
        "created_utc": 1521925012,
        "upvote_ratio": ""
    },
    {
        "title": "Tree Traversal",
        "author": "Kushagra12_97",
        "url": "https://www.youtube.com/attribution_link?a=FHQ203L4GZc&amp;u=%2Fwatch%3Fv%3DjlWgIsDPuKE%26feature%3Dshare",
        "text": "",
        "created_utc": 1521912106,
        "upvote_ratio": ""
    },
    {
        "title": "Heap tree in data structure",
        "author": "Kushagra12_97",
        "url": "https://www.youtube.com/attribution_link?a=GcSCimDbeKw&amp;u=%2Fwatch%3Fv%3DDwRI_oBobrY%26feature%3Dshare",
        "text": "",
        "created_utc": 1521910744,
        "upvote_ratio": ""
    },
    {
        "title": "Accepted into these programs for MS, top choice still in the pipeline. Should I go ahead and accept?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86u2nx/accepted_into_these_programs_for_ms_top_choice/",
        "text": "[deleted]",
        "created_utc": 1521908586,
        "upvote_ratio": ""
    },
    {
        "title": "Device name from driver",
        "author": "_ohHai",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86qf8o/device_name_from_driver/",
        "text": "How would you go about getting the device name of a driver using c++?  \nManually, I can open up DeviceTree and look for the driver and see the device name it uses.   \nhttps://i.imgur.com/GiLkt2z.png    \n\nCan anyone point me in the right direction? Thank  you for your time",
        "created_utc": 1521860559,
        "upvote_ratio": ""
    },
    {
        "title": "Router-designated IP address not matching address found in settings of Ethernet connected Xbox, neither are the MAC addresses",
        "author": "haughtyhay",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86mw1c/routerdesignated_ip_address_not_matching_address/",
        "text": "I have no idea if this belongs here, but according to r/compsci and the guidelines here, I shall post. There's a TL;DR at the bottom, too.\n\nDetails: My Xbox One's IP address and wired MAC address in its settings do not match the IP address and MAC address listed in my router's settings, under the wired port #1, which, yes, is the port my Xbox is connected to, via an Ethernet cable. Why is this? What am I misunderstanding? If I am correct in my thinking, these IP's, and, especially the MAC addresses, should match. \n\nI am genuinely curious and eager to learn about anything related to computers, computer networking included, however this actually is a problem for me, which is an entirely different issue I will probably post later if I resolve this first.\n\nAs a side note, in hopes it will help you help me, I'm going to list the addresses displayed in my router's settings, and in my Xbox's network settings. The IP's are 172.xx.xxx.1 and 10.xx.xx.xx, respectively, and the MAC address shown in the router settings is numerical, while the wired MAC in my Xbox's settings is alphanumerical, therefore completely different.\n\nI am aware that I am rambling, and I apologize, I just wanted to give as much detail as I can, because again, I am interested in this stuff, and would like to learn more. That being said, I've simplified all this jibber-jabber into one easy-to-read question:\n\nTL;DR: Why do the IP addresses and the MAC addresses, displayed in my router's settings and my Xbox's settings, not match?\n\nThank you, awesome people!",
        "created_utc": 1521829455,
        "upvote_ratio": ""
    },
    {
        "title": "Should I start my kid out on MS-DOS",
        "author": "jrcorray",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86kxx3/should_i_start_my_kid_out_on_msdos/",
        "text": "Looking for other's thoughts. We home-school our kids and I am about to start teaching them about computers. Being in IT for a long time, I've had the opportunity to work through all of the operating systems since MS-DOS. Granted, my first actual job was on Windows for Workgroups and Banyan Vines, but I had the knowledge of DOS and Win 3.11 before that. What is everyone's opinion on starting the 7 year old out on DOS and moving through the different operating systems?",
        "created_utc": 1521814542,
        "upvote_ratio": ""
    },
    {
        "title": "What calculus does algorithms use?",
        "author": "kovlin",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86g8v1/what_calculus_does_algorithms_use/",
        "text": "As far I know, it's just series and sequences. But are there topics I should be brushing up on while working on convergence tests and the like?",
        "created_utc": 1521762110,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for lecture recommendations.",
        "author": "lastMinute_panic",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86fp5a/looking_for_lecture_recommendations/",
        "text": "I'm interested in learning more about comptuer science and programming from a high-level and would love to get some lecture and/or book recommendations.\n\nIf I could add - I do not have a great, rote-memory. More specifically, I have trouble remembering things that don't have a good story for being what they are (phone numbers etc.) and I've always found that learning in a story-type format to be invaluable. If that sparks anything for you please pass it along! ",
        "created_utc": 1521757674,
        "upvote_ratio": ""
    },
    {
        "title": "Will I have to take Calc II after transferring to a University?",
        "author": "finessseee",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86ekrj/will_i_have_to_take_calc_ii_after_transferring_to/",
        "text": "So I'm about to obtain my Associate's degree in Math, but planning on earning my Bachelors in CS. I've already taken the general courses so now all I need is Programming II, Calculus I, and one more math course to finish up my Associate's degree.\n\nSo say I choose statistics instead of Calc II (since I can't take both Calc 1 and 2 in the same semester), will I then have to take it at the University that I transfer to? \n\nRealistically I can just take Calc II and prolong the process another semester, but I was planning on finishing up sooner rather than later.. or will the University require this course?\n\nI'm sure a lot of times it may just depend on the school, but I thought maybe someone may have been in the same situation and can offer some advice.\n\nAny thoughts?\n\nThanks!",
        "created_utc": 1521749003,
        "upvote_ratio": ""
    },
    {
        "title": "Any tips on passing the AP Computer Science test?",
        "author": "RadiatedMolecule",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/86dxhp/any_tips_on_passing_the_ap_computer_science_test/",
        "text": "",
        "created_utc": 1521744086,
        "upvote_ratio": ""
    }
]