[
    {
        "title": "Nervous about Compilers class",
        "author": "compilerscs",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6sn32j/nervous_about_compilers_class/",
        "text": "Hi, so a few years ago I dropped out of school and now I'm coming back but I've been feeling really anxious and nervous about the upcoming classes, specially Compilers. I already took the prereq Languages and Automata class and loved it, even if I had some difficulty. Now that was 2 years ago and I'm afraid I won't be able to pick up the pace because the Compilers course is very project-intensive and time is tight working 8-5 as a software QA analyst.\n\nI'm also going to be taking Computer Architecture II, Databases II and Microprogramming, and even though they also are heavy classes, I'm not as nervous as with Compilers. Also because of the 2 years skipped, most of my friends are already close to graduation so I don't have any close group of friends to rely upon during the courses.\n\nWhat can I do to be ready for the class? I think we will implement a scanner generator, parser generator and then the compiler. Also how can I remove the anxiety of getting back to school?\n\nThanks for reading!",
        "created_utc": 1502300119,
        "upvote_ratio": ""
    },
    {
        "title": "Looking at buying a new laptop for my last year in CS (as a student). Budget is $1500. Must be Linux friendly and would like a machine that will last. Suggestions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6sjwll/looking_at_buying_a_new_laptop_for_my_last_year/",
        "text": "[deleted]",
        "created_utc": 1502263689,
        "upvote_ratio": ""
    },
    {
        "title": "Explain it to me like I'm Five: The A* search...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6si8j8/explain_it_to_me_like_im_five_the_a_search/",
        "text": "[removed]",
        "created_utc": 1502242659,
        "upvote_ratio": ""
    },
    {
        "title": "Importance of Calculus and Linear Algebra in Computer Graphics?",
        "author": "pmanalex",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6sgmu5/importance_of_calculus_and_linear_algebra_in/",
        "text": "[removed]",
        "created_utc": 1502226874,
        "upvote_ratio": ""
    },
    {
        "title": "If i hold down a combination of 2 or more keys on my MacBook Pro (not sure if its the same on other computers) i cant use an of the keys bellow them. Is this intentional ? and Why",
        "author": "bobojojo12",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6sc8ri/if_i_hold_down_a_combination_of_2_or_more_keys_on/",
        "text": "[removed]",
        "created_utc": 1502182300,
        "upvote_ratio": ""
    },
    {
        "title": "Best courses to take?",
        "author": "gstaats7938",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6sblzw/best_courses_to_take/",
        "text": "Going to start College of Charleston next August. Going to ask a few professors what the best classes to take to decide what direction I want to take. Would love your opinions as well. A list of the courses are found here. http://m.catalog.cofc.edu/#programdetails2\nI am taking free Coursera courses in trig, pre-calc, calculus, and Python in my spare time before I start school. Is this a good idea or a waste of time. I'm not great at math, but heard it is important for some classes so I want to know as much as possible.\nThanks for the info guys!",
        "created_utc": 1502172265,
        "upvote_ratio": ""
    },
    {
        "title": "Upcoming Computer Science Major, should I get a MacBook Pro or a Razer Blade (Windows)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6s9ze3/upcoming_computer_science_major_should_i_get_a/",
        "text": "[deleted]",
        "created_utc": 1502153188,
        "upvote_ratio": ""
    },
    {
        "title": "How do multi-core CPU's handle the kernel?",
        "author": "depressinghentai",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6s8ut7/how_do_multicore_cpus_handle_the_kernel/",
        "text": "Sorry if this is the wrong place for this, seems like the right place. So I could be wrong, I'm open to correction, but my understanding is that a processor basicly runs the kernel, the kernel does some kernel stuff, then switches the processor over to some process for a bit, then the processor saves the state of that process and runs the kernel again, the kernel does some more stuff then starts the processor on another process, and so on like that. So how is this done with multi-core CPU's? Does each core independently go back  and forth from the kernel to other processes? If so, is there a seperate 'instance' of the kernel for each core or does the kernel keep track of information for all cores and know which core it's running on at all times?",
        "created_utc": 1502142148,
        "upvote_ratio": ""
    },
    {
        "title": "Value of Masters in CS vs other fields after BS?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6s5wn4/value_of_masters_in_cs_vs_other_fields_after_bs/",
        "text": "[removed]",
        "created_utc": 1502116598,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a introductory book with good coverage of instruction pipelining",
        "author": "z_y_x",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6s5no0/looking_for_a_introductory_book_with_good/",
        "text": "Just as the title says, I am trying to find a book that covers instruction pipelining well. Most books I have seen seem to have only a few parts of the entire topic, or are extremely terse and therefore impossible to start with. Suggestions?",
        "created_utc": 1502114108,
        "upvote_ratio": ""
    },
    {
        "title": "How to statistically analyse fitnesses in a genetic algorithm?",
        "author": "wintersoIdier",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6s5kui/how_to_statistically_analyse_fitnesses_in_a/",
        "text": "I have run an experiment using a GA with 10 candidates, over 10 iterations. I recorded the fitnesses at each generation and I wish to use statistics to show whether they have increased over time. I've plotted the means, but what statistical tests are most appropriate to conclusively state that the fitnesses have actually increased or not?",
        "created_utc": 1502113265,
        "upvote_ratio": ""
    },
    {
        "title": "Cyber-security Resources",
        "author": "JumboJelly",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6s38g2/cybersecurity_resources/",
        "text": "I'm currently a computer science student and I've been trying to learn about several different types of the profession before committing or focusing in on one specifically. Recently, I have become very interested in cyber security, but I don't really know where to begin. Do y'all have any recommendations for good resources or books I could read to get a start in cyber security?",
        "created_utc": 1502079012,
        "upvote_ratio": ""
    },
    {
        "title": "Top 10 Programming Languages to Learn in 2017",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=LAoLABUnbGw",
        "text": "[deleted]",
        "created_utc": 1502056504,
        "upvote_ratio": ""
    },
    {
        "title": "What is the correct terminology for expressing *this* notion of complexity?",
        "author": "Dragon-God",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ryrni/what_is_the_correct_terminology_for_expressing/",
        "text": "Say for example, I have an algorithm $Al_i$ that produces output from the set $S = \\{s_i\\}$ for problems from the set $P = \\{p_i\\}$, and another algorithm $Al_j$ that also produces output from the set $S = \\{s_i\\}$ for problems from the set $P = \\{p_i\\}$. For the purposes of this question, $Al_j$ and $Al_i$ are the same.             \n&amp;nbsp;                \nOr, if I have two systems that produce the same output given the same input, then we can treat these systems as the same.                  \n&amp;nbsp;                  \nGenerally, if two objects do the same things (produce the same output for identical input, convey the same information as output), then these objects are identical. The processing of the systems are not relevant. We're only concerned with the output of the systems, objects, entities, etc.              \n&amp;nbsp;              \nNow, there are many such identical systems. Say $T_i$ is some set of all identical objects/entities/systems that do some same thing. Let $t_i^*$ be the object in $T_i$ with the smallest Kolmogorov complexity.            \n&gt; Is there a conventional terminology for expressing $t_i^*$?             \n            \nAn example of a $T_i$ may be the set of all proofs for a particular theorem. (Here the Kolmogorov complexity of all theorems includes each intermediate theorem invoked in its proof (so basically each theorem would first be expressed in axioms first and computing the complexity of that expression)). I may be interested in referring to the least complex theorem (using the aforementioned notion of the complexity of the axiomatic expression of the theorem).        \n&amp;nbsp;                  \nThings can be defined by form or by function. I understand that Kolmogorov complexity traditionally considers the former, while I am concerned with the Kolmogorov complexity of the latter. A picture has a defined form, and an algorithm that only produces that picture is no different from the picture itself. What about an algorithm that produces different output. We could look at the form of the algorithm, or look at its function. Looking at function, all correct algorithms for a particular problem are identical. Bogosort is identical to quicksort which is identical to mergesort, heapsort, etc.             \nI am concerned with the smallest Kolmogorov complexity of any sorting algorithm.  ",
        "created_utc": 1502031443,
        "upvote_ratio": ""
    },
    {
        "title": "Please help me understand virtualisation.",
        "author": "lucozadelemming",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ryrc2/please_help_me_understand_virtualisation/",
        "text": "I am currently trying to write a 3000 word essay on virtualisation, the brief of which is \"an individual report or case study is to be produced on the application of virtualization or cloud technologies to an organisation of your choice\".\n\nI started reading these two websites:\nhttp://inbound.kelsercorp.com/blog/the-7-types-of-virtualization\n\nhttp://www.dummies.com/programming/networking/virtualization-for-dummies-cheat-sheet/\n\nAnd am just wondering if anyone could explain, or had any useful video tutorials explaining how the three types of virtualisation listed in the dummies article (OS Virtualisation, Hardware Virtualisation and Paravirtualisation). \n\nFit in with the 7 listed in the kelsercorp one (OS virtualisation, application-server virtualisation, application virtualisation, Administrative virtualisation, network virtualisation, hardware virtualisation, storage virtualisation).\n\nI thought I had a good handle on virtualisation, I had a decent understanding of virtual machines and their uses in keeping isolated development environments as well as virtualizing hardware so that you can partition the hardware to squeeze the most efficiency out of it, but it seems like I had only scratched the surface. I also thought I understood virtualising a network and overseeing it with a hypervisor but now I'm really unsure about that.\n\nAny help would be fantastic! Thanks.",
        "created_utc": 1502031337,
        "upvote_ratio": ""
    },
    {
        "title": "Switching From Networking To Hadoop",
        "author": "kashtheif",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6rxzm6/switching_from_networking_to_hadoop/",
        "text": "Hi guys, I have a graduate's degree and I have studied Networking after completing my college and got CCNA certified; now I live in India and I can't find a suitable job, the jobs available involves competitive and tough interviews (I really tried). So I was thinking of learning cloud computing and Hadoop technology as it interests me.I inquired in an institute and he really convinced me that Hadoop will definitely be better than Networking. What should I do?\n",
        "created_utc": 1502020800,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a simple info graphic or write up that clearly explains the difference between a VPN connection and using Citrix Remote.",
        "author": "murrayalexander",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6rlgwh/looking_for_a_simple_info_graphic_or_write_up/",
        "text": "If this is he wrong spot for this, please let me know and I'll surely remove my post. \n\nI'm looking for a very simple info graphic that shows the difference between a VPN connection to company resources vs. using Citrix Remote to access company resources. Everything I'm finding is a bit too complex to share with our end users. We utilize MobilePASS to connect to both VPN and Citrix Remote but I need to find an easy way to explain the difference. \n\nThank you! ",
        "created_utc": 1501862890,
        "upvote_ratio": ""
    },
    {
        "title": "Is it normal to bounce between feelings of \"I love CS, I want to do improve my skills and keep learning\" and \"I absolutely hate coding and want to change my life's focus\" ?",
        "author": "EntangledAndy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6rkrha/is_it_normal_to_bounce_between_feelings_of_i_love/",
        "text": "[removed]",
        "created_utc": 1501856415,
        "upvote_ratio": ""
    },
    {
        "title": "Question for people that got their MS in Computer Science (US) but did their bachelors in a different field.",
        "author": "TectonicQuake",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6rfi93/question_for_people_that_got_their_ms_in_computer/",
        "text": "I did my bachelors in Electrical Engineering but now I'm looking to go for a masters in CS. I'm enrolled in online classes right now on harvard edX and coursera to learn more about topics in this field. I also have prior programming experience in sql, C, and python, but only at an intermediate level at best.\n\nWhat type of experience did you gain before you applied to grad school for a major that was different from what you did in your undergrad? How exactly did you present your case in your statement of purpose/intent?",
        "created_utc": 1501794436,
        "upvote_ratio": ""
    },
    {
        "title": "Would a table of HTTP status codes to categories be more performant than inequality checks?",
        "author": "mcandre",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6rdles/would_a_table_of_http_status_codes_to_categories/",
        "text": "[removed]",
        "created_utc": 1501778778,
        "upvote_ratio": ""
    },
    {
        "title": "Normalizing table into 3rd Normalized Form",
        "author": "Aliwia",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r95pq/normalizing_table_into_3rd_normalized_form/",
        "text": "[removed]",
        "created_utc": 1501725445,
        "upvote_ratio": ""
    },
    {
        "title": "programmer burnout?",
        "author": "IncrementTimesTwo",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r8z6f/programmer_burnout/",
        "text": "for the past six months ive had intense programmer burnout, i just don`t know what to work on anymore, i want to do something practical, something where after im done programming it i feel like ive done something useful, programming use to be my favorite hobby, now i just sit around, try to make electronic music from time to time, and game, i really want to get back into my programming groove.",
        "created_utc": 1501723519,
        "upvote_ratio": ""
    },
    {
        "title": "Does the FBI need to analyze the DNC Servers? Rep Ted Lieu says no. (18 minutes in the video)",
        "author": "amazingmayzie",
        "url": "https://www.pscp.tv/w/1OdKronBQgzGX",
        "text": "",
        "created_utc": 1501711774,
        "upvote_ratio": ""
    },
    {
        "title": "I have 205 numbers and need to find each sum for every possible combination. How do I do this / is it even possible?",
        "author": "portugal_the_fan",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r5qpg/i_have_205_numbers_and_need_to_find_each_sum_for/",
        "text": "Without getting into too much detail, I have $ amounts from 205 different accounts. Out of those 205 accounts, there is a specific, unknown combination of them that, when added together, will equal a target value of, let's say, $3550.70. I need a way to iterate through every single combination until I find the sum that gives me that same value.\n\nCurrently, I'm doing this in Excel's Solver. It's been running for several hours, and I just looked into it and, if I'm correct, there are 205! different combinations; that's about 2.7 x 10^386, which is an unfathomably large number.\n\nIs this possible to accomplish, or is that number correct? If it is possible, what is the best route to take?",
        "created_utc": 1501694527,
        "upvote_ratio": ""
    },
    {
        "title": "Stuck learning about a simple insecure xor hash function",
        "author": "Bill_Murray2014",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r5glj/stuck_learning_about_a_simple_insecure_xor_hash/",
        "text": "[removed]",
        "created_utc": 1501692256,
        "upvote_ratio": ""
    },
    {
        "title": "(intern/paid) Anyone interested in fixing bugs on a simple website.",
        "author": "allicisred",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r4x6o/internpaid_anyone_interested_in_fixing_bugs_on_a/",
        "text": "Message me for details.",
        "created_utc": 1501687643,
        "upvote_ratio": ""
    },
    {
        "title": "Math pre-reqs for algorithm analysis/ computational complexity",
        "author": "Wallblacksheep",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r4e1k/math_prereqs_for_algorithm_analysis_computational/",
        "text": "Let's say one were to take a grad level algorithm/ computational complexity course in a year or so, but said person has experience in coding already, however needs to brush up on math and theory. What topics would you recommend? \n\n\nSome cursory research has given me the current list of topics:\n\n1. Formal logic\n2. Proofs\n3. Graph theory\n\nIs there a road map, book or further topics you'd recommend to have a firm background and understanding of the theory and lexicon before entering the course? This is also for fun and genuine interest in the _theory_ part, not just the coding.\n\nReadings and books are preferred over online courses fwiw.",
        "created_utc": 1501682795,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any music-related computer science theories/concepts?",
        "author": "theology_",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r46q2/are_there_any_musicrelated_computer_science/",
        "text": "[removed]",
        "created_utc": 1501680847,
        "upvote_ratio": ""
    },
    {
        "title": "How damaging would it be to my future by not having a summer internship after my junior year?",
        "author": "Mofongo96",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6r1917/how_damaging_would_it_be_to_my_future_by_not/",
        "text": "I am a rising junior currently majoring in business at the University of Southern California. I came into school as a business major and haven't been getting as much out of the business courses than I would've hoped for. I've always had a passion for programming and computers but was always so focused on my current studies to think about other options in college. After doing some research and meeting with an advisor, I learned about this possibility of double majoring in CS/BA. This is a really exciting prospect for me but there's a couple of concerns/questions that have risen because of it.\n\n1. In order to graduate with the degree I'll have to take two summer courses in 2018, and take an extra semester in the Fall of 2019.\n2. My biggest concern isn't the extra money that'll have to get spent, I'm more concerned over how big of an issue it'll be over not having a summer internship this upcoming summer. I've heard that it's crucial to have one, but taking these summer courses will prohibit me from doing so.\n\nMain question is: How big of a detriment would it be towards my career to not have a summer internship next summer? Is there anything else I can do to boost my resume prior to next summer?\n\n**Tl;dr:** I'm changing majors to CS/BA but will have to take two summer courses next summer in order to do so. How detrimental would it be to my career if I don't have a summer internship next summer?\n\nAny other feedback would be greatly appreciated thanks so much!!!",
        "created_utc": 1501641505,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there not any spam bots on reddit but a lot of other helpful bots",
        "author": "pmurg",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qyjo5/why_are_there_not_any_spam_bots_on_reddit_but_a/",
        "text": "I don't understand why there isn't any spam of bots trying to sell stuff like on other sites like facebook.",
        "created_utc": 1501614959,
        "upvote_ratio": ""
    },
    {
        "title": "Help translating sscanf() references in C",
        "author": "pizzzzzzzzzzzzzzzzza",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qwyif/help_translating_sscanf_references_in_c/",
        "text": "I have this code:\n\n    sscanf (\"45 , ignore_this % C read_in_this**\", \"%d , %*s %% %c %5s %s\",\n    &amp;i, &amp;c, string, &amp;string[5]);\n\nand when I look at the variable assignments, I get\n\n            c = C\n        i = 45\n     string = read_in_this**\n     string + 5 = in_this**\n\nI'm confused about how &amp;i, &amp;c, string, and &amp;string[5] were assigned. My step-by-step interpretation/questions:\n\n* &amp;i -&gt; %d -&gt; \"45\"\n* %*s is skipped because of the \"*\", so \"ignore_this\" is ignored.\n* Is %% skipped as well? Why isn't &amp;c assigned to %%? What happens to the \"%\" from the input string?\n* &amp;c -&gt; %c -&gt; \"C\"\n* string -&gt; %5s -&gt; \"read_in_this**\" but what is the point of the '5'? Why can't it just be %s?\n* Not sure what &amp;string[5] does.\n* What does 'string + 5' do exactly?\n\nI've been staring at this for a while and I'm completely confused. Would really appreciate the help. Thank you!",
        "created_utc": 1501601268,
        "upvote_ratio": ""
    },
    {
        "title": "Software, Computer Engineering vs Computer Science - which one should you choose",
        "author": "Engr_TAC",
        "url": "http://www.whatengineers.com/computer-science-vs-computer-engineering/",
        "text": "",
        "created_utc": 1501534097,
        "upvote_ratio": ""
    },
    {
        "title": "How does an OS tell a program to launch with a specific file?",
        "author": "Anders4000",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qkywg/how_does_an_os_tell_a_program_to_launch_with_a/",
        "text": "[removed]",
        "created_utc": 1501460438,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting research paper topic relating to security?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qjj19/interesting_research_paper_topic_relating_to/",
        "text": "[removed]",
        "created_utc": 1501445180,
        "upvote_ratio": ""
    },
    {
        "title": "Couldn't video players use the macro block motion vectors to play the videos at higher FPS?",
        "author": "drummyfish",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qh4a5/couldnt_video_players_use_the_macro_block_motion/",
        "text": "[removed]",
        "created_utc": 1501418009,
        "upvote_ratio": ""
    },
    {
        "title": "Would this be plagiarism ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qf602/would_this_be_plagiarism/",
        "text": "[deleted]",
        "created_utc": 1501384005,
        "upvote_ratio": ""
    },
    {
        "title": "Question about playstation",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qf301/question_about_playstation/",
        "text": "[deleted]",
        "created_utc": 1501382817,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone do Cleanroom software engineering? Everything I've ever read says it's the best methodology there is...",
        "author": "lorddimwit",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6qbuld/anyone_do_cleanroom_software_engineering/",
        "text": "[removed]",
        "created_utc": 1501345453,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a Book that Introduces IT Industry to a Non Tech Savvy Person",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6q9jhs/looking_for_a_book_that_introduces_it_industry_to/",
        "text": "[deleted]",
        "created_utc": 1501310106,
        "upvote_ratio": ""
    },
    {
        "title": "How would Android act to an end user if it used Real Time scheduling.",
        "author": "___Edward___",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6q4fnl/how_would_android_act_to_an_end_user_if_it_used/",
        "text": "If Android was a RTOS, how would that effect the end user?\n\nWorse battery life? Worse multitasking? ",
        "created_utc": 1501254930,
        "upvote_ratio": ""
    },
    {
        "title": "Keyboard backlight stopped working",
        "author": "Lil_Porkchop",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6q1qcz/keyboard_backlight_stopped_working/",
        "text": "I have a new samsung notebook 7 spin with windows 10. Just today i turned on my computer and the keyboard backlight wasn't on, so I use my fn f9 function to activate it but it would not adjust. I was unable to find any type of brightness level in the control panel for keyboard backlight brightness. I have not found any drivers that I can install for this. And there have been no updates to my drivers or to my computer at all actually in a week. Help.",
        "created_utc": 1501219204,
        "upvote_ratio": ""
    },
    {
        "title": "what was the breakthrough from that quantum computer from google? link inside",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6puftk/what_was_the_breakthrough_from_that_quantum/",
        "text": "[removed]",
        "created_utc": 1501141476,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Science majors of reddit, is it best to do one language in both programming fundamentals courses?",
        "author": "kiki1090",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ps7ep/computer_science_majors_of_reddit_is_it_best_to/",
        "text": "I took my Programming Fundamentals I course in C#. Is it best to take Programming Fundamentals II in C#, or can it be in another language?",
        "created_utc": 1501113589,
        "upvote_ratio": ""
    },
    {
        "title": "A question on SAT",
        "author": "Dragon-God",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6poa7x/a_question_on_sat/",
        "text": "&gt; A logical formula is unsatisfiable **if and only if** for the formula to be true, at least one of its variables must be both true and false.      \n        \nI discovered SAT today, and wanted to try my hands at solving it. I arrived at the above statement as a general principle for any attempt I want to make at solving SAT. Is the principle true?",
        "created_utc": 1501078200,
        "upvote_ratio": ""
    },
    {
        "title": "Question about why what I did on a public wifi worked",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6pmz6n/question_about_why_what_i_did_on_a_public_wifi/",
        "text": "[removed]",
        "created_utc": 1501062291,
        "upvote_ratio": ""
    },
    {
        "title": "Discord™ Computer Science (official Discord server of /r/askcomputerscience)",
        "author": "attricia",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6pkj6n/discord_computer_science_official_discord_server/",
        "text": "[removed]",
        "created_utc": 1501029527,
        "upvote_ratio": ""
    },
    {
        "title": "Are ML/AI algorithm's conclusions able to be determined if their inputs are exactly repeated?",
        "author": "Best_of_the_Worst",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6pkhqs/are_mlai_algorithms_conclusions_able_to_be/",
        "text": "If a ML/AI algorithm on two separate systems was fed the same learning inputs, would it produce identical outputs? Or is there some function of the programming which may produce slightly varied results?\n\nEG: If I fed XYZ algorithm on two systems the same Iris data set, would they conclude the exact same characteristics? Or might they identify some flowers as different species?\n\nFair warning: I'm relatively unversed in the AI/ML space.",
        "created_utc": 1501029095,
        "upvote_ratio": ""
    },
    {
        "title": "Which twitter accounts should all tech development companies follow?",
        "author": "innerv0ice",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ph2lc/which_twitter_accounts_should_all_tech/",
        "text": "I work for a web, app, and software development company. Which twitter accounts should we follow to stay on top of trends and news within our industry? We also want to increase our network and reach.",
        "created_utc": 1500998327,
        "upvote_ratio": ""
    },
    {
        "title": "Can't access default gateway of router",
        "author": "gwhr",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6pezb6/cant_access_default_gateway_of_router/",
        "text": "I can't access the default gateway 192.168.1.1 of my router. Not from any of my devices. Internet works fine. Check ping, it shows 0% loss for it. Ipconfig mentions it to be the default gateway. Only way I can access my device now is if I hard reset it but then too for couple of hours and then it's the same issue. Any solutions? Thanks",
        "created_utc": 1500973784,
        "upvote_ratio": ""
    },
    {
        "title": "Discord Computer Science (official Discord server of /r/askcomputerscience)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6pdcla/discord_computer_science_official_discord_server/",
        "text": "[deleted]",
        "created_utc": 1500950398,
        "upvote_ratio": ""
    },
    {
        "title": "Thinking about going back to school for computer science.",
        "author": "gstaats7938",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6pbk5d/thinking_about_going_back_to_school_for_computer/",
        "text": "I received a BA in Psychology and can't find a career worth settling for (for such low income). I want to get another degree in a field that pays well and is in demand. However, I want to make sure i am taking the best classes so that i am paid well and not easily replaced. Any advice on this would be tremendously helpful!",
        "created_utc": 1500931923,
        "upvote_ratio": ""
    },
    {
        "title": "Let us say I have many jpg files, some of them redundant but with a different hash, how can I simply calculate their similarity?",
        "author": "jokoon",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p8xnw/let_us_say_i_have_many_jpg_files_some_of_them/",
        "text": "[removed]",
        "created_utc": 1500908607,
        "upvote_ratio": ""
    },
    {
        "title": "What specs should my laptop have?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p7ayd/what_specs_should_my_laptop_have/",
        "text": "[removed]",
        "created_utc": 1500888419,
        "upvote_ratio": ""
    },
    {
        "title": "What is a good secondary subject for a computer scientist?",
        "author": "Its_Kuri",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p6cv8/what_is_a_good_secondary_subject_for_a_computer/",
        "text": "**Background/motivation:** I am beginning my Ph.D. in Computer Science this Fall after starting a Master's degree. In preparation for this, I've read a couple of papers on what makes a good doctoral student, and a few professors mentioned that studying a second discipline can be quite useful (explicitly mentioned were cognitive psychology for AI and genetics for bioinformatics).\n\nAs I've asked in the title, what are good secondary subjects for a future computer scientist and why?",
        "created_utc": 1500873202,
        "upvote_ratio": ""
    },
    {
        "title": "I can either take this course or go straight into a intro to computer science course....is microsoft access something I'll really need to be versed in?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p5w0j/i_can_either_take_this_course_or_go_straight_into/",
        "text": "[removed]",
        "created_utc": 1500866936,
        "upvote_ratio": ""
    },
    {
        "title": "CS Majors, How did you stay on top of your programming skills during summer breaks?",
        "author": "gingydoritos",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p4ga9/cs_majors_how_did_you_stay_on_top_of_your/",
        "text": "I finished my first year in CS this past spring and I haven't been working on any programming projects to keep up with what I've learned (my fault). The other day I opened up some of my old java assignments finding myself confused at some of the code I had written. During the school year I was really good at programming and understood it. What also worries me is I'm not taking a programming class this coming fall semester.  So what advice do you have for keeping up with your coding skills. I'm willing to do the extra work, I just never knew what to do. Thanks!",
        "created_utc": 1500850098,
        "upvote_ratio": ""
    },
    {
        "title": "Corrupted hdd? Cant load bios help",
        "author": "Hamhampopo",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p44z0/corrupted_hdd_cant_load_bios_help/",
        "text": "I turn on the pc and it gives the bios option but it doesnt respond. It goes past this screen and goes to \"beginning automatic disk repair\". Half the time it goes to blue screen of :( and half it goes to a black screen with a curser but nothing else. \n\nIve tried turning it on with a win10 load usb and same thing.\n\nGold for first person that gives correct solution :D",
        "created_utc": 1500846758,
        "upvote_ratio": ""
    },
    {
        "title": "Tips for doing well/studying in computer science",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p3zjd/tips_for_doing_wellstudying_in_computer_science/",
        "text": "[deleted]",
        "created_utc": 1500845165,
        "upvote_ratio": ""
    },
    {
        "title": "Does this method of sorting have a name?",
        "author": "chlorinecrown",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p2uf1/does_this_method_of_sorting_have_a_name/",
        "text": "At work, I often will be given N items, that are labeled 1-N but in a random permutation, and I have to arrange them into a grid of 1234,5678 etc. I just know the positions up to around 40, so I sort by placing 14 in slot 14, etc, rather than doing any direct comparisons of the items.\n\nIs there any named sorting algorithm this is similar to? What sort of datasets is this similar to?",
        "created_utc": 1500833695,
        "upvote_ratio": ""
    },
    {
        "title": "Open Source Project SDLC",
        "author": "NikhilDoWhile",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p0y1m/open_source_project_sdlc/",
        "text": "Background: CS engineer ( IIIrd year)\n\nRecently I have been trying to understand software engineering practices and system design. In there I was trying to figure out the software development life cycle of Open Source projects.\n\nLike a hypothetical company called Kuggle wants to make a open source project called Smart Bot. They are using Github. \n\nNow will they use same code for production, development and deployment as the code on github that they have open sourced ? Will that make their code more vulnerable ? Or is their some other method all together ? ",
        "created_utc": 1500811296,
        "upvote_ratio": ""
    },
    {
        "title": "Open Source Project SDLC",
        "author": "NikhilDoWhile",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6p0vvu/open_source_project_sdlc/",
        "text": "Background: CS engineer ( IIIrd year)\n\nRecently I have been trying to understand software engineering practices and system design. In there I was trying to figure out the software development life cycle of Open Source projects.\n\nLike a hypothetical company called Kuggle wants to make a open source project called Smart Bot. They are using Github. \n\nNow will they use same code for production, development and deployment as the code on github that they have open sourced ? Will that make their code more vulnerable ? Or is their some other method all together ? ",
        "created_utc": 1500810230,
        "upvote_ratio": ""
    },
    {
        "title": "quickly completing multiple-choice forms",
        "author": "-greenman-",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6oxskj/quickly_completing_multiplechoice_forms/",
        "text": "Hi, sorry if this is the wrong sub to be asking this, please point me in the right direction if it is.\nI'm about to start a new temporary job helping with some research at a local university. Basically what I'll be doing is analysing pictures and filling in a standardised online multiple-choice form to record the results. What I was wondering is are there any applications or simple tools that will help me speed this up by assigning keyboard shortcuts or something to the responses? Thanks a lot",
        "created_utc": 1500761749,
        "upvote_ratio": ""
    },
    {
        "title": "How difficult is it to get into android development?",
        "author": "faisalx12",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6owyd8/how_difficult_is_it_to_get_into_android/",
        "text": "[removed]",
        "created_utc": 1500752421,
        "upvote_ratio": ""
    },
    {
        "title": "very basic question: can someone explain how n^srqt(n) is equal to the 2^logn(sqrt(n)) thing?",
        "author": "nudebaba",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6owtpg/very_basic_question_can_someone_explain_how/",
        "text": "[removed]",
        "created_utc": 1500750992,
        "upvote_ratio": ""
    },
    {
        "title": "Feasibility of block chain style elections?",
        "author": "ItTakesRocketScience",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6oorb3/feasibility_of_block_chain_style_elections/",
        "text": "A thought I've been turning over in my mind for a little while now: what is the feasibility of a block chain style (I'm thinking something like bit-coin) election?  Imagine an election where a public ledger is kept of votes cast.  Possibly I'm over analyzing because it has occurred to me that at a low level this might actually be how things are actually done.  Are there any resources you know of on this topic?  Can anybody explain how this could be a good or bad idea?",
        "created_utc": 1500652174,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't URLs support capital letters?",
        "author": "CarHacks",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6onde2/why_dont_urls_support_capital_letters/",
        "text": "[title]\n\nWhy couldn't there be Red.com vs red.com, or Blue.com vs blue.com?",
        "created_utc": 1500637362,
        "upvote_ratio": ""
    },
    {
        "title": "What is the current state of research in computability theory?",
        "author": "ParseTree",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6omt70/what_is_the_current_state_of_research_in/",
        "text": "",
        "created_utc": 1500628631,
        "upvote_ratio": ""
    },
    {
        "title": "Database of file size statistics across popular file extensions / mimetypes?",
        "author": "mcandre",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6oi7ax/database_of_file_size_statistics_across_popular/",
        "text": "[removed]",
        "created_utc": 1500575416,
        "upvote_ratio": ""
    },
    {
        "title": "What is difference between Delete, Erase and Wipe?",
        "author": "techguy0",
        "url": "https://techsaaz.blogspot.com/2017/07/what-is-difference-between-delete-erase.html",
        "text": "",
        "created_utc": 1500561170,
        "upvote_ratio": ""
    },
    {
        "title": "[Help]How to install SPIN model checker?",
        "author": "nanjero",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6odtqv/helphow_to_install_spin_model_checker/",
        "text": "This is the [installation manual](http://spinroot.com/spin/Man/README.html). I am trying to follow the installation manual for windows PC but I am having trouble following it as I am not a very technical user. The manual also mentions a spin*.exe file, is this referring for the spin*.exe.gz file that comes int he .zip file? I also dont know what packages to pick in cygwin to download the gcc and cpp required for SPIN. I also following [this](https://saeedkhattak.wordpress.com/2012/02/21/23/) guide to try and install ispin but it doesnt seem to be working. I dont get the same screen as shown in the guide. When i double click on the ispin.tcl i get a mouse loading animation for a few seconds and nothing else happens. Then when I open the wish.tcl I get 2 windows one small one big. The small one has the wish name and its just grey. The big window has the console name and I am able to type. I have the \"(big) 1%\" prompt.\n\nI apologise if this is not the right place to ask this and would appreciate if someone could redirect me to the right place. ",
        "created_utc": 1500522986,
        "upvote_ratio": ""
    },
    {
        "title": "What are some real world examples of the benefits of immutability (from a novice programmer)?",
        "author": "azur08",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6odj3x/what_are_some_real_world_examples_of_the_benefits/",
        "text": "[removed]",
        "created_utc": 1500519402,
        "upvote_ratio": ""
    },
    {
        "title": "When mobile app developers write an app, is there some kind of generic universal platform that the app runs on, or do they have to re-write the application for different OS's using common assets?",
        "author": "EntangledAndy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6o9arw/when_mobile_app_developers_write_an_app_is_there/",
        "text": "[removed]",
        "created_utc": 1500478966,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to learn how Internet works?",
        "author": "ChupoX",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6o6r7b/what_is_the_best_way_to_learn_how_internet_works/",
        "text": "I know how Internet works in general, and I'm aware of some of it's concepts (DNS, TCP/UDP protocols etc.) but I'd like to learn about it more in-depth. Is there a good resource (tutorial/book/course) you can recommend?",
        "created_utc": 1500446396,
        "upvote_ratio": ""
    },
    {
        "title": "Creating an ftp client",
        "author": "elephang",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6o5lqr/creating_an_ftp_client/",
        "text": "I am completely lost about how I can create an ftp client. It is a school assignment. I know how to code and know how classes, functions, arrays, etc work, but I've never been taught this. Anyway to point me in the right direction would be great. Thanks.",
        "created_utc": 1500431392,
        "upvote_ratio": ""
    },
    {
        "title": "Creating a Windows full disk backup?",
        "author": "teknohippie",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6o2ixj/creating_a_windows_full_disk_backup/",
        "text": "My girlfriend it's giving me her old work computer (running Windows 10) and I plan on a fresh install of Ubuntu. What is the best way of backing up all her data and saving it in an accessible format (I was thinking along the lines of a virtual box image or something) on an external hard drive?",
        "created_utc": 1500400995,
        "upvote_ratio": ""
    },
    {
        "title": "How should I go about learning compilers?",
        "author": "DistressedRomeo",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nyak5/how_should_i_go_about_learning_compilers/",
        "text": "What are some great resources to learn about compilers and how to build them? ",
        "created_utc": 1500349394,
        "upvote_ratio": ""
    },
    {
        "title": "for those with extensive knowledge, what's the leading edge or #1 source to learn about cs (with the exception of ML)?",
        "author": "makealldigital",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nx0j4/for_those_with_extensive_knowledge_whats_the/",
        "text": "[removed]",
        "created_utc": 1500335036,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the golden ratio, of all numbers, the optimal choice of ratio in golden-section search?",
        "author": "UmamiSalami",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nvl5t/why_is_the_golden_ratio_of_all_numbers_the/",
        "text": "[removed]",
        "created_utc": 1500321377,
        "upvote_ratio": ""
    },
    {
        "title": "Block cipher on a different character set (x-post from r/crypto)",
        "author": "second_second",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nub7w/block_cipher_on_a_different_character_set_xpost/",
        "text": "As I understand, popular block ciphers like DES, AES operate on ASCII/unicode that use all characters represented in a byte ( 256 characters for ASCII). Is there a variation on a block cipher that allow encryption on a (say) 52 length character set? \n\nFor example if i have a plaintext containing only alphabets and encrypt it with this modified block cipher, I should get a ciphertext containing only alphabets. Is there such an algorithm?",
        "created_utc": 1500310244,
        "upvote_ratio": ""
    },
    {
        "title": "Converting a PDA to CFG",
        "author": "vvfvvfvvf",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ns8gz/converting_a_pda_to_cfg/",
        "text": "Yo!\n\nI can't tell if this is the right place to as questions about Automata and formal languages and such. \nHere's my problem.\n\nTake this exercise:\nhttp://imgur.com/a/IQCS5\n\nI don't see how this would work out as an Automaton that accepts any string. The way P is defined right now, you can see that:\n1. It has no finite state\n2. Alternatively, it has no way to pop Z0, the starting stack symbol/item out of the stack either.\nWe know that for a PDA to accept any string, said configuration must either lead to a finite state being reached or to the stack being empty. (We can also turn 1. into 2. by creating stack-emptying states but that is not of importance.)\n\nHow would you generate a String of any length in this PDA? It makes no sense to me. It comes with no finite state and no transition that allows us to pop Z0 out of the stack.\n\n(As for the solution, here it is: http://infolab.stanford.edu/~ullman/ialcsols/sol6.html \nThat's not my problem though. My problem is I can't see how this would work out.)\n\n\nThanks in advance",
        "created_utc": 1500287330,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] A few (possibly odd) questions comparing speeds of two languages.",
        "author": "NotTheKrustyKrab",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nqkk4/question_a_few_possibly_odd_questions_comparing/",
        "text": "These are just a random thought and some questions I had about some CS theory as somebody who's self-taught.  Thanks in advance for any input.\n\nJava is a typed language and Python is not.  How do the speeds of checking types differ between them?  Specifically, the example below made me ponder this.\n\nLet's say you're making two very similar programs on the same computer, one in Java and the other in Python.  At some point, you mess up while coding and accidentally pass a `int` to a function instead of an intended `float`.  Let's also say you've set up a try/catch in the function in Python, so an error is thrown if a non-`float` is given.  \n\nHere are my questions:\n\n1.  All else being equal, which language would take the least time to notify you of the type-mismatch error?\n\n2.  How much would it matter if the \"check if `float`\" weren't the first line in the Python's try/catch?\n\n3. What's actually happening on the deeper level (VM stuff, C stuff, maybe machine code) when these two check this condition of being a float? \n\n4.  How much does the answer to #1 depend on the various hardware of the computer used? ",
        "created_utc": 1500261423,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Axiomatic semantics",
        "author": "heyimjordan",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nqezr/question_axiomatic_semantics/",
        "text": "For a practice exam (Organisation of Programming Languages), I have the following sample question:\n\n&gt; Using a correctness proof derived from axiomatic semantics, prove that the following code fragment successfully exchanges the values A and B, initially stored in locations a and b respectively.\n\n&gt; a = a - b;\n\n&gt; b = -(b – a);\n\n&gt; a = b - a;\n\nIn the end the closest I can get is `a = A` and `-b = B`, which would prove it false. Would this be a correct assumption, or am I doing something wrong?",
        "created_utc": 1500259502,
        "upvote_ratio": ""
    },
    {
        "title": "Can chaotic systems be used to generate random numbers?",
        "author": "skytomorrownow",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6noc67/can_chaotic_systems_be_used_to_generate_random/",
        "text": "[removed]",
        "created_utc": 1500235697,
        "upvote_ratio": ""
    },
    {
        "title": "How well am I doing in CS?",
        "author": "12860682321",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nmbmi/how_well_am_i_doing_in_cs/",
        "text": "[removed]",
        "created_utc": 1500213313,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to use a graphing calculator as a computer input (like a keyboard) ?",
        "author": "Green_Fish4",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nm4kv/is_it_possible_to_use_a_graphing_calculator_as_a/",
        "text": "Hi !\n\nI used a fx-9750GII for three years for high school and had fun playing with it (programming in Basic, changing the OS, adding programs). I was wondering if, using the USB cable, it could theoretically be possible to use it as an input.\n\nIf it is, where can I gather the informations on how to do this.\n\nI'm not asking for a tutorial, but for a place to find the documentation for this.\n\nI really didn't know where to ask this, and I'm sorry if it isn't appropriate.\n\nThank you for reading\n\nEdit : Can't get used to formatting",
        "created_utc": 1500210377,
        "upvote_ratio": ""
    },
    {
        "title": "What data in the world has been forever lost?",
        "author": "MrOaiki",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nf7e9/what_data_in_the_world_has_been_forever_lost/",
        "text": "[removed]",
        "created_utc": 1500113543,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] What are resources you suggest to create high quality websites and web resources?",
        "author": "bgbrooks",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6ne93k/question_what_are_resources_you_suggest_to_create/",
        "text": "I am interested in creating lightweight, mobile friendly web content. What playforms/frameworks are good to use? What are common tools used by web devs across the industry? What do you suggest?",
        "created_utc": 1500095688,
        "upvote_ratio": ""
    },
    {
        "title": "How smart are people working on artificial intelligence, brain-computer interface, landing rockets, etc? Can an average person like me, realistically work on these one day?",
        "author": "cloth_mother",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nbj5x/how_smart_are_people_working_on_artificial/",
        "text": "Are they geniuses or just average/above-average intelligent people who studied and worked a lot?",
        "created_utc": 1500062756,
        "upvote_ratio": ""
    },
    {
        "title": "How to make a computer boot really fast into just one program (no OS)?",
        "author": "ribbonstreet",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6nb9y9/how_to_make_a_computer_boot_really_fast_into_just/",
        "text": "[removed]",
        "created_utc": 1500060317,
        "upvote_ratio": ""
    },
    {
        "title": "Need help figuring this out please",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6n7zn4/need_help_figuring_this_out_please/",
        "text": "[deleted]",
        "created_utc": 1500024790,
        "upvote_ratio": ""
    },
    {
        "title": "How was this interactive particle background built? What should I learn to build one myself?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6n2jg9/how_was_this_interactive_particle_background/",
        "text": "[deleted]",
        "created_utc": 1499961731,
        "upvote_ratio": ""
    },
    {
        "title": "Is it truly possible to have standardized CSS when every web browser uses a different render engine?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6n2du0/is_it_truly_possible_to_have_standardized_css/",
        "text": "[deleted]",
        "created_utc": 1499960344,
        "upvote_ratio": ""
    },
    {
        "title": "Assuming a finite number of particles capable of occupying a finite number of states, in a finite amount of space, for a finite amount of time, is it possible to imagine a number so large it escapes not only concrete representation but calculation of some sort as well?",
        "author": "deepsoulfunk",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mzovc/assuming_a_finite_number_of_particles_capable_of/",
        "text": "[removed]",
        "created_utc": 1499924442,
        "upvote_ratio": ""
    },
    {
        "title": "Do server farms use holonomy?",
        "author": "computerbutts",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mza2x/do_server_farms_use_holonomy/",
        "text": "[removed]",
        "created_utc": 1499919050,
        "upvote_ratio": ""
    },
    {
        "title": "How does post-login loading work in Windows?",
        "author": "assuser",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6myb38/how_does_postlogin_loading_work_in_windows/",
        "text": "[removed]",
        "created_utc": 1499907614,
        "upvote_ratio": ""
    },
    {
        "title": "1 How to build up an active Github and gain \"project experience\"?",
        "author": "KingBoy123",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mvtrj/1_how_to_build_up_an_active_github_and_gain/",
        "text": "So its become very apparent to me over the years that project + extracurricular experience trumps everything once you're looking for a job. The problem is, I'm not really sure how to get started or what \"working on a project\" even really means and entails. I'm also not sure how to navigate the Github site and find what I'm looking for. Only language I can work in is Java.",
        "created_utc": 1499883553,
        "upvote_ratio": ""
    },
    {
        "title": "The New Turing Omnibus",
        "author": "aditya101099",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mvt2y/the_new_turing_omnibus/",
        "text": "Hey guys,\n\nI'm a high school student (a senior) and an aspiring computer scientist. I recently picked up \"The New Turing Omnibus\" by A.K. Dewdney. The first few chapters seemed relatively straightforward and interesting, but then it started getting difficult and started going over my head. Are there any supplemental resources that are good for actually understand what's going on? (Yes I'm aware that Dewdney has citations at the end of each chapter, but I can't exactly go and read 100 books)\n\nThanks everyone! I really appreciate it!",
        "created_utc": 1499883386,
        "upvote_ratio": ""
    },
    {
        "title": "What is a marker file?",
        "author": "Zeekawla99ii",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mnhru/what_is_a_marker_file/",
        "text": "",
        "created_utc": 1499791853,
        "upvote_ratio": ""
    },
    {
        "title": "Which laptop should I get for a CS degree?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mmucc/which_laptop_should_i_get_for_a_cs_degree/",
        "text": "[removed]",
        "created_utc": 1499786115,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Any good Laptop recommendations on Amazon for a soon-to-be Computer Science major?",
        "author": "Maxcellent",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/6mk4mt/question_any_good_laptop_recommendations_on/",
        "text": "Going in to my 3rd year of college and I feel like having a laptop, specifically because of what I will be studying, would be very beneficial. I also kind of want to take advantage of this Amazon Prime Day thing along with the Amazon gift cards I have. Looking for something that wont break the bank, but will be able to do all the things I may be doing in my Computer Science studies. I have heard that it doesn't take much computing power to program, but I am willing to spend a little extra to be sure I will be able to do things quickly and efficiently. I already have a desktop for gaming so that isn't really a priority. Just looking for a solid reliable computer to use on campus.\n\n\nMy budget is about 500 dollars, however, if there is something cheaper than that then great! Any recommendations are appreciated!",
        "created_utc": 1499749746,
        "upvote_ratio": ""
    }
]