[
    {
        "title": "Question between two Majors I am interested.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8lng8f/question_between_two_majors_i_am_interested/",
        "text": "[deleted]",
        "created_utc": 1527113590,
        "upvote_ratio": ""
    },
    {
        "title": "What is all this code when I try going to Facebook.com it happens on both Chrome and IE?!",
        "author": "[deleted]",
        "url": "https://i.redd.it/bvrwnnxjboz01.png",
        "text": "[deleted]",
        "created_utc": 1527111010,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a program or app that will take a long hexadecimal and break it into the corresponding colors?",
        "author": "kplusU",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ln2he/is_there_a_program_or_app_that_will_take_a_long/",
        "text": "",
        "created_utc": 1527110482,
        "upvote_ratio": ""
    },
    {
        "title": "Real Estate Agent looking to use CS to dominate my industry",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8lmtp2/real_estate_agent_looking_to_use_cs_to_dominate/",
        "text": "[deleted]",
        "created_utc": 1527108651,
        "upvote_ratio": ""
    },
    {
        "title": "How are services that consolidate all of your passwords not a HUGE security red flag?",
        "author": "PortlandPerson94",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8lgghx/how_are_services_that_consolidate_all_of_your/",
        "text": "I understand the basic value proposition of convenience but don't understand the implementation. It seems like these companies are basically inviting blackhat hackers who are after specific individual identities. ",
        "created_utc": 1527048344,
        "upvote_ratio": ""
    },
    {
        "title": "Learning about Fields in Maths. Question about (Zmod5, +, *) and (ZMod2, +, *)",
        "author": "AlKanNot",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8lfg9w/learning_about_fields_in_maths_question_about/",
        "text": "So I'm learning about fields in discrete mathematics and the lecturer mentioned the two fields (Zmod5, +, *) and (ZMod2, +, *). She mentioned how they are very important in CS because \"they \"behave like real numbers\" but are small enough to describe precisely using a finite number of bits\".\n\nI don't really understand this, could someone explain this in a bit more detail? or lead me somewhere that explains it well?\n\nThanks in advance.",
        "created_utc": 1527038906,
        "upvote_ratio": ""
    },
    {
        "title": "Help Tracking Points Across Photographs",
        "author": "simonettaspaghetta",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8lf2h8/help_tracking_points_across_photographs/",
        "text": "Hi–I'm working in a lab that is studying a type of marine parasitic fungi that infects a specific species of encrusting reef algae (CCA). I am looking at how the fungal disease progresses temporally and spatially based on underwater photographs of fungal lesions that were taken at the beginning and end of a 13 day period. I want to pick specific points on the initial photographs and be able to find those same points on the final photographs. The problems that I am running into is that a reef is highly dynamic, and the \"before and after\" photographs were taken at varying heights above the reef, and at different angles. Does anyone know of a computer program that can track points across pictures, even when color, lighting, etc varies?",
        "created_utc": 1527035389,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an equivalent of Java encapsulation in C++?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8lezdd/is_there_an_equivalent_of_java_encapsulation_in_c/",
        "text": "[deleted]",
        "created_utc": 1527034612,
        "upvote_ratio": ""
    },
    {
        "title": "Which is the best book for Algorithms?",
        "author": "yetertuko",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ledvy/which_is_the_best_book_for_algorithms/",
        "text": "I'm wandering which book for algorithms to read and exercise on.I'm writing on C++. And i have some experience with algorithms.\n\n\nAlgorithms by  Robert Sedgewick\n\n\n\n\nThe Algorithm Design Manua by Skiena\n\n\n\n\nor Introduction to Algorithms?",
        "created_utc": 1527029352,
        "upvote_ratio": ""
    },
    {
        "title": "Equivalence of Backus-Naur form and Conjunctive form of grammars",
        "author": "Lewanted",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ldd9w/equivalence_of_backusnaur_form_and_conjunctive/",
        "text": "Hi!\nI need to figure out if an grammar in Conjunctive form could be equated to BNF. So far my research seems futile to prove or refute the claim that there is an equivalence. So I am turning to Reddit, maybe you will have a quick answer for me. Please, if possible back up your answer with an article or paper on the subject.\nThanks!",
        "created_utc": 1527021270,
        "upvote_ratio": ""
    },
    {
        "title": "Pros and Cons of ActiveMQ?",
        "author": "ALT173869",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ld54t/pros_and_cons_of_activemq/",
        "text": " From what I understand, is ActiveMQ a middleman that sends messages between entities such as an application and a database? ",
        "created_utc": 1527019625,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with an Assignment for class (C coding)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ld231/i_need_help_with_an_assignment_for_class_c_coding/",
        "text": "[deleted]",
        "created_utc": 1527018985,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Science Bachelor Elective Units Help",
        "author": "easeypeaseyweasey",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8l8tdk/computer_science_bachelor_elective_units_help/",
        "text": "TLDR: Is it worth taking math units as electives if I have the option to do no electives and instead have 2 semesters with only 3 units instead of 4. \n\nMy main question is what would you computer scientists that have a bachelor do in this situation: I am just finishing up a general bridging course to help get me into computer science bachelor. I am undertaking a double major in programming and data science. In my course there are 2 compulsory math units: Calculus and Linear algebra 1, Discrete Mathematics and 3 computer science units relating directly to math: Data Structures and Algorithms, Programming Paradigms and Algorithms in Machine Learning. Obviously every unit will relate to math in some way or another but those are the ones that strike me as heavy computer science math. Because my bridging course included two electives one introductory math unit and I took a business unit as well to see if that was something I may be interested in(it was not). I now have a choice, I can undertake 2 electives being Calculus and Linear Algebra 2 and Introduction to Programming in The Sciences which includes \"an in-depth study of algorithms for common tasks in numerical analysis which could include: solving linear equations, interpolation, root finding, least squares curve fitting, numerical integration, random numbers and Monte Carlo methods, and numerical solutions to ordinary differential equations.\" Or I can have 2 semesters with only 3 units.\n",
        "created_utc": 1526983105,
        "upvote_ratio": ""
    },
    {
        "title": "Are websites offering to do programming assignments for money safe to use?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8l41bm/are_websites_offering_to_do_programming/",
        "text": "[deleted]",
        "created_utc": 1526934812,
        "upvote_ratio": ""
    },
    {
        "title": "How would you teach someone to code in less than 15 minutes?",
        "author": "leviem1",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8l00u5/how_would_you_teach_someone_to_code_in_less_than/",
        "text": "For a research project about the Discourse of computer programming, I’ve decided to give a computer programming lecture, but I only have 15 minutes. \n\n\nI understand that I won’t be able to teach these students how to write their own programs in this timeframe, so I have two goals I’ve decided to try to accomplish. First, I want to discourage the misconception that one be “smart” enough to understand Taylor’s Theorem or Einstein’s Unified Field Theory to be capable of writing code. Second, I want to use the previous goal to motivate students to try to learn computer programming through a fun and exciting lecture.\n\n\nSo, in an effort to better understand which concepts I should cover, I ask that you please try to answer the following questions the best you can.\n\n\n* What has been the most exciting computer programming concept for you to learn? Why?\n* What has been the most useful computer programming concept for you to learn? Why?\n* What has been the most difficult computer programming concept for you to learn? Why?\n* What has been the most daunting computer programming concept that you faced while learning computer programming? Why? If applicable, how were you able to overcome this?\n* And finally, if desired, please let me know how many years of computer programming experience do you have?\n\n\nPlease let me know if you have any other recommendations or comments. Thank you!",
        "created_utc": 1526901292,
        "upvote_ratio": ""
    },
    {
        "title": "What's the business term for tech-based SaaS companies that build a comprehensive solution for an entire industry?",
        "author": "Sytadel",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kzbbc/whats_the_business_term_for_techbased_saas/",
        "text": "I.e. I'm a tech company. Rather than build \"the worlds best analytics platform,\" or \"the worlds best CRM platform,\" I instead build the world's best all-in-one solution for a given industry (e.g. [The Arts](https://www.tessituranetwork.com/), Utilities, Theme Parks). Sort of like vertical/horizontal integration but nothing to do with acquisitions.",
        "created_utc": 1526891670,
        "upvote_ratio": ""
    },
    {
        "title": "Too late?",
        "author": "Azyrei",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kyq3j/too_late/",
        "text": "Just finished junior year of college- is it too late to apply for a computer science internship anywhere for the summer? If I do not get an internship will it be detrimental to getting a job after I graduate? ",
        "created_utc": 1526883379,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a hard limit on how slow any computational system’s (conventional, emerging, or speculative) processing speeds could be?",
        "author": "DousedSun",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kykrm/is_there_a_hard_limit_on_how_slow_any/",
        "text": "",
        "created_utc": 1526881395,
        "upvote_ratio": ""
    },
    {
        "title": "Does every professional programmer work in a fully-featured IDE? Have students always used debuggers like GDB for C++?",
        "author": "asdff01",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kwtsc/does_every_professional_programmer_work_in_a/",
        "text": "My first question is \\(mostly\\) rhetorical, but why can't I find a step\\-by\\-step debugger for Python like GDB is for C\\+\\+? Am I Google illiterate? I expect to be wrong, and know that there are complex work\\-arounds for Python, for instance, to allow GDB to parse its code. It just surprises me that as a computer science student, it is so difficult to find what seems like a fairly common\\-sense tool.\n\nIf there are more options, I'm interested in hearing what they are. GDB is very useful, but incredibly difficult to interact with from a new\\-programmer perspective. Currently I am teaching myself Python over the summer, and a linter like 'Anaconda' in ST3 is pretty helpful, but doesn't provide the same utility as a program like GDB. Any input?",
        "created_utc": 1526862467,
        "upvote_ratio": ""
    },
    {
        "title": "Learn BY Programming (Learning about other topics beyond computer science, with computer science)",
        "author": "_yew",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kq3d4/learn_by_programming_learning_about_other_topics/",
        "text": "Hey people,\n\nSo, hopefully this isn't too vague, but I am about to begin medical school, and coming from an engineering/computer science background, and I am not exactly looking forward to the whole 'memorizing a ton of facts' aspects of medical school that I keep hearing about.  In terms of learning, I would always prefer to understand the basic concepts of a topic, and then apply the concepts further.  My experiences in engineering and computer science, I understand that the whole process of software development (and computer science?) sort of revolves around taking a huge problem and dividing it into smaller and smaller problems that can then be written as code.  So I am trying to think of exercises where I can apply computer science to medicine, and even more broadly, ways of applying computer science to other topics, to help learn new concepts fundamentally, in a way that is a little less mundane than rote memorization.\n\nI have been programming for more than like 8 years and studied biomedical engineering and computer science; I've also conducted a ton of biomedical research (4+ years).  I've developed a ton of quick 'skunk work' type software and through those experiences, I've learned a ton about programming, but I've also learned a ton about the problems I have had to apply programming to.  For example, we did a lot image processing on 3D images of the heart (from x-ray computed tomography).  Because of this, I was required to understand all the mechanics of the heart.  In terms of this experience, I was forced to break down the physiology of the heart into individual components, and then essentially write software around these components.  More importantly, I was able to toy with some of the parameters of my function and see how that effects my results, which in turn helped me better understand how the heart works.\n\nI was imagining building a programmatic human 'cell' or 'organ' system.  Then on days where I have to inevitable relearn cellular respiration or adipose metabolism,  I can pull up my 'cell' program and write some code and 'feed' my cell some glucose and sort of experiment with every step in the cellular process.  Maybe I can throw in some hormones and bring in the endocrine system too, if I am feeling crazy.  \n\nMy basic idea is that, one of the greatest ways to learn a concept is to teach it, and if you can teach a concept in a simplified and clear way, then that is a really good indicator that you have mastered that concept.  To me, computers are just big idiots that can be taught how to do complex tasks if they're given clear instruction (code).  Thus, if I can teach a computer how to be a cell or a heart or a liver, I should understand the concepts associated with these topics comprehensively. For the sake of this post, let's not get into the fact that we don't fully understand a human cell let alone an organ or a whole organism; I am only trying to put the concepts displayed in a textbook into functional code.\n\n\n\nSo I have some questions:\na.  Does anyone happen to know any software packages that might be able to streamline simulating cell mechanisms?  Preferably in Python or Javascript?  (I know C/C++ and Java, but ultimately, I don't want to have to spend a ton of time debugging, so I would rather deal with higher level languages)\n\nb.  And more broadly, does anyone have any experience with programming in the context of an unfamiliar topic, specifically just to learn about the topic?   Did you end up actually learning about the topic?  Or was it a huge waste of time?\n\nc.  Are there any really good examples that I can be pointed to, where educators apply computer science/programming paradigms to teach students biology in a more hands-on/tangible way?  (I know there are tons of examples of teachers using programming to help students learn math/physics)\n\n\nI realize, I might just be better off just joining a research lab and contributing code to their efforts, rather than arbitrarily try to create simulations of cells, purely just to learn, but I really believe programming can be used as a tool to make learning more exciting and tangible.\n\nSo!  Help me spicy up learning with programming!\n\n(If you read all of this post, I appreciate you)\n\n\n",
        "created_utc": 1526785293,
        "upvote_ratio": ""
    },
    {
        "title": "Summer Programming Challenges",
        "author": "iViscosity",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kp897/summer_programming_challenges/",
        "text": "So yesterday was my last day of high school and to prepare for majoring in CS next year I'd like to become more familiar with other languages. Right now I know Java and Lua the most but I'd like to be more familiar with the C languages, C, ++, and # as well as JS, Python, etc. I was wondering if anyone was able to find a decent source(s) to learn these languages and to delve deeper than just the basics. I'd like to learn GUI stuff, integration with other APIs, etc. \n\nIf you could share those with me, it'd be greatly appreciated!",
        "created_utc": 1526775407,
        "upvote_ratio": ""
    },
    {
        "title": "A weighted dependnet node must be ordered higher than all dependencies. A better order has a lower center-of-gravity. If weights change in realtime, whats a approximation of ordering efficient enough to handle a programming language's statistical garbage collection?",
        "author": "BenRayfield",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kn9t3/a_weighted_dependnet_node_must_be_ordered_higher/",
        "text": "Dependencies are constant as the nodes are immutable, but new immutable nodes can be added which point at existing nodes, and a node can be removed if its not a dependency of anything.\n\nEach node has a size (bits of memory) and a weight (value of keeping this node). A node occupies as much range of position as its size. Nodes are continuously reordered, allowing swapping any 2 nodes positions if both nodes are allowed to move to the position of the other. It may for efficiency be necessary to leave some wiggle space thats not used by any nodes since they can be different sizes. A node is allowed to move to a position between its nearest dependency below and node its a dependency of above.\n\nThis is of course an npcomplete problem. I dont want the best solution, just an approximation that will allow me to use this as a statistical garbage-collector where weight is how much an artificial intelligence wants to keep that node and everything it depends on. It has to update faster than a linear search over all nodes (I could allow maybe up to log squared cost per new node) since new nodes are added continuously, and other nodes weights are updated.",
        "created_utc": 1526756082,
        "upvote_ratio": ""
    },
    {
        "title": "Question about LeetCode problem involving DFS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kmtkf/question_about_leetcode_problem_involving_dfs/",
        "text": "In regards to this question on Leetcode: [https://leetcode.com/problems/word\\-search\\-ii/description/](https://leetcode.com/problems/word-search-ii/description/)\n\nYou need to find the words from a dictionary\\(a list of words\\) in a crossword puzzle. At first I thought I would do a BFS starting with the first letter of each word. However, the solution involves DFS, and I don't understand why you would use DFS if you are trying to find out if a word exists in a crossword puzzle.\n\nThank You!",
        "created_utc": 1526751972,
        "upvote_ratio": ""
    },
    {
        "title": "Could a game with better graphics in the future be programmed like Minecraft(sandbox wise) just with the blocks as small as the resolution?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8km7bb/could_a_game_with_better_graphics_in_the_future/",
        "text": "[deleted]",
        "created_utc": 1526746231,
        "upvote_ratio": ""
    },
    {
        "title": "I started reading about Blue Prism technology. Can someone explain to me how the technology works? What goes on in the backend? What are designs?",
        "author": "I_a_good_boy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kk15v/i_started_reading_about_blue_prism_technology_can/",
        "text": "",
        "created_utc": 1526718881,
        "upvote_ratio": ""
    },
    {
        "title": "Do operating systems protect you from software you install spying on you?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kjmsm/do_operating_systems_protect_you_from_software/",
        "text": "[deleted]",
        "created_utc": 1526712304,
        "upvote_ratio": ""
    },
    {
        "title": "What makes ftp the dominant file transfer protocol?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kisou/what_makes_ftp_the_dominant_file_transfer_protocol/",
        "text": "[deleted]",
        "created_utc": 1526701445,
        "upvote_ratio": ""
    },
    {
        "title": "What are the differences between each of the Decentralized platforms?",
        "author": "KTDev19",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kgm9p/what_are_the_differences_between_each_of_the/",
        "text": "Hey guys,\n\nI want to create a blockchain solution for a startup involved in healthcare\\-tech industry, and I haven't been able to speak to someone who is an authority on this type of stuff. Can someone please go through the difference between platforms like Ethereum, Hyperledger \\(and it's various implementations\\), Kadena, etc. Is one of these a subset of the other? **Am I making a valid comparison** by saying that I am choosing between let's say developing on the Ethereum network/Hyperledger Fabri**c, or is development on these two platforms not mutually exclus**ive? I just can't seem to find a straightforward answer on the net so please do inform me as if I know next nothing about this stuff. \n\nThanks, appreciate it any help I can get in advance.",
        "created_utc": 1526678511,
        "upvote_ratio": ""
    },
    {
        "title": "How do I do does not start with using RegEx",
        "author": "someonegivemealine",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kfny7/how_do_i_do_does_not_start_with_using_regex/",
        "text": "I'm trying to filter only the word et but not bet or wetter, if ya know what I mean",
        "created_utc": 1526670421,
        "upvote_ratio": ""
    },
    {
        "title": "If you were about to graduate college again, what languages/tech stacks do you think you'd be exploring, why?",
        "author": "chillercheeto",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8kc7rh/if_you_were_about_to_graduate_college_again_what/",
        "text": "For those who have graduated already, and working in industry. If you were a senior in college exploring new languages and tech stacks for building sweet projects, what would you be checking out and why?",
        "created_utc": 1526640247,
        "upvote_ratio": ""
    },
    {
        "title": "Cache question for Computer Architecture Class ( need help quickly! )",
        "author": "[deleted]",
        "url": "https://i.redd.it/8ds9iugq8ky01.png",
        "text": "[deleted]",
        "created_utc": 1526625818,
        "upvote_ratio": ""
    },
    {
        "title": "Redirect without leaving page",
        "author": "iphananatic313",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8k7wzi/redirect_without_leaving_page/",
        "text": "This might not make sense, but I am trying to redirect to a publicly hosted website, but use my host url. I know sometimes you can have an external site routed through your url, and I wanted to know if it was possible on a site you dont own.\n\nFor example you'd visit siteA, login, and be redirected to SiteB (publically hosted external site), but it would look like you are on siteA. This is not for any type of phishing scam, just a really niche tool.",
        "created_utc": 1526592467,
        "upvote_ratio": ""
    },
    {
        "title": "Library of Babel type compression?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8k5zcf/library_of_babel_type_compression/",
        "text": "[deleted]",
        "created_utc": 1526577533,
        "upvote_ratio": ""
    },
    {
        "title": "Some recommendations for a programming NewBie",
        "author": "adeebabbas",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8k5qbx/some_recommendations_for_a_programming_newbie/",
        "text": "Just graduated High School (3.5 months until Uni. kicks in). Strong Physics and Math. Just completed the whole \"Automate the boring stuff with Python\" book + course + completed approx. 60% of the MIT Edx Intro to python course and book.\nI am completely in love with it...I have bought a lot of Data Science and AI related courses on Udemy already and a lot of books too...Confused how to proceed. I really wanna get into AI/ML. Thanks for all the help:)",
        "created_utc": 1526575654,
        "upvote_ratio": ""
    },
    {
        "title": "What is the purpose behind 255?",
        "author": "SirShoeString",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8k143s/what_is_the_purpose_behind_255/",
        "text": "When talking about normal binary and hex numbers, the max is always 255 in decimal. Why this number and what is the purpose of this specific max?",
        "created_utc": 1526528285,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding a BNF grammar",
        "author": "Rabrg",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8k0dzc/understanding_a_bnf_grammar/",
        "text": "I'm teaching myself some material for an upcoming \"Concepts of Programming Languages\" course, and I'm currently writing a recursive-descent parser for [this grammar here](https://imgur.com/KzDfmSG).\n\nI believe that I'm able to follow everything - except for the lambda symbols.\n\nT', from my current understanding, only has the terminals '*' and '/', yet according to the parsing table, T' -&gt; Lambda has the terminals '+', '-', ')', and '$'.\n\nHow do the lambda symbols work?",
        "created_utc": 1526521253,
        "upvote_ratio": ""
    },
    {
        "title": "Trouble deciding",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8k0ca4/trouble_deciding/",
        "text": "[deleted]",
        "created_utc": 1526520824,
        "upvote_ratio": ""
    },
    {
        "title": "As a CS student, how do you take lecture notes?",
        "author": "LikkanChung",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jz7jk/as_a_cs_student_how_do_you_take_lecture_notes/",
        "text": "How do you primarily take and store notes during lectures?\nCloud storage with Word docs and OneDrive?\nCloud storage with Google Docs?\nGit? \nLaTeX?\n\nWhat OS do you use?\nWhy do you take notes the way you do? Speed? Features? Other reasons?",
        "created_utc": 1526510521,
        "upvote_ratio": ""
    },
    {
        "title": "How Computer Science Grads Can Job Hunt",
        "author": "Dice_Tech_Careers",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jz4l6/how_computer_science_grads_can_job_hunt/",
        "text": "[How Computer Science Grads Can Job Hunt Like Experienced Pros](https://insights.dice.com/2018/03/28/how-computer-science-grads-job-hunt-experienced-pros/?CMPID=SM_FB_UP_JS_US_OG_)",
        "created_utc": 1526509784,
        "upvote_ratio": ""
    },
    {
        "title": "Programmers: How much RAM do you need?",
        "author": "adeebabbas",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jx6sj/programmers_how_much_ram_do_you_need/",
        "text": "",
        "created_utc": 1526494633,
        "upvote_ratio": ""
    },
    {
        "title": "NOOB Developer need your help !!!",
        "author": "nader002",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jx5v1/noob_developer_need_your_help/",
        "text": "thank your for checking my FIRST post EVER !!i need your help dear developer in choosing my specialty i have been studying development for 3 years and for the next 2 years i need to select a specialty from \\( Businesses intelligence , web development , Security,Mobile development or  Cloud  \\) please can u give me your opinion about the best specialty of them ? and how is the job market for them! thanks  ",
        "created_utc": 1526494435,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a field of study in computer science in ranking objects or classes?",
        "author": "bayhack",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jwmgp/is_there_a_field_of_study_in_computer_science_in/",
        "text": "I keep trying to google this but it keeps trying to be algorithms to actually rank other algorithms. \n\nI'm looking more of a way to create a mathematical function or an algorithm to rank generic items based on chosen criteria. And how to weigh that criteria against each other.\n\nI can make my own naive attempts. But I was hoping there was best practice or more complex theories on this.\n\n\nEDIT: \nJust to be clear I'm NOT trying to make a page rank or subjective algorithm to rise to the top of some feed.\n\ni have a listing of physical devices with attributes such as network speed, color, locations, tolerances, precision and etc.\n\nThese devices need to be ranked, grouped and then distributed.\n\nRight now my company is trying to find the best way to rank them.\n\nSo far I have made a mathematical function that just does simple weighting. but after mulling over it a few days it just feels too naive. like there should be some more rigid theory behind it or structure to ranking items - over just sorting them. But I guess ranking is sorting.\n\nIf anything this post tells me to dive deeper into my problem and try to extrapolate more of what I'm really trying to do.\n\nEverything in this space seems to be about ranking with time and upvotes as a factor like reddit or fb or news feeds. \n\nI believe in my own research \"information retrieval(IR)\" comes close? \n\nEDIT EDIT: After talking with my partners I'm able to reveal a bit more but it's not much. \n\nOnce again I'm asking on theories on ranking items, nothing for my specific problem. ",
        "created_utc": 1526490499,
        "upvote_ratio": ""
    },
    {
        "title": "What is a programming case study and how do I prepare?",
        "author": "CollectorsEditionVG",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jr1xx/what_is_a_programming_case_study_and_how_do_i/",
        "text": "I've been out of the industry for quite a few years and recently started looking to get back into web development again.\n\nI have a interview on Thursday and they say that there will be a programming case study that will take around an hour.\n\nI have no idea what to expect with this as I've never had to take part in one before, my skills are a little rusty as well even after going through a couple of refresher courses.\n\nCan anyone give me any advice on what to expect and how to prepare.",
        "created_utc": 1526434213,
        "upvote_ratio": ""
    },
    {
        "title": "Applying the pumping lemma to prove a language is not context-free",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jqjhx/applying_the_pumping_lemma_to_prove_a_language_is/",
        "text": "[deleted]",
        "created_utc": 1526429851,
        "upvote_ratio": ""
    },
    {
        "title": "Proving a language is not context-free",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jop9o/proving_a_language_is_not_contextfree/",
        "text": "[deleted]",
        "created_utc": 1526414777,
        "upvote_ratio": ""
    },
    {
        "title": "Amazon.com | Repel Windproof Travel Umbrella with Teflon Coating | Umbrellas",
        "author": "davonsidhom28",
        "url": "https://www.amazon.com/Repel-Windproof-Travel-Umbrella-Coating/dp/B0160HYB8S",
        "text": "",
        "created_utc": 1526360185,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a video somewhere showing, start to finish, building an app and putting it on the app store?",
        "author": "marketable_product",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jipig/is_there_a_video_somewhere_showing_start_to/",
        "text": "I'm only finding it in parts and never the full thing. Android or OSX is fine",
        "created_utc": 1526357165,
        "upvote_ratio": ""
    },
    {
        "title": "HELP_DEGREE-STUCK",
        "author": "tulaneng",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jgvp0/help_degreestuck/",
        "text": "Hey guys! Input would be greatly appericarted and experience.\n\nCurrently I am attending Tulane University. I have always been a fan of technology and computers and Tulane offers a degree in CS. But here is the down side...\n\nThe degree is called \"Applied Computing Systems &amp; Technology\" not CS. ALSO, its not offered through the main university, its through the continuing education program \\(school of professional advancement\\) even tho I am a full time student and take classes \\(core curriculum through main university\\).\n\nDo employers care if its offered through the \"part time status school\" and not through the regular university and would my chances of getting good salary jobs be hurt through it not saying a \"CS\" degree?\n\nIll take any constructive criticism and thoughts! ",
        "created_utc": 1526340339,
        "upvote_ratio": ""
    },
    {
        "title": "Does this chart imply that the lower level np-complete problems can not be reduced to upper levels one?",
        "author": "706buu",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jfa0d/does_this_chart_imply_that_the_lower_level/",
        "text": "[Chart](https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Relative_NPC_chart.svg/440px-Relative_NPC_chart.svg.png) in question. Sorry if the question is stupid or basic, I’ve just started on p/np. This was given as a way for proving np-completeness and I wanted to verify the question of the post with respect to the statement that every npc problem can be reduced to any other npc problem.\nEdit: *upper level ones.",
        "created_utc": 1526327466,
        "upvote_ratio": ""
    },
    {
        "title": "Do you need a course in Operating Systems before studying Distributed Systems?",
        "author": "monaghanboy",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jer2h/do_you_need_a_course_in_operating_systems_before/",
        "text": "I want to work through [this book](https://www.distributed-systems.net/index.php/books/distributed-systems-3rd-edition-2017/); I've taken courses in [Computer Networking](https://www.amazon.com/Computer-Networking-Top-Down-Approach-6th/dp/0132856204) and I've done all of [nand2tetris](http://nand2tetris.org/). \n\nI work in devops and infrastructure, and have read through many parts of [Nemeth's book](https://www.amazon.com/UNIX-Linux-System-Administration-Handbook/dp/0134277554). I understand [basic concurrency and synchronization](https://blog.yangmillstheory.com/posts/concurrent-memo/), and have passed interviews that emphasized this kind of programming.\n\nI was planning on doing [OSTEP](http://pages.cs.wisc.edu/~remzi/OSTEP/) first, but as I progress more in my own self-study, I've become more and more skeptical of a linear, prescriptive approach to learning new things, and I'd like to learn DS in a more top-down fashion. I hope that I'll pick up whatever obscure aspect of OS as needed and I'll have the requisite real-world experience such that it won't be too difficult.\n\nIs it advisable to go through [DS](https://www.distributed-systems.net/index.php/books/distributed-systems-3rd-edition-2017/), picking up what's needed from OSTEP on demand, or should I invest 3-4 months in OSTEP first?\n\nEDIT: I should say I've done a bit of OSTEP: everything up to address spaces, then I started a new job and got busy.",
        "created_utc": 1526323576,
        "upvote_ratio": ""
    },
    {
        "title": "Linux From Scratch... Worth it?",
        "author": "cellosumatra",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jekkl/linux_from_scratch_worth_it/",
        "text": "Hi, people.\n\nI'm 20 years old and next year im going to start computer science degree at my country \\(argentina\\). The thing is that, altought i know just a little bit about programming \\(i did some java introductories and a python course from the mit opencourse ware\\) i am taking serious the idea of making my own linux from zero, just to learn how is made an operating system and of course, to improve my computational knoledge ;D\n\nThe thing is, i just have only one computer \\(the laptop from which i write\\) and i dont have a real big budget, but maybe i can do an effort and buy me a new one. I would like to know some considerations and recommendations for this. Does it worth the project linux from scratch for a person like me? with junior level programation? Would it be useful this for practice for my computer science degree?And last, but not least, should i make a little effort and buy me a new laptop and start working?\n\nThank you to you all, and sorry if my english is a little unreadable :\\(",
        "created_utc": 1526322204,
        "upvote_ratio": ""
    },
    {
        "title": "Monty hall problem ?",
        "author": "1100100011",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jb9wj/monty_hall_problem/",
        "text": "Everyone of us already knows what it is so I won't be telling that again.\n\nSuppose I choose  a door  , the probability I am right is  1/3 and I am wrong is  2/3 .\n\nThe game show host now chooses to open a door that doesn't have the prize behind it.\n\nNow there are two doors  , the one  that I chose and the other one that I can switch to if I want. Why is the probability of    the prize being behind one of these doors not equally  1/2  each  ??\n\nWHY  ????",
        "created_utc": 1526294645,
        "upvote_ratio": ""
    },
    {
        "title": "How do I turn this pseudo code into real code in C++?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8jb2sd/how_do_i_turn_this_pseudo_code_into_real_code_in_c/",
        "text": "[deleted]",
        "created_utc": 1526292043,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to recreate LEGO: Rock Raiders for the iPhone or Windows 10?",
        "author": "Profego",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j9ox5/is_it_possible_to_recreate_lego_rock_raiders_for/",
        "text": "Me and my brothers grew up with a game called LEGO: Rock Raiders created in 1999 on the computer. It came in disk form, and we have saved the game through the years. We’ve tried to run the game on windows 10, and we just can’t. Even in compatibility mode as an administrator. We’ve also tried it on his MacBook Pro, and nothing has worked there either. We’ve been looking for someone to recreate the game on the Phone, or at least for a newer form of windows (without the sketchy internet downloads). We have even contacted the Head Quarters of LEGO and they told us there’s nothing they can do because they no longer hold the rights to the game. Is there anyone out there who has played this game, and/or knows who to contact to recreate (even f named something else) this game idea? If you’ve never heard of it, I suggest you search YouTube for gameplay, or even the soundtrack. It’s such an amazing Real Time Strategy game, there is still a handful of people who want this done. Any advice on computer logistics if this is even possible to do, or advice about who to contact to see if it’s a possibility, is highly appreciated:) ",
        "created_utc": 1526272895,
        "upvote_ratio": ""
    },
    {
        "title": "Logic Circuit Help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j96u2/logic_circuit_help/",
        "text": "[deleted]",
        "created_utc": 1526267285,
        "upvote_ratio": ""
    },
    {
        "title": "Some questions for school project",
        "author": "NothingWithLimits",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j828w/some_questions_for_school_project/",
        "text": "I am wondering if you guys can help me by answering some questions for my high school project relating to careers in computer science. If you don't feel comfortable answering the personal information feel free to skip them [the project asks for this information, so it would help a lot if you don't skip them but I will understand if you do. Just don't skip your age, title, degree(s), years in the profession.] PM me your answers. The more that answer these questions the better, so if this post is couple days old feel free to answer these questions still.\n\nName:\n\nAge: \n\nTitle: \n\nDegree(s) earned: \n\nYears in profession: \n\n\nPlace of work/name of company: \n\n\nContact Information (Email or Phone Number):\n\n\nWhat college did you attend? How many years?\n\n\nHow many programming languages do you know how to write in? What are they?\n\n\nHow has your experience been working in this field?\n\n\nHow many hours do you work weekly? How are most of those hours spent (Working, have nothing to work on, side projects, etc.)\n\n\nDo you experience a lot of downtime at work? What do you do during this downtime? Do you have no downtime and are constantly working?\n\n\nHow stressful is your work?\n\n\nDid you ever have to pull an all-nighter to finish? How often?\n\n\nWhat are common mistakes that happen in your profession?\n\n\nWhat’s good advice for someone looking to get into this line of work?\n\n\nHave you ever thought about changing professions? Why?\n\n\n\nI want to thank you guys for helping me with my project, it means a lot to me.\n\n",
        "created_utc": 1526255869,
        "upvote_ratio": ""
    },
    {
        "title": "Study Recommendations for Upcoming Semester Courses",
        "author": "TheApatheticResolute",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j6vmg/study_recommendations_for_upcoming_semester/",
        "text": "Next semester my School schedule consists of these courses: \n* Computer Architecture and Assembly Language\n* Algorithms\n* Automata and Computability\n* Database Systems.\nThis summer I want to prepare for taking these classes. Do you guys have any recommendations for learning materials that i could study over the summer to prepare me for the courses. Course Textbooks for each class wont be posted for awhile.\nThanks",
        "created_utc": 1526244755,
        "upvote_ratio": ""
    },
    {
        "title": "Taking 9 hrs of summer credit courses (6 wks session) in Data Struct., Discrete Math, Comp Architecture while working full-time. Is it doable?",
        "author": "olidin",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j6cg5/taking_9_hrs_of_summer_credit_courses_6_wks/",
        "text": "Hello, I'm not a CS major but I'm a chemical engineer with a few years working experience. I have taken some MOOC courses in CS and feeling pretty okay with coding in general. However, I'm planning on taking the three courses at a community college before applying to Georgia Tech OMSCS. I want to take as many courses as I can in one summer session and I selected 3 courses:\n\n- Python Data Structures (3 hrs)\n- Discrete Mathematics (3 hrs)\n- Computer Architecture And Organization (3 hrs) \n\n**These courses are 6 weeks duration at Oakton Community College. I will also be working full time during this time (40-50 hrs/wk). How was your experience with theses courses in term of demand when you were an undergrad and what would you caution me or others about taking all 3 courses at once in such short time span?**\n\nMy plan B is to drop Comp Architecture. ",
        "created_utc": 1526240315,
        "upvote_ratio": ""
    },
    {
        "title": "What will be the value of k after the following code snippet runs ? need an eli5 kind of solution please",
        "author": "1100100011",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j44nr/what_will_be_the_value_of_k_after_the_following/",
        "text": "                                                        k := 0\n                                                                for i1 := 1 to n\n                                                                for i2 := 1 to i1\n                                                                ·\n                                                                ·\n                                                                ·\n                                                                for im := 1 to im−1\n                                                                k := k + 1",
        "created_utc": 1526221648,
        "upvote_ratio": ""
    },
    {
        "title": "Missing operating system?",
        "author": "PsychologicalMessage",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j22ja/missing_operating_system/",
        "text": "My computer is screwed up, I can't get to the login screen any more, Windows doesn't even finish loading. I deleted everything on the hard drive. I tried to fix it by booting from a linux USB but it just says missing operating system. How do I fix this error and install linux?",
        "created_utc": 1526192648,
        "upvote_ratio": ""
    },
    {
        "title": "Text editor vs IDE when coding",
        "author": "StevenJac",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j1sjw/text_editor_vs_ide_when_coding/",
        "text": "What's the difference between writing a code in text editor vs IDE? When should one use IDE over text editor and vice\\-versa?",
        "created_utc": 1526188634,
        "upvote_ratio": ""
    },
    {
        "title": "Going back to school for Computer Science. Need some advice please",
        "author": "BeerMePleez",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8j0uir/going_back_to_school_for_computer_science_need/",
        "text": "My job will reimburse me for tuition if I seek a CS degree. I have a bachelors in general studies but absolutely no background in CS. What concentration would you suggest for a beginner? Also, I contacted Southern New Hampshire University to seek a bachelors in cybersecurity online but they are suggesting since I already have a degree to pursue a masters instead. This seems like a very bad idea to me considering I have no background in CS. ",
        "created_utc": 1526177593,
        "upvote_ratio": ""
    },
    {
        "title": "Buffer Overflow Attack",
        "author": "blowmybuffer",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8izyxd/buffer_overflow_attack/",
        "text": "I am trying to restore the stack after my buffer overflow attack in my x86 assembly code. I know the stack frame size. Should I try to get my %rbp and %rsp to be the caller's function or main? Also, how would I go about writing this portion of x86 assembly code to restore the stack, knowing that %rsp is correct after my shell code, but my %rbp has been overwritten and is no longer correct?\n\nThanks!",
        "created_utc": 1526169055,
        "upvote_ratio": ""
    },
    {
        "title": "\"Open code\" but still retain all copyrights on it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8iymar/open_code_but_still_retain_all_copyrights_on_it/",
        "text": "[deleted]",
        "created_utc": 1526156068,
        "upvote_ratio": ""
    },
    {
        "title": "In what order should I take my CS/math classes so that I am building up difficulty/steps rather than jumping right into it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8iylhk/in_what_order_should_i_take_my_csmath_classes_so/",
        "text": "[deleted]",
        "created_utc": 1526155873,
        "upvote_ratio": ""
    },
    {
        "title": "How much timekeeping inside racing (or time-critical) videogames is accurate? And how is it achieved?",
        "author": "saroche",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ivhvf/how_much_timekeeping_inside_racing_or/",
        "text": "",
        "created_utc": 1526125220,
        "upvote_ratio": ""
    },
    {
        "title": "Explain polynomial reductions like I'm 5?",
        "author": "melwop",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8iryj7/explain_polynomial_reductions_like_im_5/",
        "text": "Hello, I just don't quite understand the nitty gritty of polynomial reductions. When I want to prove that something is NP-Complete, I can pretty easily prove it is in NP, but making a reduction is a struggle. I understand that \"making one problem look like another\" is generally what I aim to do, but can someone explain this more in detail and maybe provide an example? Thanks!",
        "created_utc": 1526079280,
        "upvote_ratio": ""
    },
    {
        "title": "Confused with NS and SOA DNS records and how to set a root dns server",
        "author": "kamalist",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8iofuw/confused_with_ns_and_soa_dns_records_and_how_to/",
        "text": "I'm somewhat confused with what a SOA record does and needs for. I know that NS points to the NS responsible for a zone and is used in recursive requests, but when is SOA information used?\n\nAlso I'm somewhat confused with how I should configure a local name server to use some server as a root name server. Let's suppose I have some local domain zone \"testzone\". Should I make SOA or NS record for \"testzone\" zone in my local name server for recursive requests to work?",
        "created_utc": 1526051050,
        "upvote_ratio": ""
    },
    {
        "title": "Help",
        "author": "Ating1",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8in211/help/",
        "text": " The font on my desktop changes on its own, and I have been trying to update the display driver in order so correct this, but all trials have been to no avail. The laptop is a Lenovo ideapad 100. Please I'm in need of a solution. ",
        "created_utc": 1526038773,
        "upvote_ratio": ""
    },
    {
        "title": "We're recruiting mods for /r/csmajors!",
        "author": "LLJKCicero",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8imqbh/were_recruiting_mods_for_rcsmajors/",
        "text": "Hi there! In cooperation with the mod team of /r/cscareerquestions, /r/csmajors is being [rebooted and revived](https://www.reddit.com/r/cscareerquestions/comments/8hzdvk/official_new_rule_collegespecific_questions_now/) from its current state that could be generously described as \"technically living\". As part of that, we are seeking new mods for /r/csmajors that are interested in building a helpful and thriving community.\n\nYou can probably guess what /r/csmajors is about from its name: mostly people taking computer science classes in university. Closely-related topics are also kosher, like high school CS classes, or internships.\n\n**What are we looking for in mods?** Well, the first pass is that we want people who are currently or were formerly majoring in computer science or a related field where they took CS classes, such as computer engineering, information science, applied math, etc. We also want people who have an interest in the topic and an interest in helping people, obviously, prior modding or similar administrative experience is a plus but not required, but **the biggest thing we're looking for -- and will be looking at -- is having a long history on Reddit of productive contributions on subjects related to /r/csmajors**, which is why we're posting on this sub.\n\nNow, modding can be a fair amount of work, and you don't get much in return, other than SimCity-like feels of watching a community that you're nurturing thrive under your most excellent wisdom. So please don't apply lightly. Remember: the internet is ~~dark and full of terrors~~ serious business.\n\nIf you're still interested, please fill out **[THIS FORM](https://goo.gl/forms/eJFNvRSoatFiTv0C3)**, telling us about yourself and what you'd bring to the table. We look forward to hearing from you!\n\n*(posted with mod permission)*",
        "created_utc": 1526035039,
        "upvote_ratio": ""
    },
    {
        "title": "We Live Entertainment | Exclusive Film Reviews, Interviews and Festival Coverage",
        "author": "BelindaJohnmanj",
        "url": "http://weliveentertainment.com/",
        "text": "",
        "created_utc": 1526031370,
        "upvote_ratio": ""
    },
    {
        "title": "Difference between Big-Oh and Little-Oh",
        "author": "TheSmilingLad",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ikyxm/difference_between_bigoh_and_littleoh/",
        "text": "[removed]",
        "created_utc": 1526011567,
        "upvote_ratio": ""
    },
    {
        "title": "What algorithms and design patterns should a programmer be familiar with for solving frequently encountered problems?",
        "author": "MaleficRage",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ikqyz/what_algorithms_and_design_patterns_should_a/",
        "text": "Setting aside essential data structures such as hash tables, stacks, queues, trees and their respective search algorithms, what should a good programmer keep in their repertoire for problems they are likely to frequently encounter?\n\nRecommendations on good books would be appreciated as well.\n\nThanks.",
        "created_utc": 1526009179,
        "upvote_ratio": ""
    },
    {
        "title": "Why students are not choosing information security as their major?",
        "author": "simply_a_student",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ikpfq/why_students_are_not_choosing_information/",
        "text": "Hello, everyone.\nThis is my first post on reddit. Hope, I am in right place. I am going to University of Toronto for Computer Science. I have an option to get specialized degree in information security. Should I do this? Or is it better to choose another specialization in computer science? ",
        "created_utc": 1526008733,
        "upvote_ratio": ""
    },
    {
        "title": "Giving recurrence to an algorithm",
        "author": "Thundertusk5",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ihiv8/giving_recurrence_to_an_algorithm/",
        "text": "Im doing some exercises revolving recurrence and I'm stuck on this one.\n\nhttps://imgur.com/a/HbR4io6\n\nI would appreciate if someone could explain/help me with this one. I think the question is worded wierdly and can't grasp it fully.",
        "created_utc": 1525980334,
        "upvote_ratio": ""
    },
    {
        "title": "How can one implement the multithreading feature from scratch?",
        "author": "seeker256",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ih7vj/how_can_one_implement_the_multithreading_feature/",
        "text": "I don't need the entire procedure. Just an outline would suffice.\n\nEdit: From scratch \\- I am writing an Unikernel on which I want to run a basic webserver. I have interrupts, packet transmission and reception working. So, the skeleton is complete and the inside the kernel I have a very minimal functionality. To speed up the the packet exchange, I want to implement the Multithreading feature but without assuming any underlying OS functionality. ",
        "created_utc": 1525977931,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to avoid brute force (exercise)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ifzkd/trying_to_avoid_brute_force_exercise/",
        "text": "[deleted]",
        "created_utc": 1525967925,
        "upvote_ratio": ""
    },
    {
        "title": "jobs within computer science that might require working with your hands or building something?",
        "author": "GalacticLawnmower",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ibiv7/jobs_within_computer_science_that_might_require/",
        "text": "I'll be blunt, programming was never my thing growing up, instead I wasted my childhood learning how to draw human antomy and playing around with new mediums to create sculptures in. This has led to the predicament that I have no lucrative or useful skills, noticing this my father pushed me towards the same route he took, software development, as I did well in ap com sci in high school. I'm currently in my first year and I'm getting mostly good grades at Uni, but my fear is that since I have no passion for my major and computer science is a uphill battle, that I will burn out or hate my job in the near future.\nIn order to avoid this mostly inevitable result, i decided to analyze why i like art, it's not because I desire to spread some sort of message, but rather the technical side. I love working with my hands and creating a projects from nothing, I also did a lot of robotics and basic circuitry stuff at school that I loved doing, with computer science this connection is harder to find as there is the disconnect between the screen and yourself. Are there any jobs or pathways I allow you to build something with your hands",
        "created_utc": 1525918474,
        "upvote_ratio": ""
    },
    {
        "title": "Dinero cache simulator for different types of caches.",
        "author": "Formal2",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8ia5b1/dinero_cache_simulator_for_different_types_of/",
        "text": "If you can just point me in the right direction I would really appreciate it. I'm having trouble finding any sources that show how to create an input to simulate different types of caches.\n\nI am looking for someone who has experience using Dinero Cache simulator.\nI want someone to use the simulator to generate some data for 4 different types of caches:\nVictim cache, filter cache, loop cache, and trace cache.\nThe data should also vary in some ways for example using different L1 or L2 cache sizes, or different associativities.\nYou should also explain how the caches compare and differ from one another.\n",
        "created_utc": 1525905571,
        "upvote_ratio": ""
    },
    {
        "title": "When using \"shared memory\" (unix IPC), should I use semaphores?",
        "author": "Menesio",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i7sas/when_using_shared_memory_unix_ipc_should_i_use/",
        "text": "Hi folks!\nI've been taught in my first OS class that whenever two processes share a resource, a race condition may occur, and therefore we should do something about it. We've been taught that semaphores often are the best solution, and soon they'll teach us how to use them practically (after we've studied the \"theory\").\nIn the mean time we're also seeing IPCs programming, in particular, shared memories. We use C and we use some built-in functions to work with them (shmget, shmat...)\n\nNow, shared memory looks a lot like a \"shared resource\" our teacher warned us against.\nShould I use a semaphore when I use this stuff? Because in the PDFs we are given, they don't. Are IPCs \"built\" to be good enough to have no risk of RC?\n\nThanks!\n\nEDIT: some grammar",
        "created_utc": 1525886886,
        "upvote_ratio": ""
    },
    {
        "title": "Weak RSA keys",
        "author": "hermlon",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i6l3f/weak_rsa_keys/",
        "text": "Is there something where weak RSA keys are still being used? By weak I mean some which could be factorized in a month by a good consumer computer.",
        "created_utc": 1525877588,
        "upvote_ratio": ""
    },
    {
        "title": "What is the \"correct\" result for the intersection of two arrays?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i509o/what_is_the_correct_result_for_the_intersection/",
        "text": "[deleted]",
        "created_utc": 1525862924,
        "upvote_ratio": ""
    },
    {
        "title": "Why cant Spectre read privileged memory whereas Meltdown can?",
        "author": "pearisgreen",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i4jf4/why_cant_spectre_read_privileged_memory_whereas/",
        "text": "Hi,\n\nmy question is why is this implementation of the [meltdown](https://github.com/IAIK/meltdown) exploit able to read privileged memory/kernel memory and this implementation of [spectre](https://gist.github.com/Badel2/ba8826e6607295e6f26c5ed098d98d27) is not? More specifically: why can out of order execution where you try to read privileged memory into a register and extract that information via a side channel be used to to read all the memory in your ram and speculative execution can only be used to read memory bound to that process via branch misprediction.\n\nWhat differentiates branch misprediction from out of order execution,  so that meltdown can do more than spectre. \n\nIf possible i would really appreciate an extensive answer :\\)",
        "created_utc": 1525856878,
        "upvote_ratio": ""
    },
    {
        "title": "Online computer science degree in Germany?",
        "author": "schumannop44",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i2xrp/online_computer_science_degree_in_germany/",
        "text": "I was wondering if anyone had any ideas about good online schools based in Germany to complete a computer science degree tuition free?",
        "created_utc": 1525837004,
        "upvote_ratio": ""
    },
    {
        "title": "Need help understanding a question.",
        "author": "MellowRacoon",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i1nx0/need_help_understanding_a_question/",
        "text": "I have been given this question as an example for my exam paper coming up. [https://imgur.com/iycW8hI](https://imgur.com/iycW8hI)   \n\nHowever, I don't understand what I am supposed to do with it. I can't find out what EORing means because nothing comes up about it online at all. I don't know what I am supposed to do with CS102 either. I can convert hex, dec, binary and ASCII but nothing makes a real word, so i dont think im decoding the message right. Could someone point me in the right direction.",
        "created_utc": 1525824984,
        "upvote_ratio": ""
    },
    {
        "title": "Virtual Box privacy?",
        "author": "crypto-anarchist86",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i1m3x/virtual_box_privacy/",
        "text": "So I'm installing linux in a virtual box on a windows host machine and I was curious to know something. As I understand it, should my virtual box be compromisedin anyway, it's not that big of a deal since nothing can get out of that container and effect my host machine. But does it work the other way as well? \n\nFor instance, if I want to use the VB for privacy and install crypto wallets and store passwords and sensitive files on my virtual box, should my host computer (windows) become compromised does that also compromise the data I've got saved in my VB? \n\nI'm new to linux and wanted to play around with it and experiment with a few things before I committed to ditching windows all together.  So right now, I still use windows for my daily stuff. I do some marketing for clients on Facebook and I enjoy some Google products as well. I'm typically pretty careful about not downloading from unknown sources etc...but mu logical mind tells me the set up would be best the other way around. Run windows in the VB and do my public daily business there and keep that environment separated from my host linux environment where I may want to keep more private data stored and completely encrypt the disk. \n\nAm I over thinking all of this or am I on to something? ",
        "created_utc": 1525824554,
        "upvote_ratio": ""
    },
    {
        "title": "New Laptop",
        "author": "Thefast3869",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i1i6x/new_laptop/",
        "text": "Im going to need a new laptop for my freshmen year of school and I am majoring, well, in CS. Any recommendations?",
        "created_utc": 1525823573,
        "upvote_ratio": ""
    },
    {
        "title": "Question about exception vector tables (ARM assembly)",
        "author": "SuspiciousDimension",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8i0o51/question_about_exception_vector_tables_arm/",
        "text": "Just wondering regarding exception vector tables, my lecturer gave the example of: \n\nLDR\tr4, =0x40000024\t; 0x40000024 is mapped to 0x00000024\n\nLDR\tr5, =UndefHandler ; Address of new undefined handler\n\nSTR\tr5, [r4]\t; Store new undef handler address\n\nIt's the only part I can't figure out, is why the address 0x40000024 maps to 0x00000024 and also, why that's the address for the undefined handler when just a few slides earlier, it states the address for undefined handler is at 0x00000004\n\nAny help would be majorly appreciated, thanks.\n\nedit: formatting",
        "created_utc": 1525816407,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a guide or list for MOOCs, courses, or books to self learn an entire CS degree?",
        "author": "EmergencyError",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hyp82/is_there_a_guide_or_list_for_moocs_courses_or/",
        "text": "Obviously I know self learning isn't the actual same as doing a degree, but I'd like to get as close as I can to getting a complete education without being able to re-attend university",
        "created_utc": 1525801613,
        "upvote_ratio": ""
    },
    {
        "title": "How can I tell whether a language is regular, context-free or decidable/recognizable just by looking at it?",
        "author": "ilovetoprogrum",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hy56l/how_can_i_tell_whether_a_language_is_regular/",
        "text": "I've had a [series of questions](https://imgur.com/a/hk0ph2a) that involve me looking at the description for a bunch of languages and gauging what type of language they are. For some I can tell, for example, if the description involves pattern matching it's probably not regular because NFAs/DFAs do not have memory and there's some such as ATM and ATM's complement that I can memorize off the top of my head however how can I just look at languages like this and immediately determine what type they are? ",
        "created_utc": 1525797591,
        "upvote_ratio": ""
    },
    {
        "title": "How do I produce regular expressions from grammar rules?",
        "author": "ilovetoprogrum",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hxnyz/how_do_i_produce_regular_expressions_from_grammar/",
        "text": "I have a question in a mock exam that wants me to convert a grammar into regular expressions and it appears like I do it right however when I check the solution it's wrong. [Here](https://imgur.com/a/aJw2y4t) it is. I tried creating NFAs for the grammar to make it easier to convert it to a regular expression. The solution to the first one is (10)* + (10)*1. Where does the union come into this and why is there a 1 concatenated onto the end? The answer to B is essentially the reverse. I'm not sure how we get to this answer. ",
        "created_utc": 1525794068,
        "upvote_ratio": ""
    },
    {
        "title": "How do I convert this NFA to a regular expression? I keep going wrong.",
        "author": "ilovetoprogrum",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hx9rb/how_do_i_convert_this_nfa_to_a_regular_expression/",
        "text": "I've posted a few questions on this before but for whatever reason I cannot follow the logic for how solutions are made. [Here's](https://imgur.com/a/vP90wOo) my attempt along with a solution for a practice question I have done. Where exactly am I going wrong? I could actually follow the solution up until the remove C step. It's like the previous steps were removed and the equivalent RegEx was made but removing C spawns more regexes than makes sense? Is there a simple step-by-step formula for doing these? ",
        "created_utc": 1525791005,
        "upvote_ratio": ""
    },
    {
        "title": "FAT and Sectors Calculations help",
        "author": "WelshHeart",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hvl49/fat_and_sectors_calculations_help/",
        "text": "Not sure if this question belongs here, but I'm currently doing a networking module as part of my CompSci course. I thought the people of this subreddit may be able to help.\n\nOne of the practice test questions I have for this module are as follows:\n\n&gt;A particular computer filing system uses a 22\\-bit number to keep track of disk sectors, in a structure equivalent to a File Allocation Table. If a sector is the smallest allocatable unit of disk space, and a sector is 512 bytes in size, the maximum disk size this filing system could cope with would be:  \n&gt;  \n&gt;A\\) 256 Mbytes.  \n&gt;  \n&gt;B\\) 512 Mbytes.  \n&gt;  \n&gt;C\\) 1 Gbyte.  \n&gt;  \n&gt;D\\) 2 Gbytes.  \n&gt;  \n&gt;E\\) 4 Gbytes.\n\nDo you know which is the correct answer, and how I go about calculating this? I've gone through all the given course material, and I can't find anything on it. Googling only seems to confuse me more.",
        "created_utc": 1525774602,
        "upvote_ratio": ""
    },
    {
        "title": "Blockchain help?",
        "author": "opete",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hugrn/blockchain_help/",
        "text": "I've got project where I'm to build a very basic blockchain and implement it myself, however, I have no idea how to implement it.\n\nThere are lots of guides on how to do it easy \"in under 200 lines of code,\" but they don't really talk about the networking side of things. The network side is where I'm the most lost.\n\nIt's my first year in my CS program and I'm just now finishing up my first programming classes and intros to CS, so I haven't really done any in-depth networking. I learned about basic networking things like the TCP/IP and the whole internet suite and such, but I've not done much in the way of building or making anything.\n\nWe just have to simply make a simple chain and have it run and show proof that it ran. I can make the files and build it conceptually in a programming language, but I'm not sure about the networking or web implementation.",
        "created_utc": 1525759373,
        "upvote_ratio": ""
    },
    {
        "title": "Does the Master's Theorem",
        "author": "GGLionCross",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hu8xp/does_the_masters_theorem/",
        "text": "When using the Master's Theorem to solve recurrence relation, how do you find little\\-Theta? I understand big\\-O is equal to n\\^d if d \\&gt; log\\_b{a} , big\\-O is equal to n log n if d = log\\_b{a} , and big\\-O is equal to n\\^{log\\_b{a}} if d \\&lt; log\\_b{a} but I couldn't find a good explanation about how to get little\\-Theta from this?\n\nFor example, the recurrence relation T\\(n\\) = 3T\\(n/2\\) \\+ n\\^2 , a = 3 , b = 2 , d = 2 so the case is 2 \\&gt; log\\_2{3} so that would mean T\\(n\\) = O\\(n\\^d\\) = O\\(n\\^2\\). How would we find θ?\n\nThanks in advance for any kind of help! I'm trying to understand this for my midterm coming up sometime soon if you're wondering.\n\nEdit: Or would we even use the master's theorem? Other solutions we learned would be the tree method and iteration.",
        "created_utc": 1525756693,
        "upvote_ratio": ""
    },
    {
        "title": "BitTorrent Seeding Protocol",
        "author": "Codejacker",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hta57/bittorrent_seeding_protocol/",
        "text": "What is the BitTorrent protocol for seeding? How does the client tell the tracker that it is ready for seeding?",
        "created_utc": 1525746691,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a historical weather database (digital)",
        "author": "Saxaclone",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hqfcx/looking_for_a_historical_weather_database_digital/",
        "text": "Hey y'all, \nLong story short, my brother's got a chronic illness and he's got an extensive log of symptoms with associated magnitudes going back a few years. I want to plot/analyze these data against the daily  temp / humidity / etc where he lives. I have a good parser written for his data, now I'm wondering if there's a good place to find digital data weather data for a specified zipcode or lat. + long. and going back a few years. \nOk, thanks so much!\n",
        "created_utc": 1525722871,
        "upvote_ratio": ""
    },
    {
        "title": "Why does my university not have any math requirements for a Bachelors of Computer Science degree?",
        "author": "MillionDollarBooty",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hp9vx/why_does_my_university_not_have_any_math/",
        "text": "All my uni requires is college algebra for gen ed and statistics for the major. It was my understanding that most universities require you to take at least calc 1 &amp; 2 and some even require you take discreet math.\n\nI know they have these classes available because they are requirements for a math major. \n\nIs this common for smaller universities to not require math classes in their computer science programs?\n\nWould it be beneficial for me to take the higher level math classes even though they are not required?",
        "created_utc": 1525714139,
        "upvote_ratio": ""
    },
    {
        "title": "CS and Entrepreneurship",
        "author": "AbsurdCactus",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hohcj/cs_and_entrepreneurship/",
        "text": "I am currently majoring in entrepreneurship at my university (Ball State) and have spent a lot of time researching the best minor to compliment my degree. \n\nOur entrepreneurship program is exceptional, but it is very apparent that most ideas seniors come up with are limited to physical products and services, since most lack experience with computer software. The more I look into CS, the more I see how beneficial switching majors could be, from both an employee and entrepreneurial perspective. \n\nI'm wondering if anyone could give me some experiences to help prove/contradict this assumption, as well as answer a few questions:\n\n1. How much would someone be able to fully comprehend CS with just a minor? \n\n2. What would be the significant pros and cons of switching from an entrepreneurship major to a CS major?\n\n3. How many people do you personally know who majored in CS and then contributed to a startup in some way (from founding to being a key member)?",
        "created_utc": 1525707996,
        "upvote_ratio": ""
    },
    {
        "title": "Certificate worth it?",
        "author": "Amaspharos369",
        "url": "https://www.reddit.com/r/AskComputerScience/comments/8hoftg/certificate_worth_it/",
        "text": "A co worker of mine brought the idea of getting a certificate instead of going to school for System analytics. Just want opinions on earning a certificate as opposed to earning a bachelors degree. ",
        "created_utc": 1525707662,
        "upvote_ratio": ""
    }
]