[
    {
        "title": "Where can I find material interactions datasheets?",
        "author": "whatisthis_whoami",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119orox/where_can_i_find_material_interactions_datasheets/",
        "text": "Hey everybody, I am not an engineer but I'm in environment bio. I am currently working in a new position and I'm looking to get some hardware that will be in touch with very oxygenated water. The first prototype I was presented used stainless steel and I might only be able to get the hardware in nylon. \n\nI remember from my college years taking a course about industry/instruments/chemistry (?) very vaguely, but I do remember one thing in particular. We covered how certain materials are much better for containers/tubing for other specific materials. I remember vividly tables where on the horizontal line you'd of a particular material (i.e. milk) and the vertical lines a bunch of different materials generally used for tubing (i.e. stainless steel, PVC etc.). The interaction between the materials was marked between 1-5 (I believe) indicating which material would be suited to be used. With something like 1 being extremely poor, 5 being perfect for it. I believe those datasheets were very available to the public and doing some assignments with them. \n\nDo I remember this correctly? Is it just a dream? lmao\n\nPlease help me find them and what they're called.\n\nThanks!",
        "created_utc": 1677127634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning about Slaughterhouse Machines",
        "author": "Late-Effect-021698",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119mm1q/learning_about_slaughterhouse_machines/",
        "text": "[removed]",
        "created_utc": 1677121414,
        "upvote_ratio": 1.0
    },
    {
        "title": "a display that interfaces via rgb or lvds ports, needs additional logic right? what are they using? does exist any sort of (cheap) open design?",
        "author": "randomusername11222",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119lzf0/a_display_that_interfaces_via_rgb_or_lvds_ports/",
        "text": "I assume some kind of display driver ic, but last time that I checked were overly complicated and expensive, but idk",
        "created_utc": 1677119748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lockheed Martin offer in New Jersey location. yes or no?",
        "author": "Extension_Ad2146",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119lw2t/lockheed_martin_offer_in_new_jersey_location_yes/",
        "text": "[removed]",
        "created_utc": 1677119498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strain gauge measurement for pressure",
        "author": "LowqualitySituation",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119lgjc/strain_gauge_measurement_for_pressure/",
        "text": "I’m having trouble understanding and applying a strain gauge pressure transducer, tue sensor is no longer manufactured and I cannot get a data sheet for it. Here’s what I have \n\n-Psi range 0-200 psi\n-Full scale output Sensitivity 3mv/v\n-350 ohm, full bridge resistance \n-Supply voltage 5v\n\nUsing an NI DAQ software. Here’s my basic idea…\n\nAt 200psi, I should get a reading of 15mv outputting from the sensor (3mv/v *5v excitation) so, if I set up a lookup table to take the output from my sensor and convert it to psi, basically I would say the slope would be 200psi/15mv = 13.33psi/mv.\n\nHowever, this scaling factor of 13.33 does not work, instead I have to scale by 60. This seems like such a large error to be a calibration issue, what am I missing? Do I have the basic idea down?",
        "created_utc": 1677118376,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a touchpad that has a top-left zone that disables it, I want to cover that up so I can't accidentally press it. What kind of (electrical?) tape would stop a touch pad area from working?",
        "author": "esotericGames",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119jr08/i_have_a_touchpad_that_has_a_topleft_zone_that/",
        "text": "My laptop touchpad has a \"double tap the top left corner to disable touchpad\" feature. While I type my left hand palm will occasionally trigger this by accident, and it is super annoying. \n\nOtherwise the laptop is great, but as far as I can tell there is 0 way in the computer itself that I have found (after tons of research) to actually disable this feature. So I am left with just trying to make that section of the touchpad inactive. \n\nI thought the touchpad works by capacitance or something, so I figured that if I put some electrical tape there it would block any current and thus make that section unresponsive.\n\nI tried some small electrical tape from amazon (3 or 4 layers of it) and it doesn't stop the accidental double tap. I'm not sure if I'm buying the wrong tape or what. But what could I put there such that no matter how many times it was tapped the touchpad would not detect anything? \n\nRight now I can just double tap the electrical tape and it seems to pick up the input. Though if I drag my finger across the tape it doesn't pick up on it.\n\nIt can't be anything too thick because it's a laptop and I don't want it hitting the screen when I close it.\n\nAny suggestions would be appreciated. I really really hate my laptop touchpad turning off randomly by accident.",
        "created_utc": 1677113930,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does FG8 mean on an engineering drawing? It is in the callout for a pin hole on the base of a robot arm. Is it a clearance specification?",
        "author": "WearyPiano9019",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119jpak/what_does_fg8_mean_on_an_engineering_drawing_it/",
        "text": "Hey, y'all, I'm a TA working on designing a mount for this robot arm for my school's automation lab. What does FG8 mean on the pin hole? Is that a thread specification or a tolerance? I don't think it's threading because the lower right pin hole is oblong, but my partner and I can't find anything in the manual or on the internet.",
        "created_utc": 1677113806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do \"Lid Stays\" always require additional hinges?",
        "author": "giwidouggie",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119jd9h/do_lid_stays_always_require_additional_hinges/",
        "text": "I am looking at lid stays for our enclosure, like [this one](https://global.sugatsune.com/uk/en/tech/products/44057_t).\n\nThe mounting examples always include additional piano/butt/concealed hinges, but why? Is this really necessary?\n\nThe way I understand lid stays is that the rotation axis is defined by how the stay is mounted, as is the opening angle etc. So &gt;IF&lt; I were to install a lid stay and a hinge that don't share the same rotation axis, the lid will be deadlocked, no?\n\nCan someone clarify this for me? Thank you!",
        "created_utc": 1677112942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does a max gear ratio exist between two gears?",
        "author": "TheWolf277",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119i8ie/does_a_max_gear_ratio_exist_between_two_gears/",
        "text": "Hello, I was designing some gears, and looking at Shigley's, it gives you formulas for calculating the minimum number of teeth that a pinion should have to avoid interferences with the driven gear, and it also gives the formula for the maximum number of teeth that the driven gear should have.\n\nIn my case, I am designing two gears with a gear ratio of 32:10 and pressure angle of 20°. I assume k=1 for full depth teeth.\n\nThe formula for minimum pinion teeth number gives Np=16, and the formula for max number of gear teeth gives Ng=101. All good for now. \n\nExcept I also have to be careful and not add too many teeth to the driven gear, otherwise the dedendum circle will become bigger than the base circle, and the gear won't work. \n\nThe max number of teeth for a gear with pressure angle of 20° to avoid the base circle issue is 41.\n\nNow, taking 41 for the driven gear and 16 for the pinion, I get a max gear ratio of 41:16, approximately 2.56, which is way less than the 3.2 I need.\n\nI can't remove teeth from the pinion or it will interfere, and I can't add teeth to the driven gear or the dedendum circle will become too big and the gear teeth will get caught up between spaces.\n\nYet I am sure I've seen bigger gear ratios. How are those taken care of?",
        "created_utc": 1677110130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Fast Ways to Heat Up 300 Gallons of Water",
        "author": "CorvetteZ062019",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119hyd7/looking_for_fast_ways_to_heat_up_300_gallons_of/",
        "text": "[removed]",
        "created_utc": 1677109372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Way to Heat Up Large Amount of Water Quickly?",
        "author": "CorvetteZ062019",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119hs4r/best_way_to_heat_up_large_amount_of_water_quickly/",
        "text": "[removed]",
        "created_utc": 1677108958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fastest Way to Heat Large Quantity of Water?",
        "author": "CorvetteZ062019",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119hnqf/fastest_way_to_heat_large_quantity_of_water/",
        "text": "[removed]",
        "created_utc": 1677108679,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if I'm passionate for engineering?",
        "author": "AggressiveAd9215",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119gckm/how_do_i_know_if_im_passionate_for_engineering/",
        "text": "[removed]",
        "created_utc": 1677105680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for advice about taking the FE for electrical engineering. Whether I should take it or not.",
        "author": "kra2533",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119fal1/looking_for_advice_about_taking_the_fe_for/",
        "text": "[removed]",
        "created_utc": 1677103447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Structural Engineer interview tips",
        "author": "tmm426",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119ex4x/structural_engineer_interview_tips/",
        "text": "[removed]",
        "created_utc": 1677102735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pump selection for automatic storm water sampler",
        "author": "mustang__1",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119edc1/pump_selection_for_automatic_storm_water_sampler/",
        "text": "I'm considering building an automatic stormwater sampler for our facility. The pump choice is a little bit confusing since I need something that can lift the water from the bottom of the storm drains but can also handle running dry (potentially), dirt, etc. \n\nI'm considering a high flow peristatic pump, at 900ml/min I can get my samples sufficiently fast during the course of a rain event. I'm also looking at this pump https://www.forestry-suppliers.com/p/76194/26211/proactive-environmental-products-mini-typhoon-sampling-pump, and I've reached out to them to see if it would suitable for my application. \n\nAre there any other types of pumps I should consider?",
        "created_utc": 1677101802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stormwater sampling pump",
        "author": "mustang__1",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119e8wh/stormwater_sampling_pump/",
        "text": "[removed]",
        "created_utc": 1677101601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peerless Sash Chains, Size 8, 75 lb Limit, Bright Zinc (100 FT / CTN",
        "author": "wmnocry68",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119cxg5/peerless_sash_chains_size_8_75_lb_limit_bright/",
        "text": "[removed]",
        "created_utc": 1677099711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do low-speed Magnetic Levitation trains exist?",
        "author": "dleeman88",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119cslh/why_do_lowspeed_magnetic_levitation_trains_exist/",
        "text": "I was learning about magnetic levitation trains, and apparently a significant number of the few that exist only go about 60-100 mph (https://www.britannica.com/technology/maglev-train). Is there a good reason to choose MagLev in these cases, rather than conventional trains, when the trains aren’t going very fast? I did some looking on Google, but I couldn’t seem to find an answer to this question. To me, it seems the main benefits of MagLev are going fast and decreasing wear on moving components, so I don’t really understand why you would choose the expensive option when you aren’t going to go very fast/very far, and can just replace the components with no serious disruptions. Thanks so much in advance for any ideas!",
        "created_utc": 1677099522,
        "upvote_ratio": 1.0
    },
    {
        "title": "With the current state of Tech which path to choose?",
        "author": "Farley04",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119bmv9/with_the_current_state_of_tech_which_path_to/",
        "text": "[removed]",
        "created_utc": 1677097896,
        "upvote_ratio": 1.0
    },
    {
        "title": "What gauge wire do I need for my greenhouse trellis? Wire will be 150 ft long, fixed at each end and resting loosely on greenhouse bottom chords every six feet, with 30 lbs of weight distributed every 3 feet along length.",
        "author": "play_on_swords",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119bm7y/what_gauge_wire_do_i_need_for_my_greenhouse/",
        "text": "Hi, I am looking to construct a wire trellis in a greenhouse that is 150 feet long. I need to select a wire that will span the 150 ft and be supported by the greenhouse bottom chords which are spaced every six feet. The wire will be tied to the end walls at each end but will just rest on top of the bottom chords in between. Assuming a fully loaded tomato plant weighs about 30 lbs and that a tomato plant attaches to the support wire every 3 feet, how would I determine what gauge of wire is strong enough? My initial thought was to just multiply 30 lbs/plant by the 50 plants that would be attached to each wire and then get a wire that has a tensile strength that is greater than this 1500 lbs. But it seems that even 9 gauge wire would not satisfy this requirement. So perhaps because the wire is supported by a bottom chord every six feet, the stress is reduced and I can get away with a lighter wire? Hopefully I've described the problem clearly enough.",
        "created_utc": 1677097875,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to convert .SLDASM to .STEP?",
        "author": "Bumboclottt",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119ahfo/how_to_convert_sldasm_to_step/",
        "text": "Looking to convert a .SLDASM (Solidworks) to a .step file. I’m use Solid Edge and when I try opening the file, it asks for the lines part files which I don’t have. So I’m thinking if I convert to .step, I can convert features to a surface type and import to Solid edge as a part. Can anyone recommend a converter software that can do the task?",
        "created_utc": 1677096254,
        "upvote_ratio": 1.0
    },
    {
        "title": "What gauge wire do I need for my greenhouse trellis?",
        "author": "play_on_swords",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119aagp/what_gauge_wire_do_i_need_for_my_greenhouse/",
        "text": "Hi, I am looking to construct a wire trellis in a greenhouse that is 150 feet long. I need to select a wire that will span the 150 ft and be supported by the greenhouse bottom chords which are spaced every six feet. The wire will be tied to the end walls at each end but will just rest on top of the bottom chords in between. Assuming a fully loaded tomato plant weighs about 30 lbs and that a tomato plant attaches to the support wire every 3 feet, how would I determine what gauge of wire is strong enough? My initial thought was to just multiply 30 lbs/plant by the 50 plants that would be attached to each wire and then get a wire that has a tensile strength that is greater than this 1500 lbs. But it seems that even 9 gauge wire would not satisfy this requirement. So perhaps because the wire is supported by a bottom chord every six feet, the stress is reduced and I can get away with a lighter wire? Hopefully I've described the problem clearly enough.",
        "created_utc": 1677095974,
        "upvote_ratio": 1.0
    },
    {
        "title": "why aren't there any good tv shows about engineers?",
        "author": "a_line13",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119a4q2/why_arent_there_any_good_tv_shows_about_engineers/",
        "text": "",
        "created_utc": 1677095767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trellis wire gauge?",
        "author": "play_on_swords",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1199o6s/trellis_wire_gauge/",
        "text": "[removed]",
        "created_utc": 1677095114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does bicycle tire circumference length depend on tire width?",
        "author": "logperf",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1198ssw/why_does_bicycle_tire_circumference_length_depend/",
        "text": "Mathematically, the circumference length depends only on the diameter. What weird detail makes this no longer true for a tire?\n\nHere's the manual for my bike's odometer: [https://manuall.co.uk/btwin-dc4-s-cycling-computer/](https://manuall.co.uk/btwin-dc4-s-cycling-computer/) (you can download it as PDF for better zooming).\n\nIt has a conversion table in which for the same tire diameter (26'') several different lengths are stated depending on the width. Why?",
        "created_utc": 1677093888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone knows how much ASML Lithography System like \"PAS 5500\" cost ?",
        "author": "_Senjogahara_",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1198rrb/does_anyone_knows_how_much_asml_lithography/",
        "text": "",
        "created_utc": 1677093851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative terms for \"entitlement\" (but with a positive connotation)",
        "author": "jg-rocks",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1195iav/alternative_terms_for_entitlement_but_with_a/",
        "text": "In the world of Six Sigma, the term \"entitlement\" has a positive connotation that means \"the best performance you can reasonably achieve with the existing process\" whereas the negative connotation is \"the belief that one is inherently deserving of privileges or special treatment. \"\n\nCan anyone suggest an industry term that means the same thing as Six Sigma \"entitlement\" that doesn't carry a negative connotation?   \n\nHas anyone used this term, but then deliberately moved away from it to something different?",
        "created_utc": 1677086634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice regarding a topic for a smart cities project",
        "author": "Aegon_R",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11936s5/advice_regarding_a_topic_for_a_smart_cities/",
        "text": "\nI am working with a group on ideas for new engineering concepts related to the topic of smart cities, we’re still new to this so we want something that we can build a prototype for using something simple like arduino, we’ve already asked chat gpt and we have a few ideas of our own but I am looking for more suggestions.\nThank you all in advance!",
        "created_utc": 1677081252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smart Cities Project",
        "author": "Aegon_R",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11935tr/smart_cities_project/",
        "text": "[removed]",
        "created_utc": 1677081195,
        "upvote_ratio": 1.0
    },
    {
        "title": "System characteristic curve with differing back pressures",
        "author": "astengineer",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11935f2/system_characteristic_curve_with_differing_back/",
        "text": "For a pipe system with all else being equal, i.e. Areas, discharge coefficients, major and minor losses etc. If there is a change in the system back pressure, does the characteristic curve (delta P vs flow) stay the same, or does the changed back pressure kick the system onto a new characteristic curve? \n\nIn other words, does changing the system back pressure just move me along the characteristic curve, or does it result in a new characteristic curve for the system?",
        "created_utc": 1677081171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need suggestions",
        "author": "Aegon_R",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11934un/need_suggestions/",
        "text": "[removed]",
        "created_utc": 1677081137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing the right diameter spring for application",
        "author": "Tiny_Zookeepergame81",
        "url": "https://www.reddit.com/r/AskEngineers/comments/119191j/choosing_the_right_diameter_spring_for_application/",
        "text": "Hi everyone!\n\nI’m doing an investigation on a design that was made a while ago. I checked the vendors website for the spring specified in this design and it calls out that the spring shall work over a rod that is a minimum of .188 inches. The rod we are using is .180 in. What potential failure modes would this cause if any? Am I more likely to experience buckling of the spring in compression or scrapping against the rod as it deforms under load?",
        "created_utc": 1677076834,
        "upvote_ratio": 1.0
    },
    {
        "title": "FPGA Engineer Future Prospects",
        "author": "adeep-er",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11917o6/fpga_engineer_future_prospects/",
        "text": "Hey everyone!\n\nSo I’ve been working the past 4 years as an FPGA design engineer and worked my way up to the principal engineer level. However, I know this is a pretty niche field and the tools used to do the job aren’t applicable much outside of FPGA/ASIC work.\n\nI was wondering what other peoples views on the future job prospects are for this field? I know ASICs will be around for a while but what about FPGAs? Would other job positions understand what I do or would I be attractive to them if I decide to switch paths? Any general thought in the area would be appreciated!\n\nI am also getting my masters in engineering management so I imagine that may give me some flexibility in the future. \n\nThanks!",
        "created_utc": 1677076766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dezincification leading to electrical outlet receptacle failure?",
        "author": "88mph_pfr",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1190ik1/dezincification_leading_to_electrical_outlet/",
        "text": "I have been operating a 12.5A space heater on a 15A outlet over the winter.  There have been no tripped breakers and no noticed problems, until this week.  When turning off the heater, I noticed a spark at the outlet.  I turned off the electricity, noticed burn marks on the receptacle, removed the outlet and broke it open to look inside.   [Burnt receptacle ](https://i.imgur.com/GFSWoTH.jpg)\n\n\nThe outlet is likely nearly 30 years old.  It and another were replaced, and the broken outlet on the right in the photo is the burnt outlet.  Looking around, it seems like the brass may have dezincified?  But also highly loaded copper brass has a higher conductivity. [Inner portion of receptacle ](https://i.imgur.com/gFkHGKw.jpg)\n\n\nAm I on the right path to the cause, or is there something else I am missing?  Why would a higher conductivity (assuming I am correct) lead to a higher temperature and outlet failure?",
        "created_utc": 1677075579,
        "upvote_ratio": 1.0
    },
    {
        "title": "is a associates in engineering science good",
        "author": "Toe-Sweet",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118yq54/is_a_associates_in_engineering_science_good/",
        "text": "I'm currently pursuing an associates in engineering science. With plans to get my bachelor's right after. Are there many jobs in the engineering field that will help pay for the bachelor's degree or should I just go straight for my bachelor's.",
        "created_utc": 1677072478,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I get a job with an associates in engineering science",
        "author": "Toe-Sweet",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118yohk/should_i_get_a_job_with_an_associates_in/",
        "text": "[removed]",
        "created_utc": 1677072398,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a lot of jobs that offer tuition reimbursement",
        "author": "Toe-Sweet",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118yn08/is_there_a_lot_of_jobs_that_offer_tuition/",
        "text": "[removed]",
        "created_utc": 1677072326,
        "upvote_ratio": 1.0
    },
    {
        "title": "tuition reimbursement",
        "author": "Toe-Sweet",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118ylek/tuition_reimbursement/",
        "text": "[removed]",
        "created_utc": 1677072246,
        "upvote_ratio": 1.0
    },
    {
        "title": "How hot will the engine get with a 125 W oil pan heater",
        "author": "skyareus",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118yji2/how_hot_will_the_engine_get_with_a_125_w_oil_pan/",
        "text": "[removed]",
        "created_utc": 1677072131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do those giant propellers on mountains generate the wind for us people to breathe?",
        "author": "HappyMan1102",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118waf0/do_those_giant_propellers_on_mountains_generate/",
        "text": "I love engineering",
        "created_utc": 1677066950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting power cable",
        "author": "Boris740",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118vt8s/interesting_power_cable/",
        "text": "[removed]",
        "created_utc": 1677065328,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can you make a qr code that directs you to a software or application?",
        "author": "miyuki_desu",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118vscb/how_can_you_make_a_qr_code_that_directs_you_to_a/",
        "text": "",
        "created_utc": 1677065241,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you create a qr code that directs you to a software or application? can this be possible?",
        "author": "miyuki_desu",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118vp89/can_you_create_a_qr_code_that_directs_you_to_a/",
        "text": "",
        "created_utc": 1677064935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-newtonian fluids in manufacturing",
        "author": "Slav_Shaman",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118vj1g/nonnewtonian_fluids_in_manufacturing/",
        "text": "I am trying to find how some products are made with non-newtonian fluids like for example shoes or safety wear(helmets, knee pads). Like, where a company could get an industrial non-newtonian fluid and how do they implement it? \nI don't know if my question is on point though. I came here to ask because when looking through Google all the search results were just about DIY non-newtonian fluids with cornstarch and no mechanical device examples with it..",
        "created_utc": 1677064362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can cordless drill rated 14v be converted to linear actuator and be just as powerful?",
        "author": "Smart_Bridge_7968",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118uy04/can_cordless_drill_rated_14v_be_converted_to/",
        "text": "I've seen some vids on youtube but there's no stats shown",
        "created_utc": 1677062247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help in collecting survey responses. Thai engineers needed",
        "author": "ube_keso",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118ukcg/need_help_in_collecting_survey_responses_thai/",
        "text": "Hey, I’m hanging by the last thread. I need help please. \n\nI’m a business owner in the water and heavy business industry from the Philippines. I’m gathering reviews and feedback on the best drive company in the Thai market.\n\nTo answer the survey, you must be:\n✅ Thai\n✅ Mechanical/Equipment Engineer\n✅ Knowledgeable about Variable Frequency Drives and brands\n\n\nI was hoping if you can help in this short survey: https://forms.gle/qr7h7Z6HhcDjmyHH7\n\nThanks and best of luck!",
        "created_utc": 1677060867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unable to send Graphics data through printer driver for a dot matrix printer",
        "author": "antigravit",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118u6ye/unable_to_send_graphics_data_through_printer/",
        "text": "The system is connected to W5500 EVB through a LAN port and the W5500 EVB is connected to the Printer MLC through UART Connection.\n\nFollowing this procedure, we can print from the system to the printer as well as from network ports too by changing our Ethernet IP address. But supports only text format. EVM is not able to support PDF printing and graphics.\n\nAnd also, we are unable to print graphics data from both the system to the printer as well and from network ports to the printer.\n\nPlease suggest what are the issues and how to correct them in the Firmware",
        "created_utc": 1677059534,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the \"bottle wash\" button on my dishwasher do?",
        "author": "ezpg",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118sfza/what_does_the_bottle_wash_button_on_my_dishwasher/",
        "text": "A lot of dishwashers these days have bottle wash nozzles on the upper rack now. My dishwasher has an \"on/off\" button for them, but as far as I can tell the water comes thru the same port as the upper rack sprayer. [Like this.](https://www.ebay.com/itm/233777922422?epid=5046125557&amp;hash=item366e400176:g:60cAAOSw2gBfrH8H&amp;amdata=enc%3AAQAHAAAA4L1h5%2B0Roj%2BoVgi1gcSbuEcnMuDzMIjGIENwpWigcBRGn6yOJJLn8JZifTZJKURymevxFOHWcgNO6T%2Fjk3%2FgrZnYnFYq%2Fle4NCG7kKVgFp1eZyyH1iHYAi9DvDezw%2B8Et4X4VqKCFeiOmiI3DoK5UgKsCHihayDaNk2nv0eeSmltqZi%2FpaGhx8bAK6w4a1P52Wjnw9MuDPugAri9DTOFpSSasKEFqI0I%2Bq4bqp3BgUwjJV2PNhczKacwqxqn4r3ThWzMPUzqGVkpW8GS7SUckZTtNQCqte0WdhaoaeHxCfCM%7Ctkp%3ABk9SR6yh9oHPYQ)\n\nIt's a single port, there's no divider or seemingly any mechanical/electrical way to only send water to the sprayer. I know there is a diverter down below which directs water to the entire upper port, but that's it.\n\nIs this bottle washer \"on/off\" not really an on/off, and merely a switch to tell the machine to run water to the upper rack for an additional 10 minutes? And in fact those bottle washer nozzles are spraying any time the upper rack is running?",
        "created_utc": 1677052788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ansys icepak error",
        "author": "Snoo-14018",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118s14f/ansys_icepak_error/",
        "text": "[removed]",
        "created_utc": 1677051166,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to check if my External USB hard disk drive is going to be failed",
        "author": "dreamer881",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118qspg/how_to_check_if_my_external_usb_hard_disk_drive/",
        "text": "Dear computer/Electronic/electrical engineers, As the title indicates, I have a 5 year old WD 1TB USB portable hard disk drive with me. Currently when I'm plugging it in  I'm facing some weird issues like\n\n&amp;#x200B;\n\n*  its taking lot of time to detect , \n* the whole computer freeze when plugging in , \n* Its just showing the icon and If i click it I its taking too much time to respond\n\nNote that these issues doesn't come all together, Its either one of the issue every time . \n\nMy questions are:\n\n* Is it time to replace my USB HD?\n* Is there a way I Can check if its gonna be failed in couple of months?\n* If I'm going to buy a new one is the new SSD one's worth it? \n\nI have very important  work related files stored in this device which I have collected through out my career. If its blows out , its the end of my career 😜\n\nThanks on advance.",
        "created_utc": 1677046619,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much would slats in front of a fan affect the air flow?",
        "author": "ausrandoman",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118q0ij/how_much_would_slats_in_front_of_a_fan_affect_the/",
        "text": "I have recently bought a house with a split system reverse cycle heater/cooler.  The compressor/fan unit is outside at ground level, with clearance of about 10 inches/250 mm from the exterior wall.  The previous owner put a decorative screen around it.  The screen is open at the back, the side nearest the wall.  The top is solid and could be used as a table.  The other three sides are long, thin slats, about 1-3/8 inch/35 mm wide, with the same width gaps from slat to slat.  The slats are about 3 inch/75 mm from the leading edge of the fan blades.  The fan blades have a swept circle of about 18 inch/450 mm diameter.  The side of the screen in front of the fan is about 2.5 times larger area than the fan outlet, so the open area is about 1.25 times larger than the fan outlet.\n\n\n\nI realise that the slats will somewhat restrict the airflow, but there is ample room for air flow to turn 90 degrees and escape.  \n\n\n\nI guess that the slats might reduce the airflow by a few percent.  Does this sound like a reasonable estimate?  How can I calculate this?",
        "created_utc": 1677043896,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m looking for examples, if any exist, of trains using existing narrow canyons by running long bridges parallel to the canyon",
        "author": "humdaaks_lament",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118p0dn/im_looking_for_examples_if_any_exist_of_trains/",
        "text": "It’s not terribly important, just kicking around an idea for a model train layout.",
        "created_utc": 1677040598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a vacuum filtration process result in a looser filter cake vs a pressurized filtration process?",
        "author": "QT31416",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118o40y/would_a_vacuum_filtration_process_result_in_a/",
        "text": "I'm a junior engineer at a company that operates in the municipal/domestic water and wastewater industry. We met with a vendor and they said that a vacuum filtration process would result in a loose filter cake and therefore would result in easier backwashing, compared to a pressurized filtration process which would result in a more compact and hardened filter cake.\n\n&amp;#x200B;\n\nIt seems counterintuitive to me because you can have the same delta P in a vacuum and pressurized filter, regardless where the pump is, but how can a vacuum create loose filter cakes? Hope you guys can give more insight or resources where  I can read more about this.",
        "created_utc": 1677037805,
        "upvote_ratio": 1.0
    },
    {
        "title": "EnergyPlus Open Studio HVAC Help",
        "author": "OMGGravity",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118lz5z/energyplus_open_studio_hvac_help/",
        "text": "I'm new to openstudio/energyplus and trying to simulate one room with a split AC (with no airflow from outside the room) maintaining a constant temperature year round. I currently have a HVAC loop with a single speed htg coil, single speed clg coil, a fan and cooling setpoint manager with the min and max supply temperatures set to the desired temperature i want to maintain year round. However, the results are outputting a much higher energy consumption than i would think (\\~10x) and i suspect i haven't properly configured the heating and cooling to maintain a given temperature properly. Does anyone know how to properly do this? I can't find a relevant tutorial online.",
        "created_utc": 1677031453,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Career Advice] What is the best Career path to get into design/R&amp;D?",
        "author": "Keeshkuush",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118lwhr/career_advice_what_is_the_best_career_path_to_get/",
        "text": "[removed]",
        "created_utc": 1677031249,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to quantify the costs/risks of sole sourcing",
        "author": "SmittyMcSmitherson",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118ko5r/how_to_quantify_the_costsrisks_of_sole_sourcing/",
        "text": "We all know that sole sourcing (not single sourcing) components, especially for electronic components, has a lot of risks. Unfortunately I’m getting a lot of resistance to multi-sourcing and reducing complexity from teams where this is outside their area of expertise (or interest). How would one actually /quantify/ those risks or associated costs to convince them of the importance?",
        "created_utc": 1677027757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using pics in an interview presentation",
        "author": "seanjeanjean2",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118km5j/using_pics_in_an_interview_presentation/",
        "text": "[removed]",
        "created_utc": 1677027624,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats organization is the gold standard for kaizen certification?",
        "author": "woodropete",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118kj3e/whats_organization_is_the_gold_standard_for/",
        "text": "Is there a particular organization I should use, thats more respected than the others?",
        "created_utc": 1677027379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kaizen certification help?",
        "author": "woodropete",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118khgh/kaizen_certification_help/",
        "text": "[removed]",
        "created_utc": 1677027257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guidance request in the transition from academic to professional",
        "author": "valen011",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118ir46/guidance_request_in_the_transition_from_academic/",
        "text": "Hello all, I am an aerospace undergrad and while I’m taking differential equations I have been reflecting on my math abilities.\n\nI understand the concepts and know how to use them, but I see I make common mistakes in my integration and sometimes algebra. I have to do some review on some calc 1&amp;2 concepts while doing homework and then I can complete the problems.\n\nI don’t know any engineering professionals I can talk to ask these questions.\n\nMy question to you is: \n\nWhat type of math are having to do for you career? \nAre the math concepts reoccurring? \nIs it ok not to know all techniques on demand? \nAt times do you have review some concepts?\nShould I spend more time practicing on my integration techniques and how proficient should I be?",
        "created_utc": 1677022591,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know Canon Dual Pixel RAW only enables marginally useful light field camera like functions while Raytrix is more useful for that. Why? Is it possible to have quad pixel phase detect sensor with useful advantages of Raytrix, RAW files in 2D or light field similar to Canon, and on chip autofocus?",
        "author": "cpu5555",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118ilmb/i_know_canon_dual_pixel_raw_only_enables/",
        "text": "**Observations**\n\n1. The 2D resolution of the Raytrix is half on each axis. Thus for example, a 20 megapixel chip has the spatial resolution of a 5 megapixel chip.\n2. Canon has *dual pixel phase detection* and *dual pixel RAW* on select cameras. This can be expanded to quad pixel if Canon chooses to with later models.\n3. People who tried Canon dual pixel RAW noticed little difference even when using recommended focal lengths and aperture settings.\n4. Lytro has lower 2D spatial resolution than Raytrix.\n5. Canon models with dual pixel phase detection output in 2D RAW unless you select dual pixel RAW.",
        "created_utc": 1677022201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with robot movement detection and analysis",
        "author": "Rhaellys",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118ik8o/help_with_robot_movement_detection_and_analysis/",
        "text": "[removed]",
        "created_utc": 1677022098,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the most mathematical job area?",
        "author": "dLuxxias",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118hmwx/whats_the_most_mathematical_job_area/",
        "text": "[removed]",
        "created_utc": 1677019795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electrical Engineer looking to switch industries",
        "author": "Natural_Roof640",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118hliq/electrical_engineer_looking_to_switch_industries/",
        "text": "[removed]",
        "created_utc": 1677019695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electrical Engineer looking for a new industry",
        "author": "Natural_Roof640",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118hk01/electrical_engineer_looking_for_a_new_industry/",
        "text": "[removed]",
        "created_utc": 1677019590,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find a good engineer that’s right for me and my project.",
        "author": "Absolute0CA",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118h882/how_to_find_a_good_engineer_thats_right_for_me/",
        "text": "Sorry if this is against the rules but I don’t have any experience in actually hiring an engineer for a project and I figured this is a good place to ask.\n\nI know just enough to get myself into trouble and how the broad overview of things work but I don’t know enough to actually deal with the fine details for my project. (I’m actually fairly good at designing stuff but entirely self taught)\n\nI’m designing what I think is an innovative 3D printer but some aspects of the design are beyond me, mostly to do with the power supply and the unique and extreme demands I have for the printer’s hot end.\n\nI’m not going into exact details because describing it more makes it very obvious in what I’m going for in my design and someone who actually knows what they are doing could probably finish its design before I even find, consult, and hire an engineer.\n\nFeedback is welcome but I won’t describe my printer concept more without an NDA and a less private setting.\n\nThanks in advance.",
        "created_utc": 1677018800,
        "upvote_ratio": 1.0
    },
    {
        "title": "get rid of dead angels. https://www.youtube.com/shorts/O_68Tp0KlQI",
        "author": "illusior",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118h1yv/get_rid_of_dead_angels_httpswwwyoutubecomshortso/",
        "text": "I want to orient each of these rings in any orientation, by just having a motor attached to the central disk in this picture [https://www.youtube.com/shorts/O\\_68Tp0KlQI](https://www.youtube.com/shorts/O_68Tp0KlQI).  In the current position I could rotate the central disk counter clockwise and that way I could orient the outer ring. Then after a few rounds clockwise, the second ring could be oriented, and so forth. The problem is that the notches prevent some orientations. Who has a brilliant, simple solution to overcome this problem??",
        "created_utc": 1677018392,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I power my 45V 1000W Electric Motor?",
        "author": "NinjaKerbal",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118g6lx/how_should_i_power_my_45v_1000w_electric_motor/",
        "text": "I'm learning about motors and such, so I bought a DC motor. The motor needs 45v and 1000W, but I can't figure out how to supply the power to it. Nowhere has 45v 1000W batteries, and I cant afford an adjustable power supply currently. What should I do?",
        "created_utc": 1677016312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering Design River Trash collector: Would it actually work?",
        "author": "bozimthecalm",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118g2ae/engineering_design_river_trash_collector_would_it/",
        "text": "So I have very little understanding of engineer as a heads up. My uncle was posed the question on designing something that would help to pick up trash from a river. Here's his idea.\n\nHe said he would make what he called an Olds Man Elevator tube with a feeder attached to the bottom that with the water pressure push down trash into the tube. The casing to the tube would be constantly turning due to a taurus propeller/s attached to the bottom. This would with physics suck up the trash through the tube and up and ejected to a track; which would be powered by gears attached to the top, with drainage holes that would ferry the trash into a waste collector on the side of the river.\n\nIt sounded clever to me because he said it would work and would require zero electricity, only maintenance. \n\nBut would it actually be possible?\n\nMy attempt to illustrate his device: [https://imgur.com/a/MILtN9t](https://imgur.com/a/MILtN9t)\n\nIf this is the wrong place to ask and there is a better place to ask, please say so.",
        "created_utc": 1677016023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electrolytic Capacitor Lifespan vs Rating",
        "author": "mtrantham",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118f5op/electrolytic_capacitor_lifespan_vs_rating/",
        "text": "[removed]",
        "created_utc": 1677013801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guidance",
        "author": "valen011",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118dtn1/guidance/",
        "text": "[removed]",
        "created_utc": 1677010389,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got two job offers in different engineering positions and I am not sure which one to chose, any advice?",
        "author": "SquareUniversity19",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118dhjx/i_got_two_job_offers_in_different_engineering/",
        "text": "[removed]",
        "created_utc": 1677009435,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the reason for no electricity in the sockets except when electric stove is turned on?",
        "author": "YigitDemirag",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118d2ls/what_would_be_the_reason_for_no_electricity_in/",
        "text": "I started having this issue in the studio where I had just moved in. Here are the puzzle pieces; I'm trying to understand where the problem might be and how serious it might be.\n\n\\- I noticed that there is no electricity in the wall sockets. \n\n\\- I checked the circuit breaker. There are two circuits for my studio, and both are on. Resetting (turn off and on) didn't change anything. The circuit breaker says Circuit #1: wall sockets, circuit #2: freezer, bathroom. However, if I turn off Circuit #1, there is no light in the electric stove, so it should be connected to Circuit #1. \n\n\\- When the electric stove is turned off, there is no electricity in the wall sockets. When I turn it on, even slightly, the wall sockets get their electricity. \n\n\\- The stove seems not to be working, or at least hugely underperforming. \n\n\\- The problem might happen because of overloading the line (by turning on the stove + connecting the new heater I brought to the wall). But I don't remember if timings of these matches. Plus circuit breaker is still ON.\n\nWhat do you think?",
        "created_utc": 1677007770,
        "upvote_ratio": 0.5
    },
    {
        "title": "What would be the cause of no electricity in the sockets except when electric stove is turned on?",
        "author": "tmp231221",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118d1hx/what_would_be_the_cause_of_no_electricity_in_the/",
        "text": "[removed]",
        "created_utc": 1677007653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I have a question about an idea of mine. Wil this idea work? Or not, or does it need improvements?",
        "author": "Coatsz",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118cdwy/hello_i_have_a_question_about_an_idea_of_mine_wil/",
        "text": "Hello everyone, lately I’ve been working on a idea that has been stuck in my head for a long time. It is about reducing carbon emissions I have no idea if it wil work but here is the general idea: when the co2 leaves for example a fabric’s exhaust pipe a rotary motor or pump will suck it in a pipe then it will travel trough the pipe and trough a filter or it wil be stored. I’m sure it has a lot of flaws. I have made some prototypes but they don’t have the power to work good.  If you have any questions please ask them!",
        "created_utc": 1677004172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will this work?",
        "author": "Coatsz",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118cay2/will_this_work/",
        "text": "[removed]",
        "created_utc": 1677003975,
        "upvote_ratio": 1.0
    },
    {
        "title": "CAREER IN ROBOTICS",
        "author": "No-Conversation221",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118c1eo/career_in_robotics/",
        "text": "[removed]",
        "created_utc": 1677003332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I continue?",
        "author": "Both_Roll2576",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118c05j/should_i_continue/",
        "text": "[removed]",
        "created_utc": 1677003244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fan Curves - point of no return",
        "author": "Unhappy_Position",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118aa78/fan_curves_point_of_no_return/",
        "text": "I'm looking at a few different fan curves for an engine, static pressure vs airflow. Each different curve represents a certain rpm. I'm noticing that one graph offers data for 3/3.5/4/4.5/5 krpm, another only offers it for 2/3/4 krpm. \n\nMy question, is there a point at which increasing the rpm no longer increases the airflow provided by a fan?",
        "created_utc": 1676999361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simplest hardware for stools that rise as we spin them?",
        "author": "Sapin-",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1189oc7/simplest_hardware_for_stools_that_rise_as_we_spin/",
        "text": "I want to copy (or slightly improve?) [this stool](https://www.safcoproducts.com/products/lab-stool-high-base-with-screw-lift-3433), but mostly in wood. I'm here because I have questions about the right hardware.\n\nI'm more of a woodworker, so I've had to do lots of googling to end up with what looks like a solution. This [coupling nut](https://www.boltdepot.com/Product-Details.aspx?product=23805) would be used, with a matching threaded rod. I would encase the coupling nut in a strong wood base, and basically build the chair around that. \n\nThoughts?",
        "created_utc": 1676998410,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to model a Pringles hyperbolic paraboloid?",
        "author": "UffDaDan",
        "url": "/r/cad/comments/11889y0/how_to_model_a_pringles_hyperbolic_paraboloid/",
        "text": "",
        "created_utc": 1676996543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reliable method to actuate between a servo and a component that is waterproof?",
        "author": "MythFX",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1187nqe/reliable_method_to_actuate_between_a_servo_and_a/",
        "text": "Hi all, I hope this is an okay place to ask this question. I am working on a senior design project and would really appreciate some input from people who may be more familiar in this area. I am trying to use a servo to release a compliant wedge latch similar to this [image](https://imgur.com/Nvty8jo). The issue that has been a big struggle for me is figuring out a way to accomplish this so that the servo (and all neighboring electronics) are completely sealed from water. Does anyone know of any ways to accomplish this? The servo we are using is a 9g micro servo, so our design is shooting for something relatively compact and low power draw.\n\nAlso, if there are lock and release methods different from the one that I described that could also solve this problem I would be interested to hear it. Thank you!",
        "created_utc": 1676995633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should electric kettles be turned off before they turn off automatically?",
        "author": "dianenguyenfan",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11864dc/should_electric_kettles_be_turned_off_before_they/",
        "text": "Whenever I am boiling water in the presence of my father, he always scolds me for letting the kettle turn off by itself instead of turning it off as soon as the water starts boiling, that is, evaporating out of the kettle. He says that letting it get to that point will make the inside of the kettle become seriously burned sooner than it otherwise would. \n\nIs there any merit to this? Could the short time difference between when the water begins steaming out and when the kettle automatically shuts off be that significant? Or could it be more damaging in some other way? \n\nThank you for any responses, I hope this question fits this sub.",
        "created_utc": 1676993459,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there jobs as a mechanical engineer where i can pursue my love for nature?",
        "author": "daddydav69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1185snb/are_there_jobs_as_a_mechanical_engineer_where_i/",
        "text": "[removed]",
        "created_utc": 1676992626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric kettles",
        "author": "dianenguyenfan",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1185pnl/electric_kettles/",
        "text": "[removed]",
        "created_utc": 1676992411,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to still pursue my passion for nature as a mechanical engineer?",
        "author": "daddydav69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1185gjm/is_it_possible_to_still_pursue_my_passion_for/",
        "text": "hello, in 2 weeks i'm supposed to decide which discipline of engineering i would like to pursue. unfortunately i'm very conflicted. naturally i'm drawn to Mechanical, however i have a strong love for the environment, and nature. from doing some light research it seems like most mechanical engineers get stuck in offices especially if they would like to make money\nI also saw that civil engineering has some environmental aspects, and seems like i would get the opportunity to work a little closer to the environment and maybe even national parks.\nI'm just curious if anyone has any knowledge of mechanical engineers working with the environment/ working on environmental problems. thanks.",
        "created_utc": 1676991753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to have a mechanical engineering job that’s nature centered?",
        "author": "daddydav69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1185eh2/is_it_possible_to_have_a_mechanical_engineering/",
        "text": "[removed]",
        "created_utc": 1676991619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Azure cloud migration",
        "author": "Zaid_Barhoun10",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1185cnz/azure_cloud_migration/",
        "text": "[removed]",
        "created_utc": 1676991487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric kettles",
        "author": "zleveci",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118561i/electric_kettles/",
        "text": "[removed]",
        "created_utc": 1676990996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mechanical Engineering and Nature",
        "author": "daddydav69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11853mv/mechanical_engineering_and_nature/",
        "text": "hello, in 2 weeks i’m supposed to decide which discipline of engineering i would like to pursue. unfortunately i’m very conflicted. naturally i’m drawn to Mechanical, however i have a strong love for the environment, and nature. from doing some light research it seems like most mechanical engineers get stuck in offices especially if they would like to make money\n\nI also saw that civil engineering has some environmental aspects, and seems like i would get the opportunity to work a little closer to the environment and maybe even national parks. \n\nI’m just curious if anyone has any knowledge of mechanical engineers working with the environment/ working on environmental problems. thanks!",
        "created_utc": 1676990807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would I harnest more energy by putting 3 or 4+ blades on my fan?",
        "author": "Ancient_Lithuanian",
        "url": "https://www.reddit.com/r/AskEngineers/comments/118442w/would_i_harnest_more_energy_by_putting_3_or_4/",
        "text": "I trying to make a dyi wind turbine. I am going to buy either a metal or plastic pipe to cut wings out of. I know that technically the less blades, the more efficient the turbine is (even tho it is less stable), but I don't care about weight (because it won't be much either way) nor material usage. So, 3 blades or...?",
        "created_utc": 1676988076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turbulent Natural Convection Heat Transfer ANSYS Fluent",
        "author": "Dramatic-Collar-1276",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1183mvf/turbulent_natural_convection_heat_transfer_ansys/",
        "text": "[removed]",
        "created_utc": 1676986688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions for those working in the Space Industry about the effects of the industry on everyday people",
        "author": "Lloydyjr5",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1182rh7/questions_for_those_working_in_the_space_industry/",
        "text": "I am currently completing a school research project into how the Space industry affects everyday people as I hope to start a career in the industry in the future. As part of the project I would like to compare how everyday people view the industry as apposed to those who are working in the industry. The questions in the short questionnaire will also allow me to see how different roles in the industry affect everyday people differently. Any extra advice is welcome. \n\n[https://forms.gle/fU5g8JGNfXKk4MHMA](https://forms.gle/fU5g8JGNfXKk4MHMA)\n\nThank you for your help.",
        "created_utc": 1676984067,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Carbon Capture Storage on power plants didn't work out, why is Direct Air Capture still a thing?",
        "author": "Elfenbeinkokos",
        "url": "https://www.reddit.com/r/AskEngineers/comments/1181l8f/if_carbon_capture_storage_on_power_plants_didnt/",
        "text": "[removed]",
        "created_utc": 1676980065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on Poker Chip Counter Project",
        "author": "Heck_exe-Rootbeer334",
        "url": "https://www.reddit.com/r/AskEngineers/comments/117xulv/advice_on_poker_chip_counter_project/",
        "text": "I'm trying to make a device to count the value of the poker chips during a game (for anywhere from 2-8 people). I have a raspberry pi and need to buy some sort of sensors or cameras; does anybody have any advice for reliable and high quality cameras or any other components I might need that can be used for this? I have a background in computer science, but I'm relatively inexperienced with the hardware side.",
        "created_utc": 1676965735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help Me Out! Need to reduce Noise level from 69dbA to 62dbA",
        "author": "antigravit",
        "url": "https://www.reddit.com/r/AskEngineers/comments/117x1tr/help_me_out_need_to_reduce_noise_level_from_69dba/",
        "text": "I work for this Dot matrix printer manufacturing company, they tasked me out for reducing the noise level from 69dBA to 62dBA.",
        "created_utc": 1676962719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decoder for RVC. The main intention is to use the RVC with controllers so that it can be used for other projects. How should I proceed to this?",
        "author": "krvrs",
        "url": "https://www.reddit.com/r/AskEngineers/comments/117wp5z/decoder_for_rvc_the_main_intention_is_to_use_the/",
        "text": "",
        "created_utc": 1676961382,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your opinions on working in weapons design?",
        "author": "tapak_is_fubar",
        "url": "https://www.reddit.com/r/AskEngineers/comments/117uoqb/what_are_your_opinions_on_working_in_weapons/",
        "text": " I'm a 3rd year EE student, and I had a conversation with friend at lunch today about the ethics of working for companies such as Lockheed or Raytheon, specifically designing more lethal weapons.\n\nHe thinks that engineers have a duty to adhere to a \"do no harm\" code of ethics, and anything whose purpose is to take the life or injure another human being is unacceptable. His example is: If all engineers stopped making weapons, there would be no war, as there will be no weapons with which to fight.\n\nI personally think that as weapons designs get more advanced, they are enchanced to increase lethality towards real military targets, and reduce deaths towards non-combattants. The example that comes to my mind is the boming of European cities during WW2, where entire city blocks were vaporized in the hopes of hitting an important building, killing thousands of civilians. With our modern technology, a single GPS guided bomb is enough to accomplish the same task, while doing little to no collateral damage. Wars are unavoidable, and as an engineer, I can do my part to reduce unnecessary suffering towards civilians.\n\nI do recognize that I could have quite a bias towards the \"pro-weapons\" side, as I work as an officer in the reserve force. I'm absolutely open to ideas that challenge my worldview.\n\nWhat are your opinions on this matter?",
        "created_utc": 1676954685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this pump too good to be true (use would be water)? The power is 10 Watts, Voltage 110V, Current 0.24 A, flow rate (max) 5 GPM, and head (max) 10ft. (Side note: P=IV so how could power not equal 110*.24?)",
        "author": "FitFeedback5821",
        "url": "https://www.reddit.com/r/AskEngineers/comments/117t6re/is_this_pump_too_good_to_be_true_use_would_be/",
        "text": "Link to pump: https://m.vevor.com/beer-pump-c_10707/magnetic-drive-water-pump-mp-15r-stainless-head-beer-pump-for-homebrew-1-2-npt-p_010159850915?adp=gmc&amp;utm_source=google&amp;utm_medium=cpc&amp;utm_source=google&amp;utm_campaign=19645282996&amp;utm_term=144451125294&amp;gclid=EAIaIQobChMI187nwdSl_QIVkM-GCh2k_gP5EAQYBCABEgJ3s_D_BwE#_goodsSpec",
        "created_utc": 1676950101,
        "upvote_ratio": 1.0
    }
]