[
    {
        "title": "What can I expect from structural engineering report (limitations)?",
        "author": "Ok-Computer-8888",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11e1vig/what_can_i_expect_from_structural_engineering/",
        "text": "[removed]",
        "created_utc": 1677576670,
        "upvote_ratio": 1.0
    },
    {
        "title": "College credit for certifications?",
        "author": "woodropete",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dzwx3/college_credit_for_certifications/",
        "text": "Not entirely sure if this is the correct forum. But my question is has anyone had experience with getting college credits for certs, like six sigmas, pmp so on and so on?",
        "created_utc": 1677569082,
        "upvote_ratio": 1.0
    },
    {
        "title": "outside of oracle, any other providers that offers a free vps? I can't manage to sign up",
        "author": "randomusername11222",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dznvp/outside_of_oracle_any_other_providers_that_offers/",
        "text": "I get generic errors of sorts, like card not accepted and eccetera\n\ngoogling the issue might be fixed by the  customer service, but as I see in other threads they don't fix it\n\nprobably I'm flagging something in their end and I am considered as a bot, but I have no time to figure out that and playing till I get it right",
        "created_utc": 1677568119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Construction ‘Engineer’ - What are your thoughts? Who else in this group got an engineering degree but ended up working in construction management as a field engineer or project engineer?",
        "author": "JaredIsNotMyName",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dz1de/construction_engineer_what_are_your_thoughts_who/",
        "text": "[removed]",
        "created_utc": 1677565844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Construction ‘Engineer’",
        "author": "JaredIsNotMyName",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dyzyh/construction_engineer/",
        "text": "[removed]",
        "created_utc": 1677565709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineers!! What is the max weight capacity for a clinic on the corner of a 3rd floor commercial property?",
        "author": "crazyhob0000",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dyxt5/engineers_what_is_the_max_weight_capacity_for_a/",
        "text": "Hello everyone,\n\nI’m planning to create a physical therapy clinic in small space (about 14ft x 17.25ft). It’s located on the corner of a 3rd floor commercial building. I will need equipment, but whats the maximal load the floors can handle? \n\nFor example if i am going to bring a squat rack, bench and weights. What’s should i limit it to? Should I put weight around the boarders near the walls or towards the center of the building? I will be using a deadlift platform to help distribute  the weight. \n\nThank you for the answers!",
        "created_utc": 1677565505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice Regarding Usage of a Portable Spot Welder",
        "author": "SSDFADF",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dy1fj/advice_regarding_usage_of_a_portable_spot_welder/",
        "text": "Hey there folks, I had a question about the maximum thickness of metal that a miniature spot welder can be used to adhere to another piece of metal. I don't think I can add a link here, but the welder has a maximum output of 4.2V, 650A. I've used it in the past to weld nickel strips to batteries, but haven't exceeded a nickel strip thickness of 0.2 mm, and it's worked just fine for that. I need to adhere a shaft key to a driveshaft for a project I'm working on, and was wondering if any of you had experience using similar products to weld thicker pieces of metal. (Around 3-5 mm)",
        "created_utc": 1677562475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know any actual electroshapable material?",
        "author": "Mink_Aguero",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dy11e/does_anyone_know_any_actual_electroshapable/",
        "text": "I have been working on a project for which I need a material whose requirements seem to be fulfilled by something called \"Electroshapable Material\". I read about it on a wikipedia page of the same name for the first time. However, I am unable to find names of any such material in existence. Does anyone know if such a material even exists or is it just a hypothetical material?",
        "created_utc": 1677562440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electroshapable material",
        "author": "Mink_Aguero",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dxz3p/electroshapable_material/",
        "text": "[removed]",
        "created_utc": 1677562270,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I linearly actuate a 50ft long object within a very low profile?",
        "author": "CommonMale",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dvj65/how_can_i_linearly_actuate_a_50ft_long_object/",
        "text": "(Canada) I'm working on a design for moving a 50ft long object that weights about 3lbs/ft in a linear motion. I have about 7/8\" of vertical height to work with for putting anything underneath the object to shift/move it. The object needs to move fairly uniformly, and I can only put the force driving mechanism at the end of the 50ft. The 50ft long object needs to also be able to go back and forth through use of the driving mechanism. The object only needs to extend and retract once every 5 years. The assembly of the linear actuation mechanism would only be accessible before the 50 ft long (blue) object is put in place.\n\nI've been on the drawing board for this for quite some time now, so I was wondering if there's something I'm not seeing or have considered? Thanks!\n\n[Sketch](https://i.postimg.cc/tTCN5HTQ/schmovement.png)\n\nSo far I've looked into: \n1. Using a 50ft long steel shaft to wind a steel cable to pull through an anchor point to move the object, but it would only allow it to move to the right, and not back to the left. Additionally, I'm not able to find cable drums small enough to fit in the height limitation.\n\n2. 50ft long acme lead screw drive shaft to actuate a Scott Russell type mechanism, but this involves machining and welding of 6ft long acme lead screw shafts (from what I've found so far from McMaster-Carr). Preferably there wouldn't be machining involved due to the cost. The use of a Scott Russell mechanism also makes it more complicated and costly. This solution would be a last resort.\n\n3. Chain driven Scott Russell mechanism or a custom formed steel mechanism. The chain and sprocket would have to be mounted horizontally, which makes it a little more complicated in terms of providing proper tension and mounting.\n\n4. Rack and pinion. Pinion mounted on a 50ft shaft has too high of an outer diameter for the space limitation.\n\n5. Air/hydraulic jacks - Cost and leakage potential, but I haven't fully ruled this out yet. For the frequency of actuation, this seems overkill. I would also imagine there would be some leak in the mechanism or lines to cause the object location to shift over time.",
        "created_utc": 1677554612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to have a loss of containment event from a centrifugal pump cavitating?",
        "author": "cwm83",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dub90/is_it_possible_to_have_a_loss_of_containment/",
        "text": "I’ve come across a pump running light end hydrocarbons that is vibrating and operating inefficiently. Assumption is that it’s cavitated. If it continues to run is the only possible outcome damage to the pump or is it possible for there to be a loss of containment and release?",
        "created_utc": 1677551133,
        "upvote_ratio": 1.0
    },
    {
        "title": "types of blades and uses",
        "author": "lutfeerene",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11du7u9/types_of_blades_and_uses/",
        "text": "[removed]",
        "created_utc": 1677550866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aside from McMaster Carr, where do you all buy low cost fasteners / shoulder screws from?",
        "author": "y2k_o__o",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ds01x/aside_from_mcmaster_carr_where_do_you_all_buy_low/",
        "text": "McMaster Carr has a great variety of fasteners and their shipping is FAST which is super great for prototyping, but when it comes to production, their price is not really realistic.\n\nI wonder where you all folks procure low cost but a large variety of fasteners like McMaster Carr?",
        "created_utc": 1677544765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you control two separate devices with one remote control?",
        "author": "Onebilliongoggles",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11drexr/can_you_control_two_separate_devices_with_one/",
        "text": "",
        "created_utc": 1677543211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Catching up knowledge wise for ceramic engineering MS",
        "author": "JJcoolJAX",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11drcpu/catching_up_knowledge_wise_for_ceramic/",
        "text": "Hi, I am a Ceramic BFA graduate and I’m considering a pivot to Ceramic engineering. MS. One of the things that I’ve been trying to do is catch up on all the necessary knowledge that I need to accumulate to be able to make this pivot a little bit more easier for me and I was just curious if anyone had any books or websites or anything at all that would help catch me up in this field as I’ve been having a really hard time finding some of the information and I haven’t been able to find anything in any of the engineering forms I’ve been looking at, thank you for any help or assistance",
        "created_utc": 1677543039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ceramic engineering questions",
        "author": "JJcoolJAX",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dr7b8/ceramic_engineering_questions/",
        "text": "[removed]",
        "created_utc": 1677542643,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I linearly actuate a 50ft long object in a very low profile?",
        "author": "CommonMale",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dr6t9/how_can_i_linearly_actuate_a_50ft_long_object_in/",
        "text": "(Canada) I'm working on a design for moving a 50ft long object that weights about 3lbs/ft in a linear motion. I have about 7/8\" of vertical height to work with for putting anything underneath the object to shift/move it. The object needs to move fairly uniformly, and I can only put the force driving mechanism at the end of the 50ft. The 50ft long object needs to also be able to go back and forth through use of the driving mechanism. The object only needs to extend and retract once every 5 years. The assembly of the linear actuation mechanism would only be accessible before the 50 ft long (blue) object is put in place.\n\nI've been on the drawing board for this for quite some time now, so I was wondering if there's something I'm not seeing or have considered? Thanks!\n\n[Sketch](https://ibb.co/Q6Kps7g)\n\nSo far I've looked into: \n1. Using a 50ft long steel shaft to wind a steel cable to pull through an anchor point to move the object, but it would only allow it to move to the right, and not back to the left. Additionally, I'm not able to find cable drums small enough to fit in the height limitation.\n\n2. 50ft long acme lead screw drive shaft to actuate a Scott Russell type mechanism, but this involves machining and welding of 6ft long acme lead screw shafts (from what I've found so far from McMaster-Carr). Preferably there wouldn't be machining involved due to the cost. The use of a [Scott Russell](https://mito3d.fra1.digitaloceanspaces.com/3Dprintmodels/thingiverse0/Thing342301) mechanism also makes it more complicated and costly. This solution would be a last resort.\n\n3. Chain driven Scott Russell mechanism or a custom formed steel mechanism. The chain and sprocket would have to be mounted horizontally, which makes it a little more complicated in terms of providing proper tension and mounting.\n\n4. Rack and pinion. Pinion mounted on a 50ft shaft has too high of an outer diameter for the space limitation.\n\n5. Air/hydraulic jacks - Cost and leakage potential, but I haven't fully ruled this out yet. For the frequency of actuation, this seems overkill. I would also imagine there would be some leak in the mechanism or lines to cause the object location to shift over time.",
        "created_utc": 1677542606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do pilots get severe sunburns?",
        "author": "stuck_key",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dozc0/do_pilots_get_severe_sunburns/",
        "text": "When I ride in my car on a sunny day, and the sun shines on my skin for prolonged periods, I usually get red skin on these areas or a mild burn.\n\nThat said, I'm asking myself if pilots wear strong sunscreen. Or if skin cancer is a prevalent problem among aviators. Because above the clouds, it's always a sunny day. And (on TV) I see pilots very often exposed to sunlight: on arms , face, neck, etc. For very extended periods. And I never hear pilots talk about the impact of UV rays.",
        "created_utc": 1677537070,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are CAD units standardized?",
        "author": "LaserRanger_McStebb",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dodma/how_are_cad_units_standardized/",
        "text": "I'm a tooling engineer and I use CAD every day, and even use it at a hobbyist capacity while at home.\n\nToday, I took an old CAD model from a file that was made in SolidEdge... then used NX to open it, and then exported it as a STEP file so I could send it to a vendor who uses SolidWorks.\n\nI checked the model's critical dimensions against the drawing we had on file... and everything was dead on.\n\nThis sparked a question in me.  I converted this model 2 or 3 times during its journey, and each time the critical dimensions stayed consistent.\n\nWe have traceable standards for pretty much every ISO unit of measurement you can think of, for mass, length, time, etc...\n\nHow do CAD applications define &amp; standardize what a \"millimeter\" is? How do CAD applications interpret what a \"millimeter\" is? Do they use their own proprietary \"magic unit\" that a 3D rendering engine can understand and interpret?\n\nThis is fascinating to me.",
        "created_utc": 1677535570,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is worth to take quality inspectors role to start?",
        "author": "jzadlv180",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dn9wd/it_is_worth_to_take_quality_inspectors_role_to/",
        "text": "So I have been struggle to get a job as an recent graduate chemical engineering or any engineer role. I can't past any futher than the interviews or the psychometric tests. \n\nI been thinking on taking quality inspector role but some friends told me that it doesn't add to much to my resume. What are you experiences with this? \n\nI'm starting to lose all hope to be fair.",
        "created_utc": 1677532906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crane 410 Limitations in Rough Vacuum",
        "author": "unexpectedengineers",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dmkva/crane_410_limitations_in_rough_vacuum/",
        "text": "I've been working on sizing piping lines for a process project and ran into some lines that got into super low pressures (&lt;0.01 bar). I've been using the Crane Paper for determining acceptable line sizes, but I am getting some crazy high pressure drops when the pressure starts that low. Are there any limitations on the use of Crane? If so, what other methods would be preferred? Thanks for the help!",
        "created_utc": 1677531278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be worth it to eventually get a second masters because you were disappointed with the first and/or want to transition into a different subfield?",
        "author": "azncommie97",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dm0jl/would_it_be_worth_it_to_eventually_get_a_second/",
        "text": "Hello r/AskEngineers,\n\nI'm an American who moved to the EU more than two years ago to study for a fully funded international masters program in France and Italy. I finished last October, and a few weeks ago started working a full-time job in France. Overall, at 25, I'm quite happy with where I am in life at the moment, and see myself staying abroad and working for at least the next few years.\n\nHowever, one part somewhere in the back of my mind just refuses to give up the idea of pursuing a second masters one day. This is mostly because in fact, I gained very little from my masters academically. By and large I either studied what I had already studied in undergrad in the US, or the new subjects were taught so horrendously that I effectively learned nothing (looking at you, Italy). It's to the point where I'm almost reluctant to say I have a masters in the first place.\n\nThe other part is that I want to \"properly\" transition into communications engineering. On paper, I've studied RF/microwave engineering quite a lot, as well as a bit of photonics, even if I still feel like I don't know much (my imposter syndrome has become much worse after the masters too). On the other hand, what I'v recently become a lot more interested in is the actual digital modulation/DSP side of things. I've taken it upon myself to self-study a little bit, but otherwise have minimal classroom experience in those subjects, and zero professionally.\n\nGiven that, could it ever be worth it to go back to school eventually for a second masters? The rational part of me says no - I'm halfway done with my 20s, have a stable income and a nice apartment in a foreign country where I'm quite happy, and there's other non-engineering things I want to do with my life. But still, I can't help but entertain the thought - I know people who have done it. At the same time, I recognize that while it's paid off for them, my circumstances and desires don't necessarily correspond to theirs.\n\nI'm not opposed to doing it in the US at my alma mater specifically (in-state tuition, and it's quite reputable in my areas of interest). If I were to do it in France, I would do it in an école d'ingénieur and in French. Other than that I would mainly consider Germany (a English-taught program) as a third option - I'd already considered it for my masters, and it has been worth it for a college friend who's gone there.\n\nOr should I just ditch all of those ideas and just self-study the parts that I'm interested in? There's plenty of online resources and textbooks, after all, and I have pretty good experience with Python, which seems particularly ideal for modulation/DSP applications. Some basic hardware for simple projects shouldn't be that expensive either. What remains to be seen is if I actually have the motivation do any of that outside of the job...\nand of course, on the job itself I could try to position myself for projects that deal with communications since I'm at a consultancy company. They seem pretty flexible.\n\nTaking everything into account, what advice do y'all have for me given my situation? Especially if any of y'all have already done a second masters and/or considered it. Input from those who work in communications engineering, as well as people who have lived/studied/worked abroad in general is also more than welcome.\n\nThanks in advance.",
        "created_utc": 1677529921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to design a wheelchair ramp that can be packed away.",
        "author": "EDtheROCKSTAR",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dlzju/need_to_design_a_wheelchair_ramp_that_can_be/",
        "text": "Hello all,\n\nMy BIL is in a power-chair and needs a ramp to enter my MIL's house.  They've currently jerry-rigged a system that is working, but needs to be better long-term.\n\n[Here](https://imgur.com/a/yWG11wa) is most of the space.  There is a covered driveway (carport) here and the driveway runs downhill towards the street.\n\nWe've tried to come up with some ideas but the contractors are wanting to meet municipal codes (anticipating it'd be permanent) and/or the length required would be prohibitive to easily accessing the backyard, or using the covered portion of the driveway.\n\nAny ideas?\n\nMeasurements:\n\nTop deck is 74\" x 118\"; Steps extend 58\" from end of deck; there is 47\" clearance from base of stairs to shed; driveway is 191\" wide where the deck is; the deck is 39.25\" high from the driveway.",
        "created_utc": 1677529860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some advice on starting a business",
        "author": "leapingfro9",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dlafq/need_some_advice_on_starting_a_business/",
        "text": " During the SPAC boom in 2021, I saw lots of company with simple and somewhat ridiculous (no offense) ideas go successful and went public, making me think that maybe any engineer could start a successful business. I personally have a good business idea but I have no idea where to start! Where do I get people for R&amp;D? How do I do graphical design of my product? Where do i set up a lab? Where do I get investment from? etc... \n\n&amp;#x200B;\n\nAny helpful tip is appreciated.. Thanks!",
        "created_utc": 1677528191,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good resource to gain basic understand of most engineering concepts?",
        "author": "sarnold95",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dkfuy/what_is_a_good_resource_to_gain_basic_understand/",
        "text": "Wondering if anyone has already done this before. Computer Science has tons of resources to learning. But I don’t see any curriculums put together for online learning of engineering disciplines.",
        "created_utc": 1677526124,
        "upvote_ratio": 1.0
    },
    {
        "title": "What projects cant use steel fibers in replacement for rebar?",
        "author": "thoughtdrops",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dkfdm/what_projects_cant_use_steel_fibers_in/",
        "text": "Im looking to make a dome home that is naturally a superstructure in shape, but im learning about rebar. Steel fibers, It looks like a better and faster product for concrete reinforcing to use in some cases. \n\nI cant find percentages on the amount of tensile strength increase of typical rebar or even heavy duty wire mesh, in comparison to steel fibers. I only hear their is situations where one is better than another. \n\nAre steel fibers not good for load bearing structures? or if any other issues are present with steel fibers in comparison to rebar, please let me know. thank you",
        "created_utc": 1677526092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Alternative to Truss4 and vertex BD.",
        "author": "Creative-Anteater276",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11djldv/any_alternative_to_truss4_and_vertex_bd/",
        "text": "[removed]",
        "created_utc": 1677524104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low Profile Linear Actuation for a 50ft Long Object",
        "author": "CommonMale",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dja58/low_profile_linear_actuation_for_a_50ft_long/",
        "text": "I'm working on a design for moving a 50ft long object that weights about 3lbs/ft in a linear motion. I have about 7/8\" of vertical height to work with for putting anything underneath the object to shift/move it. The object needs to move fairly uniformly, and I can only put the force driving mechanism at the end of the 50ft. The 50ft long object needs to also be able to go back and forth through use of the driving mechanism. The object only needs to extend and retract once every 5 years. Moving right is expected to encounter a greater friction resistance than going left for it's application (about as much as rubbing your hands together). The assembly of the linear actuation mechanism would only be accessible before the 50 ft long (blue) object is put in place.\n\nI've been on the drawing board for this for quite some time now, so I was wondering if there's something I'm not seeing or have considered. Thanks!\n\n[Sketch](https://ibb.co/Q6Kps7g)\n\nSo far I've looked into:\n1. Using a 50ft long steel shaft to wind a steel cable to pull through an anchor point to move the object, but it would only allow it to move to the right, and not back to the left. Additionally, I'm not able to find cable drums small enough to fit in the height limitation.\n\n2. 50ft long acme lead screw drive shaft to actuate a [Scott Russell](https://mito3d.fra1.digitaloceanspaces.com/3Dprintmodels/thingiverse0/Thing342301) type mechanism, but this involves machining and welding of 6ft long acme lead screw shafts (from what I've found so far from McMaster-Carr). Preferably there wouldn't be machining involved due to the cost. The use of a Scott Russell mechanism also makes it more complicated and costly. This solution would be a last resort.\n\n3. Chain driven Scott Russell mechanism or a custom formed steel mechanism. The chain and sprocket would have to be mounted horizontally, which makes it a little more complicated in terms of providing proper tension and mounting.\n\n4. Rack and pinion. Pinion mounted on a 50ft shaft has too high of an outer diameter for the space limitation.\n\n5. Air/hydraulic jacks - Cost and leakage potential, but I haven't fully ruled this out yet. For the frequency of actuation, this seems overkill.",
        "created_utc": 1677523342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aero or mechanical engineering for grad school?",
        "author": "orangeapple24",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11disw4/aero_or_mechanical_engineering_for_grad_school/",
        "text": "Hello! I’m doing my undergrad in business analytics with hopes to go into any field of security, data analysis/science. \n\nI also want to pursue an engineering degree but don’t know which one. Aero and mechanical are two I’m pretty interested in but idk how related it is to my future career path.\n\nAny help would be appreciated it!",
        "created_utc": 1677522200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can’t they make a solid state guitar amp that sounds identical to a tube amp?",
        "author": "Weekly_Bathroom_101",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dimth/why_cant_they_make_a_solid_state_guitar_amp_that/",
        "text": "Accepted knowledge in the guitar community says that it’s impossible to replicate the sound of a tube amp using transistors, and further processing can only imitate, but not replicate the sound.\n\nWhy is this true? Is there something about a vacuum tube that makes it a particularly difficult physical system to simulate digitally?",
        "created_utc": 1677521802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easier material to prototype with?",
        "author": "nojobnoproblem",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dih5d/easier_material_to_prototype_with/",
        "text": "I’ve been prototyping building a [pochade box](https://www.virtualartacademy.com/pochade-box/) but it’s been difficult building a prototype out of wood which takes a lot of work, especially since I don’t have a lot of tools to work with. Is there an easier lower fidelity prototyping material I can work with with very limited hand tools?\nI was thinking some kind of cardboard maybe?",
        "created_utc": 1677521435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got an undergrad in Chemistry, worked as a Process Engineer in a Manufacturing Facility for a few years. Is there anything I can do online to learn Engineering concepts on my own?",
        "author": "sarnold95",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11di65y/got_an_undergrad_in_chemistry_worked_as_a_process/",
        "text": "In Project Management now, but really love engineering and wish I could go back to do my undergrad in an engineering discipline. I love learning new processes, working with my hands, building and fixing things, and learning how the world works. Really just want to learn more about engineering concepts for my own personal education. Thermo, dynamics, fluid, etc. \n\nAre there any resources out there where I could get the basics down? Where would I start?",
        "created_utc": 1677520737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need to interview an engineer for my class within the next day or two, please help.",
        "author": "Weird_Restaurant_662",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dhfyo/need_to_interview_an_engineer_for_my_class_within/",
        "text": "[removed]",
        "created_utc": 1677518923,
        "upvote_ratio": 1.0
    },
    {
        "title": "An alternative of RS online/misumi for europe but that sellsto private customers and with abbordable price/quantities?",
        "author": "randomusername11222",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dgwfl/an_alternative_of_rs_onlinemisumi_for_europe_but/",
        "text": "",
        "created_utc": 1677517602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have a list of questions that I should prepare answers to for my first real interview for a part time engineering job?",
        "author": "ILikeScience7",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dgjst/does_anyone_have_a_list_of_questions_that_i/",
        "text": "[removed]",
        "created_utc": 1677516772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting ready to take AFE's CPE (Certified Plant Engineer) exam. Any tips/tricks/pointers?",
        "author": "werdly",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dgjmz/getting_ready_to_take_afes_cpe_certified_plant/",
        "text": "Hi!\n\nTitle says it all. I was accepted to take the CPE exam and am looking for any tips/tricks/pointers I can get on it!\n\nDisclosure: I'm not an engineer by study but worked my way up to the position of Facility Engineer over about 10 years of progressive advancement in my career. I have a journeyman's electrical license in my state which I used as a stepping stone into the field and then moved up from there.\n\nI received the study binder and proceeded to read through the entire thing cover to cover. I skipped the questions at the end of each chapter in order to get through the material and now am going back and checking them out. Out of the 12 different fields there are about 4-5 that I'm lacking in, especially the maths and equation sections. It's probably been about 20 years since I took any kind of test, so I'm ultra rusty (I am also taking the CFM cert, but that's not math intensive).\n\nHow much math/equations are on the exam? Are there any resources that are allowed to help? Anything I should be focusing on?\n\nAny advice or help that you can give would be greatly appreciated.\n\nThanks in advance!",
        "created_utc": 1677516761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exhaust design explanation (1 into 2 then 2 into 1)",
        "author": "ImSomethingMyself",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dgirq/exhaust_design_explanation_1_into_2_then_2_into_1/",
        "text": "I see Volvo using exhaust systems that come from a single downpipe into a Y pipe, which connects to the mid pipe, then another Y pipe back into a single exhaust pipe to the muffler. \n\nexamples\n\n[downpipe](https://i.ebayimg.com/images/g/9JwAAOSwPjxfmU-z/s-l1600.jpg)\n\n[midpipe](https://uploads.tapatalk-cdn.com/20161230/10bf2b81446cc7a65b6d187bc6beefaa.jpg) \n\n&amp;#x200B;\n\nIs there anything to this design that stands out (improved flow/sound) or is there some basic reasoning behind this? I have never seen such a design before.",
        "created_utc": 1677516700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Production problem. Large scale manufacturing of part inhibited by tooling. Looking for advice/designs. Details in post.",
        "author": "bbSplunge",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dfvif/production_problem_large_scale_manufacturing_of/",
        "text": "I am attempting to create a fixture to press the cadmium plated piece with the lock ring into the dry lubed piece. Success was found with a modified pair of pliers to compress the lock ring while using an arbor press but this is not sustainable for large scale production. There are keys protruding from the dry lubed piece that impede the use of a tapered design to compress the lock ring on the cadmium plated piece. Any ideas? No changes to the design are permitted. I have access to SLS, SLA and FDM additive manufacturing as well as a complete machine shop with all readily available metals and plastics. \n\n[Pictures of parts](https://imgur.com/a/s3ZxRNA)",
        "created_utc": 1677515102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using fighter jet turbine engine in space rockets?",
        "author": "Unusual-Scallion126",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11debxf/using_fighter_jet_turbine_engine_in_space_rockets/",
        "text": "[removed]",
        "created_utc": 1677511166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Monday (27 Feb 2023): Have a question about your job, office, or pay? Post it here!",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dcjkm/career_monday_27_feb_2023_have_a_question_about/",
        "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
        "created_utc": 1677506474,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a simulation engineer?",
        "author": "anonymous375555",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dc6no/what_is_a_simulation_engineer/",
        "text": "Hello\n I am a graduate mechanical design engineer. Throughout my brief two years working experience I really heated my job I barely worked on anything that I can describe as engineering. People generally didn’t calculate anything the would just over design the part and it will work so my job was reduced to just drawing or reverse drawing and maybe deal with empirical best design practices at best. Anyhow during this period,I developed an interest in GPGPU and I felt like the answer to my design doubts is computer simulations. So my question is can make a living by making computer simulations?. What do I need to know? Where can I work? And would it pay will? And if someone had the same experience working as a mechanical engineer?",
        "created_utc": 1677505483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simulation Engineer",
        "author": "anonymous375555",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dc5c8/simulation_engineer/",
        "text": "[removed]",
        "created_utc": 1677505377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be better to get a bachelor's from an Ivy or a master's from a non-Ivy?",
        "author": "dylans2090",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11dc3bg/would_it_be_better_to_get_a_bachelors_from_an_ivy/",
        "text": "I am hopefully going to be in the engineering field. I have a potential opportunity to get a second bachelor's degree from an Ivy or a master's from a non-Ivy. They would take about the same amount of time. Which one is more beneficial?",
        "created_utc": 1677505216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fastener that allows movement",
        "author": "Bennett567",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d8yu5/fastener_that_allows_movement/",
        "text": "Hi!\n\nI am currently on an internship on my gap year before Uni, so this might be a very simple question, but I couldn't find a solution on my own. I have two coincident plates, and currently I have them screwed together. However I would like to change it so that I can move the plates away from each other (about 7mm). I was wondering if there is a fastener that allows this sort of movement, but blocks movement above the specified distance.\n\n&amp;#x200B;\n\nThank you very much!",
        "created_utc": 1677494985,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're working near hydrogen fuel tanks. Will they explode?",
        "author": "ThrowawayBone333",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d7l60/if_youre_working_near_hydrogen_fuel_tanks_will/",
        "text": "How do you prevent it?",
        "created_utc": 1677489842,
        "upvote_ratio": 1.0
    },
    {
        "title": "What equations are used for calculating thermal expansion for tolerancing?",
        "author": "AnonInTheRed",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d7ild/what_equations_are_used_for_calculating_thermal/",
        "text": "Which equations are used to determine thermal expansion for cylinders and other objects? I’m interested in designing press-fit parts and was wondering what is the best approach to figure out the proper tolerances and the correct force required for certain fits/materials.",
        "created_utc": 1677489572,
        "upvote_ratio": 1.0
    },
    {
        "title": "what should be the shape of a motor slot ?",
        "author": "Professional_Snow200",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d7bdb/what_should_be_the_shape_of_a_motor_slot/",
        "text": "Hi everyone,\n\nI'm an engineering student and I have a project where I'd like to design a small iron core linear motor, I know there is a problem with cogging and so i'd like to mitigate it as much as possible, i've already decided on a 12 Slot 14 Pole design, the motor itself shouldn't be longer that 120mm so I can't really fit anymore slots in. looking on [https://www.bavaria-direct.co.za/scheme/calculator/](https://www.bavaria-direct.co.za/scheme/calculator/) it should give me 84 steps per \"turn\", according to [https://things-in-motion.blogspot.com/2019/01/selecting-best-pole-and-slot.html](https://things-in-motion.blogspot.com/2019/01/selecting-best-pole-and-slot.html) the slot/pole combination looks ok. \n\nNow I found a local winding shop that gave me some leftover .3mm enamel wire, I also have a roll of 1mm wire on hand but it's much too thick so i'll stick with the .3mm wire for the time being. I haven't yet decided on the supply voltage but i'm waiting on winding the coils to see what resistance they have and choose accordingly. \n\nI'm planning on skewing the permanent magnets to reduce the cogging torque but I also read somewhere that the shape of the slots also affected the cogging torque, so i was wondering roughly  what kind of shape i should use? \n\nI know that ultimately I should use FEM to design the motor but I'm not quite finished with that class so I don't yet know how to :) but it will come! \n\nthanks!",
        "created_utc": 1677488800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Recommendations.",
        "author": "champaklal69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d686m/book_recommendations/",
        "text": "[removed]",
        "created_utc": 1677484645,
        "upvote_ratio": 1.0
    },
    {
        "title": "End cap size for pipe fitting",
        "author": "ChaosToTheFly123",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d57zu/end_cap_size_for_pipe_fitting/",
        "text": "I need to design an end cap for a 12mm OD pvc tube. I just realized I have no idea how big the end caps actually are. How much bigger should the end cap be for a snug fit?",
        "created_utc": 1677480854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a 24 VDC LED strip be powered by three 9V batteries?",
        "author": "Rehtael",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d331w/can_a_24_vdc_led_strip_be_powered_by_three_9v/",
        "text": "The total project is very complicated to explain, but the big thing is that I need to power roughly 2.5ft of flexible LED strip with some batteries. It's a very lightsaber-y project in nature, so it'll have a handle which could conceal a number of common battery types, but nothing big or bulky. So if 3x 9V doesn't work, would there be alternatives?\n\nThe LED strip in question is here: \nhttps://www.superbrightleds.com/custom-length-single-color-led-strip-light-eco-series-tape-light-24v-ip20-stn-x-b6a-08b1m-24v#specifications+color-Yellow",
        "created_utc": 1677473452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor's in Engineering Technology",
        "author": "DailyDoseofAah",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d20n6/bachelors_in_engineering_technology/",
        "text": "I’ll be graduating this fall with an associate's degree in Mechatronics and plan on starting my career afterward to get a feel for what I like and if I discover something I want to go back for my bachelor’s. I’m currently looking at a bachelor's degree in engineering technology, but I’m worried I might waste my time and money. I've read good and bad, mostly bad comments here on Reddit about engineering technology and I would like some insight on if it is worth it. The main reason I'm looking at the program is because I like doing hands-on work and I want to do hands-on engineering. I’m located in Washington State so if anyone has any expertise in this area, it would be greatly appreciated.\n\nIn case this is helpful/relevant, I have work experience from the military and plan on doing an internship over the summer.",
        "created_utc": 1677470123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here drop engineering altogether? Mid-career engineer experiencing burnout / loss of motivation.",
        "author": "imnowswedish",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d1s1b/anyone_here_drop_engineering_altogether_midcareer/",
        "text": "[removed]",
        "created_utc": 1677469382,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of your favorite Engineering youtube channels?",
        "author": "SuspiciousAnteater63",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d0sjg/what_are_some_of_your_favorite_engineering/",
        "text": "[removed]",
        "created_utc": 1677466437,
        "upvote_ratio": 1.0
    },
    {
        "title": "what engineering field does this belong to?",
        "author": "holachicaenchante",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d0cqs/what_engineering_field_does_this_belong_to/",
        "text": "hey everyone, i recently came across sustainable engineering innovations like [fabrics made out of waste](https://milonicki.com/pages/fabricsandmaterials),[fabrics made out of different plants](https://pangaia.com/pages/impact-innovative-materials) and other like-minded ideas. what field or sub-field does this come under? and more importantly, what do i study to have more knowledge of the science behind: \n\n1. which waste/organic materials can realistically be converted to a fabric?\n2. what processes are frequently used to convert these materials into wearable fabrics?\n3. what science fundamentals are important to know for this?",
        "created_utc": 1677465119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tolerances for Centre of Gravity in Drawings?",
        "author": "9Brkr",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11d07i6/tolerances_for_centre_of_gravity_in_drawings/",
        "text": "I am working on a project that requires me to prepare and annotate drawings for a customer. The drawing itself contains some tolerances for certain dimensions of the part due to slight differences in the manufacturing process, but the customer requested for the CG to be included.\n\nIt made sense in my head that there will be slight differences in the calculated CG as opposed to what is calculated by CAD software, hence I included some tolerances in the CG. However, the customer pointed out that they do not expect CG to have tolerances. Am I wrong for including the tolerance or is there a better way to indicate the CG? Do I just put the theoretical CG in the drawing based on the CAD software?",
        "created_utc": 1677464699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biomedical Engineering",
        "author": "5730029121",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11czuu3/biomedical_engineering/",
        "text": "[removed]",
        "created_utc": 1677463651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adhesive Suggestions for 6061 Aluminum insert bonding",
        "author": "aCoyleBoydAdventure",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11czi0k/adhesive_suggestions_for_6061_aluminum_insert/",
        "text": "I am looking for advice for an adhesive that bonds a 6061 shaft to a 6061 hole.\n\n* No extreme temperatures (to be used outside in normal conditions)\n* Has to be strong in shear\n\nThanks for any suggestions! Links would be awesome so that I can design the insert gap based on bond gap.",
        "created_utc": 1677462662,
        "upvote_ratio": 1.0
    },
    {
        "title": "book",
        "author": "ahmed1631993",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cx9ek/book/",
        "text": "[removed]",
        "created_utc": 1677456438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teacher going back to school",
        "author": "MrDakerboy",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cwywa/teacher_going_back_to_school/",
        "text": "[removed]",
        "created_utc": 1677455716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice please!?",
        "author": "MuzicarXII",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cwuat/any_advice_please/",
        "text": "[removed]",
        "created_utc": 1677455392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do manufacturers of 3-Phase NEMA B Motors publish torque curves? If not, how do you use the typical breakaway torque percentages to select a motor to drive a hydraulic pump?",
        "author": "Interesting_Main8079",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cwacc/do_manufacturers_of_3phase_nema_b_motors_publish/",
        "text": "[removed]",
        "created_utc": 1677454072,
        "upvote_ratio": 1.0
    },
    {
        "title": "What (tech)YouTubers are you following and why?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cug7f/what_techyoutubers_are_you_following_and_why/",
        "text": " I’ll go first. I love watching fireship.Short videos that make me enough familiar with a new technology that I can decide to learn it or not.",
        "created_utc": 1677449671,
        "upvote_ratio": 1.0
    },
    {
        "title": "What stable career alternatives could I pursue outside of mechanical engineering as someone with 12+ years of SolidWorks CAD experience?",
        "author": "NeonLights84",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cuau1/what_stable_career_alternatives_could_i_pursue/",
        "text": "[removed]",
        "created_utc": 1677449314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today's experiment with my 5yr old had us melt a broken microSD and check out the insides with an optical microscope. Can someone clarify what we're looking at? Is this matrix actually illustrating data bits? I'd be shocked if it were &amp; want to correctly explain.",
        "author": "salukikev",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cu86y/todays_experiment_with_my_5yr_old_had_us_melt_a/",
        "text": "[https://imgur.com/a/pKBvONa](https://imgur.com/a/pKBvONa)",
        "created_utc": 1677449141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Independent vs linked suspension use cases?",
        "author": "TRIPMINE_Guy",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cu0b9/independent_vs_linked_suspension_use_cases/",
        "text": "I've been watching some offroad vehicle videos and I notice the buggies for going across dirt fields have each wheel with its own suspension. However, the rock crawlers that climb up extremely steep rocky terrain have the wheels linked in suspension, so an impact on the front left will also affect the front right wheel. It seems pretty consistent in all the videos I've seen so I'm curious why is one used for one but not the other?\n\n&amp;#x200B;\n\nAlso do road cars have linked or independent suspenson?",
        "created_utc": 1677448638,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to attach a pulley to the top of a pole?",
        "author": "snottnosedkidd",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ctydz/how_to_attach_a_pulley_to_the_top_of_a_pole/",
        "text": "So that the load is spread down the pole in compression. \n\nPrevious design attempts has the pulley off centre from the top of the pole and lead to pole flexion, etc. \n\nAlso, how to strengthen it? I’m imagining a pulley between two vertical prongs mounted atop the pole or a triangular/gusset configuration. \n\nI would like to achieve MBS of +/- 2000lbs. \n\nWorking on a tree house for my kids and want to hoist materials without renting a crane/lift/etc. \n\n\nI have raw materials and access to a reputable fabricator.",
        "created_utc": 1677448518,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to attach a pulley to the top of a pole?",
        "author": "ArborImperium",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ctvle/how_to_attach_a_pulley_to_the_top_of_a_pole/",
        "text": "[removed]",
        "created_utc": 1677448335,
        "upvote_ratio": 1.0
    },
    {
        "title": "attaching a pulley on top of a pole",
        "author": "ArborImperium",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ctqi6/attaching_a_pulley_on_top_of_a_pole/",
        "text": "[removed]",
        "created_utc": 1677448001,
        "upvote_ratio": 1.0
    },
    {
        "title": "HVAC, Renewables, Design or any other?",
        "author": "MuzicarXII",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ctksj/hvac_renewables_design_or_any_other/",
        "text": "[removed]",
        "created_utc": 1677447624,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Ideas on how to move this without heavy machinery?",
        "author": "jlenzen070",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ct5yx/any_ideas_on_how_to_move_this_without_heavy/",
        "text": "I was hiking the other day and came across an old abandoned bunker in the middle of no where with a huge 3ft x 3ft x 1ft cement block covering the top of it and I've been wanting to know I'd it would be possible to move it ever since. here is a picture of the block: https://drive.google.com/file/d/1Fj8CV1S1PV0mVCN2yZXkJ5N9vGE8wnR2/view?usp=drivesdk . Any help with this would be greatly appreciated!",
        "created_utc": 1677446662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice for capstone project: Portable bidet with solar-powered mechanism and motion sensor",
        "author": "technicallyanotaku",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cpa2c/seeking_advice_for_capstone_project_portable/",
        "text": "I'm a twelfth grade STEM student currently working on a capstone project that involves developing a portable bidet with advanced mechanisms and environmentally friendly designs, ran by a solar-powered mechanism. Our goal is to offer a practical and convenient personal hygiene solution for everyone, now that there is a renewed consciousness about sanitation among public places. In the long run, normalized collective usage of such portable devices may help those who do not have access to clean water due to water scarcity—in the ideal sense.\n\nWe've run into some challenges in the development of the prototype, specifically with regards to incorporating motion sensors, solar power batteries, and a controlled-water-expeller automation (a system that automatically controls the flow of water to provide a specific amount per use), as they are quite expensive. We've also considered adding a heating mechanism as an easier alternative for the first elements, but are unsure how to proceed. These features are designs that existing portable bidets don't have, but designing the heating mechanism or controlling the water flow are technical aspects that we don't have a clue about.\n\nWe're thinking of considering alternative sources for motion sensors and solar power batteries (we have no idea), or looking for suppliers who offer lower prices for refurbished or secondhand components. \n\nQuite frankly, I think we are in over our heads taking on this project, but our research adviser's the one who pushed the team to take this on irrationally. We're going in blind as we do not have any technical knowledge to build the prototype, much less start making even its external output. We've also thought to modify existing commercialized portable bidets, and simply install parts we will find to be economical (to which we also don't have a clue where to look)—but therein lies the problem of the project being our intellectual property by the end of the study, and we may encounter problems regarding the final prototype's property rights, or asking its manufacturer permission for educational purposes. We're concerned that modifying an existing product may compromise the original manufacturer's intellectual property rights, as well. Doing it this way also seems defeative of a capstone project's purpose. \n\nThe one person I went to for help advised us to look for a new idea. He didn't think it feasible with our limited knowledge and capabilities, and I agree. However, the problem lies in my research adviser. They want us to continue and defend this because, \"I know you, guys. With what I know of your intelligence and abilities, you need to be more ambitious.\"\n\nAs engineering experts, we would greatly appreciate any advice or insights you could offer on how to overcome these challenges and successfully develop a functional and cost-effective prototype. Do you have any idea about where we can find alternative sources for motion sensors and solar power batteries? How should we design and install the features of the bidet and the bidet itself? Primarily, we want for the prototype to take on a do-it-yourself design. It needn't be high-tech, at all, because going way above our capabilities and resources is too ambitious. Additionally, if you have any experience with similar projects, we would love to hear about your process and any lessons you learned along the way. I thought to ask for help in this subreddit as I don't have anyone else to turn to. Any constructive criticisms are badly needed. \n\nThank you in advance for your help and expertise!",
        "created_utc": 1677437512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking help for capstone project: Portable bidet with solar-powered mechanism and motion sensor",
        "author": "andigomezaraund",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cp8w9/seeking_help_for_capstone_project_portable_bidet/",
        "text": "[removed]",
        "created_utc": 1677437434,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to calculate the forces needed for a scissor lift?",
        "author": "Dwayne_p",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cnhwx/how_to_calculate_the_forces_needed_for_a_scissor/",
        "text": "I have been trying to calculate a scissor lift with bending moment and pin joints but I had no luck. Is there anyone that can show me the right direction on how to calculate it? So basically I have the scissor arms 1.6m, 1.44m the length of the scissor lift when fully extended and 0.1m away from the center for the piston to extend. This will carry a car so basically one scissor lift would need to lift 520kg and assuming a weight distribution is 50:50 the  force will be 2550.6 N at each end. So if any help is given I would be much grateful.",
        "created_utc": 1677433363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any ideas how to Seperate Cermanics, Glass, and other pieces in order to recycle them all?",
        "author": "camwolf18",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ckl7t/any_ideas_how_to_seperate_cermanics_glass_and/",
        "text": "Hello,\n\nI'm looking to open up a rage room where people can destroy a myriad of things. Primarily, it will be glass cups, ceramic plates and mugs, and e waste. I plan to accept donations for all of these, but I will also buy the cups and plates as needed. I will get the e waste from a local recycling plant and take it back to them after using it. The problem is, Im not sure how to recycle the ceramics, glass and other small pieces. I want my business to try and be as green as possible. However, I can't think of a way to do it. I was trying to see if making sea glass could work for serpating the glass from the rest of it. I'm not sure if that will work since it would need to be a very large tumbler and would still contain the other broken pieces. \n\nI dont want to break them separately because customers will want to break both during the same session. \nAny ideas in how to solve this or should I just throw them all away?",
        "created_utc": 1677426984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats your point of view about hiring cheaper but specialized workers for minor and assistant roles?",
        "author": "superotimista",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ckjqg/whats_your_point_of_view_about_hiring_cheaper_but/",
        "text": "Hello, I am from LatAm, recently graduated, working locally as assistant engineer at a sewage network expansion on site 350 miles from home, overworked (+70 hr weekly) and underpaid.\n\nI am looking for any civil related job that could be done remotely, like assistant estimator, or anything really, where I could sharpen my english and perhaps learn a third language or just improve in general skills, while being closer to family.\n\nDo you believe it could be a good thing for a potential employer to hire cheaper but specialized remote workers from LatAm? I believe it could be good for both sides once it could free office time from tedious repetitive tasks that haven't been automated yet, that requires especialized knowledge or a lot of attention to detail, while in the other hand the possibility of remote work would be very welcome for some. \n\n Thanks in advance.",
        "created_utc": 1677426883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pre-employment drug screening",
        "author": "Beneficial-Corner-95",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ck6oc/preemployment_drug_screening/",
        "text": "[removed]",
        "created_utc": 1677425983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timing belts 1-2mm wide?",
        "author": "AggressiveTapping",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ck20q/timing_belts_12mm_wide/",
        "text": "I'm using timing belts in a project, and it would benefit from the compactness resulting from narrower belts. Currently I am using MXL timing belts (3mm width), and it's overkill.\n\nAny options under 3mm wide? 1.5mm seems like it would be ideal.",
        "created_utc": 1677425654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering as a career as a 28 year old",
        "author": "Shock_Eazy_",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cib8y/engineering_as_a_career_as_a_28_year_old/",
        "text": "[removed]",
        "created_utc": 1677421175,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to explain what is happening in a wind tunnel experiment at different angles of attack based on graphs of pressure, lift, and drag coefficient?",
        "author": "Silly_Humor_3076",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11chwyz/how_to_explain_what_is_happening_in_a_wind_tunnel/",
        "text": "In my Aeronautics class, I was supposed to do a wind tunnel experiment, which I did using a Naca 0012 wing and the TECQUIPMENT wind tunnel shown here [https://ibb.co/xHnDDZ7](https://ibb.co/xHnDDZ7), I set my Differential pressure somewhat between 375 Pa and 390 Pa, all good, collected my data from the software shown here [https://ibb.co/ZdcxnXV](https://ibb.co/ZdcxnXV), Only I didn't pay attention that tapping number 16 wasn't attached and it had a value of zero, it's too late now to fix the problem because each student has the right to do the experiment only once, now I must finish the work with what I have, meaning instead of analyzing the correct data I must examine the wrong one and compare it to the right one and explain what went wrong and why; This is the graph I had after plotting the pressure coefficient (Cp=(Pxz-Ps)/(differential pressure)) in the function of the distance from the leading edge over the wing length (Cp=F(X/l) [https://ibb.co/ctP6NKs](https://ibb.co/ctP6NKs) where you could see I had some kind of a weird peak, the correct graph should look something like that [https://ibb.co/HGbYd39](https://ibb.co/HGbYd39); and the drag and lift coefficient graphs are shown here [https://ibb.co/BP6k4xJ](https://ibb.co/BP6k4xJ); to tell you the truth my knowledge for the moment is very very limited when it comes to aeronautics, so when I was suffering with explaining the right phenomena ( I have no idea what that graph is telling me) now I must explain the right one and the wrong one together (Universe work in a mysterious way!), so can I get some help that could get me to start explaining what happened and what is supposed to be happening? not asking for much just a little light at the end of the tunnel that I could follow to find my way. Thank you in advance. Ps: I am extremely sorry that you had to read all that.",
        "created_utc": 1677420211,
        "upvote_ratio": 1.0
    },
    {
        "title": "I obtained my bachelors degree in Cybersecurity and ended up in Systems Engineering (Aerospace), how do I get good at my job?",
        "author": "picante-x",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11chjj3/i_obtained_my_bachelors_degree_in_cybersecurity/",
        "text": "[removed]",
        "created_utc": 1677419187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given thermal constraints on getting to faster computer chips, why hasn't on-chip or embedded cooling solutions been integrated into semiconductors/power electronics yet",
        "author": "B3stThereEverWas",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cgqku/given_thermal_constraints_on_getting_to_faster/",
        "text": "[removed]",
        "created_utc": 1677416975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this real❓ has some truth to it or pseudoscience ❓[microwave hearing]",
        "author": "Yezn-yatta",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cgcyo/is_this_real_has_some_truth_to_it_or/",
        "text": "[removed]",
        "created_utc": 1677415941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is amplitude the same as audio signal strength?",
        "author": "jalOo52",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11cdelm/is_amplitude_the_same_as_audio_signal_strength/",
        "text": "Hello,  \n\n\nI was wondering if the amplitude of a sound is the same as audio signal strength.\n\nIf not, what differentiates signal strength and amplitude?\n\nPlus: Does level simply refer to peak of an amplitude at a given moment?  \n\n\nThanky you!",
        "created_utc": 1677409832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would using Ultra-Wideband (UWB) technology to track expensive tools in a shop be plausible?",
        "author": "PatchField",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11ccag4/would_using_ultrawideband_uwb_technology_to_track/",
        "text": "[removed]",
        "created_utc": 1677407270,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts about this career change?",
        "author": "CHustling",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c5pvh/what_are_your_thoughts_about_this_career_change/",
        "text": "[removed]",
        "created_utc": 1677387153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attaching ~2mm balls to &lt;1mm Kevlar woven fishing line.",
        "author": "elfballs",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c5hbs/attaching_2mm_balls_to_1mm_kevlar_woven_fishing/",
        "text": "I need to put balls along and at the end of a line, which needn't be woven Kevlar line but that's what I'm looking at now. Of course I can't braise/solder/weld to Kevlar, and I think crimping a split object would cut it before it gripped enough to support the full load. \n\nAlso, bend radius of &lt;3mm and stretch of &lt;15% at max load, so I can't switch to wire ropes I've been able to find. It's also nice that Kevlar is low friction. Any thoughts? \n\nI need to put these balls on at precise-is locations &lt;1mm, they are for spacing objects along the cord that will pivot/rock on the balls. \n\nAny ideas for such fittings, or a system with a different material all-together?",
        "created_utc": 1677386348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Formula for Mass Flow Rate of bulk solid particles through a Silo or Hopper Funnel Aperture?",
        "author": "gnatzors",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c53wg/formula_for_mass_flow_rate_of_bulk_solid/",
        "text": "Is there a formula that describes the mass flow rate of solids like grain, rocks, balls, whatever through a funnel of a given aperture? I imagine these are the variables:\n\n* Internal angle of friction\n* Cohesion\n* Average particle size\n* Hopper aperture\n\nI believe this is usually simulated using Discrete Element Method (particle flow analysis), but I refuse to believe we didn't have rules of thumb or equations before software came along.",
        "created_utc": 1677385112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to interview an engineer",
        "author": "zlurpie",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c3urz/looking_to_interview_an_engineer/",
        "text": "[removed]",
        "created_utc": 1677381058,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to calculate EITHER max load for stainless steel flat bar OR required thickness of stainless flat bar for a given weight?",
        "author": "mishgan",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c3s2j/how_to_calculate_either_max_load_for_stainless/",
        "text": "reference: [https://imgur.com/a/Vxebpsl](https://imgur.com/a/Vxebpsl)\n\nI have searched for too long - but not sure what to search for to find the right answer..\n\nSo I have an Object (30kg WxHxD: 480x50x500mm) that I want fix to a wall. I was thinking of using 2 stainless steal flat bars/sheets/plate (English is my 3rd language - not sure what it's called).\n\nHow do I calculate the max load I can put on a flat bar (see reference for example), or how do I figure out the required material thickness?\n\nI was thinking getting two 790mm pieces, and bending them at 250mm (which will be fixed to the wall) and 750mm (500mm part to hold the object) and a 40mm lip to prevent sliding off.\n\nI have found so many calculators and formulas but can't find anything that fits.\n\nThank you for any feedback!",
        "created_utc": 1677380832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone seen research or information on the reliability of various low voltage connection types?",
        "author": "just-dig-it-now",
        "url": "/r/lowvoltage/comments/11c3oi9/has_anyone_seen_research_or_information_on_the/",
        "text": "",
        "created_utc": 1677380709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boiler flue gas dampers (reheater &amp; superheater)",
        "author": "franciz26",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c386h/boiler_flue_gas_dampers_reheater_superheater/",
        "text": "In a coal-fired power plant, the convection pass of a boiler is equipped with a division wall — separating reheater and superheater area. These areas are equipped with dampers located near the exit of flue gas.\n\nI have observed that the opening of these dampers vary at different loads. They are never the same. One has bigger opening than the other.\n\nWhy and when do we increase/ decrease the opening of these dampers (reheater damper &amp; superheater damper)?\n\nWhy are these dampers located near the exit and not at the entry of flue gas?",
        "created_utc": 1677379198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boiler Flue Gas Dampers",
        "author": "InfiniteLearningME",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11c36ni/boiler_flue_gas_dampers/",
        "text": "[removed]",
        "created_utc": 1677379059,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an old keurig and an elegoo kit. Any projects that I can make?",
        "author": "712588Kf",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bzrpx/i_have_an_old_keurig_and_an_elegoo_kit_any/",
        "text": "I just got an elegoo kit and I’m really excited to start building stuff. I have an old keurig that doesn’t do the job anymore and I was going to use some of its parts for my first project. Any ideas?",
        "created_utc": 1677369372,
        "upvote_ratio": 1.0
    },
    {
        "title": "What percentage of the hourly rate we charge customers should I get paid ?",
        "author": "Madco58",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bx073/what_percentage_of_the_hourly_rate_we_charge/",
        "text": "\nI get paid 40%of the hourly rate I bill the customer, I get 17days pto and sick days as needed, 401k @50%match  of 6% , 78$ a month towards HSA.\n\nI dont know if I'm getting shafted compared to other companies, the reason I started thinking this is that I made a change in the area I work in and increased my bill rate by 37% but only got 3% annual raise this past fall.\n\nI'm 100% billable this year, last year I earned 9k extra from additional hours I worked extra  in liue of annual bonuses.",
        "created_utc": 1677362317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working remotely - from Canada for US company (specifically in solar/renewables)",
        "author": "iwillalwaysthrowaway",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bwu6w/working_remotely_from_canada_for_us_company/",
        "text": "Hey all, \n\nHopefully this isn’t too abstract but looking for some help/guidance. \n\nI’m a Project Engineer for an EPC in Canada. We specialize in utility solar installs. \n\nMy company sucks. It’s the most disorganized shit show I’ve ever seen, with a few upper management folk playing judge, jury, executioner without actually providing any leadership, guidance or support. There are no processes. No one takes ownership of anything so everything takes double as long as it should to get resolved. \n\nWe have some big jobs this year, and I’ll be honest, I actually think we’re going to fall flat and fail to deliver because of mismanagement. \n\nTo start, in Canada there are only limited regions that actually allow private development of renewables in Canada - so the pool of projects is already smaller, then you look at the fact that we’re 1/10th the size. \n\nI look south of the boarder at the IRA and the size of similar companies and developers, and it just looks night and day. Then, I continually hear about labour shortages so I’m curious - \n\nCan I get involved? How can I work remotely for these companies? Can I even work remotely for them? 90% of my job can be done remotely, with once monthly site visits. \n\nNB - I have already started casually looking and many of the jobs say Remote - US, so I’m assuming what I’m asking is just not feasible?",
        "created_utc": 1677361892,
        "upvote_ratio": 1.0
    },
    {
        "title": "theoretical rpm limit of a piston engine",
        "author": "weldandfab",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bwqwi/theoretical_rpm_limit_of_a_piston_engine/",
        "text": "Watching a video of a piston engine turn at 14k rpm and realizing its going through the 4 cycle process 116 times a second got me wondering. What's the theoretical max rpm of the piston engine design? At what point is the intake valve open for such a short time that you can't get enough air into the cylinder to make it run? Or at what point is the power stroke so short that the gas can't burn before the exhaust stroke?",
        "created_utc": 1677361666,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm trying to find the proper math for joints and angles with anchors",
        "author": "xmasbad",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bwgn6/im_trying_to_find_the_proper_math_for_joints_and/",
        "text": "It is difficult to put into words what I'm trying to say but here is an image link to what I'm trying to do\nhttps://imgur.com/w4qCf1y\nand \nhttps://imgur.com/X2aD4YU\n\nI eyeballed most of it, but having the math to calculate the proper distance and angles would be nice.\nI tried looking up a solution but I couldn't put the right words in to get anything.\nAny help would be greatly appreciated and if this doesn't belong here i apologize",
        "created_utc": 1677360967,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the ends of an arc segment are pressed towards each other, is the entire arc segment in tension or is the center half still in compression, like a strut in bending?",
        "author": "vaguelystem",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bwdmk/if_the_ends_of_an_arc_segment_are_pressed_towards/",
        "text": "https://visor.ph/wp-content/uploads/2019/06/mercedes-amg-gt3-main08.jpg\n\nI saw this unusual implementation of a racecar rear wing mount and at first thought it was just a clever way of further removing mechanical necessities from aerodynamically sensitive areas (the mount connects on the high pressure side of the wing, in the first place, because high pressure air will be less disrupted, and this solution means that the mounts can seamlessly join the wing surface, rather than have fasteners there for adjusting angle of attack), but then I wondered if it could also be a clever way of keeping composites in tension, rather than compression, were it to be all-composite. (Question as posed in the title, aside, airfoils produce a torque, as well, but it's in the same direction as the bending moment on the upper mount and I can't visualize how that load would be different from simply pressing the ends of an arc segment together, anyway... Please correct me if that's wrong.)",
        "created_utc": 1677360758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do metro systems use 3rd rail?",
        "author": "me-gustan-los-trenes",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bvi9g/why_do_metro_systems_use_3rd_rail/",
        "text": "I mean, why not just use the two regular rails to deliver power, like model trains do.\n\nI mean, I understand that having hundreds to thousands volts between rails would make the rails a death trap for anyone stepping on them. But the 3rd rail is already a deadly electrocution hazard so powering rails directly doesn't seem that much worse.",
        "created_utc": 1677358565,
        "upvote_ratio": 1.0
    },
    {
        "title": "DOT internship or project manager internship?",
        "author": "buffontop",
        "url": "https://www.reddit.com/r/AskEngineers/comments/11bvf7g/dot_internship_or_project_manager_internship/",
        "text": "[removed]",
        "created_utc": 1677358345,
        "upvote_ratio": 1.0
    }
]