[
    {
        "title": "Harnessing truck wash to generate electricity.",
        "author": "Winkiwu",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fnpa3/harnessing_truck_wash_to_generate_electricity/",
        "text": "I've been pondering this question for quite a while now, i even posted it in r/askscience but it didn't fit their \"rules\".\n\nSo heres my theory, ignoring the infrastructure that it would require to do this. \n\nThe wake that a semi truck leaves is powerful and goes out quite a distance. If someone were to take a small wind generator, like those you can get for fairly cheap at Menards or Home depot, could you set them up along the heaviest trucking routes on the US highway system and be able to collect some of the lost energy? Would putting them in pinch points like under over passes where it funnels the air towards the wind generator help make it more efficient/possible? \n\nObviously I i have no intention of actually doing this I'm more curious of it would work in theory. In my thinking i don't see why it wouldn't be possible for it to work aside from the amount of infrastructure it would require and the amount of long term maintenance due to accidents and weather. \n\nI'm curious to hear what you all have to think on the matter, thanks!",
        "created_utc": 1674089142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monopole base plate calculations?",
        "author": "snottnosedkidd",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fm2vw/monopole_base_plate_calculations/",
        "text": "[removed]",
        "created_utc": 1674084966,
        "upvote_ratio": 1.0
    },
    {
        "title": "if possible how would a sky scrapper need to be built in order for it not to break apart by the distribution of weight from being lifted by a human?",
        "author": "Redscream667",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10flrbi/if_possible_how_would_a_sky_scrapper_need_to_be/",
        "text": "",
        "created_utc": 1674084163,
        "upvote_ratio": 1.0
    },
    {
        "title": "How useful is a computer science minor?",
        "author": "idkusername126",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fijxz/how_useful_is_a_computer_science_minor/",
        "text": "I picked up a computer science minor along the way of my BSME (currently a junior) because I love the subject and I love the problem solving that comes with it, as well as the algorithm designs and all of that stuff. \n\nHowever, it seems that a lot of engineers only use python for scripting and c++ for Arduino. Is there any use case for the in depth computer science knowledge (graph theory, object oriented design patterns, data structures, etc.) in the engineering field? I love to code this stuff up and use it, but so many engineers tell me they code to specific use cases and don’t reuse code for other projects/ only use it to code robotics.\n\nSincerely,\nA sad student.",
        "created_utc": 1674075564,
        "upvote_ratio": 1.0
    },
    {
        "title": "in your opinion, what is the best book or resource to learn about industrial electrical design and calculations?",
        "author": "Enigmatic_Kraken",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fh0gp/in_your_opinion_what_is_the_best_book_or_resource/",
        "text": "",
        "created_utc": 1674071909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barcode platform to keep track of parts",
        "author": "Fit-Caterpillar-2995",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fgzi5/barcode_platform_to_keep_track_of_parts/",
        "text": "At our facility we’ve been getting bigger orders that run into dozens of parts and we’re running into issues losing items or miscounting them. Are there any solutions to keep an inventory of the items as they go through the stages to help us keep track of stuff? A dedicated handheld scanner would probably disrupt our workflow so a solution that works with a smartphone would be ideal. Thanks.",
        "created_utc": 1674071844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Input on Job Offer",
        "author": "SuperLascivious",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fgz0j/input_on_job_offer/",
        "text": "[removed]",
        "created_utc": 1674071809,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can not find a junior developer job with my completed bootcamps. What am I doing wrong?",
        "author": "DrummerKey4717",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fgqnh/i_can_not_find_a_junior_developer_job_with_my/",
        "text": "[removed]",
        "created_utc": 1674071257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I do an Engineering Degree or something else?",
        "author": "tryst497",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fg4yr/should_i_do_an_engineering_degree_or_something/",
        "text": "[removed]",
        "created_utc": 1674069847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I do an Engineering Degree or something else?",
        "author": "tryst497",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ffzom/should_i_do_an_engineering_degree_or_something/",
        "text": "[removed]",
        "created_utc": 1674069490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is an Engineering Degree right for me? Would another option be a better choice?",
        "author": "tryst497",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ffy3m/is_an_engineering_degree_right_for_me_would/",
        "text": "[removed]",
        "created_utc": 1674069386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I do an Engineering Degree or something else?",
        "author": "tryst497",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ffwop/should_i_do_an_engineering_degree_or_something/",
        "text": "[removed]",
        "created_utc": 1674069296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I do an Engineering Degree or something else?",
        "author": "tryst497",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ffvz8/should_i_do_an_engineering_degree_or_something/",
        "text": "[removed]",
        "created_utc": 1674069249,
        "upvote_ratio": 1.0
    },
    {
        "title": "High Voltage and High Current DC Switch",
        "author": "C-LEC",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fetg4/high_voltage_and_high_current_dc_switch/",
        "text": "[removed]",
        "created_utc": 1674066740,
        "upvote_ratio": 1.0
    },
    {
        "title": "LVL vs Dimensional Lumber for Sistering Floor Joists",
        "author": "Due-Seaweed-5206",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fehb6/lvl_vs_dimensional_lumber_for_sistering_floor/",
        "text": "[removed]",
        "created_utc": 1674065970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering questions on fuel economy in Manuals in city driving",
        "author": "TecKing",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10feb9x/engineering_questions_on_fuel_economy_in_manuals/",
        "text": "  \nSo I've been studying on my own regarding the intricacies of automotive engineering (as a hobby) as I've really grown to have an interest in this sort of thing. I don't have a car yet, But I plan to get a manual, even if I do live in NYC.  \nNow I know modern automatics have greatly improved over the years and are basically equal to, or in some cases more fuel efficient, like CVTs (But I want to leave CVTs out because of this). But what about in stop 'n go traffic. Most of my gearing will fluctuate between 1st and 2nd gear with the occasional 3rd and 4th gear. But compared to how torque converters use fluid coupling to minimize power loss, is fuel economy noticeably worse in a manual?  \nSecond question is about manuals and the differences between gears and how efficient they are at low speeds. For torque applications I fully understand the use of leverage between the smallest driver gear against the largest driven gear and as a result, you have a torque multiplier effect that makes it easy to get the car rolling. And as you go further up the gears, the size differences between the driver gear and driven gear become less allowing for more efficient speeds. But in city driving you're not often going to be able to use those higher gears all the time. But couldn't the same be said about the planetary gear system in automatics, although its more complicated than I fully understand. I had a friend tell me that I'd waste fuel driving a manual over an auto, but from what I've tried to study, they doesn't seem that different at low speeds. So this has been bothering me for a while now so any explanations between the 2 are appreciated.",
        "created_utc": 1674065585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analyzing the Hacksmith's spider-bot failure.",
        "author": "Lampa_117",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fe1n5/analyzing_the_hacksmiths_spiderbot_failure/",
        "text": "For this question to make sense I'm assuming you watched the last [video](https://youtu.be/xd8dKY6Ozrg) from one of the most popular engineering channels Hacksmith Industries. They attempted to make a six-legged robot using excavator arms and achieved very limited success.\n\nFrom the video, it seems they had little control over the movement, parts were overloaded, hydraulics couldn't keep up the mech from the ground, etc.\n\nIt got me thinking about what went wrong with this project, and how could one improve it? So I wanted to ask for some feedback on flaws in the specific project and what is the correct way to design large-scale hexapod vehicles?",
        "created_utc": 1674064972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Communication between click PLC and Raspberry Pi; How do I do it?",
        "author": "Dieabeto9142",
        "url": "/r/PLC/comments/10fdktc/communication_between_click_plc_and_raspberry_pi/",
        "text": "",
        "created_utc": 1674064616,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Role",
        "author": "DopeME1",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fdt8m/new_role/",
        "text": "[removed]",
        "created_utc": 1674064449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reverse engineering the adhesive process - material engineers needed",
        "author": "Kermanshah-Made",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fcym5/reverse_engineering_the_adhesive_process_material/",
        "text": "[removed]",
        "created_utc": 1674062459,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the smallest igniter/lighter system I can use to integrate into a jewellery piece?",
        "author": "Linnnno",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10fau2r/what_is_the_smallest_igniterlighter_system_i_can/",
        "text": "[removed]",
        "created_utc": 1674057514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do the boundaries for arc flash still apply when the equipment is closed and in normal operating conditions? Is PPE still necessary to just stand around this equipment?",
        "author": "Blackstone46",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10falya/do_the_boundaries_for_arc_flash_still_apply_when/",
        "text": "When equipment is closed and in it's normal operating condition, are you expected to still wear the PPE appropriate for the arc flash label? I understand you absolutely need it if the equipment is opened and there are exposed conductors, but do you still treat it at as an active arc flash risk when it's closed up?\n\nExample 1: Take an electrical room filled with equipment such as MCCs, switchgear, drives, etc (assume all equipment is labeled for 7 cal/cm^2)... Is it reasonable to expect anyone who enters this room to be wearing full level 2 PPE just to be in this room? Is the PPE necessary if everything is closed and there's no exposed live conductors?\n\nExample 2: A 480v welding disconnect in the field where non qualified individuals would be working. Should these people be wearing appropriate PPE to be around this equipment even if it's closed?",
        "created_utc": 1674056969,
        "upvote_ratio": 1.0
    },
    {
        "title": "any other confused engineers? Trade school after receiving bachelors degree/switching careers",
        "author": "NeedleworkerTop111",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f9dg5/any_other_confused_engineers_trade_school_after/",
        "text": "[removed]",
        "created_utc": 1674053935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Controls Systems and Fluids Mechanics for Mechanical Engineering",
        "author": "idkusername126",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f97tj/controls_systems_and_fluids_mechanics_for/",
        "text": "I am a junior mechanical engineering student, and really like both controls and fluid mechanics. \n\nAre there any specialized mechanical engineers that incorporate both of these fields in their careers, maybe in autonomous vehicle design? I don't plan on going for a master's degree (as of now), but I do plan on doing research in both of these fields before I graduate, and I have a computer science minor (it's mainly algorithm design, so not much help for controls; it might still be helpful somewhere though).",
        "created_utc": 1674053518,
        "upvote_ratio": 1.0
    },
    {
        "title": "are bidirectional HRVs more efficient than cross-flow? (in theory)",
        "author": "always_misunderstood",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f937x/are_bidirectional_hrvs_more_efficient_than/",
        "text": "A friend of mine asked me about these two styles of heat recovery ventilator, and I'm not really sure what the answer is.\n\na cross-flow HRV has air blow across plates, but not mix, and they transfer heat between each other when they do so ([like this](https://tse3.mm.bing.net/th/id/OIP.POY1149Jafi-C3UwdciVKgHaGM?pid=ImgDet&amp;w=500&amp;h=418&amp;rs=1)). once the air in this type reach equilibrium (halfway between the indoor and outdoor temp) then no more heat is exchanged. so you could say that it recovers 50% of the heat that would be lost if it were just two separate pipes, one blowing out and one pulling in. so in a sense, it is \"50% efficient\" (theoretically). \n\na [single-room HRV with bidirectional flow](https://www.bing.com/videos/search?&amp;q=marley+fresh+air+recovery&amp;view=detail&amp;mid=30006FE6A74CEF35B88E30006FE6A74CEF35B88E&amp;FORM=VDRVRV&amp;ajaxhist=0) alternates blowing out and pulling air in. the theory is that there is a heatsink in the middle that gets warmed when blowing out and then that heat is recovered when it reverses. now, if it is just a heatsink, then it will have a theoretical maximum of 50%, like the cross-flow exchanger. however, companies seem to be claiming much higher because there is a gradient of temperature between the outside and inside ends of the heatexchanger. so the inner-most part never drops below indoor temp and the outer part never raises above outdoor temp, but the percentage of the middle portion that is above outdoor temp gradually grows while exhausting and shrinks while taking air in. this gradient seems like, in theory, it could recover 100% of the energy from the outgoing air.\n\nignoring the fact that the design shown in the video would conduct quickly from one end to the other (thus very little gradient), and ignoring other implementation-specific problems (like the house would just leak cold air in under the door while exhausting and push hot air out the roof when bringing air in), could such a system actually have a theoretical efficiency of 100%? so an ideally designed unit with totally air tight \"balloon\" of a house.",
        "created_utc": 1674053179,
        "upvote_ratio": 1.0
    },
    {
        "title": "I received an offer from a company for an engineering position, how should I go about asking for an extra week to review?",
        "author": "eng2725",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f7irg/i_received_an_offer_from_a_company_for_an/",
        "text": "The offer had a 1 week expiration but I’d like to ask for another week as I’m trying to see if my current company will match. \n\nHow should I go about asking for the extra week? Do I repel them I need it because I’m comparing another offer or do I just leave it vague and say I want another week to review the offer?",
        "created_utc": 1674048843,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is My Task Performance for one of my subjects 7 Questions",
        "author": "GentleFukBoi69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f72r2/this_is_my_task_performance_for_one_of_my/",
        "text": " \n\nI just have 7 questions to ask\n\n1. Can you do business as Computer Engineer?.\n2. Is Computer Engineer worth it?.\n3. Is Computer Engineer is time consuming like pilots doing 10+ hours of work, no rest.\n4. What is life as Computer Engineer after you graduate?\n5. is it hard to get a job after you graduate? is there much requirements?\n6. Is your work repetitive? like do this work then get salary, repeat, or you will face new problem every single day, and in worst case you will face new problem that your company never did or fix and your boss just dumped this work on you\n7. what kinds of work you do as Computer Engineer every single day?",
        "created_utc": 1674047523,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is my Task Performance to interview a Computer Engineer 7 Questions",
        "author": "No_Dragonfruit337",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f70z7/this_is_my_task_performance_to_interview_a/",
        "text": "[removed]",
        "created_utc": 1674047380,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Task Performance is to Interview a Computer Engineer",
        "author": "JaymesLantigo",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f6xxh/my_task_performance_is_to_interview_a_computer/",
        "text": "[removed]",
        "created_utc": 1674047121,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do Synchronous Condenser absorb reactive power?",
        "author": "eeng1",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f6tf7/how_do_synchronous_condenser_absorb_reactive_power/",
        "text": "",
        "created_utc": 1674046780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can engineers be bribed? if so how is it done?",
        "author": "MajesticRate1818",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f6k4v/can_engineers_be_bribed_if_so_how_is_it_done/",
        "text": "I study a law course so I'm wondering what kind of ways can a design engineer be bribed that is commonly done? I had not even thought of the possibility of it occurring and i thought the field was relatively clean",
        "created_utc": 1674045962,
        "upvote_ratio": 1.0
    },
    {
        "title": "What technique to use to make a parachute",
        "author": "Monsta15",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f51u7/what_technique_to_use_to_make_a_parachute/",
        "text": "Hey guys, \nI am currently building a parachute for an object that approximately looks like a 0.33L cola can and is going to weigh about 350 grams. The diameter of my parachute is going to have to be approximately 70cm. My question is would it better to make the parachute completely circular, or maybe give it like a hexagon/octagon shape. And also whether to make the shape, I should just cut out the shape straight away from the material, or I should cut out like triangles and sow them together to make like a hexagon for example.",
        "created_utc": 1674041120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building a parachute",
        "author": "Monsta15",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f50fo/building_a_parachute/",
        "text": "[removed]",
        "created_utc": 1674040989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you put a tormach 440 cnc machine on the second floor?",
        "author": "Umm-maybe",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f3nr0/can_you_put_a_tormach_440_cnc_machine_on_the/",
        "text": "So here’s a crazy question, can I put a tormach 440 on the second floor of my brownstone? I live up the stoop (the stairs outside) in a city and want a mini machine shop in my home. There is seat a baby grabs piano off roughly the same weight (600lbs) on the first floor so I know the house can handle it. Obviously I have no garage so that’s not an option. The room I planned on putting it in has lots of ventilation, as half the wall can be a screen door similar to the ventilation of a garage. Assuming the machine can get upstairs, is this feasible or just a pipe dream and I should I give up on this? \n\n\nNote: I plan on sound proofing the room with vinyl and foam dampeners so my neighbors aren’t as mad at me.",
        "created_utc": 1674036036,
        "upvote_ratio": 1.0
    },
    {
        "title": "A electrical railway system at home",
        "author": "NicolaiiHell",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f1hab/a_electrical_railway_system_at_home/",
        "text": "[removed]",
        "created_utc": 1674027546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Symmetric nature of Cauchy stress tensor",
        "author": "Born_Alternative_230",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10f11h4/symmetric_nature_of_cauchy_stress_tensor/",
        "text": "[removed]",
        "created_utc": 1674025937,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone here have used log-ic 360 usb loggers the green one",
        "author": "heyitssunsett",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10evxga/anyone_here_have_used_logic_360_usb_loggers_the/",
        "text": "",
        "created_utc": 1674010361,
        "upvote_ratio": 1.0
    },
    {
        "title": "6DoF Rigid Body Dynamics: Help with Sign of Yaw Rate Equation for an Aircraft",
        "author": "AcquaFisc",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10etjn1/6dof_rigid_body_dynamics_help_with_sign_of_yaw/",
        "text": "Hello, I hope everyone is doing well. I'm currently working on a 6DoF rigid body dynamic model for an aircraft and I'm having trouble understanding how to determine the correct sign of the term (I_zz - I_xx) or (I_xx - I_zz) in the yaw rate equation. I've defined some conventions for the body axis, specifically that when viewed from above, a positive yaw is when the aircraft turns to the right, a positive roll is when the right wing goes down, and a positive pitch is when the nose of the aircraft goes up. Additionally, the positive direction of the z-axis is facing towards the earth.\n\nCan anyone provide some guidance on how to determine the correct sign for the term based on these conventions?",
        "created_utc": 1674003962,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often is engine coolant the problem in heavy duty (or automotives) equipment? What happens if you put the wrong coolant in? Is there any resource available for this?",
        "author": "Musakuu",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10etcyt/how_often_is_engine_coolant_the_problem_in_heavy/",
        "text": "Hey guys, my brother and I got to talking about equipment in winter, and we noticed that we never change out coolants for our cars in Canada even though we range from -30 to +30. \n\nWe went down a rabbit hole of possible theories as to why, but none of it was based on facts. We decided to ask the experts on this sub.\n\nWhat kind of problems can be caused by coolants not working properly? Do HD equipment change their coolant with the temperature? \n\nIn particular I'm looking for a resource I can use to look this up. \n\nThanks in advance to any response. &lt;3",
        "created_utc": 1674003505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are some good places to go looking for a true 'entry-level' CAD design job?",
        "author": "OnePrettyFlyWhiteGuy",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10et4uf/where_are_some_good_places_to_go_looking_for_a/",
        "text": "[removed]",
        "created_utc": 1674002909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aerospace Engineering student looking for advice on accepting a PhD offer",
        "author": "throwaway-bitte",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10eqiqx/aerospace_engineering_student_looking_for_advice/",
        "text": "[removed]",
        "created_utc": 1673996529,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I increase the height of a small weir?",
        "author": "Jaded_District1200",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10eq2pl/how_can_i_increase_the_height_of_a_small_weir/",
        "text": "[removed]",
        "created_utc": 1673995444,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make more money?",
        "author": "EEmorrmorre12",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10en5p5/how_do_i_make_more_money/",
        "text": "[removed]",
        "created_utc": 1673988719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fault tolerant and fault-detecting redundant DC power system?",
        "author": "jschall2",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10emrzl/fault_tolerant_and_faultdetecting_redundant_dc/",
        "text": "I'm working on designing a board for a drone that will have redundant 12Vdc power. The board will have two power connectors, and I want the MCU on the board to be able to detect any kind of fault, including if either of the ground wires gets cut.\n\nOne approach would be to use diodes to isolate the two 12v signals, and then put voltage dividers on them so the MCU can measure the voltage on each one. Isolate the two grounds with diodes, and put a pull-up resistor on each one.\n\nThe downside is the diodes will drop \\~0.4v or so. Maybe not a big deal depending on current requirements on the board.\n\nIs there a better way? Does an IC exist for this?",
        "created_utc": 1673987844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recycling / Circular Economy engineering advice",
        "author": "thatcherandsons",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10emg4v/recycling_circular_economy_engineering_advice/",
        "text": "I’m currently working as a systems engineering consultant but looking to move to a more design-oriented role in the waste and recycling industry with the longer term goal of becoming a circular economy engineering expert. \n\nDoes anyone have any advice on where to start, where the industry is going or any training they recommend? \n\nFor context, I’m based in Australia and my background is in mechanical and mechatronics engineering.",
        "created_utc": 1673987076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Engineering vs. Engineering Technology (as a student)",
        "author": "violetskies089_",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10elsem/engineering_vs_engineering_technology_as_a_student/",
        "text": "[removed]",
        "created_utc": 1673985572,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are you supposed to do an out of state Master's/PhD?",
        "author": "Bread_Cactus",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ekz78/how_are_you_supposed_to_do_an_out_of_state/",
        "text": "I want to go for my Master's in Electrical Engineering and was supposed to start at the same university where I got my Bachelor's but the paperwork fell through (faculty is going through some rough times rn) so I won't be able to start until the fall. I was considering looking at other universities since I almost never see people with a Master's from the same school they got their Bachelor's, but it is so insanely expensive to do the out of state tuition costs. How are you supposed to go to another school for a Master's or even a PhD which I would imagine is even more expensive? Do you just try to get a shitload of scholarships? Go find a job in a new state for two  years to become a resident then start? What's up?",
        "created_utc": 1673983682,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to open two cabinet doors by 180 degrees. Is a actuator the way to go? What else do I need?",
        "author": "I_AM_A_SOLID_CITIZEN",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ekurx/i_want_to_open_two_cabinet_doors_by_180_degrees/",
        "text": "Hello Guys,\n\nI have a tool cabinet which \"unfolds\" much like in this picture (not mine):\n\n[https://preview.redd.it/9h1jfgqabwf61.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=5606b7ede25d37764d8a3a07764e811e5bb04063](https://preview.redd.it/9h1jfgqabwf61.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;v=enabled&amp;s=5606b7ede25d37764d8a3a07764e811e5bb04063)\n\nMy cabinet is at least double the size.\n\nI would like to add an electric mechanism on the top of the cabinet to open and close the doors. The doors should then be aligned with the body, which means that they should open by 180 degrees.\n\nI'm a little lost here. Would an electric actuator be the way to go? Should be as small as possible.\n\nEngineering isn't exactly my strenght. Would i need something with a triangle shape or an actuator that is mounted on something movable and turns with the door?\n\nI'd appreciate ideas, links, videos.\n\nThanks in advance.",
        "created_utc": 1673983396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will I be behind in the engineering field?",
        "author": "Narrow-Raspberry-69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ejbhq/will_i_be_behind_in_the_engineering_field/",
        "text": "[removed]",
        "created_utc": 1673979774,
        "upvote_ratio": 1.0
    },
    {
        "title": "utilizing heat from power loss to generate electricity.",
        "author": "SearchingHiandlow",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10eixuy/utilizing_heat_from_power_loss_to_generate/",
        "text": "[removed]",
        "created_utc": 1673978887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where any of you involved in the labor side of construction before becoming an Engineer?",
        "author": "SausagePiper",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10eikfc/where_any_of_you_involved_in_the_labor_side_of/",
        "text": "My back hurts and it is time to grow up.\nNot sure what I want to do, but engineering, management, or design sound interesting so far.",
        "created_utc": 1673978035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some fastener torque specifications include an additional angle past the torque value?",
        "author": "vaguelystem",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ei0ok/why_do_some_fastener_torque_specifications/",
        "text": "",
        "created_utc": 1673976721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Settle a water pump argument for us",
        "author": "checkoutmyfish",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10egjgq/settle_a_water_pump_argument_for_us/",
        "text": "A water pump is advertised to be able to pump up to 7.2' vertical with a 1/2\" output diameter.\n\nIf the output size is changed to 1/4\" will it pump higher or will the flow be too restricted and not pump as high?",
        "created_utc": 1673973175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exhaust systems in Workshops/Garages",
        "author": "ElTrumpino",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10eg5dt/exhaust_systems_in_workshopsgarages/",
        "text": "I was wondering how an exhaust tube with multiple intakes along its length manages to suck in an equal amount of air from each intake. For example a tube is 10 meters long with one intake each meter and it's only connected on one end to the exhaust system. How doesn't it suck for example 90% of the air fr the first intake but 10% from each?",
        "created_utc": 1673972196,
        "upvote_ratio": 1.0
    },
    {
        "title": "You need to replace a 100-ton, evaporative condensing RTU, that originates from the dark ages. You found a replacement unit that would work well, but it can either be air-cooled vs. evaporative condensing. What would you choose?",
        "author": "ArianaGrandeMocha",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10edh57/you_need_to_replace_a_100ton_evaporative/",
        "text": "Correct me if I misspeak: to me, the evaporative condensing model would be more energy-efficient (but at the cost of consuming water) because you’re able to cool down to the wet bulb (however, water is d*mn cheap…)\n\nOn the other hand, it seems like the evaporative condensing model will require more maintenance, and the fact that you now have to consider chemical treatment…\n\nUpfront cost… I am not sure about this one. I’d have to get a quote to compare the two. Is there a standard rule of thumb?\n\nAre there any other factors to consider?\n\nForgive me… I’m a young mechanical engineering-in-training. Thank you.",
        "created_utc": 1673965402,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to learn more about HVAC",
        "author": "Joey-Doughy11",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10echxq/i_want_to_learn_more_about_hvac/",
        "text": "I am a mechanical engineering student and I finished my undergrad education in December of this year and I am graduating in May of this year. I took a course of CFD in my final term and did a final project on air circulation in a lecture theatre and the readings that I did for this project made me very interested in the world of HVAC. What would some resources be that you professionals recommend so that I can learn more for potential jobs in the future and just personal interest. Thank you all very much in advance.",
        "created_utc": 1673962752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where I can find full product scheme with all the dimensions?",
        "author": "PictureFirst5513",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10e7ugn/where_i_can_find_full_product_scheme_with_all_the/",
        "text": "[removed]",
        "created_utc": 1673946959,
        "upvote_ratio": 1.0
    },
    {
        "title": "When roller coaster engineers use linear induction motors/ synchronous motors in their rides, are they bought as a complete package from outside firms? Or are they built from scratch and custom programmed?",
        "author": "bassbeatsbanging",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10e33sr/when_roller_coaster_engineers_use_linear/",
        "text": "I am a roller coaster nerd but there isn't tons of documentation of the specifics of how LSMs/LIMs actually get built for a ride. \n\nAre there premade LSM controllers/ regulatory components for example? Or does someone have to design, assemble and calibrate each system for every new coaster? \n\nAre the LIM / LSM rails visible on the track only made for rides, or do they have any other industrial uses?\n\nThanks for answering my nerdy questions.",
        "created_utc": 1673930643,
        "upvote_ratio": 1.0
    },
    {
        "title": "What engineering should i chose if i want to worth with AI and robots? - Computer engineer or mechatronic engineer?",
        "author": "N0rrum",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10e2aoo/what_engineering_should_i_chose_if_i_want_to/",
        "text": "[removed]",
        "created_utc": 1673928232,
        "upvote_ratio": 1.0
    },
    {
        "title": "How good is satellite camera technology? Could you see a person standing in the street from a satellite live? What about a coin on the ground?",
        "author": "UnnamedGoatMan",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10e1hhk/how_good_is_satellite_camera_technology_could_you/",
        "text": "Is this technology only used in government/military applications? Or are private companies relatively on par with their capabilities?",
        "created_utc": 1673925935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for Canadian Engineers: Switching from Energy Engineering to Software Engineering - Was it worth it?",
        "author": "Technical_Joker",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10e0v1h/question_for_canadian_engineers_switching_from/",
        "text": "Hi everyone, had a quick question for some of my fellow Canucks out there. I’m currently working as an energy engineer on the east coast of Canada. I make $79K and have 20 days vacation with 5 years experience. Right now I consider myself relatively lucky on the East Coast, but I am considering going back to school for an MEng in Software Engineering. \n\nI want to get a sense of how others have handled the transition if they’ve made it. I’m worried that I might be shooting myself in the foot if I go back to school given that, as I understand it, Canadian SEs don’t tend to make as lucrative salaries as SEs in the States. If you’re Canadian and have made the move, how did you find it? Do you feel it was worth the additional investment? \n\nThanks",
        "created_utc": 1673924182,
        "upvote_ratio": 1.0
    },
    {
        "title": "POWDER DIP/COAT",
        "author": "whgm_42",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10e0ppd/powder_dipcoat/",
        "text": "[removed]",
        "created_utc": 1673923762,
        "upvote_ratio": 1.0
    },
    {
        "title": "wooden batteries",
        "author": "ikissyourbrother",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dyhla/wooden_batteries/",
        "text": "[removed]",
        "created_utc": 1673917755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Third Year EE student, would you take technologist job offer?",
        "author": "blacksoup01",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dya9f/third_year_ee_student_would_you_take_technologist/",
        "text": "[removed]",
        "created_utc": 1673917219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Third Year Electrical Engineering Student, Internship Question",
        "author": "blacksoup01",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dy7gb/third_year_electrical_engineering_student/",
        "text": "[removed]",
        "created_utc": 1673917025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vibrations and buzzing happening in certain pockets of a home. (Constructive Interference pattern?)",
        "author": "aerlenbach",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dx2ps/vibrations_and_buzzing_happening_in_certain/",
        "text": "A friend expressed this issue and I didn’t really know where to turn for wisdom. Maybe a different sub would fit better so let me know what you think….\n\nMost of their house and the house adjoining it are inexplicably vibrating. This is causing random pockets of space in certain rooms to create a deep, almost sub-sonic tone that also creates a mild sensation of pressure in your ears. If you step into one of these pockets, you suddenly hear the tone and feel the pressure, but if you step out of the pocket, the tone is suddenly COMPLETELY gone and the pressure is gone too. \n\nIt appears to not propagate evenly the way sound does. It doesn't appear to have a single source and it doesn't dissipate gradually as you walk away from the source. It simply inhabits specific areas of space and is completely absent in adjacent spaces. You'd have to experience it to believe it. The experience of hearing this tone and feeling this ear pressure is utterly emotionally distressing. The only way they can describe it is that it sounds like doom.\n\nThey could hear the tone in some areas of the exterior walls and not others. the areas where they could hear the tone in the wall did not correspond to the areas where one could hear the tone in the air inside of the building. The sound can be heard in most (but not all) of the interior walls, but can only be heard in the air in one room. The loudest walls seemed to be the ones in the neighbor's house, which is attached to their house.\n\nSeems similar to [Zug Island](https://www.npr.org/2020/08/04/898853311/it-took-a-pandemic-mystery-of-windsor-hum-is-solved) but in a home. \n\nCan a point source result in a constructive Interference pattern so severe that it affects the mood of someone who hears it? It sounds almost science fiction but we’ve got 4+ people who’ve experienced it.",
        "created_utc": 1673914059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help determining the R Value required to constrain heatloss of 160 gallons of boiled water to no more than 1/2 degree of heat loss per hour in a vessel that exposes 112 ft of the water's surface area to insulation.",
        "author": "RandoKaruza",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dwson/need_help_determining_the_r_value_required_to/",
        "text": "I am working on a recrystallization project and need to determine how much insulation to use but completely out of my area of expertise on heat loss calculations to make that determination. Once I know the needed R Value I can calculate how much insulation I need. Here is the scenario:  \n\n\nI have a vessel that holds 160 gallons of water in the following shape: 70\" high  x 102\" wide x 5.5\" thick... so 112 ft of surface area.  Imagine a very large briefcase shape or perhaps imagine a tall and wide aquarium that isn't very thick.\n\nIt  will then be filled with boiling water at 212 degrees farenheit and it needs to remain as hot as  possible for as long as possible.  So it needs to cool but the longer it takes to cool the better due to the nature of the process. The limit is 1/2 degree per hour, no more.  Room temperature will be around 78 degrees.\n\nHeat loss doesn't happen linearly so provided I can manage the heat loss slope in the initial hours it should be good enough. In other words- I don't mind if the speed of heat loss varies as long as its never more than 1/2 degree per hour. \n\nMy  initial test allowed me to put the boiling water in at 212° and reduce  the heat loss to around 1° farhenheit per hour over the subsequent days allowing  close to a week of heat loss before arriving at room temperature. I didn't really know what I was doing and have a much better understanding now of thermal bridging and the need for air tightness etc. so the new vessel is much better. \n\nI have a way to make the  vessel waterproof through a custom liner company by using a  polyethylene liner. \n\nThe vessel  will essentially be (from the inside out): -Water in the middle,  contained by a very large ...\n\n\\-6 mil waterproof polyethelene bag, surrounded by ...\n\n\\-Insulation (Maybe 5-12 layers of foam&amp;foil sheets) surrounded by\n\n\\-Structural  box to keep it all in shape. This will most likely be 2x4's or steel  and some ply-board but could also be SIP panels. This is important of  course because it will be over 1000 lbs of water.\n\nThis strategy puts the water enclosed in the poly bag directly in touch with the foil face of the insulation on all 6 sides.\n\nThe water is boiled in 55 gallon stainless drums and pumped (using a wort pump of all things) into the void via an insulated hose.  once full we pull the hose out and seal the opening.   \n\n\nI hope I included enough detail. I appreciate the time. I originally posted this in the r/Insulation thread and it was suggested that I bring these details to this channel to determine the R Value needed.",
        "created_utc": 1673913379,
        "upvote_ratio": 1.0
    },
    {
        "title": "environmental engineering job for an electrical engineer.",
        "author": "epp1K",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dulus/environmental_engineering_job_for_an_electrical/",
        "text": "[removed]",
        "created_utc": 1673908217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ignoring the bad reasons - at a constant speed of 30mph, will a car engine warm up quicker with high rpm or low rpm given the throttle is about the same position?",
        "author": "CrappyTan69",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10du86u/ignoring_the_bad_reasons_at_a_constant_speed_of/",
        "text": "Given the same speed - say 30mph. \n\nIf held at peak power (diesel, 4000RPM) or at peak torque 1750RPM?\n\nGiven I am using different gears (6-speed manual) to maintain the RPM-&gt;Speed, I feel the trottle is roughly at the same position. \n\n&amp;#x200B;\n\nMy feeling - higher RPM because slightly more friction but, I counter that with being a diesel, at high RPM, low load, the flame front does not reach the cylinder wall like in a low-rpm instance (or am I wrong?)\n\nI know high-reving engine when cold is bad but this is in the nameof science :D",
        "created_utc": 1673907371,
        "upvote_ratio": 1.0
    },
    {
        "title": "How great is the industrial engineering culture at Bang Energy?",
        "author": "Gr0mHellscream1",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dsacy/how_great_is_the_industrial_engineering_culture/",
        "text": "Interviewed to be a controls engineer at the company. They are competitive in their business segment. What’re your thoughts on the culture there, however?",
        "created_utc": 1673903752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Micro drainage results review",
        "author": "fledaniel123",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dq57n/micro_drainage_results_review/",
        "text": "I have reviewed some micro drainage results and something odd is happening that I haven't come across before.\n\nNormally pipes In sequence (ie 1.000 1.001, 1.002) have an impermeable area and a sum of impermeable area. This was fine for some of the pipes but at about 1.010 the sum of imp area was zero amd suddenly there was a base flow.\n\nI checked the outfalls and there was only one which was further downstream. \n\nAny ideas? I only have the pdf so can't open the model itself.\n\nI am baffled at the dissapearence of area and appearance of a base flow.",
        "created_utc": 1673900100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hinge design for gapless moving of mitered surfaces",
        "author": "huub8",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dpiim/hinge_design_for_gapless_moving_of_mitered/",
        "text": "[removed]",
        "created_utc": 1673898668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offline classes are unnecessary and Boring",
        "author": "SkillCat_app",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10do2ay/offline_classes_are_unnecessary_and_boring/",
        "text": "[removed]",
        "created_utc": 1673895360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for smartphones themselves to create a local(ish) ad hoc 4G network?",
        "author": "D0D",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dnspg/is_it_possible_for_smartphones_themselves_to/",
        "text": "It could be useful when power is lost in mobile towers.",
        "created_utc": 1673894774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth getting MS in Finance as a civil engineer?",
        "author": "the_villajah",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dnlc2/is_it_worth_getting_ms_in_finance_as_a_civil/",
        "text": "[removed]",
        "created_utc": 1673894332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people want to work Offshore?",
        "author": "Elfenbeinkokos",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dl6gq/do_people_want_to_work_offshore/",
        "text": "[removed]",
        "created_utc": 1673890320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gas knobs blown off",
        "author": "katiekayxo",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dkzv4/gas_knobs_blown_off/",
        "text": "[removed]",
        "created_utc": 1673890054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving from \"maintenance technician\" to \"field service engineer\" or \"maintenance engineer\"?",
        "author": "RaptorArk",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dixql/moving_from_maintenance_technician_to_field/",
        "text": "  \n\nHello, I work as a maintenance technician for a motorway in Europe, and my duties include performing preventive maintenance and troubleshooting problems for various systems (cash machines, card readers, CCTV, heat pumps, tunnel sensors, public lighting, switches, routers, etc.).\n\nAfter five years in this role, I wish to upgrade my CV by changing jobs. While searching on LinkedIn, I found many job offers for \"Field Service Engineer\" and \"Maintenance Engineer.\"\n\nI have only a high school degree and am looking for a job that is more complex on the technical side and includes management tasks such as: participating in meetings, training end-users, etc.\n\nDo you think it would be good for my career to switch to one of these roles? What can I expect as a \"typical day\" in the field? Which role do you think would be better for me?\n\nI know that these two jobs are quite different, and that's why I'm asking for help.\n\nThank you.",
        "created_utc": 1673886588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Monday (16 Jan 2023): Have a question about your job, office, or pay? Post it here!",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10df979/career_monday_16_jan_2023_have_a_question_about/",
        "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
        "created_utc": 1673877612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don’t we use fluids with lower boiling points to push turbines for electricity",
        "author": "bobsyourdaughter",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10df3ai/why_dont_we_use_fluids_with_lower_boiling_points/",
        "text": "For example we could have easily been boiling ethanol instead of water to push turbines, considering it’s been around since the dawn of civilisation. Doesn’t that allow us to use less fuel for generating the same amount of electricity compared to using water? Am I missing something?",
        "created_utc": 1673877176,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I manually wear down a bunch of batteries for use in testing?",
        "author": "batteryquestionman",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10deojg/how_can_i_manually_wear_down_a_bunch_of_batteries/",
        "text": "[removed]",
        "created_utc": 1673876065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I attach a piston to my forearm and use it to break things with a high speed punch?",
        "author": "ILoveCatLiver",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10degym/can_i_attach_a_piston_to_my_forearm_and_use_it_to/",
        "text": "",
        "created_utc": 1673875460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Piston or hydraulic?",
        "author": "ILoveCatLiver",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10deg3v/piston_or_hydraulic/",
        "text": "[removed]",
        "created_utc": 1673875386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offline classes are unnecessary and Boring",
        "author": "SkillCat_app",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ddz4s/offline_classes_are_unnecessary_and_boring/",
        "text": "[removed]",
        "created_utc": 1673874028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there Biomedical Engineering Opportunities in Sydney or Australia in general?",
        "author": "ciara12304",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ddnho/are_there_biomedical_engineering_opportunities_in/",
        "text": "[removed]",
        "created_utc": 1673873078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there opportunities for Biomedical Engineers in Australia? Specifically Sydney?",
        "author": "ciara12304",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10ddkfd/are_there_opportunities_for_biomedical_engineers/",
        "text": "[removed]",
        "created_utc": 1673872819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: If I graduated and get a Degree on Mechanical Engineering, Can I still become or apply on Naval Architecture and Design Ships and Vessels? Even not having a Degree on Naval Arhitecture?",
        "author": "ADMIRALROVER",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dd9s7/question_if_i_graduated_and_get_a_degree_on/",
        "text": "",
        "created_utc": 1673871905,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does a system with memory depends on future inputs?",
        "author": "LostMermaid_824",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dd2el/how_does_a_system_with_memory_depends_on_future/",
        "text": "I was studying about systems with memory and without memory, and they said that a system with memory can depend on both the past and the future input. How is it possible? Shouldn't a system with memory only have past values, how can there be future values?",
        "created_utc": 1673871256,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the fuel consumption of a ship carrying ore?",
        "author": "norau",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dc7ny/what_is_the_fuel_consumption_of_a_ship_carrying/",
        "text": "Hi,\n\nI don't know if this is the right subreddit, but I'm trying to find fuel consumption for a ship carrying ore, preferably Handymax size. My google skills are not up to par, as I can only find numbers for container and cruise ships, or not the right size. Is there anyone who can point me in a sensible direction?",
        "created_utc": 1673868472,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Unusual Request) Can you design an accurate tattoo symbolic of civil engineering, quantum physics and medicine?",
        "author": "Smedskjaer",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10dbi99/unusual_request_can_you_design_an_accurate_tattoo/",
        "text": "Yeah, that is an unusual request, but please hear me out.\n\nI want to pay homage to my late parents. My dad, Lars C. Smedskjaer, was a well published experimental physicist (Ph.D. Quantum Physics, DTU (Denmark)), who worked at Argonne National Laboratories. My mom, Regitze M. Stenland, studied medicine in Denmark.\n\nI am of the mindset, if I am going to ink my skin, I want it to be something special. A homage to my parents, one which represents those fields of science and engineering, must be accurate models, and not purely artistic interpretations of a concept.\n\nSo, I am making my request for help here, among the engineers of Reddit, and not the tattoo artists.\n\nPlease, design for me a tattoo that represents civil engineering, quantum physics, and medicine.",
        "created_utc": 1673865993,
        "upvote_ratio": 1.0
    },
    {
        "title": "HVAC engineer migrating to Australia",
        "author": "Comfortable_Drama344",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10daf1r/hvac_engineer_migrating_to_australia/",
        "text": "I am currently a Filipino- based HVAC design engineer who designs project in the United States with 3 years experience. I am planning to migrate to Australia this year for better opportunities. How is the demand for purely HVAC designers?\n\nI recon I have to adjust back to metric first of all. What load calculation software do you guys use?Also if anybody share HVAC drawings from Australia that'd be great? I just want to see and grasp how much I should start adjusting myself from now with drawing standards, codes, typical equipment. HVAC pdfs would be great, you can omit the title blocks so I won't have any idea what that project address is for privacy reasons.   \n\n\nOther tips and insights about anything that can help would be awesome.",
        "created_utc": 1673861940,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do motors works as a generator?",
        "author": "SmartAbhi",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10d85ms/when_do_motors_works_as_a_generator/",
        "text": "I mean how can I convert motor into generator?",
        "created_utc": 1673853613,
        "upvote_ratio": 1.0
    },
    {
        "title": "would it be possible to combine cowl induction and ram air intakes to make a system that begins to raise efficiency at a lower speed?",
        "author": "DetectiveBowtie",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10d853s/would_it_be_possible_to_combine_cowl_induction/",
        "text": "I'm building a touring truck with a 359ci small block,\n I currently have to modify the hood to make the plumbing for the intake seal to the cowl induction scoop,\n but if it could be more effective to add in ram air I could fabricate a round chamber and shape the opposing intake ducts into a wedge or triangular shape and position them on opposite sides of the main chamber to force the incoming air to rotate as it flows down a velocity cone at the center,\nWould this work or am I missing something.",
        "created_utc": 1673853559,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the math behind building a drone?",
        "author": "Previous_Mud_4177",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10d71s9/what_is_the_math_behind_building_a_drone/",
        "text": "[removed]",
        "created_utc": 1673849866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ultrasonic transducer for underwater use",
        "author": "Fachini",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10d6dkq/ultrasonic_transducer_for_underwater_use/",
        "text": "[removed]",
        "created_utc": 1673847674,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I start engineering",
        "author": "newbie_698",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10d5axj/how_do_i_start_engineering/",
        "text": "[removed]",
        "created_utc": 1673844274,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I start my engineering journey?",
        "author": "newbie_698",
        "url": "https://www.reddit.com/r/AskEngineers/comments/10d53ka/how_do_i_start_my_engineering_journey/",
        "text": "[removed]",
        "created_utc": 1673843632,
        "upvote_ratio": 1.0
    }
]