[
    {
        "title": "Seeking a menu from the past. Any help?",
        "author": "MyYouMogwai",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4v2pne/seeking_a_menu_from_the_past_any_help/",
        "text": "Hello Professors of Food! I am a chef looking for Francis Mallmann Argentinian Potato menu that he cooked and submitted to judges in a European Chef's contest. This would have been at least two decades (more like three by now I believe) ago, and I have run down every lead that I could. I even called his restaurant to see if I could contact the man himself. That was a little embarrassing since I only speak English. Does any one know where I would find his Argentinian Potato menu? Thanks in advance!",
        "created_utc": 1469736579,
        "upvote_ratio": ""
    },
    {
        "title": "Books about the history of commercial or industrial food production?",
        "author": "Biscuits_4_Algernon",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4teuob/books_about_the_history_of_commercial_or/",
        "text": "I read an interesting book recently about the history of food consumed in air travel, Food in the Air and Space: The Surprising History of Food and Drink in the Skies (Food on the Go) by Richard Foss which I recommend if you're interested. Does anyone have recommendations for similar books about commercial food history?",
        "created_utc": 1468843431,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Are the people commenting here qualified in any way?",
        "author": "fnord_happy",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4sthdi/meta_are_the_people_commenting_here_qualified_in/",
        "text": "",
        "created_utc": 1468506008,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain the difference between mayonnaise and Aioli?",
        "author": "hydraman18",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4slg6s/can_someone_explain_the_difference_between/",
        "text": "It seems like every nice restaurant I go to these days is serving Aioli on one item or another. A quick internet search reveals nothing but a generic Wikipedia page and a Food Republic page that seems to say the main difference is the preparation method, region of origin, and garlic. But most of the time I see it as 'garlic aioli' anyways. I'm beginning to think it's being used as a fancy way for a restaurant to put mayo on things - am I wrong?",
        "created_utc": 1468386324,
        "upvote_ratio": ""
    },
    {
        "title": "Filipino food in comparison to that of its neighbors",
        "author": "Ich_bin_surreal",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4s6drr/filipino_food_in_comparison_to_that_of_its/",
        "text": "When compared to Malaysian, Indonesian, Vietnamese, Thai, etc. Filipino food is pretty simple; the use of spices is much more restrained, and the flavors less complex. \nThere might be dinner regional variation to it ( i.e. more seasoning in southern Filipino food), but it's still simpler than the food from neighboring countries.\nIs there any historical explanation to this?\n\n",
        "created_utc": 1468171309,
        "upvote_ratio": ""
    },
    {
        "title": "Strange tortillas",
        "author": "Yareaaeray",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4qhdx1/strange_tortillas/",
        "text": "My father recalls seeing a variety of tortilla being made in Northern Mexico in the 60s and 70s that is unlike anything I have seen in my fairly extensive travels there, and I've found no other information about it despite some extensive searches.\n\nIt was made on a large, thin, flat metal comal, usually over a fire, and may have been a mix of corn and wheat, but he wasn't sure. What is particularly strange is that it was made with a thin batter, rather than a dough. This batter was quickly and thinly smeared onto the comal by hand, resulting in a thin tortilla more like a crepe or bing.\n\nI'm baffled, and any help would be appreciated.",
        "created_utc": 1467228234,
        "upvote_ratio": ""
    },
    {
        "title": "What did people in the American colonies/Great Britain eat during winter?",
        "author": "FormicaCats",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4pzwz3/what_did_people_in_the_american_coloniesgreat/",
        "text": "I am curious about how different a person's diet would be in winter versus the rest of the year in those environments where they have very cold climates for part of the year. I was clicking through a few historical recipe sites and noticed that most of the recipes call for eggs, which I thought you couldn't get year-round then. Most recipes also call for milk, cream, or butter - could you get milk out of a cow year-round? For that matter, how did they make bread? Doesn't wheat go bad pretty quick? \n\nI suppose you could store things like beans, potatoes, cheese, and meat. And maybe fish? But the cookbooks I was looking at just seemed full of recipes that I didn't think you could do during the cold months. \n\n\n",
        "created_utc": 1466977892,
        "upvote_ratio": ""
    },
    {
        "title": "In your opinion, who is an important chef/cook that is relatively unknown.",
        "author": "ryguy_1",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4ptkzh/in_your_opinion_who_is_an_important_chefcook_that/",
        "text": "",
        "created_utc": 1466877448,
        "upvote_ratio": ""
    },
    {
        "title": "[X-Post from r/history] Recreations of 18th century cooking including this recreation of a soldier's meal from a primary source.",
        "author": "GraceAndMayhem",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4psxly/xpost_from_rhistory_recreations_of_18th_century/",
        "text": "[removed]",
        "created_utc": 1466868389,
        "upvote_ratio": ""
    },
    {
        "title": "[X-Post AskHistorians] Two episodes of the AH Podcast on Food History!",
        "author": "toomuchweightloss",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4nutze/xpost_askhistorians_two_episodes_of_the_ah/",
        "text": "[removed]",
        "created_utc": 1465809240,
        "upvote_ratio": ""
    },
    {
        "title": "What would be considered a quintessential meal of Americans in 1900-1910?",
        "author": "LifeOfTheUnparty",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4ntpnt/what_would_be_considered_a_quintessential_meal_of/",
        "text": "I'm trying to do a \"cooking through the decades\" challenge. Each week I plan to cook a meal from a different decade, starting with 1900 and moving forward. Any suggestions are appreciated, thank you!",
        "created_utc": 1465786638,
        "upvote_ratio": ""
    },
    {
        "title": "James Townsend and sons videow",
        "author": "TamerOfTasks",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4nr52k/james_townsend_and_sons_videow/",
        "text": "I stumbled on their videos a while back ago. They are a group of reenactors of the 17th century. Curious what your opinion is on their food recreations.\n\nhttps://youtu.be/Yv-nSG6fV1g\n\nEdit: This is why I can't have nice things.",
        "created_utc": 1465750958,
        "upvote_ratio": ""
    },
    {
        "title": "r/AskFoodHistorians Discussion. What periods in food history are you interested in? Why?",
        "author": "ryguy_1",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4npwty/raskfoodhistorians_discussion_what_periods_in/",
        "text": "Hello r/AskFoodHistorians Community, \n\nPlease feel free to post comments, ask for sources etc. about your favourite or most intriguing period in food history.\n\nRationale: Welcome to the first community discussion post! When I started the community, I planned on posting occasional discussions once we had enough members. I thought c.1,000 members might be good. Lo and behold, I noticed today that we have 1,300 food-history enthusiasts, so maybe it is time to try a discussion. \n\nThanks for your support of the subreddit. I hope you find some great responses!",
        "created_utc": 1465731782,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for early recipes from the Oregon Coast.",
        "author": "zer0dave",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4mb4yf/looking_for_early_recipes_from_the_oregon_coast/",
        "text": "I'm curious to know if anyone has any dish knowledge or even complete recipes for food made during the 1800's up until industrialization hit our menus around 1930. Even if you have an idea about something a grandparent made (example: \"Gram always made the best eel pie in Florence\") I'd like to hear it. Or if you have suggestions regarding where to look, I'm all ears. Thanks in advance. (x-posted to r/Oregon)",
        "created_utc": 1464926749,
        "upvote_ratio": ""
    },
    {
        "title": "Did colonial-era people eat avocados?",
        "author": "RanOutofCookies",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4j2oc8/did_colonialera_people_eat_avocados/",
        "text": "I've found multiple sources that say avocados were first tasted by a European in the 16th century, and they were cultivated in the Caribbean, but no definitive answer if they were eaten by colonists. Did (wealthy) colonists, such as those that lived in Williamsburg, eat avocados with any frequency?\n\nApologies for the terrible sentence structure!",
        "created_utc": 1463084720,
        "upvote_ratio": ""
    },
    {
        "title": "Im looking for the most genuine Mulligatawny soup recipe, can anyone help?",
        "author": "MariusPeik",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4cxcti/im_looking_for_the_most_genuine_mulligatawny_soup/",
        "text": "",
        "created_utc": 1459536946,
        "upvote_ratio": ""
    },
    {
        "title": "Translation of a 1616 Danish cookbook--surprised to see Grains of Paradise here. Why did it disappear for a while?",
        "author": "obsessive_cook",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/4c70sx/translation_of_a_1616_danish_cookbooksurprised_to/",
        "text": "http://www.forest.gen.nz/Medieval/articles/cooking/1616.html\n\n[Grains of Paradise](https://en.wikipedia.org/wiki/Aframomum_melegueta) are getting popular with chefs today as a \"new\" exotic peppercorn-like spice. Seems like it was super-useful in the past. I'd only previously used it in a bitters recipe, but I guess I can make 17th century Lutendranck with it too.",
        "created_utc": 1459109886,
        "upvote_ratio": ""
    },
    {
        "title": "Ukraine 1933: TIL about the most depressing cookbook, with sample exerpts",
        "author": "obsessive_cook",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/49tusi/ukraine_1933_til_about_the_most_depressing/",
        "text": "https://www.ukrhec.org/gallery/exhibits/show/ukraine-1933-cookbook/ukraine-1933-cookbook\n\nFound this fascinating and sad--\"recipes\" from the [Holodomor](https://en.wikipedia.org/wiki/Holodomor) as told to an artist who wanted to portray the horrific famine through the food desperate people ate.",
        "created_utc": 1457623364,
        "upvote_ratio": ""
    },
    {
        "title": "Curry Dish vs Curry Plant--How Are Their Names Related?",
        "author": "Anon_I_Commenteth",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/49frws/curry_dish_vs_curry_planthow_are_their_names/",
        "text": "Hello. I'm a cheap, lazy pleb who buys canned soup and adds generic mixed spices to it to cover the blandness. I noticed that my curry powder does not contain any curry. I read the [Wikipedia article on curry, the dish](https://en.wikipedia.org/wiki/Curry). I read the [Wikipedia article on curry, the plant](https://en.wikipedia.org/wiki/Curry_tree). I looked up [curry on the Online Etymology Dictionary](http://www.etymonline.com/index.php?term=curry). I cannot find any information explicitly about the relationship between the name of the dish and the name of the plant. Is one named for the other? If so, which? Is curry (dish) really only a specific variant and we are all ignorantly using it to refer to the entire class of dishes, of which it is only a part?\n\n\nThank you. ",
        "created_utc": 1457397628,
        "upvote_ratio": ""
    },
    {
        "title": "Jane Nickerson: Early American Food Writer",
        "author": "vbrown17",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/48uzmu/jane_nickerson_early_american_food_writer/",
        "text": "I stumbled across some NYT articles written by journalist Jane Nickerson in the 40s and 50s. Writing before Claiborne and Beard's popularity, Nickerson is arguably more of a \"mother of modern food writing\" than Claiborne can be the \"father.\" However, there is so little information out there about her. I'm even having trouble digging up all her articles--especially from her time at the Ladies' Home Journal and a FL newspaper--but there's practically no scholarship on her. I found one scholar, Kimberly Voss, with whom I am in touch, but looking for other information people may have, tips, thoughts, etc.\n\nThanks! ",
        "created_utc": 1457052979,
        "upvote_ratio": ""
    },
    {
        "title": "German Recipes for WWII Rations (X-Post from AskCulinary)",
        "author": "SweetHermitress",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/434az7/german_recipes_for_wwii_rations_xpost_from/",
        "text": "During WWII, Germany rationed like many other wartime nations do. How would German cuisine differ under rationing guidelines? The Reich was involved in every aspect of life - were there cookery guides for housewives?",
        "created_utc": 1454002177,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't Greeks/Cypriots eat mince?",
        "author": "Ryanatix",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/40onng/why_dont_greekscypriots_eat_mince/",
        "text": "I'm at uni and i live with two Cypriots, there Greek friend came over and when we were eating they asked about my dish. Which was shepards pie and i explained how to make it. When i said about the mince the just went 'oh we dont eat mince' obviously i asked why and they just said they just dont eat mince back home.\n\nIs this an actual thing?",
        "created_utc": 1452635570,
        "upvote_ratio": ""
    },
    {
        "title": "Great sources for food history info?",
        "author": "sarasmirks",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3wg1rm/great_sources_for_food_history_info/",
        "text": "I'm starting a culinary history podcast, and while a lot of the food items and historical periods I want to cover are fairly easy to source, and I've gathered a list of LOTS of food history books which are conveniently available from my public library, I would like to dig a little deeper. Some topics I'd like to cover simply don't have reputable information available at all. \n\nFor example I wanted to do a podcast episode on the history of the classic American birthday cake (yellow sponge in a round single or double layer, buttercream frosting, roses or other decorations, etc), but I can't find any real info. I'm also trying to trace how mayonnaise got from classic French cuisine to the main ingredient in German and Russian salads, but nothing seems to be coming up (probably because nobody is out there writing The Book Of Mayonnaise). \n\nI would be especially interested in scholarly journals, or even just good magazines that cover culinary history regularly. Or some authors (beyond the obvious Mark Kurlansky) to keep an eye out for. Digital sources are welcome, but I already know about the Food Timeline.\n\nI am not looking for pop-history or just-so stories. Everything I require for my purposes needs to be well sourced. Definitely not looking for \"DID YOU KNOW\"/\"FUN FACT\" type stuff.",
        "created_utc": 1449877251,
        "upvote_ratio": ""
    },
    {
        "title": "What did Itallians (and others) use for \"cornstartch\" before cornstartch was discovered? What was used for pasta before \"wheat?\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3w498s/what_did_itallians_and_others_use_for_cornstartch/",
        "text": "Trying to find more authhentic ingredients and corn a super recent invention/ingredientm and just doesn't work well for traditional tasting food I've found (despite every dang cookbook and supply claiming to be authentic having cornstartch or carragen as a primary ingrediant in nearly every sauce, sigh). If it wasn't an ingrediant what TECHNIQUE? and can you explain or link me to somewhere that illustrates the technique (with pictures of video prefered if possible hahah)?\n\nWhat about wheat? Modern wheat is only what 280- 700 years old? but pasta and bread have been around since recorded history in many cultures? What was the method or main ingrediant piror to modern varieties of \"wheat?\" I've heard farro was called wheat originally, but biologically farro is pretty unrelated to what is called wheat these days :/ so confused!",
        "created_utc": 1449691449,
        "upvote_ratio": ""
    },
    {
        "title": "What is the traditional, hand method, for making Flodeboller?",
        "author": "stickywizard",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3v584o/what_is_the_traditional_hand_method_for_making/",
        "text": "Hi - I have seen the mechanised chocolate pourers that produce perfectly covered meringues for flodeboller, but I am wondering how this even coverage can be achieved without machinery. \n\nIs there a special square lipped jug to pour an even line of chocolate for coating? Spray application? Dipping? \n\nAny ideas welcome, thanks!\n",
        "created_utc": 1449066182,
        "upvote_ratio": ""
    },
    {
        "title": "What are typical courses and foods from the Age of Enlightenment?",
        "author": "Costeno123",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3uw4z6/what_are_typical_courses_and_foods_from_the_age/",
        "text": "What could be a possible menu using foods from the Age of Enlightenment in Europe (18th century)",
        "created_utc": 1448912235,
        "upvote_ratio": ""
    },
    {
        "title": "[4K] Watch Pushing Dead.Online Full HD",
        "author": "other568",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3sa6j0/4k_watch_pushing_deadonline_full_hd/",
        "text": "[removed]",
        "created_utc": 1447169538,
        "upvote_ratio": ""
    },
    {
        "title": "What type of food would a French Impressionist painter enjoy while drinking some absinthe?",
        "author": "lostinedental",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3rkqg8/what_type_of_food_would_a_french_impressionist/",
        "text": "I've come into some actual \"forbidden\" absinthe and I have decided to make a whole affair of it with friends.\n\nNow I'm sure it was consumed by itself more often than not. But I like food with my drinks and would love to recreate a menu that Degas would have enjoyed.\n\nWould anybody be willing to help?",
        "created_utc": 1446689461,
        "upvote_ratio": ""
    },
    {
        "title": "Gladiator's Vinegar/Ash Sports Drink",
        "author": "FistOfNietzsche",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3qt5t7/gladiators_vinegarash_sports_drink/",
        "text": "I've read that the gladiator's drank a sports drink made of vegetable ash and vinegar. Has anyone deduced a recipe?",
        "created_utc": 1446186620,
        "upvote_ratio": ""
    },
    {
        "title": "How has the Snapple brand evolved over time and where is it headed in the future?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3p9e80/how_has_the_snapple_brand_evolved_over_time_and/",
        "text": "[deleted]",
        "created_utc": 1445196314,
        "upvote_ratio": ""
    },
    {
        "title": "What is the history of the tomato and watermelon salad?",
        "author": "arameister",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3mpmez/what_is_the_history_of_the_tomato_and_watermelon/",
        "text": "I've been trying to pinpoint the history of the tomato and watermelon salad by trying to find the oldest recipe in a cookbook. I hit up this list (http://food.quickfound.net/) and had no luck in finding older recipes. Perhaps the recipe didn't become popular until later years. In newspaper archives, the oldest recipe seems to be from 2009. ",
        "created_utc": 1443454972,
        "upvote_ratio": ""
    },
    {
        "title": "Are Viking chickens really Viking?",
        "author": "Tytyvyllus",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3m5a0t/are_viking_chickens_really_viking/",
        "text": "What kind of sources could support or refute the claims that norse settlers/Vikings brought chickens along with them on longships?  Is there any truth to the stories of viking heritage for Icelandic chickens, hedamorahonas, Swedish flower hens (blommehone), jaerhons, and other such land race norse chickens?",
        "created_utc": 1443059513,
        "upvote_ratio": ""
    },
    {
        "title": "How did guacamole get invented?",
        "author": "SpokenWorder",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3kzw13/how_did_guacamole_get_invented/",
        "text": "",
        "created_utc": 1442286696,
        "upvote_ratio": ""
    },
    {
        "title": "In your opinion, what is histories most influential cheese?",
        "author": "Starstuffb5",
        "url": "https://www.reddit.com/r/AskFoodHistorians/comments/3kyg54/in_your_opinion_what_is_histories_most/",
        "text": "I think goat cheese has its merits considering it's ancient origins.",
        "created_utc": 1442263362,
        "upvote_ratio": ""
    },
    {
        "title": "Why did so many different cultures invent (their own version of) dumplings?",
        "author": "TheFairyGuineaPig",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3i30qa/why_did_so_many_different_cultures_invent_their/",
        "text": "",
        "created_utc": 1440341180,
        "upvote_ratio": ""
    },
    {
        "title": "(x-post /r/askhistorians) What did the first domesticated Brassica look/taste like?",
        "author": "Helicase21",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3hlpsg/xpost_raskhistorians_what_did_the_first/",
        "text": "",
        "created_utc": 1440002390,
        "upvote_ratio": ""
    },
    {
        "title": "Where did \"tropical\" &amp; \"Asian\" &amp; \"Southwest\" flavors come from?",
        "author": "idiotsloveboxes",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3gvbih/where_did_tropical_asian_southwest_flavors_come/",
        "text": "Fusion cuisines &amp; international flavors are such a boon for American food culture. When fusion distillate down to the consumer level, we get flavor profiles like Tropical flavor gum or Southwest chicken noodle soup or Thai frozen pizza. Many a barbecue sauce brand will have a Caribbean or Asian flavor. How did this phenomenon of entire cultures getting boiled down to flavoring agents start? What does is it say about our food culture? \nBonus: I think this is related to a broader question of What is 'ethnic food'?",
        "created_utc": 1439485477,
        "upvote_ratio": ""
    },
    {
        "title": "r/AskFoodHistorians now has flair. Message mod to acquire yours.",
        "author": "ryguy_1",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3gpw8r/raskfoodhistorians_now_has_flair_message_mod_to/",
        "text": "Hi everyone. Thanks for contributing to this subreddit. Please let me know what you would like your flair to say, and give a brief description of how you acquired expertise within your field. You can post below, or pm me.",
        "created_utc": 1439385240,
        "upvote_ratio": ""
    },
    {
        "title": "Typical Terran food?",
        "author": "Satanga",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3gii8d/typical_terran_food/",
        "text": "I'm not sure if this is the right subreddit, but what are typical Terran (earth) food. Imagine, like opening a Italian or Chinese restaurant in an other country today you intend to open a Terran restaurant on an other planet. What would the menu look like?",
        "created_utc": 1439242215,
        "upvote_ratio": ""
    },
    {
        "title": "What was the cuisine of historical Mesoamerican cultures like?",
        "author": "PM_ME_A_FACT",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3ftumi/what_was_the_cuisine_of_historical_mesoamerican/",
        "text": "Cultures like the Aztec, Mayan, Olmec, etc. \n\nCould I cook what they made today? I'm very interested in world and historical cuisine. ",
        "created_utc": 1438742911,
        "upvote_ratio": ""
    },
    {
        "title": "Why are people in /r/food so hostile to deep dish pizza?",
        "author": "kodemage",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3fqlb5/why_are_people_in_rfood_so_hostile_to_deep_dish/",
        "text": "",
        "created_utc": 1438690133,
        "upvote_ratio": ""
    },
    {
        "title": "Food history books and websites",
        "author": "gabtinha",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3fpauc/food_history_books_and_websites/",
        "text": "Can you guys suggest some? Food History is something that I have always been interested but never found enough reading material ",
        "created_utc": 1438657455,
        "upvote_ratio": ""
    },
    {
        "title": "What are the superstar elements/foods of American (US) cooking, if there are any?",
        "author": "mr_glasses",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3foyg1/what_are_the_superstar_elementsfoods_of_american/",
        "text": "General question, I know.\n\nBarbecue?  Corn?  Tex-Mex food?  California wine?  Soul food?  The hamburger?",
        "created_utc": 1438651368,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it that you can find thick-cut bacon at most grocery stores, but you can practically never find wide cut bacon?",
        "author": "Eaziegames",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3fo38c/why_is_it_that_you_can_find_thickcut_bacon_at/",
        "text": "I was thinking about it and the thin strips are nice for finger food at breakfast, but when making a burger or something similar it would be nice for a sheet of bacon goodness.  ",
        "created_utc": 1438637338,
        "upvote_ratio": ""
    },
    {
        "title": "How did the introduction of western culture affect Japanese cooking/cuisine?",
        "author": "buddhabuck",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3fnvwt/how_did_the_introduction_of_western_culture/",
        "text": "Over a period of about 100 years (1853 to 1945...ish) Japan was subject to two US-imposed culture shocks: Commodore Perry's forcing open the ports, ending Japan's self-imposed isolation, and the post-WWII occupation.\n\nHow did these successive culture shocks change Japan's food culture? How would, for example, the food in Kyoto restaurants have changed from 1850 (before the Meiji restoration) to 1900 (after the first wave of westernization), to 1950 (after the defeat and occupation of WWII)?\n",
        "created_utc": 1438634198,
        "upvote_ratio": ""
    },
    {
        "title": "Where did the idea of placing chicken and waffles together come from?",
        "author": "TheRedditPope",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/3fjcnr/where_did_the_idea_of_placing_chicken_and_waffles/",
        "text": "I was watching season 3 of Mind Of A Chef on Netflix (originally appeared on PBS), and in the episode called \"Louisville\" the star chef shows us his take on Chicken and Waffles. While preparing the dish he mentions that he has no idea where the dish came from. He said he's asked a lot of chefs and restaurant owners and no one really has the answer.\n  \nSo, I'll put the question to the culinary historians here: what's the origins of chicken and waffles?",
        "created_utc": 1438543930,
        "upvote_ratio": ""
    },
    {
        "title": "Mayan (or Aztec?) Chocolate - what variety(s) of chillies did they add to it?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/30p5hj/mayan_or_aztec_chocolate_what_varietys_of/",
        "text": "Want to give it a try, but I'd like to be fairly authentic.   I'm pretty sure Sriracha sauce wouldn't work.\n\nEdit: Who's the motherfucker who downvoted this question? Isn't this precisely the sort of thing that would be in a \"Food Historians\" wheelhouse?",
        "created_utc": 1427636825,
        "upvote_ratio": ""
    },
    {
        "title": "Why do the English eat so late?",
        "author": "MuffinMan0420",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2vhs2g/why_do_the_english_eat_so_late/",
        "text": "I am reading Pride and Prejudice for my high school senior english class, (last year before college in America for you British and Europeans) and I noticed that they eat their meals pretty late compared to the US. The have breakfast after 10 am before noon, a dinner around 5, and a supper at like midnight. I was wondering why do they have meals so late?",
        "created_utc": 1423623142,
        "upvote_ratio": ""
    },
    {
        "title": "The history of mayonnaise?",
        "author": "eastkent",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2t6mgz/the_history_of_mayonnaise/",
        "text": "I've read that mayonnaise would originally have been made with extra virgin olive oil. This seems very likely because it would not have been processed back then. Many people are now not keen on the flavour but personally I like my mayonnaise made with extra virgin.  \n\nMy question is, what oils would it have been made with in countries where olives are not grown? In the UK the first mention of mayonnaise as we know it was in 1823. Would it have been made solely with imported olive oil back then?  ",
        "created_utc": 1421857923,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] Have Brussels sprouts always tasted as good?",
        "author": "the_dreaded_triptych",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2qb254/serious_have_brussels_sprouts_always_tasted_as/",
        "text": "I was having a discussion with my aunt and uncle and parents yesterday (all in their early to mid-60s) about Brussels sprouts. They recall Brussels sprouts being the bitter butt of many jokes during their childhood, whereas now they're everywhere, and quite delicious to boot. Although it's possible that people have just gotten better at preparing them, we speculated that the cultivar may have evolved in some way or been modified to make them less bitter. Does anyone else recall Brussels sprouts tasting worse back in the day? Anyone have any insight as to how and why they've made a resurgence?",
        "created_utc": 1419452380,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for old cookbooks",
        "author": "leillaf",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2q7k0o/looking_for_old_cookbooks/",
        "text": "And by old, I mean 19th century and earlier, or books that have old recipes (from reliable sources). Any reccomendations?",
        "created_utc": 1419367513,
        "upvote_ratio": ""
    },
    {
        "title": "Question on historical meat-cuts",
        "author": "Current_Poster",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2pj0v1/question_on_historical_meatcuts/",
        "text": "In an essay on this site (http://www.exurbe.com) that I can't seem to find right now, the historian-author points out that there's no way a TV show could do a \"totally historically accurate\" rendition of even Renaissance times, because they'd either make it alien and incomprehensible to a modern viewer, there's gaps in our knowledge that would have to be guessed anyway, or there's just too much detail to tend to.\n\nOne particular thing he said was that one historian may notice that the drapes were dyed an impossible color for the time (the dye simply didn't exist yet), but another historian might notice that \"the cut of meat on someone's plate didn't exist then\".\n\nIs there any source-material on how different eras divvied up, say, a cow or chicken? It seems interesting that it'd be so different.",
        "created_utc": 1418777967,
        "upvote_ratio": ""
    },
    {
        "title": "Culinary uses for saltpeter in history?",
        "author": "Jest2",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2d3d1d/culinary_uses_for_saltpeter_in_history/",
        "text": "Sorry to be on mobile, where I'm prone to typos and lack of formatting...\n\nI've gotten myself into something of a 'pickle' over at AskCulinary.  Your expertise may help me feel less of a dork. :). Has/was Saltpeter, aka KNO3/Potassium Nitrate, ever been used in food prep/preserving/cooking in the US? I'm speaking of home kitchens mostly. \n\nI got a lot of grief for asking how to find saltpeter at a grocery store in AskCulinary.  Being in my late thirties, I'm assuming this is a generational difference in post 9/11 America and the bomb making ingredient stigma of Potassium Nitrate.  Did potassium nitrate used to be more widely used, even in kitchens, but labeling changes made it kind of a taboo term?  Most salt products list only the ingredient \"salt\" without specifying which. \n\nTl:DR \n-was potassium nitrate ever available at the grocery store and what was it used for? Is it likely it's still being used, just not labeled as such because of taboo connotations?  I promise I'm not a bomb maker, just a seasoned cook who thinks I remember 'Old Timers' using KNO3 in corned beef or similar recipes. Help! These kids are under the impression I'm either an idiot or a terrorist. :/   I wish it didn't bother me so much, but it got under my skin. The \"head on over to Home Depot\" type advice is especially grating as I'm disabled, limited in my outings, and very rural. \n\n\nHere is the Xpost, but mobile link: http://www.reddit.com/r/AskCulinary/comments/2d1lml/is_mortons_pickling_salt_the_same_thing_as/.compact",
        "created_utc": 1407614954,
        "upvote_ratio": ""
    },
    {
        "title": "Calf in Milk - Recipe?",
        "author": "meractus",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2cnwdp/calf_in_milk_recipe/",
        "text": "Saw in another post that there used to be an ancient dish where a calf is cooked in it's mother's milk. \n\nI wonder if there is an actual recipe for something like this? I know in Malaysia, there is a dish called Beef Rendeng where beef is stewed in coconut milk (and this is an amazingly delicious dish when done properly, melt in your mouth beef, almost like a mild curry). \n\n",
        "created_utc": 1407217401,
        "upvote_ratio": ""
    },
    {
        "title": "Italian Tomatoes.",
        "author": "drunkandpassedout",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2cle8r/italian_tomatoes/",
        "text": "Since tomatoes came from the americas, when did the Italians start to embrace tomatoes? \nI can't imagine an Italian meal without tomatoes in it somewhere, but when did it start to catch on?",
        "created_utc": 1407165473,
        "upvote_ratio": ""
    },
    {
        "title": "North Carolina barbecue",
        "author": "songsyouusedtoknow",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2btwd6/north_carolina_barbecue/",
        "text": "Barbecue sauce in eastern North Carolina is vinegar-based with no tomato or ketchup. I love it, but what is its history? Why was it made to begin with?",
        "created_utc": 1406429732,
        "upvote_ratio": ""
    },
    {
        "title": "When did people start putting cheese on other food?",
        "author": "thevalentines",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/2ad44h/when_did_people_start_putting_cheese_on_other_food/",
        "text": "I was watching Celebrity Masterchef on BBC tonight, they were cooking a Tudor banquet and one of the options was cheese topped mushrooms. It suddenly occurred to me that putting cheese with other foods might not be that modern but I have no idea if this is true or not- has anyone got any really old cheesey recipes?",
        "created_utc": 1405024348,
        "upvote_ratio": ""
    },
    {
        "title": "What is the history of the American fad of \"Stuff Face With (x) For A Guinness World Record\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/1ux9ae/what_is_the_history_of_the_american_fad_of_stuff/",
        "text": "I see that the hot dog eating contest at Nathan's in Coney Island, NY goes back to the 1970s. It seems to be taking off.. there is another current post about a woman eating a seven pound steak... when did all this start? When will it (hopefully) end?",
        "created_utc": 1389399284,
        "upvote_ratio": ""
    },
    {
        "title": "Historically, were picky eaters (at dinner parties in someone's home) as vocal about their preferences/asking for modifications of their hostess as they are today? How did dinner party hostesses handle it then, and how should they handle it today?",
        "author": "Jest2",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/1kit6k/historically_were_picky_eaters_at_dinner_parties/",
        "text": "This has nothing to do with allergies or vegan/vegetarian. As a frequent dinner party hostess, I'm forced to deal with this from time to time. I was raised where that type of thing simply wasn't done. I'm very thrown off when it happens these days. Not sure what is the 'right' way to handle what I feel is a very wrong thing for the guest to do. \n\nThe biggest concern I have is when guests ask what I am serving before they accept. Sometimes I don't have the menu planned yet. I don't want to even breech the subject lest it turn into an opportunity for them to place special requests. Sorry if I sound uptight. Tell me how this was done historically, so my ancestors can give me confidence to handle these issues with grace. ;)",
        "created_utc": 1376698569,
        "upvote_ratio": ""
    },
    {
        "title": "When did restaurant reservations start?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/1i4xfv/when_did_restaurant_reservations_start/",
        "text": "Can anyone tell me when did restaurant bookings start? how it started?\nI tried googling it but all i got were opentable links/articles. I need to know when/how people came up with table reservations.\n\n(This is for my ppt in my food and bev class due in 3 days. \nMy professor suggest we do a role play on how to take/make reservations but I cant do that, I've always been terrified of talking in front of people but if i have all the information i need and the presentation goes well, then maybe it'll suffice.)\n\nThank you in advance!",
        "created_utc": 1373607859,
        "upvote_ratio": ""
    },
    {
        "title": "Role of culture in defining our food systems. How different cultures have come to embrace global and local.",
        "author": "spacecadet04",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/1a9wjj/role_of_culture_in_defining_our_food_systems_how/",
        "text": "Hey Reddit, I am interested in the how people from different backgrounds and cultures perceive food: Is it something people still put effort into, or prefer prepared from them? Is cooking with fresh produce (meat from butchers, and fresh veggies for e.g.) constant/important in the household? In the face of modern age how important is it/does it matter that the same ingredients have traveled x miles when people have access to more choice than they can consume? Their take on the idea of modern agriculture, their perception of global and local and how this impacts their buying habits; the layman's take on the food debate so to speak is what I am interested in.\n\nCould you point me to articles or studies you feel are relevant?\n\n**Note** I am reading this: [Food is Culture](http://cup.columbia.edu/book/978-0-231-13790-4/)\nAnd browsing through journals like: [Food, Culture, Society](http://www.bergpublishers.com/?TabId=521) | [Gastronomica](http://www.gastronomica.org/)\n\n*Not exactly the material I had in mind .. but helpful. I need something more explicit on culture and its role in defining our food choices. Any ideas?*",
        "created_utc": 1363250493,
        "upvote_ratio": ""
    },
    {
        "title": "SFA fun",
        "author": "worldcupfever",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/18u3vm/sfa_fun/",
        "text": "I figure that most anyone checking out this sub is familiar with the Southern Foodways Alliance, but if not, you can burn up a LOT of time going through everything the SFA offers on their website.  Some reeeeally great stuff here:\n\nhttp://southernfoodways.org/",
        "created_utc": 1361303491,
        "upvote_ratio": ""
    },
    {
        "title": "New England Cuisine?",
        "author": "skinsfan55",
        "url": "http://www.reddit.com/r/AskFoodHistorians/comments/1800y5/new_england_cuisine/",
        "text": "So, I'm a native Mainer. What types of food would my ancestors have eaten in colonial times? I know now that whoopie pies and lobster are big in Maine, but I wonder about what things would have been like in the 1700's.",
        "created_utc": 1360162202,
        "upvote_ratio": ""
    }
]