[
    {
        "title": "Is it accurate to say that US forces *outfought* the Wehrmacht (not just outnumbered/outmuscled) in 1944-45? If so, what data supports this claim?",
        "author": "Tough_Guys_Wear_Pink",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ci5nm/is_it_accurate_to_say_that_us_forces_outfought/",
        "text": "",
        "created_utc": 1677420808,
        "upvote_ratio": 1.0
    },
    {
        "title": "what was the roman life like for average man/woman?",
        "author": "rochesterslim",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ci3wl/what_was_the_roman_life_like_for_average_manwoman/",
        "text": "talking about the masses. what was the gendered lifecourse so to speak? how did it differ?\n\nplease don’t just say women were in the home and men out working. \n\ni mean specifically. because women couldn’t be in the home literally all day and before giving birth to young they had to do stuff other than rear kids.\n\nwhat was the average urban life? did they have jobs comparable to way we do?\n\nthanks",
        "created_utc": 1677420689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hurry up to pick up the Airdrop New from Arbitrum $ARB. Rewards started 25.02.23",
        "author": "Exact-Gold5777",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ci3nc/hurry_up_to_pick_up_the_airdrop_new_from_arbitrum/",
        "text": "[removed]",
        "created_utc": 1677420672,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the average height of royals, nobles, and wealthy men throughout the medieval period?",
        "author": "_SeekerOfBlood_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11chyv0/what_was_the_average_height_of_royals_nobles_and/",
        "text": "I know people were shorter in the past but that's presumably due to malnutrition, which these higher societal classes would presumably not face.",
        "created_utc": 1677420338,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what ways did napoleons personal absence in the peninsular war contribute to the french defeat in the war?",
        "author": "China_ate_my_cake",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11chy60/in_what_ways_did_napoleons_personal_absence_in/",
        "text": "",
        "created_utc": 1677420293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did knights go to university in the middle ages?",
        "author": "Logan_Maddox",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11chy2x/did_knights_go_to_university_in_the_middle_ages/",
        "text": "I can't find a straight answer for this. Some parts say that the University was mostly a phenomenom for the aristocracy, but others say that you only went there to be part of the clergy. Yet, many of them taught mainly Law, Medicine, and Theology - and some parts say that Law and Medicine were practiced, by excellence, by the burgher class.\n\nSo, would the son of a knight, expected to also be a knight, go to a university to get an education? Or is that only for third and fourth sons, who weren't expected to become knights?\n\nI refer mainly to the period of time between the 1200's and the 1400's.\n\nThank you!",
        "created_utc": 1677420287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sunday Digest | Interesting &amp; Overlooked Posts | February 26, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11chttz/sunday_digest_interesting_overlooked_posts/",
        "text": "[Previous](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22+OR+title%3A%22Day+of+Reflection%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nToday:\n\nWelcome to this week's instalment of [/r/AskHistorians](https://www.reddit.com/r/AskHistorians)' Sunday Digest (formerly the Day of Reflection). Nobody can read all the questions and answers that are posted here, so in this thread we invite you to share anything you'd like to highlight from the last week - an interesting discussion, an informative answer, an insightful question that was overlooked, or anything else.",
        "created_utc": 1677420013,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the consensus on the extent of cannibalism in the Aztec Empire/Triple Alliance at the time of Spanish conquest?",
        "author": "Comprehensive-Tax371",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11cgwpc/whats_the_consensus_on_the_extent_of_cannibalism/",
        "text": "And how can we tell what is and isn't Spanish colonial propaganda?",
        "created_utc": 1677417448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why allies did not help Jews during holocaust?",
        "author": "Nightwing2138",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11cgi4v/why_allies_did_not_help_jews_during_holocaust/",
        "text": " In 1943, Polish emissary Jan Karski presented evidence gathered by Polish and Jewish resistance groups that confirmed Germans were committing genocide in the most horrible ways. The leaders of the Jewish resistance asked the Allies to issue an ultimatum to the Germans, threatening to bomb German cities if the Nazis did not stop the genocide. Additionally, the Jewish resistance requested more material help, such as money or food, to assist Jews who were hiding from the Nazis. They also asked the Allies to bomb the railways used to transport Jews to death camps. However, the Allies did not take any action as requested. Some of them even doubted that there was a genocide, even after the evidence was presented, and it is unclear why. Firstly, exposing what the Germans were doing would have been a massive propaganda victory. Secondly, the Allies could have saved millions of lives if they had acted. Finally, bombing German cities would have been a good strategic move, and the Allies did do so later in the war. So why did they not react when it was confirmed that there was an ongoing massive genocide?",
        "created_utc": 1677416349,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Australian Capital Territory get its borders?",
        "author": "DJ_Jonezy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11cf638/how_did_the_australian_capital_territory_get_its/",
        "text": "Looking at a map of the ACT, Canberra takes up the north while there is a chunk of land several times the size of the city to the south. So what's the point of that land being in the ACT instead of NSW? Wasn't the whole point of the ACT to be a territory for the city of Canberra?",
        "created_utc": 1677412419,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would history have changed if Britain had rewarded the colonies for their participation in the war, instead of putting the American colonies under the power of Parliament?",
        "author": "Killuminati696",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11cdur0/how_would_history_have_changed_if_britain_had/",
        "text": " Would the colonies have gained independence only a little later? Is it just a matter of time?\"",
        "created_utc": 1677410521,
        "upvote_ratio": 0.99
    },
    {
        "title": "This is gonna be a stretch. What weapon, if any, represents the Volga Germans?",
        "author": "Kochie411",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11cchph/this_is_gonna_be_a_stretch_what_weapon_if_any/",
        "text": "I just discovered that my heritage is in the Volga Germans. As a weapon collector, I want to obtain a replica that represents this heritage.. but they were farmers/refugees, definitely not known for being combative. I was thinking perhaps a mid 18th century Percussion Pistol, or a Spontoon. \n\nBayonets were the rage between the 7 year war and the early 1900’s, so maybe I can find a bayonet? I’m a little lost. I was hoping one of y’all could help me out here.",
        "created_utc": 1677407500,
        "upvote_ratio": 1.0
    },
    {
        "title": "as the british gave up all their empire after ww2, wasn’t gandhi insignificant?",
        "author": "rochesterslim",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11cbf07/as_the_british_gave_up_all_their_empire_after_ww2/",
        "text": "Britain colonised massive swathes of the world. Then post ww2 it all goes away. So surely Britain would have granted India her independence anyway…\n\nso as much as Gandhi is great, surely he didn’t actually make much difference as we are told with the narrative of him driving Britain out",
        "created_utc": 1677405821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did clinical psychology and psychiatry become separate jobs and disciplines?",
        "author": "flingaway01",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ca5lk/why_did_clinical_psychology_and_psychiatry_become/",
        "text": "In modern times, clinical psychology and psychiatry are two distinct fields with separate educational and training programs, but this was not always the case. In the 19th and 20th centuries, psychology and psychiatry were often grouped together, and professionals in both fields could be involved in similar clinical work. What led to the separation of these two disciplines?",
        "created_utc": 1677403837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone answer this question?",
        "author": "Im-on-discord",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ca3fw/can_someone_answer_this_question/",
        "text": "Can someone answer this question\n\nI was playing the black ops 1 campaign and i noticed a red armband around the viet cong did that mean something during the Vietnam war",
        "created_utc": 1677403643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone answer this question",
        "author": "Im-on-discord",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ca1vi/can_someone_answer_this_question/",
        "text": "[removed]",
        "created_utc": 1677403570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who would have accepted the four gospels as ‘canonical’ as early as the 2nd century CE?",
        "author": "Dr5ushi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c9sed/who_would_have_accepted_the_four_gospels_as/",
        "text": "In Charles Freeman’s book ‘The Closing of the Western Mind’ he states that “the four (gospels) that we know were accepted as canonical during the second century.”  \n\nAs far as I’m aware there wasn’t much of a unified church by the 2nd century, more a series of communities spread across the Mediterranean, each with a bishop whose views on various dogmatic subjects could vary wildly from person to person. \n\nWho, then, would have considered it to be ‘canonical’ as such?",
        "created_utc": 1677402547,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Charles Freeman’s book ‘The Closing of the Western Mind’ he states that “the four (gospels) that we know were accepted as canonical during the second century.”",
        "author": "Dr5ushi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c8xrf/in_charles_freemans_book_the_closing_of_the/",
        "text": "[removed]",
        "created_utc": 1677399109,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the area of Standard Oil monopoly in the USA?",
        "author": "redright_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c8gk6/what_was_the_area_of_standard_oil_monopoly_in_the/",
        "text": "From what I remember, at the height of its power, Standard Oil had a 91% monopoly across the US. This should mean that a huge area of the country was completely monopolized.\n\n&amp;#x200B;\n\nOn what percentage of the US land area did this famous company have a complete monopoly?\n\n&amp;#x200B;\n\nA map is welcome.",
        "created_utc": 1677397223,
        "upvote_ratio": 1.0
    },
    {
        "title": "What consent scripts and standard acceptable methods of asking initiation of sexuality/romance have existed in the US?",
        "author": "JaronK",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c85ji/what_consent_scripts_and_standard_acceptable/",
        "text": "I'm writing up something on the history of consent communication languages and campaigns in the United States. This includes things like the history of \"Affirmative Consent\" and \"No Means No\".\n\nI'm wondering about methods of obtaining consent for sex and/or romance in the US from the founding of the country through 20 years ago. Did they have names (such as Affirmative Consent)? Were there other specific societal scripts that were considered acceptable or popular, and if so at what times?",
        "created_utc": 1677396015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sexuality Communication and Consent Languages in the United States",
        "author": "JaronK",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c84rq/sexuality_communication_and_consent_languages_in/",
        "text": "[removed]",
        "created_utc": 1677395936,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the history and origin of the *myth* of the Castilian lisp?",
        "author": "JJVMT",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c7dq8/what_is_the_history_and_origin_of_the_myth_of_the/",
        "text": "Obviously, it's not true, since if it had been true, a) Iberian Spanish speakers would pronounce 's' as well as 'z', 'ce', and 'ci' as /θ/, which is not the case, and b) the feature would be found in Latin American Spanish, since Peter of Castile (the king whom the people of Castile supposedly imitated before mass media to give rise to this mass sound change) died in 1369, well over a century before Spanish colonization of the Americas began.\n\nSo when and how did this myth come about? I am guessing it did not start among native Spanish speakers, either in the Americas or Europe, is that correct?",
        "created_utc": 1677393082,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the Soviet reaction to the Japanese invasion of Manchuria in 1931?",
        "author": "AntiFascist_Waffle",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c6zge/what_was_the_soviet_reaction_to_the_japanese/",
        "text": "Given the history of conflict between Russia and Japan over Manchuria (Russo-Japanese War, Siberian Intervention) and future hostilities between the two countries (Battles of Khalkin Gol, Soviet Invasion of Manchuria), it seems surprising that the Soviet Union would allow Japan to just get away with invading Manchuria. As the Soviet Union shares a land border with Manchuria, unlike the Western powers, did they consider military action at any point to preserve their influence in the region?",
        "created_utc": 1677391619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Tolstoy considered a misogynist?",
        "author": "PhiloSingh",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c6sod/why_is_tolstoy_considered_a_misogynist/",
        "text": "Is it just because of the book his wife wrote on him? Because that seems to be the main source that people use when bringing up his views/actions on women which I find kind of illogical? We know that Tolstoy and has wife both mutually had resentment for each other (or at least that's what I've read) so why would people place such a high level of trust in the writings of someone who would clearly be biased and have a selective perspective in what they write?\n\nSo what I was really looking to know is, **was there any other evidence or reasons that Tolstoy is given this reputation of a misogynist?**\n\nSince I'm getting used to seeing people blame him for his views on social media like TikTok and Twitter but I find it really hard to believe as from what I've read a lot of Tolstoy's beliefs seemed really progressive for his time and focused on positive action, but then I read about everything about his wife and him supposedly being a misogynist and it all just feels like it's two different people when reading about it..",
        "created_utc": 1677390953,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the personal relationship like between Mao and Zhou Enlai?",
        "author": "gomi-panda",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c6idi/what_was_the_personal_relationship_like_between/",
        "text": "Zhou was Mao's right hand. He depended on him for so much, while at the same time had designated a different successor than Zhou, and he had even previously purged Zhou among many others (including future premier Deng Xiaoping). \n\nBoth men are so formidable and no doubt were dedicated to the prosperity of China. But I'm at a loss to understand their psychology, especially Mao's, and what they believed about each other. Thank you.",
        "created_utc": 1677389926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: Please help me understand what is happening in this photo taken in 1912 of a dog jumping from a very tall ladder at the Oxford Street Fair?",
        "author": "MrCleanCanFixAnythng",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c642k/q_please_help_me_understand_what_is_happening_in/",
        "text": "Here is a link to a photo taken in 1912 of the Oxford Street Fair showing a dog jumping from a very tall ladder onto a blanket held by the crowd.\n\nDoes anyone have additional background information about this type of event such as: Why was this done? Were the dogs injured or killed? Did people pay to see this? How did they get the dog to climb the ladder? And how did they get the dog to jump? When did this practice stop and was it made illegal or just discouraged?\n\n[https://commons.wikimedia.org/wiki/File:Dog\\_jumping\\_from\\_ladder\\_at\\_Oxford\\_Street\\_Fair\\_1912\\_(3191567020).jpg](https://commons.wikimedia.org/wiki/File:Dog_jumping_from_ladder_at_Oxford_Street_Fair_1912_(3191567020).jpg)\n\nAny insights or leads appreciated!",
        "created_utc": 1677388509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: Please help me understand what is happening in this photo of a dog jumping from a very tall ladder taken at the 1912 Oxford Street Fair?",
        "author": "MrCleanCanFixAnythng",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c5xo6/q_please_help_me_understand_what_is_happening_in/",
        "text": "Here is a link to a photo from the 1912 Oxford Street Fair showing a dog jumping from a very tall ladder onto a blanket held by the crowd. \n\nDoes anyone have additional background information about this type of event such as: Why was this done? Were the dogs injured or killed? Did people pay to see this? How did they get the dog to climb the ladder? And how did they get the dog to jump? When did this practice stop and was it made illegal or just discouraged?\n\n[https://commons.wikimedia.org/wiki/File:Dog\\_jumping\\_from\\_ladder\\_at\\_Oxford\\_Street\\_Fair\\_1912\\_(3191567020).jpg](https://commons.wikimedia.org/wiki/File:Dog_jumping_from_ladder_at_Oxford_Street_Fair_1912_(3191567020).jpg)\n\nAny insights or leads appreciated!",
        "created_utc": 1677387893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any instance of FDR and Hitler having any sort of correspondence? Any sort of diplomatic exchange on any level before the US entered the war? What about Churchill?",
        "author": "TheBordenAsylum",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c5szo/is_there_any_instance_of_fdr_and_hitler_having/",
        "text": "",
        "created_utc": 1677387470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Police in Western countries used to wear more military-style dress uniforms, even in the line of duty. What has driven the evolution toward the more tactical “tactical” styles that we see today?",
        "author": "-Anarresti-",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c5jma/police_in_western_countries_used_to_wear_more/",
        "text": "",
        "created_utc": 1677386558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions related to Nazi Germany and it’s politics and ideology",
        "author": "Ok_Tutor6052",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c53n5/questions_related_to_nazi_germany_and_its/",
        "text": "[removed]",
        "created_utc": 1677385089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any evidence that the FBI killed Tupac?",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c4asa/is_there_any_evidence_that_the_fbi_killed_tupac/",
        "text": "Hello! I am asking this because a book on this subject came out recently, but I can't find a lot of info on that theory online that doesn't reference that book. Is there anything indicating the FBI killed him? I don't personally think so, but I have not read the book. Also, is this too \"recent\" of a event to be asking questions about on here? I apologize if that is the case.",
        "created_utc": 1677382465,
        "upvote_ratio": 1.0
    },
    {
        "title": "What historically influenced depictions of wizards?",
        "author": "tiberiuskodaliteiii",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c49nq/what_historically_influenced_depictions_of_wizards/",
        "text": "I might be answering my own question in this post, but it would still be nice to get a good answer.\n\nWhen we think of wwizards today, most people think of long robes and pointy hats. Where did this come from?\n\nEven before the mass popularity of the Harry Potter books, they were portrayed this way in things like Lord of the Rings, Fantasia, and Arthurian legend. I know the term \"wizard\" originally meant \"wise person\" (the same way you'd call a drink person \"drunkard\") and have heard that the way they are portrayed is similar to medieval/renaissance fashion. Could depictions have stemmed from \"original\" wizards being wise/scholarly people from these periods, which would have constituted them being from a higher class and thus partaking in that style of fashion?",
        "created_utc": 1677382358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why aren’t the assasinations of Garfield and Mckinley as well known and talked about as the assasinations of Lincoln and JFK?",
        "author": "Secure_Use8572",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c3jks/why_arent_the_assasinations_of_garfield_and/",
        "text": "Many people tend to talk about the assasinations of Lincoln and JFK, but i never hear about people talking about the assasinations of Garfield and Mckinley, why is that?",
        "created_utc": 1677380137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the impacts of the Indo-European Migrations overexaggerated?",
        "author": "emperator_eggman",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c3hhz/are_the_impacts_of_the_indoeuropean_migrations/",
        "text": " As someone who studies Thai history, one problem with Thai historiography is that early historians from the early 20th century argued that the Tai migrations of the 12th and 13th centuries replaced the old government structures, genetics, and way of life of the people that once inhabited the area of present-day Thailand, when modern-day research has indicated that that is totally opposite to what happened, that old government structures were largely preserved, most Thais today have a large degree of non-Thai DNA, and the Tai migrations were a nobility thing where the nobles eventually adopted the indigenous way of life.\n\nI am therefore wondering if this is the same with the Indo-European Migrations. For one, I do not support the idea that Anglo-Saxons wiped out the indigenous inhabitants of Britain or killed all the men and married all the women.",
        "created_utc": 1677379969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the Indo-European Migrations Overhyped?",
        "author": "emperator_eggman",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c3gya/are_the_indoeuropean_migrations_overhyped/",
        "text": "As someone who studies Thai history, one problem with Thai historiography is that early historians argued that the Tai migrations of the 12th and 13th centuries replaced the old government structures, genetics, and way of life of the people that once inhabited the area of present-day Thailand, when modern-day research has indicated that that is totally opposite to what happened, that old government structures were largely preserved, most Thais today have a large degree of non-Thai DNA, and the Tai migrations were a nobility thing where the nobles eventually adopted the indigenous way of life. \n\nI am therefore wondering if this is the same with the Indo-European Migrations. For one, I do not support the idea that Anglo-Saxons wiped out the indigenous inhabitants of Britain or killed all the men and married all the women.",
        "created_utc": 1677379920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Viking traders (assessment)",
        "author": "Notthatguy74",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c2k8q/viking_traders_assessment/",
        "text": "[removed]",
        "created_utc": 1677377223,
        "upvote_ratio": 1.0
    },
    {
        "title": "how close was Spartans and Prussia culture?",
        "author": "personisme185",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c2178/how_close_was_spartans_and_prussia_culture/",
        "text": "They were both known as more warrior states. (Prussia was an army with a state) so was Prussia a more modern in Victoria time Sparta?",
        "created_utc": 1677375656,
        "upvote_ratio": 1.0
    },
    {
        "title": "You hear a lot about the English language replacing the use of other languages, but what are some examples of cultures where English used to be widely spoken and is now phased out?",
        "author": "negative_visuals",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c1z1d/you_hear_a_lot_about_the_english_language/",
        "text": "",
        "created_utc": 1677375477,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Whigs and the Tories differ on how to deal with the American colonialists?",
        "author": "Awesomeuser90",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c1rjk/how_did_the_whigs_and_the_tories_differ_on_how_to/",
        "text": "Just as it said in the title. The Whig Supremacy had waned just before the war, and Lord North had become prime minister from a Tory branch in 1770. \n\nWere the Whigs agreeable to things like seats in parliament or responsible government for the   \nseventeen British majority provinces?",
        "created_utc": 1677374889,
        "upvote_ratio": 1.0
    },
    {
        "title": "During China’s Warring States Period, are there documented records of generals leading charges? Was it common for generals to die in the chaos of land grabs for power?",
        "author": "ManicRuvik",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c1ii2/during_chinas_warring_states_period_are_there/",
        "text": "How often would generals die, by any means really. Charges, ambush, execution, etc.",
        "created_utc": 1677374150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for memoirs of Russian factory workers pre-1917 revolution",
        "author": "PartyRevolutionary54",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c19qh/looking_for_memoirs_of_russian_factory_workers/",
        "text": "[removed]",
        "created_utc": 1677373435,
        "upvote_ratio": 1.0
    },
    {
        "title": "What perspective did Herodotus write The Histories from? (Ancient History)",
        "author": "JJEvans1999",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c15ca/what_perspective_did_herodotus_write_the/",
        "text": "Herodotus was a great traveller with an eye for detail, a good geographer and a man with an indefatigable interest in the customs and past history of his fellow citizens. His *magnum opus* is undeniably *The Histories* depicting the Greco-Persian Wars. I was therefore wondering exactly from what perspective was this historical source of Herodotus’ created? In addition, who was the intended audience of the source and for what purpose was this source made? Was Herodotus also biased or was he a man of the widest tolerance, with no bias for the Greeks and against the barbarians?",
        "created_utc": 1677373120,
        "upvote_ratio": 1.0
    },
    {
        "title": "What perspective did Herodotus write The Histories from? Who was his audience? Was he biased?",
        "author": "JJEvans1999",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c0lpf/what_perspective_did_herodotus_write_the/",
        "text": "Herodotus was a great traveller with an eye for detail, a good geographer and a man with an indefatigable interest in the customs and past history of his fellow citizens. His *magnum opus* is undeniably *The Histories* depicting the Greco-Persian Wars. I was therefore wondering exactly from what perspective was this historical source of Herodotus’ created? In addition, who was the intended audience of the source and for what purpose was this source made? Was Herodotus also biased or was he a man of the widest tolerance, with no bias for the Greeks and against the barbarians?",
        "created_utc": 1677371589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody recommend any books/audiobooks on the history of ancient Peru and Central America?",
        "author": "Hala_Madrid1098",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c0451/can_somebody_recommend_any_booksaudiobooks_on_the/",
        "text": "",
        "created_utc": 1677370272,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Nabokov's Ada, the teenage characters spend most of their time travelling here and there, spending a month at a time in various cities, adventuring without their parents. How common was this sort of independence for rich youth of the 19th century? And how would their families track one another?",
        "author": "tollthedead",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11c018y/in_nabokovs_ada_the_teenage_characters_spend_most/",
        "text": "",
        "created_utc": 1677370061,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did Tzar Nicholas II do to help his people besides abdication?",
        "author": "KnotKarma",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bzz9v/what_did_tzar_nicholas_ii_do_to_help_his_people/",
        "text": "",
        "created_utc": 1677369916,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the role of the crusader states in the Silk Road prior to the Fourth Crusade?",
        "author": "Memesforgloryofussr",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bzgwj/what_was_the_role_of_the_crusader_states_in_the/",
        "text": "The crusader states brought Western Europeans to the Levant there in changing the political makeup of a region which had been important in the Silk Road trade of particularly Islamic ceramics with China. What did the existence of these new political entities mean for the Silk Road as a whole and the spread of Silk Road commodities to Europe?",
        "created_utc": 1677368580,
        "upvote_ratio": 1.0
    },
    {
        "title": "A scene in Peaky Blidners shows the British Army deployed to Brimingham to fight the communists. How much truth is in that?",
        "author": "loverofshawarma",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bza0q/a_scene_in_peaky_blidners_shows_the_british_army/",
        "text": "How did the British government root our communisim/socialism from its society?. Was it bloody?",
        "created_utc": 1677368075,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did Friedrich Nietzsche think of contemporary Greece? Did he ever visit the country?",
        "author": "BabyBloodDistilleris",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bz9dr/what_did_friedrich_nietzsche_think_of/",
        "text": "Nietzche was extremely fond of ancient Greece( at least before Aristotele). He was also born about a decade after Greece became an independent country.\n\nSo he must have said something about modern Greece.\n\nAlso there was a period in his life( after getting early retirement) where he was highly mobile. Apparently he was also searching for a more mild climate to ease the effects of his illness. Did he ever visit Greece and if no why didn't he take the opportunity considering all of the above?",
        "created_utc": 1677368030,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference beetween nazi doctors who made experiments on prisoniers of lagers and Cerare Lombroso who made the same on southern Italians after Italy unification?",
        "author": "Ziopover",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bz8w7/what_is_the_difference_beetween_nazi_doctors_who/",
        "text": "There is a museum in Turin with the heads of southern italians killed by piedmontes. Lombroso studied their physical features to support his wrong razist and absurd theories. Cut heads of such people are exposed in this museum. Why this is allowed? What is the difference with what was done by nazists during wwII?",
        "created_utc": 1677367995,
        "upvote_ratio": 1.0
    },
    {
        "title": "ELI5: How did we transition from monkeys who bonk each other to resolve conflict to monkeys who talk to each other to resolve conflict?",
        "author": "BERCMJSJ-5",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bysii/eli5_how_did_we_transition_from_monkeys_who_bonk/",
        "text": "title. I am having a difficult time understanding how exactly a society finds that punching each other is not the best resolution to conflict. Please answer with links &amp; references",
        "created_utc": 1677366820,
        "upvote_ratio": 1.0
    },
    {
        "title": "An average western household's layout for middle-class people typically consists of two bedrooms, a bathroom, a kitchen, and a living area. How far could I travel back and still have this standard of a home? Did Wealthy ancient Romans have a similar layout?",
        "author": "Lexicorint",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11byryv/an_average_western_households_layout_for/",
        "text": "How wealthy would I have to be in ancient Rome to have this sort of luxury?",
        "created_utc": 1677366781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Socrates served in at least three campaigns against Sparta as a hoplite —including once when he was old enough to have begged off —and acquitted himself well, saving Alcibiades and a senior Athenian general. Was he morally opposed to this war but serving because he believed it was his duty?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bybje/socrates_served_in_at_least_three_campaigns/",
        "text": "Socrates famously decided not to flee his death sentence, believing following his city's laws was the right thing to do. So he drank Hemlock and died when he might have lived.\n\nSo I've always wondered if Socrates likewise had doubts about Athens' war against Sparta and its league. Was he in favor of prosecuting the war? Or was he, as I imagine he might be, morally opposed but committed to following the dictates of his city's assembly because he thought it was the right thing to do?",
        "created_utc": 1677365628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did the phrase \"I am not angry, I am just diasppointed\" originate?",
        "author": "TheLoudGerman",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11by3w9/where_did_the_phrase_i_am_not_angry_i_am_just/",
        "text": "I hope this question fits this subreddit, I searched for a bit through etymology-subreddits,but with no results, so I thought I'd try it here:\n\nSo I just watched -the great - Brief Encounter (1944), in which one character uses the phrase \"I am not angry, I am just diasppointed\". The phrase seems to be a pretty common sentiment nowdays, communicating something of a double meaning, suggesting that the speaker actually is mad, and that the person speaking should very much be aware of why that is. The film seems to use it in the same way when one character (Spoilers!!) asks one of the movies protagonists for the keys he lent him to his flat, where our protagonist had an affairs, but justifying it with his own carelessness as he is 'afraid of loosing his first pair of keys'. \nI was wandering if maybe someone had some insight into this - rather niche - question of the origin and history of that expression. Thanks in advance!",
        "created_utc": 1677365099,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some plants/animals/things that symbolised death and where/when?",
        "author": "Darjee345",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11by3ox/what_are_some_plantsanimalsthings_that_symbolised/",
        "text": "Poppy flowers and seedpods are one such symbol in my culture, they symbolise \"eternal sleep\" to be exact, due to it's sedative effects. \nWhat are other similar symbols throughout history?\n\n\nIf anyone could recommend books on that topic (not only symbolism but funerary art throughout history) it'd be amazing too, especially about ancient Rome and Greece",
        "created_utc": 1677365085,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did body armour used in the Napoleonic Wars compare to late medieval plate armour?",
        "author": "cetrei",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bxn8m/how_did_body_armour_used_in_the_napoleonic_wars/",
        "text": "I'm particularly interested in how the steel they used in the early 19th century compares to what they would've used in the 15th, 16th centuries.",
        "created_utc": 1677363927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did authoritarian regimes arise in Eastern Europe in the period between the two world wars?",
        "author": "Legionarivs_Romanvs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bw178/why_did_authoritarian_regimes_arise_in_eastern/",
        "text": "After the end of the great war, new states (Poland, Yugoslavia, Czechoslovakia, Hungary and the Baltic states) were born in Eastern Europe with a democratic system, but in the period between the two world wars authoritarian right-wing regimes progressively established themselves in all the Eastern European states (both new and existing ones) except Czechoslovakia. What are the reasons that led to this process and why was Czechoslovakia excluded from it?",
        "created_utc": 1677359912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was George III really the villain and tyrant portrayed by American television and movies?",
        "author": "Alaska-Now-PNW",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bvxek/was_george_iii_really_the_villain_and_tyrant/",
        "text": "",
        "created_utc": 1677359642,
        "upvote_ratio": 1.0
    },
    {
        "title": "What language was spoken in England before the Roman invasion, and was it still used after the invasion, or was the Romans language (Latin?) used instead?",
        "author": "Rocky-bar",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bvj01/what_language_was_spoken_in_england_before_the/",
        "text": "",
        "created_utc": 1677358618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient languages in England",
        "author": "Rocky-bar",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bvgo7/ancient_languages_in_england/",
        "text": "[removed]",
        "created_utc": 1677358452,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Ghengis Khan acquire political and military following at 19?",
        "author": "notnotavirginnot",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bv5o6/how_did_ghengis_khan_acquire_political_and/",
        "text": "What in Mongol culture made it so that a man exiled from childhood and a fugitive could acquire political and military power while not even being 20",
        "created_utc": 1677357698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the reason for the Ottoman conquest of the Balkans that the opponents were weak?",
        "author": "PureSiberian",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bv25f/was_the_reason_for_the_ottoman_conquest_of_the/",
        "text": "The Conquest of Constantinople was at a time where the Byzantine Empire was really small. Serbian and other Albanian kingdoms weren’t really that big and so were not the Bulgarians",
        "created_utc": 1677357464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medieval warfare books / articles that take a \"Face of Battle\" approach like Keegan's?",
        "author": "11112222FRN",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11buj17/medieval_warfare_books_articles_that_take_a_face/",
        "text": "Are there any other academic books or articles on medieval warfare that use the same personal, up-close approach to the combatants' experiences that Keegan applied to Agincourt in his \"Face of Battle\" book?",
        "created_utc": 1677356177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Of the many European diasporas to the Americas, what were the factors that the Spanish Galician diaspora was so significant (so many migrated) in the early 1900’s?",
        "author": "Euskadi1900",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11btbe0/of_the_many_european_diasporas_to_the_americas/",
        "text": "\nI am aware of a great number of migrations of Europeans to the Americas. Because of my family history, I am looking for resources of the Spanish (Spain) diasporas, especially in the early 1900s to say 1920s. I am aware of other Spanish migrations during and after Francos reign. Would like to limit the timeline to the dates above. \n\nMy own maternal grandfather left Galicia (out of Vigo) in 1908 during a massive migration of Galicians to the Americas settling in South America. I found some of the numbers and beginning in 1900 the numbers climb significantly. \n\nIs there published material you would recommend to do more research on this topic, with special focus on the Galicians of north western Spain?",
        "created_utc": 1677353176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the Mona Lisa a photograph? What evidence is there that Da Vinci may have done his camera obscura experiments at the same time that the Mona Lisa was in production?",
        "author": "NounPaintDry",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bsybv/was_the_mona_lisa_a_photograph_what_evidence_is/",
        "text": "Basically I understand that the general body and composition of the Mona Lisa was a template that Da Vinci used for lots of portraits of various Lord’s wives and stuff, and I know he spent years with Mona Lisa in the studio and he spent years doing camera obscura experiments, but I was wondering how much those events lined up and is there any good books or articles or papers or write ups about the “mona lisa was a woman sitting outside with her face being projected upside down through a pinhole into a dark room onto an upside down portrait template where it was traced and then painted with a granular hatching style and then left unfinished as it was as a proof of concept demonstration for proto-photography” theory?  \n\nLike is the Mona Lisa so popular because it was potentially the inception point of modern art?  Are the anatomy issues around the mouth maybe explained by the production process of having used a projector on top of a painting template?\n\nAlso are there any kind of /r/askarthistorians subs?",
        "created_utc": 1677352278,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find German POW records for Soviet Camps?",
        "author": "Weihnachtsbaum123",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bswx8/how_to_find_german_pow_records_for_soviet_camps/",
        "text": "Hey!:) One of my close family members had a beloved relative who was captured by the Soviets at the Eastern front at the end of ww2. He managed to survive and walked back all the way from Siberia to Germany and arrived back home in 1950.\n\nFrom what I know, he never talked much about his time there at all - understandably so considering the conditions of those camps. \n\nI would however like to know more about his past, but I haven't been able to find ANY resources whatsoever for German POWs in Soviet camps. He has a pretty unique name but I still haven't been able to find anything online:(\n\n Has there been made any attempts to create an archive online/in-person for these individuals that I could maybe use? :))",
        "created_utc": 1677352179,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm an incredibly wealthy American in the Gilded Age, and my contemporaries are marrying their daughters off left and right to Englishmen! What on earth are they thinking?",
        "author": "ZzzSleepyheadzzZ",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bswap/im_an_incredibly_wealthy_american_in_the_gilded/",
        "text": "A recurring character I've noticed in works set in the early 20th century is the \"Dollar Princess\"; the wealthy American heiress that has been married off to an Englishman of some rank. It has always struck me as a bit odd to why they did that, particularly if their daughter was their only heiress. \n\nWhat benefit would the Gilded Age wealthy American receive from such a match? \n\nI know there are some customs of a young man marrying into a wealthier/more prestigious family and taking his wife's last name; was that not considered an attractive proposition in the Gilded age?\n\nThank you for your consideration of my question!",
        "created_utc": 1677352135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arbitrum $ARB Airdrop New. Rewards 25.02.23",
        "author": "tiger09te",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bskxi/arbitrum_arb_airdrop_new_rewards_250223/",
        "text": "[removed]",
        "created_utc": 1677351337,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was/is the legacy of Wu Zetian, the only female empress in Chinese history, among Chinese women? Was she a source of fascination? A hero? A villain? Or was she mostly forgotten?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bs7g6/what_wasis_the_legacy_of_wu_zetian_the_only/",
        "text": "",
        "created_utc": 1677350385,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were mercenaries raised and operated in classical times?",
        "author": "Reactionaryhistorian",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bs6e3/how_were_mercenaries_raised_and_operated_in/",
        "text": "In the Punic wars and other wars around that time you read a lot about mercenaries. Also in the Hellenistic period and prior. But just how would you go about hiring a mercenary? Did they operate in companies? Was it similar to medieval mercenaries? Sometimes they seem to be hired along ethnic lines was this a common thing?",
        "created_utc": 1677350308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why were the Americans the first to use shotguns in combat?",
        "author": "SolomonCRand",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bs53m/why_were_the_americans_the_first_to_use_shotguns/",
        "text": "From what I understand, Americans went to WWI with shotguns and pissed the Germans off in the process. Did anyone else use them in a military context prior? Did they pop up in the Civil War? When I learned about the German objection, I had assumed they were very effective, as it’s hard to imagine they were actually concerned about humanitarian reasons while they were still using poison gas. If so, you’d think someone would have beaten us to the punch.",
        "created_utc": 1677350216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did a lot of Germans feel that WW1 was an unnecessary conflict that Kaiser Wilhelm II got them involved in, or, how did they see it after the war? I was wondering if many Germans blamed Kaiser Wilhelm II for getting them involved?",
        "author": "Emergency_Zebra_5972",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11brxxu/did_a_lot_of_germans_feel_that_ww1_was_an/",
        "text": "Did a lot of Germans feel that WW1 was an unnecessary conflict that Kaiser Wilhelm II got them involved in, or, how did they see it after the war?  I was wondering if many Germans blamed Kaiser Wilhelm II for getting them involved?",
        "created_utc": 1677349725,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much has war and genocide reduced the world's population?",
        "author": "FureyFists",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11brwvz/how_much_has_war_and_genocide_reduced_the_worlds/",
        "text": "Don't know if this is exactly the right place to ask, but what would the world population be if it weren't for war and genocides throughout history? Obviously, there is no exact number because it's not just the number of deaths tallied together as it has stopped the potential for families and there would be a compounding effect. This might be a question for r/theydidthemath but, just wondering if anyone had looked at this before, did a Google search and couldn't find anything, thanks.",
        "created_utc": 1677349653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why were the Soviets so opposed to genetics?",
        "author": "thetimujin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bruae/why_were_the_soviets_so_opposed_to_genetics/",
        "text": "",
        "created_utc": 1677349473,
        "upvote_ratio": 1.0
    },
    {
        "title": "How and why did tipping (in the sense of giving people money after they have provided a service) begin and evolve in American culture?",
        "author": "CowRepresentative166",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11brtb2/how_and_why_did_tipping_in_the_sense_of_giving/",
        "text": "",
        "created_utc": 1677349405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there ever incidents during the Conquest of South America where Native Americans were able to successfully resist Hispanicization (or reverse its effects) and then re-establish their own independent indigenous societies and cultures, at least for relatively long periods of time?",
        "author": "JohnnyAnarchist",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11brncn/were_there_ever_incidents_during_the_conquest_of/",
        "text": "We know about the Pueblo revolt in the American Southeast. The Pueblo revolted against Spanish rule and re-established their own native rule. However I'm not sure if this reversed the effects of Hispanicization. They were eventually reconquered by the Spaniards. Did anything similar occur in South America? And were they able to reverse and even eliminate the process of Hispanicization?\n\nSecond question:\n\nAre there any groups of Native Americans (or Mesoamerican Indians) that have survived the Conquest largely untouched by Hispanic influence because of their resistance to Hispanicization?",
        "created_utc": 1677348988,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did medieval bakers acquire ale barm?",
        "author": "TerrytheMerry",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11br2j9/how_did_medieval_bakers_acquire_ale_barm/",
        "text": "When looking into historical recipes I consistently find that the most common practice for bread baking used the yeast that formed from fermenting ale, but not much about where they actually got the barm from. Would bakers ferment their own ale just for the yeast? Were they buying it off of brewers? Could it be stored for any length of time or did they have to get it fresh each time they baked?",
        "created_utc": 1677347563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has there ever been a peaceful revo-lution , if so how did that occur and what was the outcome?",
        "author": "Tickle_My_Elmo_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bqumx/has_there_ever_been_a_peaceful_revolution_if_so/",
        "text": "I've posted this over at ask historians awhile back, but no replies.\n\nSome clarification on the title-\n\nI understand reform takes time. I'll use the civil rights movement as an example. \n\nNow, I'm not entirely sure how the timeline went, but from what I was taught/ remember from school there were marches, sit ins , rallies, etc. These were peaceful and non violent from the protestors, as far as I know/remember. I do recall violence being inflicted on the protestors by police/government/non supportive citizens.\n\nI am aware of the Black Panthers  doing kind of community watches while legally armed. From what was taught they would stand guard while protestors or community members were being arrested and ensure noone overstepped legality/ use of force and the arrest was valid. Yet I did not hear of them becoming actually violent/ aggressors / vigilanty justice.\n\nFeel free to correct any of the above, and actually I don't know how it ended, how/when the sentiment turned? Was it or would you say the civil rights movement was achieved peacefully? (on the part of the activists?)\n\nAre their any examples through out history ( not just the U. S), were significant reform/ policies were achieved by strictly peaceful means.\n\nThanks! !",
        "created_utc": 1677347021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there people during WWII who denied that the war was even happening?",
        "author": "gary_oldman_sachs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bqtrt/were_there_people_during_wwii_who_denied_that_the/",
        "text": "Recently, there's a lot of people on Twitter who are questioning even the existence of the war in Ukraine, and who allege that a supposed lack of footage indicates that the war is being faked as part of some elaborate scam.\n\nGiven the strong isolationist feelings in interwar America, I was wondering if any analogous phenomenon existed at that time, or if this form of denial is unique to the age of social media. Were there Americans so opposed to involving themselves in the war that they denied even its existence? Did any ask for proof of Pearl Harbor, for instance?",
        "created_utc": 1677346961,
        "upvote_ratio": 1.0
    },
    {
        "title": "How well off if at all were the English Renaissance playwrights? Were they considered more like crafstmen doing their job or did they sometimes ascend to the celebrity level?",
        "author": "Horridhorsey",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bqtk5/how_well_off_if_at_all_were_the_english/",
        "text": "",
        "created_utc": 1677346946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have any priceless art pieces been irreparably destroyed?",
        "author": "bageltoastar",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bqr95/have_any_priceless_art_pieces_been_irreparably/",
        "text": "I was thinking about that event that happened recently where a group of activists threw tomato soup at an irreplaceable Van Gogh painting (https://www.cnbc.com/amp/2022/10/14/oil-protesters-arrested-after-throwing-tomato-soup-at-van-gogh-painting.html). Luckily, the piece was covered by a glass casing, so it wasn’t damaged in the protest. But this event got me wondering if there has ever been an invaluable piece of art that has been unintentionally, or intentionally, destroyed, and were there any consequences to the perpetrator who destroyed it?",
        "created_utc": 1677346796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considering that war is back in Europe, what is the longest time that Europe has gone without war since records began?",
        "author": "Easy_Newt2692",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bqput/considering_that_war_is_back_in_europe_what_is/",
        "text": "",
        "created_utc": 1677346699,
        "upvote_ratio": 1.0
    },
    {
        "title": "When was the last time in history that someone could have read the whole Epic Cycle, of which the Iliad and Odyssey were two parts?",
        "author": "That-Soup3492",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bqcex/when_was_the_last_time_in_history_that_someone/",
        "text": "I know the other 6 sections are lost today but we have summaries and commentaries right? Can we say around when those sections were lost to readers?",
        "created_utc": 1677345821,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've often seen the claim that the \"best man\" in many western marriages was originally chosen for his fighting prowess, in case the couple needed defending or even if the bride attempted escape. Is there any merit to this claim?",
        "author": "godminnette2",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bq5ak/ive_often_seen_the_claim_that_the_best_man_in/",
        "text": "",
        "created_utc": 1677345355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Hutus really refer to the Tutsi as \"tall trees\" in a derogatory sense, like cockroach, or was it initially only used as a code word during the Rwandan genocide?",
        "author": "CharitySpecialist514",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bq2el/did_the_hutus_really_refer_to_the_tutsi_as_tall/",
        "text": "",
        "created_utc": 1677345161,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Nazi germany not go bankrupt?",
        "author": "Cpt_dogger",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bptyb/how_did_nazi_germany_not_go_bankrupt/",
        "text": "From 1939-1945 how did they manage to not go bankrupt while paying for war and being cut off from world market?",
        "created_utc": 1677344569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have information about the Confederate Army in the American Civil War trying to recruit 20 regiments of pikemen?",
        "author": "Storkiest",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bpsdj/does_anyone_have_information_about_the/",
        "text": "I was reading the wikipedia article about [Pike and Shot](https://en.wikipedia.org/wiki/Pike_and_shot) and the final paragraph talks about the Confederate army trying to revive the pike : \n\n\"One attempt to resurrect the pike as a primary infantry weapon occurred during the [American Civil War](https://en.wikipedia.org/wiki/American_Civil_War) when the [Confederate States of America](https://en.wikipedia.org/wiki/Confederate_States_of_America)\\[[*citation needed*](https://en.wikipedia.org/wiki/Wikipedia:Citation_needed)\\]  planned to recruit twenty regiments of pikemen in 1862. In April 1862  it was authorized that every Confederate infantry regiment would include  two companies of pikemen, a plan supported by [Robert E. Lee](https://en.wikipedia.org/wiki/Robert_E._Lee). Many pikes were produced but were never used in battle and the plan to include pikemen in the army was abandoned.\" (from wikipedia)\n\nThe only source is \\[citation needed\\] but the whole thing seemed interesting. Was this a real thing? What were they thinking? Has anyone heard of this? Is this people lying on the internet? Does anyone know what they would have planned to do with pikemen in every infantry regiment in the 1860s? Anyone want to share fun information about pikemen or pike and shot?\n\nIt's just such a wild thing to see tossed into an article at the end with no citations.",
        "created_utc": 1677344474,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a resident of Elba in early 1814, a place that at the time was not too different from any other small Mediterranean island. How is my life going to change in a few months when Napoleon gets exiled from France and becomes the emperor of my tiny island?",
        "author": "FriddyNanz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bpp5q/im_a_resident_of_elba_in_early_1814_a_place_that/",
        "text": "",
        "created_utc": 1677344259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently Discovered Footage of the Normandy Invasion. When was the footage taken?",
        "author": "jedirayn",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bpegg/recently_discovered_footage_of_the_normandy/",
        "text": "This 16mm [film](https://www.youtube.com/watch?v=haaw0_MlyVM&amp;t=9s) was purchased at an estate sale back in 2017 and professionally digitized in 2023.  As far as I can tell, this is unseen footage.  The film appears to show the aftermath of the initial invasion of Normandy.  From the uniforms and the surrounding areas, it is assumed these are Canadian forces on Juno Beach and in the village of Bernières-sur-Mer. But, I am not a historian and would like professional input on this matter.",
        "created_utc": 1677343503,
        "upvote_ratio": 1.0
    },
    {
        "title": "What great pieces of knowledge were lost to the burning of the Library of Alexandria?",
        "author": "FlintandSteal1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11boz3z/what_great_pieces_of_knowledge_were_lost_to_the/",
        "text": "It has been said that texts detailing ancient works of engineering and mathematics have been lost to this disaster, but what other great pieces of knowledge no longer exist? Are we discovering or rediscovering knowledge today that was already known to scholars at the time the library was burned?",
        "created_utc": 1677342447,
        "upvote_ratio": 1.0
    },
    {
        "title": "A clock finds its home",
        "author": "bluehonda99",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11boxfu/a_clock_finds_its_home/",
        "text": "[removed]",
        "created_utc": 1677342327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend reading material about the tactics and strategy of major historical socio-political movements like the suffragettes or civil rights movement?",
        "author": "Gradstudentcons",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bowap/can_you_recommend_reading_material_about_the/",
        "text": "For some context, I am a social scientist working on collective climate activism. I am interested in comparing the success of movements that have focused on winning public approval/disrupting the public for attention/disrupting structures of power. Would love to read some academic books or papers that discuss a) tactics/strategy, and b) public reactions.",
        "created_utc": 1677342248,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Lushan, famous rebel against the Tang Empire, was an ethnic Sogdian. Sogdia at the time was an eclectic mix of religions including Nestorianism, Manichaeism and Iranian polytheism. Do we know anything about An Lushan's religious beliefs?",
        "author": "megami-hime",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bouj7/an_lushan_famous_rebel_against_the_tang_empire/",
        "text": "",
        "created_utc": 1677342119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Louis \"the Pious\" Louis I instead of Louis V and Clovis I not Louis I?",
        "author": "HylianGames",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11boeao/why_is_louis_the_pious_louis_i_instead_of_louis_v/",
        "text": "I already asked a question similar to this with the numbering of Edwards in England. But I've also noticed incorrect numbering with French monarchs. If Clovis is Louis in another language then shouldn't Louis the Pious be Louis V?",
        "created_utc": 1677340934,
        "upvote_ratio": 1.0
    },
    {
        "title": "We The People Of the World",
        "author": "M4CP2L",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bny1w/we_the_people_of_the_world/",
        "text": "[removed]",
        "created_utc": 1677339782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who were the architects that designed Victorian working-class housing? What were the common styles of urban architecture?",
        "author": "ck_296",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bnvc4/who_were_the_architects_that_designed_victorian/",
        "text": "I'm trying to research urban architecture in London during the 1880s for a creative project and I'm looking for information on low-income and working-class housing. Though there is a LOT of documentation on the more artistic styles of the era, which I'm finding plenty of, I'm coming up short with resources on the most common and practical forms of architecture. Though I love the classic architectural styles, the examples have been limited to upper-class housing and public works, which doesn't reflect the largest demographic of London. I'm specifically looking for notes, diagrams and illustrations published pre-1900s detailing layout and style as reference, ideally written by architects. What were the common styles, function and forms of the houses of the era? What were common design choices and elements?  Any and all sources would be appreciated!  \n\n\nThis is my first post in this sub. I'm very excited to get to learn more - I'm just now starting a research journey focusing on the common aesthetics and symbols of London architecture and design in the home during the 1880s. So far it's a very fun topic. If there's anyone who's focus is on this I'd love to chat and ask questions.",
        "created_utc": 1677339588,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Tamil tigers lose?",
        "author": "Salty-Camp2698",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bnlu3/how_did_the_tamil_tigers_lose/",
        "text": "",
        "created_utc": 1677338912,
        "upvote_ratio": 1.0
    },
    {
        "title": "How effective (and other questions) was ranged fire in early medieval/medieval period?",
        "author": "LordTea_True",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bnhr4/how_effective_and_other_questions_was_ranged_fire/",
        "text": " \n\nGreetings,\n\nI  am working on a tabletop wargame with a high emphasis on historical  realism in terms of how the battles were fought and because of that i  want to create mechanics that will allow the player to use real  historical tactics to win.\n\nWith  that being said as a history enthusiast i lack the necessary knowledge  for early medieval/medieval military period (more of a pike and shot  XVII century guy here).  \nThe question that i have is how effective  were ranged weapons - more specifically - bows and crossbows at  inflicting casualties on the enemy army?  \n\\*Was shooting at a lane really that more efficient than shooting on a running disperesed mob?  \n\\*How good were shielded units against arrows and bolts?  \n\\*Did ranged unit often shot at infantry units that were engaged in melee combat? (risking shooting their own?)  \n\\*How often were ranged units (bows and crossbows) used in a foreseted area? And how effective were they?  \n\\*Were there different type of shooting? Like a long range volleys vs short range aimed shots?\n\nI would be very happy to get a comprehensive answer preferably with real historical examples if possible.  \nI found some other similar treads here but they never fully answered those question that i posted here.\n\nThank you",
        "created_utc": 1677338606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bow and Crossbow effectivness at inflicting casualties",
        "author": "LordTea_True",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11bnavz/bow_and_crossbow_effectivness_at_inflicting/",
        "text": "[removed]",
        "created_utc": 1677338112,
        "upvote_ratio": 1.0
    }
]