[
    {
        "title": "How was France able to wage war for so long during the French Revolutionary wars and Napoleonic wars? Did the populace not get weary of decades of fighting?",
        "author": "Kdog_123",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1145tpa/how_was_france_able_to_wage_war_for_so_long/",
        "text": "",
        "created_utc": 1676593682,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do historians differentiate between persons who would in modern day identify as transgender men, and women who lived as men to have access to opportunities that would otherwise be denied to them?",
        "author": "thatrlyoatsmymilk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1145nkw/how_do_historians_differentiate_between_persons/",
        "text": "I’m inspired to ask this question by reading about Dr. James Barry, who was born female but lived their adult life as a man and served as a surgeon in the British Army in the mid 1800s. Dr. Barry refused to let anyone in the room when they undressed and left orders that after their death their body should not be examined but buried as-is (which were disrespected, resulting in the discovery of their biological sex). Would this be interpreted as a historical manifestation of gender dysphoria, or of a woman fearing the loss of credibility if her secret was discovered? How does this conversation play out among historians?",
        "created_utc": 1676593212,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of ventilation did Tudor era warships have?",
        "author": "claptonisdog",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1145izh/what_kind_of_ventilation_did_tudor_era_warships/",
        "text": "I recently visited the Mary Rose in Portsmouth in the UK. \nIf you don’t know it, the Mary Rose was a warship that wrecked was later raised in 1982 after almost 500 years sitting at the bottom of Portsmouth Harbour. \nI saw a recreation of the galley where food was prepared for all aboard. \nOne thing struck me: how did they deal with the smoke from the birch wood they apparently used to heat the stove?\nThe galley was at the bottom of the ship and with all the steam and slop of cooking meaIs all day, I can’t imagine how someone could even breathe. \nThe reconstruction of the ship did not appear to include a chimney of any kind. I don’t see how it would be possible to have  a functional galley that way.",
        "created_utc": 1676592868,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the most ancient opera theatre in the world that is still working?",
        "author": "Ziopover",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1144pfm/what_is_the_most_ancient_opera_theatre_in_the/",
        "text": "",
        "created_utc": 1676590680,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common was Spartan desertion of Spartan Military Service and of the Spartan Agoge?",
        "author": "GraysonTheGreat45",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1144n63/how_common_was_spartan_desertion_of_spartan/",
        "text": "",
        "created_utc": 1676590509,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Hitler was as good of a leader but black.... what would have happened?",
        "author": "ronnie_mund72",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1144g3l/if_hitler_was_as_good_of_a_leader_but_black_what/",
        "text": "",
        "created_utc": 1676589980,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the most votes a US presidential candidate has ever gotten while being legally ineligible for office, and what was their platform?",
        "author": "peterpeteranimeeater",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1144f6t/whats_the_most_votes_a_us_presidential_candidate/",
        "text": "",
        "created_utc": 1676589913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ok, Orion's Scythe proved a disaster. I'll admit this, but it had some merit. How a bout a sword serrated in either direction. It can catch or release another sword at any moment, in any direction, by flipping the blade. Also serrated so ouch. Thoughts? What would you call it?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1676589878,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did travel by sailing ship, and by aircraft become safe enough that casual folks, not explorers, not military, would use it to travel overseas for casual reasons, sightseeing, education, or business and not consider it too risky? And how safe were they in terms of percentage of deaths?",
        "author": "DenebianSlimeMolds",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1144atf/when_did_travel_by_sailing_ship_and_by_aircraft/",
        "text": "At some point air travel became commonplace and apart from perhaps buying flight insurance, wasn't considered something for crazies or the military, but something you or I might do for business or even take our family on a trip by plane.\n\nWhen did that occur, and why?\n\nAnd the same thing for travel by sea: Ben Franklin in the 18th Century, Mark Twain in the 19th Century visit Europe, were those casual trips, or trip where a traveler had to seriously consider dying at sea?",
        "created_utc": 1676589599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the United States annex so much land if it just brought overpopulation problems and border feuds?",
        "author": "No-Relation-1440",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11440rv/why_did_the_united_states_annex_so_much_land_if/",
        "text": "It seems pointless for the United States to conquer and annex new territories. All it really does is bring problems involving border control and overpopulation. Military advantages would not make any sense because the United States is able to base in other countries without many problems. The New England region should be the United States. \n\nCountries like Germany and and Norway don't work too hard to annex new territory as much as the United States.\n\n I also think it would preserve the culture to an extent instead of having multiple cultures. You could argue the United States was originally made for freedom and diversity but that's a bit iffy and everyone should know why.",
        "created_utc": 1676588878,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some examples of Technology Suppression?",
        "author": "TheRealLvlupLennys",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1143zj2/what_are_some_examples_of_technology_suppression/",
        "text": "",
        "created_utc": 1676588790,
        "upvote_ratio": 1.0
    },
    {
        "title": "What percentage of Auschwitz prisoners who survived the selection process were eventually murdered by gassing?",
        "author": "6FeetBeneathTheMoon",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1143gk0/what_percentage_of_auschwitz_prisoners_who/",
        "text": "I know that about only 20% of Auschwitz arrivals survived the selection process and were put to work in the camp. I know most who survived the selection would eventually die as well, whether from disease, gassing, or murder otherwise. I would like to know what percentage, roughly, of those who survived the selection process would eventually die specifically from gassing?",
        "created_utc": 1676587458,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did relatives of historical levied soldiers learn their fates if they died?",
        "author": "Wolfieze",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1143etk/how_did_relatives_of_historical_levied_soldiers/",
        "text": "I know in medieval Europe and the wider Eurasian Ancient World, when there weren't professional soldiers available, there was conscription. Are there any accounts of relatives of these conscripted soldiers regarding the fate of their loved ones? There wasn't a concept of bringing home the body of a common soldier, and there were times when entire armies were annihilated. What effect did that sort of loss have on the common people in society?",
        "created_utc": 1676587334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was coffee ever mentioned in Ancent Roman Empire or the East Roman Empire?",
        "author": "Cyber_Mk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1143c2z/was_coffee_ever_mentioned_in_ancent_roman_empire/",
        "text": "I find it very hard to imagine that nobody wver tried it before 15th century. Humans are notorious for knowing which plants are edible which are deadly and which have mind altering effects",
        "created_utc": 1676587143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mictlantecuhtli and Mictecacihuatl were Mexica deities of death and underworld - was there any pre-Columbian holiday dedicated to them or to death/underworld in general, similiar to modern Dia de los Muertos?",
        "author": "Szarrukin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11433ox/mictlantecuhtli_and_mictecacihuatl_were_mexica/",
        "text": "",
        "created_utc": 1676586581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you please put this South African cinema advert into historical context?",
        "author": "Hot-Conclusion-6617",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1143163/would_you_please_put_this_south_african_cinema/",
        "text": "I was watching a cinema advert for the White Rabbit restrooms at Caltex petrol stations in South Africa (link [here](https://www.youtube.com/watch?v=VXYIpUmHhS4)). The advert makes it sound like an absolute oasis that has never happened before. I would think that this would have been an innovation decades earlier. Why not? \n\nI also learned that in the mid 1970s, only the wealthy South Africans could afford cars with air conditioning. Why wasn't this standard? \n\n(And to be fair, based on my own research, air conditioning in American cars didn't come into widespread use until the 1980s.)",
        "created_utc": 1676586397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there any empires or big kingdoms in Western Europe during the Bronze Age?",
        "author": "Derick_fruit",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1142wov/was_there_any_empires_or_big_kingdoms_in_western/",
        "text": "To my knowledge there was no major or large kingdoms in Western Europe, but west Europe was also a home to many major tin mines. So wouldn’t kingdoms in Europe make sense, especially considering some of the sea peoples were from west Europe.",
        "created_utc": 1676586079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robert C. Byrd is one the longest-serving U.S. senator in history, as well as the second-longest serving member of the United States Congress. His political career spanned more than sixty years. How signifigant is Byrd to American history? How has legacy shaped American politics?",
        "author": "Noahop5000",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1142oo3/robert_c_byrd_is_one_the_longestserving_us/",
        "text": "I was looking up the longest serving members of the U.S. congress out of curiosity and stumbled upon Byrd's name. Imagine my shock to find to find a figure who went from openly opposing Civil Rights and a member of the Klu Klux Klan, to being mourned by the NAACP upon his death.\n\nMore about Robert Byrd: he served as a member of the House of Representatives from 1953 to 1958. He was then elected as a senator of Virginia and served from 1959 until his death in 2010. That effectively means his tenure in congress started during the presidency of Dwight D. Eisenhower, and ended during the presidency of Barack Obama. That is an insane amount of time and history for one man to remain politically relevant for.\n\nYet despite that, i hardly see Byrd ever talked about in present day (except in a couple Joe Biden attack ads). What key policies did Byrd push and reject? How did he evolve throughout his 60 years of politics? How did his tenure shape America's political atmosphere as we see today?",
        "created_utc": 1676585506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the 248 BC Terracotta Army Based on Real Soliders / People, considering majority of them have different facial features?",
        "author": "boris0811",
        "url": "https://www.reddit.com/r/AskHistorians/comments/114215d/is_the_248_bc_terracotta_army_based_on_real/",
        "text": "",
        "created_utc": 1676583891,
        "upvote_ratio": 1.0
    },
    {
        "title": "8000 Terracotta Army",
        "author": "virgocatlady",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1141x4d/8000_terracotta_army/",
        "text": "[removed]",
        "created_utc": 1676583617,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common was it for Spartans to escape from the agoge or once they were in the army, to desert there post",
        "author": "GraysonTheGreat45",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1141vxf/how_common_was_it_for_spartans_to_escape_from_the/",
        "text": "",
        "created_utc": 1676583541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why were conventionally masculine values like wisdom and war assigned to Athena, or hunting to Artemis?",
        "author": "rougerogue-",
        "url": "https://www.reddit.com/r/AskHistorians/comments/114139h/why_were_conventionally_masculine_values_like/",
        "text": "Hey! I'm wondering why, in a society as patriarchal as Ancient Greece, traditionally masculine things wouldn't in the power of a god, and traditionally feminine things the power of goddesses",
        "created_utc": 1676581571,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the most violent time period in Ancient Egypt?",
        "author": "NorseMtnDew",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1140oux/what_was_the_most_violent_time_period_in_ancient/",
        "text": "",
        "created_utc": 1676580545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Russians, how has your life changed after a year of war with Ukraine?",
        "author": "Competitive_Dot_6807",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1140kaw/russians_how_has_your_life_changed_after_a_year/",
        "text": "",
        "created_utc": 1676580222,
        "upvote_ratio": 1.0
    },
    {
        "title": "British Military History - The Hackle",
        "author": "Lukadeduke",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1140f02/british_military_history_the_hackle/",
        "text": "[removed]",
        "created_utc": 1676579839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the advent of photography in the 19th century take job opportunities away from artists?",
        "author": "zelenadragon",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1140a80/did_the_advent_of_photography_in_the_19th_century/",
        "text": "To clarify, I am not asking about what artists' reactions were to the emergence of photography, I see that has already been asked and answered in this sub. What I'm interested in is if the market for painters was affected, like getting less portrait commissions, the public being less interested in painted landscapes/other scenes, etc. And were there changes to what a typical artist's profession and career looked like?",
        "created_utc": 1676579499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were people who lived under Socialist/Communist countries like the USSR or China allowed free time?",
        "author": "senescent-",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11409dw/were_people_who_lived_under_socialistcommunist/",
        "text": "",
        "created_utc": 1676579443,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the story about WWI breaking cryptographically coded Japanese?",
        "author": "furrypony2718",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113zyw4/what_is_the_story_about_wwi_breaking/",
        "text": "From Warren Weaver (1949), \"Translation memorandum\".\n\n&gt; During the war a distinguished mathematician whom we will call P, an ex-German who had spent some time at the University of Istanbul and had learned Turkish there, told W. W. the following story. \n\n&gt; A mathematical colleague, knowing that P had an amateur interest in cryptography, came to P one morning, stated that he had worked out a deciphering technique, and asked P to cook up some coded message on which he might try his scheme. P wrote out in Turkish a message containing about 100 words; simplified it by replacing the Turkish letters ç, ğ, ĭ, ö, ş, and ü by c, g, i, o, s, and u respectively; and then, using something more complicated than a simple substitution cipher, reduced the message to a column of five digit numbers. The next day (and the time required is significant) the colleague brought his result back, and remarked that they had apparently not had success. But the sequence of letters he reported, when properly broken up into words, and when mildly corrected (not enough correction being required really to bother anyone who knew the language well), turned out to be the original message in Turkish.\n\n&gt; The most important point, at least for present purposes, is that the decoding was done by someone who did not know Turkish, and did not know that the message was in Turkish. One remembers, by contrast, **the well-known instance in World War I when it took our cryptographic forces weeks or months to determine that a captured message was coded from Japanese; and then took them a relatively short time to decipher it, once they knew what the language was.**",
        "created_utc": 1676578677,
        "upvote_ratio": 1.0
    },
    {
        "title": "What led to the extinction of megafauna, specifically within the context of “The Great Leap”?",
        "author": "unclegovernment",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113zx1v/what_led_to_the_extinction_of_megafauna/",
        "text": "Hi! Working on a paper for my ancient civilizations class and I am struggling with this question specifically. I have found conflicting information on whether this extinction resulted from human overhunting or climate change, and am not sure where to go from here. If anyone has suggestions or resources to work off of it would be greatly appreciated!!! Thanks :-)",
        "created_utc": 1676578546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any “Sports Almanac” to historical jousting tournaments? With detail on when and where throughout Europe.",
        "author": "Teris_Thesis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113zs6d/is_there_any_sports_almanac_to_historical/",
        "text": "",
        "created_utc": 1676578191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Qajars approach or influence the Great Game?",
        "author": "mayfairdrive",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113zn5f/how_did_the_qajars_approach_or_influence_the/",
        "text": "A lot of focus is placed on the Russia / Britain in the Great Game, as well as additional players like the Central Asian Khanates (Khiva/Bukhara) and Afghanistan, but how did the Qajar Dynasty fit into the strategic calculus of Russia / Britain in the Great Game and how did the Qajars approach Anglo-Russian competition in Central Asia? \n\nFrom an elementary understanding, the Russians backed the Qajars in Herat; however, much of Russia's gains in Central Asia seem to have been at Qajar expense (surrendering a Persian-dominated Central Asia to Russian domination).",
        "created_utc": 1676577826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any book recommendations about the history of the Silk Road?",
        "author": "No-Landscape9867",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113zf45/any_book_recommendations_about_the_history_of_the/",
        "text": "",
        "created_utc": 1676577258,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the socioeconomic consequences of the Black Death on hard-hit areas outside of Europe?",
        "author": "heyaheyothrowaway",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113z6f1/what_were_the_socioeconomic_consequences_of_the/",
        "text": "The Black Death had a sharp impact on the demographics of both European and non-European (i.e. Western Asia and North Africa) areas. I'm aware of how this affected the European economy, but what about other places?",
        "created_utc": 1676576624,
        "upvote_ratio": 1.0
    },
    {
        "title": "GC or PhD",
        "author": "shopkoofficial",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113yx8a/gc_or_phd/",
        "text": "[removed]",
        "created_utc": 1676575963,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the relationship between the free love movement and the civil rights movement?",
        "author": "youwannasavetheworld",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113yk70/what_was_the_relationship_between_the_free_love/",
        "text": "1960s USA",
        "created_utc": 1676575034,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Maria Theresa survive the War of the Austria Succession?",
        "author": "Royal-Run4641",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113xo3s/how_did_maria_theresa_survive_the_war_of_the/",
        "text": "\nFredrick the Great of Prussia is pretty well known and how Prussia miraculously survived the Seven Years War against pretty bad odds. However his main antagonist Maria Theresa of Austria to me doesn't get a lot of attention or credit for her equally miraculous achievement of surviving the War of Austrian Succession. On paper it appears she faced huge amount of enemies who were wanting to dismember the Hapsburg dominions and yet she managed to survive and come back to almost destroy Prussia and I was wondering how.",
        "created_utc": 1676572798,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Muslim world saw a rise of “quranists” in the 20th century who rejected Hadith. They faced great persecution and even death. How did the practices of these people differ from ordinary Muslims, and why were they so controversial?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113xf7h/the_muslim_world_saw_a_rise_of_quranists_in_the/",
        "text": "I have been reading many Muslims reject Hadith and instead follow the Quran alone. Many rules (e.g. the proper mode of prayer) are only in Hadith so that Quranists would act very different from ordinary Muslims. \n\nAnyway I am curious how these people were seen, and how they saw themselves :) thank you!",
        "created_utc": 1676572169,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much room was there in Medieval states for criticism of the policy choices of the king or their advisors?",
        "author": "Awesomeuser90",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113x7a1/how_much_room_was_there_in_medieval_states_for/",
        "text": "I´m going to be focusing on the most well known period from something like 1200 to 1500, and Scandinavia, the Eastern Roman Empire, France, the Holy Roman Empire, the Italian city states that were also monarchical like the Duchy of Florence, the Papal States, the Kingdom of the Two Sicilies, and the British Islands for this question. \n\nMaybe also not necessarily criticism of the king in particular but blaming their advisors in the mantra of the king can do no wrong, and the idea of opposing the chancellor and where that trope comes from. \n\nKings did get epithets before, like Aethelraed the Unready and how Unraed meant poorly counseled. Someone must have made commentary about the wisdom of policy choices and who they chose for rulers.",
        "created_utc": 1676571593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were tunics and armor considered casual in medieval times?",
        "author": "Royourboy2222",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113wvfv/were_tunics_and_armor_considered_casual_in/",
        "text": "Pretty much what the title is.  I’d also like to know how those perceptions changed over time, and how we look at that today.",
        "created_utc": 1676570711,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for a good book on De Soto's expedition of the Southeast, preferably something more modern that doesn't embellish the story; but as long as it's a faithful account, I won't fuss about an older book. What would be the highest recommendations for something like that?",
        "author": "DreadLord64",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113wm6m/im_looking_for_a_good_book_on_de_sotos_expedition/",
        "text": "Did some searching on this sub already, but I didn't find an answer to this question.\n\nI'm looking to learn more about what the Southeast was like before European colonization. If anyone has any recommendations, I'd appreciate it! Thanks :)",
        "created_utc": 1676570072,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happened to the Belgium Congo in ww2?",
        "author": "Sir_comerade",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113w98m/what_happened_to_the_belgium_congo_in_ww2/",
        "text": "I’m curious in ww2 as the nazis occupied mainland Belgium what happened to their colony? Did it function as Belgium or indipendent?",
        "created_utc": 1676569133,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Happened To The Belgium Congo In ww2",
        "author": "Sir_comerade",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113w76f/what_happened_to_the_belgium_congo_in_ww2/",
        "text": "[removed]",
        "created_utc": 1676568984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is \"Death\" in So Many Historical Artworks Holding Agricultural Equipment?",
        "author": "SaddestPandaButt",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113w6rw/why_is_death_in_so_many_historical_artworks/",
        "text": "In art throughout the centuries, the grim reaper (or skeleton representing death, etc) is holding a scythe.  Why is this?  \n\nIs it simply because of the obvious cycle of life and death of plants throughout the year?  \n\nIs it to show death \"harvesting\" people the way a scythe cuts grasses?  \n\nWhy is the devil so often holding a pitchfork?  \n\nWhat is the relationship between agricultural implements and death omens or representations?  (Asking as a farmer lol)",
        "created_utc": 1676568955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why a communist revolution didn’t happen in France?",
        "author": "quadra15",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113vzw2/why_a_communist_revolution_didnt_happen_in_france/",
        "text": "",
        "created_utc": 1676568488,
        "upvote_ratio": 1.0
    },
    {
        "title": "After Stalin assassinated Sergei Kirov, it is said his wife was suddenly \"committed to an insane asylum\". Do we know what happened to her? What would an \"asylum\" look like in the Soviet Union at that time?",
        "author": "TheDigitalCowboy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113vzc6/after_stalin_assassinated_sergei_kirov_it_is_said/",
        "text": "",
        "created_utc": 1676568447,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did contemporary Romans consider the Republic to be over?",
        "author": "recursion_inversion",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113vspw/when_did_contemporary_romans_consider_the/",
        "text": "Ok so this is a bit complicated - most historians consider the end of the Republic to be around 27bc when Octavian was given the title of Augustus. Thing is, Rome still had a senate and some pretense of still being a republic when it really wasn't any more.\n\nWhen did Rome officially stop being a republic and become an empire as according to the Romans themselves, not historians? Did they always maintain the pretense of being a republic, even during the reigns of emperors?",
        "created_utc": 1676567980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decommissioned Ships",
        "author": "Solid-Promotion-4866",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113vjye/decommissioned_ships/",
        "text": "[removed]",
        "created_utc": 1676567361,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the terms used to describe men's hairstyles in 18th France/England?",
        "author": "bumblebeebats0838",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113v3zx/what_were_the_terms_used_to_describe_mens/",
        "text": "Hi there - I'm writing a book set in 1780s Paris and am wondering what were the contemporary terms used to describe men's hairstyles/if anyone knows any good sources on men's hairstyles in this period in general. \n\nIn particular, I was trying to find out what the ponytail-esque part of a man's hair/wig was called; I've heard it referred to as a queue/cue before, but now that I'm actually looking into it I'm encountering conflicting answers as to whether that term exclusively applies to the Manchurian/Qing Dynasty hairstyle.\n\n(I mention England as well as I'm writing the book in English - and if I refer to a character's shoes as \"shoes\" and not \"chaussures\", then I imagine it would be reasonable to use the contemporary English terms for hairstyles in many cases as well.)",
        "created_utc": 1676566219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was mental illness know about/discussed in ancient China?",
        "author": "the_world-is_ending-",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113uuok/was_mental_illness_know_aboutdiscussed_in_ancient/",
        "text": "I'm most curious about the Warring States era or the Han Dynasty, but are there texts or references to mental illnesses in those times? Things like ptsd, depression, schizophrenia, bi-polar, etc. If so, how did they deal with it? Were there treatments?",
        "created_utc": 1676565545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book - either a journal, autobiography, or personal reflections - from a Hanseatic League merchant.",
        "author": "TheCamelHerder",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113uozx/looking_for_a_book_either_a_journal_autobiography/",
        "text": "",
        "created_utc": 1676565152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were hijabs or other head coverings not common during 16th century Ottoman Empire?",
        "author": "Alephim",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113unus/were_hijabs_or_other_head_coverings_not_common/",
        "text": "I’ve just started watching Magnificent Century which is set during the reign of Suleiman I and the women portrayed in the show are without any sort of head covering. I was wondering if it was common for women during the medieval Ottoman Empire to not have any kind of head coverings. Is it a cultural thing?",
        "created_utc": 1676565072,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found historical letters. What should I do with them?",
        "author": "Intelligent-Spare468",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ulh5/i_found_historical_letters_what_should_i_do_with/",
        "text": "Cleaning out an old shed, I found an amazing trove of handwritten letters sent between a married couple. The love story is charming, the daily news is evocative and detailed, and they are also caught up in important historic events. A quick web search of names turns up info and photos about these individuals at a National Monument.\n\nWhat should I do with these letters? I contacted the most relevant museum and they would trace the descendants and return them to the family. I kind of wish the letters could be made public instead, but don't know how. What would a historian do?",
        "created_utc": 1676564908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a document",
        "author": "akinsgre",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ui1i/trying_to_find_a_document/",
        "text": "[removed]",
        "created_utc": 1676564660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Telecon",
        "author": "akinsgre",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113uh8g/looking_for_telecon/",
        "text": "[removed]",
        "created_utc": 1676564602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding a Telecon",
        "author": "akinsgre",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ufwl/help_finding_a_telecon/",
        "text": "[removed]",
        "created_utc": 1676564506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding a Telecon",
        "author": "akinsgre",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ufb2/help_finding_a_telecon/",
        "text": "[removed]",
        "created_utc": 1676564465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there any mass psychological phenomena observed in Jews post-Holocost?",
        "author": "faruqharson",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113udrg/was_there_any_mass_psychological_phenomena/",
        "text": "",
        "created_utc": 1676564360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have some exemples of letters from your subject of specialization that can give us some interesting informations about the period when it was written ?",
        "author": "N-formyl-methionine",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113u7l3/do_you_have_some_exemples_of_letters_from_your/",
        "text": "I was reading an answer Wich figured the Paston family and another with a father advising his son to drink boiled water. Learning some part of history through letters is an interesting point of view. Official letters can taught us about the common \"name dropping\" false politeness. And letters between families member of friends are interesting as well to see what was the affection, interest and worries they had about each other. Do you have one that can be interesting to read?",
        "created_utc": 1676563908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jewish minorities have lived in China and India for thousands of years. Historically did they face any anti-Semitism like the Jewish people living in Europe did?",
        "author": "Tatem1961",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113tnkx/jewish_minorities_have_lived_in_china_and_india/",
        "text": "",
        "created_utc": 1676562482,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did ancient Israelites (biblical times) believe procreation worked?",
        "author": "thedirtyminister",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113tftv/how_did_ancient_israelites_biblical_times_believe/",
        "text": "I'm reading a book, Sex at Dawn, that discusses how belief systems around procreation shapes sexual ethics of a culture. For example, it talks about one culture that believed a baby was grown in the womb by multiple ejaculations. So their sexual ethics took life by women having sex with the smartest, most athletic, funniest, etc. men around the village in order to grow their baby with all these redeeming qualities.\n\nSo, I also love learning and discussing Christian theology and am curious if ancient Israelites or the surrounding culture held a popular misunderstanding of how procreation worked that influenced their sexual ethics.\n\nDoes anyone know? I never heard this topic discussed in Christian circles. Thanks for any knowledge.",
        "created_utc": 1676561920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did american Gun-truckers use captured Vietcong weapons for their gun-trucks?",
        "author": "Ok-Magician9585",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113sm8q/did_american_guntruckers_use_captured_vietcong/",
        "text": "To my knowledge, Gun-truck crews were for a while, desperate for any sort of extra firepower for their trucks. So i was wondering if they ever used weapons they took from the Vietcong to supplement their own firepower.",
        "created_utc": 1676559726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite histories and why? (genre/field/theme)",
        "author": "kingzheng",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113sj1j/favorite_histories_and_why_genrefieldtheme/",
        "text": "for example:\n\n&amp;#x200B;\n\n1. Oil/energy/economy/basic goods histories - they read like conspiracy theories but its real stuff\n2. Political biographies - at best they feel like novels and are really interesting as cultural and power histories\n3. Early modern geopolitics - like game of thrones but its really important for understanding present day politics.\n4. Caribbean/Central America histories - prototypical experience of modernity 16th century on\n5. Central Asia history - the Caribbean of the Old World",
        "created_utc": 1676559508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey guys, I’m curious of how Hamilton would be as president would he been successful in his presidency or bring us into war with France?",
        "author": "ejjejequ",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113saj3/hey_guys_im_curious_of_how_hamilton_would_be_as/",
        "text": "",
        "created_utc": 1676558843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the indigenous peoples of the Americas cause the extinction of any species?",
        "author": "GuythrushBreepwood",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113s1r9/did_the_indigenous_peoples_of_the_americas_cause/",
        "text": "I have read a lot of the impact of western settlers to the Americas, from the 1600s onwards, causing the extinction or decimation of species such as the bison, passenger pigeon, wolves, prarie dogs a d grizzlies. ButI was wondering if there is any evidence that indigenous peoples also had a significant negative impact on flora and fauna.",
        "created_utc": 1676558173,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the Eastern bloc during the 60s, where would dissidents (writers and everyday people alike) meet to discuss politics and exchange ideas? I just learned people were passing samizdat around, but would they also hold some meetings somewhere like bars or someone's houses?",
        "author": "hidetoambiguous",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113rwmf/in_the_eastern_bloc_during_the_60s_where_would/",
        "text": "If you all can recommend some readings/films for the lives of ordinary folks that time in that area, it'd hugely be appreciated. Thank you very much.",
        "created_utc": 1676557788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to understand the Historical Context for a passage in “Story of the Stone”",
        "author": "Medicine_Seller",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113rf34/trying_to_understand_the_historical_context_for_a/",
        "text": "[removed]",
        "created_utc": 1676556407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thursday Reading &amp; Recommendations | February 16, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113r9td/thursday_reading_recommendations_february_16_2023/",
        "text": "[Previous weeks!](https://www.reddit.com/r/AskHistorians/search?q=Thursday+Reading+%26+Research&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nThursday Reading and Recommendations is intended as bookish free-for-all, for the discussion and recommendation of all books historical, or tangentially so. Suggested topics include, but are by no means limited to:\n\n* Asking for book recommendations on specific topics or periods of history\n* Newly published books and articles you're dying to read\n* Recent book releases, old book reviews, reading recommendations, or just talking about what you're reading now\n* Historiographical discussions, debates, and disputes\n* ...And so on!\n\nRegular participants in the Thursday threads should just keep doing what they've been doing; newcomers should take notice that this thread is meant for open discussion of history and books, not just anything you like -- we'll have a thread on Friday for that, as usual.",
        "created_utc": 1676556014,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if below age of consent for marriage?",
        "author": "ls48029",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113r8yb/what_if_below_age_of_consent_for_marriage/",
        "text": "Asked the question of age of consent for females in Victorian England in another sub but no response on the following, can anyone help? Understand in England age to marry without parental consent was 21.\n\nIn case relevant, looking specifically at a marriage in 1873 in a C of E wedding with the following queries:\n\n1. If female was under 21 and required parental consent, what form did that normally take?\n2. If parental consent could not be obtained because the girl lived far away from parents, would CofE minister still marry the couple?\n3. Same questions for ifparental consent could not be obtained because girl’s parents dead.\n\nThank you!",
        "created_utc": 1676555948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there a spike in the number of drivers on the road once the automatic transmission became popular? What did people who struggled with manual transmissions do beforehand?",
        "author": "Chengweiyingji",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113r8f9/was_there_a_spike_in_the_number_of_drivers_on_the/",
        "text": "",
        "created_utc": 1676555904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can find a high resolution image of Sika Dwa Kofi - the Golden Stool of the Ashanti, Ghana?",
        "author": "i-c-e-cold87",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113r6re/does_anyone_know_where_i_can_find_a_high/",
        "text": "",
        "created_utc": 1676555770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the word \"Gargantuan\" stick around instead of any other giant from literature?",
        "author": "Logan_Maddox",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113r0r5/why_did_the_word_gargantuan_stick_around_instead/",
        "text": "\"Gargantuan\" comes from Gargantua and Pantagruel, but it's kinda weird that it hadn't happened before. Galehaut is a famous giant in the Arthurian mythos, and Chivalric literature was really popular, so why no Galehautian? What made Gargantua special?",
        "created_utc": 1676555281,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did they keep the Great Heathen Army from disintegrating? How did it keep rampaging for around 10 years?",
        "author": "Logan_Maddox",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113quij/how_did_they_keep_the_great_heathen_army_from/",
        "text": "Sometimes there is mention of the men \"taking winter quarters\" in London or this or that place. What prevented this army from just disintegrating after losing a big battle like Ashdown? Or slowly withering away through desertion and men breaking off to do their own thing?",
        "created_utc": 1676554765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend any books about the expansion of Islam beyond the Middle East?",
        "author": "ottolouis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113qpgb/can_you_recommend_any_books_about_the_expansion/",
        "text": "There are many books on the early Arab conquests that spread Islam across the Arabian peninsula, Levant and North Africa. I was wondering if there are any good books about the expansion of Islam into Turkey, Central Asia, India, Indonesia and Africa.",
        "created_utc": 1676554347,
        "upvote_ratio": 1.0
    },
    {
        "title": "My city's Saftey Director is under fire for claims that Irish Americans flooded safety forces in an effort to combat anti-Irish sentiment. Is there any truth to this?",
        "author": "derf82",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113qcwu/my_citys_saftey_director_is_under_fire_for_claims/",
        "text": "There has been quite a bit of controversy regarding some remarks our city's Safety Director, who is in charge of police, fire, and EMS services, made at a panel on policing and racial discrimination. He tried to make a historical point that struck some as a racist claim. \n\nHe said “In this country, the Irish at one time were not considered white, the Irish flooded police departments, the Irish flooded fire departments, the Irish flooded safety forces to the point where we wear bagpipes and kilts and all this green when we celebrate it. The Irish flooded safety forces, to the point that where we have bagpipes and kilts and all this green when we celebrate it.”  \n\nIn a later statement, he clarified his remarks stating \"I attempted to use a historical point to illustrate how a group of people created a culture of change by becoming part of the institution they sought to reform. These comments were intended to convey sincere admiration for the Irish Clevelanders who shaped our city by being the change they wanted to see—a point that I failed to fully articulate.\"  \n\nSo, was there a concerted effort by Irish Americans to join safety forces in an effort to combat anti-Irish sentiment?  Or were there other causes that led the Irish to disproportionately fill police and fire ranks in the 19th century?",
        "created_utc": 1676553282,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did going to the bathroom become a private activity?",
        "author": "butler182",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113q476/when_did_going_to_the_bathroom_become_a_private/",
        "text": "I feel like I’ve seen lots of paintings or renditions of like old Roman bathhouses and stuff where all the ‘toilets’ are just holes in a board lined up next to each other upon which a person would sit, not private cubicles like we have today, and people would just sit next to each other and poo freely.\n\nI know not all cultures are obsessively private about it, maybe it’s more of a western thing, I’m not sure.\n\nWhen/where did the idea of going to the bathroom in complete privacy come from? And why is it something we now feel so uncomfortable doing in public?",
        "created_utc": 1676552549,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the Chinese concept of “civilized”? Did it differ between dynasties?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113p9sj/what_was_the_chinese_concept_of_civilized_did_it/",
        "text": "I ask this because I know a lot about what Europeans thought of civilization but I know the concept of barbarians and savages existed in China as well, so what was their concept of civilization?",
        "created_utc": 1676549851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the CIA not stop Castro like it did in other countries?",
        "author": "kayak0055",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ov0z/why_did_the_cia_not_stop_castro_like_it_did_in/",
        "text": "I keep learning about the covert anti-communist operations that the CIA executed in Latin America in the mid-20th century (Guatemala, Chile, etc). Why did it not launch a similar op in Cuba? Or did it and why did it fail?",
        "created_utc": 1676548459,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the early spanish tercios where were the swordsmen deployed?",
        "author": "GoblinScribe7",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113olw8/in_the_early_spanish_tercios_where_were_the/",
        "text": "I could only find images of the formation from after they became obsolete",
        "created_utc": 1676547546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Xiang Yu was the archnemesis of the founder of the Han Dynasty. In spite of this, he is usually depicted by later writers as a tragic hero. How did China's seminal dynasty's greatest obstacle get such a good reputation?",
        "author": "MaxAugust",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113nkt6/xiang_yu_was_the_archnemesis_of_the_founder_of/",
        "text": "",
        "created_utc": 1676543562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are some British medals stars when most are circular?",
        "author": "unfortunateechidna",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113m5tr/why_are_some_british_medals_stars_when_most_are/",
        "text": "I initially thought it was whether there was a King or Queen at the time, but after a little research, this does not seem to be the case.",
        "created_utc": 1676537732,
        "upvote_ratio": 1.0
    },
    {
        "title": "killings under Islam.",
        "author": "Carza99",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113l9q8/killings_under_islam/",
        "text": "[removed]",
        "created_utc": 1676534060,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the \"kandil simits\" originate and why are there 2 types of it?",
        "author": "faruqharson",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113l6er/how_did_the_kandil_simits_originate_and_why_are/",
        "text": "",
        "created_utc": 1676533678,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the UK plan after WW1 to maintain control of its colonies?",
        "author": "Ducky181",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113jhhh/what_was_the_uk_plan_after_ww1_to_maintain/",
        "text": "Did the United kingdom had some plan, or initiative in order to maintain control of its colonies in order to prevent the decline of its empire after the First World War.\n\nWhile I heard unproven suggestions of a more integrated EU style union in its commonwealth states.  I am wondering if any of this was true .",
        "created_utc": 1676527191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did it take so long for New Mexico to be admitted as a US state?",
        "author": "c4hokian",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113iuki/why_did_it_take_so_long_for_new_mexico_to_be/",
        "text": "It had the most substantial population of any of the annexed territories after the Mexican-American War, but it took until 1912 for it to be admitted as a state.",
        "created_utc": 1676524895,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instances of social-engineering to dictate/encourage the heteronormativity of living spaces throughout history",
        "author": "LearningAgent",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113iua9/instances_of_socialengineering_to/",
        "text": "[removed]",
        "created_utc": 1676524867,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the importance of cattle ranching in Spanish Florida particularly La Chua?",
        "author": "LizardQueen1993",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113irlx/what_was_the_importance_of_cattle_ranching_in/",
        "text": "I am doing research for my term paper on a relatively underrepresented topic in history. I was wondering a professional opinion on the importance of cattle ranching in Spanish Florida in particular the hacienda La Chua. This played an important role in the rebellion which is why I would like to hear a variety of perspectives if available. Did ranching interfere with the missions? Again I have read about 3 papers discussing this but I love to collect information. Also how would I cite something like this if I wanted to use the perspective in my research? Also if there are any more sources that would provide better insight I would love to know.",
        "created_utc": 1676524600,
        "upvote_ratio": 1.0
    },
    {
        "title": "La chua",
        "author": "LizardQueen1993",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ipb4/la_chua/",
        "text": "[removed]",
        "created_utc": 1676524371,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help explaining the differences between the 5 pope urban speeches at council of clermont",
        "author": "retartarsauce",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ilq0/need_help_explaining_the_differences_between_the/",
        "text": "[removed]",
        "created_utc": 1676524033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I get a reliable source about US influence in Camp David Accords?",
        "author": "inigogalanes_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113igg4/where_can_i_get_a_reliable_source_about_us/",
        "text": "Noam Chomsky mentions that for the Camp David Accords of 1978, the only reason why Israel accepted to “recognize” the Palestinian territories bordering Israel was because they would receive a considerably big weapon aid package from the US. Supposedly these weapons were then used to invade Lebanon. I want to find a legitimate source that confirms this information, if anyone knows where I can find this. Furthermore, although the US did see allying with Egypt as an opportunity given the dying USSR influence, did the Carter administration actually gain anything else from Egypt for being the “mediator” in the Accords? Thanks in advance.",
        "created_utc": 1676523543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about the Camp David Accords",
        "author": "inigogalanes_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113ibof/questions_about_the_camp_david_accords/",
        "text": "[removed]",
        "created_utc": 1676523068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books that chronologically documents plague outbreaks in Europe during 16th century?",
        "author": "Teris_Thesis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113i67k/any_good_books_that_chronologically_documents/",
        "text": "",
        "created_utc": 1676522528,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common was Islam in the west in the 1800s and early to mid 1900s?",
        "author": "pinknim102",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113hmq2/how_common_was_islam_in_the_west_in_the_1800s_and/",
        "text": "Was it known or common at all? And what were people’s thoughts on it?",
        "created_utc": 1676520736,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the Alans’ vices and virtues?",
        "author": "HalfLeper",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113hbfk/what_were_the_alans_vices_and_virtues/",
        "text": "What traits did their society value?  Honesty?  Bravery?  Chastity?  Promiscuity?  I’ve been able to find things for other ancient societies, such as the Celts, the Egyptians, Romans, and Greeks, but I’ve scoured the internet for the Alans to no avail.  I hope someone here can help me 😣",
        "created_utc": 1676519726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Muslims know the First crusaders were on their way to the Holy Land before they arrived or did they just appear on the horizon one day?",
        "author": "FatumIustumStultorum",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113h9vo/did_the_muslims_know_the_first_crusaders_were_on/",
        "text": "I'm just curious how much warning, if any, that any of the Islamic cities or empires had of the first Crusaders military campaign before they actually arrived. I imagine that sort of news would travel more quickly than an army, but I don't know how common the knowledge would have been if it had existed.",
        "created_utc": 1676519579,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Lushan, famous rebel against the Tang Empire, was an ethnic Sogdian. Sogdia at the time was an eclectic mix of religions including Nestorianism, Manichaeism and Iranian polytheism. Do we know anything about An Lushan's religious beliefs?",
        "author": "megami-hime",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113h41q/an_lushan_famous_rebel_against_the_tang_empire/",
        "text": "",
        "created_utc": 1676519037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a book that opposes Howard Zinn's A People's History?",
        "author": "whitechristmas1954",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113gwwy/is_there_a_book_that_opposes_howard_zinns_a/",
        "text": "I am working on a project in which I am required to compare two sides of an argument through published American history books. I chose Zinn's *A People's* for one, but I'm having trouble (granted, using Google) finding a resource to use as contrast to Zinn's perspectives. Does anyone have any recommendations for books I can use for this?",
        "created_utc": 1676518416,
        "upvote_ratio": 1.0
    },
    {
        "title": "How early on did different civilizations independently determine the earth is round?",
        "author": "jobrody",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113gsa3/how_early_on_did_different_civilizations/",
        "text": "",
        "created_utc": 1676518017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why not Apollo?",
        "author": "TheFishJones",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113gor0/why_not_apollo/",
        "text": "When the Romans adapted the Olympian gods they gave most of them new names (Ares to Mars, etc). Why not Apollo?",
        "created_utc": 1676517708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Soviet Union collapse in an odd way?",
        "author": "rax9000",
        "url": "https://www.reddit.com/r/AskHistorians/comments/113gjwj/did_the_soviet_union_collapse_in_an_odd_way/",
        "text": "It's weird how while some countries in Africa for example, have way more problems in pretty much every aspect, yet they still manage to remain united (at least de jure). While the USSR rapidly fell in spite a lot of people still wanting it to keep united (or at least to be transformed as the Union of Soviet Sovereign Republics). And sure, it went through a terrible economic situation, but China, Cuba and North Korea probably went through worse stuff yet they still remain. Even the USA , Argentina and some capitalist countries went through some recessions and here they are. I also find it weird how Gorbachev could take the democratization policies he did if they were clearly going to dismantle the Eastern Bloc.\n\nIf anyone could explain to me what happened to the USSR that was different I'd be happy to learn",
        "created_utc": 1676517298,
        "upvote_ratio": 1.0
    }
]