[
    {
        "title": "How was Rome able to survive the 2nd Punic War and continue their war effort (tending to the fields, producing/exporting goods, importing grain, taxing its citizens, fielding more armies) despite losing hundreds of thousands of their men, almost all of them being land-owning citizens?",
        "author": "hominoid_in_NGC4594",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l6bk7/how_was_rome_able_to_survive_the_2nd_punic_war/",
        "text": "It makes zero sense to me. Especially in that part of the Roman Republic when Rome didn't even control the entire Italian Peninsula and their army was completely different.  20,000 men being killed, more captured, at Battle of the Trebia, another 25,000 killed the next year at Lake Trasimene, and then the slaughtering of 70,000 people at Cannae the next year, which was basically the largest army Rome had ever fielded up to that point. Where on Earth were these new men coming from? Who was paying to equip them?? We are over a century from the Marian Reforms, so the army was made up of only land-owning citizens. There couldn't have been hundreds of thousands of farms in Rome's territory in 218 BC for them to draw men from, could there have been???\n\nAnd how was the state able to continue to function? Hannibal was destroying everything in Italy for over a decade. Food, crops, farms, people, cities. And a bunch of Roman allies were switching sides to Carthage. How could Rome still collect and enforce taxes? Was their treasury basically overflowing with gold and silver before the war, enabling them to not have any financial problems?? This one conflict of the ancient world always boggles my mind. I just don't understand how Rome was able to prevail. Fielding and losing that many men and battles, in their home land, in the second century BC, it goes against all rational thought that they would win it.",
        "created_utc": 1678212040,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://discord.gg/celebroom",
        "author": "Mean_Ad1905",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l67fd/httpsdiscordggcelebroom/",
        "text": "",
        "created_utc": 1678211789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this anecdote about a Space Shuttle part being (tangentially) derived from the width of two Roman horses actually correct?",
        "author": "Mishmoo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l628j/is_this_anecdote_about_a_space_shuttle_part_being/",
        "text": "Anecdote as follows:\n\n&gt; The US standard railroad gauge (distance between the rails) is 4 feet, 8.5 inches. That's an exceedingly odd number. Why was that gauge used?\n\n&gt; Well, because that's the way they built them in England, and English engineers designed the first US railroads. Why did the English build them like that?\n\n&gt; Because the first rail lines were built by the same people who built the wagon tramways, and that's the gauge they used. So, why did 'they' use that gauge then?\n\n&gt; Because the people who built the tramways used the same jigs and tools that they had used for building wagons, which used that same wheel spacing. Why did the wagons have that particular odd wheel spacing?\n\n&gt; Well, if they tried to use any other spacing, the wagon wheels would break more often on some of the old, long distance roads in England . You see, that's the spacing of the wheel ruts. So who built those old rutted roads?\n\n&gt; Imperial Rome built the first long distance roads in Europe (including England ) for their legions. Those roads have been used ever since.\nAnd what about the ruts in the roads?\n\n&gt; Roman war chariots formed the initial ruts, which everyone else had to match or run the risk of destroying their wagon wheels. Since the chariots were made for Imperial Rome , they were all alike in the matter of wheel spacing. Therefore the United States standard railroad gauge of 4 feet, 8.5 inches is derived from the original specifications for an Imperial Roman war chariot. Bureaucracies live forever.\n\n&gt; So the next time you are handed a specification/procedure/process and wonder 'What horse's a*s came up with this?', you may be exactly right. Imperial Roman army chariots were made just wide enough to accommodate the rear ends of two war horses. (Two horses' as*es.)\n￼\n&gt; Now, the twist to the story:\n&gt; When you see a Space Shuttle sitting on its launch pad, there are two big booster rockets attached to the sides of the main fuel tank. These are solid rocket boosters, or SRBs. The SRBs are made by Thiokol at their factory in Utah . The engineers who designed the SRBs would have preferred to make them a bit fatter, but the SRBs had to be shipped by train from the factory to the launch site. The railroad line from the factory happens to run through a tunnel in the mountains, and the SRBs had to fit through that tunnel. The tunnel is slightly wider than the railroad track, and the railroad track, as you now know, is about as wide as two horses' behinds.\n\n&gt; So, a major Space Shuttle design feature, of what is arguably the world's most advanced transportation system, was determined over two thousand years ago by the width of a horse's a*s.\n\n&gt; And you thought being a horse's a*s wasn't important? Ancient horse's as*es control almost everything. 😁😁",
        "created_utc": 1678211471,
        "upvote_ratio": 1.0
    },
    {
        "title": "A lot of cities changed countries after the formation of new borders in the wake of WW2, and many people were displaced. What happened to intangible cultural institutions (football teams for example) from affected areas?",
        "author": "TheRockButWorst",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l60q4/a_lot_of_cities_changed_countries_after_the/",
        "text": "Did cultural institutions (football clubs, fundraising groups, religious orders for instance) remain in the host city after it changed hands, did they travel with the displaced people, or dissolved entirely?",
        "created_utc": 1678211381,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to statistics I've seen, Zimbabwe did well during the first decade of Mugabe's rule. Insofar as that's accurate, to what extent did it happen due to 1) Mugabe getting things right, and 2) preceding governments having paved the way?",
        "author": "stranglethebars",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l5t1k/according_to_statistics_ive_seen_zimbabwe_did/",
        "text": "Trends in [Zimbabwe's Multidimensional Poverty Index](https://upload.wikimedia.org/wikipedia/commons/5/58/Zimbabwe%2C_Trends_in_the_Human_Development_Index_1970-2010.png) (1970-2010) seem to correspond with the other indicators I've come across (related to child malnutrition, economic output of smallholders, life expectancy, employment, economic growth etc.).\n\nSo, what caused the positive development during the first decade after Zimbabwe's independence?\n\nWhile we're at it, what do you consider the main explanation of Zimbabwe's subsequent turn for the worse? How much of that is explained by each of the following factors?\n\n1) Land reform issues,\n\n2) sanctions (according to [this source](https://carnegieeurope.eu/2022/06/29/zimbabwe-long-shadow-of-sanctions-pub-87313), sanctions were \"placed on Zimbabwe after the land-reform program in the 1990s and years of human rights abuses\"), \n\n3) the introduction of IMF reforms in 1991,\n\n4) involvement in the war in the Democratic Republic of the Congo, and\n\n5) something else? I am, for instance, aware that Mugabe said that the UK didn't keep their promises in terms of aid to Zimbabwe, but I'm not sure how accurate that claim is.\n\n...I just realized that I misinterpreted the Multidimensional Poverty Index initially. When I quickly read about it yesterday, I somehow interpreted it as \"higher number = less poverty\", but a higher number actually means *more* poverty! This makes things more interesting, since the MPI then seems to contradict the other indicators I referred to. Unless poverty simply increased while life expectency, smallholders' output etc. also increased.",
        "created_utc": 1678210884,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many people lived in Acadia during 1671 and 1755?",
        "author": "Shadow_Dragon_1848",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l59o1/how_many_people_lived_in_acadia_during_1671_and/",
        "text": "A question that sounds simple : Just google it. But I did found conflicting numbers. YouTube reconemended me, a leftist social democrat a libertarian video about Acadia as a successful example for an libertarian/ancap society. I did not watch the video but read it´s [source](https://mises.org/wire/acadian-community-anarcho-capitalist-success-story). Besides the fact that I do find it a bit ... odd to project something like anarcho capitalism onto a colony from 1650 it was somewhat interesting. One thing that I found interesting was the claim that Ancadian population (just Europeans) peaked at 16,000. I then read the [paper](https://www.rcandela.com/uploads/2/0/1/6/20163847/candela_and_geloso__2021__trade_or_raid.pdf) mentioned on the site to find the source for the population number. It looked at least to my eyes legit. It takes the number of 16,000 from two sources who seem quite old (1968 and 1979).  Besides that I just googled it and found a number on [Wikipedia](https://en.wikipedia.org/wiki/Acadia#Population) (taken from \"La Nouvelle France: The Making of French Canada - A Cultural History\" by Peter M. Moogk) which stated a number of 2,528 by 1714. It also adds another 5,000 people by 1757 just on modern day Prince Edward Island (from the same source). Another [source](https://www.thecanadianencyclopedia.ca/en/article/history-of-acadia) claims around 10,000 people in Ancadia by 1750. Soooo what is it?\n\nThere are more questions that I have about this piece, mostly how exceptional the described form of self rule in Ancadia really was, whether they were as peaceful as claimed and if yes why (was it as claimed in the paper, or that Ancadia had so much free land that settler aggression like in New England was just not needed?). But I will reseve them for another time.",
        "created_utc": 1678209634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is prostitution world’s oldest profession?",
        "author": "aeakinoglu",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l57fl/is_prostitution_worlds_oldest_profession/",
        "text": "I was watching HIMYM and they said this. True?",
        "created_utc": 1678209494,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good sources or topics for writing a paper about Jews in Hungary pre WWII?",
        "author": "Interesting-Bar6885",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l4hy4/what_are_some_good_sources_or_topics_for_writing/",
        "text": "Hello! I’m wanting to research and write my paper on the history of Jews in Hungary pre WWII, I need to do more reading but I guess I’m struggling with finding that time period. Was looking for some primary sources but I keep running into WWII",
        "created_utc": 1678207917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research Topic",
        "author": "Interesting-Bar6885",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l4emt/research_topic/",
        "text": "[removed]",
        "created_utc": 1678207714,
        "upvote_ratio": 1.0
    },
    {
        "title": "What percentage of ancient literature has survived to the present?",
        "author": "AlbaneseGummies327",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l40kc/what_percentage_of_ancient_literature_has/",
        "text": "",
        "created_utc": 1678206819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone recommend solid reads on the Peloponnesian War and how myth and war influenced Ancient Greece?",
        "author": "DerpDerpsonian",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l3vg9/can_anyone_recommend_solid_reads_on_the/",
        "text": " \n\nHello fellow historians! I'm graduated in History here in Brazil and I'm looking to start a twitch stream playing Assassin's Creed and trying to teach history through it. My favorite historical period has always been Ancient Greece, and luckily for me, AC Odyssey is set there.\n\nSo, before I start playing I'm looking for solid reads on the topics mentioned. Books can be in Portuguese, Spanish or English. Thank you all very much!",
        "created_utc": 1678206507,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was corporal punishment for children/teens in the middle ages? What crimes did they commit to have the same? Did government have the ability to punish them?",
        "author": "Cool-Barber8998",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l3pzr/how_was_corporal_punishment_for_childrenteens_in/",
        "text": "",
        "created_utc": 1678206153,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do Cambodia scholars think of Michael Vickery's Cambodia 1975-1982 today?",
        "author": "Salziz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l3l09/what_do_cambodia_scholars_think_of_michael/",
        "text": "",
        "created_utc": 1678205842,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much of Haiti's economy was dedicated to paying their indemnity to France?",
        "author": "Kumquats_indeed",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l3egt/how_much_of_haitis_economy_was_dedicated_to/",
        "text": "Of course things must have varied significantly over the 122 years that Haiti was paying reparations to France, but is it possible to average it over those years what percentage of the Haitian government's revenue went to paying that debt? Otherwise, if anyone is able the shed some light on any particular times in Haiti's economic history under this onerous debt I would be greatly appreciative.",
        "created_utc": 1678205423,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the oldest surviving photograph of a camera, or a mention of such?",
        "author": "Heartade",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l31dv/what_is_the_oldest_surviving_photograph_of_a/",
        "text": "By 'photograph of a camera', I mean a photograph in which a camera is framed, not a photograph took by a camera.\n\nThe oldest I can find is this [mirror selfie of an unidentified woman](https://www.smithsonianmag.com/smart-news/take-peep-gallery-historic-selfies-180963726/) in which she is holding a Kodak Brownie camera, from early 20th century.",
        "created_utc": 1678204613,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good history audiobook?",
        "author": "Cute_Garbage3592",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2rua/what_is_a_good_history_audiobook/",
        "text": "Just got into audiobooks I listened to Chaos, A people’s History of the United States, the devil in the white city and the rise and fall of the third reich. Any suggestions based on my previous reads?",
        "created_utc": 1678203999,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some primary sources related to Ottoman interactions or policies in the Balkans?",
        "author": "novk-mooning",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2n6w/what_are_some_primary_sources_related_to_ottoman/",
        "text": "Hey all, I’ve been searching for a strong primary source discussing Ottoman policies regarding the Balkan states, but the issue I find myself running into is language barriers. My current choice of source is the Turcograecia libri octo, which does not have an English translation as far as I can tell. If any of you would happen to have such a translation, or alternatively any specific documents/insightful sources of the time (preferably in English), I would love if you could share! I’ve been stuck looking for something useful for days now and any help would be great.",
        "created_utc": 1678203699,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was Egypts control over Canaan like?",
        "author": "SnooPandas1950",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2mmc/what_was_egypts_control_over_canaan_like/",
        "text": "How exactly did they conquer/tributize the states there? What states were there before? I read that the Egyptians only directly controlled a city or two, leaving the rest mainly to small city-states. How egyptified were those city-states, and how did they cope with Egypt's withdrawal?",
        "created_utc": 1678203664,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did Mediterranean Civilizations and China first learn about each other?",
        "author": "SnooPandas1950",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2h00/when_did_mediterranean_civilizations_and_china/",
        "text": "The Roman Empire and the Han Dynasty traded with each other since at least 100 BCE, but did the Egyptians, Greeks, etc know of their existence and vice versa?",
        "created_utc": 1678203306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Around when and how did the Bronze Age Collapse end?",
        "author": "SnooPandas1950",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2cic/around_when_and_how_did_the_bronze_age_collapse/",
        "text": "I've been able to find a lot of discussion as to how it started and the possible causes behind it, but not much on the end/recovery of it. I know Egypt and the Assyrians didn't collapse like the Mycenae and the Hittites, but they still drastically shrunk in power and prominence. Wikipedia gives the date 1150 BCE, but doesn't really elaborate on that date. I also realize the recovery was a gradual process, but what did it exactly consist of?",
        "created_utc": 1678203024,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's a good, non-paranoid book about Masonry?",
        "author": "Darth_Lousy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2ajj/whats_a_good_nonparanoid_book_about_masonry/",
        "text": "'Lo all, I'm a fiction writer working on a project set in the 1830s US. It touches on anti-Masonry, Millerism, and the early Mormon chuch. The problem is that it is hard to reasearch on those topics, especially Masonry, without hitting a bunch of Holy Blood Holy Grail nonsense. Does anyone know a good book that touches on that stuff without occult paranoia and speculation? \"No Man Knows My History\" helped, but it is obviously more focused on Mormonism than Masonry. Thanx.",
        "created_utc": 1678202908,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've heard that the reason we don't hear about Native American/what we would know now as \"Mexican\" slaves is because they mostly died off mostly incidentally and slave owners then had to switch to using Africans. Is there any truth to this?",
        "author": "TheRealKuthooloo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l2a9q/ive_heard_that_the_reason_we_dont_hear_about/",
        "text": "Apparently the incidental deaths were caused mostly by sickness and the like, I heard this a few months ago and it just popped into my head and I was curious if there was any reality to this? It seems plausible but im no history buff and would love to learn more about this era.",
        "created_utc": 1678202891,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the first recorded abolitionist movement?",
        "author": "SnooPandas1950",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l26gt/what_was_the_first_recorded_abolitionist_movement/",
        "text": "The practice of slavery was extremly prevelant throughout the ancient world, but was there ever a strong movement against it, or nation that banned it?",
        "created_utc": 1678202652,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do historians decide where a state, nation, or nation-state begins to exist and ceases to exist? What is the basis for historical \"identity\"?",
        "author": "Hugh_Munguses",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l24tj/how_do_historians_decide_where_a_state_nation_or/",
        "text": "I've been wondering about this because people argue that the continuation of the Roman Empire only truly \"fell\" with the fall of the Eastern Roman Empire. We do distinguish between the Roman Regnum, the Roman Republic, the \"Roman Empire\", and then Byzantium. \n\nThe \"Germany\" of today could be said to have only existed in 1991 with reunification, or maybe it changed under Nazi Germany, or the Weimar Republic... etc. But modern Germany came about in 1866 with the North German Confederation Treaty, and before that it was a German Confederation that sat beside Prussia. \n\nEngland became a republic in 1649 before reformed back into it's kingdom in 1660, but we don't regard England as ceasing to exist for that period. We DO seem to distinguish between England and what could be considered an English hegemony in the form of Great Britain, and then the United Kingdom. \n\nSo you can see the clear distinctions... sort of. But it seems inconsistent, and this is further compounded by the Chinese Dynastic Cycle, which (maybe in the spirit of nationalism) China would argue as a more or less continuous \"nation of China\" broken up by a particular ruling dynasty and then periods of interegnum. I take most issue with this perception because China itself was conquered by the Mongols but somehow the Yuan dynasty is considered a part of the cycle. \n\nSo here's my issues:\n\n* It's clearly not based on type of government or how long a particular government rules.\n* It's clearly not based on a particular geography as the center of regional power seems to constantly shift, wax, and wane.\n* There does seem to come a point where identities change, though. Rome was simply Rome, even though all rights were concentrated among the citizenry, who themselves were citizens of Rome. It didn't become anything \"more\", ie it isn't referred to as the \"Italian Empire\" or \"European Empire\". However, England becomes GB, then UK... \n\nIt seems to basically be based on who has hegemony, and who has rights. In Rome a limited few had true \"citizen rights\", though there was plenty of stratification. In the UK, English folks aren't superior, they are held equal with Wales, Scotland, etc. In America, though, the people of Guam or Puerto Rico are American citizens, even though their lands have no actual representation at the regional level. \n\nNow that's I've given my train of thought, I'd like to hear from historians on this.",
        "created_utc": 1678202543,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the phrase 'Mitochondria are the powerhouse of the cell' become such a popular way to describe the function of mitochondria in Eukaryotic cells?",
        "author": "acharismaticjeweller",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l1wqw/how_did_the_phrase_mitochondria_are_the/",
        "text": "",
        "created_utc": 1678202010,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much do we know about Punt and Kerma's languages?",
        "author": "SnooPandas1950",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l1vye/how_much_do_we_know_about_punt_and_kermas/",
        "text": "Such lands were written about almost exclusively by Egypt, so the information we have on them is limited. Did the Egyptians ever write about Kerma/Punt's language, or names of the people from there/endonyms of their country?",
        "created_utc": 1678201954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Bantu migration happen in (relatively) short bursts in between eras of settlement, or was it a gradual somewhat constant trickle thought the continent?",
        "author": "SnooPandas1950",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l1phs/did_the_bantu_migration_happen_in_relatively/",
        "text": "If it was the the former, what's the rough timeline of it?",
        "created_utc": 1678201518,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the British colony and future US state of Georgia was first named, did anyone point out that it might cause confusion with Georgia 🇬🇪 the country? Is there any particular history of Georgia/Georgia relations based on their identical names?",
        "author": "George4Mayor86",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l1dnx/when_the_british_colony_and_future_us_state_of/",
        "text": "",
        "created_utc": 1678200734,
        "upvote_ratio": 1.0
    },
    {
        "title": "With the plethora of monastic orders which emerged during the Middle Ages, what were the practices and beliefs that made them all different and distinct from one another?",
        "author": "KatsumotoKurier",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l1atk/with_the_plethora_of_monastic_orders_which/",
        "text": "I was trying to read up on Augustinian, Tironensian, Cistercian, and Benedictine monks, amongst others, but even after pouring through several internet articles upon them, I can't seem to rightly figure our why these numerous different groups existed, let alone what makes them all different and distinct from one another. It almost seems like the many orders were kind of redundant. \n\nBut what did make them different and distinct, aside from being founded at different times? What were the specific beliefs and practices they observed that made them what they were?",
        "created_utc": 1678200538,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Florida end up being a retirement destination for the United States?",
        "author": "ManInBlackHat",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l146d/how_did_florida_end_up_being_a_retirement/",
        "text": "",
        "created_utc": 1678200080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has there been any research into the differing mentalities of French soldiers in 1914-18 and 1940?",
        "author": "Foul-Ole_Ron",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l0yn7/has_there_been_any_research_into_the_differing/",
        "text": "Specifically, French soldiers. I read Alistair Horne's (semi) trilogy about the Franco-Prussian war, the battle of Verdun, and the Battle of France in 1940. \n\nWhat struck me was that French soldiers in 1914-16 endured an incredible amount of punishment, in conditions we can't really imagine, and still kept fighting.\n\nIn contrast, it seems like their sons in 1940 were far less willing to fight. Specifically in the parts regarding the German breakthrough at Sedan, and the subsequent advance towards the Channel, it seems like huge groups of French soldiers surrendered (often to numerically smaller German units) without even trying to put up a fight.\n\nWas it a question of morale, mentality or training? Were the combat conditions so different from WW1 that an outflanked unit was simply physically unable to fight?",
        "created_utc": 1678199707,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've just read that the Ancient University of Nalanda in India had \"9 million text\", how accurate is this number? How were they catalogued?",
        "author": "rip_ripley",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l0vnw/ive_just_read_that_the_ancient_university_of/",
        "text": "",
        "created_utc": 1678199516,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the history of hate crime law in America ?",
        "author": "Ih8Wypipo519",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l0s5u/what_is_the_history_of_hate_crime_law_in_america/",
        "text": "What is the history of hate crime law in America ? Also have non White people ever been convicted on hate crime charges ?",
        "created_utc": 1678199287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Offspring as a Commodity",
        "author": "GingerMaestro1984",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11l0p52/offspring_as_a_commodity/",
        "text": "[removed]",
        "created_utc": 1678199077,
        "upvote_ratio": 1.0
    },
    {
        "title": "We've heard of stories of what scientists in the Manhattan project, like Oppenheimer, said after detonation of atomic bomb. Then do we have stories about what other countries' scientists (Soviet, Chinese, French etc) said when their own first nuclear experiment were successful?",
        "author": "PLutonium273",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kzn6e/weve_heard_of_stories_of_what_scientists_in_the/",
        "text": "",
        "created_utc": 1678196464,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the naturalization process for america. No fancy names or words like the technical name of the test you take. also why did they dig trenches in ww1? why not just do war normal? they had guns and chose to use a shovel.",
        "author": "LeninLover1922",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kz8kn/what_is_the_naturalization_process_for_america_no/",
        "text": "",
        "created_utc": 1678195383,
        "upvote_ratio": 1.0
    },
    {
        "title": "why was there seemingly thousands and thousands of years of very little progress for humans?",
        "author": "intenseskill",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kz41x/why_was_there_seemingly_thousands_and_thousands/",
        "text": "Given that humans have been around for 300,000 years (I googled it so am going with that) why is it that for much of that time there seems to be very little progress made until maybe the last 2000 years and mostly in the last 200?",
        "created_utc": 1678195037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any particular reason the states of Western and South Australia weren't given more \"traditional\" names?",
        "author": "OldPersonName",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kyxob/is_there_any_particular_reason_the_states_of/",
        "text": "The joke I heard in Australia is they just got lazy after Queensland, Victoria, and NSW. I would throw in the NT too but I understand that's not a state. I see WA was called New Holland for a long time, a similar name format to New South Wales, but it ultimately didn't stick.",
        "created_utc": 1678194548,
        "upvote_ratio": 1.0
    },
    {
        "title": "I understand tropical fruits were rare in medieval Europe. So how did the colour orange become synonymous with the fruit rather than the more common carrot?",
        "author": "Xythian208",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kyt4d/i_understand_tropical_fruits_were_rare_in/",
        "text": "",
        "created_utc": 1678194198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the Bible be interpreted as a series of fables / tales that try to instill a ‘common sense’ virtue?",
        "author": "taskmans",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kynb1/can_the_bible_be_interpreted_as_a_series_of/",
        "text": "Hi guys,\n\nAs a decidedly secular person, I have always had the casual impression that the Bible is, when unadorned of it’s religious connotation, a series of fables with which to imbue the readers of the time with lessons of “common sense”. \n\nNot all of the Bible, of course. There’s many things in the Bible which do not conform to this. But it does have lessons like be respectful, help yourself and then others, show humility and quiet piety, etc. to even more a priori lessons like “do not kill others” and “respect your elders”. Some of these things really resonate with me (perhaps due to being born into the Western tradition that tacitly accepts most of these Biblical assertions for the underlying structure of society in many ways). These assertions strike me as things that I can deduce with logic and anecdotal experience to be proven as, at the very least, probably the way to go. I did not grow up in a religious household and I hold no beliefs relating to Abrahamic religions period, so I wonder how I could semi-independently come to these conclusions if there wasn’t perhaps an ounce of truth in them. \n\nHow accurate could my impression of the Bible be? Is this even an academically valid perspective to apply to the work? I don’t know much from the primary source, so I am eager to see how this perspective holds up to a more rigorous application of subject matter expertise and critical thinking. I welcome any perspective you guys might have!\n\nThanks everyone!",
        "created_utc": 1678193778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nazi ideology in the population post WW2",
        "author": "Kisser86",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kyfyg/nazi_ideology_in_the_population_post_ww2/",
        "text": "[removed]",
        "created_utc": 1678193198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has their been anything as influential as the church",
        "author": "_unknown_spoon_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ky5fd/has_their_been_anything_as_influential_as_the/",
        "text": "[removed]",
        "created_utc": 1678192404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing a topic for an extended essay?",
        "author": "throwaway-pls",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kxnbj/choosing_a_topic_for_an_extended_essay/",
        "text": "\nHi guys, I’m currently doing a pre-requisite course to access university in September - the final upcoming unit in History is a ‘pick your own topic/ question’ comprised of 4,000 words maximum. I’m honestly at a loss of what I could choose, I was debating Chernobyl/ US foreign policy during the Cold War but i’m struggling to think of a question as well as being unsure how much material is available online for sources. (It’s primarily going to be website based sources/info etc).\n\nI’d be grateful for any suggestions - the assignments I’ve done so far have been on focused topics (Russian Revolution, Public Health UK 18/19th Century) so having an open season on what to choose is proving quite difficult for me.",
        "created_utc": 1678191023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing a topic for an extended essay -",
        "author": "throwaway-pls",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kxm9p/choosing_a_topic_for_an_extended_essay/",
        "text": "[removed]",
        "created_utc": 1678190942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tuesday Trivia: Women's rights! This thread has relaxed standards—we invite everyone to participate!",
        "author": "AlanSnooring",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kxgjr/tuesday_trivia_womens_rights_this_thread_has/",
        "text": "Welcome to Tuesday Trivia!\n\nIf you are:\n\n* a long-time reader, lurker, or inquirer who has always felt too nervous to contribute an answer\n* new to /r/AskHistorians and getting a feel for the community\n* Looking for feedback on how well you answer\n* polishing up a flair application\n* one of our amazing flairs\n\n**this thread is for you ALL!**\n\nCome share the cool stuff you love about the past! \n\n**We do not allow posts based on personal or relatives' anecdotes.** Brief and short answers are allowed but **MUST** be properly sourced to respectable literature. All other rules also apply—no bigotry, current events, and so forth.\n\n**For this round, let’s look at:** **Women's rights**! For this round, let’s look at women's rights throughout history. Tell us about the cultural context or historiography around rights of 51% of the population in the societies you study. How has the idea of 'rights' shifted over time? What did power for women look like in times and places where it appears to the modern eye they had little power? (Trivia about individual women is coming up later this month! So hold on those!) This week's thread is the place the claim and celebrate those who fought for, those who got, and those who were denied women's rights.",
        "created_utc": 1678190494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why, historically, have the vast majority of societies always been dominated by men?",
        "author": "Yellowlegoman_00",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kx3p1/why_historically_have_the_vast_majority_of/",
        "text": "I find this an interesting question. See, the most obvious answer to me seems to be that on average, men are physically stronger and so took power, but this seems oversimplified. Lots of women are nonetheless stronger than lots of men, and yet they seem to have, historically had no more power than other women. \n\nAlso, human societies, for all the importance they’ve placed on physical strength, don’t appear to generally pick their leaders based solely on who is the strongest.  In fact, historically more often than not the people with the least power seem to be the physically more capable. Slaves did hours of manual labour and so would have been stronger than their masters. There were far more peasant women than noblemen, and yet they’d have been stronger from working the fields all day than male clerics and administrators. \n\nPerhaps I’m being stupid, but this explanation just doesn’t seem satisfactory, and so I’d like to know if historians have a better one.",
        "created_utc": 1678189457,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was life like for longbowmen?",
        "author": "Gopherofdoomies",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kx06o/what_was_life_like_for_longbowmen/",
        "text": "I’m writing a story about a longbowman (well, woman), so I'm interested in information about bows, the the upkeep of such, and related information, preferably from an English perspective around the High Middle Ages (9th-13th centuries) but any information is good.\n\nFrom what I'm aware, the best bows were made of yew, due to its elasticity. How would one travel with a bow? If one wanted to protect it from the elements, how would that be done, and using what materials? Did they carry their own arrows, and how many? How long were bows expected to last before breaking? Did they carry weapons (such as knives) in case they entered close combat? What sort of armor did they have?\n\nSocially, what was life like? Were they regarded any differently than foot soldiers (both from within the army and from without)? Were they seen as higher in status or lower?\n\nIs there any other information that you think would be interesting or useful to know?",
        "created_utc": 1678189169,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was it like being a longbowman?",
        "author": "Gopherofdoomies",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kww3n/what_was_it_like_being_a_longbowman/",
        "text": "I’m writing a story about a longbowman (well, woman), so I'm interested in information about bows, the the upkeep of such, and related information, preferably from an English perspective around the High Middle Ages (9th-13th centuries) but any information is good.\n\nFrom what I'm aware, the best bows were made of yew, due to its elasticity. How would one travel with a bow? If one wanted to protect it from the elements, how would that be done, and using what materials? Did they carry their own arrows, and how many? How long were bows expected to last before breaking? Did they carry weapons (such as knives) in case they entered close combat? What sort of armor did they have?\n\nSocially, what was life like? Were they regarded any differently than foot soldiers (both from within the army and from without)? Were they seen as higher in status or lower?\n\nIs there any other information that you think would be interesting or useful to know?",
        "created_utc": 1678188823,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was it like being an English longbowman?",
        "author": "Gopherofdoomies",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kwuo7/what_was_it_like_being_an_english_longbowman/",
        "text": "I’m writing a story about a longbowman (well, woman), so I'm interested in information about bows, the the upkeep of such, and related information, preferably from an English perspective around the High Middle Ages (9th-13th centuries) but any information is good.\n\nFrom what I'm aware, the best bows were made of yew, due to its elasticity. How would one travel with a bow? If one wanted to protect it from the elements, how would that be done, and using what materials? Did they carry their own arrows, and how many? How long were bows expected to last before breaking? Did they carry weapons (such as knives) in case they entered close combat? What sort of armor did they have?\n\nSocially, what was life like? Were they regarded any differently than foot soldiers (both from within the army and from without)? Were they seen as higher in status or lower?\n\nIs there any other information that you think would be interesting or useful to know?",
        "created_utc": 1678188703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there opposition or an \"anti-vax\" movement to vaccines for diseases/illnesses such as the flu in the 1900s?",
        "author": "t6lkity",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kwthc/was_there_opposition_or_an_antivax_movement_to/",
        "text": "",
        "created_utc": 1678188616,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did WWI trench warfare actually work?",
        "author": "WirrkopfP",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kvjna/how_did_wwi_trench_warfare_actually_work/",
        "text": "In movies it's always depicted kind of like this:\n\n- Two trenches somewhat parallel to each other. \n- A stripe of no man's land in the middle. \n- If someone tries to cross no man's land they get gunned down except if they have plot armor equipped. \n- So both sides stare at each other from their positions, waiting for the other side to make a mistake. \n\nIs this an accurate depiction of how trench warfare was actually like? \n\nHow did this situation come into place? \nI mean Trenches don't come from nowhere. \n\nIf one side is first on a place they would dig their trench first. Then the other side would be at a severe tactical disadvantage trying to dig while under machine gun fire. \n\nSo was there an International treaty in place that ensured no one would fire until both sides where satisfied with their digging or how did that work?",
        "created_utc": 1678184676,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the purpose of cutting the stomach during seppuku?",
        "author": "FarmOptimal",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kuuw3/what_was_the_purpose_of_cutting_the_stomach/",
        "text": "Since the persons head was getting cut off after anyways, why did samurais need to cut the stomach? It seems unnecessary as they were going to die from getting beheaded anyway, so why inflict more pain on yourself?",
        "created_utc": 1678182433,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the 1934 American cartoon \"Toyland Broadcast\" there is a pair of \"French Dolls\" who engage in domestic violence. Were French people stereotyped as especially inclined towards such behavior? Youtube link inside.",
        "author": "witty-original-name",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kuofy/in_the_1934_american_cartoon_toyland_broadcast/",
        "text": "[Here is a link to the full cartoon, near the start of the \"French Dolls\" bit.](https://youtu.be/x-56EIZj6tg?t=240)  The bit is around 45 seconds long.\n\nI remember watching this as a kid and being a bit confused by this segment.  Is it just a silly bit of slapstick with dolls who just so happen to look \"French?\"  Or was there a stereotype at the time that French relationships were particularly volatile?\n\nThe whole cartoon is an interesting showcase of what may have been considered appropriate for audiences at the time (mainly children I assume).  There are many characters which modern audiences would largely consider offensive, such as the sambo, golliwog, mammy, and blackface minstrel toys.  And yet it was still included in an otherwise tame [1993 Tom and Jerry VHS](https://tomandjerry.fandom.com/wiki/Tom_%26_Jerry%27s_The_Night_Before_Christmas) which is where I first viewed Toyland Broadcast.  The bit about the French dolls has had me puzzled for 30 years!  I've never associated the French with domestic abuse, but perhaps I'm just ignorant?  Enlighten me!",
        "created_utc": 1678181772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do signs with city and town names in Europe have a slash through them? I noticed this in most countries I’ve backpacked in. I read somewhere that it was a tactic used to confuse the Nazis in WWII but idk if it’s true. So if anyone knows please share",
        "author": "apptrrs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kul80/why_do_signs_with_city_and_town_names_in_europe/",
        "text": "",
        "created_utc": 1678181443,
        "upvote_ratio": 1.0
    },
    {
        "title": "what was voiltares problem with the church, religion and god?",
        "author": "libra129",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kudwm/what_was_voiltares_problem_with_the_church/",
        "text": "what annoyed him so much about those.",
        "created_utc": 1678180652,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good book, or other resource, on education during the 15th century in the Kingdom of England?",
        "author": "matthewsaaan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kudaa/what_is_a_good_book_or_other_resource_on/",
        "text": "",
        "created_utc": 1678180586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has a United States President ever made a public statement on or participated in “Reformation Day” celebrations?",
        "author": "AnOkFella",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kud1z/has_a_united_states_president_ever_made_a_public/",
        "text": "Additionally, has there ever been a significant statement made by a 19th, 20th, or 21st century president that is fond of the Protestant reformation as a general event? \n\nHow about any statement regarding Martin Luther or the early reformers?\n\nHow were these actions regarded by the populous if there were such statements?",
        "created_utc": 1678180562,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did 'Chinese-style villas' look like in Japan?",
        "author": "barking_slugs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ku300/how_did_chinesestyle_villas_look_like_in_japan/",
        "text": "Osamu Dazai's 'Setting Sun' (40s timeline) is set in a 'Chinese-style villa', with Chinese-style reception room, without specifying when it was built.\nMy question is, when in Japan were such buildings and interiors popular and how generally did they look like?",
        "created_utc": 1678179537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for Japanese culturologists",
        "author": "barking_slugs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ku0y4/question_for_japanese_culturologists/",
        "text": "[removed]",
        "created_utc": 1678179317,
        "upvote_ratio": 1.0
    },
    {
        "title": "zkSync release Era Mainnet. 03.06.2023",
        "author": "Express_Tangerine_89",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kth1w/zksync_release_era_mainnet_03062023/",
        "text": "[removed]",
        "created_utc": 1678177276,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the British had won the revolutionary war, then the United States would have permanently become part of Britain?",
        "author": "Der_Ist",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ktcgn/if_the_british_had_won_the_revolutionary_war_then/",
        "text": "If the British had won the revolutionary war, then the US would have remained a British colony and probably would have become part of Britain?\n\nDoes this mean that we would all be speaking with British accents?",
        "created_utc": 1678176813,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to trace the source of an illustration with no information",
        "author": "Apprehensive-Town396",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ktau9/how_to_trace_the_source_of_an_illustration_with/",
        "text": "[removed]",
        "created_utc": 1678176645,
        "upvote_ratio": 1.0
    },
    {
        "title": "qual foi a vez que vocês mais sentiram pena de alguém?",
        "author": "Ok_Damage6077",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ksnk1/qual_foi_a_vez_que_vocês_mais_sentiram_pena_de/",
        "text": "",
        "created_utc": 1678174281,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the ERE lose control over all of Anatolia due to a single battle, when it had holden the land previously for hundreds of years?",
        "author": "BttmOfTwostreamland",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ksh5d/how_did_the_ere_lose_control_over_all_of_anatolia/",
        "text": "I know that there's something to do with the Themata system being dismantled, but how did this actually happen? what was the process like?",
        "created_utc": 1678173629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was Burma separated from India when India became independent?",
        "author": "RsonW",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ksgmo/why_was_burma_separated_from_india_when_india/",
        "text": "I've heard about the reasons behind splitting India and Pakistan countries times over the years.\n\nBut what about India and Burma?",
        "created_utc": 1678173582,
        "upvote_ratio": 1.0
    },
    {
        "title": "How effective was cavalry charge ? Was it as deadly as in popular culture ?",
        "author": "Hairy-Conference-802",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ksf3e/how_effective_was_cavalry_charge_was_it_as_deadly/",
        "text": "As i read somewhere that horses might refuse to charge when facing against a high density formation. Then wouldn’t it mean that this tactic is highly risky and ineffective ? There also might be a high chance of getting stuck in your enemy formation and horseback melee fighting is at disadvantage at situations like that. Was there any specific tactic when you charged right in your enemy or just ran toward them like mad men ?",
        "created_utc": 1678173433,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were house mice seen/thought of throughout history?",
        "author": "mwprevention",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ksa5n/how_were_house_mice_seenthought_of_throughout/",
        "text": "When a mouse is seen in our house it's generally cause for fairly extreme panic and alarm. However a lot of fictional depictions of house mice are much more sympathetic. Is this because we live in more sanitized households and mice used to be better thought of. Or were mice just as reviled previously and the positive depictions seen in Disney films etc. a more recent, sanitized characterisation that doesn't reflect how house mice were viewed historically.",
        "created_utc": 1678172945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has there ever been a strong Virginia Irredentist movement?",
        "author": "Real_Tim_Kaine",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11krzsf/has_there_ever_been_a_strong_virginia_irredentist/",
        "text": "Obviously, at the time that maps [like this](http://www.virginiaplaces.org/graphics/image004.jpg) were drawn up the landmass wasn’t fully explored by the British, and they had no idea how large those land grants were. However, it is undeniable that land originally allotted for Virginia later became parts of other colonies, and later other states.\n\n\n\nThe split between West Virginia and Virginia was also legally murky, since the constitutionally required consent was given by the Alexandria government and not the Virginia government, although this was later cleared up by the [supreme court](https://en.m.wikipedia.org/wiki/Virginia_v._West_Virginia)\n\n\n\n\nVirginia also famously [reclaimed the territory it lost to DC](https://en.m.wikipedia.org/wiki/District_of_Columbia_retrocession)\n\n\n\n\n\nOther than these notable examples, have there been any notable attempts from Virginia to reclaim West Virginia, the Carolinas etc?",
        "created_utc": 1678171997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Percussion fire from bones",
        "author": "PossibleNew1930",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kru3p/percussion_fire_from_bones/",
        "text": "[removed]",
        "created_utc": 1678171486,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the history of plane safety regulation and why has it been so much more stringent than road safety?",
        "author": "No-Recording2937",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kr8za/what_is_the_history_of_plane_safety_regulation/",
        "text": "",
        "created_utc": 1678169598,
        "upvote_ratio": 1.0
    },
    {
        "title": "In general english speaking countries tend to be more conservative than non-english speaking european countries. When did this trend start and why did it start?",
        "author": "HealthMotor8651",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kqnqb/in_general_english_speaking_countries_tend_to_be/",
        "text": "Within the broader global political context, the US tends to be much more right-wing than say, France.\n\nThe \"left\" in the US (the democrats) are more akin to british conservatives than british labour. And amongst western europe, the UK tends to lean more conservative than many other powers. France and Germany both have a long history of strong labor and leftist movements, but saw major uprising in 1848 that the British didn't. Both saw larger scale attempted communist/socialist revolutions (see Paris Commune, 1830 revolution, Bavaria Soviet Republic, SPD, KPD, Spartacist Uprising, France's socialist and communist parties, leftist partisans in France and Italy during WWII, etc throughout much of the 19th and 20th centuries). Both have stronger leftist movements than the UK with wider support for labor oriented parties. Now, to be clear, the UK is farther left (in general) than the US, but it very much isn't \"progressive\" in any sense of the word. You can find this pattern amongst a lot of english speaking countries (canada is a bit unique cause of the french influence, but still). Why is it that labor movements tend to be stronger in continental europe than in much of the anglo-phone world? Why were communist and socialist movements stronger in France or Germany than the UK?\n\nI'm not saying that the UK is uniquely conservative or right wing (hell spain was run by a literal fascist for decades, but before that it was an explicitly socialist government, and when democracy returned it was the socialist party that heralded it).",
        "created_utc": 1678167843,
        "upvote_ratio": 1.0
    },
    {
        "title": "The role of US parties in the formation of the American state?",
        "author": "Key-Band-3048",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kqjck/the_role_of_us_parties_in_the_formation_of_the/",
        "text": "Political movements in the early years of the United States (1787-1801)?\n\nWhich parties are against and which are for the beginning of expansion (1801-1841)?\n\nNational formation: US Democrats and others before the Civil War (1841-1860)?",
        "created_utc": 1678167472,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was the US court system originally supposed to work according to the constitution before Marbury vs Madison?",
        "author": "HealthMotor8651",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kqdrf/how_was_the_us_court_system_originally_supposed/",
        "text": " \n\nSo one fact about American history is that the Supreme Court today works VERY differently from how it was originally supposed to work. I.e. when most people think of the supreme court today they mainly think of the power of judicial review.\n\nHowever, this power isn't actually listed in the constitution, it is granted to the court as part of the early case Marbury v Madison.\n\nSo my question is, how was the court originally supposed to work? I read the relevant passages in the constitution but still feel confused. Can you sketch out the general idea/the purpose behind mechanisms?\n\nWithout judicial review how was the court supposed to work? What was its primary purpose?\n\nThanks!",
        "created_utc": 1678167011,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was the US court system originally supposed to work according to the constitution pre-Marbury vs Madison",
        "author": "HealthMotor8651",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kqcpb/how_was_the_us_court_system_originally_supposed/",
        "text": "[removed]",
        "created_utc": 1678166927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Che Guevara’s Birthday really on June 14, 1928?",
        "author": "WeeklyAd3076",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kq7oa/was_che_guevaras_birthday_really_on_june_14_1928/",
        "text": "Hello all, so last week I watched a really great documentary series on Netflix called the Cuba Libre Story. The series does a really great in depth overview of Cuba's history. One of the figures featured a lot in the series was Che Guevara.\nBefore watching the series I only knew a little bit about Che Guevara. After watching the series I decided I wanted to learn more about Che.\nA couple of days ago I started reading a book called Che: A Revolutionary Life by Jon Lee Anderson. I am only half way through the book, but so far I think it's great. The book really goes in depth about Che's life.\nIn the beginning of the book the author mentions that when he had interviewed Che Guevara's mother she revealed that Che was born on May 14, 1928. I had always assumed Che was born on June 14, 1928 as that's what his Wikipedia page says and everyone celebrates his birthday on June 14. Apparently Che's mother had his birthdate on his birth certificate altered because her and Che's father had conceived him out of wedlock and to avoid having a scandal she altered\nChe's birthdate. The author treats this claim as truth but I am not sure if it is. Most people seem to accept June 14 as Che’s birthday.\n\nWas Che really born on May 14 or is this just an unverifiable claim by Che’s mother?",
        "created_utc": 1678166510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Donald Trump gets angry on MSNBC",
        "author": "Krishna-Bhaktidasa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kq53v/donald_trump_gets_angry_on_msnbc/",
        "text": "",
        "created_utc": 1678166309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Che Guevara’s birthday really on June 14, 1928?",
        "author": "WeeklyAd3076",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kpxx7/was_che_guevaras_birthday_really_on_june_14_1928/",
        "text": "Hello all, so last week I watched a really great documentary series on Netflix called the Cuba Libre Story. The series does a really great in depth overview of Cuba's history. One of the figures featured a lot in the series was Che Guevara.\nBefore watching the series I only knew a little bit about Che Guevara. After watching the series I decided I wanted to learn more about Che.\nA couple of days ago I started reading a book called Che: A Revolutionary Life by Jon Lee Anderson. I am only half way through the book, but so far I think it's great. The book really goes in depth about Che's life.\nIn the beginning of the book the author mentions that when he had interviewed Che Guevara's mother she revealed that Che was born on May 14, 1928. I had always assumed Che was born on June 14, 1928 as that's what his Wikipedia page says and everyone celebrates his birthday on June 14. Apparently Che's mother had his birthdate on his birth certificate altered because her and Che's father had conceived him out of wedlock and to avoid having a scandal she altered\nChe's birthdate.\n\nWhat I am confused about is that the book I am reading is one of the most popular biographies on Che Guevara so I feel that it should be common knowledge that Che's birthday is on May 14 not June 14, but most people still accept June 14 as his birthday. Why is this?",
        "created_utc": 1678165748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question About Che Guevara",
        "author": "WeeklyAd3076",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kpsxj/question_about_che_guevara/",
        "text": "[removed]",
        "created_utc": 1678165342,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the burial/cremation rites for Eta-hinin of Japan?",
        "author": "throwawayaccount3372",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kpjv4/what_were_the_burialcremation_rites_for_etahinin/",
        "text": "",
        "created_utc": 1678164662,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did the Aztecs, Inca and other Amerindian tribes think of the Africans who sometimes accompanied the Spanish and Portuguese conquistadors to the New World? Did they view them in the same light?",
        "author": "Smash_all_States",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kp9q9/what_did_the_aztecs_inca_and_other_amerindian/",
        "text": "",
        "created_utc": 1678163871,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Eighty Years War allegedly represented an “enlightened” religiously tolerant revolution in the Netherlands; how did Dutch Jews feel about it?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kouzd/the_eighty_years_war_allegedly_represented_an/",
        "text": "",
        "created_utc": 1678162731,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the original finish on a bronze Roman arrowhead?",
        "author": "TolkienBookshelf",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kof0v/what_was_the_original_finish_on_a_bronze_roman/",
        "text": "Hello, I'm curious what the original \"like new\" finish would have been on a bronze Roman rhombic arrow head? The reason I ask is because I have a piece and would like a blacksmith to replicate a like new version to compare it to and I would like it to be as period correct as possible!\n\nAlso would the tang have the same finish as the flats on the head? Would the edges be sharpened?\n\nThank you for taking time to answer my question!",
        "created_utc": 1678161530,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roman Arrowheads…",
        "author": "TolkienBookshelf",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kocas/roman_arrowheads/",
        "text": "[removed]",
        "created_utc": 1678161313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Antarctic Exploration - Best books",
        "author": "ntderoos17",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11knsas/antarctic_exploration_best_books/",
        "text": "[removed]",
        "created_utc": 1678159770,
        "upvote_ratio": 1.0
    },
    {
        "title": "[META] Could we adjust the default RemindMeBot to use a longer period, such as five or seven days?",
        "author": "n0tqu1tesane",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11knqry/meta_could_we_adjust_the_default_remindmebot_to/",
        "text": "I've been sorting by \"new\" for longer than I remember, and so I often use the \"[Click] Here for RemindMeBot\" in the AutoMod message.\n\nI've noticed that many posts go unanswered much longer than two days, and usually manually change it to seven.  Has there been any sort of study on the time it takes to answer questions, either the average or median?  I would think either of those numbers would be a better choice for the bot.",
        "created_utc": 1678159658,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m looking for a more solid connection to my relation with a former PA Attorney General. Is Ancestry my best bet? I feel like I’m hitting a roadblock.",
        "author": "SMILEY_ATTACK",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11knqiy/im_looking_for_a_more_solid_connection_to_my/",
        "text": "\nI started a family tree on Ancestry. when I discovered a short biographical write up from a great uncle of mine, David C. Hensal. talking about his relation to the PA attorney general WU Hensel. From what I can tell, the linage came from the Lancaster area, to the Clearfield County area. The only issue with that is I can’t seem to find much more info that really solidifies this claim. Is Ancestry my only option? I’d really appreciate any advice I feel like I’m driving myself crazy!",
        "created_utc": 1678159637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were other groups other than African Americans given reparations?",
        "author": "grumpypeasant",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kn8wi/were_other_groups_other_than_african_americans/",
        "text": "Hi\n\nI received the following [tweet](https://mobile.twitter.com/TyreeBP/status/691369923956740096/photo/1) from a black acquaintance of mine. There is an obvious political bent to the text, but I wanted to understand if there is any basis in fact. To be clear (I can’t believe it’s necessary to say this): this is not a dog-whistle for racism, or slavery denial, or what-aboutism. My personal opinion is that African Americans deserve some form of reparations or at least concerted economic action to compensate for slavery and the system racism that still oppresses them. My question is rather about historical accuracy: I was unaware of any reparations made to Japanese Americans as an example and I couldn’t find information about it online",
        "created_utc": 1678158310,
        "upvote_ratio": 1.0
    },
    {
        "title": "History of reparation payments",
        "author": "grumpypeasant",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kmy7r/history_of_reparation_payments/",
        "text": "[removed]",
        "created_utc": 1678157526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Curry in British North America",
        "author": "thaBombignant",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kme6b/curry_in_british_north_america/",
        "text": "[removed]",
        "created_utc": 1678156130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any documented cases of a serial killer or a mass killer in Ancient Egypt?",
        "author": "Crowman556",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kmbrw/are_there_any_documented_cases_of_a_serial_killer/",
        "text": "I have heard of serial and mass killers in other ancient and medieval societies such as the Roman Empire, Ancient Greece, the Holy Roman Empire, and such, however, I have not heard or read of any cases in Ancient Egypt.  \nI will clarify when I say \"mass killing\" I mean an individual going on a rampage, not a state-organised massacre.\n\nAre there any documented cases of serial/mass killers in Ancient Egypt? Any sources?",
        "created_utc": 1678155963,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a woman living in a village in rural England in the late middle ages, I want more out of life than the lot of a peasant. what are my options, can I just pack up and move to a city or town?",
        "author": "Feisty-Voice6491",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kmblv/im_a_woman_living_in_a_village_in_rural_england/",
        "text": "",
        "created_utc": 1678155951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a woman in a late medieval or early modern Europe (let's say HRE) be able to attain membership in a guild or make a living as an artisan/craftsperson?",
        "author": "Feisty-Voice6491",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11km8ov/could_a_woman_in_a_late_medieval_or_early_modern/",
        "text": "",
        "created_utc": 1678155749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why were city state republics so common in Italy but rare in the HRE which also featured many city states?",
        "author": "TastyCash4",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11km0ww/why_were_city_state_republics_so_common_in_italy/",
        "text": "",
        "created_utc": 1678155216,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you determine where ancient \"borders\" where? What sort of sources do you rely on?",
        "author": "dammir97",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11klctn/how_do_you_determine_where_ancient_borders_where/",
        "text": "I know hard borders weren't entirely a thing in ancient times, but when sort of reasoning goes into making the borders on a historical map? I was thinking about making a historic map for a project, but I can't find any authoritative source to base my boundaries on.",
        "created_utc": 1678153544,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long did the ground battles in the American civil war last?",
        "author": "Hasan_al-Askrai",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kl53r/how_long_did_the_ground_battles_in_the_american/",
        "text": "So you got 2 sides walking at each other say 50 walking paces, then they start shooting, How long did it last? I know they only carried a usually max of 50 rounds and black powder fowled the guns and needed cleaning before then.\n\nWas there an agreement, of say 8 am we meet by the oak trees and shoot it out? or more of counter movement until forced to fights?",
        "created_utc": 1678153018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Alexander the Great use the title Khshayathia?",
        "author": "RoyalPeacock19",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kkzw6/did_alexander_the_great_use_the_title_khshayathia/",
        "text": "Did Alexander the Great use the title Khshayathia as ruler of Iran, or would he be known as Khshayathia by his Iranian subjects?",
        "created_utc": 1678152670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't 18th-19th century ships have more fish for the provisions?",
        "author": "AirportWonderful4840",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kjc2w/why_didnt_18th19th_century_ships_have_more_fish/",
        "text": "I've gotten interested in maritime history from that period, and I noticed I see mostly preserved land meat. I always wondered why they didn't serve more fish, as it seems that would've been the most efficient thing to do if they were at sea for months at a time",
        "created_utc": 1678148599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Jimmy Carter particularly unpopular in the Western United States?",
        "author": "Vertjoublie",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kj5ne/was_jimmy_carter_particularly_unpopular_in_the/",
        "text": "One thing I’ve heard multiple times about the presidency of Jimmy Carter is that he was known to be “insensitive to western states’ issues”. However I’ve never heard exactly what those ‘issues’ are. Is this claim true, and ‘issues’ are they likely referring to?",
        "created_utc": 1678148179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historian Shelby Foote claims that the cause of the civil war was \"A failure to compromise\"...how accurate is that though?",
        "author": "BlueJDMSW20",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11kj3vj/historian_shelby_foote_claims_that_the_cause_of/",
        "text": "",
        "created_utc": 1678148063,
        "upvote_ratio": 1.0
    }
]