[
    {
        "title": "Was the league of nations helpfull in even a single instance?",
        "author": "Upper-Preparation-14",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110pab4/was_the_league_of_nations_helpfull_in_even_a/",
        "text": "So personally I see the league of nations as more of a failed and older version of the united nations, that failed to provide the help it was supposed to give.\n\nWas there a single instance that it was actually helpful?\n\nAnd if yes, tell me :)",
        "created_utc": 1676233436,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did people clean their butts with before toilet paper?",
        "author": "pifire456",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110p8jk/what_did_people_clean_their_butts_with_before/",
        "text": "I'm not talking about like ancient history so much as I am referring to the last 1000 years. Honestly I can't imagine a world without toilet paper, it would be so unpleasant to do it almost any other way. Did people just not wipe? Can someone even do that?",
        "created_utc": 1676233308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since when do public defenders exist?",
        "author": "Logan_Maddox",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110owtq/since_when_do_public_defenders_exist/",
        "text": "In The Cheese and the Worms, in 1597, during his second trial, Menocchio is \"court appointed a defender, Agostino Pisensi\", even though Menocchio's son had had to hire a lawyer in the first trial.\n\nWhat's up with that? Was Agostino Pisensi a public defender? Was he being paid by the Catholic Church? And from whence does the practice of having a public defender comes from?",
        "created_utc": 1676232493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Roman Empire really Italian?",
        "author": "turkisblunder",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110opd8/was_roman_empire_really_italian/",
        "text": "Roman Empire was Latin and considering the Italia as the only descanded country and connecting it with Romans feels odd to me. Like saying Gokturk Empire Turkish. There was no separation between Turks when the Empire existed, so it's all Turkic countries and peoples common heritage, not only Turkey. I consider same thing for Roman Empire, am I wrong?",
        "created_utc": 1676231986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why wasn't the nazi party officially dissolved until October of 1945 and what was going on with it between the end of the war and dissolution?",
        "author": "ellierosefucker69",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110olrj/why_wasnt_the_nazi_party_officially_dissolved/",
        "text": "",
        "created_utc": 1676231715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Court rejuvenation in the Bakumatsu period - How?",
        "author": "LengthinessRemote562",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110oes5/court_rejuvenation_in_the_bakumatsu_period_how/",
        "text": " So I read \"The Collapse of the Tokugawa Bakufu, 1862-1868\" by Totman (this is in regards to the example from xx/xxi, and the rise of court power is something I've been thinking about in general). I've been wondering: How did the court regain political influence? I'm aware that they gave some legitimacy to the bakufu regime and were therefore kept somewhat afloat but I don't know where they drew their power from. AFAIK they did not hold land and didn't have a han to administer to draw taxes from. The emperor hadn't been a real ruler for centuries and the court sometimes even had to starve.\n\nAnd the book mentioned the court exerting pressure on the bakufu and trying to force it into subordination without any explanation as to 1) how it worked, and 2) why the court thought it'd work.\n\nThe only thing I'm aware of is, that after Hotta Masayoshi's predecessor Abe Masahiro's death, who was far more adept at political maneuvering, Hotta had to take over as *Rōjū* *shuseki* \\- chief councilor. He then was hard-pressed when Townsend Harris arrived and demanded privileges of travel and residence, which was sharply opposed, but he acquiesced in 1857. In 1858 he tried and failed, to secure court approval of the treaty (why did he want court approval?), which supposedly was the reignition of the court's political activity and led to the loss of faith in him.\n\nWhy did he try to get court approval? - Were children thought to respect the court or something? I'm honestly just very confused.",
        "created_utc": 1676231202,
        "upvote_ratio": 1.0
    },
    {
        "title": "“These Are Sparta's Walls” To quote Lycurgus, lawgiver of Sparta, “A city is well-fortified which has a wall of men instead of brick”. This is the quote I keep hearing or reading in various sources across the internet. How historically accurate is that?",
        "author": "Garrettshade",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110oeo1/these_are_spartas_walls_to_quote_lycurgus/",
        "text": "I keep reading in popular sources, memes, or other kinds of po culture, that Spartans considered the warriors as its walls, not having actual walls. How real was that? Did Sparta really have no walls? If true, was it because of pride and martial skill? Did this approach fail them? Other than in the known Leonidas/Xerxes encounter. Were there other Greek or non-Greek city states without walls at the time? \n\nAs far as I recall, if a city lost a war, usually the victors ordered razing of fortifications to the ground. But maybe, it was later, or near-Medieval thing...",
        "created_utc": 1676231193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given the number of air hijackings and potential for even worse crimes, why was airport security so lax before 9/11? Did anyone raise concerns regarding this?",
        "author": "0xE4-0x20-0xE6",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110oaiq/given_the_number_of_air_hijackings_and_potential/",
        "text": "",
        "created_utc": 1676230900,
        "upvote_ratio": 1.0
    },
    {
        "title": "What influence (if any) did the rise and fall of social democracy have on fashion?",
        "author": "Available_Market9123",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110nz9t/what_influence_if_any_did_the_rise_and_fall_of/",
        "text": "",
        "created_utc": 1676230111,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was rule under Vichy France like for non-french minorities, e.g Occitan, Basque and Breton speakers?",
        "author": "PassoverGoblin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110nevx/what_was_rule_under_vichy_france_like_for/",
        "text": "",
        "created_utc": 1676228635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every old culture drank, that we know, but I rarely hear about people being hang over in history. Any writings/stories about that?",
        "author": "de9sem",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110msyr/every_old_culture_drank_that_we_know_but_i_rarely/",
        "text": "",
        "created_utc": 1676227060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for bibliography on Toledo, Spain",
        "author": "quotienscumque",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110mmm0/looking_for_bibliography_on_toledo_spain/",
        "text": "[removed]",
        "created_utc": 1676226625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whose idea was the March 1945 firebombing of Tokyo?",
        "author": "StrawberrySyphilis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110mix6/whose_idea_was_the_march_1945_firebombing_of_tokyo/",
        "text": "Did a young Robert McNamara have anything to do with the planning?",
        "created_utc": 1676226375,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were casualty rates like on the Western Front in WW2?",
        "author": "8cuban",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110mi9b/what_were_casualty_rates_like_on_the_western/",
        "text": "News of the war in Ukraine routinely reports casualty rates in the 200-500 losses per day for both sides, sometimes higher.  The UK MoD today reported that Russia’s been suffering an average of 800 casualties per day for several weeks and just took over 1,100 casualties this weekend in their highest single day loss to date. \n\nThese kinds of daily loss rates boggle my mind and seem unsustainable. It got me wondering - what we’re casualty rates like for both sides on the Western Front after D-Day?",
        "created_utc": 1676226329,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much did Christianity influenced war tactics and mindset of the Byzantine Empire compare with other medieval kingdoms like France or England?",
        "author": "rip_ripley",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110m4pg/how_much_did_christianity_influenced_war_tactics/",
        "text": "I've just read in a medieval history book by Tom Holland that the Byzantine Empire during the X-XI century was hesitant to fight even in defensive wars because of Christian believes. \n\nWas this accurate? If so, so much it has to do with Christianity instead of court culture or economics?",
        "created_utc": 1676225399,
        "upvote_ratio": 1.0
    },
    {
        "title": "How different would Indian history be if the use of Printing Press became widespread after its introduction in the 1540s?",
        "author": "TheIronDuke18",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110m33y/how_different_would_indian_history_be_if_the_use/",
        "text": "In Europe, the Printing Press led to dramatic spread of ideas. Societal changes in European history like the Reformation and Enlightenment is often credited to the widespread use of the Printing Press. What if Indians started using the Printing Press just after its introduction by the Portuguese in the 1540s? Weve seen in Indian history that there has been several social reform movements since antiquity in India. However these movements were never able to replace mainstream caste Hindu society? Would the Printing Press ensure social reform movements like the Bhakti and Sufi Movements aswell as Sikhism be more widespread and mainstream? Would traditional caste society of the time completely get replaced by an egalitarian society which would be a result of these social movements?",
        "created_utc": 1676225286,
        "upvote_ratio": 1.0
    },
    {
        "title": "18th Century inheritance process: did it involve a member of the legal profession? Regarding a fiction set mid C18th: A widow has just died and the estate is to be inherited by her daughter, an only child. Would the inheritance be handled by an attorney and could therefore be delayed by him?",
        "author": "c1748_or_Thereabouts",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110lf2h/18th_century_inheritance_process_did_it_involve_a/",
        "text": "",
        "created_utc": 1676223642,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Little House books by Laura Ingalls-Wilder give an idealized look at pioneer life from the perspective of a white settler. Which books should I read to expand my understanding of the pioneer times that she lived in?",
        "author": "towalktheline",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110lbut/the_little_house_books_by_laura_ingallswilder/",
        "text": "Beyond that, I'm having trouble mentally building an idea of the world around her. She's after the American Revolution since they make mention of it, but there's no real mention of slavery or details about the displacement of indigenous people. Laura in the books seems to live in a bubble where people succeed or fail purely by the sweat of their brow and determination to succeed. Was slavery not common for pioneers who were travelling?\n\nI'm interested in both history books and primary sources to read for this (I'm doing a self-imposed deep dive of the little house series).",
        "created_utc": 1676223416,
        "upvote_ratio": 1.0
    },
    {
        "title": "If someone had wanted to assassinate Henry VIII. what kind of security would they have had to get through?",
        "author": "Jerswar",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110l4ir/if_someone_had_wanted_to_assassinate_henry_viii/",
        "text": "",
        "created_utc": 1676222903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any truth to the idea that Russia gave Ukraine the Crimea but it was for concessions that Russia received in other territories nearby?",
        "author": "Competitive_Scale736",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110l01a/any_truth_to_the_idea_that_russia_gave_ukraine/",
        "text": "Thx.",
        "created_utc": 1676222590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is America so much more car-dependent than Europe?",
        "author": "Okepolo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110kxyi/why_is_america_so_much_more_cardependent_than/",
        "text": "",
        "created_utc": 1676222449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Chinese support for the Japanese invasion in the form of the Wang Jingwei regime etc, just pure pragmatism. Was the much actual Nipponophilia at that time?",
        "author": "HugeMistache",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110k2kx/was_chinese_support_for_the_japanese_invasion_in/",
        "text": "",
        "created_utc": 1676220281,
        "upvote_ratio": 1.0
    },
    {
        "title": "How industrialized was paraguay before the war of the triple alliance?",
        "author": "Fun_Scar_6275",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110k0r0/how_industrialized_was_paraguay_before_the_war_of/",
        "text": "i read it was a myth created around the 90's that paraguay was this super industrialized country before the war with no illiteracy? is this also true?",
        "created_utc": 1676220147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Canada join NATO and NORAD? Why didn’t they remain neutral?",
        "author": "Dependent-Ad2941",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110jn39/why_did_canada_join_nato_and_norad_why_didnt_they/",
        "text": "After all, it’s not like the US was going to let Canada be annexed by anyone..",
        "created_utc": 1676219187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did the Aztecs hold their captives of war?",
        "author": "Zestyclose-Egg-4582",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110jcy1/where_did_the_aztecs_hold_their_captives_of_war/",
        "text": "",
        "created_utc": 1676218474,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the Roman Era, Sparta was able to really cash in on its reputation. Was Boeotia in Roman times able to do the same when it came to the reputation of Thebes and Epameinondas in any way?",
        "author": "TheHondoGod",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110j6f0/in_the_roman_era_sparta_was_able_to_really_cash/",
        "text": "",
        "created_utc": 1676218012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank you to the podcast",
        "author": "Achida",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110ivzo/thank_you_to_the_podcast/",
        "text": "[removed]",
        "created_utc": 1676217294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did any historical figures inspire Zorro?",
        "author": "f0rgotten",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110idjw/did_any_historical_figures_inspire_zorro/",
        "text": "I grew up watching the late 50's _Zorro_ TV show and recently rediscovered it on a streaming service. It is interesting how this character inspired the superhero with a \"mild mannered\" alterego, but did any actual historical figures inspire Zorro?",
        "created_utc": 1676215926,
        "upvote_ratio": 1.0
    },
    {
        "title": "there were ancient civilizations before us?",
        "author": "franzknife2",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110icth/there_were_ancient_civilizations_before_us/",
        "text": " Hi, in this period I’m seeing lots of shorts and videos of a famous  podcast (the podcast is created by Joe Rogan) about the pyramids:  basically this man and others were saying that before Egypt and  Mesopotamia there were ancient advances civilisations that have built  the pyramids and other things like the heads of the Easter island and  that all of these populations died for a natural disaster like a  meteorite. I’m sorry if you don’t understand some of the things I wrote,  I will be happy to try to explain them better if you need.",
        "created_utc": 1676215878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient civilization and pyramids",
        "author": "franzknife2",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110i9ym/ancient_civilization_and_pyramids/",
        "text": "[removed]",
        "created_utc": 1676215675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Ancient Greece considered the bedrock of Western Democracy instead of the Roman Republic?",
        "author": "homeless_knight",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110i8qq/why_is_ancient_greece_considered_the_bedrock_of/",
        "text": "",
        "created_utc": 1676215585,
        "upvote_ratio": 1.0
    },
    {
        "title": "In HBO's Rome, Vorenus mentions a few men from years ago. How aware would a man of his situation be of the grachii brothers and Cincinnatus ?",
        "author": "gizmouth",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110hurd/in_hbos_rome_vorenus_mentions_a_few_men_from/",
        "text": "Hello everyone,\n\nRecently I watched HBO's Rome and this quote from Lucius Vorenus struck me as odd : \n\n\n(paraphrased)  \"do you think the Grachii brothers, Marius or Cincinnatus would have done it [crossing the Rubicon] ?\"\n\n\nVorenus is a plebeian with what I assume is little access to education. Being young, he would have been quite removed from the Grachii. How plausible is it that he knew of their political careers and their ideology ? In general, how aware would a commoner in the late republic be of the politics of the past ?",
        "created_utc": 1676214555,
        "upvote_ratio": 1.0
    },
    {
        "title": "WWII Trying to identify a photo of an aircraft \"Miss Pat\" and a person on board",
        "author": "CatHerder29",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110h4jh/wwii_trying_to_identify_a_photo_of_an_aircraft/",
        "text": "[removed]",
        "created_utc": 1676212568,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s an event, figure, or moment in history that displays perseverance?",
        "author": "Unknoooown",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110gq04/whats_an_event_figure_or_moment_in_history_that/",
        "text": "",
        "created_utc": 1676211428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any place where I can find records of archaeological digs (specifically grave sites or cemetaries) in Ptolemaic/Roman Egypt?",
        "author": "IronDuke1809",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110gova/is_there_any_place_where_i_can_find_records_of/",
        "text": "For an essay I'm writing on the economic history of Ptolemaic/Roman Egypt I'm trying to find records from excavations of grave sites to use as data. I looked around quite a bit but can't really find anything.\n\nI'm specifically looking for reports of archaeological excavations of grave sites or cemeteries from roughly the 4th century BC to the 4th century CE around Alexandria, Cyrene or other prominent sites in those regions. especially reports containing the inventory of graves and their sizes etc. would be great.\n\nany help whatsoever would be greatly appreciated.",
        "created_utc": 1676211339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sunday Digest | Interesting &amp; Overlooked Posts | February 12, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110gd46/sunday_digest_interesting_overlooked_posts/",
        "text": "[Previous](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22+OR+title%3A%22Day+of+Reflection%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\nToday:\n\nWelcome to this week's instalment of [/r/AskHistorians](https://www.reddit.com/r/AskHistorians)' Sunday Digest (formerly the Day of Reflection). Nobody can read all the questions and answers that are posted here, so in this thread we invite you to share anything you'd like to highlight from the last week - an interesting discussion, an informative answer, an insightful question that was overlooked, or anything else.",
        "created_utc": 1676210409,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the purpose of shield-lile ears on ships?",
        "author": "an_actual_human",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110ffro/what_is_the_purpose_of_shieldlile_ears_on_ships/",
        "text": "I've seen [a picture of old ship models with shield-like \"ears\"](http://www.euro-t-guide.com/See_Photo/Holland/Amsterdam/Nederland_Maritime_Museum_2012_04.jpg). Could anyone tell me what is their purpose, how they are called and why one doesn't see them on newer yachts anymore?",
        "created_utc": 1676207579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Military and Commodity history book recommendations?",
        "author": "TallConsequence8202",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110fewf/military_and_commodity_history_book/",
        "text": "Title says most 😌. \n\nI hold a masters in history but I work in far left political media atm (yay for building socialism!) and am looked out of most scholarly publications due to not being in school 💔. I miss history terribly and am also looking to round myself out. \n\nI specialized in religious and cultural history in the US and I am weak on nuts and bolts military history, I would like to round myself out by exploring this topic. Both for fun and because imo it will bolster my ability to write about foreign conflict and understand war’s development over time. \n\nBooks focused on US western expansion would be ideal but I will take most regions. Dense is preferred for me, I like feeling intimate with the source material. \n\nThanks gang :)",
        "created_utc": 1676207496,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a prospective uni student in medieval Europe. How would I go about looking for the right university for me, and how much variety would there be between different courses?",
        "author": "EldritchTaxCollector",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110fdgf/im_a_prospective_uni_student_in_medieval_europe/",
        "text": "Basically the title - if I wanted to become a student, how easy would it be? If I wanted to study a specific subject, such as maths, could I find a place that would teach me only that?",
        "created_utc": 1676207371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did General Howe go through the Chesapeake instead of the Delaware to get to Philadelphia?",
        "author": "Mr_thiccums05",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110f2nf/why_did_general_howe_go_through_the_chesapeake/",
        "text": "During the American revolution why did Howe decide to go up the Chesapeake bay instead of the Delaware bay to attack Philadelphia?",
        "created_utc": 1676206434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there clearly defined boundary lines separating people who do and do not wear kohl eyeliner?",
        "author": "omfalos",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110f07b/are_there_clearly_defined_boundary_lines/",
        "text": "It seems like in general that Muslims, Hindus, and practitioners of traditional Middle Eastern religions do wear kohl, while Romans, Byzantines, Syriac Christians, Coptic Christians and Mizrahi Jews have never worn kohl. Is that more or less correct?",
        "created_utc": 1676206215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who Was Reading William Forster Loyd's Lectures?",
        "author": "Dwood15",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110evyj/who_was_reading_william_forster_loyds_lectures/",
        "text": "And how did they play into the British policies of the era?\n\nAdditional questions:\nDid he ever talk/write about Ireland specifically? Did he encourage policies which led to the Great Famine?",
        "created_utc": 1676205813,
        "upvote_ratio": 1.0
    },
    {
        "title": "historical artifacts",
        "author": "NeedleworkerNo631",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110eocs/historical_artifacts/",
        "text": "[removed]",
        "created_utc": 1676205093,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the economic gains of invading another nation other than natural resources in history?",
        "author": "man204080",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110eemx/what_were_the_economic_gains_of_invading_another/",
        "text": "",
        "created_utc": 1676204169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prior to the US buying Alaska, what was it like for the Russian subjects living there?",
        "author": "rollsyrollsy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110e2u3/prior_to_the_us_buying_alaska_what_was_it_like/",
        "text": "And, did those same residents become US citizens after the sale of the territory was completed?",
        "created_utc": 1676203026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was The Alamo used as a private commercial warehouse post Texas-Mexican War? What led to it transitioning into a historic building? Did the shrinkage of The Alamo’s footprint contribute to any of this?",
        "author": "ApocApollo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110c71b/why_was_the_alamo_used_as_a_private_commercial/",
        "text": "",
        "created_utc": 1676195945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to know about the humanist side of V.I. Lenin, if any",
        "author": "pooraudiophile1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110c4t4/trying_to_know_about_the_humanist_side_of_vi/",
        "text": "[removed]",
        "created_utc": 1676195691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't the western entente use their naval supremacy to attack the northern trenches with naval support?",
        "author": "aronbang",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110bwig/why_didnt_the_western_entente_use_their_naval/",
        "text": "This question got me thinking, couldn't a northern offensive be pulled of this way? Surely they had the range a good way inland.",
        "created_utc": 1676194806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since 1922, When were the Irish defense forces at their most capable?",
        "author": "Saoi_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110bu8c/since_1922_when_were_the_irish_defense_forces_at/",
        "text": "In numbers or equipment, when were the DF most prepared for conflict, for example, after the civil war or during The Emergency?",
        "created_utc": 1676194552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mark Chapter 5 tells the story of Jesus driving the demon Legion into a herd of two thousand pigs. Is there evidence of herds that big at the time? Would they have been owned by one farmer or collectively?",
        "author": "AxonBasilisk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110bq2i/mark_chapter_5_tells_the_story_of_jesus_driving/",
        "text": "Furthermore, were pigs commonly farmed in Judea in the time period? Didn't most people there follow the rules of Leviticus that banned the consumption of swine?",
        "created_utc": 1676194118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who broke the Sphinx’s nose?",
        "author": "LegitVirusSN",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110boj6/who_broke_the_sphinxs_nose/",
        "text": "",
        "created_utc": 1676193942,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were medieval royal betrothal customs like, and how were they celebrated? For example was there a special kind of food made?",
        "author": "BazzemBoi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110blmy/what_were_medieval_royal_betrothal_customs_like/",
        "text": "Question",
        "created_utc": 1676193623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mark Chapter 5 tells the story of driving the demon Legion into a herd of two thousand pigs",
        "author": "AxonBasilisk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110bkri/mark_chapter_5_tells_the_story_of_driving_the/",
        "text": "[removed]",
        "created_utc": 1676193529,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common was it for married couples to live apart in medieval England?",
        "author": "naughty_yorick",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110b861/how_common_was_it_for_married_couples_to_live/",
        "text": "I'm currently reading *Ale, Beer and Brewsters in Medieval England* by Judith M Bennett and she mentions that some brewsters were \"wives who, for whatever reason, lived apart from their husbands\" in the 14th Century.\n\nDoes anyone have any further information or sources on women and couples like this? I'm specifically interested in class status and whether or not this practice would be reserved solely for lower class couples or if nobility could also choose to marry but live apart.\n\nFor more context, I'm wondering if a noblewoman (the wife of a Lord for example) could live apart from him entirely (and perhaps even run her own business, as that's what I'm currently researching), or if that would be seen as unsuitable as it would be getting in the way of the more important business of running a home/producing heirs.",
        "created_utc": 1676192134,
        "upvote_ratio": 1.0
    },
    {
        "title": "ZkSync token is confirmed",
        "author": "Issam_was_taken",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110aegk/zksync_token_is_confirmed/",
        "text": "[removed]",
        "created_utc": 1676188711,
        "upvote_ratio": 1.0
    },
    {
        "title": "What motivated Samurai, Daimyo and commoners to fight for the Shogun during the Meiji Restoration?",
        "author": "Damman456",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110addg/what_motivated_samurai_daimyo_and_commoners_to/",
        "text": "Hello historians,\n\nCurrently doing a lot of research on the Meiji Restoration and Bosnian War, but one thing keeps bugging me:\n\n- Why would people oppose the Emperor and support the Shogun?\n\nIt takes some convincing and the need of a narrative to motivate people to fight for yo, whether that be the normal foot soldier or other political actors. The pro-imperial faction seems to be driven by modernists, nationalism and dissatisfaction with an inefficient government. I cant seem to find what narrative or legitimacy the pro-Shogun forces told themselves to legitimise their actions.\n\nHope my question is clear : ) Thanks in advance",
        "created_utc": 1676188587,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come academia in Europe and the us never got to study the real reason behind Japan's isolationism?",
        "author": "gmellotron",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110a5fy/how_come_academia_in_europe_and_the_us_never_got/",
        "text": "There is an evidence that it happened simply because of Hideyoshi knew that Portuguese merchants and missionaries were secretly trading Japanese people(about 50k) as slaves but in Europe the subject is not even allowed to study this. Why is that?",
        "created_utc": 1676187637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, just a quick question about naval warfare.",
        "author": "Waloposauritus",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110912p/hello_just_a_quick_question_about_naval_warfare/",
        "text": "[removed]",
        "created_utc": 1676183319,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was life like for Southern judges during the Civil Rights movement?",
        "author": "Neat_Butterscotch976",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1109098/what_was_life_like_for_southern_judges_during_the/",
        "text": "Even the most cursory reading of the Civil Rights movement in America learns the crucial role judges played. Every time a desegregation ruling - say Brown v. Education - was handed down, it was local judges that enforced them. But what was the quality of life for said judges? After all, they lived in the South, their shopping trips and movie escapades meant interaction with those who, most likely, hated them for their rulings. Does anyone know how they (individually or as a class) survived?",
        "created_utc": 1676183231,
        "upvote_ratio": 1.0
    },
    {
        "title": "A TALE OF TWO PAINTINGS",
        "author": "gtasoul",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1108tgc/a_tale_of_two_paintings/",
        "text": "",
        "created_utc": 1676182536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the scope of WW2 fully known as the events unfolded?",
        "author": "Big-Piccolo-3943",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11083d2/was_the_scope_of_ww2_fully_known_as_the_events/",
        "text": "So to clarify we’re all parties aware of each allied action? Were they mostly allies per say or just shared a common enemy? I’m generally aware of our situation with Russia but the fighting engulfed large parts of the world so it seems like chaos. Maybe to concentrate this all was America aware of all that happened as it unfolded or did we find out truly out until the smoke settled.\n\nI will respond more if I am not saying this right.",
        "created_utc": 1676179922,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Hideki Yukawa spoke such good english?",
        "author": "Frigorifico",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1107snr/how_did_hideki_yukawa_spoke_such_good_english/",
        "text": "I was reading some of the papers Yukawa wrote, and I realized these weren't translations from Japanese, but rather he wrote them in English himself\n\nI find this surprising because to learn english I depended on consuming media en english, like songs, books and movies, and speaking with native speakers, but Yukawa couldn't do much of those things. Could he listen to english songs on the radio? Could he watch movies in english? Was there any native english speaker to help him practice? I guess the only thing he could do was read books in english, but apparently he gave conferences and he had a good pronunciation, and books do not help with that\n\nHow did he learn english? What kind of education did he have on the english language and why was it so effective?",
        "created_utc": 1676178809,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good starting point for reading about Latin American history from the 40s to the 60's?",
        "author": "ragboy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11077ve/what_is_a_good_starting_point_for_reading_about/",
        "text": "I'm starting to research post-colonialism around the world -- essentially during and the years directly after WWII. I want to understand how Latin America was influenced by countries around the world declaring independence from their traditional colonial masters. I'm kind of at a loss where to start.",
        "created_utc": 1676176808,
        "upvote_ratio": 1.0
    },
    {
        "title": "What hats were really most common in the Wild West?",
        "author": "javerthugo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11074u2/what_hats_were_really_most_common_in_the_wild_west/",
        "text": "My understanding is that most “cowboy hats” seen in tv and movies weren’t really that common, what kind of hats we’re actually common?",
        "created_utc": 1676176515,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Roman Israel, how were ethnic Jews who converted to Roman polytheism treated?",
        "author": "Flunkiebubs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1106mr1/in_roman_israel_how_were_ethnic_jews_who/",
        "text": "",
        "created_utc": 1676174808,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the first \"tool\" widely used by proto-humans? For example is there a scientific/historical/rational reason to assume a rock rather than a stick would have been more likely?",
        "author": "caldermuyo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1106kyo/what_was_the_first_tool_widely_used_by/",
        "text": "Yes, obviously this could not be more \\*pre\\*-historic rather than historic, but is there an overlap between paleoanthropology and the study of history?",
        "created_utc": 1676174636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the German imperialist and colonialist experience in sub-Saharan Africa before WWI play any role in laying the groundwork for the Nazi Holocaust?",
        "author": "Elbrujosalvaje",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1106jbp/did_the_german_imperialist_and_colonialist/",
        "text": "Just something I've been wondering about for some time now. Is there any connection?",
        "created_utc": 1676174493,
        "upvote_ratio": 1.0
    },
    {
        "title": "What led Nixon, Arch-Republican, to found the Environmental Protection Agency and kick start so many important environmental acts?",
        "author": "TheHondoGod",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1106fo1/what_led_nixon_archrepublican_to_found_the/",
        "text": "",
        "created_utc": 1676174177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were the Westos people the first Indian slave traders in North American history?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1105u5r/were_the_westos_people_the_first_indian_slave/",
        "text": "They were this group of migrants, from the Lake Erie region if I understand it correctly, that drifted down to the mouth of the James river right when the English had set up their first colony. \n\nThey then became contract slavers for the British in exchange for guns and ammunition. \n\nSo, are they the first slavers in North American Native history? Or are there other examples I’m unaware of?",
        "created_utc": 1676172173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn’t the Continental Congress include representatives from Britain’s Canadian colonies? (New France, I think it was called at the time)",
        "author": "Altruistic-Tomato-66",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1105r5q/why_didnt_the_continental_congress_include/",
        "text": "",
        "created_utc": 1676171908,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the Arabs conquered the Sasanian Empire, did the people choose to accept Islamic rule or was the religion forced upon them?",
        "author": "Happy_Traveller_2023",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1105qt0/when_the_arabs_conquered_the_sasanian_empire_did/",
        "text": "",
        "created_utc": 1676171878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn’t the US just trade to remove missiles in Turkey to de-escalate the Cuban missile crisis?",
        "author": "Tommy_Wisseau_burner",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1105krh/why_didnt_the_us_just_trade_to_remove_missiles_in/",
        "text": "Outside of posturing and saving face over the bay of pigs disaster what benefit did having to go under the table to remove the Jupiter missiles? While I could see it as a political bargaining chip in the future by the Soviets formally doing it privately puts them in the same predicament geopolitically between governments",
        "created_utc": 1676171313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Before the Edo period, were there any societies/cultures in Japan that allowed peasants the right to own property (land) and the right to bear arms?",
        "author": "jacky986",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1105frb/before_the_edo_period_were_there_any/",
        "text": "I know this an unlikely scenario but is there any evidence that certain societies/cultures in Japan allowed peasants the right to own property (land) and the right to bear arms? So far all I could find was that during the Muromachi [period](https://www.britannica.com/place/Japan/The-Muromachi-or-Ashikaga-period-1338-1573#ref23153) confederations of villages joined together to own land and become self-governing until the leaders of these villages ended up becoming Daimyos and hoarded all the land and rice for themselves.",
        "created_utc": 1676170875,
        "upvote_ratio": 1.0
    },
    {
        "title": "What impact did Motown have on American society in the 1960s-1970s?",
        "author": "Expertees",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11056t3/what_impact_did_motown_have_on_american_society/",
        "text": " I’ve been listening to a lot of Motown recently and been doing a bit of research as a result. I was curious to know what impact did Berry Gordy’s Motown Label have on society in the 1960s from a Civil Rights, Societal and Crossover music perspective as I find it extremely fascinating.",
        "created_utc": 1676170080,
        "upvote_ratio": 1.0
    },
    {
        "title": "What impact did Motown have on American society in the 1960s-1970s",
        "author": "Expertees",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1105597/what_impact_did_motown_have_on_american_society/",
        "text": "[removed]",
        "created_utc": 1676169936,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would a Roman legion marching North through open ground in Europe react to being surprised by a storm? Would they stop marching? How lethal (if at all) can a storm be?",
        "author": "GlumTown6",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1104ulv/how_would_a_roman_legion_marching_north_through/",
        "text": "By lethal I mean if encountering a storm could cause people to die of illness or something of the sort.",
        "created_utc": 1676169027,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Nintendo Entertainment System and the FamilCom featured games so maddeningly difficult that the term \"Nintendo Hard\" persists to this day. Were there specific cultural, strategic, or other reasons that game designers chose to make NES/FC games so famously difficult?",
        "author": "The-Voice-Of-Dog",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1104p4x/the_nintendo_entertainment_system_and_the/",
        "text": "(To this day I am accused of being a liar when I share that I beat Bionic Commando because of the persistent myth that the game was so difficult they never bothered to code an ending.) Thanks!",
        "created_utc": 1676168540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are audio books a newer idea? Before recording technology, did people (specifically working class, not those with servants and leisure time) take in a significant amount of literature by having someone read aloud while they did paper-incompatible tasks like washing?",
        "author": "Harachel",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1104iey/are_audio_books_a_newer_idea_before_recording/",
        "text": "",
        "created_utc": 1676167957,
        "upvote_ratio": 1.0
    },
    {
        "title": "How successful were the reforms passed during LBJ’s presidency? And how did the typical American view them?",
        "author": "moonpig005",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11049is/how_successful_were_the_reforms_passed_during/",
        "text": "I am specifically interested in ones that targeted poverty but any information is welcome",
        "created_utc": 1676167190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Germany more aggresive in the 1930s or more aggresive before the first world war?",
        "author": "Cowlixthememewatcher",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110433h/was_germany_more_aggresive_in_the_1930s_or_more/",
        "text": "",
        "created_utc": 1676166629,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the real history of scurvy among pirates, sailers, and also why lemons?",
        "author": "Saferflamingo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/110416i/what_is_the_real_history_of_scurvy_among_pirates/",
        "text": "I am curious what we know about the history of scurvy. When did people figure out what caused it? Where did the association of scurvy and lemons come from?",
        "created_utc": 1676166467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are so many male European Royals depicted in an androgynous, almost effeminate fashion?",
        "author": "SociusConsors",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1103vrd/why_are_so_many_male_european_royals_depicted_in/",
        "text": "[removed]",
        "created_utc": 1676166002,
        "upvote_ratio": 1.0
    },
    {
        "title": "During ww2, did any of the resistance movements commit attacks against civilians from Axis countries?",
        "author": "Garrus37",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1103j1m/during_ww2_did_any_of_the_resistance_movements/",
        "text": "",
        "created_utc": 1676164944,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made this character on picrew and wanna know what Era she fits best in.",
        "author": "Rare_Cauliflower_693",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1103bhk/i_made_this_character_on_picrew_and_wanna_know/",
        "text": "[removed]",
        "created_utc": 1676164333,
        "upvote_ratio": 1.0
    },
    {
        "title": "On Wikipedia's page for Valkyrie names, both Göll and Hlökk have very different pronunciations yet they mean the same thing, why?",
        "author": "Ok_ResolvE2119",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1103b3i/on_wikipedias_page_for_valkyrie_names_both_göll/",
        "text": "",
        "created_utc": 1676164301,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would I go about finding information on a a ancestor who served in the US Civil War?",
        "author": "Historical-Jelly3605",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1103053/how_would_i_go_about_finding_information_on_a_a/",
        "text": "A ancestor of mine served in the civil war in the 1st Alabama Calvary Regiment. It was a southern union regiment. The extent I know about him is his name and that he was mustered in Rome Georgia in 1864. What are some resources I can use to get more in-depth information about him?",
        "created_utc": 1676163418,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the introduction of freezers affect the fishing and seafood industry? How did populations further inland react to these new frozen commodities which may have not been available to them before? Did seaside towns expand significantly to match increased demand for these seafood products?",
        "author": "ImaginationLocal8267",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1102zif/how_did_the_introduction_of_freezers_affect_the/",
        "text": "",
        "created_utc": 1676163362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ruins from the Roman Kingdom",
        "author": "Beautiful-Lawyer7127",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1102xws/ruins_from_the_roman_kingdom/",
        "text": "[removed]",
        "created_utc": 1676163227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Horatio Gates side with the burgeoning United States rather than his native Britain before and during the American War of Independence?",
        "author": "KatsumotoKurier",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1102typ/why_did_horatio_gates_side_with_the_burgeoning/",
        "text": "What motivated Gates not to side with Britain in the American War of Independence, given that he was both a career British military officer up to that point and a native Briton himself?",
        "created_utc": 1676162906,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the life of a young Edwardian gentleman look like?",
        "author": "thn00fld",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1102qem/what_does_the_life_of_a_young_edwardian_gentleman/",
        "text": "Picture an aristocratic English household like Downton Abbey, what does the daily life of the eldest son and heir look like? Or sons in general? How much different from the life of a daughter? Would older teenaged sons even live at their family’s estate?",
        "created_utc": 1676162625,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Church of England react to the American Revolution?",
        "author": "Then_Frosting_1087",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1102p4q/how_did_the_church_of_england_react_to_the/",
        "text": "",
        "created_utc": 1676162519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life of a young Edwardian gentleman",
        "author": "thn00fld",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1102o6a/life_of_a_young_edwardian_gentleman/",
        "text": "[removed]",
        "created_utc": 1676162445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Japan change so much in the interwar period and commit so many atrocities after it?",
        "author": "RevBladeZ",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11026ca/why_did_japan_change_so_much_in_the_interwar/",
        "text": "During WW1, the Japanese took German prisoners and treated the prisoners fairly, to the point that some of the prisoners stayed in Japan after the war.\n\nSuch a thing would be impossible to imagine happening during WW2.\n\nSo why did Japan become this way in just over a decade?",
        "created_utc": 1676161017,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are similarities and differences between Timur and Genghis Khan?",
        "author": "Spaghetti184957393",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11021uj/what_are_similarities_and_differences_between/",
        "text": "In terms of leadership and the empires they established/how they maintained?",
        "created_utc": 1676160656,
        "upvote_ratio": 1.0
    },
    {
        "title": "What forms of Governance did Indigenous Peoples of the American Southwest (Oasisamerica) have?",
        "author": "IamHere-4U",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11020qz/what_forms_of_governance_did_indigenous_peoples/",
        "text": "What forms of government, or political organization, did the Indigenous peoples of the American Southwest, or Oasisamerica, including Athabaskan peoples, such as the Navajo and various Apache peoples and Pueblo peoples (Hopi, Tewa, and Zuni peoples), have?\n\nTo my knowledge, some of these cultures had canal irrigation systems and multiple families would reside together in one, permanent dwelling. I don't want to make any appeals to notions of cultural complexity, or anything of the sort, but a lot of the activities of Indigenous peoples of the American Southwest entailed cooperation and organization of large arrays of people.\n\nI cannot find anything online regarding forms of governance, or how resources and labor were allocated, amongst any of these groups, but I am curious as to what forms of authority existed in these societies and how this impacted the organization of resources and labor. Any insight into this question would be greatly appreciated.",
        "created_utc": 1676160570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Louis Blanc's national workshop program in Paris fail? And why did the socialists fall so far behind in popularity after it?",
        "author": "austrohungarianball",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11020oe/why_did_louis_blancs_national_workshop_program_in/",
        "text": "",
        "created_utc": 1676160565,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some real life examples of Daes Dae'Mar (WOT) or the Game of Thrones (ASoIaF)?",
        "author": "JWReedY1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1101z9o/what_are_some_real_life_examples_of_daes_daemar/",
        "text": "Are there actually any? I know in WOT and ASoIaF they also call it the \"Great Game\", and there's a historical \"cold war?\" during the 18th and 19th centuries between the British and Russian Empires called the Great Game. But I'm thinking more for in-country type stuff. \n\nI've heard that GRRM's political climbing and deception is kind of an extreme version of it. And too a lesser extent, I find Jordan's to be much the same. But are there real world examples, and were there specific names for these types of \"games\"?",
        "created_utc": 1676160451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Real Life Examples of Daes Dae'Mar (WOT) or Game of Thrones (ASoIaF)",
        "author": "JWReedY1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1101xi7/real_life_examples_of_daes_daemar_wot_or_game_of/",
        "text": "[removed]",
        "created_utc": 1676160314,
        "upvote_ratio": 1.0
    }
]