[
    {
        "title": "We all know that the ME-262 was the world's first mass produced jet made during the Nazi regime? But the jet came a little too late. What would happen if ME-262 had been introduced at the start of war? Would the Nazis win easily? (No glorification intended)",
        "author": "Icy_Concentrate_2852",
        "url": "https://www.reddit.com/r/AskHistorians/comments/117691e/we_all_know_that_the_me262_was_the_worlds_first/",
        "text": "",
        "created_utc": 1676898567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the anecdote true, that most deaths in an ancient or medieval battle before guns and cannons were in widespread use, occur when one side breaks into a rout and that generally speaking, armies don't lose too many soldiers(&lt;10%) when the the fronts of two formations clash?",
        "author": "CardinalHunter",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1175ban/is_the_anecdote_true_that_most_deaths_in_an/",
        "text": "",
        "created_utc": 1676895766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there Wittelsbachers who joined the Nazis?",
        "author": "Dale1009",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11755i0/were_there_wittelsbachers_who_joined_the_nazis/",
        "text": "The Wittelsbacher were against the NSDAP and the son (Rupprecht) of the last king of Bavaria even was imprisoned in a KZ with his family. But were there any members of the house of Wittelsbach who not just fought for the Nazis as regular soldiers (if so, then probably only until the Prinzenerlass), but were actual Nazis like Prinz August of Hohenzollern? If so, did they survive WWII and what was their relationship with the anti-Nazi Wittelsbachers before, during, and after WWII?",
        "created_utc": 1676895282,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most important fight against oppression in european history?",
        "author": "PresentAd7638",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1174r6d/what_is_the_most_important_fight_against/",
        "text": "Title. I want to know of those not in first place as well",
        "created_utc": 1676893999,
        "upvote_ratio": 1.0
    },
    {
        "title": "How sure are we that a random notable ancient person wasn't multiple people?",
        "author": "NErDysprosium",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1173ink/how_sure_are_we_that_a_random_notable_ancient/",
        "text": "Title is not great, but I can't figure out a better way to phrase it without context. \n\nI stumbled across the name Kallikrates while reading something, and it sounded familiar, so I googled it. The resulting Wikipedia article told me that he was one of the architects who built the Parthenon, and that there is an inscription on the Acropolis of Athens that names him as the architect of the Temple of Nike. I found myself wondering how sure we are that Kallikrates, the architect of the Parthenon and Kallikrates, the architect of the Temple of Nike are the same person.\n\nAs a thought experiment that might not be necessary but that enjoyed constructing, imagine that, in 4,000 years, future archeologists or historians are researching the ancient civilization of the United States, and very few documents or artifacts remain. Among these are a scrap of newspaper from 1796 saying that John Adams has been elected President, and another is a document from 1826 bearing the signature of President John Quincy Adams. These are the only two known artifacts referring to the office of President during this time period. It might be a reasonable assumption that these two people, with similar names in the same profession in a relatively close time period, are the same person, especially if these archeologists come from a culture where leaders can rule for 30 years or more. Conversely, if all they had were two posters--a promotional poster for Moana that says Dwayne Johnson is voicing Maui and an old WWF poster with a picture of Dwayne Johnson that says \"Can you smell what the Rock is cooking\"--they would have no reason to assume that Dwayne Johnson and the Rock are the same person.\n\n\nI know those analogies are oversimplified and that we have more than two artifacts from Ancient Greece. However, the question remains: how sure are we that various notable ancient people, like Kallikrates, were one person and not two, and how can we be that sure?\n\nThanks in advance for any insights you have!",
        "created_utc": 1676889420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the National Socialist German Workers' Party actually do anything to advance Worker's rights?",
        "author": "asksoda",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1173gzk/did_the_national_socialist_german_workers_party/",
        "text": "",
        "created_utc": 1676889239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need your help to decipher and translate old german writtings from WWI !",
        "author": "Ratsel_WWI",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1172t3m/i_need_your_help_to_decipher_and_translate_old/",
        "text": "[removed]",
        "created_utc": 1676886693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who or what brand/designer manufactured/made Spain’s uniforms (military or royal) during the 1900s, specifically after World War 2 during the period of transitioning between general Franco to King Juan Carlos I to a Democratic country?",
        "author": "Salt_Researcher_687",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1172p1v/who_or_what_branddesigner_manufacturedmade_spains/",
        "text": "",
        "created_utc": 1676886232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Currently in the middle east, how did muslims develop the technology to tell them what time if day to pray? And how good was it?",
        "author": "alphamonkey27",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1171e5m/currently_in_the_middle_east_how_did_muslims/",
        "text": "I know that prayer is one of the cornerstones of Islam how did ancient muslims figure out what time of day to pray and where mecca was in relation to them in the ancient world? Was there even a requirement for prayer back then? How accurate were their predictions given the technology at the time. If this has been answered before sorry btw.",
        "created_utc": 1676880990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cold War Question: how much of a chance for a Unified Germany in the Non Aligned Movement?",
        "author": "Antares_Sol",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1171169/cold_war_question_how_much_of_a_chance_for_a/",
        "text": "A little background: I'm playing in a Mutants and Masterminds Third Edition (think D&amp;D, but with Superheroes) campaign set in 1962. Our characters are four scientists who went into space using an experimental ship designed from the Roswell Crash, and much like the Fantastic Four an accident results in us becoming superheroes, or \"Neohumans\" as per the GM's parlance. My character is named Nena Kraft, AKA Eisenfrau. She is a West German citizen who experienced allied bombing on Berlin as a young girl, leaving pieces of metal lodged in her body some of which were never able to be safely extracted. She had a brother Karl who was conscripted into the Volkstrumm before both of them ended up on the Eastern side of Berlin following the Third Reich's defeat. In East Germany she studied Aerospace Engineering while her brother enlisted in the Volksarmee or Stasi, gaining a clandestine and high-ranking position with sensitive operations. Nena fled to West Germany and continued her studies, before moving to America and attempting to join NASA. However Nena was repulsed at how many Third Reich officials were hired by NASA (such as Werner Von Braun) as well as NATO and the West German government. She decided to join a new company called Silver Springs based in New Mexico, where she met her three new companions and offered her experiences with aerospace engineering to the company. However the ship \"Lindbergh\" was sabotaged by agents of the Soviet-allied paramilitary known as Crimson Star, and the ship's alien reactor exploded, transforming both Nena and her companions as well as many humans across the Earth into Neohumans. The radiation interacted with the metal inside Nena's body, giving her a living metal form which confers massive strength and durability, including the ability to turn into liquid metal or interact with metal objects using magnetic fields. Conceptually, she is basically a combination of Sue Storm, Colosssus, Magneto, and the T-1000.  \n\n\nOkay, that was more than a little background. At this stage in the game, Nena is (unbeknownst to the rest of the party) drafting a document called the Arminius Manifesto. This document calls for the dissolution of both the BND and GDR, the expulsion of all NATO and Soviet forces from German territory, and the establishment of a new, neutral and sovereign German state aligned with the Non Aligned Movement. This state, Nena hopes, will be a bastion of human rights and scientific progress as well as Neohuman rights and tolerance (Neohumans are hated by many in this setting a-la Mutants from X-Men), which will serve as a buffer between NATO and the Warsaw Pact, de-escalating Cold War tensions and contributing to global peace. She sees this as the only way to wash Germany of it's previous association with Nazism and Hitler, as well as ending it being used as a pawn in the Cold War. She is willing to maintain diplomatic relations with Western and Communist countries provided they recognize this New Germany's sovereignty and remove their troops from it's territory. She will likely make overtures to other neutral nations like Yugoslavia, Austria, Finland, Sweden, and Switzerland as well as countries far outside of Europe such as India. She is betting on Germany's powerful industry and economy motivating other countries to maintain solid ties to it in exchange for benefiting from trade and economic benefits; i.e selling cars and electronics to both the US and USSR.  \n\n\nEven taking the Neohuman and superhero stuff out of the equation, how likely would German neutrality in the context of the Cold War be, and if it somehow happened what effect would it have on the Cold War?",
        "created_utc": 1676879586,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the equivalent of Sarmatism in Europe outside of Polish- Lithuanian commewealth?",
        "author": "onthepath1270",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1170jwy/what_would_be_the_equivalent_of_sarmatism_in/",
        "text": "Sarmatism being the ideology of Polish aritocrats in the 17th/18th century. \nSabre weilding patriots so to say.",
        "created_utc": 1676877722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Completing Your Nighttime Skincare",
        "author": "askincare10471",
        "url": "https://www.reddit.com/r/AskHistorians/comments/1170517/completing_your_nighttime_skincare/",
        "text": "[removed]",
        "created_utc": 1676876166,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is 814 CE &amp; I live in Italy, Switzerland, France, or Belgium in the land Majorian had controlled in 460, speaking a Romance language, descended from ethnic Romans. Would I be relatively likely to call myself a Roman or that I live in the Roman Empire or call my language Latin if I were asked?",
        "author": "Awesomeuser90",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116zxdc/it_is_814_ce_i_live_in_italy_switzerland_france/",
        "text": "",
        "created_utc": 1676875370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autoimmune Hair Loss Some Autoimmune",
        "author": "askincare10471",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ztd4/autoimmune_hair_loss_some_autoimmune/",
        "text": "[removed]",
        "created_utc": 1676874946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will anyone kindly share their recommendations for someone trying to study 16th century Western Europe?",
        "author": "FormalClue1462",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116zpzv/will_anyone_kindly_share_their_recommendations/",
        "text": "I am trying to study the 16th century but I am struggling to find books that I assume will be accurate, informative, or insightful. I am looking for both primary and secondary sources relevant to the century. All recommendations are appreciated, but descriptive recommendations are doubly appreciated.",
        "created_utc": 1676874609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please share your recommendations for someone trying to study 16th century Western Europe",
        "author": "FormalClue1462",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116zp68/please_share_your_recommendations_for_someone/",
        "text": "[removed]",
        "created_utc": 1676874521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which ancient civilization came the closest to measure or guess the accurate age of the earth?",
        "author": "SamiUso",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116zclv/which_ancient_civilization_came_the_closest_to/",
        "text": "So 4.5billion years is the age of the earth. Which civilization came close to that number?",
        "created_utc": 1676873247,
        "upvote_ratio": 1.0
    },
    {
        "title": "What could be considered some most expensive items/things/objects/artworks/artifacts in the world?",
        "author": "thinkdifferent235",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116yajc/what_could_be_considered_some_most_expensive/",
        "text": "Many things could be considered priceless like, King Tuts' Mask, Mona Lisa etc. But which are the \"most priceless\". Try to stay away from things like the U.S. interstate system etc.",
        "created_utc": 1676869539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was US succeed at nation building after WW2 but not in modern times?",
        "author": "taquito347",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116xzm2/why_was_us_succeed_at_nation_building_after_ww2/",
        "text": "Why was the US military successful at nation building in Japan and Germany following WW2 but not successful in Iraq and Afghanistan. I hear a lot of people say it wasn't successful in Iraq and Afghanistan because that's not what the military does but isn't that what they did after WW2? I understand that Afghanistan was a pretty broken nation but Iraq seemed much more modern, especially under ba'athist rule. Shouldn't Iraq have been another success?",
        "created_utc": 1676868549,
        "upvote_ratio": 1.0
    },
    {
        "title": "mi nadre quiere que sea como mi hermano",
        "author": "FtmC6583",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116xwd1/mi_nadre_quiere_que_sea_como_mi_hermano/",
        "text": "[removed]",
        "created_utc": 1676868252,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you get students interested in history?",
        "author": "boss_jim_gettys",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116xbp3/how_do_you_get_students_interested_in_history/",
        "text": "I’m a ninth grader who wants to become a historian (either that or something in finance because I love math) and it feels like students don’t care much about history as a subject. In my Honors Civics class - it feels like the subject is taken by people with little interest in history and only in the class for the inflated Honors grade while people who take regular Civics give two shits about it. So this raises the question - how do you get students interested in history and how would you get society somewhat interested in history in a way where people don’t treat it like a subject which doesn’t matter aside from possibly a subject of political theater.",
        "created_utc": 1676866356,
        "upvote_ratio": 1.0
    },
    {
        "title": "As current historians, what do you think future historians would love to find in a journal?",
        "author": "LunaLightAngel777",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116xaku/as_current_historians_what_do_you_think_future/",
        "text": "If this isn't the right sub, please direct me to the right one and I'll ask there. \n\nSo, I actively keep a journal. I've completed about four (4) since 2019. I don't want my journals burned or thrown away. I want them donated somewhere where they'll be preserved, kept safe, and (if needed) used for future reference. But what should I put in my journals as \"future reference\"?\n\nI know mundane is a must since that gives a very small glimpse into day-to-day life but… living in this moment, in this time that I'm recording, I don't know what would be needed or wanted. Should I record things like the price of bread? My shopping lists? The difference of the price of the same products in different stores? How long it takes to get ready for work? \n\nWhat can I, and other people who keep journals, keep track of now to help future historians have a better idea of what it was like to be alive in our current time?",
        "created_utc": 1676866257,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were Prussia and Russian Empire’s relations like? When was it at it’s best and when was it at it’s worse?",
        "author": "re1ch3ruz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116x3lk/what_were_prussia_and_russian_empires_relations/",
        "text": "I’m starting to do research on Prussia and every source says something different. Something I’m interested in right now is the relationship between it and the Russian Empire.",
        "created_utc": 1676865612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pre-Fast Food",
        "author": "lozenty",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116wy9c/prefast_food/",
        "text": "[removed]",
        "created_utc": 1676865107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did \"The Church\" provide leadership when ancient Rome was invaded?",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116wxl6/did_the_church_provide_leadership_when_ancient/",
        "text": "This comes from a answer to a Quora question about whether or not Christianity caused the fall of the Roman Empire. The whole answer reads...\n\n&gt;The  Romans were decadent, and had become weak. Barbarian tribes were able  to loot and plunder, and eventually, Italy was invaded and “the shoe was  on the other foot”. The Eastern half of the Empire survived a lot  longer, but they had their own troubles when the Muslims came  a-knockin’.  \n&gt;  \n&gt;**The  Church, rather than cause the fall of the Roman Empire, rather provided  leadership when Rome was invaded, and perhaps saved civilization from  total ruin.**\n\nThe boldening was from me. I can't find any sources online about that claim, and, instead, just stuff about whether or not Christianity caused the fall of the ancient Romans.",
        "created_utc": 1676865045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Afghanistan have this piece of land linking it to china?",
        "author": "Nooooooooooook",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116wo53/why_does_afghanistan_have_this_piece_of_land/",
        "text": "Appearntly it's called The Wakhan Corridor and I found it to be quiet weird how did this happen",
        "created_utc": 1676864165,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were the main drivers of the Enclosure Movement in Early Modern England (Roughly from the Tudor Period)? Were there analogues in other countries or was this a uniquely English phenomenon?",
        "author": "CptS2T",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116w0ky/what_were_the_main_drivers_of_the_enclosure/",
        "text": "",
        "created_utc": 1676862109,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many 800mm Railway guns did the Germans build in WW2? (Schwerer Gustav/Dora)",
        "author": "notgoblin1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116uylm/how_many_800mm_railway_guns_did_the_germans_build/",
        "text": "I have been struggling to find any consensus on this topic, I can't find any two sources that agree on when the guns were built, the name of the guns, when they were built and how were they destroyed.\n\nHere is what i've found so far, In Romanych, M. et al (2020). *World War II German super-heavy siege guns* pg. 13 it states “The gun was later officially named ‘Dora-Gerät’, or simply ‘Dora’ after a nickname given by its crew. The second gun, ‘schwerer Gustav’, or just ‘Gustav’, was completed in 1943. (G. Heuer)”. This is also supported by Zaloga, S. and Dennis, P. (2016). *Railway guns of World War II* pg.14 which states “The first gun was named “Dora,” reputedly after the wife of Erich Müller, the head of the Krupp gun design bureau. The second gun, completed in August 1942, was dubbed “schwerer Gustav 2” (Heavy Gustav) after the head of the Krupp firm.”. On the [German wiki page](https://de.wikipedia.org/wiki/80-cm-Kanone_(E)) it claims that 2 guns were built, but I haven't been able to access any of the German references.\n\nHowever, in Batchelor, J.H. and Hogg, I.V. (1973). *Rail Gun.* pg. 56 it states “For some years after the war it was believed that two of these weapons had been built, named Gustav and Dora. However, subsequent research has shown that only one Gustav was made:“. In addition to this in many other sources I've read they simply refer to “The Gustav” or “The Dora” implying only one such weapon existed, such as in Engelmann, J. (1976). *German Railroad Guns in Action.* Pg. 35. “the 80 cm(E) \"Dora\" (later called \"Schwerer Gustav\"--\"Heavy Gustav\"-from 22 June 1942).”\n\nCan anyone point me in the direction of any definitive sources on this topic?",
        "created_utc": 1676858905,
        "upvote_ratio": 1.0
    },
    {
        "title": "What role do Black Americans play in early US labor movements? Were American socialists sensitive to the plight of the Black proletariat?",
        "author": "J2quared",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ucd4/what_role_do_black_americans_play_in_early_us/",
        "text": "",
        "created_utc": 1676857073,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Spike Lee’s Miracle At St Anna, the Germans tried to exploit the racial tension between Black and White American soldiers. Did this ever happen in WW2, Korean War or Vietnam?",
        "author": "J2quared",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116u7lf/in_spike_lees_miracle_at_st_anna_the_germans/",
        "text": "",
        "created_utc": 1676856694,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did we begin to see modern boot camps and professionally trained armies become the norm?",
        "author": "Environmental-Star40",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116tpgu/when_did_we_begin_to_see_modern_boot_camps_and/",
        "text": "",
        "created_utc": 1676855278,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you most effectively search the national archives online given a T-code, roll, and frame number?",
        "author": "getoutofthegloryhole",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116t91q/how_can_you_most_effectively_search_the_national/",
        "text": "Hello,\n\n&amp;#x200B;\n\nI'm currently in the process of writing my thesis on the extent of collaboration between Serbian resistance groups and the occupying Nazis in the second world war. A lot of my sources cite the national archives, specifically captured microfilm, a large amount of which has been digitized. I've been searching the archives for about a week now, and I'm really struggling to be able to find the exact sources referenced. For example, one book gave their source as  NAW/T-314/566/342, which would be the T-designation (not sure what its actual name is) of 314, roll 556, frame 342. However, I'm unable to find this through the search tools on the national archive website, as I can't figure out how to restrict my search even to a specific T-designation, rather having a bunch of results come up when I search that. Has anybody else had success searching by T-designation/roll/frame before? Any help, even a link to a guide that I haven't yet seen, would be appreciated!",
        "created_utc": 1676854054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Middle Ages beer",
        "author": "Nor_westy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116sojd/middle_ages_beer/",
        "text": "[removed]",
        "created_utc": 1676852557,
        "upvote_ratio": 1.0
    },
    {
        "title": "How are Rick Perlstein's books regarded among professional historians?",
        "author": "wolverine237",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116sl1y/how_are_rick_perlsteins_books_regarded_among/",
        "text": "",
        "created_utc": 1676852306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were the empires in North America really at the level of civilization of the 6th Century BC Mesopotamia",
        "author": "SE_to_NW",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116setv/were_the_empires_in_north_america_really_at_the/",
        "text": "[removed]",
        "created_utc": 1676851847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why weren’t sugar maple trees exported to Europe during the colonization of North America?",
        "author": "The-LeftWingedNeoCon",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116s8fr/why_werent_sugar_maple_trees_exported_to_europe/",
        "text": "During the colonization of North America, Europeans brought Turkeys, Canada Goose, Tomatoes, Potatoes, Peppers, Pumpkins and Corn back to Europe to be farmed.  Why were Maple syrup and sugars not exported to Europe despite being popular with colonists living in North America?  Why didn’t they plant sugar maples in Europe?",
        "created_utc": 1676851384,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the charge be for aiding in the psychological manipulation and coercion of unknowing/unwilling participants in 1990s Hungary?",
        "author": "Accomplished_Help677",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116rykg/what_would_the_charge_be_for_aiding_in_the/",
        "text": "I know this question is very specific and may not even belong here. I'm writing a novel set in 1993 Hungary where the characters are subjected to extensive psychological manipulation they are unaware of and not consenting to, and the novel ends with the perpetrators being arrested. I need to know what the charge would be for the people performing the experiments, the people who set up the whole thing, and the person helping them, so I figured, since it's set in the 90s in a country whose laws I'm not familiar with, that asking this community would be alright, but if not, please, if you can, suggest a subreddit this question would be more suited to! More information would be that the majority of the victims are minors, they are coaxed into arriving at the location, are stalked and spied on, and are watched with surveillance cameras they are not aware of. I'd say that they inflict emotional, psychological, and mental abuse on them, but not physical. If anyone can provide information or point me to a subreddit I could repost this question on, I'd be really grateful!",
        "created_utc": 1676850682,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were Yucatan Maya forced into debt bondage in the 1840s and how and why did skirmishes in the resulting \"Caste War\" continue until 1933? Were there many enclaves that did not submit to the Mexican government, at the time?",
        "author": "edwardtaughtme",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116rm8o/how_were_yucatan_maya_forced_into_debt_bondage_in/",
        "text": "",
        "created_utc": 1676849802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did it take 400 years for Europeans to go back to America after the norse left?",
        "author": "Protector15",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116rlqj/why_did_it_take_400_years_for_europeans_to_go/",
        "text": "I'm curious aw why no European power considered traveling to America until Columbus unintentionally rediscoved it.Was Vinland considered a myth or did the Scandinavians just go to great lengths not to advertise it, or did everyone just have something better to do until Columbus?",
        "created_utc": 1676849764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dear historians of Reddit, I am specifically looking for people who specialize in Afghan history as I want to know if my writing is historically accurate. Please let me know if it is historically accurate or not.",
        "author": "Prestigious_Ad4025",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116rk01/dear_historians_of_reddit_i_am_specifically/",
        "text": "[removed]",
        "created_utc": 1676849646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there any data or other factual information that supported Japanese internment in the US during WW2 as compared to German or Italian immigrants?",
        "author": "jaredfoglesmydad",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116rd2k/was_there_any_data_or_other_factual_information/",
        "text": "Was there a larger percentage of first generation immigrants or were there more instances of Japanese sabotage etc.? Or was it just straight racism and retaliation for Pearl Harbor? I think I know the answer to this one already but I’m trying to put myself in the mindset of US political or military leaders at the time.",
        "created_utc": 1676849165,
        "upvote_ratio": 1.0
    },
    {
        "title": "How similar were the USA and Germany ideologically pre and during WWII in terms of race supremacy and how complicit might the US be in the beliefs of the Nazis?",
        "author": "cubbycoo77",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116r8t3/how_similar_were_the_usa_and_germany/",
        "text": "I’ve heard that Hitler and the Nazi party got a lot of ideas on eugenics from the US and that eugenics started in the US. I also started listening to Black Birds in the Sky by Brandy Colbert which said that the KKK was mostly gone until a resurgence after the movie Birth of a Nation came out. The author said this lead to the New KKK which didn’t limit their hate to black people but also included Jews, Catholics, and the new immigrants coming in to the US at the time. I also remember that it took the US awhile to finally join the war, was that because large portions of the US didn’t disagree with the Nazi party?",
        "created_utc": 1676848875,
        "upvote_ratio": 1.0
    },
    {
        "title": "how difficult is making a question on askhistorians?",
        "author": "Ziopover",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116qtzs/how_difficult_is_making_a_question_on/",
        "text": "",
        "created_utc": 1676847869,
        "upvote_ratio": 1.0
    },
    {
        "title": "When were proprietors/owners of US-based bars regularly choosing/playing specific songs/albums for playback?",
        "author": "paideia19",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116qlac/when_were_proprietorsowners_of_usbased_bars/",
        "text": "Hi there,\n\nI'm curious when the playing of recorded music became relatively widespread in US-based bars? I assume initially music in this setting was heard via radio but I'm most interested to know when proprietors/owners began to select specific songs/albums?\n\nTIA.",
        "created_utc": 1676847296,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a story where the \"bad guys\" are actually, completely, 100% right, to the point where it's weird that historians keep calling them the bad guys?",
        "author": "szymon362",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116qhxi/whats_a_story_where_the_bad_guys_are_actually/",
        "text": "",
        "created_utc": 1676847060,
        "upvote_ratio": 1.0
    },
    {
        "title": "How \"holy\" is the holy land?",
        "author": "noitseuqaksa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ptty/how_holy_is_the_holy_land/",
        "text": "By \"holy\" I mean, has a much more prominent role in history than its size.\n\nIt is a tiny place which is a Geographic bottleneck separating 2-3 continents, has oldest human remains out of Africa, oldest continuous settlement, origin of the Alphabetic writing systems, origin of the weekend(?), origin of a major branch in the religious evolution tree (the Abrahamic religions), attractor of a lot of international political attention in modern times, much greater than its size/resources would call for, a major technological hub, a nation exiled from  from it in the 1st century AD had a major influence on 20th century history (communism/holocaust/zionism/cold war/scientific influence).\n\nAm I exaggerating/twisting/cherry picking here, or is this place really a geographic/genetic/linguistic/theological/political bottleneck in human history? And if so, how much of it is \"expected\" due to its geopolitical location?",
        "created_utc": 1676845421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we have any records that give insight on how people first discovered alcohol?",
        "author": "Practical-Day-6486",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116pr62/do_we_have_any_records_that_give_insight_on_how/",
        "text": "I don’t drink, but something that has recently fascinated me is how people first discovered alcohol. Wine, for instance, is basically just grapes that have expired, right? So did early humans just pick some expired grapes one day and got intoxicated? I understand early humans weren’t idiots and they could figure stuff out, but I’d imagine the fermentation process is quite complex. Like where did they get yeast from? How did they know it was yeast that was involved in the fermentation, and how did so many cultures develop alcohol from different things: wine, beer, sake, mead, etc?",
        "created_utc": 1676845242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why has there never been a Pan-Turkic movement?",
        "author": "MangoManMayhem",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116pnq1/why_has_there_never_been_a_panturkic_movement/",
        "text": "",
        "created_utc": 1676845009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did ancient Micronesian populations independently develop an iron culture and create swords?",
        "author": "_crisz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116p50e/did_ancient_micronesian_populations_independently/",
        "text": "&amp;#x200B;\n\nI am watching the documentary \"Lost Cities\" with Albert Lin, and in Season 1 Episode 2, he points out an incision on a rock on a Micronesian island, claiming that it is 1000 years old and depicts a sword. However, I haven't found solid evidence in the scientific literature about how Micronesian populations melted iron and crafted swords. I know that Mesoamerican people used obsidian to make swords. If something similar happened in Micronesia, what material did they use? If they used iron instead, did they discover it independently? And why are there no remains in archaeological sites?\"",
        "created_utc": 1676843756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there historical records of the usage of motherese/parentese?",
        "author": "Divoletto",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116olw9/are_there_historical_records_of_the_usage_of/",
        "text": "Everyone just seems to know that you're supposed to speak to a baby in a much more simple way, but are there any historical instances of this? Any records suggesting humans have always done it throughout history?",
        "created_utc": 1676842397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were people of color at risk of being shanghaied?",
        "author": "thethingandi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ocxk/were_people_of_color_at_risk_of_being_shanghaied/",
        "text": "I’m mostly interested in learning about Asian Americans on the American west coast in the late 1800s, but any answers would be welcome!",
        "created_utc": 1676841772,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the history of republics and republicanism outside of Europe?",
        "author": "MarioTheMojoMan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ocjd/what_is_the_history_of_republics_and/",
        "text": "Beyond the example of Tlaxcala, most of what I've seen regarding the pre-modern history of republics and republicanism focuses on Europe and European-descended societies -- Rome and Athens, Italian maritime Republics, the Dutch Republic, various peasant republics, and then the Enlightenment and the Atlantic Revolutions. This is all great information, of course, but surely Europe and Tlaxcala are not the only places where societies rejected monarchical or theocratic rule prior to the modern age.",
        "created_utc": 1676841743,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Catholics evolve the notion that you can pray to Mary and the saints?",
        "author": "p38-lightning",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116occd/how_did_catholics_evolve_the_notion_that_you_can/",
        "text": "Did the practice flow from their theology or was the theology an apologetic response to the practice?",
        "created_utc": 1676841729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did people really stop all fun things under Cromwell's reign?",
        "author": "Turtleme7",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nz2d/did_people_really_stop_all_fun_things_under/",
        "text": "When Cromwell and the puritans took over England in the 1600s how seriously were his bans of Christmas, sport etc taken? I can't imagine that there were the resources or desire in England to totally stop drinking and partying.",
        "created_utc": 1676840789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good book about the history of weapons?",
        "author": "CapitalStore5701",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nytw/good_book_about_the_history_of_weapons/",
        "text": "Hello, does anyone by chance know a good book (preferably an audiobook) about the history of weapons?",
        "created_utc": 1676840772,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did the USA do with it's weapon surplus after World War2?",
        "author": "IamMisa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nr6z/what_did_the_usa_do_with_its_weapon_surplus_after/",
        "text": "",
        "created_utc": 1676840262,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many people were generally part of a pilgrimage in different eras and regions?",
        "author": "Maerewyn",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nmkx/how_many_people_were_generally_part_of_a/",
        "text": "The Canterbury Tales mentions about 30 pilgrims who are traveling across England. I'm wondering if this was a standard number of people, and how much this number would vary across time and region. I'm guessing that a pilgrimage across a large desert (like the hajj) would involve more people since it's a more dangerous journey that requires more supplies?",
        "created_utc": 1676839938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reactions to Fredy Perlman's Against His-tory, Against Leviathan?",
        "author": "CatTurtleKid",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nmd5/reactions_to_fredy_perlmans_against_history/",
        "text": "I've been listening to this book recently and was curious what historians thought about this book! I personally find it's arguments fairly compelling but assume that pretty much anyone with actual historical training would hate it. I'm curious what the arguments from a historians perspective would be about his arguments, both from the perspective of facts but also from arguments against his style of narrative construction.",
        "created_utc": 1676839922,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Phoenicians spread the alphabet all over the Mediterranean, why does very little of their writings survive?",
        "author": "user_history_lang",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nmb7/if_phoenicians_spread_the_alphabet_all_over_the/",
        "text": "",
        "created_utc": 1676839918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there ANY Emperors, Kings, Etc that can be considered an overall good person AND good leader?",
        "author": "TheSamuraiGunner",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116nbup/was_there_any_emperors_kings_etc_that_can_be/",
        "text": "I honestly can’t really think of a single leader in history that can be considered a good person AND a good leader, except MAYBE Cyrus, but I don’t know nearly enough to know if I can really consider Cyrus a good person.",
        "created_utc": 1676839168,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the electric guitar become the “cool” instrument?",
        "author": "This_is_fine0_0",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116naiz/how_did_the_electric_guitar_become_the_cool/",
        "text": "Why not the tuba? Harp? Oboe?",
        "created_utc": 1676839076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Armenian mythology include a World Tree concept? What were the details of their beliefs and where can I read more about them?",
        "author": "mightylemondrops",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116myqm/did_armenian_mythology_include_a_world_tree/",
        "text": "",
        "created_utc": 1676838258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about how the pyramids were built?",
        "author": "Zestyclose-Trash8556",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116my7g/question_about_how_the_pyramids_were_built/",
        "text": "I was watching videos on Youtube and I came across some videos about how the pyramids were built. Many experts had different theories, some say they used a spiral ramp system, some say they used a water system to lift the stones into place and others even suggested aliens or some other older lost civilisation with acess to advanced technology. This reminded me of something I read in a book about 30 years ago. In ancient China (or maybe Japan I cannot remember very well) there was a man who wanted to build some massive temple. He had his men build 4 massive walls but then discovered that the roof of the building was far too heavy to lift into place with the man power he had. So then he decided to cover the entire area in Earth/mud on a gradual slope and had the roof dragged into place. He then had his men dig out the Earth and then had the temple washed. \n\nI dont know if this was a true story or not but it got me thinking. Would the Egyptians have been able to have built the pyramids using a similar method? Surely it would have been much easier to build the base, cover with Earth, drag more material in place, cover with more Earth and repeat until pyramid is complete. Then just dig the Earth away and clean up the pyramid. If the Egyptians had not shortage of man power then surely this would be the easiest way to build such a massive structure? Does anyone have any opinions on this?",
        "created_utc": 1676838220,
        "upvote_ratio": 1.0
    },
    {
        "title": "If King Arthur and his knights were real, what would they have worn? 5th-6th century",
        "author": "ShellsnRoses_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116mtjb/if_king_arthur_and_his_knights_were_real_what/",
        "text": "I’ve been working on some character designs and I wanted to be historically accurate with the costuming but it’s been very difficult finding anything. Supposedly King Arthur would have been set around 5th-6th century in sub-Roman Britain (I think). But I’d find some clothing illustrations dated ~500 and then the exact same thing dated ~1200. So do we just not know what people were wearing? Would it be some blend of late Roman and Anglo-Saxon clothing? Was there any plate armor being worn? Are there any manuscripts/murals/tapestries I could reference from?",
        "created_utc": 1676837911,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the American military had a draft for Vietnam, what was the purpose of sending draftees to Vietnam itself instead of to places like Germany or domestic bases in order to free up volunteer enlistees to send to Vietnam?",
        "author": "Awesomeuser90",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116m7yl/when_the_american_military_had_a_draft_for/",
        "text": "It seems that sending draftees to a war always carries a lot of political risks. Allowing them to free up soldiers on routine and boring assignments seems like it would be a safer political move than to send them to the warzone that was making a stink around the world and among some draftees, and more useful given that the enlistees at least had a will to join.",
        "created_utc": 1676836424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing of recorded music at bars",
        "author": "paideia19",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116m63r/playing_of_recorded_music_at_bars/",
        "text": "[removed]",
        "created_utc": 1676836296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pope in mid 1700’s.",
        "author": "Mordecai619",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116m4zo/pope_in_mid_1700s/",
        "text": "[removed]",
        "created_utc": 1676836218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any accounts of people surviving a direct hit from a cannonball during the American Revolution?",
        "author": "shallow_kip",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116lrpw/are_there_any_accounts_of_people_surviving_a/",
        "text": "Curious about the possibility of someone surviving a direct hit from a cannonball in that period. Google hasn't given me any good results other than hearsay without any actual sources.",
        "created_utc": 1676835284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there \"human\" powered tug boats in ancient harbors?",
        "author": "TechnicallyActually",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116lq4m/were_there_human_powered_tug_boats_in_ancient/",
        "text": "Hard to imagine a giant sailing ship can be controlled so precisely that they dock with the piers.",
        "created_utc": 1676835179,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the electoral college have looked like in 1860 if emancipation had happened magically overnight?",
        "author": "amelaine_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116lonq/what_would_the_electoral_college_have_looked_like/",
        "text": "I'm interested in the math and demographics to see if there's an extra way to dispel one of the \"states' rights\" myths I was taught in school. \n\nThe argument goes that it violated states' rights for Lincoln to have been able to win without a single southern elector. It still gets tossed around to try to show that there was, in fact, an ethical reason to fight for the Confederacy that had absolutely nothing to do with preserving slavery.\n\nLet's put aside some other issues with this argument—the unfair assumption that the South is entitled to its own veto, and the fact that voters in slave states already had the unfair advantage of an additional 3/5 of an elector for every enslaved person. I want to see whether these hypothetical virtuous \"states' rights, not slavery\" southerners could have kept their stranglehold on the electoral college if they had been willing to sacrifice slavery for it. \n\nLet's pretend that all enslaved people were emancipated and counted as 5/5ths of a person, and the electors reassigned in accordance, just in time for the 1860 election. If we take the states' rights apologists at their word, it doesn't actually matter whether the newly emancipated men would vote the same way as the white men, because of *course* the war wasn't fought to maintain white supremacy, just to maintain southern autonomy.\n\nSo, mathematically, could the South have kept a majority of the electoral college if they'd been willing to sacrifice slavery for it?",
        "created_utc": 1676835083,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have become a wealthy merchant in 16th century England. Can I buy land, and what would that require?",
        "author": "gsfortis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ln0c/i_have_become_a_wealthy_merchant_in_16th_century/",
        "text": "Let's use the year 1540 as a specific point in time. As a merchant, I have honed my craft (whatever that may be) and created a business that generates good money. *Really* good money. No longer content to pay rent to my current landlord, I want to buy land and/or improve my position in society. \n\nCan I buy land? Who would sell me land?\n\nWhat can I do?",
        "created_utc": 1676834971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the early-modern Crown of Castile more centralized compared to Aragon?",
        "author": "Lincoin02202",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116l6ps/was_the_earlymodern_crown_of_castile_more/",
        "text": "In my impression, all the compositions of Crown of Aragon had their different constitutions, courts and laws like Catalonia, which had been in the Crown for around 700 years. I have never seen Kingdoms of the Crown of Castile (like Kingdom of Toledo, Kingdom of Murcia, Kingdom of Cordoba, etc) having this kind of independent institutions.\n\nWas the Crown of Castile more centralized compared to the Crown of Aragon?",
        "created_utc": 1676833894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Japan declare war on US before the Pearl Hearbor attack?",
        "author": "i_bex",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116krpo/did_japan_declare_war_on_us_before_the_pearl/",
        "text": "Apparently some movies suggest Japan declared war in advance and US received it but it was etiher encrypted or translated too late. Could there be some truth to it?",
        "created_utc": 1676832893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did accountants use red ink to distinguish negative numbers rather than a different color?",
        "author": "Intro24",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116kj00/why_did_accountants_use_red_ink_to_distinguish/",
        "text": "It makes perfect sense to me why paper is white in color and why ink is a dark color, for contrast on the white paper. However, at some point, another color was needed. I'm guessing this was due to accountants needing a color other than black to distinguish negative numbers but maybe it was some other reason. Either way, with black and white taken, ROYGBIV were the other standard color options. Orange and yellow are too light, blue is too dark and I think was already somewhat interchangeable with black ink, and indigo/violet were apparently very expensive to produce for awhile. That leaves us with red or green as the choice for a specialty ink color to distinguish negative numbers and other text. I believe this is the reason why today red means negative, why typewriters have black/red ribbons, and why a lot of Bibles have direct quotes from Jesus in red. I think it may even be the reason that important signs and warnings are red. Anyway, my question is why accountants picked red over green, which seems like the only color that would have been a reasonable choice aside from red. I think green would especially make sense because the human eye evolved to be more sensitive to green. Was red chosen because it was already associated with negativity at the time? Maybe green ink was harder to produce than red? Maybe I'm way off base entirely. In short, how was red chosen as the \"emphasis\" color and why wasn't green used instead?",
        "created_utc": 1676832296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there any engagements between Vichy France and Nazi Germany during Case Anton?",
        "author": "like-humans-do",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116kep9/were_there_any_engagements_between_vichy_france/",
        "text": "I know of the Scuttling of Toulon, but beyond disobedience to the demands of Nazi Germany were there any engagements between the armed forces of the Vichy government and Nazi Germany?",
        "created_utc": 1676832002,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long would it take to travel on the Nile from Damietta to Cairo in the middle ages?",
        "author": "harmonyhypnotist",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116k979/how_long_would_it_take_to_travel_on_the_nile_from/",
        "text": "",
        "created_utc": 1676831634,
        "upvote_ratio": 1.0
    },
    {
        "title": "What colors did Dhimmis wear in Ayyubid Egypt?",
        "author": "harmonyhypnotist",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116k7j3/what_colors_did_dhimmis_wear_in_ayyubid_egypt/",
        "text": "I'm researching to create historical fiction set in Alexandria, Egypt, in the 1220s CE.   \n\n\nI've found numerous references to Dhimmis having certain legal requirements regarding clothing, but I've found conflicting information about the specifics of those requirements: The Islamicate middle ages covers a lot of time and a lot of ground.  \n\n\nThank you so much.",
        "created_utc": 1676831524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given the extent of the Berlin Wall, what countermeasures were taken by the Soviets on the western border of their German zone to deter defectors?",
        "author": "sirsteve0894",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116jx2r/given_the_extent_of_the_berlin_wall_what/",
        "text": "",
        "created_utc": 1676830831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any non nation-states which are not the product of colonialism? How did they come to be?",
        "author": "xland44",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116jaup/are_there_any_non_nationstates_which_are_not_the/",
        "text": "Hi! I frequently see the concept is nation-states being criticized on the internet, and this led me to a question I was unable to find an answer to after looking it up for several hours\n\nMy question is, are there any countries in the world who aren't nation-states, and also whose history and founding wasn't heavily involved with colonialism and people robbing the native peoples of their right to self determination? What were the unique factors that enabled this situation to occur? \n\nThe closest thing to this I can think of is perhaps Lebanon, which revolves around sects instead of nationality, but I don't think that counts as I would say Lebanon is also a nation-state (of the Lebanese people), and of course they heavily suffered colonialism too",
        "created_utc": 1676829348,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happened to all the non German nazis during and after WWII?",
        "author": "CelestialJellyFishs",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116j4df/what_happened_to_all_the_non_german_nazis_during/",
        "text": "I came across this post in r/interestingasfuck that showed American nazis holding rallies in Madison Squere Garden and it made me wonder, what did the majority of Americans think of the party before the war and what happened to these people in America once the war broke out? Here's the link for reference. https://www.reddit.com/r/interestingasfuck/comments/116b24g/before_the_war_american_nazis_held_mass_rallies/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "created_utc": 1676828899,
        "upvote_ratio": 1.0
    },
    {
        "title": "As the Reich gained momentum and became the status quo, how did the the bureaucracy and the leadership change? We’re these posts filled by the best and the brightest, or we’re they staffed by people who were politically connected but not, perhaps, fully competent for the task?",
        "author": "robertovertical",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116izr6/as_the_reich_gained_momentum_and_became_the/",
        "text": "",
        "created_utc": 1676828583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are/were Afro-Caribbean folkways closer to African folkways than African American folkways?",
        "author": "DuvalHeart",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116iwgl/arewere_afrocaribbean_folkways_closer_to_african/",
        "text": "In \"Palmetto Country,\" a sociological compilation of Florida's folkways in the 1930s and early 1940s, the author claims that the Afro-Caribbean folkways were closer to African folkways than their American counterparts. And that this happened because the enslaved population of the Caribbean was kept at a distance from the enslavers while in the United States the relationship was closer enabling a concerted effort to stamp out these practices.\n\n\nDoes the historical record support thess claims or are they hypotheses that have been discarded?",
        "created_utc": 1676828361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we sugarcoat things in American history classes?",
        "author": "Nicoletta_Al-Kaysani",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116isr4/why_do_we_sugarcoat_things_in_american_history/",
        "text": "I want to say I understand making things simple for elementary school kids. I’m mainly talking about high school classes and the way we romanticize and deify the early creation of this country and the founding fathers. \n\nI understand taking things in the “context of that moment in history” but we also hide a lot of stuff too. The majority of the dark stuff we did in history I learned by myself as an adult. \n\nWe treat George Washington like some sort of demigod when he was just a guy. He did some great things but he was also deeply flawed. Where’s the nuance? Even James Madison said “men are not angels” but we look back and schools treat them like we’re almost were.\n\nI don’t know if I sound like I’m rambling but I’ve been thinking about this for a while while studying history and then I remembered that news story from years back where a parent found the word “migration” used to describe the slave trade. How does a thing like that even get published to be in a students classroom? I’d rather us not teach history at all if we’re going to sugar coat it to that extreme.",
        "created_utc": 1676828111,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come so few people died in classical infantry clashes?",
        "author": "punpuniq",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ir89/how_come_so_few_people_died_in_classical_infantry/",
        "text": "During Alexander's campaign in Persia, when he fought his first battle the fighting between his pikemen and the persian levies was described as \"intense\", but after a few hours of fighting, with literally over 100 thousand people being engaged in \"intense\" fighting, less than a thousand soldiers had died. What ended up killing people, as is usually the case in ancient battle, was the pursuits when the persians fled the battlefield (which they did because of fancy cavalry tactics). I know the example isn't very well reaserched, it's because it doesn't really matter, the same patter emerges with almost every battle in antiquity, there's an infantry fight where very few people die, someone gains a tactical advantage and then a lot of people die while trying to run away.\n\nComparing that to hema (obviously not the exact same scenario, but fairly close) fights take like a minute at absolute most. Of course fighting until someone is hit and until someone dies are different, and classical combat was a bit more defensive than medieval combat, but does it make people die literally more than a thousand times slower? It doesn't feel like it\n\nSo, my question is, what made classical infantry battles so safe, compared to what I'd expect?",
        "created_utc": 1676828010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are these two battles proofs of how useless medieval knights are?",
        "author": "Blood_Killer102",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116im1z/are_these_two_battles_proofs_of_how_useless/",
        "text": "Is the 1420 Battle of Vitkov Hill and the 1421 Battle of Kutná Hora proofs that medieval knights are truly pathetic idiots? The knights lost badly to Jan Žižka despite the fact that Jan Žižka and his untrained peasant forces were extremely outnumbered by the knights.\n\nAlso, Jan Žižka is nothing but a mere thug bandit. He has no professional military training and he is born to a lower class. He is an uneducated person.",
        "created_utc": 1676827667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why were the problems with American President Buchanan?",
        "author": "Environmental-Pasta",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ik7v/why_were_the_problems_with_american_president/",
        "text": "I see so much hate for him across the internet and I was wondering was specifically he did to gain such a reputation. Maybe he did good things too, I genuinely have no idea!",
        "created_utc": 1676827538,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did people start to get boyfriends and girlfriends?",
        "author": "Keith502",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ii3l/when_did_people_start_to_get_boyfriends_and/",
        "text": "In most of the Western world, the path of a man and woman to becoming married typically begins with a relatively casual, informal encounter between them. After this informal encounter, the man and woman begin engaging in dating activities and begin referring to each other as “boyfriend” or “girlfriend”. This relationship is initiated by the couple themselves and organized by the couple themselves. The interpersonal chemistry and intimacy between the man and woman gradually grows throughout the duration of the dating process. At the couple’s discretion, the man and woman may or may not include sexual intercourse as a part of their dating process. Whether or not the couple have sex while dating is usually of little concern to anyone else beside themselves. If things between them don’t work out, they informally break up; if things do work out, the man, of his own accord, will likely ask the woman to marry him. Whether and when they get engaged is entirely at the discretion of the couple themselves. The choice of the couple getting married is typically based on their mutual chemistry and love for one another.  \n\nThis is more or less the custom of romantic courtship that most of the developed world is familiar with. But it’s my understanding that this custom is not the way it has always been. From ancient times, it appears that arranged marriage was the norm for how a man and woman got involved in a romantic relationship that would lead to marriage. Typically, a bachelor or his parents would go to the parents of the woman that the bachelor wanted to marry and would offer the woman’s parents a bride-price. (Or alternatively in some cultures, the parents of a woman would offer a payment of dowry to the family of a bachelor to give away their daughter in marriage to the bachelor.) The beginning of the relationship was arranged largely from outside the couple by family members of the couple, rather than the man and woman directly choosing each other. The initial encounter between the man and woman appears to be more formal and organized. After the bride-price or dowry is paid and the man and woman are now betrothed, a marriage date between them is planned upon. Often the man and woman know each other very little, if at all; thus there is often little or no real chemistry or romance between them at the time of marriage. The couple get socially acquainted with each other after their marriage instead of before. The woman is often forbidden from fornicating, and is expected to maintain her virginity while still a maiden, and only give up her virginity to her betrothed as a consummation of their marriage. This preservation of her virginity ensures that her husband’s eventual heir is genuine and will be able to carry on the husband’s bloodline. Furthermore, the woman’s virginity is of great concern to her parents, as the betrothal of a virgin daughter will fetch a higher bride-price for the family; alternatively, a non-virgin daughter may be of far less value, if she can even be married away at all. The betrothal between the man and woman is essentially a formal monetary transaction between the families of the man and woman. The couple’s relationship has less of a romantic purpose and more of a social purpose, involving the covenant between the two families in order to ensure a progeny and a family life for their respective son and daughter.\n\nHere’s my question: At some point in history the arranged marriage system became phased out in most of the developed world and was replaced by the more informal system of men and woman getting girlfriends and boyfriends, respectively. When did this happen? Why did this happen? What social or historical forces led to this change in how people engaged in romance?",
        "created_utc": 1676827397,
        "upvote_ratio": 1.0
    },
    {
        "title": "necesito apoyo para mí página https://www.facebook.com/boris123asde?mibextid=ZbWKwL",
        "author": "dabanobich123",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hz6l/necesito_apoyo_para_mí_página/",
        "text": "",
        "created_utc": 1676826154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why has every attempt to change the 7 day week failed?",
        "author": "boomboomtext",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hyos/why_has_every_attempt_to_change_the_7_day_week/",
        "text": "",
        "created_utc": 1676826123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has the historical consesus that the American indigenous population decreased mainly from disease shifted to mainly from violence?",
        "author": "artorijos",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hvff/has_the_historical_consesus_that_the_american/",
        "text": "The idea that 80-90% of the indigenous population died within a century after first contact due to diseases is the one I grew up hearing, and it never seemed like it was trying to excuse Europeans because only racists and apologists say that white people didn't commit (and still do commit) atrocities against the Natives. However, Wikipedia says that many scholars contest this, and I've also seen a comment in here implying the decline in population was due to violence. So is this view now the dominant one?",
        "created_utc": 1676825935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are European swords better than Eastern swords?",
        "author": "cornunreality",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hsux/are_european_swords_better_than_eastern_swords/",
        "text": "",
        "created_utc": 1676825766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were the \"wild 90s\" following the collapse of the Soviet Union a phenomenon unique to Russia?",
        "author": "Silicon-Based",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hs1q/were_the_wild_90s_following_the_collapse_of_the/",
        "text": "It is commonly said that the 1990s in Russia was a period of unprecedented levels of poverty and crime in modern Russian history, from which the country was able to recover during the presidency of Vladimir Putin. Did the other post-Soviet states and states which used to be in the Soviet sphere of influence, e.g. Poland, experience the same level of economic disaster and decline in livelihood during the same time period, or was the transition to a market-based economy comparatively milder? If the answer to the latter question is affirmative, how come much smaller post-communist economies were able to avoid as deep of an economic crisis as had been undergone by Russia?",
        "created_utc": 1676825713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, i live in Brazil and I would like to ask something, as far as I know I don't se much about African culture in America, it seems that there is a unique black culture with maybe a little influence from original african culture, as in Brazil African culture is much more present and preserved be it",
        "author": "Main_Caterpillar_912",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hc0r/hi_i_live_in_brazil_and_i_would_like_to_ask/",
        "text": "",
        "created_utc": 1676824741,
        "upvote_ratio": 1.0
    },
    {
        "title": "African culture in America",
        "author": "Main_Caterpillar_912",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116hau9/african_culture_in_america/",
        "text": "[removed]",
        "created_utc": 1676824676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are there so many \"Fredericksburg Wine Countries\" in the USA?",
        "author": "Borne2Run",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116h3ko/why_are_there_so_many_fredericksburg_wine/",
        "text": "My wife and I are doing some wine tours. We noticed in Texas that there is a Fredericksburg Wine Country (sadly exports not permitted), a Frederick wine country in Maryland, and a Frederick Wine Festival in Virginia. \n\nDid German migrants in the 1800s just love wine and the name Frederick? Was there a famous wine afficianado named Frederick? Is it just a happy coincidence?",
        "created_utc": 1676824265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the etymology of English river names so often Celtic? As opposed to towns and villages where Celtic etymologies are a rarity.",
        "author": "SilasMarner77",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116fq8a/why_is_the_etymology_of_english_river_names_so/",
        "text": "",
        "created_utc": 1676822128,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common were \"their sister is really their mother\" arrangements?",
        "author": "mattwan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116ffsx/how_common_were_their_sister_is_really_their/",
        "text": "I'm particularly interested in the US from 1870-1950, but any times and places would be interesting.\n\nI grew up as a huge fan of the film version of \\*The Music Man\\*, and I eventually realized there could be a good reason that Marian is so much older than her brother Winthrop. When I rewatched for the first time in decades, I realized there's a line at the beginning of the \"Marion the Librarian\" number where Harold Hill implies what could be happening in the Paroo household, although Marian vehemently denies it.\n\nI know that grandparents raising their grandchildren as their own, without the grandchildren's knowledge, wasn't unheard of. It happened in my small hometown with at least one family in my parents' generations, it happened with my therapist's grandmother in I think the 1930s, l've seen it as trivia for some celebrities, it was used as a plot line in \\*Orange is the New Black\\*, and so on.\n\nRealizing that it had been implied in a popular work from midcentury made me wonder whether the audience was expected to understand the implication, and whether it would have been common knowledge for the characters in 1912 Ohio.\n\nDo we have an estimate of how common such arrangements were, and how well-known the prctice (if not specific cases) was?",
        "created_utc": 1676821747,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s the 1970s and I’m an American living in London. How easy is it for me to get a regular copy of my favourite newspaper to keep up with events back home?",
        "author": "SimpGanassi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/116f5oz/its_the_1970s_and_im_an_american_living_in_london/",
        "text": "",
        "created_utc": 1676821347,
        "upvote_ratio": 1.0
    }
]