[
    {
        "title": "Do historical foods still made today in that culture (kimchi for example) that require a lot of water only come from areas that had a steady supply of clean water?",
        "author": "newsmiths",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xiqe7/do_historical_foods_still_made_today_in_that/",
        "text": "",
        "created_utc": 1675909607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who Is The Warmonger?",
        "author": "Lemuria8",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xipyg/who_is_the_warmonger/",
        "text": " 01:27 - back in April (2022) according to an account in Foreign Policy Magazine negotiators from the governments of Russia and Ukraine met secretly and quote \"appeared to have tentatively agreed on the outlines of a negotiated interim settlement to end the war.\" \n\nThe terms of the deal were simple. Russia would withdraw its troops from Ukraine.\n\n1:46 - Ukraine would promise not to join NATO.\n1:48 - So each side would get the thing that it wants most simple and effective and it might have worked.\n\n1:55 - But the Biden Administration adamantly opposed this settlement. Biden's advisors didn't just want the Russians to leave Ukraine. That's what they told us they wanted on television.\n\n2:04 - But no! Biden's advisors wanted a total regime change war against Russia apparently to avenge the election of Donald Trump which they believed Putin was responsible for and they were willing to fight to the last Ukrainian to get it.\n \n2:18 - So on April 9th of this year the White House dispatched its hapless cutout then\n2:22 - British prime minister Boris Johnson to Kiev according to Ukrainian news media Johnson communicated two messages to the Zielinski government quote:\n2:30 - the first is that Putin is a war criminal.  He should be pressured not negotiated with and the second is that even if Ukraine is ready to sign some agreements on guarantees with Putin the West is not.\n \n2:44 - In other words who cares what the Ukrainians want America and the UK demand total war with Russia regime change war with Russia and of course the Ukrainians caught IN the middle had no choice but to concede so days later the peace negotiations fell apart\n \n2:59 - This was virtually unreported at the time but it was the turning point in the war in Ukraine this was the moment where the goal changed from restoring Ukraine to what it was before the invasion and that seems reasonable to everyone in the west to something very different to a were designed to topple Vladimir Putin just like we toppled Saddam Hussein and then hoping for the best afterward that is clearly insane and dangerous but that's where we are and from that point on everything changed and that is how we got to where we are today which is the closest we have ever been to nuclear conflict in history.\n \n﻿\nTucker Carlson Tonight Thu. 9/22/22 FULL | BREAKING FOX NEWS  Ukraine War - Biden wants regime change in Russia \n4,957 viewsSep 22, 2022  2.3K (file created Thu. Sep. 22, 2022)\nhttps://youtu.be/1MJDvr-1Z-A",
        "created_utc": 1675909573,
        "upvote_ratio": 1.0
    },
    {
        "title": "History of the British Army between World Wars",
        "author": "Hall_For",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xi118/history_of_the_british_army_between_world_wars/",
        "text": "[removed]",
        "created_utc": 1675907751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Ancient Romans write dates on their buildings (in Roman numerals)?",
        "author": "Thimbellina",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xhwn6/did_ancient_romans_write_dates_on_their_buildings/",
        "text": "e.g. [https://i.imgur.com/JPqixXa.jpg](https://i.imgur.com/JPqixXa.jpg)\n\nIf not in Ancient Rome, does anyone know when the practice of writing dates on buildings began?  \n\n&amp;#x200B;\n\n(pic source this post: [https://www.reddit.com/r/mildlyinteresting/comments/1j0w3n/i\\_spotted\\_the\\_longest\\_year\\_to\\_date\\_in\\_roman/](https://www.reddit.com/r/mildlyinteresting/comments/1j0w3n/i_spotted_the_longest_year_to_date_in_roman/))",
        "created_utc": 1675907425,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Ancient Egyptians sheath their khopesh?",
        "author": "NorseMtnDew",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xhwi3/how_did_ancient_egyptians_sheath_their_khopesh/",
        "text": "I've not been able to find a pic of a scabbard or sheath",
        "created_utc": 1675907416,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much did Octave Chanute contribute to the Wright Brother's airplane?",
        "author": "jupiterkansas",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xh5oc/how_much_did_octave_chanute_contribute_to_the/",
        "text": "",
        "created_utc": 1675905467,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone tell me the name of this (possibly Canadian) spy who supposedly said she got through Nazis torture by thinking of her piano lessons?",
        "author": "Electra0319",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xgj3r/can_anyone_tell_me_the_name_of_this_possibly/",
        "text": "My grandfather was telling me a story about how his great grandmother was mentioned by name in \"Look\" magazine when they interviewed a spy who was captured during WW2. \n\naccording to him she talked about what helped distract her from the torture was thinking of her piano lessons and mentioned my great great grandmother by name. I'm not really sure how true it is but most his other stories are true so I'm inclined to believe it but thought I'd ask here. \n\nShe lived in Saskatchewan. So I feel like the spy must have been from there too but a lot of the finer details like that he didn't remember \n\nThanks a bunch!",
        "created_utc": 1675903851,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the book “Last Days of the Romanovs” the author says the former czar had bad halitosis in the last months. How could this have been known and recorded?",
        "author": "MGY4143N5014W",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xflt1/in_the_book_last_days_of_the_romanovs_the_author/",
        "text": "The author says Nicholas was still smoking and had some dental problems “resulting in severe halitosis.” Who would have recorded this? Who could have gotten close enough to know? I never saw it in Alexandra’s writing and I don’t have access to any English language versions of what the guards recorded. Thank you.",
        "created_utc": 1675901520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Elena Ceaucescu’s mother found in the basement of the palace after the couple fled Bucharest in 1989? Details below.",
        "author": "MGY4143N5014W",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xfhw9/was_elena_ceaucescus_mother_found_in_the_basement/",
        "text": "In the Ted Koppel documentary “Death of a Dictator” says that a 103-year old woman was found in the basement of the palace looking for her medicine. She was brought to a hospital where she bit and clawed at nurses. She died a few days later. It is believed this was Elena’s mother. I have never seen it referenced elsewhere. Is it true?",
        "created_utc": 1675901252,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much of an influence did New Netherland have on the Declaration of Independence?",
        "author": "ResidentRunner1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xfh6x/how_much_of_an_influence_did_new_netherland_have/",
        "text": "",
        "created_utc": 1675901204,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is atop the Sphinx?",
        "author": "Amarahovski",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xf7s2/what_is_atop_the_sphinx/",
        "text": "Arial images show a circular, off-colored circular shape atop the Sphinx's head.\n\nWhat the heck is it?",
        "created_utc": 1675900605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any sources on literacy rates in the middle east in the high middle ages?",
        "author": "lazerbabyo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xer0b/any_sources_on_literacy_rates_in_the_middle_east/",
        "text": "Can anyone provide a source with information on the literacy rates in Arab countries in the high middle ages? Need to know who could read in the Muslim world during the Crusades (like just noblemen or peasants as well?) and need a source to cite. Everywhere I look only mentions the literacy rates in medieval Europe. \n\nThanks!!",
        "created_utc": 1675899475,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were Mexican-Indian relations in the Mexican Cession area? How did it compare to/contrast with Indian relations with New Spain and the USA?",
        "author": "edwardtaughtme",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xejr1/what_were_mexicanindian_relations_in_the_mexican/",
        "text": "",
        "created_utc": 1675898991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historic battles and warriors perspectives?",
        "author": "Phenomenon101",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xeh8e/historic_battles_and_warriors_perspectives/",
        "text": "When looking at historic battles I see maybe something as far back as the US Civil War having some soldiers explaining the bleakness and basically the horror of battle.  In much older battles, are there any fighters that gave 1st hand account with a realistic perspective of how they felt in battle vs stories that seem to glorify them as legends and having bold courageous attitudes?  If anything, recent times have displayed that war is hell, but ancient times don't appear to share that perspective per documents of their time",
        "created_utc": 1675898814,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were some of the cultural, religious, and political differences between Louisiana Creoles and Anglo-Americans?",
        "author": "BlackAnimator2020",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xdr5t/what_were_some_of_the_cultural_religious_and/",
        "text": "",
        "created_utc": 1675897171,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the state of Suevic and Visigothic Hispania in relation to roman rule?",
        "author": "Torada",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xdaun/what_was_the_state_of_suevic_and_visigothic/",
        "text": "As far as I know, the Germanic invaders were much more tolerant towards women for instance but I don't know about their law or customs towards other religions (Jews, roman pagans, \"native\" pagans) by their tribal, arianist/catholic points of view, or even what people they persecuted or viewed as unworthy of common rights. Did they maintain slavery? Was their slavery different from rome's? And most of all, do we know how people felt about their new \"barbarian\" rulers?",
        "created_utc": 1675896137,
        "upvote_ratio": 1.0
    },
    {
        "title": "In The Northman (2022), the vikings put a bunch of women in a barn and then set it on fire. Was this a real practice? Why would they do that?",
        "author": "Logan_Maddox",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xcvs4/in_the_northman_2022_the_vikings_put_a_bunch_of/",
        "text": "In the movie, this happens in the Rus'.\n\nIf so, why wouldn't they take those folks as slaves? They take other people as slaves, but not those. Even if they didn't have space in the ship to steal them and sell them somewhere else, wouldn't it make more sense to leave the village and then come back a couple years down the line, when the population normalized, to get more slaves?\n\nOr is it just an exaggeration of the movie?",
        "created_utc": 1675895181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why wasn’t a coup attempt made against Gorbachev sometime in say 1988 when Perestroika and Glasnost hadn’t eroded Soviet influence in Eastern Europe yet?",
        "author": "Harvickfan4Life",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xcp2s/why_wasnt_a_coup_attempt_made_against_gorbachev/",
        "text": "",
        "created_utc": 1675894763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was college/university culture so popular in the USA in the 1920's? (If it really was!)",
        "author": "Routine_Network_2906",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xceqv/why_was_collegeuniversity_culture_so_popular_in/",
        "text": "In the movie Babylon, the young star is in a college-themed movie, and I have read or seen lots of pop culture set in the 1920's (including Belles on Their Toes) with characters idolizing college/university students. Was this a trend at the time, and if so, why? Was it the first time students of different socioeconomic backgrounds widely attended college, or the first time women were admitted? Was it part of a larger evolution of teenagers as a specific group separate from the family unit?",
        "created_utc": 1675894103,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the history of British monarchs, Mary I and Mary II both had husbands who were styled 'King' and were co-regnant with them, but Anne's, Victoria's and Elizabeth II's husbands were merely princes. What was the reason for this change in practice? Was it different in each case?",
        "author": "JLASish",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xbady/in_the_history_of_british_monarchs_mary_i_and/",
        "text": "(I am aware that Prince Phillip's life extends into the period covered by the 20-year rule, but I presume the question was long-settled by then.)\n\nThis question came to me in reading the [debate in the House of Commons](https://hansard.parliament.uk/Commons/1936-12-10/debates/420f978e-7bc3-49d2-88ab-479015da3ff8/CommonsChamber#contribution-a894c769-7ce2-4b1a-9b30-0003ec58e0c5) recorded in Hansard on recieving the message from King Edward VIII announcing his intention to abdicate. There were mentions of the discarded possibility of a morganatic marriage, but, as Sir Archibald Sinclair put it:  \n&gt; It is not only the law of our country but it is also, I believe, a sound, healthy and essential element in the monarchial principle itself, that the lady whom the King marries must become Queen and share with him, before the whole people, the glorious burden of sovereignty.\n\nDid anyone ever address the apparent discrepancy between the principle described in the quote and the decision not to style the latter queens' husbands as King?\n\nWould I be right to suspect the reason is down to the sovereignty Philip of Spain and William III already had or expected to have in their own rights?",
        "created_utc": 1675891546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Type of crime in 1930s Northern Ireland where they wouldn’t arrest you, but you would be told to leave and never come back?",
        "author": "atathasninelives",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xb308/type_of_crime_in_1930s_northern_ireland_where/",
        "text": "Backstory: My grandpa never met his dad, because before he was born, his dad did some sort of crime that was so severe that his family erased him from the books and never spoke to him again. However, it doesn’t sound like he was actually arrested for anything, just that the police told him to pack a bag and leave. He didn’t even divorce from his wife, it was so sudden. Everyone who knew what happened was incredibly tight lipped about it and carried it to the grave.\n\nMy question is: what type of crime would constitute this behavior at this time and place? It happened in 1935, in Belfast. Would it have to be something very taboo? He didn’t have any local power or influence or anything, he was just some guy.\n\n(Apologies if this isn’t the right sub for this question!)",
        "created_utc": 1675891076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were the nazis open about the holocaust and embrace it, or did they deny it.",
        "author": "Spomge",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xaw5k/were_the_nazis_open_about_the_holocaust_and/",
        "text": "",
        "created_utc": 1675890645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Romans have a paradoxical view of themselves?",
        "author": "Darth_Yes",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xav96/did_the_romans_have_a_paradoxical_view_of/",
        "text": "The origins of the Roman people as depicted in the stories of Romulus and Remus, paint a picture of the Roman people originating from poverty stricken farmers, bandits and despots from surrounding areas. It seems the Romans maintained a sense of pride in their rough beginnings throughout their history. Yet, their society was marked by a significant divide between the wealthy and the poor, with the latter being referred to as 'plebs' and often looked down upon. However, later in history, the 'plebs' themselves embraced this label. Can this seemingly conflicting view of their origins and societal structure be considered a paradox in the Roman self-perception?",
        "created_utc": 1675890593,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the fate of German speaking Jews in territories east of the Oder Neisse Line?",
        "author": "shlm_throwaway",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xa4s1/what_was_the_fate_of_german_speaking_jews_in/",
        "text": "For Jews who survived &amp;/or escaped the horrors of the Holocaust &amp; were culturally assimilated into German culture or Jews who spoke German as a first language, such as many Jewish communities in Silesia, were they subject to the expulsions that Germans faced that lived east of the Oder Neisse line or were they exempt from this? If so how were they viewed in the countries they eventually became part of?",
        "created_utc": 1675888877,
        "upvote_ratio": 1.0
    },
    {
        "title": "How have hordes become associated with swarming numerical superiority?",
        "author": "DerpAnarchist",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10xa3jz/how_have_hordes_become_associated_with_swarming/",
        "text": "If anything, one would assume that nomads would only be able to maintain rather low populations, as opposed to sedentary ones. The Mongol invasions for example seemed to have been consisting of rather small armies and warbands, usually outnumbered by whatever force opposed them. This begs the question as to why? So how did the stereotype of crude, poorly armed human waves of ragged barbarians come to be?",
        "created_utc": 1675888799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historian authors how do you make your papers engaging while providing more scope?",
        "author": "TankerRed1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x9lnx/historian_authors_how_do_you_make_your_papers/",
        "text": "I am working on being published by my school press. I wrote a paper during a staff ride that I am sending up. Since I wrote it during a staff ride, I did not have to provide much scope. I now need to add more scope to my paper which won't be hard for me. The problem I feel like I am going to run into is that my readers will become disengaged by the sheer amount of information that I will have to provide. I want to tell the story and why it is important to my field. \n\nI am specifically writing about Lt. John S. \"Jocko\" Thompson's attack on the Grave bridge during Operation Market Garden.",
        "created_utc": 1675887644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we know aspects of the daily life of Roman Emperor Diocletian after his retirement?",
        "author": "buy_some_winrar",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x9hrz/do_we_know_aspects_of_the_daily_life_of_roman/",
        "text": "It is said he retired to his cabbage farm, but what luxuries did he afford in his retirement? Did he do an labor himself or did he sit on his farm observing his servants? Did he pay any attention to the events of the empire while in retirement?",
        "created_utc": 1675887396,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Peninsular War (1807-1814) resulted in Napoleonic French Soldiers and Spanish guerillas engaging in back and forth massacres of each other (as far as I understand). How did Napoleon view the massacres conducted by French Soldiers? Did he condone, condemn, or ignore it?",
        "author": "InternationalFailure",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x9gt4/the_peninsular_war_18071814_resulted_in/",
        "text": "",
        "created_utc": 1675887337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historian authors how do you make your papers engaging while providing more scope.",
        "author": "TankerRed1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x9ga5/historian_authors_how_do_you_make_your_papers/",
        "text": "[removed]",
        "created_utc": 1675887307,
        "upvote_ratio": 1.0
    },
    {
        "title": "When and where did the practice of depicting people on currency originate?",
        "author": "slipshod_crackpot",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x9g06/when_and_where_did_the_practice_of_depicting/",
        "text": "Who was the first person depicted on currency? Were they a political leader and shown in portrait style (similar to modern practice for coins in the US)? Can we pinpoint where this idea originated, or what iconography this practice evolved from? What do we know about the political aims of this practice when it was first done?",
        "created_utc": 1675887289,
        "upvote_ratio": 1.0
    },
    {
        "title": "When and where did the practice of depicting a political leader(s) on currency originate?",
        "author": "slipshod_crackpot",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x96ej/when_and_where_did_the_practice_of_depicting_a/",
        "text": "Is it known whether this practice arose independently more than once in human history? Did it evolve from some other type of simpler iconography? What do we know about the political aims of this practice when it was first done?",
        "created_utc": 1675886677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was there any reaction to Oliver Cromwell's conquest of Ireland (1649-53) from Catholic rulers of Europe?",
        "author": "Emergency_Throat9217",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x93ti/was_there_any_reaction_to_oliver_cromwells/",
        "text": "",
        "created_utc": 1675886509,
        "upvote_ratio": 1.0
    },
    {
        "title": "What made the city of Lyon go from a centre of counter-revolution during the French Revolution and a scene of devastation during the Terror to a centre of Bonapartism by the end of Napoleon's reign?",
        "author": "Fitzfuzzington",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x91o6/what_made_the_city_of_lyon_go_from_a_centre_of/",
        "text": "I'm slightly baffled by this. What happened to induce the people of Lyon to throw their support behind Napoleon? Is it simply a case of \"It's the economy, stupid\"?",
        "created_utc": 1675886387,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the prevailing opinion in Great Britain concerning Harry and Meghan?",
        "author": "SingLikeTinaTurner",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x8uc9/what_is_the_prevailing_opinion_in_great_britain/",
        "text": "We read so many conflicting stories, what's the truth? Where do the people currently stand on the issue?",
        "created_utc": 1675885893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Lincoln actually sell slaves inherited by Mary Todd or is this hogwash?",
        "author": "JeffBezosindisguise",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x8olw/did_lincoln_actually_sell_slaves_inherited_by/",
        "text": "",
        "created_utc": 1675885508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could anyone help me find a town in Greece?",
        "author": "lychiipea_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x8bmp/could_anyone_help_me_find_a_town_in_greece/",
        "text": " Hello, all. Recently, through a DNA test, I found out my great-great grandfather was from Greece. And through the website familysearch I was able to find his WWI draft, where it says he was born in Thadion, Greece. But several searches doesn't bring up a Thadion, no matter how hard I try to look it up. Of course, with time the town's name mightve changed. That's why I've come to ask if anyone could help me figure out where it is/what it would be called today. \n\nThank you in advance.",
        "created_utc": 1675884635,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help finding a town in Greece.",
        "author": "lychiipea_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x8afs/i_need_help_finding_a_town_in_greece/",
        "text": "[removed]",
        "created_utc": 1675884559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which US state's natural landscape has been altered the most since the arrival of Europeans?",
        "author": "HewsClues",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x88o0/which_us_states_natural_landscape_has_been/",
        "text": "I'm from Illinois, where 2/3rds of the state was once tall grass prairie. Now, 99.9% of that has been wiped out, which got me to thinking about if there are comparable states?",
        "created_utc": 1675884435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did The Colosseum in Rome have \"seat prices\" for different sections like modern theaters and arenas? If so, do we know how any specifics about the pricing differences?",
        "author": "Unfrozen__Caveman",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x869z/did_the_colosseum_in_rome_have_seat_prices_for/",
        "text": "",
        "created_utc": 1675884271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could Japan have still continued with its “southern expansion doctrine” without attacking the USA?",
        "author": "Comprehensive-Ad1593",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x7krc/could_japan_have_still_continued_with_its/",
        "text": "Would Japan have been able to take all of the western colonies they ended up taking in the Pacific without attacking the USA?",
        "created_utc": 1675882861,
        "upvote_ratio": 1.0
    },
    {
        "title": "What religion has been the most violent in history?",
        "author": "TheTruist1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x78tw/what_religion_has_been_the_most_violent_in_history/",
        "text": "Most violent in terms of the most people coercively subjugated, forcibly converted, tortured, killed, etc.\n\nIs there any semblance of a consensus on this question among professional historians?",
        "created_utc": 1675882055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for exact quote about the House of Representatives by one of the founding fathers but can't find it",
        "author": "CaptainStack",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x78bu/looking_for_exact_quote_about_the_house_of/",
        "text": "[removed]",
        "created_utc": 1675882017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books about a single year in world history?",
        "author": "Front_Porch_Sunrise",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x6zip/books_about_a_single_year_in_world_history/",
        "text": "I am looking for books about a single year or short period of time, encompassing most of the world. For example, a book about the year 1200, and what was happening around the world at the time. Not sure if this kind of book exists but I thought it would be interesting. TIA.",
        "created_utc": 1675881425,
        "upvote_ratio": 1.0
    },
    {
        "title": "why throughout the last 2 millennia have white Europeans ruled/colonised the globe? why did early European settlers develop white skin and rule the world when early African settlers had black skin and were enslaved? asking out of pure curiosity as assuming diet/natural resources had an input.",
        "author": "Direct_Director_1758",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x6hw9/why_throughout_the_last_2_millennia_have_white/",
        "text": "",
        "created_utc": 1675880183,
        "upvote_ratio": 1.0
    },
    {
        "title": "How nomadic really were the tribes of Arabia during the time of Muhammad?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x6fro/how_nomadic_really_were_the_tribes_of_arabia/",
        "text": "",
        "created_utc": 1675880041,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did the economies of US/Canada/Mexico diverge?",
        "author": "middlewestthrowaway",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x6drf/when_did_the_economies_of_uscanadamexico_diverge/",
        "text": "I was wondering what were the major influences that caused Mexico's economy to fall behind the US and Canada? Is there a specific turning point or time period that we can identify? Or alternatively, how has the Canadian economy kept paced with the US? I mean this as general standard of living or GDP per capita; please correct me if I am using the wrong metric.",
        "created_utc": 1675879908,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the US maintain Peleliu if Babelthuap had a large Japanese force on it?",
        "author": "TheJakeanator272",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x6arp/how_did_the_us_maintain_peleliu_if_babelthuap_had/",
        "text": "Just doing quick searches I couldn’t find much on this. All I could find was something saying the US bypassed the island. However, it would’ve seemed dangerous to operate out of if the bigger island just north was housing Japanese forces as well.\n\nAlternatively, why didn’t Japan send more troops from the bigger island as support?\n\nJust wanted to more details outside of Peleliu.",
        "created_utc": 1675879714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decapitation vs hanging?",
        "author": "Illithilitch",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x6aen/decapitation_vs_hanging/",
        "text": "To be clear, I mean drop hanging, with a noose. Not gibbets, crucifixion, or strangulation (lynching). By decapitation, I am primarily interested in swords or axes, not guillotines.\n\nDo there tend to be cultural or religious differences? What trends exist between times, crimes, and cultures where decapitation is used vs hanging?",
        "created_utc": 1675879690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decapitation vs hanging",
        "author": "Illithilitch",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x69r0/decapitation_vs_hanging/",
        "text": "[removed]",
        "created_utc": 1675879648,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Latin teacher told us about a sacrifice called Devotio, usually done by roman's generals, I find this very interesting, but Wikipedia doesn't give much information. Where did this ritual come from? It was from some more ancient tradition? What was the public opinion about them?",
        "author": "Dom11halfelf",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x5xf4/my_latin_teacher_told_us_about_a_sacrifice_called/",
        "text": "Honestly, I just want to know more about it , I just find it fascinating.",
        "created_utc": 1675878841,
        "upvote_ratio": 1.0
    },
    {
        "title": "When have Commodore Perry-style actions become illegal in the USA?",
        "author": "GinofromUkraine",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x5osx/when_have_commodore_perrystyle_actions_become/",
        "text": "By modern standards Commodore Perry's expedition is something absolutely outrageous: bombing civilians basically to send a message to the Japanese government: TRADE WITH US OR BE KILLED (you may say I simplify the expedition's goals or actions, nevertheless the bombing happened and it was a message). \n\nHowever, as I understand, no law of the arguably most democratic country in the world prohibited something like this. And international law, if it existed at all, has applied only to European countries and their (former) colonies.\n\nSo, when did this change? If it did of course. :-) With the advent of the UN and its statutes after WWII? Does any specific internal US law/legislation exist that would make it possible to sue persons permitting and/or arranging a modern version of Commodore Perry expedition?",
        "created_utc": 1675878257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations on some stories about Jewish resistance, preferably prior to the 1800s?",
        "author": "Qarakhanid",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x5o67/looking_for_recommendations_on_some_stories_about/",
        "text": "Much of Jewish history is filled with stories of persecution and diaspora. I've gone out of my way to find stories of resistance or strength so I can be proud of my peoples past. So far I have done readings on the Khazarian Empire, The Jewish Princedom in the Carolingian Empire, The Jewish-Roman Wars, and Jewish Piracy. What are some other stories that follow similar veins?",
        "created_utc": 1675878214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations on stories about Jewish resistance, preferably anytime before the 1800s.",
        "author": "Qarakhanid",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x5mjv/looking_for_recommendations_on_stories_about/",
        "text": "[removed]",
        "created_utc": 1675878104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any aristocratic families besides the Windsors who claim the English throne?",
        "author": "Mihklo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x5en6/are_there_any_aristocratic_families_besides_the/",
        "text": "If there are, what is the status of these families? And if there aren’t, have there been any recent aristocratic dynasties that recently used to claim the British crown but now no longer do?",
        "created_utc": 1675877585,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be a good starting point for researching the validity and/or historical accuracy of the Bible?",
        "author": "Throwaway28640",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x5d4v/what_would_be_a_good_starting_point_for/",
        "text": "I would like to know more about how well the bible lines up with known history. I've always heard that it supposedly lines up fairly well with other historical documents, but I've also only heard that from christians, so I would like to research this for myself rather than relying on what people have told me",
        "created_utc": 1675877488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the Martim Moniz story historically sound?",
        "author": "Professional_Cat_437",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x56nh/is_the_martim_moniz_story_historically_sound/",
        "text": "",
        "created_utc": 1675877059,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard from this sub that South-East Asia used to be sparsely populated. However, today Indonesia is the 4th most populous country and Java has more than 100 million inhabitants, so what change?",
        "author": "Fyno9",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x554a/i_heard_from_this_sub_that_southeast_asia_used_to/",
        "text": "",
        "created_utc": 1675876953,
        "upvote_ratio": 1.0
    },
    {
        "title": "What drove the Spanish people to such intense division that basically the second the civil war started they began massacring each other?",
        "author": "sambarlien",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x4rsx/what_drove_the_spanish_people_to_such_intense/",
        "text": "Forgive the dramatic title, but reading about the Spanish civil war, far more so than others it seems they were so quick to start massacres and mass executions?\n\nThis was specifically inspired by the massacre at Badajoz",
        "created_utc": 1675876085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short Answers to Simple Questions | February 08, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x4ke8/short_answers_to_simple_questions_february_08_2023/",
        "text": "[Previous weeks!](https://www.reddit.com/r/AskHistorians/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ASASQ)\n\n**Please Be Aware**: We expect everyone to read the rules and guidelines of this thread. Mods *will* remove questions which we deem to be too involved for the theme in place here. We *will* remove answers which don't include a source. These removals will be without notice. Please follow the rules.\n\nSome questions people have just don't require depth. This thread is a recurring feature intended to provide a space for those simple, straight forward questions that are otherwise unsuited for the format of the subreddit.\n\nHere are the ground rules:\n\n* Top Level Posts should be questions in their own right.\n* Questions should be clear and specific in the information that they are asking for.\n* Questions which ask about broader concepts may be removed at the discretion of the Mod Team and redirected to post as a standalone question.\n* We realize that in some cases, users may pose questions that they don't realize are more complicated than they think. In these cases, we will suggest reposting as a stand-alone question.\n* Answers **MUST** be *properly* sourced to respectable literature. Unlike regular questions in the sub where sources are only required upon request, the lack of a source *will* result in removal of the answer.\n* Academic secondary sources are preferred. Tertiary sources are acceptable *if* they are of academic rigor (such as a book from the 'Oxford Companion' series, or a reference work from an academic press).\n* The *only* rule being relaxed here is with regard to depth, insofar as the anticipated questions are ones which do not require it. All other rules of the subreddit are in force.",
        "created_utc": 1675875613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Germanic literature (specifically epics) in the Middle Ages ever written, or just communicated verbally until it was eventually written down hundreds of years later?",
        "author": "julietbrea",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x4gwo/was_germanic_literature_specifically_epics_in_the/",
        "text": "Learning about Germanic tribes in my online history college course. We have to write a short essay about the effect Feudalism had on literature in the Middle Ages, but our textbook only gives a lousy 5 sentence paragraph about the \"epic poems\" of personal valor and heroism, and nothing else. Understanding how these poems and other forms of literature were communicated across their society is something I would also like to understand. I'm assuming if poems were communicated exclusively verbally, over *hundreds* of years, when they were finally written down, they weren't entirely the same as the original, were they? Just overtime, I'm sure people confused details, retold it incorrectly, and small details got changed. \n\nI am also wondering what *forms* of literature were prevalent in their society? Written, verbal, poems, books, songs? And to be clear, the questions in this post are not the prompt for the essay, and in answering it you are not just like doing my essay for me, I just cannot find a good source online to answer my questions or I'm getting conflicting information, and I don't know how to proceed in my essay without a clear answer about what \"literature\" was even apart of this culture.",
        "created_utc": 1675875389,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do we know about the Acheamenids Eastern Affairs and relationships?",
        "author": "Satanairn",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x49x8/what_do_we_know_about_the_acheamenids_eastern/",
        "text": "I'm interested in the first Persian Empire aka Acheamenids, but since their history is written by Greeks, everything they wrote revolves around Greece, which I don't think was even their biggest concern. There are mentions of Egyptians and Babylonians, but they are technically western as well and in relation to Greeks as well. What do we know about Eastern affairs of Acheamenids? What was their relationship with India? did they know about China? And of course the Scythians or the Saka. And even the internal affairs, in the Eastern Satrapis.",
        "created_utc": 1675874935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acheamenids eastern affairs",
        "author": "Satanairn",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x4760/acheamenids_eastern_affairs/",
        "text": "[removed]",
        "created_utc": 1675874751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are some of the most underrated Vikings in history?",
        "author": "Competitive-Toe8253",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x3u83/who_are_some_of_the_most_underrated_vikings_in/",
        "text": "",
        "created_utc": 1675873948,
        "upvote_ratio": 1.0
    },
    {
        "title": "How expensive were engravings and who owned them between 1790-1820?",
        "author": "GameGabster",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x2ktx/how_expensive_were_engravings_and_who_owned_them/",
        "text": "As the question suggests, I am curious to know how expensive engravings, coloured or not, were in the French Revolutionary period in Europe and what social class typically owned them? Was it purely aimed at the urban middle upper class? Or did the upper classes also own engravings for lack of oil paintings?",
        "created_utc": 1675872328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fratricide and Civil War in the Ottoman Empire: How was it viewed by citizens of the empire?",
        "author": "EvanFields",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x2iz1/fratricide_and_civil_war_in_the_ottoman_empire/",
        "text": "It’s always been very surprising to see how many Şehzades killed each other in order to become Sultan. Would this pattern of fratricide not make relationships between the sons of the Sultan extremely difficult as well as invite a lot of bad PR?\n\nWhat was the general opinion of the public regarding these matters? Was it accepted as the way things were or was it disdained by people?\n\nI’m curious to learn how this tradition of consolidating power became so accepted and sustainable given the natural paranoia and mistrust it would create among the princes.",
        "created_utc": 1675872276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Boston Tea party start the association between Brits and tea? Or was he significantly more popular in Britain than elsewhere before that?",
        "author": "14159548210",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x2i1j/did_the_boston_tea_party_start_the_association/",
        "text": "",
        "created_utc": 1675872248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't the Mongols go south/south-East?",
        "author": "omgsoftcats",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x2a57/why_didnt_the_mongols_go_southsoutheast/",
        "text": "During the Mongol movement, why didn't the go and attack south/south-east regions? At the time I guess India was incredibly wealthy, and south middle eastern countries too.\n\nWhy didn't they head down there and take the riches? Were they worried about defeat? rough terrain for their horses? weather? or was it something else?",
        "created_utc": 1675872032,
        "upvote_ratio": 1.0
    },
    {
        "title": "As an indigenous person in temperate regions of northeastern america in the century before colonization began, how much of my diet would be comprised of wild food versus cultivated foods? What wild plant foods were key to my diet and what actions did i take to ensure the sustainable harvest and/or \"",
        "author": "littlebryozoa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x1hge/as_an_indigenous_person_in_temperate_regions_of/",
        "text": "",
        "created_utc": 1675871239,
        "upvote_ratio": 1.0
    },
    {
        "title": "indigenous relationship with wild foods in northeastern america before colonization",
        "author": "littlebryozoa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x1d8t/indigenous_relationship_with_wild_foods_in/",
        "text": "[removed]",
        "created_utc": 1675871122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the \"Shocked Mussolini\" photo real?",
        "author": "Yolverine71",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x1cki/is_the_shocked_mussolini_photo_real/",
        "text": "I'm not allowed to post images, but you probably know the photo i'm talking about. It used in some memes (especially the Greco-Italian War).",
        "created_utc": 1675871105,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to Wikipedia, a Finnish historian claims that the ancient Mesopotamian deities Ishtar and Tammuz were still worshipped in the city of Mardin (modern Turkey) as late as the 18th century. Is this true? Did the worship of these gods really survive that long?",
        "author": "DarestThouKillMarius",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x0enj/according_to_wikipedia_a_finnish_historian_claims/",
        "text": "The citation is from a paper *Assyrian Identity in Ancient Times and Today* by Simo Parpola (2004).\n\nIt seems incredible to me that even a small enclave of worshippers would have survived Christianization *and Islamicization* well into the early modern period. Is there light that can be shed on this?",
        "created_utc": 1675870156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any historical basis for this article of fantasy clothing?",
        "author": "StoatStonksNow",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x09zc/is_there_any_historical_basis_for_this_article_of/",
        "text": "There’s an article of clothing that shows up fairly frequently in fantasy and science fiction, that looks like a sort of structured capelet. Here is an [example](https://static.wikia.nocookie.net/the-demonic-paradise/images/7/7e/Necromancer.jpg/revision/latest?cb=20161013133036). Shrugs and capelets are common enough historically, but this type of piece is supported, standing up from the shoulders.\n\nIs this based on an actual historical article of clothing? Did people ever wear anything like this?",
        "created_utc": 1675870023,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did the Italian Mafia think of the massive influx of cocaine in the 70’s and 80’s? What did they think of the Columbian Cartel, Pablo Escobar etc?",
        "author": "idontgiveafmf",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10x03y8/what_did_the_italian_mafia_think_of_the_massive/",
        "text": "",
        "created_utc": 1675869850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perfidious Albion! England gained a reputation in the 18th and 19th century for not keeping its word in international agreements, hence the coining of the phrase. Was this deserved? Was England particularly perfidious?",
        "author": "saurons_scion",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wzvjv/perfidious_albion_england_gained_a_reputation_in/",
        "text": "",
        "created_utc": 1675869612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calling all history lover and people with history profession jobs, what was the moment or subject that sparked your love for history?",
        "author": "AresTheLoneWulf",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wzh0x/calling_all_history_lover_and_people_with_history/",
        "text": "",
        "created_utc": 1675869201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Angkor wat and construction time (mainstream history)",
        "author": "EitherIdeal1538",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wze5m/angkor_wat_and_construction_time_mainstream/",
        "text": "[removed]",
        "created_utc": 1675869121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mesopotamia book recs",
        "author": "throwaway62626171727",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wz4lp/mesopotamia_book_recs/",
        "text": "[removed]",
        "created_utc": 1675868863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have historical figures attributed many inventions/decisions as \"it came to me in a dream\"? If so, What are the ones that stick out the most in your fields?",
        "author": "-Jesus-Of-Nazareth-",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wygpr/have_historical_figures_attributed_many/",
        "text": "",
        "created_utc": 1675867490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were psychedelics used historically in Southeast Asia? (specifically in Maritime Southeast Asia before the spread of Islam in the region)",
        "author": "thevoidsdiary",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wy40o/were_psychedelics_used_historically_in_southeast/",
        "text": "Hello everyone.\n\nApologies if this is too broad, I do not have much experience in the field. \n\nI have been looking at historical psychedelic use in Asia and was curious about psychedelic use in Maritime Southeast Asia. I have read a section on a brief history of psychedelics and it seems as though the environment is not favourable in the region (as it is in New World tropics) however, some psychedelic species are still found in the region. \n\nHence, although limited, would past civilisations in Maritime Southeast Asia have found a use for these psychedelics? (for religious, or medicinal utility). I've looked at Malay Magic (and I may have missed something) but it does not seem like there was extensive psychedelic use in the region.\n\nI also welcome any information on psychedelic use after the spread of Islam in the region.\n\nThank you so much!",
        "created_utc": 1675866591,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the state of Topfreedom in USSR?",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wy3p9/what_was_the_state_of_topfreedom_in_ussr/",
        "text": "",
        "created_utc": 1675866567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Queen Victoria gave us Victorian Era. Elizabeth, Elizabethan. Edwardian. Now new King Charles, so the new Era is called what?",
        "author": "jaeldi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wy3ji/queen_victoria_gave_us_victorian_era_elizabeth/",
        "text": "",
        "created_utc": 1675866555,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did prominent Athenians think about Roman expansion?",
        "author": "steadyachiever",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wxxg1/what_did_prominent_athenians_think_about_roman/",
        "text": "I am familiar with Athenian resistance to Macedonian hegemony (e.g. Demosthenes’ speeches) but I’ve never read about the Athenian perspective on Roman expansion. Do any Athenian sources survive that discuss the growing power of Rome? Did they view Rome as a liberator from Macedonia? Since even Macedonians were seen as “non-Greek”, were Romans viewed as total barbarians? If so, when did that viewpoint change?",
        "created_utc": 1675866114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were you allowed to look into the eyes of the Aztec and Inca rulers?",
        "author": "Valorandilir",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wxm0g/were_you_allowed_to_look_into_the_eyes_of_the/",
        "text": "hello there fellow historians. first of all, I studied history in switzerland and it is super hard to take any courses on premodern non-european topics. additionally, I had a personal focus on East Asia and the trade in the Indian Ocean and that is why I basically know nothing about the precolumbian american history\\^\\^  \n\n\nThe last few days, I watched a german documentary series called \"Söhne der Sonne\" (engl. Sons of the Sun). It contains of three 50min episodes and each focuses on one of the big civilisations of the americas (Maya, Incas, Aztecs), Overall, a quite good documentary including historians, archaeologists and anthropologists talking about the big achievements in science and society, great digital reconstructions, archeological evidence, research overview and an acceptable use of historic re-enactment of scenes.  \n\n\nThere was one thing that made me thinking. In the Inca episode, they were describing that the Inca was a kind of god king whom you were not allowed to look into the eyes. In the next episode about the Aztecs, they mentioned the same about Moctezuma but immediatly an Anthropologists named Dr. Lane Fargher added, that the not looking into the eyes was invented in colonial times to make him look like a tyrannical ruler.  \n\n\nso basically my question is, did the spanish make up this aloofness not only for the aztec ruler but also for the Inca or was the way the Inca was treated adopted for the defamation of the aztecs?  \n\n\n**tldr: documentation said that it was made up by europeans that you were not allowed to look into the eyes of the aztec ruler but also stated that you were not allowed to look into the eyes of the inca ruler. see question just above this tldr.**  \n\n\nlazy source to the documentary as not really relevant: [https://www.imdb.com/title/tt12599952/](https://www.imdb.com/title/tt12599952/)",
        "created_utc": 1675865338,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has the tension between Sufis and Salafis been historically viewed in Pakistan?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wxb97/how_has_the_tension_between_sufis_and_salafis/",
        "text": "I read here about Wahabi terrorists attempting to destroy the beard hair of Muhammad at Hazratbal mosque.\n\nhttps://www.ikashmir.net/history/chrar.html\n\nAnd I also read here about crowds at Hazratbal expressing contempt for Sufis as instruments of India.\n\nhttps://www.telegraphindia.com/amp/india/kashmir-fury-at-sufi-mission-in-hazratbal/cid/1711565\n\nThe western press distinguishes Salafis and Sufis as contenders for the purest form of Islam.\n\nhttps://www.theatlantic.com/international/archive/2017/11/airbrushing-sufi-muslims-out-of-modern-islam/546794/\n\nHow to make sense of all this? Thank you!",
        "created_utc": 1675864591,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would a Medieval “Foreman” be called?",
        "author": "Top-Strength-8838",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wx578/what_would_a_medieval_foreman_be_called/",
        "text": "I know it was common for a lot of tradesman back in the Middle Ages to have guilds and guildmasters they would work with. My question is would they have the equivalent of a supervisor or a foreman to keep the work running smoothly? \n\nI’m not talking about a slave master. Say you were working in a mine, or a mill, or even just a bunch of builders. Who did they report to other than the Lord in charge?\n\nAny information you can provide would be greatly appreciated. Thank you!",
        "created_utc": 1675864143,
        "upvote_ratio": 1.0
    },
    {
        "title": "So a drunk person at a party told me historical Jesus was a roadside bandit who robbed the poor on trade routes. What are they talking about??",
        "author": "S_A_96",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wx4i6/so_a_drunk_person_at_a_party_told_me_historical/",
        "text": "Where does this idea come from? Is it a fringe theory, a more accepted possibility, or a random thought this person just ran away with?\n\nI've seen several interpretations of a 'historical Jesus', and this one seemed kind of out of left field.",
        "created_utc": 1675864092,
        "upvote_ratio": 1.0
    },
    {
        "title": "So a drunk person at a party told me historical Jesus was basically just a roadside bandit who robbed the poor on trade routes.",
        "author": "S_A_96",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wx0i1/so_a_drunk_person_at_a_party_told_me_historical/",
        "text": "[removed]",
        "created_utc": 1675863789,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was it possible for Caesar to build an 11 mile wall around Alesia and trap Vercingetorix and his army inside without him first noticing it &amp; escaping?",
        "author": "HabitualHooligan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wwtb5/how_was_it_possible_for_caesar_to_build_an_11/",
        "text": "Upon first learning about the Battle of Alesia and Caesar’s entrapment of Vercingetorix, I was dumbfounded on how ridiculous his strategy sounded and more so when I found out it actually worked.  Upon talking about it recently, I came up with a question that just didn’t have a sensible answer to me. Vercingetorix was an accomplished military leader of the Gallic peoples and a thorn in the side of even Caesar, so surely he used scouts &amp; patrols to keep him informed of things going on around him.  How on earth did Caesar have the time to build an 11 mile long wall encircling Vercingetorix’s forces in the town of Alesia without him first noticing and taking his forces to escape the trap through whichever point was unfinished before completion?  I’m fairly certain Caesar didn’t have enough men to disperse around 11 miles and successfully hold back a push to escape from the entirety of Vercingetorix’s forces at any given point along that 11 mile stretch.",
        "created_utc": 1675863235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Large cities often arise on river deltas, but there are notable exceptions like Beijing that are far from the Yellow River or its delta, why in this case did that happen?",
        "author": "PicardTangoAlpha",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wwpiw/large_cities_often_arise_on_river_deltas_but/",
        "text": "",
        "created_utc": 1675862956,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did historians on the Holocaust come to a consensus on the facts and are there any *genuine* (not antisemitic driven) debates about these facts?",
        "author": "feygay",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wwemi/how_did_historians_on_the_holocaust_come_to_a/",
        "text": "I have to be extra, extra clear here: I am NOT on the side of any Holocaust denial. I believe that there was a deliberate, systemic effort to eradicate Jewish people, Romani people, disabled people, queer people -- the list goes on -- by Nazi Germany.\n\nthe reason I ask this question is because the idea that there are no debates about the Holocaust (concerning statistics, the intentions of Nazi Germany, whether things were exaggerated by the Allies as propaganda, etc) is a pretty big Holocaust-denier talking point to paint a picture that the facts are predetermined and never to be questioned \n(with of course the implication being that some sort of Jewish establishment is the one determining the facts)\n\nso I was wondering how historians on the Holocaust came to a consensus on the facts and if there's any reasonable debate amongst those historians\n\nand I hope that isn't a disrespectful question or that this doesn't come across the wrong way. and thank you so much to anyone who answers this earnestly. I've been so frustrated with seeing an uptick in antisemitism and Holocaust denial lately, so it'd be great to hear from a reasonable, educated person on this",
        "created_utc": 1675862111,
        "upvote_ratio": 1.0
    },
    {
        "title": "The First World War armistice was signed in November 1918, but the Treaty of Versailles was not signed until June 1919. To what point was the Western Front war resuming during that period likely or possible?",
        "author": "Drummk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10ww6ct/the_first_world_war_armistice_was_signed_in/",
        "text": "As a corollary, did the powers utilise the seven months to rearm, restock supplies, etc in anticipation of a potential resumption of conflict, or conversely did they run down their military capacities over this period?",
        "created_utc": 1675861444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Germany the sole culprit of World War II?",
        "author": "Bedyno",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wvvd9/was_germany_the_sole_culprit_of_world_war_ii/",
        "text": "I had really heated debate with my teacher about this subject. He suggests that if not for Germany and their imperialistic approach to foreign policy, then WWII would never happen. Im on the other side. He argued, that he never read any other stance anywhere, so if you can provide some texts or books for backing this claim, I would be grateful.  \nAlso, I´m happy to discuss any stance on this topic.",
        "created_utc": 1675860589,
        "upvote_ratio": 1.0
    },
    {
        "title": "How accurate is the assertion that the patricians hoarding all the land, leading to countless landless and poor Romans around the republic, was the first step in the decline of the Roman Republic?",
        "author": "CGTM",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wvsl1/how_accurate_is_the_assertion_that_the_patricians/",
        "text": "Nowadays, it is a very common assertion to claim this land hoarding as a reason for the chaos that followed the years after their victory in the Punic Wars. Mike Duncan, while not a professional historian, wrote in his book and said in his podcast that this act of naked greed by the patricians, and then their subsequent murder of the Gracchi brothers for attempting to stop it, was a reason for the republic’s decline?\n\nIs this an accurate assumption? Was this economic inequality really a major factor or is it just a projection of modern problems onto the ancient world?",
        "created_utc": 1675860362,
        "upvote_ratio": 1.0
    },
    {
        "title": "During WW2, how were teenage Americans treated/viewed by the government? With all the men gone, what were teens expected to do, be it to fill in adult roles, or prepare for war, etc.?",
        "author": "MultitudeMan78",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wvnv5/during_ww2_how_were_teenage_americans/",
        "text": "I hate war history but this question of the domestic front has always interested me and I can’t really seem to find an answer.",
        "created_utc": 1675859983,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some resource recommendation on the Kingdom of Dali (大理)?",
        "author": "Henrywongtsh",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wvghr/what_are_some_resource_recommendation_on_the/",
        "text": "What are some good sources to read up upon the various aspects (general outline, culture, foreign relations etc) of the Kingdom of Dali (and later local rulers post-Mongol conquest) that occupied what is now mostly Yunnan from the 10th century until the Ming conquest of the area?",
        "created_utc": 1675859374,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve read that in 17th century Kraków, the various guilds of the city were each assigned a tower they had the responsibility of manning in the event of an attack. How did this work in practice? Was this common practice? And did any guilds ‘perform’ worse than others in this task?",
        "author": "Kapitalist_Pigdog2",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wvebm/ive_read_that_in_17th_century_kraków_the_various/",
        "text": "My first reaction would be that most guilds would dip into their treasuries and hire mercenaries when it came down to it. Was there any documented political chicanery used to humiliate rivals or get extra sway with the authorities, like purposely buying up all the mercenary contracts? Did they merely have to provide the men or did they need to maintain an armory for their section of the wall as well?",
        "created_utc": 1675859183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a thought",
        "author": "DifficultyEast5803",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wv1wj/just_a_thought/",
        "text": "[removed]",
        "created_utc": 1675858125,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did black people in America not get the Jewish treatment in all this time?",
        "author": "Muted_One3248",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wspw2/how_did_black_people_in_america_not_get_the/",
        "text": "All these years blacks have lived in America and my impression about the way the world works was that by now they would have been exterminated to the last one like the Jews did in Europe, but why did it not turn out that way, and what are the factors that led to this outcome?\n\nBlacks were hated and there were sooooo many instances of white vs. black conflict but it never got to the level of genocide. Didn't whites get told that blacks were violent, and all their life saw the stories about whites being raped or beaten by blacks, and got angry about it?  Besides just this one example, there must be lots of ways in which whites must've really hated the blacks, and it doesn't make sense to my why not a single instance of genocide happened to them, its a real mystery.\n\nWhen I saw sites like genocidewatch list all these situations and make genocide seem common, it also reinforced my notion it was really common but it isn't, most of the times its just a few clashes, even when they had a whole \"race war\" over it like in Sri Lanka.",
        "created_utc": 1675849873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would 18th Century English Methodists get married, baptised and buried in Anglican churches?",
        "author": "misterjrtaylor",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wsmuf/why_would_18th_century_english_methodists_get/",
        "text": "I'm currently doing some family history research and I've noted that while lots of my ancestors were prominent early (mid-1700s) Methodists (setting up chapels, Sunday Schools, preaching, etc in my city), they were almost always married, baptised and buried at the local Anglican church or cathedral (even when there was a local Methodist chapel). What were the social, cultural and regulatory factors that influenced this?",
        "created_utc": 1675849533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life onboard ship in early 1800s",
        "author": "ChrissySturt",
        "url": "https://www.reddit.com/r/AskHistorians/comments/10wsil6/life_onboard_ship_in_early_1800s/",
        "text": "[removed]",
        "created_utc": 1675849063,
        "upvote_ratio": 1.0
    }
]