[
    {
        "title": "How would Romans have spoken numbers?",
        "author": "fuseboy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11es09x/how_would_romans_have_spoken_numbers/",
        "text": "When I look at Roman numerals, they have a structure completely different from the Latin names for numbers. Is the latter a modern convenience, or were Romans literally translating Roman numerals all the time?\n\nFor instance, seven is written VII, but spoken as septem.. not quinque duo. 18 is XVIII (10+5+3) but spoken as duodeviginti (two less than twenty). 90 is XC (ten less than 100), but pronounced nonaginta rather than something like    \"decemdecentum\".\n\nI know English isn't regular either, but it's limited to special names for numbers (e.g. 'seventeen' as opposed to more compound names like 'ten and seven' like you have with 'twenty seven'). Latin seems to have these subtraction-based structures (e.g. XIX) but then implements them differently in numerals and speech.\n\nI'm curious why the spoken versions are so different. Is this just a case that language is messy, and the numerals and spoken language evolved separately? Were there ever alternate versions to try to harmonize (e.g. IIXX for 18)?",
        "created_utc": 1677638724,
        "upvote_ratio": 0.89
    },
    {
        "title": "In the 1970s the disparity between the number of new jobs and the number of new History Ph.D.s was nearly 50 percent. How did the field recover from the job crisis? What were the long term impacts? What happened to the \"lost generation\" of historians?",
        "author": "Tatem1961",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ert9y/in_the_1970s_the_disparity_between_the_number_of/",
        "text": "",
        "created_utc": 1677638192,
        "upvote_ratio": 0.85
    },
    {
        "title": "When and how did \"Thou shall not boil a calf in its mother's milk\" evolve to prohibit the mixing of meat and dairy?",
        "author": "N0Thanks77",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11erszc/when_and_how_did_thou_shall_not_boil_a_calf_in/",
        "text": "Was the commandment \"Thou shall not boil a calf in its mother's milk\" universally understood as prohibiting the mixing of dairy and meat during the biblical period? If not, when and how did this interpretation become so universally accepted? Is there any evidence of this practice during the biblical period?",
        "created_utc": 1677638168,
        "upvote_ratio": 0.82
    },
    {
        "title": "Is there evidence that the developments in Canadian nationalism between the 1960s and 1980s were connected to contemporaneous social and political movements?",
        "author": "greyishpurple",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ers5d/is_there_evidence_that_the_developments_in/",
        "text": "Starting in the late 1960s and going into the 1980s, there were a lot of moves made both to define what it meant to be Canadian as well as to cultivate national cohesion in the country: the adoption of the flag, the Canadian Charter of Rights and Freedoms, the official adoption of multiculturalism, content regulation in Canadian cultural production, etc. \n\nHappening alongside (or preceding) some of these events were social movements and political developments which threatened the viability of a \"Canadian\" nation: FLQ crisis, growing Indigenous resistance and cross-border coordination, potentially some international influence from 1968.\n\nIs there any indication that these developments played any role in the prioritization of nationalism within Canadian politics during this time? Did governments during this time feel threatened by social/political movements? Is there a connection between the development of Canadian nationalism and attempts to counter internal divisions/conflict?",
        "created_utc": 1677638102,
        "upvote_ratio": 0.76
    },
    {
        "title": "What year was it considered at the beginning of our records on the subject?",
        "author": "Hero_of_Parnast",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ern7j/what_year_was_it_considered_at_the_beginning_of/",
        "text": "Basically just what it says in the title. If you went back to when our records say the calendar year was first implemented and asked what year it was, what would the answer have been?\n\nI know different places did it differently, and how did this impact things? If a person from a country without a tracked year met someone else with it and had to speak of the year, what might have been the method used?",
        "created_utc": 1677637724,
        "upvote_ratio": 0.38
    },
    {
        "title": "What would be considered the worst insult during the late middle ages?",
        "author": "iEbutters",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11erajj/what_would_be_considered_the_worst_insult_during/",
        "text": "",
        "created_utc": 1677636733,
        "upvote_ratio": 0.88
    },
    {
        "title": "Hello R/ask historians I have a question what made the Sherman tank such a great tank",
        "author": "PatientExit8850",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11er8vx/hello_rask_historians_i_have_a_question_what_made/",
        "text": "[removed]",
        "created_utc": 1677636612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I do not know how to properly voice my complaints, but I have asked the question of why was the T 34 bad my comment was banned and it taking off of the sub Reddit I would like a explanation",
        "author": "PatientExit8850",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11er4nc/hello_i_do_not_know_how_to_properly_voice_my/",
        "text": "",
        "created_utc": 1677636290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I would like to ask a question why was the T 34 so bad",
        "author": "PatientExit8850",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11er14w/hello_i_would_like_to_ask_a_question_why_was_the/",
        "text": "[removed]",
        "created_utc": 1677636030,
        "upvote_ratio": 1.0
    },
    {
        "title": "hypothetically, If the ruins or Atlantis were discovered at the bottom of the Atlantic Ocean, what would change? obviously, there is no conclusive evidence of Atlantis existing at any point in history, but if Platos tale was true, what would change?",
        "author": "Dull-Sprinkles1469",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eqq7v/hypothetically_if_the_ruins_or_atlantis_were/",
        "text": "",
        "created_utc": 1677635194,
        "upvote_ratio": 0.83
    },
    {
        "title": "What do historians here think is the 'superior' approach of teaching history? (AP History vs A level history)",
        "author": "Due_Calendar4413",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eqp4t/what_do_historians_here_think_is_the_superior/",
        "text": "From my surface level understanding, the US's AP US/World History seems to prioritise breadth with more emphasis towards knowledge (although it certainly has an essay component), whereas the UK's Edexcel A level history leans more towards argumentation and source analysis of a specific time period. Based on their sample exam answers ([AP](https://secure-media.collegeboard.org/digitalServices/pdf/ap/ap-united-states-history-exam-sample-responses.pdf) and [A level](https://qualifications.pearson.com/content/dam/pdf/A%20Level/History/2015/teaching-and-learning-materials/A_level_History_Exemplar_pack_-_Paper_%203_(AO1)_-_(Summer%202018).pdf), noting that in A levels you need to do two exams of two specific time periods (e.g Mao China or Weimar to Nazi Germany), what curriculum do you think prepares historians 'better' for academia/real-life?\n\nEdit 1: I completely forgot to include the sample answers of the source section of [A levels](https://qualifications.pearson.com/content/dam/pdf/A%20Level/History/2015/teaching-and-learning-materials/A%20level%20History_%20-%20_Exemplar_pack_-_Paper_1_(AO3)_-_(Summer%202018).pdf) history",
        "created_utc": 1677635114,
        "upvote_ratio": 0.8
    },
    {
        "title": "Was it common for scholar-officials in East Asia to have a wife or a concubine?",
        "author": "TangerineTechnical51",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eqikr/was_it_common_for_scholarofficials_in_east_asia/",
        "text": "[removed]",
        "created_utc": 1677634613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't France and England declare war on the USSR?",
        "author": "IllustriousAct28",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eq9tf/why_didnt_france_and_england_declare_war_on_the/",
        "text": "Why was Soviet Russia allowed to follow Germany into invading Poland in 1939 without the free world's same condemnation as Germany rightfully received for the same act?",
        "created_utc": 1677633950,
        "upvote_ratio": 0.6
    },
    {
        "title": "How did some \"young rulers\", such as Alexander the Great and Octavian, accomplish so much at such a young age?",
        "author": "Hugh_Munguses",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eq6hn/how_did_some_young_rulers_such_as_alexander_the/",
        "text": "Obviously adulthood is perceived differently in the modern age versus antiquity or the medieval period of Western Europe.\n\nDevelopmentally, though, even if a 14 year old can be considered a \"man\", they're still only just entering adolescence. Just thinking of the modern teenager, there'd be such a lack of perspective and general experience to just jump into roles of supreme leadership. It doesn't mean that a teenager would be incapable, but that I just imagine that their older contemporaries, possibly in their late 20s or 30s, would have more realistically acquired the qualities required to lead armies of men.\n\nI'm more interested in how armies of much older men found themselves falling behind such young leaders, who by merit of age would have had a very limited amount of time to be able to lead in the first place -- in other words, a lack of life experience. How did these young warriors come to be?",
        "created_utc": 1677633698,
        "upvote_ratio": 0.86
    },
    {
        "title": "Sources for the history of Romania, pre-1500?",
        "author": "SphereSteel",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eq24q/sources_for_the_history_of_romania_pre1500/",
        "text": "Hello historians! I like to read medieval sources about a particular place when I am on holiday there. I read Saxo Grammaticus's Gesta Danorum on holiday in Denmark, and Gregory of Tours's Historia Francorum on holiday in France.\n\nI am going on holiday to Romania next month and would like to read a medieval text corresponding to that region. I realise that Romania did not exist in the Middle Ages, but are there any Wallachian/Transylvanian/Moldavian chronicles from prior to 1500? Or epic poems or just generally anything more exciting than charters?\n\nThanks in advance!",
        "created_utc": 1677633391,
        "upvote_ratio": 0.81
    },
    {
        "title": "In the time and place you study, is that any historical/mithological/religious event that , even remotally, could simbolize the circunstances of two fictional caracters I created for a book?",
        "author": "lulu_lulu_lulu_lulu",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11epxhe/in_the_time_and_place_you_study_is_that_any/",
        "text": "(Not a short answer question) First of all , thank you if you’re reading this and sorrry for my stupid english . Well , i started writing that story long time ago , i created the original caracters and order of events, but after some inspiration boosts i decided that the important caracters were going to have a historical/religious symbolism behind . It works that way : there are 3 families, the ones based on rulers ( such as Cleopatra , Constantino and Solomon ) , the ones based on “evil”/diabolical figures ( Belzebu, Set , Sekhmet ) and the angels/angelical beings (Saint Michel, Saint Gabriel) . Also , when two caracters have really strong bonds ( like being really important for eachothers arcs) , their simbolisms have to be related aswell ( like king Contantino and Saint Michel , knowing the visions constantino’s mother had about saint Michel) . Having that in mind , here comes my problem , before the all symbolic stuff, i created two male protagonists who had a really strong bond, briefly, the devil caracter hide the fact that he is a devil and at some moment the truth comes out , the other boy(angel family) saves the devil’s life and its reavalled that the devil isnt actually evil . Their caracters are extremally important for the story , but i cant find two religious figures that remotaly remember them , thats why I am asking for help . The devil doesnt actually need to be a religious being , one of my devil caracters is joanna D’ark , i used her as a “missunderstood” caracter , since she was killed by the church and proclamaded evil but afterwards proclamaded Saint . And the circunstancies don’t need to be that accurate , i can addapt that . Any religion works , it’s just important that one represent light and saving , while the other is a missunderstood evil being and they are somehow related.",
        "created_utc": 1677633043,
        "upvote_ratio": 0.56
    },
    {
        "title": "Would some African Americans have Arab/Middle Eastern DNA due to the Fulani people who were brought to the United States as slaves?",
        "author": "DrippinSoTrippy",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11epsk4/would_some_african_americans_have_arabmiddle/",
        "text": "It is well documented that many enslaved Fulani people were present in the United States during slavery and also that some oral traditions say Fulani are descendants in part from North Africans and Arabs.",
        "created_utc": 1677632679,
        "upvote_ratio": 0.71
    },
    {
        "title": "In 1998, the Tuvalu government began selling sub-domains in \".TV\" WWW domain.How has that worked out for the country of Tuvalu so far?",
        "author": "crookba",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eppbx/in_1998_the_tuvalu_government_began_selling/",
        "text": "[removed]",
        "created_utc": 1677632462,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 1998, the Tuvalu government began selling sub-domains in \".TV\" WWW domain.",
        "author": "crookba",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11epmsd/in_1998_the_tuvalu_government_began_selling/",
        "text": "[removed]",
        "created_utc": 1677632288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I Get Some Background into the Historiographical Debate About Poland During WWII Being Debated on Wikipedia?",
        "author": "gmanflnj",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eoiua/can_i_get_some_background_into_the/",
        "text": "So I saw this article: [https://www.jta.org/2023/02/28/global/wikipedias-supreme-court-tackles-alleged-conspiracy-to-distort-articles-on-holocaust](https://www.jta.org/2023/02/28/global/wikipedias-supreme-court-tackles-alleged-conspiracy-to-distort-articles-on-holocaust?utm_campaign=sprout&amp;utm_medium=social&amp;utm_source=JTA_Twitter)  \n\n\nWhich linked to this academic article: [https://www.tandfonline.com/doi/full/10.1080/25785648.2023.2168939](https://www.tandfonline.com/doi/full/10.1080/25785648.2023.2168939)  \n\n\nAbout people systemically distorting wikipedia on the subject of Poland during WWII. Can I get some background on this? Specifically, is the article in line with the historical scholarly concensus? Is  it fair to say that the veiwpoint being advanced by the polish nationalists here is basically antisemetic propaganda? or is that not fair?",
        "created_utc": 1677629353,
        "upvote_ratio": 0.86
    },
    {
        "title": "Help with a research question on the Julio-Claudian dynasty?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677629309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are so many Arthurian retellings from the 1980's?",
        "author": "Logan_Maddox",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eofqn/why_are_so_many_arthurian_retellings_from_the/",
        "text": "I've been looking over my to-read list and so many of these books are from either the 80's or the 50's. A couple of examples:\n\n* The Mists of Avalon (1983)\n\n* Excalibur (1981), the movie\n\n* Camelot 3000 (1982 to 1985), the comic\n\n* The Road to Avalon by Joan Wolf (1988)\n\n* The Pendragon Cycle by Stephen R. Lawhead (started in 1987)\n\n* The Idylls of the Queen: A Tale of Queen Guenevere, by Phyllis Ann Karr (1982)\n\nI feel like the 80's are disproportionaly represented in big, major Arthurian retellings. Is this confirmation bias or was there something actually going on at the time?",
        "created_utc": 1677629135,
        "upvote_ratio": 0.9
    },
    {
        "title": "What did Viet Cong audiences and critics think of Star Wars: A New Hope?",
        "author": "AndaliteBandit-",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eo8sb/what_did_viet_cong_audiences_and_critics_think_of/",
        "text": "",
        "created_utc": 1677628682,
        "upvote_ratio": 0.5
    },
    {
        "title": "How early in the history of humanity and medicine did humanity decide dentistry was a must?",
        "author": "noblemile",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enzi6/how_early_in_the_history_of_humanity_and_medicine/",
        "text": "Like, we've all had toothaches, and they can ruin entire weeks. Poor dental hygiene can also lead to infections that can kill you.",
        "created_utc": 1677628023,
        "upvote_ratio": 0.75
    },
    {
        "title": "Why did Hitler declare war on the United States?",
        "author": "seasonedsalt1",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enyyk/why_did_hitler_declare_war_on_the_united_states/",
        "text": "He got basically nothing in return from the Japanese for doing so. Was it a show of good faith to his axis ally merely hoping they would reciprocate by invading the Soviets from the East? Or did the Japanese make him a promise that they never fulfilled? I guess there's always the simple explanation that by this point Hitler was starting to lose his mind. Am I missing something?",
        "created_utc": 1677627984,
        "upvote_ratio": 0.75
    },
    {
        "title": "Many nazis escaped to Argentina, but was it the country that welcomed the most nazis? I know many went to Brazil and the US",
        "author": "cloudor",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enxdl/many_nazis_escaped_to_argentina_but_was_it_the/",
        "text": "",
        "created_utc": 1677627881,
        "upvote_ratio": 0.83
    },
    {
        "title": "Why are presidential elections in American history so close in the popular vote, even the landslides?",
        "author": "destroyer000lucky",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enwnq/why_are_presidential_elections_in_american/",
        "text": "The example that comes to mind is the election of 1932, where the widely mocked Hoover, who the country had lost faith in due to his poor handling of the depression, ran against FDR. Hoover was uncharismatic, hating giving speeches, and had very little vision for the nation beyond attacking FDR's New Deal. His handling of the Bonus Army had been a PR nightmare, and the media as well as even members of his own administration had lost faith in him.\n\nMeanwhile, FDR was charismatic, witty, and energetic. He represented change, and promised real government intervention for the unemployed, the homeless, and the desperately poor. It seems like this election would have been a complete landslide, and it was- at least in the Electoral College. But in the popular vote, FDR won 23 million to Hoover's 16. How in the world did Hoover still get 40% of the popular vote?",
        "created_utc": 1677627828,
        "upvote_ratio": 0.5
    },
    {
        "title": "Many nazis escaped to Argentina, but was it the country that welcomed the most nazis? I know many also went to Brazil and the US",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677627823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Muhammad’s conquest of Arabia best understood as “imperialistic,” or as “defensive”?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enowr/is_muhammads_conquest_of_arabia_best_understood/",
        "text": "",
        "created_utc": 1677627293,
        "upvote_ratio": 0.67
    },
    {
        "title": "After Galileo perfected the telescope, when was the first time someone studied the sun and how did he do it without going blind?",
        "author": "YoSoyKeott",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enlsi/after_galileo_perfected_the_telescope_when_was/",
        "text": "Someone must have tried to see it directly, with some painful consequences. When did someone come up with a way to safely observe the sun and what was this method?",
        "created_utc": 1677627067,
        "upvote_ratio": 0.83
    },
    {
        "title": "Help with undergraduate dissertation question on Julio-Claudians",
        "author": "Fuman333",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11enh4x/help_with_undergraduate_dissertation_question_on/",
        "text": "[removed]",
        "created_utc": 1677626737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the samurai era chonmage haircut a dignified way to hide receding hairline and general baldness?",
        "author": "Parrallax91",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11en6f1/was_the_samurai_era_chonmage_haircut_a_dignified/",
        "text": "I know this is kind of goofy but I’m generally curious if everyone in feudal Japan agreed it was a good haircut so they could just write off lost hair.",
        "created_utc": 1677625998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has the CIA ever blackmailed an American politician? Do they still do that?",
        "author": "WhiteBoyWitACatitude",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11en1ff/has_the_cia_ever_blackmailed_an_american/",
        "text": "The title is my question. Based upon just typing in a similar sentence into Google, I don't think they do, but modern surveillance technology does make it a possibility (as a ACLU article said). I do, however, believe that blackmail has been used in spying and espionage. Well, I shouldn't say \"believe,\" as those have absolutely been used in that field.",
        "created_utc": 1677625656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Protestantism in Europe spread from the top down or from the bottom up?",
        "author": "lepidus_worst",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11emswm/did_protestantism_in_europe_spread_from_the_top/",
        "text": "From the top down as in nobles and other upper classes converted first and encouraged Protestantism to spread in their lands.  Or bottom up where the peasantry and lower classes converted first and pressured their rulers to convert.",
        "created_utc": 1677625108,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to research urban renewal in a city of only 20,000, that's not a well known city, that no historians have written much about?",
        "author": "RockosNeoModernLife",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11emn9e/how_to_research_urban_renewal_in_a_city_of_only/",
        "text": "How do I research urban renewal in a specific city?\n\nSo it's a hard topic to research. Luckily I have a general area of where it happened but what I don't have is records of what was there before the neighborhood was bulldozed. I can use old directories of the city but if it's alphabetical then it would be a lot of work to sift through it and see what homes and businesses were in this neighborhood. How do I research a neighborhood that doesn't exist anymore? Are old newspapers my only option? This city has a local museum with lots of records in filing cabinets but so far no luck on anything related to urban renewal.\n\nI'm also researching protests, support, reaction, and debate around specific urban renewal projects in specific cities.",
        "created_utc": 1677624734,
        "upvote_ratio": 1.0
    },
    {
        "title": "The screwdriver was used by some in the middle ages when did the screwdriver become popular and why?",
        "author": "EmreKadirTiren",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11emfz5/the_screwdriver_was_used_by_some_in_the_middle/",
        "text": "",
        "created_utc": 1677624241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the US bomb Japan in 1945 if Yamamoto was already dead? What would have happened if they didn't?",
        "author": "Flying-Coyote",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11emc0f/why_did_the_us_bomb_japan_in_1945_if_yamamoto_was/",
        "text": "",
        "created_utc": 1677623981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the cotton gin increase the demand for slave labor specifically?",
        "author": "wedstrom",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11em5af/why_did_the_cotton_gin_increase_the_demand_for/",
        "text": "This partially hinges on the assumption that slavery was in decline before the cotton gin, which seems to be broadly true.\n\nWhen the cotton gin made cotton growing more profitable, that made slavery more profitable, and revitalized the practice, at the same time slavery became very expensive due to the demand.\nHowever, the margins were supposedly astonishing, with the prices going wild, as best as I can tell outstripping the cost of free labor.\nWhy didn't the high margins and inflated prices push the south towards a free economy instead of slavery and ruin?",
        "created_utc": 1677623526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it common for other languages to have a figure as central as Shakespeare to their literary tradition?",
        "author": "Martel732",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11elxvp/is_it_common_for_other_languages_to_have_a_figure/",
        "text": "I don't think it is hyperbolic or controversial to say that Shakespeare is the most important person in the development of English's literary tradition. Not being raised in any other language tradition I was curious if this was common. Do many other languages have a single writer who was as foundational as Shakespeare is to English?",
        "created_utc": 1677623040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn’t Anglo Canada join the American Revolution?",
        "author": "Train-Rode-5921",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11elogs/why_didnt_anglo_canada_join_the_american/",
        "text": "Btw I’m not talking about Quebec, that’s French Canada.\n\nAnglo Canada tends to be culturally and similar to US, so why didn’t they join to revolt with its bother?",
        "created_utc": 1677622419,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would people have worn in renaissance Italy in the winter?",
        "author": "fittonia12334",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11elflt/what_would_people_have_worn_in_renaissance_italy/",
        "text": "I'm interested in what both rich and poor people would have worn during the colder months in renaissance Italy, more specifically in Venice and Florence in particular. Is there a specific type of cloak or other outerwear they might've worn?",
        "created_utc": 1677621850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find an English translation of Ethnica, by Stephanus of Byzantium?",
        "author": "wowwouldyoulookat",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11elapn/where_can_i_find_an_english_translation_of/",
        "text": "thx",
        "created_utc": 1677621556,
        "upvote_ratio": 1.0
    },
    {
        "title": "What lessons from the Dust Bowl and Great Depression would help us, now - especially if China no longer exports to Western countries?",
        "author": "DustBunnicula",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11el6fl/what_lessons_from_the_dust_bowl_and_great/",
        "text": "",
        "created_utc": 1677621275,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did people do to relieve minor aches and pains prior to paracetamol and aspirin?",
        "author": "bagsoffreshcheese",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11el2hp/what_did_people_do_to_relieve_minor_aches_and/",
        "text": "",
        "created_utc": 1677621023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has there really never been a large civilization in Siberia or is this simply not studied enough?",
        "author": "Joliolin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ektyv/has_there_really_never_been_a_large_civilization/",
        "text": "Whenever I watch those world history over time videos I never see any kingdom other than Russia take Siberia. I'm sure there were always people there, but why, in all these videos, does no one ever take all of Siberia? The Mongols didn't seem to. The Turks didn't seem to. The Chinese didn't seem to. I recognize this might be an understudied place, so perhaps data is rare, but I find it hard to believe that in the history of the world, no major civilization even took Siberia.",
        "created_utc": 1677620476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did other countries in Europe have equivalents to Free Imperial Cities?",
        "author": "MooseFlyer",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eko7a/did_other_countries_in_europe_have_equivalents_to/",
        "text": "",
        "created_utc": 1677620091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we translate names? (Swedish Karl X -&gt; Charles X; Jeanne d'arc -&gt; Joan etc)",
        "author": "AnxiousHistoryNerd",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ekjeu/why_do_we_translate_names_swedish_karl_x_charles/",
        "text": "",
        "created_utc": 1677619782,
        "upvote_ratio": 1.0
    },
    {
        "title": "The slave trade was an established institution throughout much of West Africa well into the 20th century, so what do we know about the men who profited from it? What do we know about slave owners *in* Africa?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ekes4/the_slave_trade_was_an_established_institution/",
        "text": "",
        "created_utc": 1677619470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the Pinkerton National Detective Agency racially integrated?",
        "author": "RarePerspective",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ek96k/was_the_pinkerton_national_detective_agency/",
        "text": "I recently read a comment on a video expressing criticism of a fictional depiction of the Pinkerton National Detective Agency being represented as staffed with all-white agents that claimed the agency was racially integrated.\n\nThey unfortunetly cited no source but it made me wonder at what point the agency began hiring African Americans and if they ever hired as many to where they became common within the agency's ranks.\n\nI've read of John Scobell but my question is more regarding the agency's activities post-American Civil War and prior to the aftermath of the La Follette Committee investigation in 1936-1941, such as union busting, strikebreaking, and private policing.",
        "created_utc": 1677619117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the breakup of the USSR make industrial commodities cheaper?",
        "author": "Warriohuma",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ek5ez/did_the_breakup_of_the_ussr_make_industrial/",
        "text": "My mental model of state collapse is that industries within the state either collapse with it or survive the collapse in proportion to their complexity and reliance on extended supply chains. Manufacturers that need 100 university graduates are more vulnerable to disruption than a logging firm that hires 100 adult primary school graduates.\n\nPresumably the demand for raw materials is suppressed to a greater extent than the supply in collapses, but is there conclusive evidence that this happened with the fall of the USSR? If so, can the longest uninterrupted period of US economic growth (1991-2001) be attributed to it?",
        "created_utc": 1677618876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sword from the mirror maker of lilienthal",
        "author": "Far-Pollution6295",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ek57h/sword_from_the_mirror_maker_of_lilienthal/",
        "text": "",
        "created_utc": 1677618862,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Aside from those associated with the names Aristotle, Bacon, Descartes and Kuhn): What are your top 10 picks for scientific discoveries in history?",
        "author": "SufficientAdagio914",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ejr56/aside_from_those_associated_with_the_names/",
        "text": "",
        "created_utc": 1677617984,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the Roman Catholic Church was trying to spread into Slavic territory (1000 AD or so) did Slavs have any conflict obeying their ruler and the pope (Nicholas II mainly)?",
        "author": "KoolKatColebyJ",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ejq8d/when_the_roman_catholic_church_was_trying_to/",
        "text": "From what I know, the idea of spreading the religion up there anyways was to gain more power, but did the Slavs that converted have conflict? If they did, was that intentional from the Roman Catholic Church?",
        "created_utc": 1677617923,
        "upvote_ratio": 1.0
    },
    {
        "title": "In statues, Augustus looks young into his old age. But just 50 years later, emperor Vespasian is depicted as old. Why did the style change?",
        "author": "lindarsner",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ej9o4/in_statues_augustus_looks_young_into_his_old_age/",
        "text": "",
        "created_utc": 1677616827,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did we start ululating and why?",
        "author": "tdknd",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ej6zw/when_did_we_start_ululating_and_why/",
        "text": "Across many different cultures, people (women in particular) can be heard ululating in celebration of a wedding, a birth, or any happy event. So i was wondering where it came from. \n\nI guess the reason and origins might differ from morocco to south africa but perhaps not? i would really love to know more about the history of ululating!",
        "created_utc": 1677616565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Yogi Berra say half the things he said?",
        "author": "Illicit-Tangent",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ej53r/did_yogi_berra_say_half_the_things_he_said/",
        "text": "Yogi Berra is forever associated with his witty one liners dubbed \"Yogi-isms\".  Things like, \"it gets late really early there\", \"that park is so crowded no one goes there anymore\", \"you can observe a lot just by watching\", and the title of my post \"I didn't say half the things I said.\"\n\nThe last one got me wondering, how many of the quotes can actually be attributed to Yogi, and how many of them were associated with his name once his name became associated with these types of sayings?",
        "created_utc": 1677616439,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some advanced discoveries that we later learned were already known by some ancient civilization? How did they learn it?",
        "author": "Cymbal_Monkey",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eiitr/what_are_some_advanced_discoveries_that_we_later/",
        "text": "I came from a hippy town, and there's a lot of folks desperately trying to believe that ancient Egyptians had like, electricity and widely used it, for instance. \n\nMost of that is obviously nonsense, but it did make me wonder: what things have we only discovered more recently (post Scientific Method, let's say) that we later learned were actually already known to far older civilizations? The only example that comes to mind is some of the pre-calculous work on the infinite series that was done (I believe) in North India centuries before Newton.",
        "created_utc": 1677615021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any truth to the videos from YouTuber TiK about the Nazis and their supposed socialism?",
        "author": "Shadow_Dragon_1848",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eifyx/is_there_any_truth_to_the_videos_from_youtuber/",
        "text": "YouTube recently recommended me TiK, I watched him a bit years ago. I thought his videos were good and I liked that he questioned the narrative that was in my mind about the brilliant German generals who were only held back by Hitler. But then his first \"the Nazis were socialist\" video came out and I stopped watching him. \n\nI scrolled down his videos and found maybe four or five videos about this topic. There long ... very long. Six hour or so.\n\nI absolutely don´t think that the Nazis were socialists, but maybe some person has for whatever reason watched all this videos and can say if his ideas have any truth to them.",
        "created_utc": 1677614839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Phyrrus bring war elephants when attempting to infiltrate the city of Argos at night?",
        "author": "Toptomcat",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eiasg/why_did_phyrrus_bring_war_elephants_when/",
        "text": "The Greek king and general Pyrrhus of Epirus died at an urban battle in Argos, in a botched attempt to infiltrate the city that ended up getting him killed in confused urban fighting.\n\nApparently his forces were considerably held up by the difficulties inherent in getting the war elephants he brought with him through the city gates. At night.\n\nThat he would even attempt to do this strikes me as self-evidently insane, and if there's anything studying history has taught me, it's that whenever a decision looks blindingly stupid in retrospect, it is often because I'm missing some crucial part of the bigger picture.\n\nWhy did he do that?",
        "created_utc": 1677614507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Pyrrhus even *bring* war elephants when trying to infiltrate a city at night?",
        "author": "Toptomcat",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ei8tb/why_did_pyrrhus_even_bring_war_elephants_when/",
        "text": "The Greek king and general Pyrrhus of Epirus died at an urban battle in Argos, in a botched attempt to infiltrate the city that ended up getting him killed in confused urban fighting.\n\nApparently his forces were considerably held up by the difficulties inherent in getting the *war elephants* he brought with him through the city gates. At night. \n\nThat he would even attempt to do this strikes me as self-evidently insane, and if there's anything studying history has taught me, it's that whenever a decision looks blindingly stupid in retrospect, it is often because I'm missing some crucial part of the bigger picture.\n\nWhy did he do that?",
        "created_utc": 1677614403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there sanctions against the German Reich before entering the war with Poland?",
        "author": "warnemuend",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehznr/were_there_sanctions_against_the_german_reich/",
        "text": "Were there sanctions against the German Reich before invading Poland in September 1939. I know that the Treaty of Versailles was imposed after World War 1, but the treaty can not be seen as sanctions against Germany like we define economic sanctions today, can they? \n\nThe US and Allies probably knew in detail about the domestic changes after Hitler came into power 1933? Did they sanction the preparation of war and the antisemitic domestic politics by the nazis in any way, and if not so, why not? \n\nAppreciate your answers!",
        "created_utc": 1677613794,
        "upvote_ratio": 1.0
    },
    {
        "title": "12th-15th C. Japan is all but missing from cinema. 16-19th C. abound. Why?",
        "author": "Projekt-2501",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehya8/12th15th_c_japan_is_all_but_missing_from_cinema/",
        "text": "From what I can tell, it looks like the first few centuries of feudal Japanese history are nearly absent from the big screen whereas the mid and later period are represented in abundance. That seems a bit strange. Does historical memory play a role in this situation?  Lack of sources?  Did I overlook some early-period movies in my search?\n\nI found a few anime adaptations of The Tale of Genji, as well as Zen (2009), and Onibaba (1964), but that's it. The conflict with the Mongols would appear an enticing topic for historical fiction writers for the screen- right?",
        "created_utc": 1677613696,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did humans starting cutting hair? What evidence do we have of human hair styling trends in early history?",
        "author": "conrocket",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehxlh/when_did_humans_starting_cutting_hair_what/",
        "text": "I recently learned of Rome's opinions on Gaulic hairstyles. They noted that Gaulic men let their hair grow long and combed it frequently (which was seen as barbaric by Rome). How did earlier humans deal with hair? What records do we have to learn from?",
        "created_utc": 1677613652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Herodotus Writes of a Statue of a Lion. Is/Was it Real?",
        "author": "YourEverydayInvestor",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehuqn/herodotus_writes_of_a_statue_of_a_lion_iswas_it/",
        "text": "In Book VII of Herodotus’ *Histories*, he writes of a statue of a lion in honour of Leonidas being at Thermopylae, where the battle once took place.\n\nI tried to do some digging of my own, but can only find information about the 1955 statue *of* Leonidas (or about other lion statues found around Greece).\n\nDid this particular statue ever exist? Has it just been lost or destroyed?",
        "created_utc": 1677613468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best books on Soviet crimes against humanity?",
        "author": "Andreastheslimjim",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehriq/best_books_on_soviet_crimes_against_humanity/",
        "text": "I'm looking for books that really get into the nitty gritty of Soviet Russia. That being said I know that anything communism related is going to be heavily politicized and I don't know enough about history to be able to tell a good source from a biased one.\n\nAny suggestions?",
        "created_utc": 1677613254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there some sort of chronologycal list or encyclopedia of historians that you could recommend me?",
        "author": "Cetiaz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehib0/is_there_some_sort_of_chronologycal_list_or/",
        "text": "History is the most important hobby in my life and starting around 2 years ago I've had a personal investigation project in mind that I really want to do. \n\nSkipping details, one of the things I want to do for this project is to read history books in chronologycal order. I know that is kind of a titanic and almost imposible task, but I will not crack my head searching for sources that are simply not avalible, and I really want to give it a try.\n\nThe thing is that I don't know where to start. I searched for list of historians in google and only found 2, one of them in wikipedia. This one seemed to be the most complete, but I have my doubts about it. So as the title says, I was wondering if is there something like a good chronologycal list or encyclopedia of historians that you could recommend me?\n\nThanks for reading :)",
        "created_utc": 1677612643,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I read for my Env. and Labor History \"Field Readings\" course?",
        "author": "hopefulturtle794",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehesl/what_should_i_read_for_my_env_and_labor_history/",
        "text": " Hi, I'm a MA History (Labor/Environmental History) student. I have a one-on-one \"Field Readings\" course with my advisor next quarter and would love to hear recommendations on what I should put on the reading list; there's space for 30-40 books, so don't hold back. I'm particularly interested in works that:\n\n1. are seminal, groundbreaking, or otherwise \"stand out\" in labor or environmental history, esp. in the 20th century U.S./North America\n2. Chronicle extractive industries/labor and/or working class ecological knowledge\n3. Use Marxist analysis, especially as it relates to nature/ecology\n4. Otherwise have a radical bent.\n\nThough works of history are prioritized, I'd be intrigued to hear suggestions from outside the field, too. My thesis will investigate the labor and ecological knowledge associated with the creation of the TransAlaskan Pipeline. It may focus on a dispute between a fishing labor union and proponents of the pipeline.\n\nThanks in advance!",
        "created_utc": 1677612421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Env. and Labor History Field Readings Recommendations",
        "author": "hopefulturtle794",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ehciq/env_and_labor_history_field_readings/",
        "text": "[removed]",
        "created_utc": 1677612276,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did iron weapons overtake bronze weapons completely?",
        "author": "hominoid_in_NGC4594",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eh7c1/when_did_iron_weapons_overtake_bronze_weapons/",
        "text": "We always read about the bronze-age collapse around 1200 BC, but when would iron make bronze completely obsolete? Between the 15th and 13th century BC, the Hittites seem to have first figured out the secret to making iron out of newly discovered random rocks that were seemingly everywhere, but when would they (or anyone) be able to fully arm a large army with iron swords and spears without using/needing any bronze?\n\nSeeing how difficult it is to make a chunk of iron bloom out of iron ore (much less a sword), it is just really hard to imagine when the tech developed enough to make it not as difficult and time consuming. Seems like you would need hundreds (or thousands) of smithies pounding on brittle chunks of iron bloom 24 hours a day, 7 days a week for *years* to actually make enough weapons to arm a significant number of people. And I cant see how they would last very long, considering how brittle they probably were. Bronze weapons just seem more practical and much better quality.\n\nI just read about a recently defeated or surrendering ruler offering Alexander the Great (during his conquests) 300 pounds of silver or gold or iron (steel??), and Alexander chose the steel. This confused me because I thought the Greeks came out of the Greek Dark Ages in the 700 BC's a powerhouse because of all the recently discovered iron there, and subsequent forging it into weapons, thus arming larger numbers of soldiers. Why would Alexander choose iron over gold and silver in the 3rd century BC?",
        "created_utc": 1677611941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would Hitler have been more successful if he became dictator in the 19th century rather than the 20th?",
        "author": "IfYouSeeMeSendNoodz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11egvui/would_hitler_have_been_more_successful_if_he/",
        "text": "How would the German war machine be stopped in that instance since they already had trouble defending against him in the 20th century. \n\nI’m not a history buff or anything, so if it’s a stupid question then I’m sorry. I was just watching an infographics video about hitler and the question popped into my head.",
        "created_utc": 1677611181,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are good history books to read with pre-teens?",
        "author": "Ginkasa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eggew/what_are_good_history_books_to_read_with_preteens/",
        "text": "Hello! Hope this is an appropriate question for this sub. I'd also appreciate being pointed in the right direction if there is a better place to take my query!\n\nI would like to go through some history books with my pre-teen age children. They do school online which I think works out well for us for subjects like math and such. When it comes to history, though, I'd like for them to get a little more context rather than just a list of dates and events (and I'm not always excited about how the curriculum still presents some events; whitewashing or sanitizing some of the topics). \n\nIn particular, I'd like to find some resources/books that help present the \"story\" of a particular era or subject; to understand the people involved as *people* and the impacts these events had rather than a bunch of factoids, if that makes sense. I know this is kind of vague, but ultimately I want them to find whatever we're reading to be interesting while also still learning about the human story first and foremost. I hope this makes sense.\n\nWe're currently reading Boom Town by Sam Anderson about our hometown, Oklahoma City. He's more of a reporter than a historian, I think (if that matters), but in this book I think he does a really good job providing the story of our city moving from high level overviews of the events of the city with ground level, individual perspectives as well. It is written in a way that is also funny and engaging for us to go through together. My kids won't be civic experts, but they'll know the context of how our city got to where it is now (good and bad).\n\nI'm open to just any topic or timeframe, trying not to limit ourselves too much, but if I had a grand vision I'd ideally I'd like to move outward in scope from what is most immediately to my children. So we started with our town/state, so next I might like to explore more US history as a whole and expand out into the larger world and further back in time after that.\n\nAnd to be clear I'm much more concerned about it being interesting for my pre-teens rather than trying to find a \"clean\" or \"child appropriate\" version of events, if that makes sense. I tried to just Google things but most of what it came up with was picture books or \"children books\". \n\nI appreciate any suggestions and if there's a better resource to find what I'm looking for I'm all ears.",
        "created_utc": 1677610176,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has the internet, in particular the shift away from physical documents and correspondences to electronic ones, affected the work of historians?",
        "author": "JDMonster",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11egg7g/how_has_the_internet_in_particular_the_shift_away/",
        "text": "",
        "created_utc": 1677610163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the urban peasants in the middle ages cook their own food?",
        "author": "Ronald_1997",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11egeg0/did_the_urban_peasants_in_the_middle_ages_cook/",
        "text": "Did the urban peasants in the middle ages cook their own food and if yes how?",
        "created_utc": 1677610043,
        "upvote_ratio": 1.0
    },
    {
        "title": "How accurate were the accents on Roots?",
        "author": "BabyBandit616",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11egb56/how_accurate_were_the_accents_on_roots/",
        "text": " I know there wasn’t recordings during the civil war. So I’m curious thank you.",
        "created_utc": 1677609829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are so many hospitals in the US seemingly connected to a church? I see places like St. Mary's, St. John's, County Methodist Hospital, etc.",
        "author": "optiplex9000",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11egabr/why_are_so_many_hospitals_in_the_us_seemingly/",
        "text": "",
        "created_utc": 1677609775,
        "upvote_ratio": 1.0
    },
    {
        "title": "USA Great Depression: Why was there not more emphasis by charities and the government on growing food since people lacked money to buy it?",
        "author": "DaffodilsAndRain",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eg6qu/usa_great_depression_why_was_there_not_more/",
        "text": "This is based on my history reading for school so forgive if I do not have all the info. I have tried to find it online though do not succeed so ask here.\n\nIn my reading, leaders focused on economy building and charity/government spending. The people focused on finding jobs. If there isn't enough money, why not try multiple avenues to aid the people?  If charities had encouraged people to grow food and given knowledge on how to grow different vegetables, or if the government had put emphasis on people having small homesteads, would the Great Depression have been different? I realize not everyone had land to homestead, though if those with land could grow and share, and people in cities could have garden boxes. Lots of things are possible outside of finances for food.",
        "created_utc": 1677609541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who were the US Marshals who escorted Ruby Bridges?",
        "author": "thefoolofemmaus",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11efq3z/who_were_the_us_marshals_who_escorted_ruby_bridges/",
        "text": "The famous photo of [Ruby Bridges](https://preview.redd.it/alkem9t08xka1.jpg?width=512&amp;auto=webp&amp;v=enabled&amp;s=1f002ab8a763a641188ba3b3ab0e03903384f6de) being escorted into William Frantz Elementary School in Louisiana by US Marshals came up on OldSchoolCool the other day, and it got me thinking. Who were the US Marshals assigned to guard her? Did they ever do interviews and if so what were their experiences?",
        "created_utc": 1677608422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historical lynchings in the US - are these numbers accurate?",
        "author": "Virus4762",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11efpzs/historical_lynchings_in_the_us_are_these_numbers/",
        "text": "This website says that, between the years 1882 and 1968, there were 3,445 lynchings of black people in the U.S. \n\nAre those numbers accurate? I always thought it was much more than that.",
        "created_utc": 1677608416,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were middle easterners treated under Americas Jim Crow laws?",
        "author": "TopicOwn7972",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11efitd/how_were_middle_easterners_treated_under_americas/",
        "text": "I’ve been trying to research this online but haven’t found many clear answers. I know the middle eastern population wasn’t very big in America at the time, but for the few that were there, what race would they be classified as? Where would they go in segregated spaces?",
        "created_utc": 1677607923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which pharaoh Alexander is referenced in this copy of Burden of Isis: The Chants, and would this \"Ishrel\" have been to Egyptians of during this time?",
        "author": "Ciabattabingo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11efb2w/which_pharaoh_alexander_is_referenced_in_this/",
        "text": "I was reading the Burden of Isis and noticed a few interesting things in the colophon. First, there is a reference to Pharoah Alexander and I'd like to know which. Second, there is a familiar phrase used in the old testament book Joel 2:27: \"*In-the-midst-of\".*\n\n&gt;You shall know that I am in the midst of Israel, and that I, the Lord, am your God and there is no other. Joel 2:27\n\nCompare to the colophon of [The Burden of Isis: The Chants](https://www.sacred-texts.com/egy/boi/boi05.htm)\n\n&gt;This litany compiled by the priest of the temple of Het, [1](https://www.sacred-texts.com/egy/boi/boi05.htm#fn_40) the Recorder of Amen of the rank of Sa, [2](https://www.sacred-texts.com/egy/boi/boi05.htm#fn_41) the priest Nes-Amsu, son of the priest Pedi-Amen, for the King of the two lands, he being the sistrum-bearer of Amen-Ra, and son of Ta-Mut, she who belongeth to Tunra.  \n&gt;  \n&gt;Writings of the 12th year, 4th month of summer, in the day of the Pharaoh (life, stability and health) Alexander, [3](https://www.sacred-texts.com/egy/boi/boi05.htm#fn_42) son of Alexander, prince of the god and father;--he being also priest of Amen-Ra, king of the Gods, priest of Horus the Ra, the great child, supreme, firstborn of Amen; priest of the Amen-of-the-two-Horus, priest of Khensu in the midst of Bennit, [4](https://www.sacred-texts.com/egy/boi/boi05.htm#fn_43) priest of Osiris-of-the-great-persea-trees, priest of **Osiris-in-the-midst-of-Ishrel**, priest of Amen-haset-in-the-midst-of-Ipui, Uab-priest of the Ra in the chief temple of the temples of Amen, over the Sa-priests of second rank; recorder of the treasury of the God Amen, over the Sa-priests of second rank; deputy of Amen, of the Sa-priests of second and fourth rank; priest of Nofer-Hotep, the great God; priest of Nofer-Hotep the child, priest of Osiris, Horus, Isis and Nephthys, priest of the temple of Het, [1](https://www.sacred-texts.com/egy/boi/boi05.htm#fn_40) priest\n\nOf course, a Google search is fairly useless. It asks me if I meant \"Israel\" instead and has no results for Ishrel.",
        "created_utc": 1677607393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were European explorers surprised to find Islam in the East Indies?",
        "author": "syntarsus_reborn",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11efad8/were_european_explorers_surprised_to_find_islam/",
        "text": "By the time Europeans had made it to the East Indies, Islam had a solid foothold in the region. Were the Europeans surprised by this? how aware of the geographic extent of islam were europeans of this time period?",
        "created_utc": 1677607342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Muslim states named after their ruling dynasty, and what would they have been called by their contemporaries?",
        "author": "Slipslime",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ef0xb/why_are_muslim_states_named_after_their_ruling/",
        "text": "Pretty much every well powerful Muslim state I can name off the top of my head is named for its ruling dynasty. Abbasids, Umayyads, Safavids, Ottomans, the list goes on. It seems like most of these are largely historiographical names. The Umayyads, for instance, would probably just be identified as The Caliphate at the height of their power, since that title wasn't in dispute. The closest thing I can think of in the west is \"Habsburg Empire,\" but I'm not sure how widely used this term was/is. Are these just historiographic names?\n\nHowever, there were also periods of fracture with many dynastic states existing in close proximity, such as the Fatimids, Buyids, and Seljuks. Would these states refer to each other as such, or something like Arabs, Persians, or Turks? It seems like it could be both, with the Ottoman Empire also frequently being identified as the Turkish Empire.",
        "created_utc": 1677606706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has a SCOTUS justice ever been a party in a court case that reached SCOTUS itself? If not, what would happen? Would they not be a justice on that case due to bias?",
        "author": "Chriysalis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ef0la/has_a_scotus_justice_ever_been_a_party_in_a_court/",
        "text": "Just curious as I couldn't find this instance and it seemed not impossible what with people always trying to sue public figures.",
        "created_utc": 1677606682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cassius Dio writes, \"[The Britons] can endure hunger and cold and any kind of hardship; for they plunge into the swamps and exist there for many days with only their heads above water\" Is this claim based in historical fact?",
        "author": "kheled-zaram3019",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eeyl5/cassius_dio_writes_the_britons_can_endure_hunger/",
        "text": "In Epitome of Book LXXVII, Cassius writes about the native inhabitants of the British Isles, the Britons. However, the aforementioned quote seems suspect in reading. Should this quote be viewed as Roman propaganda or is there an actual basis for these claims? Are there any other sources attesting to this behavior? What purpose would burying themselves in the swamp serve?",
        "created_utc": 1677606549,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Change and continuity] How to explain change with past historical examples?",
        "author": "vyueri",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eey8y/change_and_continuity_how_to_explain_change_with/",
        "text": "As of what I have understood, a lot of questions can be answered with change and continuity. For instance \"how's the future perspective of war?\". There will be certain aspects that remain the same, and some that changes, all of this can get further elaborated by historical examples. As for me, I am just wondering about how to express continuiation with those types of examples. For instance:\n\nIf I choose to say (correct me if I am wrong) that a change, will be that people in the future wont have the same \"passion\" or level of nationalism to stand up in war. This can be proven by the fact that, after the Vietnam war in 1975 \\~ people viewed war a lot more pessimistic. \n\nI am just conflicted over the fact that: Can the change be that people in the future will view war *even more* with hatred, and refuse to conscript? Is that a change, or is it maybe a continuation since it technically did start at the end of the cold war and will probably continue that way. \n\nThis is what I don't really get, and would appreaciate someone helping me. \n\nThank you,",
        "created_utc": 1677606525,
        "upvote_ratio": 1.0
    },
    {
        "title": "The trope of nuclear waste being a green ooze goes back until at least the 80s (Saturday morning cartoons and such.) Where did this iconic (and incorrect) image come from?",
        "author": "thepixelpaint",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eep6n/the_trope_of_nuclear_waste_being_a_green_ooze/",
        "text": "",
        "created_utc": 1677605910,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many days in the year could we expect someone living in the Medieval Ages to be sick?",
        "author": "Sweet_Kaleidoscope",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eeeiq/how_many_days_in_the_year_could_we_expect_someone/",
        "text": "In a time where medicine and self-care might have been lacking, what would the day-to-day life of a medieval man or woman look like, health-wise? \n\nIf I’m living in that age, what sorts of sicknesses would be common? How many colds would I get? How many severe illnesses or conditions would I have in my lifetime? Were there widely available treatments or would I just suffer through it?",
        "created_utc": 1677605201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why US foreign policy was more violent in south America or east Asia than in Europe during the cold war ?",
        "author": "Roundaboutan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eed2g/why_us_foreign_policy_was_more_violent_in_south/",
        "text": "The USA have a story of backup Coup d'état in the countries of Latin America, support for anti-communist dictatorships such as Indonesia or Phillipines and millitary invasions as in Vietnam.\n\nHowever, it seems that American foreign policy in Europe was much less violent or does not imply armed forces, why ?",
        "created_utc": 1677605101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Romans free their slave women? If so, what happened to them?",
        "author": "Manfromporlock",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11eeako/did_romans_free_their_slave_women_if_so_what/",
        "text": "I've read about how it was common for Romans to free their slaves; the slave would become a freedman and the former master would still be kind of his patron. But this assumes the slave was a man. What about women? Did Roman slaveowners regularly free their slave women? What was a freedwoman's place in society? What were their lives like?",
        "created_utc": 1677604927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is the weirdest philosopher that lived in pagan Rome?",
        "author": "Azhurai",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ee50m/who_is_the_weirdest_philosopher_that_lived_in/",
        "text": "Exactly as the title asks, who in your opinion would be the weirdest Roman philosopher and why?",
        "created_utc": 1677604569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is British political and economic influence so limited in its former West African colonies when compared to France's standing in equivalent countries? Why is Françafrique a thing yet British Africa is seen as a historical term?",
        "author": "Southdelhiboi",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ee0sb/why_is_british_political_and_economic_influence/",
        "text": "With the [Operation Barkhane](https://en.wikipedia.org/wiki/Operation_Barkhane) ending i wanted to get into why it seems that the french have maintained much greater ties to their former African colonies than the UK, because i cant seem to think of the equivalent ties/influence the UK has to any of its former colonies",
        "created_utc": 1677604284,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did American Colonists first speak of independence?",
        "author": "jeffmangumfanclub",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11edory/when_did_american_colonists_first_speak_of/",
        "text": "In David McCullough's *1776,* there is opposition within the House of Lords to King George's October 26th, 1775 address, specifically regarding the colonist's intension for independence for Britain. \n\n&gt;\"How come it is that the colonies are charged with planning independency?\" the Earl of Shelburne demanded to know. \"Who is it that presumes to put an assertion (what shall I call it, my Lords?) contrary to the fact, contrary to evidence? ... Is it their intention, by thus perpetually sounding independence in the ears of Americans, to lead them to it?\" pg. 13\n\nIs the Earl correct in suggesting that the King and his administration are operating under falsehoods at this point in time?",
        "created_utc": 1677603510,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Buddha sound when he spoke? (Linguistically)",
        "author": "JCurtisDrums",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11edg2g/how_did_the_buddha_sound_when_he_spoke/",
        "text": "What language would he have spoken when teaching his followers, and would it have changed depending on whether he was speaking to commoners as opposed to “nobility” or “royalty”?\n\nPali is used in the texts, but was this actually a spoken language, a dialect of Sanskrit, or something else?\n\nAre there any examples of somebody speaking today that would resemble in words and sound the way he would have spoken? Does anything similar survive?",
        "created_utc": 1677602916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Pyramids look like a TIP of a 4D triangle?",
        "author": "depressedbikers",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11edasw/does_pyramids_look_like_a_tip_of_a_4d_triangle/",
        "text": "If there's any reference or concept or anything on this topic?",
        "created_utc": 1677602546,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some lesser known moral panics?",
        "author": "SmudgedSophie1717",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ed8pa/what_are_some_lesser_known_moral_panics/",
        "text": "I'm interested in researching moral panics in history— especially those that were classed as paranormal or demonic by those who were panicking. Aside from the Satanic Panic, European/Salem witch trials, even QAnon, what are some interesting historical moments of moral panic?",
        "created_utc": 1677602409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were the Ottomans really involved at the Battle of Diu in 1509?",
        "author": "mysoulalamo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ed0oa/were_the_ottomans_really_involved_at_the_battle/",
        "text": "Hello,\n\nWikipedia states that at the Battle of Diu, the Mamluk sultanate had the support of the Republic of Venice, and the Ottomans. Yet, when you read the article, there's barely any mention of the Ottomans, except for the 'Aftermath' portion of the article.\n\nI'm getting conflicting arguments about their involvement in the battle of Diu. Some reddit posts state that they have not been involved at all, some say it was only ottoman traders, and others state that they even sent a fleet.\n\nIn some cases, when talking about the other Battle of Diu of 1538, it's been stated that the Ottomans' wanted 'vengeance' for their defeat back in 1509. So, I'm pretty much confused.\n\nWhat's the truth behind the Ottomans' involvement?",
        "created_utc": 1677601869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historic Moral Panics that are \"supernatural\"",
        "author": "SmudgedSophie1717",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ect3p/historic_moral_panics_that_are_supernatural/",
        "text": "[removed]",
        "created_utc": 1677601353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historical Moral Panics and Paranormal Beliefs",
        "author": "SmudgedSophie1717",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ecrds/historical_moral_panics_and_paranormal_beliefs/",
        "text": "[removed]",
        "created_utc": 1677601238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ottoman involvement at the Battle of Diu (1509)",
        "author": "mysoulalamo",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ecr0e/ottoman_involvement_at_the_battle_of_diu_1509/",
        "text": "[removed]",
        "created_utc": 1677601215,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did the idea that Ireland was a single polity emerge?",
        "author": "bobo12478",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ecmep/when_did_the_idea_that_ireland_was_a_single/",
        "text": "Issues around Northern Ireland have been in the news a lot since Brexit and it seems like the default position among non-experts (both on the internet and in the small slice of my own friend group that's been following along) is some version of \"give it to Ireland\" or \"let Ireland take it back.\" When did the idea that Ireland the island was a single political entity or that the Irish were a single people first come to prominence? The idea that the island was a single place seems absent from the historical through the late medieval era, with multiple kingdoms, viking colonies, and Anglo-Norman settlements creating a mosaic of cultures and political entities. Was it a consequence of the Tudor conquest and the creation of the \"kingdom of Ireland\" that first gave rise to the idea that Ireland was a single place with a single people?",
        "created_utc": 1677600951,
        "upvote_ratio": 1.0
    }
]