[
    {
        "title": "Did Europe and the British Isles used to have bears?",
        "author": "lhistory",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gsen9/did_europe_and_the_british_isles_used_to_have/",
        "text": "[removed]",
        "created_utc": 1677821352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mesopotamian summer. How did people handle it before modern air conditioning?",
        "author": "BttmOfTwostreamland",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gs3k9/mesopotamian_summer_how_did_people_handle_it/",
        "text": "I'm interested in answers about any period of time",
        "created_utc": 1677820402,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common was sex between consenting adult cis men in the ancient world, not just ancient greece? Was it accepted anywhere?",
        "author": "Final_Bookkeeper_862",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11grmu6/how_common_was_sex_between_consenting_adult_cis/",
        "text": "I was doing research on Greek sexuality. Mainly because I'm bi and have always thought that Greece and Rome were places where male bisexuality was the norm. I know pederasty was the dominant form of same-sex activity but I had heard of stuff like the affairs of Alexander the Great and Julius Caesar, and the Sacred Band of Thebes. I knew that in most places tops were respected and bottoms weren't. But I thought places like Thebes were the exception. Therefore my bisexuality is valid and has always existed. Then I found some papers by a former University of Austin professor Thomas K Hubbard.\n\nHere are the papers in question.\n\n[https://bmcr.brynmawr.edu/2003/2003.09.22/](https://bmcr.brynmawr.edu/2003/2003.09.22/)\n\n[https://lists.h-net.org/cgi-bin/logbrowse.pl?trx=vx;list=H-Histsex;month=0902;week=b;msg=Ug%2BYuljwHAbsmjyw%2BhMXhQ](https://lists.h-net.org/cgi-bin/logbrowse.pl?trx=vx;list=H-Histsex;month=0902;week=b;msg=Ug%2BYuljwHAbsmjyw%2BhMXhQ)\n\nSo he denies the Sacred Band of Thebes ever existed, despite the consensus of most historians being that they did exist and were lovers. The only relationships between adult men he brings up are some drunk guys on pottery and Aristotle describing men who continued being bottoms for other men even in adulthood, but only after being introduced to it in their teen years through pederasty. But he still seems hellbent on denying every other incident of sex between adult men. Why is that? Does he seriously think that gay and bisexual adult men who only want to sleep with adult men are a modern invention? \n\nHe seems to believe that sexuality is \"socially constructed\" and evolves. But scientists, in particular psychologists, generally believe that it's a complex interplay between genes, biology, and environmental factors and is thus not a choice. I know most people who believe in the social construction of sexuality also don't believe it's a choice. Because who would choose to face the homophobia and bigotry one faces as a queer person? \n\nI hope he doesn’t think sexuality when it comes to attraction between adults is a choice. I hope he isn’t homophobic. But how much he complains about \"gay marriage fetishists\" and \"gay apologists,\" I'm not quite sure he isn’t homophobic. But then again he wrote an article on prison sex for the Gay &amp; Lesbian Review, so he might be an ally which would be great! Maybe his point is that sex between adult cis men wasn't always accepted by society. I don't know.\n\nAlso I googled this guy, turns out he advocates for pederasty in the modern day ([https://www.thedailybeast.com/students-want-thomas-hubbard-fired-for-work-on-pederasty-but-university-of-texas-says-its-protected-speech](https://www.thedailybeast.com/students-want-thomas-hubbard-fired-for-work-on-pederasty-but-university-of-texas-says-its-protected-speech)) so I really shouldn’t care what he thinks about consentual sexuality. Even if my consentual adult-adult bisexuality isn’t valid (which it is valid and has always existed), at least it isn't taking advantage of teen boys.\n\nBut how common was sex between consenting adult cis men in the ancient world, not just ancient greece? Was it accepted anywhere? Were the Sacred Band of Thebes real and lovers? Thanks.",
        "created_utc": 1677819010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't the Soviet Armed Forces take a more active role in the turmoil in 1989-1991?",
        "author": "GiantPineapple",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11grm32/why_didnt_the_soviet_armed_forces_take_a_more/",
        "text": "My rough understanding of Soviet history is that power grew out of the State security services (such as the NKVD and the KGB), which predominated to the point where it was relatively easy for Stalin to (among other things) have large numbers of senior army officers arrested and disappeared.\n\nDid the armed forces never nurse a grudge over this? Was there any sense among their ranks that the turmoil surrounding 1989-1991 was a good opportunity to assert themselves, whether legally or with extralegal violence?",
        "created_utc": 1677818944,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about postships.",
        "author": "Pepsisugarzero",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gr9p4/a_question_about_postships/",
        "text": "[removed]",
        "created_utc": 1677817893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the Umayyad Arabs move their capital to non-Arab Damascus?",
        "author": "AltSt45",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gr9gg/why_did_the_umayyad_arabs_move_their_capital_to/",
        "text": "It seems very strange to me that the Umayyads, known to be Arab-centric and pro-Arab, would move their capital to a non-Arabic city. How did the rulers communicate with the officials?  I don’t think a reasonable explanation is, the Damascends “learned” it from the neighboring tribes, because that’s not how language acquisition works. Arabic wasn’t really a prestige language at the time, and even if the Ghassanids were prominent in the area, the language of administration was still Greek. I would appreciate some insights on this question and issue.",
        "created_utc": 1677817875,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think the appeal is of WWII to historians?",
        "author": "cheap_poultry",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gr9fz/what_do_you_think_the_appeal_is_of_wwii_to/",
        "text": "I majored in History and I am one of the many people who is extremely interested in WWII history, but it’s also overwhelmingly the most researched war in my experience with other historians. Why do you think this is? \n\nMy theory is that it’s the first war that had ample media coverage and involved multiple states that have interest in it, but also that it tells a classic story in the sense of the bad guys being defeated by the good guys against all odds. \n\nDo you have any other ideas or think differently than me? Why or why not?",
        "created_utc": 1677817874,
        "upvote_ratio": 1.0
    },
    {
        "title": "The term \"post ship\"",
        "author": "Pepsisugarzero",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gr7g4/the_term_post_ship/",
        "text": "[removed]",
        "created_utc": 1677817716,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the Empire of Japan expect USA to respond to the Pearl Harbor attack and what role did the outcome of the Russo-Japanese war play in their thought process?",
        "author": "Metastatic_Autism",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gr4h2/how_did_the_empire_of_japan_expect_usa_to_respond/",
        "text": "",
        "created_utc": 1677817478,
        "upvote_ratio": 1.0
    },
    {
        "title": "D day is often known for elaborate ruses that worked such as plans leaked on Calais or the Potomac towns. Are there famous historical examples where ruses or decoys didn’t work?",
        "author": "scarecrow_phantom",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gr1ye/d_day_is_often_known_for_elaborate_ruses_that/",
        "text": "What the title says.",
        "created_utc": 1677817278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the Windrush generation get UK citizen?",
        "author": "MarkClover",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gqox4/did_the_windrush_generation_get_uk_citizen/",
        "text": "Were they promised citizenship or just a work permit?",
        "created_utc": 1677816207,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the song \"Blood Upon the Risers\" by the US paratroopers, theres a verse about the Medico \"For it had been a week or more since last a 'chute had failed\", yet the rest of the song is about parachutes failing, so how common was it for US WW2 'chutes to fail?",
        "author": "LimeWizard",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gqki3/in_the_song_blood_upon_the_risers_by_the_us/",
        "text": "[Blood Upon the Risers](https://m.youtube.com/watch?v=5HtVYr9aKRM)",
        "created_utc": 1677815868,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would colonization of the New World have changed if Colombus' first voyage had failed and all perished?",
        "author": "Ifch317",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gq90h/how_would_colonization_of_the_new_world_have/",
        "text": "",
        "created_utc": 1677814954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn’t East Asian countries like Japan/China/Korea not explore west to the Americas as much as Europeans?",
        "author": "IonizesAndAtomizes",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gpir1/why_didnt_east_asian_countries_like/",
        "text": "Thinking about a situation where Japan discovers America and expands into the continent. I could imagine a mix of cultural, technological? limitations",
        "created_utc": 1677812913,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Germany change?",
        "author": "throwawaycuzyikes22",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gp9px/how_did_germany_change/",
        "text": "I’m just curious how Germany went from post WWII to present-day or at least what we consider to be modern-day Germany.\n\nSome Americans like to point out how Germany was basically able to take responsibility for the Holocaust as a society and almost culturally and how the US should do the same with our very problematic past. So I’m really just curious to know how they went about doing this.",
        "created_utc": 1677812233,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did japan become one of the most important countries for video games in in the 80s and 90s?",
        "author": "Ill_Yam_3993",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gp62a/how_did_japan_become_one_of_the_most_important/",
        "text": "Nintendo was (irrc) the most popular gaming company world wide, and later during this period so was sony, other japanese dev teams also saw success during this period, despite japans relatively small population. Was it just some teams in jp getting lucky or was there a reason?",
        "created_utc": 1677811948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good resources or ways to find sources on or from Clarence Manion?",
        "author": "LeenMachine3371",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gou5o/any_good_resources_or_ways_to_find_sources_on_or/",
        "text": "Looking for good sources in Clarence Manion\n\nI’m looking for writings, papers, anything from Clarence Manion for a paper I’m writing on the history of American conservatism. So far I can’t find very many actual sources on him aside from Perlstein’s Calm Before the Storm and a few dead ends on JSTOR. \n\nAnything helps, thank you!",
        "created_utc": 1677811035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for good sources in Clarence Manion",
        "author": "LeenMachine3371",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11got9q/looking_for_good_sources_in_clarence_manion/",
        "text": "[removed]",
        "created_utc": 1677810966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was Bismarck in such conflict with his parliament?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11go76s/why_was_bismarck_in_such_conflict_with_his/",
        "text": "So I was reading about Bismarck and it seems his parliament was much more liberal than he was, opposing militarization for instance.",
        "created_utc": 1677809311,
        "upvote_ratio": 1.0
    },
    {
        "title": "How was Germany so effective in both World Wars?",
        "author": "Flashy-Carpet-6513",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11go4pg/how_was_germany_so_effective_in_both_world_wars/",
        "text": "Germany was a relatively small country compared to its adversaries especially in WWII.  How were they so effective and powerful?  What strategies / techniques/ socio-economic conditions made this possible?",
        "created_utc": 1677809120,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m interested in learning about Germany’s effectiveness in both World Wars.",
        "author": "Flashy-Carpet-6513",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gnvh1/im_interested_in_learning_about_germanys/",
        "text": "[removed]",
        "created_utc": 1677808454,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best movies or tv shows about the United States' (or 13 Colonies') war on and/or genocide of the Native Americans?",
        "author": "therealbobcat23",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gnle7/what_are_the_best_movies_or_tv_shows_about_the/",
        "text": "Preferably not documentaries, unless it's a particularly good (and not too hard to find) documentary. Also, I want ones that are as unbiased and historically accurate as possible. \n\nI love learning about US history and in particular this is a topic I feel I should be more educated on, but reading about history can be a bit of a slog from my experience, so I prefer visual mediums to at least spark interest and guide my learning. \n\nThe only films I've seen that apply are Dances With Wolves and The Last of the Mohicans.",
        "created_utc": 1677807700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was North Vietnam aware of the anti-war movement in America during the 60s?",
        "author": "Soft_Assignment8863",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gn2i6/was_north_vietnam_aware_of_the_antiwar_movement/",
        "text": "",
        "created_utc": 1677806331,
        "upvote_ratio": 1.0
    },
    {
        "title": "im looking for primary sources on Jews in the american frontier of south from 1840-1890",
        "author": "claymoron",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gn1f9/im_looking_for_primary_sources_on_jews_in_the/",
        "text": "[removed]",
        "created_utc": 1677806251,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did the common footsoldier have on their shield in Medieval Europe?",
        "author": "PaninicalaBacnk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gn0ye/what_did_the_common_footsoldier_have_on_their/",
        "text": "Would he have a symbol that would indicate his country? Town? Family? Or just smth original?",
        "created_utc": 1677806216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did europeans use wooden shields, but middle eastern used metal shields?",
        "author": "PaninicalaBacnk",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gmqzv/why_did_europeans_use_wooden_shields_but_middle/",
        "text": "",
        "created_utc": 1677805479,
        "upvote_ratio": 1.0
    },
    {
        "title": "During the American Civil War, did Union soldiers see the irony of them fighting the South for wanting independence, the same way their grandfathers fought for independence against the British?",
        "author": "asksoda",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gmqlf/during_the_american_civil_war_did_union_soldiers/",
        "text": "",
        "created_utc": 1677805449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did members of the militsiya (post dissolution of the USSR) carry guns?",
        "author": "moussemunch",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gmgoi/did_members_of_the_militsiya_post_dissolution_of/",
        "text": "",
        "created_utc": 1677804730,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you rank every US president?",
        "author": "AnonymousPigeon0",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gmctz/how_would_you_rank_every_us_president/",
        "text": "I would be interested in an in-depth analysis of every US president. How would you rank them? I would like you to rank them on their presidency alone and not what they did either before or after office. What criteria would you use in order to evaluate their presidency? What is the best way to rate presidents? Tier lists, numbered rankings, etc?",
        "created_utc": 1677804453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you explain what the \"Feeble Minded\" movement was during the 19th and early 20th century? And how it brought the topic of eugenics to the forefront of the social conversation.",
        "author": "social-venom",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gm3jv/could_you_explain_what_the_feeble_minded_movement/",
        "text": "",
        "created_utc": 1677803791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was Richard of Cornwall elected King of the Romans?",
        "author": "Ringil12",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11glso1/why_was_richard_of_cornwall_elected_king_of_the/",
        "text": "Went on a little wikipedia delve today and saw that this happened, another part of my question is how was the HRE governed and large decisions made. I’m aware that it was very decentralized and (at least after a certain point) the title started to mean little, but it still seems weird for this English prince to have to title. Also was there something specific about this election that made the electors want a foreigner, I also saw that the king of Castile was a candidate? Sorry if the question is too multipart, any response is appreciated.",
        "created_utc": 1677803019,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a Soviet economics student in the 1960s. What do I learn? How does it differ from how economics is taught in the West, if at all?",
        "author": "Cryptobismol",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gl9s1/i_am_a_soviet_economics_student_in_the_1960s_what/",
        "text": "",
        "created_utc": 1677801724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Ancient Egyptians foresee people who would not understand why they built what they built?",
        "author": "KoolioKoryn",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gl8fs/did_ancient_egyptians_foresee_people_who_would/",
        "text": "In building some nuclear waste storage, modern humans want to write scary text to be clear that no one in the future should EVER come in. [Here's a wikipedia page](https://en.wikipedia.org/wiki/Long-term_nuclear_waste_warning_messages). \n\nI understand that Ancient Egyptians built things for a relatively long time, so maybe they thought they would always be there to continue to build. Is there any indication they wanted to explain their culture or anything they did to contextless future humans?\n\nI suppose I'd love to hear about other ancient cultures, but Egypt, with their spooky mummy curses (that I know little about), might have had the most similarities to our thoughts on future humans.",
        "created_utc": 1677801646,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the 21st century Scandinavian countries are well known for their progressive egalitarianism, when did this perception begin? Would a woman living in say 17th century Sweden enjoy more freedoms than a French woman of the same era? When did Scandinavian progressivism became a thing?",
        "author": "GancioTheRanter",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gl7n2/in_the_21st_century_scandinavian_countries_are/",
        "text": "",
        "created_utc": 1677801603,
        "upvote_ratio": 1.0
    },
    {
        "title": "During the Holocaust did Nazis ever complain that Jews were hard to find?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gkv41/during_the_holocaust_did_nazis_ever_complain_that/",
        "text": "Many stories about the holocaust such as the diary of Anne frank or maus or jojo rabbit  discuss Jews in hiding. \n\nI am wondering how the Nazis perceived Jews in hiding, what they wrote and thought about it?\n\n\nGoebbels suggests eliminating the Jews is “a small matter,” practically speaking. But did Nazis ever complain about the difficulty of finding Jews or finding certain Jews? Thanks!",
        "created_utc": 1677800800,
        "upvote_ratio": 1.0
    },
    {
        "title": "In some Etruscan tombs, there are paintings with circles along the top. Is there any significance to the circles?",
        "author": "bedragun",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gko95/in_some_etruscan_tombs_there_are_paintings_with/",
        "text": "",
        "created_utc": 1677800406,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Inspired the Plot of a Superman Comic from the 1990's about the Oto Tribe and its conflict with the U.S. Government?",
        "author": "NikosKazantzakis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gkc3k/what_inspired_the_plot_of_a_superman_comic_from/",
        "text": " \n\nSo I came across a Superman comic from the 1990's with a wild plot.\n\nIt is about how Superman tries to reason with a Oto native american \"shaman\" who has legit magic powers. The shaman backs some young Oto teenagers \"radicalized by tv\" who think the US government intends to exploit them in the strip mines it set up in their territory.  Superman defends the law and corporate interests. Superman flies in a representative from \"Abraxis Mining of Boring Kansas\" and the Bureau of Indian Affairs to show the Oto tribal council voted in the stripe mine, despite the opinion of the young tv radicals. The shaman refuses to believe it all isn't a ploy to steal native American land, and misses \"the old ways.\" Superman and the Shaman fight. The Shaman eventually disappears in a gigantic flame wolf. The side plot is Superman screwing up romantically. \n\nThere is a little bit more to the story than that, but that's the gist. \n\nI would assume there is some historical reality that inspired this. Wikipedia informs me that the Otoe are an actual tribe from the Midwest, partly in Kansas (which is the location of the story in this comic, Superman's fictional Kansan hometown). But there's probably more here, right?\n\nIn essence, the comic seems written to make the Oto and their shaman seem prone to violence, fractious within their own community, reluctant to follow the law, and foolishly unable to realize how this strip mine will benefit their own community with employment. So that inspires a few questions.\n\n**What historical events seem like the probable inspiration for the plot of this comic?**\n\n**Was there conflict over the setting up of mines in Oto territory in the 90's or earlier?**\n\n**Or is this specifically inspired by similar controversies between the American government and corporate usage of tribal lands other than the Oto?**\n\n**Were there specific political reasons in the 1990's (when this comic was published) to portray native Americans in the critical way this comic does?**\n\nFor me, the comic feels too specific in its references to not have a specific historical event inspiring it. I would post a picture of the cover, but I don't think that's possible in this subreddit! Thanks in advance for any answers that are provided, it is much appreciated!",
        "created_utc": 1677799776,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does this quote from an American Revolution-era pamphlet mean?",
        "author": "Idk_Very_Much",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gk86o/what_does_this_quote_from_an_american/",
        "text": "I’ve been reading pamphlets from the American Revolutionary era recently. I’m a bit confused about some of the wording in “The Objections to the Taxation of our American Colonies by the Legislature of Great Britain,” in which Soame Jenyns (a member of Parliament) refutes Colonial arguments against taxation.\n\nLastly, that no Englishman is, or can be taxed, without the consent of the majority of those, who are elected by himself, and others of his fellow subjects, to represent them. This is certainly as false as the other two; for every Englishman is taxed, and not one in twenty represented: copyholders, leaseholders, and all men possessed of personal property only, chuse no representatives: Manchester, Birmingham, and many more of our richest and most flourishing trading towns send no members to parliament, consequently they cannot consent by their representatives, because they chuse none to represent them; yet are they not Englishmen? Or are they not taxed?\n\nThe thing I’m confused about is the reference to “copyholders, leaseholders, and all men possessed of personal property only”. What’s a “copyholder,” and why do they, along with the other two, not choose representatives?",
        "created_utc": 1677799593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question About Depiction of Oto Tribe in 1990 Superman Comic",
        "author": "NikosKazantzakis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gk66y/question_about_depiction_of_oto_tribe_in_1990/",
        "text": "[removed]",
        "created_utc": 1677799506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me understand this American Revolution-era pamphlet",
        "author": "Idk_Very_Much",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gjw19/help_me_understand_this_american_revolutionera/",
        "text": "[removed]",
        "created_utc": 1677799108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has India's \"informal economy\" historically been used as a case study by libertarians?",
        "author": "Izzhov",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gju15/has_indias_informal_economy_historically_been/",
        "text": "I only just learned about this concept, and only have a modicum of understanding, but it seems to me that this system is *exactly* what libertarians desire in an economic system (lack of involvement from government), so I'm curious if libertarians in history (i.e. anything that doesn't violate the 20-year-rule) have ever used it as a case study for the \"correct\" (in their view) way to run an economy.",
        "created_utc": 1677799038,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would my Jewish family emigrate from Spain to Salonica after the expulsion of Jews from Spain in 1492 ?",
        "author": "mayor_rishon",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11giw50/how_would_my_jewish_family_emigrate_from_spain_to/",
        "text": "In 1492 Jews are expelled from Spain with the Alhabra Decree, the culmination of almost a century of Christian persecution. Among them my family, which later in that year appears to be one of the founding families of a specific kehila/congregation in Salonica, then part of the Ottoman Empire.\n\nThough I am familiar with the runup and the end result, I have never read details on the logistics of the expulsion other than some Jews fled, temporarily, to Portugal. While I can understand the logistics of the move to north Africa, how did they travel to Italy and the Ottoman Empire ? Did ships carry them directly or they went from port to port until they were not chased away ? Were they aware of the open door policy of the Ottomans ?\n\nAlso given that there were limitations to the amount of property they could move and the cost of the journey, it seems strange the velocity with which the Sephardic communities sprang back to life, not only economically but also culturally with the first printing houses of the Ottoman Empire. Were there ways to circumvent the limitations the Catholic rulers instituted ?\n\nWhat happened between Alhabra and Salonica ?",
        "created_utc": 1677798005,
        "upvote_ratio": 1.0
    },
    {
        "title": "What heraldry or insignias did the Seljik Empire or Fatamid Caliphate use in approx 1000AD, during the First Crusade?",
        "author": "tabletopsidekick",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gispy/what_heraldry_or_insignias_did_the_seljik_empire/",
        "text": "I'm currently working on a First Crusade project. During my digging it has been very easy to find flags and heraldry for the European invaders during that time, however details on the defenders flags/heraldry/symbols are coming up a little short. My surface level research has come up with the following details and I was hoping if anyone could help with further.\n\n[https://en.wikipedia.org/wiki/Islamic\\_flags](https://en.wikipedia.org/wiki/Islamic_flags)\n\n[https://en.wikipedia.org/wiki/Seljuk\\_dynasty](https://en.wikipedia.org/wiki/Seljuk_dynasty)\n\n[https://en.wikipedia.org/wiki/Black\\_Standard](https://en.wikipedia.org/wiki/Black_Standard)\n\nI was able to find some period art pieces that had flags in the background, but nothing consistent. More a tattered flag in the distance or blurred heraldry on top on a gate house. I'm aware that the crescent moon is a notable symbol, however I can't seem to find much else. More specifically, I can't find anything linked to an individual family or leader.\n\nDoes anyone know of any resources that could provide details on family symbology or insignias for the Seljuk/Fatamid/Eastern Mediterranean during 1095 AD?\n\nI'm happy to move away from historical accuracy and settle on \"historically adjacent\". So if there's any design standards for that time/geography that are educated assumptions, I'd love to hear about them too.\n\nThanks for your time.",
        "created_utc": 1677797899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it known when Romans traditionally conducted their census, specifically which month or time of year?",
        "author": "moonbeamlight",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gi114/is_it_known_when_romans_traditionally_conducted/",
        "text": "",
        "created_utc": 1677797041,
        "upvote_ratio": 1.0
    },
    {
        "title": "When/How did the political crusade against \"Saturday Night Specials\" end?",
        "author": "edwardtaughtme",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ghzmp/whenhow_did_the_political_crusade_against/",
        "text": "",
        "created_utc": 1677796997,
        "upvote_ratio": 1.0
    },
    {
        "title": "how were items rescued from homes during the Angloe Boer war?",
        "author": "frightenedFan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ghl11/how_were_items_rescued_from_homes_during_the/",
        "text": "\n\nDuring the war the British put the Boer women and childrrn into concentration camps in an effort to make the guerilla tactics of the Boer fighters more difficult. My grandmother has an old bdnch which was rescued from her grandmothers childhood home aftrr the house was set ablaze. From what I know this bench was hidden in a cave. What I'd like to know is how commonly did this occur and hoe were the items kept safe, especially furniture which would have been large and difficult to move quickly and keep concealed.",
        "created_utc": 1677796553,
        "upvote_ratio": 1.0
    },
    {
        "title": "how were items rescued from homes during the Angloe Boer war",
        "author": "frightenedFan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ghgy4/how_were_items_rescued_from_homes_during_the/",
        "text": "[removed]",
        "created_utc": 1677796434,
        "upvote_ratio": 1.0
    },
    {
        "title": "How easily could a commoner get rich in the past?",
        "author": "Consistent-Gur6932",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ghc3e/how_easily_could_a_commoner_get_rich_in_the_past/",
        "text": "Firstly, was it legally possible for the common person to start their own business and scale it however they liked (without upsetting any politicians), and earn as much as they want?\n\nOr would this be dangerous because nobles could feel threatened or maybe because private property was not easily protected back then (these days we can track everything we own via gps).\n\nSecondly, if the answer to the above is yes, then is there a time period where everyone was forced into their social classes and there was not even the question of opening your own business?\n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1677796291,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Feeble Mindedness Movement in America",
        "author": "social-venom",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ggj82/the_feeble_mindedness_movement_in_america/",
        "text": "[removed]",
        "created_utc": 1677795437,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was going on in Japan that invoked the Japanese-Sino war and their actions in WW2?",
        "author": "BusyStudying",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ggcq4/what_was_going_on_in_japan_that_invoked_the/",
        "text": "Open to any perspectives. At first (ignorant) glance, just seems like Japan leadership was kind of cruel and imperialistic during those time periods. Now with kawaii, anime, tourism, and tech culture etc, Japan seems like a very foreign-friendly country. If true, wondering what changed.",
        "created_utc": 1677795242,
        "upvote_ratio": 1.0
    },
    {
        "title": "were the obotrites closer to feudal Europe than other slavic tribes?",
        "author": "luccabotturarodrig",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gfuyh/were_the_obotrites_closer_to_feudal_europe_than/",
        "text": "So i saw on a game that the obotrites had castle holdings and i wanted to know of this hás any histórical Basis or If the game developera Just made that up. Obviously they were not Just like feudal Europe but How similar were they compared to other tribes? Just as much or more?",
        "created_utc": 1677794704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true per the 1619 project that one of the main reasons the colonists started the revolution was because they wanted to keep slaves?",
        "author": "Darker_Zelda",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gfk9g/is_it_true_per_the_1619_project_that_one_of_the/",
        "text": "",
        "created_utc": 1677794402,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did prostitutes work before condoms? Did they just have babies all the time?",
        "author": "thetimujin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gf8ti/how_did_prostitutes_work_before_condoms_did_they/",
        "text": "",
        "created_utc": 1677793968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Interwar Pacifists re-examine their views during/after WWII?",
        "author": "BlindProphet_413",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gf3is/did_interwar_pacifists_reexamine_their_views/",
        "text": "I was discussing war films with some friends recently and the conversation mentioned the recent adaptation of *Testament of Youth,* which made me think of Vera Brittain, and I remembered that she was a pacifist, although a practical one and volunteered on the home front during WWII. This reminded me of Jeanette Rankin, the sole vote in U.S. Congress against a declaration of war on Japan. This reminded me of, well, yadda yadda yadda, I spent the day thinking about Pacifism and anti-war sentiment in the 20th century.\n\nBut having grown up a Millennial in the United States, most pacifistic or anti-war discussions tend to focus on Vietnam, Panama, Vietnam, Grenada, Vietnam, Iraq, Vietnam,...basically, not on WWII. Meanwhile WWII has taken on an identity of being a \"moral war,\" with a focus on things like liberating invaded nations and, y'know, stopping the Holocaust. My (admittedly limited) readings on the interwar period, both in the United States and elsewhere, focus a lot on increased pacifistic and anti-war sentiment in the wake of the Great War. Increased anti-war sentiment in the aftermath of the Great War is not a surprising development, I'd say. But the next big conflict most of these nations experienced was WWII, the \"moral war.\" So I'm wondering: How did these sentiments change during and after WWII, especially as cultural memory of the war shifted over time?",
        "created_utc": 1677793624,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was so expensive about maintaining the British Empire when you had both the large pool of labor and available resources to exploit?",
        "author": "XSpcwlker",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11geytr/what_was_so_expensive_about_maintaining_the/",
        "text": " \n\nThey had a large [manpower](https://www.reddit.com/r/MapPorn/comments/recbtj/exactly_100_years_ago_the_british_empire_was_at/) to tap into, total population had them around [458 Million!](https://www.reddit.com/r/todayilearned/comments/xt1tc8/til_that_the_height_of_the_british_empire_was/) if you were to calculate the needed resources to maintain Britains 1st great war. The British empire had no reason to believe they alone had to deploy there armies from mainland.\n\nSecondly, current resources in these countries would've made the expense negligible so , there was no reason for the British empire to ***import*** or buy from outside sources.\n\nSo I am trying to understand and see how possibly the empire was \"expensive\" when all the resources were already available to exploit and the large pool of labour they already had to use build and manufacture whatever they needed to be made. \n\nWhat am I not seeing?",
        "created_utc": 1677793319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old shipping marks?",
        "author": "RalphKramden_",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gexu6/old_shipping_marks/",
        "text": "I have this box I purchased a while back with some very odd markings. \n\nI collect old boxes and this one is an old pine box with hand made brass hinges. To me looks like 17th/18th century. Seems to be a writing desk/ captain's box for a tabletop. It appears to be put together with pieces of other boxes and all dovetailed. Appears to have been put together hastily, considering none of the corners are \"squared\", but seem more slapped together. On the inside of the lid are these stamped letters and an odd marking that is an anchor with four letters in it. On the left side of the anchor is a D with F under it and on the right side is an M with a C under it.\n\nAt first I thought this was some type of European trading company markings, but really can't find anything similar. I wish there was a way to add photos here. TIA for any help on this.",
        "created_utc": 1677793255,
        "upvote_ratio": 1.0
    },
    {
        "title": "I never understood when people say \"It was to expensive for Great Britain to maintain the empire\" despite the available resources within the empire.",
        "author": "XSpcwlker",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11geuev/i_never_understood_when_people_say_it_was_to/",
        "text": "[removed]",
        "created_utc": 1677793028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did people wear strange hats in the 1940's and 1950's?",
        "author": "Gitxsan",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gest3/did_people_wear_strange_hats_in_the_1940s_and/",
        "text": "I ask because of Archie comics. I believe they're originally set in the 1940's and 50's. Jughead ALWAYS wears that weird crown. Did teens back then wear strange hats?",
        "created_utc": 1677792924,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the foot binding tradition in China even start? Who made it up and why?",
        "author": "thetimujin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gekd1/how_did_the_foot_binding_tradition_in_china_even/",
        "text": "",
        "created_utc": 1677792388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Stalin Begin Calling The U.S.S.R. the \"Fatherland\" instead of the \"Motherland?\"",
        "author": "BlinkingChampion105",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gegw8/why_did_stalin_begin_calling_the_ussr_the/",
        "text": "In a 1931 speech by Stalin, he says something to the effect of: We did not have a Fatherland in the past, now we do. What is his meaning behind this? Is it just referring to the Soviet Union's intended global power and assumes a masculine position for it? Or is it referring to the Soviet Union as \"the provider\" for the people?",
        "created_utc": 1677792164,
        "upvote_ratio": 0.99
    },
    {
        "title": "Who are the 'Founding Fathers' anyway?",
        "author": "ta05242021",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gefa2/who_are_the_founding_fathers_anyway/",
        "text": "Is there canon in the history community as to who counts as a 'founding father' of the United States?  I was listening to a \"Great Courses\" lecture recently and the presenter made a pretty dramatic case that it's difficult to identify who the founding fathers really are?  \n\nFor instance:\n\n* All signers of the Declaration of Independence didn't necessarily sign the Constitution.\n* The progenitors of the Articles of Confederation weren't all involved in the formation of the subsequent US Constitution.\n* John Jay - to name only one -- did not sign the Declaration or the Constitution, but had a dramatic impact on the founding if the United States\n* Are legislators who ratified the Constitution at the state level considered founding fathers? \n\nAnd so on....\n\nIt seems to me that we pick selectively who a founding father is depending on the particular point we're trying to make.  My own view is the concept now has become so amorphous that legal, historic and general conversations that invoke the notion of founding fathers are clouding the issue they are trying to make. \n\nNOTE: I make a distinction here between 'Founders' and 'Framers' where a framer is a signatory to the final US Constitution.",
        "created_utc": 1677792062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Gilgamesh even a real person? How much do we know about this?",
        "author": "thetimujin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ged9b/was_gilgamesh_even_a_real_person_how_much_do_we/",
        "text": "",
        "created_utc": 1677791937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are certain countries explicitly called for in those NATO provisions? Explanation in text.",
        "author": "Isatis_tinctoria",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ge8rd/why_are_certain_countries_explicitly_called_for/",
        "text": "[https://www.reddit.com/user/jschooltiger/](https://www.reddit.com/user/jschooltiger/) suggested I post this question in this post: [https://www.reddit.com/r/AskHistorians/comments/11f94ls/comment/jan23x2/?context=3](https://www.reddit.com/r/AskHistorians/comments/11f94ls/comment/jan23x2/?context=3)\n\nI ask this in response to this post: [https://www.reddit.com/r/AskHistorians/comments/n96n2b/in\\_1961\\_goa\\_a\\_colony\\_of\\_portugal\\_at\\_the\\_time\\_was/](https://www.reddit.com/r/AskHistorians/comments/n96n2b/in_1961_goa_a_colony_of_portugal_at_the_time_was/)\n\nOne of the responses states that [per Article 6](https://www.nato.int/cps/en/natolive/official_texts_17120.htm):\n\n&gt;\"For the purpose of Article 5, an armed attack on one or more of the Parties is deemed to include an armed attack:  \n&gt;  \n&gt;on the territory of any of the Parties in Europe or North America, on the Algerian Departments of France 2, on the territory of Turkey or on the Islands under the jurisdiction of any of the Parties in the North Atlantic area north of the Tropic of Cancer;  \non the forces, vessels, or aircraft of any of the Parties, when in or over these territories or any other area in Europe in which occupation forces of any of the Parties were stationed on the date when the Treaty entered into force or the Mediterranean Sea or the North Atlantic area north of the Tropic of Cancer.\n\nThis Redditor - [https://www.reddit.com/user/Kochevnik81/](https://www.reddit.com/user/Kochevnik81/) \\- stated in that original post:\n\n&gt;The only colonial possessions considered covered by NATO were the French possessions in Algeria, as they were legally considered part of Metropolitan France.  \n&gt;  \n&gt;As for international reactions: broadly speaking, they did break down along Cold War lines. Soviet First Secretary Khrushchev was actually in India on a state visit when hostilities broke out on December 18, and he made it publicly clear that he considered Indian actions to be \"absolutely lawful and justified\", and that the Soviet people stood behind Indian actions. The Soviet embassador at the UN would later go on to state that has far as the USSR was concerned, it was an internal Indian matter. This position was echoed by other Soviet bloc countries in Eastern Europe, plus Yugoslavia.  \n&gt;  \n&gt;Britain and Commonwealth countries like New Zealand, Australia, and Canada struck a rather cautious tone. Britain itself felt stuck between supporting long-standing ally Portugal and alienating a major Commonwealth member such as India. It and the other countries described generally took a stance of shock/surprise/regret that the situation was being resolved by military means, while also recognizing the strong Indian public support for transferring the Portuguese territories to Indian control.  \n&gt;  \n&gt;The United States similarly took a legalistic stance of concern over the use of force. At the United Nations, US ambassador Adlai Stevenson would be a bit stronger in language. He first praised India's role in the United Nations (\"Few nations have done more to uphold the principles of the Organization or to support its peace-making efforts all over the world\"), and noted that he considered Prime Minister Nehru to be a personal friend, and also recognized the strength of Indian feeling on the Goa issue. Yet he went on to decry the use of force to resolve a territorial dispute, and argued that it jeopardized the UN Charter. He sponsored a Security Council resolution calling for a cease-fire, Indian withdrawal and a negotiated settlement, but the Council voted 7 in favor, 4 against, with the USSR casting its 99th veto to sink the resolution.  \n&gt;  \n&gt;A number of former colonial possessions were much more vocal in support of India, including Indonesia, Ceylon, Egypt and Ghana. India's Nehru, Indonesia's Sukarno, Ghana's Nkrumah, and Egypt's Nasser had, along with Yugoslavia's Tito, established the Non-Aligned Movement earlier that year, so it makes sense that these states in particular would come out strongly in favor of India. In contrast, Pakistan (perhaps unsurprisingly) denounced the \"naked militarism\" of India, while maintaining a neutrality in the conflict to the point of interning Portuguese ships and confiscating Portuguese ammunition shipments.  \n&gt;  \n&gt;Communist China struck a rather unique tone - while the Beijing government professed \"resolute support\" for India, Chinese Communist Party organs (such as its newspaper in Hong Kong) took a slightly different line, calling the invasion “a desperate attempt by Mr. Nehru to regain his sagging prestige among the Afro-Asian nations,” and ridiculing India for fighting \"the world's tiniest imperialist country.\" It's worth noting that China and India would themselves fight a border war ten months later.  \n&gt;  \n&gt;In the grand scheme of the early 1960s, for all the public concern noted by the states above, in non-Indian/non-Portuguese public opinion, the Goa Crisis was a relatively minor issue, especially compared with major Cold War-related crises that occurred before, during and immediately after, such as the Congo Crisis and the Cuban Missile Crisis.  \n&gt;  \n&gt;These reactions are largely pulled from:  \n&gt;  \n&gt;*Keesing's Record of World Events*, Volume 8, March, 1962 India, Portugal, Indian, Page 18659 available [here](https://web.stanford.edu/group/tomzgroup/pmwiki/uploads/1074-1962-03-KS-b-RCW.pdf)",
        "created_utc": 1677791659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are bagels associated with Jews?",
        "author": "sinking-meadow",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gdz78/why_are_bagels_associated_with_jews/",
        "text": "I was going through wikipedia and there is a pretty weird discussion ongoing there about the origin of the bagel.  From the talk page, it appears that some wikipedia users (MrOllie specifically) insist that bagels originated in Jewish culture despite the lack of sources supporting that.  It looks like multiple attempts to amend this unfactual statement have been rejected as \"Jewish erasure\".  \n\nIgnoring how ridiculous the above is, is anyone able to provide a history of the bagel with some sources? I've found quite a few myself but I wanted to ask on this page as users here are quite good at this stuff.\n\nThanks!",
        "created_utc": 1677791041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there different kinds of wine in Ancient Rome? Could I order a cup of white wine with my fish dinner?",
        "author": "CitrusMints",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gdoco/were_there_different_kinds_of_wine_in_ancient/",
        "text": "",
        "created_utc": 1677790361,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the 80s and early 90s, there was lot of handwringing in US media about how Japan was taking over the world economically. Was there anyone prominent who predicted what actually happened, where Japan's demographic bubble burst and office productivity fell off due to not embracing the internet?",
        "author": "patangpatang",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gdd4i/in_the_80s_and_early_90s_there_was_lot_of/",
        "text": "",
        "created_utc": 1677789626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going on a family trip to the Williamsburg, VA, USA area. What resources would you reccomend?",
        "author": "rossacre",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gd7eb/going_on_a_family_trip_to_the_williamsburg_va_usa/",
        "text": "Hello, thank you for reading and/or helping out.\n\nMy family, as well as my friends family will be traveling to the Williamsburg VA, USA area.  We will be focusing on historical sites while in the area and currently plan on visiting the following:\n\n1. Colonial Williamsburg (historical downtown area)\n2. Historic Jamestown settlement\n3. Yorktown Battlefield\n4. Busch Gardens (not historical)\n\nMy question is; what resources would you recommend for me to brush up on the history / historical context of these places?\n\nMyself, I'm not afraid to roll up my sleeves and dive into more \"academic\" stuff, but I will also be traveling with a variety of children ages five through thirteen so I would appreciate recommendations of all levels of comprehension.\n\nAgain thank you for taking the time to read and/or answer.  I preemptively apologize for not asking a hard hitting or edgy question.",
        "created_utc": 1677789266,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were Kasturba Mohandas' political views different from her husband's?",
        "author": "greenkoalapoop",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gcwi2/how_were_kasturba_mohandas_political_views/",
        "text": "While many aspects of the depictions of Ghandi have been widely discussed, I found it quite hard to find information about Ghandi's wife, Kasturba Mohandas. I was particularly interested in how her views are different from her husband's, and her contribution to the Indian Independence.\n\nTurning to ChatGPT, I got the following response, but I can't find any sources to support these claims. Given how ChatGPT is notorious for being confidently inaccurate, I was wondering if anyone can chime in about whether this is an accurate characterization of Kasturba's political views?\n\n&amp;#x200B;\n\n&gt;One area where Kasturba had different views from Gandhi was regarding the education of their children. Gandhi believed in a simple and traditional education, which emphasized practical skills and manual labor. Kasturba, on the other hand, believed in a more formal education for their children, with a focus on academic subjects and the arts.  \n&gt;  \n&gt;Another area where Kasturba had different views from Gandhi was regarding the role of women in society. While both believed in the importance of women's rights and equality, Kasturba believed that women should have a greater role in politics and social activism, while Gandhi believed that women's primary role should be in the domestic sphere.  \n&gt;  \n&gt;Additionally, Kasturba was more critical of the caste system than Gandhi, who believed that it could be reformed from within. Kasturba believed that the caste system was inherently unjust and needed to be abolished completely.",
        "created_utc": 1677788566,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did immigration work in the Roman Empire? I am leaving the question intentionally broad, happy with any answers that would give details on the matter.",
        "author": "RedCloak90",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gcwdu/how_did_immigration_work_in_the_roman_empire_i_am/",
        "text": "",
        "created_utc": 1677788558,
        "upvote_ratio": 1.0
    },
    {
        "title": "political views of Kasturba Ghandi that differ from her husband's",
        "author": "greenkoalapoop",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gcuwj/political_views_of_kasturba_ghandi_that_differ/",
        "text": "[removed]",
        "created_utc": 1677788468,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the relationship between India and Ireland like during the colonial era and how did it evolve over time?",
        "author": "gagearcane",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gcuq5/what_was_the_relationship_between_india_and/",
        "text": "",
        "created_utc": 1677788457,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Few inventions have been so simple as the stirrup, but few have had so catalytic an influence on history.\" – Lynn White Jr. Why? What so great about a stirrup?",
        "author": "thetimujin",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gci4j/few_inventions_have_been_so_simple_as_the_stirrup/",
        "text": "",
        "created_utc": 1677787657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Political view of Kasturba Mohandas Ghandi",
        "author": "greenkoalapoop",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gcg6g/political_view_of_kasturba_mohandas_ghandi/",
        "text": "[removed]",
        "created_utc": 1677787528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does it seem like there’s been no research done on the historicity of the Ramayana/Mahabharata compared to the Iliad and Odyssey? What *do* we know about the ancient Indian epics?",
        "author": "Futhis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gbz2b/why_does_it_seem_like_theres_been_no_research/",
        "text": "As a second generation Indian living in the U.S., recently I’ve attempted to read the ancient epics of my people to connect better with my culture and heritage. While we read about the Homeric epics a lot in school, we never really touched on the eastern literary tradition (which makes sense since my school was in the U.S., not complaining about that).\n\nBut when I attempt to read more into the context of the Ramayana and Mahabharata, all there is is frustration and disappointment. It seems like there’s been very little scholarly work done to evaluate any historical core to these works, while there have been hundreds of scholarly books written about legendary Ancient Greece. The “work” that a layperson can find online about the Indian epics seems to be limited to blogs written in broken English and created by Hindu nationalists, and poorly sourced paragraphs (not even entire articles, just paragraphs) on Wikipedia.\n\nMaybe someone here has done some better research. What do we know about historicity of the Ramayana and Mahabharata? Have we uncovered either literary context clues or hard archeological evidence suggesting there could be a historical core to the story?",
        "created_utc": 1677786422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations for a comprehensive understanding of the origins, history, and development of Sufism?",
        "author": "Dashjack30",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gbpzs/book_recommendations_for_a_comprehensive/",
        "text": "I come from a Muslim Arab background, so I am largely familiar with the historical development of Islam, the successive political caliphates/empires, and the various Sunni and Shia sects which emerged and gained prominence in different places and eras.\n\nThroughout my readings, notable Sufi scholars, Sufi political influence within the Ottoman empire, and the Sufi role of the spread of Islam throughout Asia were mentioned within their respective contexts. However, I do not feel like I have a strong grasp of their historical origins, beliefs, practices, and modern existence. Sufism certainly does not receive the same mainstream popular attention as the Sunni/Shia divide.\n\nI have a general association in my mind of Sufism with poetry, mysticism, and a more spiritual interpretation of Islam. Is this impression correct? How have their beliefs and practices developed alongside those of mainstream Sunni/Shia Islam?\n\nI understand that this is a very wide topic, so while I would love to receive summary responses, I would also greatly appreciate if any experts could point me to a handful of definitive sources. Thanks in advance!",
        "created_utc": 1677785828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did the complex territorial divisions of the German states of the Holy Roman Empire affect the local residents much?",
        "author": "WHAAAAAAAM",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gbdeh/did_the_complex_territorial_divisions_of_the/",
        "text": "Seemingly for much of its history, the map of the HRE looked like it was drawn by Jackson Pollock - a myriad of blobby enclaves and exclaves. This map from 1789 demonstrates this well. [https://en.wikipedia.org/wiki/File:HRR\\_1789\\_Landgrafschaft\\_Hessen-Kassel.png](https://en.wikipedia.org/wiki/File:HRR_1789_Landgrafschaft_Hessen-Kassel.png)\n\n&amp;#x200B;\n\nObviously the HRE was around for a long time, and I'll bet the laws of these territories changed about as much as the maps did. \n\n&amp;#x200B;\n\nA map so complex seems crazy by today's standards, and I can't fathom how people living in those areas would have dealt with that. But for most of the population of those areas, were these complex territorial divisions simply markings on a map and of no significance to them? If a peasant had to travel through several territories would they have to show a passport or have some kind of permission? Were these complex territories mostly relevant only to the aristocracy that owned and collected resources from them, or  did it have a significant impact on the rest of the population too?\n\n&amp;#x200B;\n\nAlso, I know the modern understandings of nationality wouldn't have existed the same way, if at all, for much of the HRE's existence, but would, for example, the citizens of the Landgraviate of Hesse-Darmstadt felt an affinity for their fellow residents? Would they have identified as Hesse-Darmstadtian?\n\n&amp;#x200B;\n\nThanks for reading, thanks in advance for replying, and my apologies if this has already been answered, I couldn't find an answer on the sub!",
        "created_utc": 1677785016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any unknown interesting empires and kingdoms in Northern, West and Central Europe. Germany, British isles, France and the nordics etc",
        "author": "TheRealGustavVasa",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gb9xc/any_unknown_interesting_empires_and_kingdoms_in/",
        "text": "",
        "created_utc": 1677784797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did julius caesar have rizz?",
        "author": "weloveupegasus",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gb883/did_julius_caesar_have_rizz/",
        "text": "I want to know",
        "created_utc": 1677784683,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Spanish football become so remarkable in the second half of the XX century?",
        "author": "Capivara2666",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gau3g/how_did_spanish_football_become_so_remarkable_in/",
        "text": "As far as I know, Spain never was a footballing potency for most of the XX century compared to other European countries like England, Germany or Italy, just as its national team was not regarded as specially competitive in the World Cup as the Netherlands, Argentina or even Hungary. However, in the beginning of the XXI the rivalry between Real Madrid and Barcelona became widespread around the world, creating passions on an unprecedented scale, and for sure nowadays no one can think less of the Spanish football as a whole.\n\nI already know something about the marketing strategy behind Real Madrid's projection, but I am more interested about the development of Spanish football itself and its connections to social history. How did it become exactly so powerful, what made it possible? Is the redemocratization of Spain somehow related to this process?",
        "created_utc": 1677783758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were there black slave owners in the United States?",
        "author": "Ranimgor",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gapyz/were_there_black_slave_owners_in_the_united_states/",
        "text": "Last night with some friends we were watching Django Unchained and one of the characters in this film treats black people as slaves (Stephen, played by Samuel L. Jackson), and that's why we asked ourselves the question previously asked.\n\nWe did some research on the subject and the answer is that there was in the Florida part but we are looking for a more solid answer to ratify that this really happened.",
        "created_utc": 1677783500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any recorded moments in history where two rivals played a Chess match to the death?",
        "author": "CowFirm5634",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gak3g/are_there_any_recorded_moments_in_history_where/",
        "text": "",
        "created_utc": 1677783114,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was Nazi Germany's economy like? How did they go from hyperinflation in the great depression to suddenly fighting the planet?",
        "author": "WP_Swan265",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11gacwt/what_was_nazi_germanys_economy_like_how_did_they/",
        "text": "How did germany get their economy so strong in such a short period of time? The Weimar Republic and Great Depression ruined Germany then a few years later they fight the planet.",
        "created_utc": 1677782643,
        "upvote_ratio": 1.0
    },
    {
        "title": "where did the initial inhabitants of Constantinople come from?",
        "author": "Itchy_Investment942",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ga6y2/where_did_the_initial_inhabitants_of/",
        "text": "where did the original settlers following the city’s founding primarily come from? were they the local inhabitants from in and around byzantion? italian aristocrats migrating over? or all over the above (sorry if this a bad question i’m just a laymen)",
        "created_utc": 1677782222,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about the original inhabitants of Constantinople",
        "author": "Itchy_Investment942",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ga5k7/question_about_the_original_inhabitants_of/",
        "text": "[removed]",
        "created_utc": 1677782127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which ancient/medieval state had most extensive border control, similar in it's scope to modern one?",
        "author": "ramzes8811",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11ga2sv/which_ancientmedieval_state_had_most_extensive/",
        "text": "",
        "created_utc": 1677781938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which defensive weapons (AA artillery, howitzers etc) did the Japanese use to defend Iwo Jima and Okinawa in WW2?",
        "author": "kanakalis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g9qbc/which_defensive_weapons_aa_artillery_howitzers/",
        "text": "",
        "created_utc": 1677781087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which defensive weapons (AA artillery, howitzers etc) did the Japanese use to defend Iwo Jima and Okinawa in WW2",
        "author": "kanakalis",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g9pme/which_defensive_weapons_aa_artillery_howitzers/",
        "text": "",
        "created_utc": 1677781038,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would a Victorian British Army (or similar) soldier have handled scouting and surveying?",
        "author": "jvonm",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g9mz2/how_would_a_victorian_british_army_or_similar/",
        "text": " Hello!\n\nI'm doing a play and would love to know if an average, fairly experienced soldier would be competent in tasks like navigation, mapping, orienteering etc. Would an average soldier carry a pen and paper, and be able to sketch a map? Perhaps someone would keep some charcoal for this purpose? Would someone in a unit be specialized in this? Doesn't need to be exact - for example, if there's more documentation on the practices of a similar army around that time, I'd be happy to read about that.\n\nAre there any sources on the specific techniques or practices generally used by soldiers, let's say, on arriving in a new unknown area?",
        "created_utc": 1677780834,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did German socialists react to the Russian revolution, particularly the treaty of Brest litvosk?",
        "author": "Remote_Doughnut_5261",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g9g8m/how_did_german_socialists_react_to_the_russian/",
        "text": "I would think they would naturally want an alliance with revolutionary Russia.",
        "created_utc": 1677780373,
        "upvote_ratio": 1.0
    },
    {
        "title": "This question might be controversial or even ignorant to a certain extent but why do modern day Egyptian's look differently than Egyptian's that were depicted in ancient artifacts, portraits, or even statues?",
        "author": "Educational-Buyer487",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g9dt5/this_question_might_be_controversial_or_even/",
        "text": "",
        "created_utc": 1677780214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Both Joseph and Jesus were carpenters. How would this have affected the family economically? What quality of life would they have had?",
        "author": "mimi7600",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g92bn/both_joseph_and_jesus_were_carpenters_how_would/",
        "text": "They were carpenters, so I'm trying to understand what a carpenter 'was' at that point in time. Was the trade respected? What economic class could they have fallen into? Could a family have a stable life because of it? What were they paid with? Money and/or bartering?\n\n\nI'm also seeking answers because Jesus seems like he would've used carpentry to help others in need. It's a type of construction, so he could've used it to build homes or shelter for those who needed it. At one point, Jesus was wandering with his apostles. If money was required, a trade might easily bring that in.",
        "created_utc": 1677779463,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"praefectus relictus\" mean?",
        "author": "Koryfeusz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g8u0b/what_does_praefectus_relictus_mean/",
        "text": "Where can I find information about it? I looked in The Oxford Classical Dictionary, but did not find the information there.\nThe phrase comes from the Liber de morte and refers to Antipater's role in Macedonia.\n\n\"Qui praefectus in Macedonia erat relictus\".",
        "created_utc": 1677778902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Praefectus relictus",
        "author": "Koryfeusz",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g8rci/praefectus_relictus/",
        "text": "[removed]",
        "created_utc": 1677778724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given their origin, is it normal my ancestors may have lied on the census in the 1930s-40s?",
        "author": "jrrybock",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g8jnv/given_their_origin_is_it_normal_my_ancestors_may/",
        "text": " My great-parents emigrated in the mid-19-teens to the US from near Kiev in Ukraine; my grandfather, the eldest, born a short while later. Their name was Rybachok, which my grandfather and his brothers, around the time they were in college and supposedly tired of people not pronouncing their names right, shortened it to Rybock.  \nThis is the tale I was told. And it makes sense. Heck, when I went to college, I took Russian, and I had a Ukrainian TA who on the second day gave us all our names in Cyrillic, and she changed my name back to Rybackok... and I asked her how she knew, and she said \"Oh, it's a pretty common name, I assumed that's what happened.\"\n\nSo, on [Ancentry.com](https://ancentry.com/), I was working on a family tree (adding to what my grandmother, pre-internet, did using the Mormon archives, which is apparently pretty extensive). And they have scans of old documents. And there are a couple census sheets with my family on it - in their house, all their names... but there is a space for \"place of origin\" and it lists what would be Poland now. And for languages spoken in the house, \"German\" is listed.\n\nMy grandparents, much less my great-grandparents, are gone. I've asked my dad and aunt about this, and it makes no sense to them; they were never told anything but about getting from Ukraine to Michigan and they can use a few Ukranian phrases they learned from their grandmother.\n\nSo, trying to reconcile these, my thought is there must have been some pressure to not say you were from a Soviet area in the 20s and 30s... while many think of a Red Scare as McCarthy, I know there was one post-WW1 a well. Certainly no one can answer for my specific family in this case, but I am just looking to understand what may have been going on that I hear this specific and consistent family history on one hand, but there are \"official\" government records saying another (and by that, I mean what Sam or Tillie told a census taker over 2 censuses).",
        "created_utc": 1677778212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anti-Soviet sentiment in the US / how my family may have reacted",
        "author": "jrrybock",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g8hc0/antisoviet_sentiment_in_the_us_how_my_family_may/",
        "text": "[removed]",
        "created_utc": 1677778049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did people stop using ancient technology?",
        "author": "FireMajinDamien",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g8fta/why_did_people_stop_using_ancient_technology/",
        "text": "",
        "created_utc": 1677777949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ancient technology",
        "author": "FireMajinDamien",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g8eiq/ancient_technology/",
        "text": "[removed]",
        "created_utc": 1677777860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do American military campaigns in the Middle East create radicals, terrorists, etc?",
        "author": "RANKLmyDANKL",
        "url": "https://www.reddit.com/r/AskHistorians/comments/11g7vhl/do_american_military_campaigns_in_the_middle_east/",
        "text": "Hypothetically if the US and/or allies used a drone strike with civilian casualties, do the friends and family of those killed display any more anti-American resentment? Do any of them go further and become jihadis as well?\n\nI realize this is a big topic with a scope of more than 40-50 years now, but I tried googling it and couldn’t find anything. If this is against the rules of the sub, could anyone at least point me in the right direction? Thanks!",
        "created_utc": 1677776594,
        "upvote_ratio": 1.0
    }
]