[
    {
        "title": "Looking for material: modern American detective fiction.",
        "author": "malkavian777",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rjx6t/looking_for_material_modern_american_detective/",
        "text": "Hey, Reddit!\n\nI'm working on a paper at school, the topic for which is connected with modern American detective fiction. \n\nI'm not so much into detectives, and not so familiar with American crime fiction, and modern, to add to that... (more of a sci-fi guy)\n\nSo please, can you direct me to some must-read writers? \n\nThe only i found now is Lawrence Block, read Sins of our Fathers, which has some allusions.. \nWould be nice to know some other books by other writers, preferably with enough allusive text to work on... \n\nThanks in advance!",
        "created_utc": 1420578125,
        "upvote_ratio": ""
    },
    {
        "title": "Holy Grail and King Arthur",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rjkoq/holy_grail_and_king_arthur/",
        "text": "I don't find a clear answer of some things about the Holy Grail, because it has a lot versions. So can be someone clear on the following questions: why does King Arthur ask for the Holy Grail and why is it called 'the Holy Grail'?\n\nThanks a lot :)",
        "created_utc": 1420572488,
        "upvote_ratio": ""
    },
    {
        "title": "Otherness in English Great War lit.",
        "author": "Conflouder",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rfxxh/otherness_in_english_great_war_lit/",
        "text": "Hullo. I'm working on an undergrad assignment with Heart of Darkness and Great War poetry. It's one of those poorly thought-out modules and I made a mistake early on writing about Forster's *Maurice*, which would have been rather more relevant for this second assignment (I would risk plagerising myself). I was wondering if anyone might know off-hand of any academic work exploring the notion of otherness in Great War lit that they could put me in the direction of without being overly specific of course... Or indeed perhaps poets to explore. ",
        "created_utc": 1420494111,
        "upvote_ratio": ""
    },
    {
        "title": "What argument is there that strong arts and culture - especially literature - is a means of strengthening one's country and that writing is a service to one's country?",
        "author": "Rllrllrrlrrl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rfjkd/what_argument_is_there_that_strong_arts_and/",
        "text": "",
        "created_utc": 1420487581,
        "upvote_ratio": ""
    },
    {
        "title": "Is this a literary device?",
        "author": "Platypusafro",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rennr/is_this_a_literary_device/",
        "text": "So I'm doing my higher English lit IB IOP. I've found that in Wuthering Heights, it is never mentioned that the women are pregnant until they give birth, probably because readers at that time would probably presume that if a woman gets married, she will soon become pregnant. Is there any official term for these assumptions that are unnecessary to mention because the reader should, in theory, know them?\n\nThanks for your help :)",
        "created_utc": 1420471295,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with my thesis - memoirs and autobiographies",
        "author": "freakmeoutt",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2renn0/i_need_help_with_my_thesis_memoirs_and/",
        "text": "Hi guys, I am currently fighting with my MA thesis, because it appears I have completely lost my way.\nI am writing about the struggle of women with mental illness in the 60's (Girl, interrupted by Susanna Kaysen, and An Unquiet Mind by Kay Redfield Jamison &lt;- they are my \"core\"), and I have no idea what I'm trying to prove. At first I wanted to show that their writing was therapeutic in some way (even though they have finished their treatment), and I based myself on the narrative therapy theory. However, now I'm starting to realise it's all utter bullshit, and I need to change it. \nBut how? What can I prove? Should I compare them or something? I am really bad at coming up with ideas, I'd rather follow given instructions (do this and that), but my prof. is not willing to give any.\n\nPlease, someone, help me, or at least point where I should go to ask this kind of a question.",
        "created_utc": 1420471281,
        "upvote_ratio": ""
    },
    {
        "title": "Do we know where and when the archetypical Merlin-like Wizard (high hat, white beard) was created in literature? (r/AskHistorians x-post)",
        "author": "0verlor1",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2r752e/do_we_know_where_and_when_the_archetypical/",
        "text": "",
        "created_utc": 1420286136,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for short stories/poems that depict/criticize/celebrate the U.S. South, especially its food, fashion, and language.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2r6i2j/looking_for_short_storiespoems_that/",
        "text": "Hey y'all! I'm prepping for my upcoming writing course, with the theme of southern culture and diversity. I plan to present the course in units of food, fashion, and language. I want to use these sub-themes to get at issues of southern identity, attempting to address the ways in which the south uses these concepts to distinguish itself from other parts of the country and to maintain distinctions of class, gender, and race within its borders.\n\nWith each unit, I'd like to offer my students a couple of poems and a short story or two that capture or comment on the food, fashion, and/or language of the southern U.S. Any recommendations? I'm particularly interested in more contemporary works, as this is an area of literature I am less familiar with.\n\nEdit: As is commented, upon below, I apologize if this seemed lazy or unprofessional. I am working within a first year writing program where we are assigned our course themes, and this theme is very different from the literary era in which I specialize. I certainly have plenty of material of my own that I have in mind, but was hoping to glean from others who may have more experience with this era of literature. It isn't required that we feature literary works, but I thought doing so would spice it up a bit. \n\nThanks in advance!\n",
        "created_utc": 1420264558,
        "upvote_ratio": ""
    },
    {
        "title": "Futurism short story/essay about Americans visiting Europe?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2r16dl/futurism_short_storyessay_about_americans/",
        "text": "Do you guys know of a short story, possibly named something like \"In a hundred/thousand years\"? It's from the 19th century, and it details Americans visiting Europe in \"flying ships\" or something like that. I've been searching for it all day! Any help is hugely appreciated. ",
        "created_utc": 1420144084,
        "upvote_ratio": ""
    },
    {
        "title": "Any hard science fiction about the multiverse?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2quj5t/any_hard_science_fiction_about_the_multiverse/",
        "text": "I hope it's okay to post this question here...I'm looking for fictional books, especially in the hard science fiction category, that focus on travelling between many parallel universes, or around the multiverse. I'm interested in how different authors think it could be done or what makes it possible in their world. Any suggestions?",
        "created_utc": 1419971543,
        "upvote_ratio": ""
    },
    {
        "title": "Help On SYMBOLISMS of Biblical Characters!",
        "author": "Skyypanda",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2qtd6b/help_on_symbolisms_of_biblical_characters/",
        "text": "I have an assignment on symbolisms of biblical characters assigned by my  teacher at school. The characters i have choosen are as listed below\n\n* Saint Peter\n* David and Goliath \n* Noah (Noah's Ark)\n* Gabriel the Archangel\n* Lucifer\n* Adam and Eve\n\nSorry for the mistakes, English is not my native language neither am i Christian nor Jewish. Help is much appreciated! Thanks!\n",
        "created_utc": 1419948719,
        "upvote_ratio": ""
    },
    {
        "title": "How to judge a work of literature",
        "author": "consciouself",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2qocxt/how_to_judge_a_work_of_literature/",
        "text": "I am wondering how you all go about judging a work of literature as you're reading it and/or when you've finished. I don't mean analyzing it through a particular lens for meaning but just why exactly do you enjoy the books you do, and how do you know if it was good?",
        "created_utc": 1419823491,
        "upvote_ratio": ""
    },
    {
        "title": "How long did Nabokov's Pale Fire take to write?",
        "author": "throwawayails",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2qnqu3/how_long_did_nabokovs_pale_fire_take_to_write/",
        "text": "I'm currently writing a paper on it, and the amount of work that must have gone into it astounds me. I know the novel was completed in 1962, but I'm just curious as to when it was begun. Does anybody have a source for this? Thank you so much!",
        "created_utc": 1419810374,
        "upvote_ratio": ""
    },
    {
        "title": "Influential and classic texts to read for a solid foundation in understanding literature",
        "author": "WanderingPlatypus",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2qjqp4/influential_and_classic_texts_to_read_for_a_solid/",
        "text": "Over the past year or so, I've begun to read up on works that I'd consider to be cornerstones in Western lit. (e.g. Homer, Ovid, Plato etc., and I'm currently exploring the Bible). Other than for the sake of entertainment, I'd also like to have an adequate understanding of the writing that has a huge influence on literature and society. I feel this would allow me to appreciate so many things that I'd be blind to without having done so, as it would be nice not to have to rely on footnotes and Wikipedia in order to comprehend the allusions that come up so often. Right now I'm in my first year of university, and feel as if the courses that cover 'Literary Foundations' just cherry pick certain texts to teach and skip over other key works. In addition, I've been told that--considering I'm an aspiring writer--there would also be a level of artistic responsibility fulfilled in reading such important books. If anything, I think I'd be able to learn a great deal by absorbing as much as I can. What would be your suggestions--in terms of specific texts and also just general advice--that could help me on my way? ",
        "created_utc": 1419704784,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis of \"Drift\"",
        "author": "Eversome",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2qet6s/analysis_of_drift/",
        "text": "",
        "created_utc": 1419560093,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for the name of a literary (or maybe rhetorical) device.",
        "author": "nmitchell076",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2q7bzj/looking_for_the_name_of_a_literary_or_maybe/",
        "text": "Hello!\n\nI'm wondering if there is a term for something that snaps someone out of a \"lull\" to bring them back into focus before the onset of some really important event in the narrative or argument.  This could be a literary device or a rhetorical one.  I'm specifically wondering if there is a term for this.\n\nI'm actually a music theorist who has come across a device in some early eighteenth century italian music that does something similar.  Right before the end of the phrase, the ongoing musical texture undergoes this radical and abrupt change, with these marked chromatic figures, then the music relaxes into the cadence (the generic stamp that says the portion of the music is over).  It's a really nice device especially in arias, because by snapping the listeners to attention, you \"set the stage\" for the singer to step out and do their thing.\n\nMaybe a musical example will help illustrate the type of literary analogue I'm looking for.  I'll show two examples from Pergolesi where the same musical device is used for the exact same purpose:\n\n1) *Stabat mater,* \"Sancta mater istud argas\" https://www.youtube.com/watch?v=DyHewYbHWkA\n\nmovement begins at 11 seconds.  We sort of settle into comfortability with the ongoing texture early on (especially at around 25 seconds).  Then, notice the change that occurs at 32 seconds: we get this really striking moment, with the melody first pointing up, and then pointing down, after which we \"relax\" into the cadential stamp at 40 seconds.  The \"wake up\" and the cadence is then repeated in its entirety.\n\n2) *La serva padrona,* \"Son imbrogliato io gia\" https://www.youtube.com/watch?v=iBhdAK4sDjY\n\nmovement begins at 2:02.  After this repeating ostinato that just churns over and over for 4 seconds, we get a snap into unison, then essentially the same figure from the previous example appears at 2:06, relaxing into a cadence afterwards.\n\nSo I'm looking for something in argument rhetoric or literary construction that does something similar, a \"wake up call\" that signals the listeners to pay attention before the articulation of some basic point (the cadence that comes after).  Something that shocks us out of \"here's an ongoing discourse\" to say \"hey, I think the point of the argument is about to come up.\"",
        "created_utc": 1419363525,
        "upvote_ratio": ""
    },
    {
        "title": "A little help with a line from \"Look back in anger\"?",
        "author": "hiimnoam64",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2q1plu/a_little_help_with_a_line_from_look_back_in_anger/",
        "text": "Hi, could someone help me understand what Jimmy is trying to tell in the next lines: \"As for my mother, all she could think about was the fact that she had allied herself to a man who *seemed to be on the wrong side in all things*. *My mother was all for being associated with minorities*, provided they were the smart, fashionable ones.\" \n\nDoes he mean his father was always among minorities with a bad social name?\n\nThanks.",
        "created_utc": 1419230299,
        "upvote_ratio": ""
    },
    {
        "title": "Does there exist an equivalent of Mallory's Le Mort d'Arthur/T.H. White's Once and Future King that deals with the Matter of France?",
        "author": "EncephaloRay",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2q0zna/does_there_exist_an_equivalent_of_mallorys_le/",
        "text": "After reading the Once and Future King and thoroughly enjoying the blend of legend, history, and the examination of motive and morals that drove each figure, I've been desperate to read an equivalent that deals with the Matter of France - bonus points for the Matter of Rome, too!\n\nEither in style or content, (but preferably both) a work that concerns Charlemagne and Roland in place of Arthur and Lancelot would be my absolute pleasure to read.",
        "created_utc": 1419214071,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best edition of Moby Dick I can buy?",
        "author": "Thurn-und-Taxis",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2q0ut8/whats_the_best_edition_of_moby_dick_i_can_buy/",
        "text": "Hey everybody, I'm not sure if it's cool to post this here but here it goes. I'm looking to read Moby Dick for the first time and after browsing Amazon for some time I realised that there are a million different editions of it. What I would like to ask is, what's the best edition I can buy? I like aesthetically appealing editions but I'm more concerned with which one will make the reading more accessible to me. Which version has the best footnotes, introduction, essays, etc.. I know it's a difficult read so if you have any advice let me know. Thank you guys. ",
        "created_utc": 1419211231,
        "upvote_ratio": ""
    },
    {
        "title": "Can you improve this list of artists killed in WW1?",
        "author": "myatomsareyouratoms",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2q0pvv/can_you_improve_this_list_of_artists_killed_in_ww1/",
        "text": "https://en.wikipedia.org/wiki/User:Phantomsnake/List_of_Artists_Killed_in_the_First_World_War\n\n________________\n\n**Poets**\n\nRupert Brooke\n\nJulian Grenfell\n\nWilfred Owen\n\nIsaac Rosenberg painter and poet\n\nCharles Sorley\n\nArthur Graeme West poet and diarist\n\nEdward Thomas\n\nGuillaume Apollinaire d.1918 poet and critic a French poet, playwright, short story writer, novelist, and art critic of Polish descent.\n\nAlan Seeger\n\nJoyce Kilmer\n\nJohn McCrae\n\n\n**Visual Artists**\n\nHenri Gaudier-Brzeska Fr. d.1915\n\nAntonio Sant'Elia It. d.1916 architect\n\nUmberto Boccioni It. painter and sculptor\n\nAugust Macke Gr. d.1914\n\nFranz Marc Gr. d.1916\n\n~~Egon Schiele Aus. d.1918~~\n\nBrian Hatton GB d.1916\n\n**Composers**\n\nGeorge Butterworth GB d.1916\n\nErnest Farrar GB 1918\n\nW.D.Browne GB 1915\n\nCecil Coles GB 1918\n\nFrederick Kelly Anglo-Australian\n\nRudi Stephan Ger.\n\nAlberic Magnard Fr. 1914",
        "created_utc": 1419208338,
        "upvote_ratio": ""
    },
    {
        "title": "Finding a topic for a paper (that has already been dealt with ?)",
        "author": "UselessWisdomMachine",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2pz16o/finding_a_topic_for_a_paper_that_has_already_been/",
        "text": "I don't know of this is the proper place to, so please excuse me in advance if you feel my question feels like it doesn't belong here.\n\nWe're supposed to write a research paper for a class about american short stories in the 20th century. I was thinking to write \"Sea Oak\" by George Saunders and its commentary/depiction on contemporary american society/working class/consumerism and popular culture, etc. (probably using another of his stories to compare).\n\nWhile looking for secondary literature I found out everything i wanted to say has been pretty much said up to some extent by someone else. It seems kinda general and obvious...so I guess I shouldn't be too surprised.\n\nI would still love to write about the story I picked because I really enjoyed it. But the literature I found about came to me more like a hindrance than a blessing. I feel that anything I write has a good chance of written the articled I found, so If don’t quote It’ll look like I’m plagiarizing; If I quote too much my paper won’t have much original ideas.I wanted to talk to my instructor tomorrow anyways to see what she thinks about the whole affair, but I wanted to see if you guys could tell me anything beforehand. \nI’m thinking about changing my topic as a worst case scenario, but nothing else has come to my mind (besides as I said, I would really like to write about this). This is the first time we’re supposed to come up with a topic of our own so apart from  what I had in mind I’m really clueless.\n\nEdit: i realized the title of my post can be a bit confusing. What I originally wanted to write was \"finding a topic for a paper that has NOT already been dealt with\"\n",
        "created_utc": 1419170578,
        "upvote_ratio": ""
    },
    {
        "title": "What is this device called and what is the point?",
        "author": "samlir",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2pxuan/what_is_this_device_called_and_what_is_the_point/",
        "text": "In The Hunchback of Notre Dame, a character is telling the story of a poor mother and daughter. The character explains that the mother could not afford to heat their home, that the cold caused the girl to have a prettier skin tone, she attracted men because of the tone, and became a loose woman exchanging sex for money and gifts. I would think the more conventional reasoning would be the girl was sick of being poor and started selling herself. \n\nHugo might have been trying to be funny or making the character telling the story look dumb, but I have seen reasonings like this that miss the main point before in other works, especially the Greeks without the humor. ",
        "created_utc": 1419129357,
        "upvote_ratio": ""
    },
    {
        "title": "Differences in language between British and American literature",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2puugp/differences_in_language_between_british_and/",
        "text": "English is my second language but I occasionally read in English, and there seems to be, generally speaking, some differences in style between American writers and British writers. I talked to an American friend about it, and told him I would in British authors often encounter a more flowery language where there is perhaps an effort of aesthics or perhaps a willingness to seem erudite in choice of words, leading to a more personal style perhaps. Whereas American writers, it seems to me, seem to tell their story more plainly, with easy to understand appropriate words, in a more standardized fashion. \n\nMy friend agreed with me in a general sense and we started talking about what the reasons for that could perhaps be.\n\nWe somewhat settled on a hypotheses, on Americans perhaps being influenced by the ideals of their revolution wishing to speak and write plainly in contrast to the nobility of Britain, for example, who perhaps spoke elegantly and eloquently to set themselves apart from the lower classes. Another idea was proposed by my friend, that because of immigration into the US it would be easier to sell books if the language was kept plain and simple, because many potential readers would find it hard to detect the finer nuances in the language, and that the language of society itself perhaps adapted in a way to make it more easily accessible because immigration was so common. \n\nWhat are your thoughts? Is there a difference as I tried to describe, or could it be described better? It would be interesting to hear more from native speakers on these differences and how they perhaps came about, but please, don't post about which is better or anything that would de-rail the thread.",
        "created_utc": 1419048733,
        "upvote_ratio": ""
    },
    {
        "title": "Texts/essays on diasporic literature?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2prz0c/textsessays_on_diasporic_literature/",
        "text": "As I begin my undergraduate dissertation proposal for 2015, I've realised the topic I've been most interested in is diasporic/transnationalistic literature. I propose to explore\npostcolonial Indian literature (not limited to novels of ‘The Satanic Verses’ and ‘The Namesake’) and its role as a trope to delve into hybridity and conquest of identity of self vs the Other. I am interested particularly in the critical notion of the implementation of magical realism, non-linear narrative and hybridity of identity and language to reflect transnationalism and migrant conditions.\n\nOther than Homi Bhabha's works, I was wondering what texts/scholarly essays/etc you would recommend on the topic?",
        "created_utc": 1418984140,
        "upvote_ratio": ""
    },
    {
        "title": "Critique my undergrad dissertation proposal?",
        "author": "syndi",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2pb2io/critique_my_undergrad_dissertation_proposal/",
        "text": "Hi there, I'm submitting my proposal soon and would really like to get some feedback on it before I do. It's dealing with masculine identity in Flann O'Brien. I'm uploading it on dropbox as opposed to posting it directly here as I'm nervous about plagiarism detectors and the like. I'm doing up an annotated bibliography for it at the minute so don't fret about the lack of works cited!\n\nhttps://www.dropbox.com/s/lghe8ifqqn6cpk7/Dissertation.doc?dl=0\n\nThanks in advance! \n\nEdit: Egh, I had changed my thesis statement to include the titles of the texts and forgot to include the word 'in' after the titles.",
        "created_utc": 1418601836,
        "upvote_ratio": ""
    },
    {
        "title": "What issues are raised in the criticism or writing of literature? What is the task of criticism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p9vf6/what_issues_are_raised_in_the_criticism_or/",
        "text": "",
        "created_utc": 1418578242,
        "upvote_ratio": ""
    },
    {
        "title": "The relationship between Hemingway and the FBI",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p9bgj/the_relationship_between_hemingway_and_the_fbi/",
        "text": "Sources would be appreciated. Please note that I have read the Hotchner article and recommending it is therefore unnecessary",
        "created_utc": 1418563366,
        "upvote_ratio": ""
    },
    {
        "title": "What issues are raised in the criticism or writing of literature? What is the task of criticism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p8nco/what_issues_are_raised_in_the_criticism_or/",
        "text": "",
        "created_utc": 1418536338,
        "upvote_ratio": ""
    },
    {
        "title": "Would anyone like to give me their opinion on the role of alcohol in Beowulf? I have my own explication, but I'm looking for some more good thoughts for a course I'm proctoring.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p88y8/would_anyone_like_to_give_me_their_opinion_on_the/",
        "text": "",
        "created_utc": 1418526086,
        "upvote_ratio": ""
    },
    {
        "title": "High school student in need of advice/suggestions",
        "author": "Lagmower",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p7hw0/high_school_student_in_need_of_advicesuggestions/",
        "text": "Hello, everybody. \n\nI come here looking for aid, and I've stumbled upon this subreddit by browsing a bit through r/literature, and figured these sorts of questions are better asked here.\n\nAs most of you probably know, there is generally a finishing exam of sorts when one is about to leave high school, something that is referred to as a maturity diploma in my country. Students get to choose between three to possibly five areas of study for the exam, depending on their course of choice. \n\nI've taken up the language course myself, mostly out of utility as I find German very useful, but this is not to say I don't enjoy a good read or am unable to offer at least an amateur-styled analysis of a work of literature - on the contrary. To clarify, this \"exam\" is not an exam, per se - it's a paper done on a particular subject of our choice.\n\nI'm here looking for suggestions for subjects. I have two on the table right now, but to me they're a bit stale and I'd enjoy something new. These are:\n\n* The use of Freudian theories in \"Waiting for Godot\" by S. Beckett or,\n\n* Elements of science fiction demonstrated through \"The Hitchhikers Guide to the Galaxy\" by Douglas Adams\n\nAny and all help would be appreciated. Also, the origin and time period of the book is irrelevant.\n\nThank you in advance.",
        "created_utc": 1418509052,
        "upvote_ratio": ""
    },
    {
        "title": "What are some notable symbolism of random objects?",
        "author": "kakmong",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p6r7i/what_are_some_notable_symbolism_of_random_objects/",
        "text": "I am given an assignment for Literature class, which I have to find out a symbolism imbued in any random objects. I am having difficulty to do so, because I cannot think of any, in such broad topic. Following this so-called 'guideline' would be very appreciated, but it is not necessarily to be done so!\n\nWhat is the object:\nWhere / when was it used:\nWhat is its original purpose:\nWhat is its symbolic meaning:\n\nFilling up first two would be really helpful for me. Thank you so much, Redditers! (I am new to reddit.com. :P)",
        "created_utc": 1418493390,
        "upvote_ratio": ""
    },
    {
        "title": "The authorship of Aesop's Fables?",
        "author": "satanspanties",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p66x0/the_authorship_of_aesops_fables/",
        "text": "My English Lit textbook mentions Aesop in passing, and says:\n\n&gt; Fables were attributed to him by later writers, so that the term 'Aesop's Fables' has the status of a venerable literary brand.\n\nIt doesn't say anything else, because he's not the focus, but it piqued my interest. How they come to be attributed to him? Did other authors intentionally write fables and slap Aesop's name on them, or did they take existing folk stories and attribute them to Aesop for want of an author? Or is there something more subtle at play? Or is it one of those things we don't really know? \n\nWikipedia kind of skirted around my questions, and I wasn't sure where else to look for more information something that's arguably related to folk literature.",
        "created_utc": 1418478459,
        "upvote_ratio": ""
    },
    {
        "title": "I need a Shakespeare quote.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p5k38/i_need_a_shakespeare_quote/",
        "text": "I need a Shakespeare quote (for engraving) for my partner who is graduating Uni to teach English and History. He has acted in Hamlet and loves Richard III. Im a fairly literary minded person, but Im terrible when it comes to Shakespeare, could anyone help me out?",
        "created_utc": 1418452244,
        "upvote_ratio": ""
    },
    {
        "title": "GermanLit Questions",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2p33ti/germanlit_questions/",
        "text": "1. Discuss Adventures of a Simpleton in its socio-historical context.\n2. What does make Nathan the Wise a piece of Enlightenment literature as defined by Kant?\n3. Relate the play Mary Stuart to the movement of Sturm und Drang.\n4. Describe the literary significance of the relationship between Faust and Margaret.\n",
        "created_utc": 1418399009,
        "upvote_ratio": ""
    },
    {
        "title": "Any criticism linked to character desire and internal conflict in fiction?",
        "author": "c_sellers",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2oz45p/any_criticism_linked_to_character_desire_and/",
        "text": "Working on an essay for a creative writing class. Want to write on internal conflict, morality and desire in character as a catalyst for narrative. Any ideas? \n\nThanks in advance! ",
        "created_utc": 1418308937,
        "upvote_ratio": ""
    },
    {
        "title": "How did the neo-Romantic movement and Decadence movement differ?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2owi2z/how_did_the_neoromantic_movement_and_decadence/",
        "text": "I have an exam tomorrow that will cover these two topics, and I'm not quite sure about how their issues/qualities differ. Specifically in scandinavia, if that makes any difference. Any help at all would be extremely appreciated. Thank you.",
        "created_utc": 1418245758,
        "upvote_ratio": ""
    },
    {
        "title": "High School student looking for a good literature article on Dostoevsky's Crime and Punishment.",
        "author": "145638",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2otwxo/high_school_student_looking_for_a_good_literature/",
        "text": "The teacher has offered an extra credit assignment on Crime and Punishment for class. I'm the only one in class doing it. We must find a professional literature article on Dostoevsky's Crime and Punishment. It should view the book from a certain \"lens\" such as a feminist, Marxist perspective. We are to make a presentation out of it and present to the class. I've been looking for an article of google scholar, but from what I'm finding is that most are a bit too much for me, or aren't a reasonable length. Can anybody suggest me a good interesting article, or a website where I can find some? ",
        "created_utc": 1418184075,
        "upvote_ratio": ""
    },
    {
        "title": "What are some popular books/authors that are considered experimental right now? Is the rate of change in styles and literary movements happening faster as time goes on in the same way technological advancements have?",
        "author": "Rllrllrrlrrl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ot7kb/what_are_some_popular_booksauthors_that_are/",
        "text": "",
        "created_utc": 1418170590,
        "upvote_ratio": ""
    },
    {
        "title": "Critique my undergraduate dissertation abstract/research proposal?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2os9lz/critique_my_undergraduate_dissertation/",
        "text": "This is for an undergrad dissertation that I'll be writing next semester and spent the last semester researching. I'm currently annotating my bibliography so I'm aware that there's no works cited included, but I'm mainly concerned with the actual argument itself (and issues of clarity, etc.). It will be 8000 words when it's completed, and it's concerned with Flann O'Brien and Irish masculine identity. I would be tremendously grateful if you could tell me what you think and where I could improve! The abstract/background aims/methodology separation is expected by my tutor.\n\nhttps://www.dropbox.com/s/lghe8ifqqn6cpk7/Dissertation.doc?dl=0\n\nI've decided to upload it on dropbox as I'm nervous it may set off some plagiarism detectors if I were to post it it directly here. Thanks in advance!",
        "created_utc": 1418154072,
        "upvote_ratio": ""
    },
    {
        "title": "Gift for a Russian literature buff. [NEED ADVICE]",
        "author": "JonSleet",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2os3mr/gift_for_a_russian_literature_buff_need_advice/",
        "text": "Hello, my girlfriend is a Russian literature scholar and soccer fan. I am going to get her the Russian National Team jersey with either Tolstoy or Толсто́й on the back, but I need to choose a number? 28 is birth year and 10 is death year, but if there is some other more appropriate number, let me know. Two questions, 1) should I get the English or Cyrillic and 2) What should the number be?\n",
        "created_utc": 1418151236,
        "upvote_ratio": ""
    },
    {
        "title": "What is a literature (poems, short stories, novels) in the schooling years that has a value: everyone is an actor in everyone else's play?",
        "author": "maxpatho",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2onme7/what_is_a_literature_poems_short_stories_novels/",
        "text": "",
        "created_utc": 1418055113,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know of any good sources about the Realism period in English literature?",
        "author": "zzappe",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2okj80/do_you_know_of_any_good_sources_about_the_realism/",
        "text": "My girlfriend is writing about The realism period in literature and need Information about English Realism. General information, time period, authors, books, characteristics and so on.\nDo you know any good sites about Realism in English literature?\nThanks in advance :D.",
        "created_utc": 1417978476,
        "upvote_ratio": ""
    },
    {
        "title": "'Little Women' - Has anyone read any criticism/essays suggesting Jo may have not been straight?",
        "author": "360Saturn",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2oinhm/little_women_has_anyone_read_any_criticismessays/",
        "text": "I recently read the book (and Good Wives) and yes, I am an adult, and being an adult...I definitely read Jo as a queer woman. Vehement disinterest in men; a best male friend who she has no romantic interest in, and a love for gender subversion herself - to the point of saying she would rather be a boy than a girl.\n\nBut I'm surprised that I've found very little online suggesting that either professional or amateur critics, or fans, have read this 'into' the text. Surely I can't be the first person to think of it? Have there been any similar discussions online anywhere? or essays that you've read that come to similar conclusions?\n\nPS. I also am making a collection of queer readings of classic or children's texts at the minute - so if anyone has any critic recommendations or things to google that would be great too. Thanks :)",
        "created_utc": 1417921833,
        "upvote_ratio": ""
    },
    {
        "title": "Money by Martin Amis (literary commentary)",
        "author": "frenchguy75",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ohdyt/money_by_martin_amis_literary_commentary/",
        "text": "I just finished Money by Martin Amis and I have to pick a passage from this book and comment it for my English class. What would be the most interesting passage to comment in your opinion ? ",
        "created_utc": 1417894519,
        "upvote_ratio": ""
    },
    {
        "title": "Finding a collection of Shakespeare",
        "author": "MercilessLoki",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2odccv/finding_a_collection_of_shakespeare/",
        "text": "I am looking to purchase a collection of Shakespeare's works and would like to know what the best collection is. I know there are many our there, but I also know they are not all equal. Bonus points for a collection that is friendly to readers who are new to Shakespeare. Thank you for your help. ",
        "created_utc": 1417793797,
        "upvote_ratio": ""
    },
    {
        "title": "What are some modern or present-day critical writers on the subject of the sublime?",
        "author": "arostganomo",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2odbuo/what_are_some_modern_or_presentday_critical/",
        "text": "I am writing my bachelor paper on elements of the sublime in dystopian and gothic literature, in particular in David Mitchell's Cloud Atlas and Nick Cave's And the Ass Saw the Angel. I've been looking into Kant and Burke, but my promotors have urged me to find some more recent authors too. Do any of you have suggestions on who has written interesting books or papers on this subject?",
        "created_utc": 1417793484,
        "upvote_ratio": ""
    },
    {
        "title": "Ben Jonson's \"To John Donne\" marred by anxiety of influence?",
        "author": "tree4beard",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2o6ws8/ben_jonsons_to_john_donne_marred_by_anxiety_of/",
        "text": "Hey all I've got to write a paper about \"To John Donne\" by Ben Jonson and how it negotiates the anxiety of influence. So far my thesis is basically saying that the poem praises Donne but also showcases Jonson's unease about his place in canonical history and makes him feel as though he has to assert himself. As Harold Bloom says, authors have to engage with other canonical authors to be canonical, which is essentially what Jonson is doing by asserting himself next to Donne. My evidence is that he uses hyperbole to hint that Donne isn't as good as he is ostensibly saying he is. The use of 11 syllables in the line \"And which no affection praise enough can give\" is satirical because he feels he is in reality giving him more than enough praise. Jonson's use of iambic pentameter and rhyming couplets is also a jab at what he considered to be Donne's nonmetrical poetry. Also since Donne was only writing Coterie and Jonson had his works published he's setting himself above Donne. \n\nI really just want some support and to know if y'all think this would be a good upper division Lit paper. Any advice would also be appreciated.",
        "created_utc": 1417641064,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Studies - What's The Point?",
        "author": "AncientHistory",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2o49g7/literary_studies_whats_the_point/",
        "text": "This came up in a silly comment to a silly thread on /r/writing.\n\n&gt; [We don't need literary analysis. Literary analysts need literary analysis to feel important.](http://www.reddit.com/r/writing/comments/2o3gwf/what_makes_writing_good/cmjf24k)\n\nTo me, this is wrong...but I know the attitude. I saw it a lot in university, in writing classes and music classes, the people that think natural ability is all you need. That anyone can (write a story/compose a piece/paint a picture) if they have the desire and talent, and that nobody can tell them that their particular method or style is incorrect; and yes, there are creative types that don't fare well in the history and theory classes, and wonder why they have to suffer through all these tedious hair-splittings and assessments of other people's art instead of going out there and creating their own art.\n\nThese are the people that reinvent the same wheel a dozen times, independently, and tend to plateau in their vision and technical ability.\n\nTo me, the point of literary studies (and extending it a bit, the point of any rigorous discipline of study in any subject) is to not just curate the achievements of the past, but to try and understand them in different contexts, to see how they work and why - and then, ultimately, to use that understanding to achieve something comparable or better. To advance the art.\n\nBut that's me, and I admit I have a limited formal background in literary studies. So I'd like to ask you, Literary Studies types - why do you do it? What is the point, for you? What do you hope to achieve? (Yes, \"tenure\" is an acceptable answer.)",
        "created_utc": 1417577052,
        "upvote_ratio": ""
    },
    {
        "title": "How does Virginia Woolf make her argument in 'A Room of One's Own'?",
        "author": "Ucsc_slug",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2o37if/how_does_virginia_woolf_make_her_argument_in_a/",
        "text": "I'm about to start reading Virginia Woolf's 'A Room of One's Own' for my final essay and I was inquiring which are the main techniques and points that Virginia Woolf makes in the text. While reading, I'll be able to have a heads up on what to look for while outlining my final paper. Thanks for your assistance.",
        "created_utc": 1417557872,
        "upvote_ratio": ""
    },
    {
        "title": "How does poetry work in non-indoeuropean languages?",
        "author": "hansgreger",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nzdzu/how_does_poetry_work_in_nonindoeuropean_languages/",
        "text": "Hey! So the other day we had a lecture about russian realism and the professor kept mentioning how different authors wanted their works to be considered \"verse on prose\" or \"prose on verse\" which struck me as quite odd. I tried to ask what different types of verse the russian poets at the time would write in but alas it was not known to the professor. So basically I'm wondering, what different types of verse (like we have the sonnet etc) are used in langauges of non indo-european descent? \n\nIt also got me thinking how in the romance langauges one counts syllables and in the germanic one tends to mostly care about emphasized/unemphasized syllables. In the end, I started wondering.. is perhaps verse viewed upon radically different in other languages? Japanese poetry seems to rely on syllables (or? At least haiku does..), is that true for all of them?\n\nBasically I'm someone interested in writing poetry myself and looking to expand my ways of viewing upon it by learning about different udnerstandings of it, so if you have any good book or article recommendations, that would be cool as well!\n\nThanks in advance for any response you might be able to provide me,\n\nBest regards\n\nHansgreger",
        "created_utc": 1417471472,
        "upvote_ratio": ""
    },
    {
        "title": "How does one go about correcting a falsity in literary studies?",
        "author": "desaderal",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nyzmo/how_does_one_go_about_correcting_a_falsity_in/",
        "text": "I recently came to believe that the translator of Lucien of Samosata was biased (homophobic) when attributing selected works as being an imposter or Pseudo-Lucien. How do I go about correcting this issue?",
        "created_utc": 1417464678,
        "upvote_ratio": ""
    },
    {
        "title": "What is the source of a medieval work in which a woman, through fate, is cast into a series of monogamous, albeit brief relationships?",
        "author": "jlks",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ny3ko/what_is_the_source_of_a_medieval_work_in_which_a/",
        "text": "",
        "created_utc": 1417448406,
        "upvote_ratio": ""
    },
    {
        "title": "A question about the Age of Enlightenment",
        "author": "WheresMySkill",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nxosj/a_question_about_the_age_of_enlightenment/",
        "text": "In the Age of Enlightenment a lot of books were written about people stranded on a non-existent island. Why were these books written and do they have deeper meaning?\n",
        "created_utc": 1417437509,
        "upvote_ratio": ""
    },
    {
        "title": "Gérard Genette and the concept of extradiegetic vs. intradiegetic narrators",
        "author": "imagril",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nukqu/gérard_genette_and_the_concept_of_extradiegetic/",
        "text": "So, for some days I've been trying to reconcile the ideas of extradiegetic and intradiegetic narrators with those of homodiegetic and heterodiegetic narration, but somehow, whenever I think that I finally got it, the whole thing seems to slip away from me.\n\nThe difference between homodiegetic and heterodiegetic narrators is clear to me, but as soon as the categories of extradiegetic and intradiegetic get involved, I get confused: From my understanding, this is the \"point\" from which the narrator tells the story. So a narrator that participated in a story, thus making him a homodiegetic narrator, could tell the story at some point in the future, thus making him an extradiegetic narrator. But, if a person who participated in a story tells it at some point in the future while, in the diegesis, making it clear that they are telling a story from some point in the past, this would make them an intradiegetic narrator.\n\nCan there even be such a thing as an extradiegetic homodiegetic/autodiegetic narrator? As you can likely see, I'm pretty confused regarding this and I would be very grateful for an explanation.",
        "created_utc": 1417361964,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone please illuminate Blanchot's \"death of the author\" concept and how he influenced Foucault's Discipline and Punish? It seemed to me, while reading The Space of Literature, that he was implicitly suggesting to give up reading altogether. Was this all in my mind?",
        "author": "Rllrllrrlrrl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nsz38/can_someone_please_illuminate_blanchots_death_of/",
        "text": "",
        "created_utc": 1417309369,
        "upvote_ratio": ""
    },
    {
        "title": "Best books on hermeneutics for beginners?",
        "author": "Rllrllrrlrrl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nsx0e/best_books_on_hermeneutics_for_beginners/",
        "text": "",
        "created_utc": 1417308005,
        "upvote_ratio": ""
    },
    {
        "title": "Technicalities of similes and metaphors",
        "author": "Lexyeb",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2np6mb/technicalities_of_similes_and_metaphors/",
        "text": "“her bright cheek, as soft and pure in its bloom as a wild rose, and her eyes radiant with cloudless pleasure”\nThe first part of this statement is a simile comparing her cheek to a rose directly. However, it is unclear to me if the second half about her eyes would also be considered a simile. It seems like it could also be a metaphor because it doesn't use \"like\" or \"as\". Tell me, oh wise literary geenies... ",
        "created_utc": 1417209084,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone give me some hints and tips for the question ‘How far would you agree that Wilde’s female characters in the play create far more comedy than the men?’. The question is on 'The Importance Of Being Earnest' By Oscar Wilde",
        "author": "DoctorJanitorsfan",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2no85p/can_anyone_give_me_some_hints_and_tips_for_the/",
        "text": "I am no means asking for anyone to write the essay for me, i'm just looking for some general help, as I am finding it quite hard",
        "created_utc": 1417188681,
        "upvote_ratio": ""
    },
    {
        "title": "Help identifying archetypes",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nm5sw/help_identifying_archetypes/",
        "text": "I am doing literary Criticism in school and i am suppose to find archetypes in the music video [Blurred Lines](https://www.youtube.com/watch?v=yyDUC1LUXSU), can anyone help me out?",
        "created_utc": 1417127089,
        "upvote_ratio": ""
    },
    {
        "title": "Who is being influenced by Cormac McCarthy?",
        "author": "amauldin71",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nly63/who_is_being_influenced_by_cormac_mccarthy/",
        "text": "If Cormac McCarthy was influenced by the likes of William Faulkner and Flannery O'Connor, who publishing today is notably influenced by McCarthy?",
        "created_utc": 1417122134,
        "upvote_ratio": ""
    },
    {
        "title": "Need help finding a text to lit crit",
        "author": "cookie4059",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nkya6/need_help_finding_a_text_to_lit_crit/",
        "text": "Hi, I am looking for a short text to lit crit for school. We are only using: marxism, feminist theory, new historicism, reader response criticism and psychoanalytic criticism. ",
        "created_utc": 1417100414,
        "upvote_ratio": ""
    },
    {
        "title": "The theme of memory in Song of Solomon",
        "author": "sneezingdog",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nihgn/the_theme_of_memory_in_song_of_solomon/",
        "text": "There are a lot of references to memory/the past in this novel and I am trying to understand it better. What do you guys think the importance of memory is in Song of Solomon? I really think that there's some sort of statement about American culture in here, specifically African American culture, and I'm trying to tie it all together.",
        "created_utc": 1417035477,
        "upvote_ratio": ""
    },
    {
        "title": "Is Woolf's To The Lighthouse written in a stream-of-consciousness style?",
        "author": "LannaBan",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ni1eo/is_woolfs_to_the_lighthouse_written_in_a/",
        "text": "Hi,\n\nI'm reading To The Lighthouse for a class. My tutor has asked us to think about why Woolf's aesthetic might NOT be considered an ideal example of the stream-of-consciousness technique. I initially thought that... though the character's thoughts are presented directly, they are somewhat filtered - i.e. it's a restricted, organised, rational presentation of thoughts, which uses normal grammar and punctuation as opposed to for example, the stream-of-consciousness technique in *Ulysses.* \n\nIs this a decent answer for his question? I am finding so many conflicting answers online about what EXACTLY stream-of-consciousness is. Also - what exactly is the difference between stream-of-consciousness and interior monologue? I would have thought *To The Lighthouse* was mainly interior monologue, perhaps with some pure, unadulterated examples of hardcore stream-of-consciousness.",
        "created_utc": 1417027228,
        "upvote_ratio": ""
    },
    {
        "title": "Relationship between tenses and plot construction in a novel?",
        "author": "nananadiaaaa",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nhg48/relationship_between_tenses_and_plot_construction/",
        "text": "It suddenly strikes me today... would there be any correlation between the use of tenses and the plot development? Like if you use much future tense in the story, does it help in developing the plot, like especially in the rising actions? Thank you so much.",
        "created_utc": 1417015780,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Postmodernism, postmodernity, and the difference between the two",
        "author": "mytwocentsshowmanyss",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nfzw8/eli5_postmodernism_postmodernity_and_the/",
        "text": "Pleeease. I generally have a good grasp of postmodernism but only tonight realized that in a lot of cases there is a difference between the two. It would seem that postmodernity is the condition of living in a postmodern world, i.e. postmodernity is the product of or state of being caused by postmodernism.\n\nLooking forward to the discussion!",
        "created_utc": 1416973491,
        "upvote_ratio": ""
    },
    {
        "title": "Metaphor or comparison?",
        "author": "Lexyeb",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ne26n/metaphor_or_comparison/",
        "text": "While writing a paper on Wuthering Heights, I ran into a powerful quotation that I would like to discuss in my paper but I am unable to identify if it is a metaphor, and what type, or if it is simply a comparison.\nWhen Mr. Lockwood is speaking about Catherine's isolation and growing madness, he says, \"He might as well plant an oak in a flower-pot, and expect it to thrive, as imagine he can restore her to vigour in the soil of his shallow cares.\"\nI think it might be an extended metaphor, can anyone offer some insight?",
        "created_utc": 1416937332,
        "upvote_ratio": ""
    },
    {
        "title": "Strict and fastidious stage directions",
        "author": "jamesxm",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nb7pu/strict_and_fastidious_stage_directions/",
        "text": "I'm doing some work on Samuel Beckett's famous strict and fastiduous stage directions, and I'm wondering if anyone has any resources for this line of inquiry. I'm particularly interested in other authors with even more fastidious directions - I'm imagining some postmodernist whose novel-length script runs only five minutes; and resources about staging that have histories of the changing styles of stage direction; or books (or articles or chapters of books) that focus on strict stage direction or theorize stage direction as such. I would also be interested in works that utilize visual or non-verbal stage directions.  \nTrivially, I am also looking for synonyms or even slang about a \"tough script\" that requires rigid adherence to its stage directions.  \n\nthanks!",
        "created_utc": 1416869771,
        "upvote_ratio": ""
    },
    {
        "title": "What literary movement are we in now?",
        "author": "TheChumOfChance",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2nb19m/what_literary_movement_are_we_in_now/",
        "text": "I'm sure there are several answers to this, so I'd be interested in knowing what's considered new in literature in terms of form, style, etc.  \n\nI'm no expert, but it seems that post modernism has been around since the 40s and it dominated the 60s and 70s but what about since then?   Are we still there?  Who are some forward thinkers of our generation, authors and theorists both?",
        "created_utc": 1416866645,
        "upvote_ratio": ""
    },
    {
        "title": "How do personification and allegory develop theme?",
        "author": "xshadow101",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n882n/how_do_personification_and_allegory_develop_theme/",
        "text": "I tried asking on 4chan. A pedo asked me how old i am...",
        "created_utc": 1416799427,
        "upvote_ratio": ""
    },
    {
        "title": "T.S. Eliot criticized Wordsworth directly in \"Tradition and the Individual Talent\" but a critic I found claimed he eventually changed his mind about his relationship to Romanticism and Wordsworth. Does anyone know where?",
        "author": "Geecy",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n83cr/ts_eliot_criticized_wordsworth_directly_in/",
        "text": "The critic/article I'm referring to is Marion Montgomery, and his article \"Eliot, Wordsworth, and the Problem of Personal Emotion in the Poet.\" \n\nMontgomery says that \"What is overlooked by countercriticisms of Eliot in general is that Eliot has affinities with Wordsworth, affinities which he himself came to recognize as he moved on from that early attack upon Wordsworth . . .\" The attack he's referring to is in [\"Tradition and the Individual Talent\"](http://www.bartleby.com/200/sw4.html) where Eliot explicitly quotes Wordsworth's \"emotions recollected in tranquility\" as being a less-effective way of writing poetry. \n\nMontgomery doesn't cite any text where I can find T.S. Eliot's position changing on Wordsworth and by extension the Romantics, and I'm having difficulty finding anything specific. Does anybody here know of any source where Eliot expresses something like this? It'd be really great; I'm in the process of writing my undergrad thesis on comparing T.S. Eliot and Wordsworth and showing this change will help my argument a lot. ",
        "created_utc": 1416796628,
        "upvote_ratio": ""
    },
    {
        "title": "Is it a bad idea to assume Toni Morrison was aware of Audrey Lord's essay \"The Master's Tools Will Never Dismantle the Master's House\" when she wrote Beloved?",
        "author": "Vajennie",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n7t8a/is_it_a_bad_idea_to_assume_toni_morrison_was/",
        "text": "Lorde wrote the speech in 1979 and it appeared in a collection of essays in 1984. I am a youngin, so I used [google ngrams](https://books.google.com/ngrams/graph?content=Master%27s+tools&amp;year_start=1800&amp;year_end=2000&amp;corpus=15&amp;smoothing=3&amp;share=&amp;direct_url=t1%3B%2CMaster%20%27s%20tools%3B%2Cc0) to get an idea of when the essay started becoming popular. Morrison started *Beloved*, or at least got the idea, in 1983, and it was published in 1987.\n\nIs it too much of a stretch to say Morrison may have alluded to Lorde's essay in *Beloved*? I'm thinking of the literal house, rented from white people, and the setting of the \"toolroom,\" and of the narrative structure of appropriating the gothic, particularly with regard to Morrison's *Playing in the Dark*. \n\nWas Lorde's essay that well-known in the 80's, or at least well-known enough that Morrison could have read it? Is the argument too speculative? \n\nEdit: Good lord, I just realized how many posts on this sub are questions about Toni Morrison books. I will never ask another TM related question again, I promise!",
        "created_utc": 1416790666,
        "upvote_ratio": ""
    },
    {
        "title": "In your opinion, how has Grendel provided a better story, using elements of Beowulf?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n51cx/in_your_opinion_how_has_grendel_provided_a_better/",
        "text": "Thinking about the phrase, 'dwarves standing on the shoulders of the giants of classical antiquity', I think Grendel stands atop Beowulf because it provides a better perspective of one of the main characters as well as providing more insight to the overall story that connects the two texts. What do you guys think?",
        "created_utc": 1416715670,
        "upvote_ratio": ""
    },
    {
        "title": "How to be like Aristotle so that \" We are what we repeatedly do, excellence is not an act, but a habit\"",
        "author": "calipeaches",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n2dwd/how_to_be_like_aristotle_so_that_we_are_what_we/",
        "text": "I've been torturing my brain to understand philosophical works but every time I stumble upon a passage, whether it be Aristotle or Confucius, I just can't grasp it or my brain decides it wants to quit on me.\n\nHow do some of ya'll go about understanding difficult literature?  ",
        "created_utc": 1416643397,
        "upvote_ratio": ""
    },
    {
        "title": "Texts to help understand Hobbes?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n210j/texts_to_help_understand_hobbes/",
        "text": "I am following along on this section of /lit/'s guide to philosophy (http://i.imgur.com/BEGvQkP.jpg), and the supplemental texts for Hobbes are too expensive for me. Does anyone know some good, inexpensive supplemental texts, in print or online, that can help me to read and understand him?",
        "created_utc": 1416631900,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a movement or critical school dedicated to urban literature?",
        "author": "detroitdickdawes",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2n0j8n/is_there_a_movement_or_critical_school_dedicated/",
        "text": "I'm looking for more texts that deal with the politics, culture, lifestyle of an urban environment, whether it be institutional (a look at the inner-workings of a police department, a la *the Wire*, or quotidian life, (Dybek's *Coast of Chicago*) or life as a part of subculture in an urban area (Selby's *Last Exit to Brooklyn*). Critical essays on urban literature, collections, anthologies, authors, specific works etc. I'm looking more specifically for works that take place in post-industrial American cities, I.E. the Rust Belt (so think Detroit, Cleveland, Baltimore, Buffalo, etc.) but am open to other locales and time periods.\n\nHas anyone attempted to write a unifying discourse on the study of urban literature, whether it be under a larger unifying theory (feminism, African American, postmodernism)? What works of literature treat a city as a character or motif beyond its setting? \n\nA few more examples of what I am looking for:\n\n*Invisible Man* - Ralph Ellison\n\n*Abandon Automobile: Detroit City Poetry 2001* - Ed M.J. Boyd and M.L. Liebler\n\n*Paterson Falls* - William Carlos Williams\n\nThe Poetry of Don L. Lee\n\n*What Work Is* - Philip Levine",
        "created_utc": 1416599783,
        "upvote_ratio": ""
    },
    {
        "title": "Must-read books on Hamlet?",
        "author": "EarlGreyLove",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mzvqx/mustread_books_on_hamlet/",
        "text": "Hi guys, as the title says I'm looking for must-reads on Hamlet, the play and the character.\n\nI'm completely in love with Shakespeare, having recently read Othello, Lear, Macbeth, the Henriad, and now Hamlet.\n\nI love all of them totally, and I'm excited that Shakespeare has actually turned out to be easy to understand, but of course difficult to really comprehend.\n\nI figured I'd start with really digging into Hamlet, and what I'm looking for is *essential works of scholarship*, so to say. It does not have to be fancy contemporary deconstructionist analyses, I'm just looking for solid readings, contemporary or not.\n\nKind of like Empson's work on Paradise Lost is now essential, though not necessarily in keeping with current intellectual trends (I don't study literature in the uni, so sorry if this is untrue).\n\nAlso, if anyone wants to recommend a good general work on these plays, I'd appreciate that too!\n\n**Edit:** Some wording.",
        "created_utc": 1416587878,
        "upvote_ratio": ""
    },
    {
        "title": "Was Flaubert the first author (at least in France) to accurately portray a female experience and to humanize women?",
        "author": "PMmeyourhappiness",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mz907/was_flaubert_the_first_author_at_least_in_france/",
        "text": "I ask because I am reading through Baudelaire's analysis of Madame Bovary. In it, Baudelaire says that Madame Bovary is a masculine character and lists several reasons why he thinks so. Here is a quick exerpt: \n&gt;“And yet Madame Bovary gives herself; carried away by the sophistries of her imagination, she gives herself magnificently, generously, in a completely masculine way, to wretches who are not her equals as poets give themselves to despicable women.”\n\nThis quote makes me think that Madame Bovary isn't masculine, but *human*. Baudelaire seems to think that only men can have such experiences and perhaps he thinks this because women were not well understood or accurately portrayed in literature before.\n\nI was hoping to get some thoughts from someone who is more knowledgable about the subject than me. \n[Here is a link to the essay.](http://books.google.com/books?hl=en&amp;lr=&amp;id=MFG6gc9ZcW4C&amp;oi=fnd&amp;pg=PA87&amp;dq=Gustave+Flaubert&amp;ots=cilAUX0Yk0&amp;sig=Tl8f5xsXYGzCEtOODZ8PMTtmHNo#v=onepage&amp;q=Gustave%20Flaubert&amp;f=false)",
        "created_utc": 1416572205,
        "upvote_ratio": ""
    },
    {
        "title": "How you do you feel about Harold Bloom and his critical view of \"The School of Resentment\"?",
        "author": "fourcrew",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mtg9r/how_you_do_you_feel_about_harold_bloom_and_his/",
        "text": "Do you agree that there is too much of a political focus in literary analysis? Do you think postmodernism will ever fall out of intellectual fashion in literary circles, and if so, what do you think may come to replace it?\n\nI hope you don't think of my question as too stupid or silly. I'm not a literature major or anything.",
        "created_utc": 1416437494,
        "upvote_ratio": ""
    },
    {
        "title": "Blending ethics and literary studies in a thesis?",
        "author": "AlexanderKyd",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mr9zd/blending_ethics_and_literary_studies_in_a_thesis/",
        "text": "I am writing an essay on Aldous Huxley. \nIn particular, I am interested in the way he handles pacifist themes in his fiction (Point Counter Point, Eyeless in Gaza, Island). Pacifism is above all an ethical position, a personal belief, a principle that one holds, an idea that one endorses. But in the novels it's presented through the use of literary techniques, the instruments that are at the disposal of the novelist, e.g. plot, characters, dialogue, metaphors, allusions, etc. I think what makes Huxley a very important writer is the way he fictionalizes IDEAS. But how do I go about this topic in a 50-page academic essay? Any ideas and suggestions would be appreciated. Thanks.",
        "created_utc": 1416389070,
        "upvote_ratio": ""
    },
    {
        "title": "Help formulating my first Writing 102 class?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mpa1f/help_formulating_my_first_writing_102_class/",
        "text": "Hello, /r/AskLiteraryStudies! I apologize if this is the wrong subreddit, but I was hoping for some advice on my first class as an adjunct faculty member.\n\nI was asked to teached WRI 102, Academic Writing. So we're all on the same page, part of the description is as follows: \"Academic Writing is a four-credit course that offers students the opportunity to develop, advance, and practice skills in the production of academic prose. Within a framework of sophisticated readings, highly coordinated writing workshops, and instructor feedback, students practice the modes of writing necessary to succeed in college. Students read critically, cultivate habits of effective and ethical research, practice conventions of documentation, and use information technologies. Topical readings may vary among sections.\"\n\nTopics examples include The Argument of Sport, The Meaning of Work, Exploring Fairy Tales, Diving into Disney, An Examination of the Wizard of Oz, etc. As you see, it's not really about the topic itself, rather, the arguments that derive from discussions. \n\nI was thinking about the topic of The Culture of Crime. Examining books like Game of Thrones, shows like Breaking Bad and Sons of Anarchy, etc. Arguments would examine how we identify with the \"villain,\" what makes up a villain, and conversations on morals and ethics. \n\nI'm hoping for some insight from those of you with more experience. Syllabus suggestions? Class suggestions? Reading suggestions for the students? Any advice would be most welcome.",
        "created_utc": 1416344616,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give me an example of a Formal Analytical Report?",
        "author": "jonab12",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mmf0p/can_someone_give_me_an_example_of_a_formal/",
        "text": "I cannot find a physical example online, just vague tutorials. Can someone link me to a example?",
        "created_utc": 1416276223,
        "upvote_ratio": ""
    },
    {
        "title": "Diary Entry Sula",
        "author": "NeedKarmaToFeedKids",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mlmpa/diary_entry_sula/",
        "text": "Hello r/askliterarystudies,    \n    \n    I am writing a diary for the book 'Sula' by Toni Morrison for a school assignment. Basically in the assignment I have to write a diary entry before she leaves the bottom (in 1927) and when she comes back (in 1937).\n\n    I'm having great difficulty on getting started, do you guys have any tips I could use? \n",
        "created_utc": 1416261120,
        "upvote_ratio": ""
    },
    {
        "title": "Does the outright refusal by writers and critics to tolerate adverbs in most cases they are used have a long history?",
        "author": "EvannaLynchsButtHair",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mkk0d/does_the_outright_refusal_by_writers_and_critics/",
        "text": "To be clear, I’m not necessarily talking about cases in which adverbs can be altogether left out due to redundancy (*He cried sadly*) or when an intensifier is used to enhance an adjective that can just be replaced (*He thought really hard about X* versus *He contemplated X*), though even these cases can often be debatable.\n\nWhat I’m asking is if the routine and contemporary dismissal of adverbs in literary uses is something that has been in play throughout history (i.e., in classic works), of it this just a fashion of sorts. I ask because it reminds me of (and tends to come in the same breath as) the notion that sentences should never be long. This I know is fashion because works of old had tremendous sentences, and people were expected to sort it out themselves. So I’m not sure if it’s the same phenomenon of taking an idea’s contemporaneousness as a justification of its objective truth, or if this has always been a “rule.”\n\nJust to add my personal viewpoint, I think adverbs are fine in plenty of cases. I had a hard time thinking of an example where the adverb is redundant in every instance of that sentence. In [this awful article](http://www.quickanddirtytips.com/education/grammar/how-to-eliminate-adverbs), the article author offers “She smiles happily.” Yes, many times this is redundant. But imagine a book about a young man struggling with social anxiety, questioning the motive of every glance made in his direction, reaches out to a stranger and says, in a fumbling show of desperate solidarity, “You’re looking really healthy today.” “Thanks,” she said, smiling. What the hell is that? To be honest, it actually sounds good with the ambiguity. But what if the author doesn’t want ambiguity? What if he or she feels the poor guy needs a break and deserves a reciprocal gesture for his daring? “She said, smiling happily,” would be called for. I admit “she said, beaming,” “she said with a glow,” or “she said with a kind bemusement,” would all be better than “she said, smiling happily,” but some people (the author of that awful article included) would have you use *no* descriptors in dialogue. I agree there’s a point where you’re overdoing it, but telling writers to leave it to the dialogue itself as a rule? That’s just bad advice, to me.\n\nTo sum, my gut feeling is that the charges against adverbs come from a place of dogma, and as such, misapply legitimate observations about language as gratuitous and often arbitrary rule-enforcement — a behavior endemic to would-be critics in art and fashion. Unfortunately, I feel it taking me over; already I have been hyper-conscious of my adverb use, and will likely carry this into my judgments about what I read. It’s too late for me. Tell my family I love them.\n\nAnyway, is this a current fashion, or has this long been the case?",
        "created_utc": 1416241992,
        "upvote_ratio": ""
    },
    {
        "title": "Are you an expert or flared user at /r/AskLiteraryStudies? Do you use and understand history in a literary studies context? Then /r/AskHistorians wants YOU!",
        "author": "vertexoflife",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mk5fj/are_you_an_expert_or_flared_user_at/",
        "text": "Over at /r/AskHistorians we are beginning a drive for new flairs! We welcome experts in any history-related field or expertise from Deaf History to the History of Pornography. To get an idea of how wide our topics are,[ take a look through our flair list!](https://www.reddit.com/r/AskHistorians/wiki/flairedusers)\n\nYou can also feel free to [ask a question](https://www.reddit.com/r/AskHistorians/submit?selftext=true) of our panelists about something you've always wondered. Maybe it's the first recorded recipe, or how exactly samurai would plan for battle? But also  take a look through [our FAQ](https://www.reddit.com/r/AskHistorians/wiki/faq) and [rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before posting!\n\nIf you're an expert, come by and make some posts to apply!\n\n**Requirements for a flair**\n\nA flair in /r/AskHistorians indicates extensive, in-depth knowledge about an area of history *and* a proven track record of providing great answers in the subreddit. In applying for a flair, you are claiming to have:\n\n* Expertise in an area of history, typically from either degree-level academic experience or an equivalent amount of self-study\n\n* The ability to cite sources from specialist literature for any claims you make within your area\n\n* The ability to provide high quality answers in the subreddit in accordance with [our rules](http://www.reddit.com/r/AskHistorians/wiki/rules).\n\n**How to apply**\n\nTo apply for a flair, simply post in this thread. Your post needs to include:\n\n* Links to **3-5 comments** in /r/AskHistorians that show you meet the above requirements\n\n* The text of your flair and which category it belongs in (see the sidebar). Be as specific as possible but be aware there is a limit of 64 characters.\n",
        "created_utc": 1416233379,
        "upvote_ratio": ""
    },
    {
        "title": "Beloved by Toni Morrison",
        "author": "CassieDeFrank",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mj3jy/beloved_by_toni_morrison/",
        "text": "I am writing a 5-10 page paper on this book. I am unsure of what to pick for my thesis.\n\nSymbolism of the tree and her scars? Or is this too specific?\nHow the narrator changes and gives us insight?\nHow Sethe murdering Beloved was, or was not justified?\n\nOr something totally different? \nI am suffering from some writers block here. Any help would be much appreciated.",
        "created_utc": 1416198221,
        "upvote_ratio": ""
    },
    {
        "title": "Contemporary deconstruction theorists",
        "author": "hecky914",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2miib9/contemporary_deconstruction_theorists/",
        "text": "I'm working on a paper concerning one of Margaret Atwood's poems as framed within deconstruction -- I'm very new to this particular literary theory, and wonder if there are any suggestions as to contemporary theorists dealing with deconstruction concepts that might be helpful. Derrida only gets me so far. ",
        "created_utc": 1416185377,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Karamazovism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2megwr/eli5_karamazovism/",
        "text": "Currently reading The Brothers K and I can't wrap my head around the idea of Karamazovism, especially as it relates to family structures. Can someone ELI5 and help me with passages related to it?",
        "created_utc": 1416079595,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Bakhtin's chronotope and the ideas behind space-time in literature.",
        "author": "AHowlingFantod",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mdefj/eli5_bakhtins_chronotope_and_the_ideas_behind/",
        "text": "Hello everyone, \n\nCan someone please explain the theory behind Bakhtin's chronotope?  I am having a really difficult time defining what \"space\" is and what \"time\" is in these theories, and how these things are defined in the context of literature.  Also, can someone explain how this theory is applied to literary criticism?  \n\nThank you for reading, and I invite any and all insight!",
        "created_utc": 1416049752,
        "upvote_ratio": ""
    },
    {
        "title": "Desdemona by Toni Morrison",
        "author": "bataillescream",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2mczkd/desdemona_by_toni_morrison/",
        "text": "Hey all, I figured this would be the best place to ask, since /r/postcolonialism is dead. If anyone is familiar with this work, do you know of any place where I can watch it online? Or buy it? There's only been a handful of performances, but I feel like at least one of those had to be recorded and it has to be SOMEWHERE. ",
        "created_utc": 1416033089,
        "upvote_ratio": ""
    },
    {
        "title": "Comments on the structure of Wilfred Owen's 'Last Laugh'",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m7z2n/comments_on_the_structure_of_wilfred_owens_last/",
        "text": "Sorry to bother you guys again, my Literature test is today....\nI'm planning to use this poem for one of my essays, but i can't find any thing to comment on about the structure/syntax of the poem.\n\nHeres a link to the poem: http://www.poetryfoundation.org/poem/182371\n\nthanks in advance guys!",
        "created_utc": 1415915653,
        "upvote_ratio": ""
    },
    {
        "title": "The Song Of Roland is killing me! what are some of the religious portrayals within the poem?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m794u/the_song_of_roland_is_killing_me_what_are_some_of/",
        "text": "* How are Muslims and Islam as well Christians and Christianity portrayed in the Song of Roland? \n* What might these portrayals tell us about the work’s author and his motivations?  \n \n I need to answer these questions for a history assignment and im really lost right now. It doesnt seem to me like there is much, if anything to learn about the muslims. Are the Saracens muslim?",
        "created_utc": 1415902515,
        "upvote_ratio": ""
    },
    {
        "title": "Best/-written secondary lit? (or, Secondary lit that makes itself primary?)",
        "author": "Akhel",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m5x3o/bestwritten_secondary_lit_or_secondary_lit_that/",
        "text": "I know this is modest, but I recently read a little essay by Hugh Kenner on McLuhan and was surprised at how engaging it was. Well-written, lively, insightful for its length; something one would enjoy reading even if not on research mode, perhaps even if not acquainted with the essay's subject. I'm sure there is more secondary literature of this quality (DFW comes to mind), but I'm a newbie. Would anybody care to recommend me some? especially beyond what might be obvious -- by which I mean, Pound or Gass not so much as some shady professor or two who, like Kenner it seems, may not have earned much recognition outside their field. (Writing of this sort on philosophy would also be welcome.) Thankyee!",
        "created_utc": 1415865871,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a good poem or short story",
        "author": "narcotiq",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m57ox/looking_for_a_good_poem_or_short_story/",
        "text": "Hi I'm looking for a short story or poem about stepping outside the world that you knew and are used to and discovering new things as you experience new things? Any pieces about challenging previous attitudes or previously held beliefs? PLEASE HELP \n\nthank you so much :)",
        "created_utc": 1415848006,
        "upvote_ratio": ""
    },
    {
        "title": "Early and Late Editions of Auden's Poetry",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m3yxe/early_and_late_editions_of_audens_poetry/",
        "text": "The Edward Mendelson edited version of Auden's [*Collected Poems*](http://www.amazon.com/Collected-Poems-W-H-Auden/dp/0679643508/ref=pd_sim_sbs_b_1?ie=UTF8&amp;refRID=00Y74MWCHVNDCXGJSRSW) \"includes all the poems that Auden wished to preserve, in a text that includes his final revisions, with corrections based on the latest research.\" Yet, IIRC, the revisions that Auden made to his pre-WWII poems during this phase of his career radically alter the politics of these poems, dampening the young Auden's revolutionary spirit in favour of a more conservative slant. Though these late revisions mark an important aspect of Auden's career, and are an important historical document of the postwar look-back at the 1930s, frankly, I'm more interested in the earlier, more politically radical Auden.\n\nIs there a standard scholarly (or high quality mass-market) edition of Auden's early poetry, as it appeared prior to Auden's retrospective revisions? (Of course, eventually, I'd like to have both an early and late *Collected* Auden on my shelves, but for the time being, early is enough.)",
        "created_utc": 1415826058,
        "upvote_ratio": ""
    },
    {
        "title": "Kafka and The Bug",
        "author": "bonersforbukowski",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m3ifs/kafka_and_the_bug/",
        "text": "Hi scholars, \n\nI'm in the process of writing a paper on why Kafka fought with his publisher against having a literal representation of \"the insect\" drawn on the cover of Metamorphosis upon its initial publication.\n\nI need to come up with a refined argument that reaches outside of the simple fact that Kafka didn't want there to be a literal representation of the insect in an effort to leave the insect as an ambiguous entity. \nI'm having a hard time finding resources though, especially in the way of peer-reviewed articles on the topic. \nAny help or insight you could offer would be greatly appreciated!\n\nThank you\n\n",
        "created_utc": 1415818248,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between second/third editions of The Norton Anthology of World Literature?",
        "author": "taxi7",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m2tt1/what_is_the_difference_between_secondthird/",
        "text": "I don't need this for a class. Simply wanting to read.",
        "created_utc": 1415805666,
        "upvote_ratio": ""
    },
    {
        "title": "Is Stephen King meritorious?",
        "author": "TimeLordLaxx",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m1yhl/is_stephen_king_meritorious/",
        "text": "I hope this is the best place to ask about this.\n\nI'm currently taking AP Literature and Composition and something that arises a lot is what books are deemed meritorious enough to be considered for the free response questions that we must answer during the test. \n\nAn example of this style of question: \" It has often been said that what we value can be determined only by what we sacrifice. Consider how this statement applies to a character from a novel or play of literary merit. Select a character that has deliberately sacrificed, surrendered, or forfeited something in a way that highlights that character's values. Then write a well-organized essay in which you analyze how the particular sacrifice illuminates the character's values and provides a deeper understanding of the meaning of the work as a whole\" \n\nNow while I understand what it takes to be considered 'meritorious'. A weird divide comes down on the works of Stephen King. I don't mean to write about *Carrie* or *It*. His large series *The Dark Tower* is what actually comes to mind as his most meritorious works of literature. They can answer every question that the AP board has released in the last forty years as an FRQ question, but I'm not actually sure if it is 'meritorious enough' ,if there is ever such a thing, and I can't find anything on it online. \n\nA counter argument would be to just write about something I know to fit the grading boards standards, but the test is in May, my class, however, ends in December. I am more likely to remember Roland Deschain and his band of misfits over *Jane Eyre* or *Pride and Prejudice*",
        "created_utc": 1415777509,
        "upvote_ratio": ""
    },
    {
        "title": "Literature test in 2 days... Quick Question",
        "author": "s2olen",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m0pn8/literature_test_in_2_days_quick_question/",
        "text": "When i get a question like ''How does [Author] make this scene so dramatic?''\nWhat are some of the key points in the passage that i should mention?\n\nEDIT: The book i'm studying right now is ''Richard III'' by Shakespeare\nI'm not much of a bookworm myself, and i find it quite hard to read into the deeper meaning of some of the texts. I've had the question a few times in a test, but i've never written enough to receive decent marks. And i often start paraphrasing once i run out of things to write...\n\n",
        "created_utc": 1415750331,
        "upvote_ratio": ""
    },
    {
        "title": "Shakespeare's Villains and Philosophy?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2m0e28/shakespeares_villains_and_philosophy/",
        "text": "Hi,\n\nThe psyche of Shakespeare's villains has always intrigued me, and it is probably this why I chose three Shakespearian plays (Othello, Titus Andronicus and The Merchant of Venice) for my english coursework. I have thoroughly analysed the three texts, and have delved deeply into the minds of every villain (Othello being my main text, and thus Iago the main character for study.) \n\nHowever, I lack a perspective through which to compare the three villains. I have context, themes and language style that links every villain to each other, but I want to have an underlying line of argument beyond simple comparison. I think this is where philosophy could come into play, without gaining much protagonism of course, as I need to fulfil objective criteria.\n\nThe concept could maybe be, \"What makes a successful villain?\", or the philosophy behind human evil, and thus the exploration of these ideas within the plays.\n\nAny other ideas deviating from Philosophy are also well received. \nThank you.\n\n",
        "created_utc": 1415744408,
        "upvote_ratio": ""
    },
    {
        "title": "The Uncommon Reader and Comic Potentioal - Research Question",
        "author": "uchicha15",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2lweoz/the_uncommon_reader_and_comic_potentioal_research/",
        "text": "Hey guys!\n\nI have to write a paper about either \"The Uncommon Reader\" or \"Comic Potential\".\n I have been thinking about a research question/thesis for quite a long time, but I can't seem to think of something productive.\nDo you have any suggestions?",
        "created_utc": 1415655964,
        "upvote_ratio": ""
    }
]