[
    {
        "title": "x-post from r/AskHistorians: Why are ancient seers and oracles portrayed as being deformed in historical fiction?",
        "author": "Kenny_Login",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wm95y/xpost_from_raskhistorians_why_are_ancient_seers/",
        "text": "I've noticed in that seers and oracles are often portrayed having some kind of deformity, like in Vikings, The 300, even Greek mythology with the Stygian witches. Is there any historical evidence to back this up or reason why they are portrayed this way?  \n-/u/softunderbellyofevil",
        "created_utc": 1424486451,
        "upvote_ratio": ""
    },
    {
        "title": "Would anyone be willing to read/edit my paper about The Great Gatsby?",
        "author": "rasscasse",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wivd8/would_anyone_be_willing_to_readedit_my_paper/",
        "text": "The paper is about Daisy's reluctance to leave Tom once she understands that Gatsby is trying to control her in the passage where  she is forced to decide between Gatsby and Tom. PM me.",
        "created_utc": 1424414297,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help find the link to the 2002 Q&amp;A with Murakami on his books?",
        "author": "Ibniad",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wgxuf/can_anyone_help_find_the_link_to_the_2002_qa_with/",
        "text": "I am desperately trying to find the answers Murakami gave his fans on roughly ~1200 questions in a Q&amp;A he held online after the publication of his book \"Kafka on the Shore\". Does anyone have a link to the file (if such a thing exists)?",
        "created_utc": 1424378826,
        "upvote_ratio": ""
    },
    {
        "title": "What are the features of a typical Enlightenment comedy? // Was sind die typische Elemente einer Komödie der Aufklärung?",
        "author": "marcusthecrab",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wgqlj/what_are_the_features_of_a_typical_enlightenment/",
        "text": "I'm writing an essay on Minna von Barnhelm by Lessing, and I can't find anywhere a list of typical elements of an Enlightenment period comedy. \n\nMost of my sources are in German, and while I do have a good command of the language, it takes me about twice/three times the time to read. I'd really appreciate any answers.\n\nI know already that characters were portrayed with certain traits that Enlightenment writers saw as negative, and ridiculed for them so that they might overcome them and improve.",
        "created_utc": 1424375784,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a literary equivalent of \"outsider\" art?",
        "author": "trashed_culture",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2we2vm/is_there_a_literary_equivalent_of_outsider_art/",
        "text": "In visual art there is an idea that some people can make art outside of an academic, scholarly, formal system of schooling and production.  Is there anything similar in the literary world?  If not, is it because all literature is outside, none is, or it is somehow irrelevant?  If it's an irrelevant question, why?  Oh and what are some good examples?",
        "created_utc": 1424316064,
        "upvote_ratio": ""
    },
    {
        "title": "Why didn't Frankenstein's Creature create his own bride?",
        "author": "Xraygoggles",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wdtmx/why_didnt_frankensteins_creature_create_his_own/",
        "text": "According to the text, the creature possesses the complete notes of Frankenstein's process. The way he describes them, they seem to be exhaustive and contain every detail. Why wouldn't he simply create his own bride? Any insight or links to information or theories would be greatly appreciated. ",
        "created_utc": 1424311407,
        "upvote_ratio": ""
    },
    {
        "title": "What are some other works like Blake's Auguries of Innocence and his Proverbs of Hell?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wdns5/what_are_some_other_works_like_blakes_auguries_of/",
        "text": "I'm looking for other aphoristic type works, and I wasn't sure how to find more. Thought it would be cool to write a character that only speaks in aphorisms, but I should do my research first.",
        "created_utc": 1424308467,
        "upvote_ratio": ""
    },
    {
        "title": "Critical Theories on Identity?",
        "author": "IIIRogueIII",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2wb5kh/critical_theories_on_identity/",
        "text": "I was wondering which critical theories discuss the formation of identity. So, things like Freud, or Feminist theory, to ideas such as Marcian identity crisis.\n\nI'm studying a work that deals primarily with identity and I was hoping to have a few critical avenues to approach it from. I would greatly appreciate any help. Thank you in advance!",
        "created_utc": 1424266546,
        "upvote_ratio": ""
    },
    {
        "title": "Compelling Reader-Response Criticism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2waiau/compelling_readerresponse_criticism/",
        "text": "Looking for an example of reader-response criticism that highlights the capabilities of the genre (not the right word but you get it). Bonus points if it's engaging, accessible, or written by a renowned author/critic. \n\nI have to do a project that involves literary criticism and my creative writing concentration, and reader-response sounds like it might be capable of bridging the gab between academic writing and the personal, perhaps autobiographical, aspect of creative writing.\n\nAny recommendations would be great!\n\n",
        "created_utc": 1424245205,
        "upvote_ratio": ""
    },
    {
        "title": "Which tense should I use when discussing the narrator of a story?",
        "author": "H_L_Mencken",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2w9bt0/which_tense_should_i_use_when_discussing_the/",
        "text": "In my literary theory and criticism class I have to write a short essay discussing the author, implied author, and narrator of Sam Lipsyte's \"The Dungeon Master\". \n\nI'm aware that I will be using the past tense when discussing the physical Sam Lipsyte who published the story and using the present tense when discussing the implied author. I'm unsure of whether I should be using the present or past tense when writing about the narrator of the story. I think it is the present tense, but I'm unsure. ",
        "created_utc": 1424221133,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any works that are rich in literary content?",
        "author": "caprinide",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2w93ro/are_there_any_works_that_are_rich_in_literary/",
        "text": "Hi reddit, I am a highschool senior currently taking the AP Lit. course. As you may know, the third FRQ of the AP exam asks the students to write an essay on any work of literary merit of their choice. I would love to read as many books as I can so I would be ready to answer any question, but I have a very busy schedule and if I were to study the books I read in depth, I likely only have time for 3-4 books. Are there any literature that are rich in literary content (i.e packed with symbols, foreshadowing and other literary devices)? I have recently read Scarlet Letter. Thank you!",
        "created_utc": 1424217323,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly was offensive to Islam in Salman Rushdie's \"The Satanic Verses\"?",
        "author": "ujorge",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2w7gs4/what_exactly_was_offensive_to_islam_in_salman/",
        "text": "",
        "created_utc": 1424191581,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find an online text of Dante's Paradiso with footnotes/endnotes/commentary?",
        "author": "oldgeeza",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2w411e/where_can_i_find_an_online_text_of_dantes/",
        "text": "I'm not sure if I'm breaking any rules by doing this, although I admit I am bending them. I've tried various other subs, but there has been no helpful response. I tried Project Gutenberg and Google in general.\n\nI've done a lot of background reading in order to understand the Paradiso (Bible, Virgil, Mythology, Italian history, development of Italian poetry and the life of Dante), so it's just a shame that I can't understand everything (or at least as much as is possible).\n\nI can't afford to buy real books, so I have to stick with online sources, please!",
        "created_utc": 1424117836,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for experimental / progressive / avant-garde literary journals?",
        "author": "Chiiharu",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2w0b8g/recommendations_for_experimental_progressive/",
        "text": "'m looking for literary journals that are experimental, progressive, original or even avant-garde, preferably free or partially free so that i can taste it before deciding whether to subscribe. :)\n\nI really like Gone Lawn, but the recent issue seem to be less experimental compared to it's predecessors (perhaps attributed to a change in editor?). \n\nAnyhow recommend away! Thanks!",
        "created_utc": 1424036048,
        "upvote_ratio": ""
    },
    {
        "title": "How to judge value and Eagleton's How To Read Literature.",
        "author": "JoyBus147",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vy4lz/how_to_judge_value_and_eagletons_how_to_read/",
        "text": "In Terry Eagleton's How To Read Literature, the final chapter concerns the judgement of a work's value.  However, I think the chapter went over my head.  He spent most of the chapter outlining the popular conception of literary value judgement and what's wrong with it, then took a couple of particularly purple pieces of writing and highlighted what was wrong with them (don't recall which works right now, my copy of the book is in another city).  Then he took a passage from *Absalom!* *Absalom!*, one of the most celebrated works from one of the 20th century's most celebrated American authors, and talked about what was wrong with it.  Finally, he took a passage from *Lolita* and sung praises it.  At no point does he actually outline any methods for analyzing artistic value.  Has anyone here read HTRL that could help me figure out what's going on and what I have wrong about it?  And how *does* one objectively analyze a work's value?  I know the New Critics used complexity and organic unity, but what other criteria are there?",
        "created_utc": 1423978264,
        "upvote_ratio": ""
    },
    {
        "title": "The Divide Between Literary and Historical Fiction? What defines it?",
        "author": "Ireallydidnotdoit",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vwzxl/the_divide_between_literary_and_historical/",
        "text": "Apologies, I dare say the title does not convey my question in the easiest manner. I'm trying (futilely) to avoid the typical questions one finds on what makes something literature or on the divide between modern literary and genre fiction. \n\nLet's say I have two books. One is the \"Song of Achilles\" by Madeline something (Miller?) and the other is \"Broody male protagonist X\" by Bernard Cornwall. What separates them? Are there are any good articles I can look at? I truly am at a loss when it comes to modern literature.",
        "created_utc": 1423953649,
        "upvote_ratio": ""
    },
    {
        "title": "The intersection between Japanese literature, anime and the Western texts and media?",
        "author": "rabbitrunning1",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vqqvu/the_intersection_between_japanese_literature/",
        "text": "I'm interested in how Japanese literature is being reviewed in America, and if there is any criticism about this? I've become fascinated by Haruki Murakami when I picked him up during my time teaching in Japan. Additionally, does anyone know if anime being treated as a serious area of study in the West? \n",
        "created_utc": 1423809355,
        "upvote_ratio": ""
    },
    {
        "title": "Could someone please help me with my presentation for next month in literature?",
        "author": "BigYochie",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vpomx/could_someone_please_help_me_with_my_presentation/",
        "text": "It s about how literature has been affected by its surrounding culture and myths in the different parts of western and eastern regions. I have to read some books that I can tie together with the presentation too, and I m gonna read different literature about King Arthur (The most western literature), Dracula (although Irish of orgin it is based on the myths from eastern european countries), the scandinavian myths described in \"Heimskringla\", and was thinking of bringing in \"The kojiki\" from japan too. Do you guys know any other literature I can use, especially from the middle-east/China maybe?",
        "created_utc": 1423788149,
        "upvote_ratio": ""
    },
    {
        "title": "Silent Protagonists in literature?",
        "author": "AcidMage",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vpgph/silent_protagonists_in_literature/",
        "text": "Was just wondering if there are any examples of silent protagonists (protagonists who don't speak, not even as narrators) in literature? I've dug around a fair bit at my library for anything relating to a study of this and turned up pretty much empty-handed. Is it not really an archetype found it literature, or am I just looking in the wrong places? My studies are mainly in quest-based narratives at the moment, but I think any examples would be interesting.",
        "created_utc": 1423784251,
        "upvote_ratio": ""
    },
    {
        "title": "Deja Vu",
        "author": "conjod",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vn7o8/deja_vu/",
        "text": "Hi!\n    So, I wrote a post about 2 weeks ago concerning The Uncanny and you guys were really helpful in directing me to great theoretical texts. I read Royle's the Uncanny, sunk my teeth into Todorov, Kristeva and I'm partially through some Derrida and Carl Yung. You've given me a great overview of key aspects of psychoanalytical literature and The Uncanny.\n\nAfter two meetings with my tutor he has allowed me to explore the one area of The Uncanny that intrigues me the most - deja vu. But, the bump in the road is discovering actual texts concerning deja vu. I've only read DeLillo's White Noise (which is really applicable to my topic). So, I come to you again, in my hour of need, to ask if anyone has come across any deja vu in literary works?\n\nThank you!",
        "created_utc": 1423742622,
        "upvote_ratio": ""
    },
    {
        "title": "What 21st century literature do you think is the most significant so far?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vm8ma/what_21st_century_literature_do_you_think_is_the/",
        "text": "",
        "created_utc": 1423714093,
        "upvote_ratio": ""
    },
    {
        "title": "Sir Gawain &amp; The Green Knight-- why hide the story of the kiss from Bertilak?",
        "author": "_TammySwanson",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vlv9g/sir_gawain_the_green_knight_why_hide_the_story_of/",
        "text": "Gawain kisses Bertilak's wife (or is kissed *by* her, I guess) and passes the kiss onto Bertilak without disclosing the origins of the kiss. Why does he do this? Is it to preserve the tenants of courtly love, one being \"When made public, love rarely endures\"? If he is supposed to show chivalry by kissing her, why would he hide this from Bertilak? Doesn't his avoidance make his intentions seem beyond chivalry and purely sexual? And, if he was unhappy with lying to Bertilak, why would he agree to play the game of exchanging winnings again if he knew there was a chance he'd end up in this predicament again? ",
        "created_utc": 1423707109,
        "upvote_ratio": ""
    },
    {
        "title": "What literature is presented in other countries school curriculum?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vlimc/what_literature_is_presented_in_other_countries/",
        "text": "View point from someone in the U.S.",
        "created_utc": 1423700484,
        "upvote_ratio": ""
    },
    {
        "title": "Amy Hempel's \"Celia is Back.\"",
        "author": "_MissingNo_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vlee8/amy_hempels_celia_is_back/",
        "text": "I need help deciphering some of Hempel's sparse language so that I can figure out what the story is about. \n\nI have a few ideas. The father is either mentally ill and going to see a psychiatrist, he sees a whorehouse at the end or he is an alcoholic headed to AA. Do any of these sound right? ",
        "created_utc": 1423698458,
        "upvote_ratio": ""
    },
    {
        "title": "[Mythology/Roman/Greek Related] Are their any stories where the fate of a character was changed?",
        "author": "Dan_The_ManChild",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vksvo/mythologyromangreek_related_are_their_any_stories/",
        "text": "Are their any stories where the fate of a character was changed? And was it changed to differ from some prophecy-like statement or into like said prophecy? (E.g. I am foretold that I will eat something from a cow; instead of eating it's meat I end up eating something with cheese in it which comes from cows.) \n\nI'm writing a 5 page paper about the Aeneid and the topic I've chosen has to do with the themes of fate and free will. If their are any stories where the destiny of heroes was changed different to what the fates decree (or something similar), it would be a huge boon to my paper. My knowledge of literature of that sort is limited to the movie Troy, the Percy Jackson/Heroes of Olympus series, the Odyssey and the Aeneid, albeit it's been a while since I've looked into any of those, minus the last one of course.",
        "created_utc": 1423688745,
        "upvote_ratio": ""
    },
    {
        "title": "Socialization in Roald Dahl childhood literature",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vccsb/socialization_in_roald_dahl_childhood_literature/",
        "text": "Hi Reddit, I'm sorry if i've found the wrong sub-reddit- I'm looking for some help/sources for my SO university thesis. Her thesis is ~aimed at looking at socialisation in childhood in Dahl's literature. She's having trouble finding research in this subject by other scholars, so was just wondering if you great people could point us in the right direction for any research,authors etc. Many thanks. ",
        "created_utc": 1423517065,
        "upvote_ratio": ""
    },
    {
        "title": "What's the difference between fabulation and magic realism?",
        "author": "thebantz",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vbbh7/whats_the_difference_between_fabulation_and_magic/",
        "text": "My college professor told me that magic realism is not under the scope of fabulation, thus, they are not of the same mode of fiction. Anyone who'd care enough to enlighten me? ",
        "created_utc": 1423500497,
        "upvote_ratio": ""
    },
    {
        "title": "Is the elegant prose in Vladimir Nabakov's Lolita supposed to parody of the verbose style of modernism?",
        "author": "LIFE_DONT_ANIMATE",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vb8qi/is_the_elegant_prose_in_vladimir_nabakovs_lolita/",
        "text": "I recently read 'Lolita' for one of my English classes at university. I found the style to be beautiful and elegant and brought this up to the class, stating that this was perhapsa point of ambivalence for the reader - that they would find the elegant descriptions of paedophilia both beautiful and simultaneously disgusting.\n\nIt was only after the class, when a friend of mine read through my essay, that I was told that Nabakov's elegant style had nothing to do with the ambivalent nature of Humbert Humbert but it was actually a reaction against (and parody of) the verbose writing style of the modernists.\n\nI've had a look online for proof of this point and can't find anything. My friend seemed adament that he was right but I'm struggling to see why this means that I was wrong. Is there any proof behind what he or I was saying?\n\nEDIT: Sorry about the missing 'a' in the title",
        "created_utc": 1423499201,
        "upvote_ratio": ""
    },
    {
        "title": "Paradise Lost v. Paradise Regained",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2vamxs/paradise_lost_v_paradise_regained/",
        "text": "Why is \"Paradise Lost\" much discussed and lauded by literary critics like Harold Bloom, while \"Paradise Regained\" is barely mentioned? ",
        "created_utc": 1423486400,
        "upvote_ratio": ""
    },
    {
        "title": "How many of you read German/French?",
        "author": "hillsonn",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2va221/how_many_of_you_read_germanfrench/",
        "text": "I am Japanophile and a current MA student. My Japanese is pretty solid, but as I move deeper into literary studies (incorporating ideas not immediately 'Japanese') I find myself handicapped.\n\nOr rather, annoyed. Much of the criticism we are reading my survey of theory (at this point in the semester) was written in the 70's/80's and is littered with German that has not been translated (I am reading Frederic Jameson's *The Prison-House of Language* right now). I don't think I am missing a terrible amount not knowing the German (It is only a sentence here and there) and to be honest I don't care. But should?\n\nHow many of you are able to navigate these texts without concern, is this a trend that has fallen out of favor? If so, why? \n\nMoreover, is it still important that literature students know these languages?",
        "created_utc": 1423466147,
        "upvote_ratio": ""
    },
    {
        "title": "Has there ever been conflict over to consider literature art?",
        "author": "Recon__Covenant",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2v5bee/has_there_ever_been_conflict_over_to_consider/",
        "text": "Has there ever been conflict as to wether great literature art? Specifically as books began to be readily available to the public with the creation of the printing press, was there any stipulation that this medium was art? Thanks in advance for any answers.",
        "created_utc": 1423357774,
        "upvote_ratio": ""
    },
    {
        "title": "In search of the author of a quote in Anna Kavan's Sleep Has His House",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2uzcox/in_search_of_the_author_of_a_quote_in_anna_kavans/",
        "text": "Dear literary scholars of reddit,\n\nwhile I'm not completely sure this question is right for this subreddit, I do believe you're very likely the people who'd be best suited to help me out.\n\nI've come across a quote in Anna Kavan's *Sleep Has His House*, specifically in the second chapter (that'd be page 15 of the Peter Owen edition from 2002).\n\n\"in which, down sleeve and skirt, fold chimes with fold in every imaginable harmony of texture and hue\"\n\nWould any of you have any idea where this is taken from? Anna Kavan quotes John Gower's *Confessio Amantis* as a preface, using an edition in modern language (I searched an electronic edition in middle english for keyphrases but couldn't find anything and there's no information as to what modern english edition the author used), perhaps this could be a clue.\n\nI feel like I should know this quote (since it is given with no indication of the original author), but I'm not a native speaker of English and have rather big holes in my canon.\n\nThanks a lot.\n\ntl;dr:\nDoes anyone recognize this quote: \"in which, down sleeve and skirt, fold chimes with fold in every imaginable harmony of texture and hue\"?",
        "created_utc": 1423229156,
        "upvote_ratio": ""
    },
    {
        "title": "How to begin a serious study of literature? Also how do we distinguish Good literature from bad fiction?",
        "author": "newpersonanon",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2uydwt/how_to_begin_a_serious_study_of_literature_also/",
        "text": "Hello, I'm trying to begin a serious study of literature. I want to basically major in it, independent of any educational institution. I already read literature but how do I study it in depth?\n\nAlso what makes certain books literature and others not? I mean I know that all fiction is considered literature but I mean what makes, for example, a book like \"Brave New World\" a classic and literary masterpiece? is it that you get something back from it? It tells you something about the world? What is it? \n\nThanks for your help. ",
        "created_utc": 1423198776,
        "upvote_ratio": ""
    },
    {
        "title": "Allusions about insincerity?",
        "author": "ljoergen",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2us9lq/allusions_about_insincerity/",
        "text": "I am writing an academic paper about insincerity in political decision-making. Could someone recommend historical, mythological or literary cases of deception or insincerity, which I can use as allusions? Any help is appreciated!\n",
        "created_utc": 1423077773,
        "upvote_ratio": ""
    },
    {
        "title": "Does the quality of Shakespeare's plays decline after the death of Christopher Marlowe?",
        "author": "Ol_Dusty",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2uqy95/does_the_quality_of_shakespeares_plays_decline/",
        "text": "So I stumbled upon an article about Harold Bloom on The Guardian. A section of it read (On Marlowe and Shakespeare) \"the two competing young playwrights from strikingly similar origins egged each other on to do better, and more original work until Marlowe got caught up in and destroyed by the violence of the age\". \n\nIt continues to state \"Shakespeare had the field pretty much to himself until Ben Jonson showed up\".\n\nI've always avoided 16th Century/Shakespeare as an area of study on my degree, so my general knowledge of Shakespeare is just about what you'd expect of anyone, and nothing more. For this reason I also don't have any critics or books relating to the time just lying around my room so I can't just look for answers myself. I'm not really looking to get deep into this subject, but I thought the following points would be fun to read in discussion and all the information would be new to me, so here goes;\n\n- Does Shakespeare slow down his rate of production in the time he has no competition?\n- Is there any evidence that the popularity of his plays increased or decreased during this time?\n- Do any of the plays Shakespeare wrote in this interim period of no competition contribute to the list of his most famous, or could you say he wrote some of his 'worst' plays in this era?\n\nI just thought it was interesting, I don't need this information for anywhere else so I wondered what you guys all thought here as I'm sure we have some Shakespeare buffs here.\n\nCheers for any responses! ",
        "created_utc": 1423052633,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for Edmund Oliver (1798)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ulqec/im_looking_for_edmund_oliver_1798/",
        "text": "I am a Romanticist doing research on the 1790s, and would really like to read Charles Lloyd's novel *Edmund Oliver*. However, I have not had much luck finding it anywhere. I know that the book must be out there somewhere but am not sure where to start looking. It just doesn't seem to be in stock anywhere. If anyone has a link or a tip or a name or something, that would be much appreciated.",
        "created_utc": 1422938480,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me with this line from the Willa Cather story \"Double Birthday?\" [Some historical context needed, I think]",
        "author": "ProfDeadringer",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ukz0m/can_anyone_help_me_with_this_line_from_the_willa/",
        "text": "Early in the story, Judge Hammersley sits down to dinner with his daughter, and they begin a conversation about Albert Engelhardt. The judge's daughter mentions that she was with him in Rome, and the judge replies, rather emphatically, \"He'd better of been in Homestead!\" For the life of me, I can't find what this means. Can someone help me out? The context of the entire dinner scene is muddled without knowing the meaning of this line. ",
        "created_utc": 1422924949,
        "upvote_ratio": ""
    },
    {
        "title": "Don Quixote translations by Ormsby and Grossman",
        "author": "kolatyer",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ukbii/don_quixote_translations_by_ormsby_and_grossman/",
        "text": "These two seem to have produced the most widely acclaimed translations of Don Quixote. Ormsby's scathing attack on all previous translations makes me confident that he was quite assured in the superiority of his work. Has anyone here read both versions and the Spanish original?",
        "created_utc": 1422914318,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone rebutted Chinua Achebe's \"Images of Africa\"?",
        "author": "iamnickdolan",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ugwuy/has_anyone_rebutted_chinua_achebes_images_of/",
        "text": "I love *Heart of Darkness* and don't care much for Chinua Achebe's fiction, so in the spirit of fanboyism I am obligated to consider Achebe's critique of Conrad, \"Images of Africa\", to be nothing more than the spitballing of a jealous imitator. Problem is his points are astute. Has anyone written at length on Achebe's criticisms of *Darkness*? If so, would you be willing to share?",
        "created_utc": 1422842320,
        "upvote_ratio": ""
    },
    {
        "title": "\"Lenses\" and interpretation question",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2udrz7/lenses_and_interpretation_question/",
        "text": "Much of the talk about literature seems to focus on \"lenses\" through which to interpret the story such as Marxist, Feminist, Ecocentric, etc. Is this the only mode of studying/appreciating/reading/analyzing literature? I am only a stupid undergrad who is taking a literary analysis class, but I feel like treating a text like this puts more focus on the ideology through which you're interpreting the text rather than the text itself. It also feels vaguely masturbatory.  \n  \nDo I have any place in Literature academia if I am not at all interested in politics, psychoanalysis, etc.? Is there anything else to literature aside from these lenses? This class made me feel really confused and stupid.",
        "created_utc": 1422768979,
        "upvote_ratio": ""
    },
    {
        "title": "Texts written before 1600 AD",
        "author": "uncleschneider",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2uc8jo/texts_written_before_1600_ad/",
        "text": "I have an assignment that requires me to find a piece of Literature from before 1600 AD and write an essay on its meaning.  I'm having trouble finding an interesting piece to write about.  I thought about some Chaucer or Sir Gawain, but I'd like something a little more original.  The exact wording of the assignment follows:\n\n\"Choose any text written before AD 1600 other than ones we are reading as a class. The text should be longer than 200\nwords, but not longer than about ten pages printed.\"\n\nAny help is appreciated.  Thanks.\n\n\n",
        "created_utc": 1422738058,
        "upvote_ratio": ""
    },
    {
        "title": "Mark McGurl's concept of shame in \"The Program Era.\"",
        "author": "_MissingNo_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ubl5h/mark_mcgurls_concept_of_shame_in_the_program_era/",
        "text": "I've read it over and over again, and I can't seem to figure out what Mark McGurl defines as shame in this important piece of criticism. I'm interested in how it relates to maximalism, but also minimalism too. He throws the word around a lot but I just don't understand what it is he means when he says shame affects postwar literature. ",
        "created_utc": 1422726270,
        "upvote_ratio": ""
    },
    {
        "title": "Formal Criticism Reading Outside the American New Critics",
        "author": "retrousse",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2u9uz9/formal_criticism_reading_outside_the_american_new/",
        "text": "After a general survey of theory earlier this year, I became interested in literary theory and criticism, primarily of poetry, focused on the formal elements. I have a large pile of suggestions for reading from the back of The Best Of It, a selection of essays of the American New Critics and their associates like Jarrell and Eliot. I'd like some suggested reading in other schools. From what I know, there's \"British New Criticism\" omitted purposefully by the author of \"The Best of It\" (I've read \"Seven Types of Ambiguity,\" and know only of I.A Richards) and Russian Formalism, but everything else unknown is welcome, and is wanted. ",
        "created_utc": 1422677078,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for a quote that goes something like \"all wars are fought between a man and the stone in his boot\"",
        "author": "l-t-smash",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2u80ik/im_looking_for_a_quote_that_goes_something_like/",
        "text": "I've tried Googling but I'm usually drowned out by quotes either relating to boot camp or \"World War IV will be fought with sticks and stones.\"\nI have a feeling it's from one of Orwell's essays, but I'm likely wrong.",
        "created_utc": 1422642795,
        "upvote_ratio": ""
    },
    {
        "title": "Literary qualities of the Koran in English?",
        "author": "oldgeeza",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2u6xak/literary_qualities_of_the_koran_in_english/",
        "text": "I have 'interpretation of the meanings of the noble qur'an' by Dr. Muhammad khan. \n\nI wanted to read it for historical and literary purposes, but there's almost nothing of value in it for me. I'm halfway through it and it's all just about laws, monotheism,  praising God and judgement day. \n\nAre there any surats devoted to the more literary elements? Perhaps some poetry or parables? I just finished the Bible and it honestly sounds like an expanded version of leviticus",
        "created_utc": 1422621615,
        "upvote_ratio": ""
    },
    {
        "title": "How did pre-eminent writers like Joseph Conrad who never received much formal education, excel in English grammar and writing?",
        "author": "skerz0",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2u5tpi/how_did_preeminent_writers_like_joseph_conrad_who/",
        "text": "Moreover, Conrad's first language wasn't even English, yet he wrote like a native Anglophone! How did they learn to write so exceptionally? Here, I ask more about their outstanding diction and syntax, rather than their unique plot structures and storylines. Please correct me if I'm wrong, but do some of these writers write even more elegantly than 21st century university graduates? How? ",
        "created_utc": 1422589962,
        "upvote_ratio": ""
    },
    {
        "title": "Emerson -&gt; Thoreau -&gt; ... Dillard?",
        "author": "swizzletips",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2u3w53/emerson_thoreau_dillard/",
        "text": "Hi, all:  \nI'm currently working on a presentation on Annie Dillard's \"Teaching a Stone to Talk,\" for which I must track some kind of lineage from this book back in time (American Naturalism). I'm afraid I don't exactly have time to read as much as I'd like to before my presentation.   Can any of ye redditors sum up some basic tenets of Transcendentalism/Emerson's version of Empiricism, or perhaps simply offer some insights on the nonfictional literary tradition in which Dillard is working?  \n Thanks! ",
        "created_utc": 1422557087,
        "upvote_ratio": ""
    },
    {
        "title": "Term for Wallace-specific subject/phrase/concept?",
        "author": "blueslushie92",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2txouo/term_for_wallacespecific_subjectphraseconcept/",
        "text": "I'm currently writing my thesis on the New Sincerity and contemporary poetry and I keep running into instances where I want to say something akin to \"Wallace's specific conceptualization of sincerity\" and I would really like to have an adjective specific to Wallace to tighten up my language.\n\nBasically I'm looking for the David Foster Wallace equivalent of \"Beckettian\" or \"Joycean\"",
        "created_utc": 1422424489,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an influence of Julio Cortázar on Qiu Miaojin last novel?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2txc7i/is_there_an_influence_of_julio_cortázar_on_qiu/",
        "text": "While reading Qiu Miaojin's novel: Last Words from Montmartre I cannot but recognize an influence from Julio Cortazar's text [Carta a una señorita en Paris](http://spooky-arts.blogspot.com/2014/09/carta-una-senorita-en-paris.html) / [Letter to a Young Lady in Paris](http://mrcampbellrocks.com/letter-to-a-young-lady-in-paris-by-julio-cortazar/).\n\nTrigger warning:Spoiler.\n  &gt; The bunny (last link to love?), the suicide letters of a foreigner in Paris (is Paris that scary for single foreigners?). But also the interest in creating a text that can be read in an arbitrary order (which Cortazar explains as giving multiples stories while in Qiu and in any break up the order of the events become less important than the conclusion, it only matter that they happen). \n\nSince both lived in Paris I believe this is a reasonable assumption. Or maybe rabbits in Paris become a common topic in literature...\n",
        "created_utc": 1422417583,
        "upvote_ratio": ""
    },
    {
        "title": "Advanced English Grammar Book for a native Anglophone?",
        "author": "skerz0",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2txbpe/advanced_english_grammar_book_for_a_native/",
        "text": "I'm seeking an advanced grammar book/guide for an Anglophone that's readable (ie: written in enjoyably basic language without verbosity) and practical (ie: focusing on topics that truly figure or occur in harder texts). This should target an Anglophone  who can write English fluently, but who hasn't studied grammar or linguistics formally after high school. I don't know if \n[*The Cambridge Grammar of the English Language*](http://www.amazon.ca/The-Cambridge-Grammar-English-Language/dp/0521431468)  by Rodney Huddleston, Apr 15 2002, exemplifies my search.  I abbreviate this book as *CGEL*.\n\n**Pros:** *CGEL* seems to cohere with my objectives because such topics as [subject-dependent inversion](http://ell.stackexchange.com/a/40402/8712) seems advanced and prevalent in literary texts, as do [these types of inversion](http://en.wikipedia.org/wiki/Subject%E2%80%93verb_inversion_in_English) and [ellipsis](http://en.wikipedia.org/wiki/Ellipsis_%28linguistics%29).\n\n**Cons:** 1\\. I worry that on average, *CGEL*'s topics may emerge too abstract or esoteric.\n\n2\\. At 1860 pages, reading it may prove onerous or stark, though I never intended to read a grammar book in one continuous instance. ",
        "created_utc": 1422417341,
        "upvote_ratio": ""
    },
    {
        "title": "What is the earliest modern example of an author writing multiple books in the same \"world\"? What about multiple authors writing in the same world?",
        "author": "DNASnatcher",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tu42t/what_is_the_earliest_modern_example_of_an_author/",
        "text": "Thinking about Lovecraft's mythos got me wondering, what is the earliest modern example of this sort of multi-work worldbuilding? I'm not necessarily looking for sequels or series, which obviously take place in the same universe. And I'm not really looking for ancient mythology because I'm curious about more recent examples.\n\nI'd love to hear any and all information about worlds built up by a single author, and worlds shared between multiple authors. Thanks!\n\nEdit: To be clear, when I mention \"worlds\" I don't necessarily mean purely invented, fantasy locations. I only mean that there is shared continuity between books that aren't direct sequels. So if Moll Flanders showed up in Robinson Crusoe, for example, we could describe them as being in the same world.",
        "created_utc": 1422363666,
        "upvote_ratio": ""
    },
    {
        "title": "About heroes and antiheroes...originality and execution",
        "author": "UselessWisdomMachine",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tkz75/about_heroes_and_antiheroesoriginality_and/",
        "text": "Hi guys!\n\nI don't know how many into you are into gaming, but considering it's ever growing importance given to narratives and because the concepts I'm asking about are pretty much present in every medium that involves a narrative. I thought this would be a good place to ask.\n\nI recently finished playing The Last of Us. Arguably, the game does not add much new (\"narrtive-wise\") but it does execute what it does in a very good way.\n However there is this one aspect that has keeping me thinking ever since I finished it, namely the actions of the main character. I can't give you too much details about the story other than the main plot https://en.wikipedia.org/wiki/The_Last_of_Us#Plot, but suffice it to say that the protagonist is actually not any different (more \"evil\" or \"good\") than any of the \"enemies\" you'd encounter in a video game.\n\nSo..since he actually lacks the qualities of a hero (such as morality...even though in a postapocalyptic world what we know as morals might only be encountered in very small amounts) he could be considered an antihero...but as I said, there's arguably nothing that sets him apart from the rest.\n\nSo my question is...can a character be considered a hero just because of his/her actions...or do these actions need to be compared to those of the other characters in order to be able to make a judgement.\n\n\nWhie we are at that, considering what i said earlier about the game...how do important would you consider the roles of execution and originaity in narratives in relation to each other ? I can only draw some sort of an answer from my undergraduate theory course where e discussed intertextuality based on barthes and hutcheon, so I would like to hear what some of you here would have to say about it.",
        "created_utc": 1422157730,
        "upvote_ratio": ""
    },
    {
        "title": "I'm working on a paper on Donald Barthelme and every professor I speak with pronounces his name differently. Can I get a definitive answer about the correct pronunciation?",
        "author": "_MissingNo_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tkmb5/im_working_on_a_paper_on_donald_barthelme_and/",
        "text": "I will have to present this paper at some point and I would like to pronounce it correctly. ",
        "created_utc": 1422150133,
        "upvote_ratio": ""
    },
    {
        "title": "Modern children literature",
        "author": "AstralFlare",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tikgh/modern_children_literature/",
        "text": "Is there an established literary canon for modern children literature? For the context of this question, I will define modern as published after 1990 and children literature as books aimed at an audience under the age of 12",
        "created_utc": 1422111277,
        "upvote_ratio": ""
    },
    {
        "title": "[Literary Theory: Ecocriticism] Any novels that would lend themselves to an ecocritical interpretation?",
        "author": "Ol_Dusty",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2thcrf/literary_theory_ecocriticism_any_novels_that/",
        "text": "Hey guys, my dissertation proposal comes up in a few months and so far my favourite topic to write about is ecocriticism, a 'relatively' new literary theory that I personally believe is crucial for literature students to study moving forward because of its implications with the environment. \n\nI've brought this to /r/AskLiteraryStudies because I was hoping someone here might have already looked at this subject in depth, and could maybe point me in the right direction of novelists who could be analysed in this light. \n\nAtwood is a great poet for this kind of thing, but I'm looking for longer more 'meaty' work that would lend better to lengthy study. \n\nThanks for reading!",
        "created_utc": 1422072247,
        "upvote_ratio": ""
    },
    {
        "title": "Runaway Horses' Title (from Yukio Mishima's Sea of Fertility Tetralogy)",
        "author": "hell_dude",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tf8im/runaway_horses_title_from_yukio_mishimas_sea_of/",
        "text": "so i've just finished reading this book. it was great, if a little abstruse for me at points. i'm really glad that i undertook the endeavour of reading the whole tetralogy and i highly recommend it to anyone interested in mishima or modern japanese literature.\n\nall that said... i don't actually know from where the title for runaway horses came. i mean, spring snow was from a particular monologue and had a bunch of obvious metaphorical significances but i didn't notice the phrase 'runaway horses' used anywhere throughout the novel. i can come up with a slew of potential metaphorical interpretations (pretty much anything can be aptly interpreted as a metaphor a posteriori) but i'm sure the title actually has, y'know, a meaning. anyone have any hints or suggestions?",
        "created_utc": 1422034927,
        "upvote_ratio": ""
    },
    {
        "title": "Need Help Building an Independent Study Syllabus about Cultural Studies and Social Theory",
        "author": "OfConfidence",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tazbi/need_help_building_an_independent_study_syllabus/",
        "text": "Hello all,\nI'm a senior majoring in literature / creative writing and I'm highly interested in the overlap between social activism and literary theory. After taking an theory and crit course I could not stop thinking about how accurately critics such as Foucault and Nietzsche were able to comment on the state of societies, so I have been in discussion with one of my professors about doing an independent study dealing with the subject matter. He has asked me to amass at least 10 syllabi similar to what I'm interested in in order to organize my own syllabus, but I've been having trouble finding syllabi online in order to do this.\n\nSo far the most helpful site I've found was CulturalPolitics.net, but not all of the academic programs linked are accessible to non-students. Do any of you have any suggestions on where to look / how to approach the subject? I need to be looking at undergrad-seminar / graduate level course syllabi. Any guidance you can give is greatly appreciated!",
        "created_utc": 1421946590,
        "upvote_ratio": ""
    },
    {
        "title": "What are some connections between Hamlet, V for Vendetta, and 1984?",
        "author": "_johnning",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2tacbo/what_are_some_connections_between_hamlet_v_for/",
        "text": "",
        "created_utc": 1421934192,
        "upvote_ratio": ""
    },
    {
        "title": "Religious themes in The Zoo Story by Edward Albee",
        "author": "laurenisbitchin",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2t7f2i/religious_themes_in_the_zoo_story_by_edward_albee/",
        "text": "I've just finished reading The Zoo story by Edward Albee and I understand the overall and most prominent theme of isolation/alienation of society, but I'm curious as to what points (if any) Albee is trying to make about religion. I've researched some historical context on the play and realized that it was written around the time of the Eisenhower era which is incidentally also the era that passed the legislation of adding \"In God We Trust\" as motto and \"one nation under God\" to the national anthem.\n\nSince the play is a criticism of society, my first instinct was to think that it would also be a criticism of religion. Upon analyzing the small amounts of religion that Albee incorporates into the play, I'm not sure. The two most pivotal religious moments are when Jerry is talking about forging connections with material things if you can't connect with people which eventually transforms into forming a connection with God, but he calls God all of the people that are in his building. To me, this almost seemed to me that him saying a lack of connection with God results in a lack of connection with people so the alienation of society is also a result of the degradation of religion within the society. Also in this same area of the play, Jerry claims that it seems that God has left the society or something of the such. Since Jerry is representative of all the negative effects alienation has on society, it should follow that this philosophy on life is also a negative philosophy to have. The next time that God is heavily mentioned is after Jerry has been stabbed and is repeating \"Oh my God\" as he dies. This seemed to me as if he is almost blaming God for his death. Since his death is very overtly caused by lack of human connection and loneliness and an attempt to create said connection, would this draw back to lack of human connection is related to a lack of connection with God?\n\nJust hoping to get some opinions on this particular theme because while I think the others in the play were quite palpable, this one is more subtle and not as easily defined.",
        "created_utc": 1421870645,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Dystopian/Utopian novels from 1970s - present day that focus on female communities OR fertility, motherhood",
        "author": "liznicter",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2t63zv/looking_for_dystopianutopian_novels_from_1970s/",
        "text": "I'm writing a thesis on this topic! So far I have Atwood's A Handmaid's Tale and Tepper's Gate to Women's Country. Any other novels that you can suggest? Thanks! ",
        "created_utc": 1421847975,
        "upvote_ratio": ""
    },
    {
        "title": "An autobiography from 1860 - really autobiography? :)",
        "author": "girl168cool",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2t5tm9/an_autobiography_from_1860_really_autobiography/",
        "text": "Hi,\nI'm currently reading 1860' 'Autobiography of an English detective' by William Russell, and in the preface it claims to be based on facts.\nI gathered there is ntg known about the author,\n\nis it probable that the book is really based on true events? I'm just really curious.",
        "created_utc": 1421839709,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for suggestions of Black British poets",
        "author": "chimachukma",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2t2ema/looking_for_suggestions_of_black_british_poets/",
        "text": "Hello there.  I am a high school teacher at a school in the U.S.A. that is entirely African American.  The course I currently teach is British literature, and I am seeking recommendations of Black British poets, especially those whose poems are available online (so I can make handouts for students from such as we have a limited library.)  Please help if you can, and thank you very much.  If you know of someone else who can help, please show this to them.  If you know of a better subreddit for this, please let me know.  Thanks again.",
        "created_utc": 1421773589,
        "upvote_ratio": ""
    },
    {
        "title": "Can you name any authors who cite Moby-Dick as their favorite novel?",
        "author": "jarred123",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2t23y2/can_you_name_any_authors_who_cite_mobydick_as/",
        "text": "",
        "created_utc": 1421768453,
        "upvote_ratio": ""
    },
    {
        "title": "1984 by George Orwell \"Scrapbook\" Ideas",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2svb41/1984_by_george_orwell_scrapbook_ideas/",
        "text": "I have a project for language arts where we have to read a book and make a scrapbook about the story, or pretend a character has made it about his/her life. The scrapbook should look like a real scrapbook and contain actual memorabilia, awards, photos, mementos, ticket stubs, report cards, etc.\n\nWe have to choose at least 15 items and write a paragraph for each item explaining its significance. I am having an extremely hard idea of thinking of some ideas, any suggestions would be appreciated!",
        "created_utc": 1421618377,
        "upvote_ratio": ""
    },
    {
        "title": "What To Read Instead of Orientalism by Edward Said?",
        "author": "belly_face",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2supd3/what_to_read_instead_of_orientalism_by_edward_said/",
        "text": "I've found a handful of PDF files for downloading this text, but those are super dodgy on my Kindle.  So perhaps someone can recommend to me an alternative to Said's work (by Said himselfor a different author all together...Chomsky perhaps?) that is ALSO a free ebook (i.e. mobi, epub, azw3 etc...).  In the wake of Charlie Hebdo, this seems relevant and I'm quite eager to read it.  Thanks all!",
        "created_utc": 1421607302,
        "upvote_ratio": ""
    },
    {
        "title": "The Uncanny",
        "author": "conjod",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2styf4/the_uncanny/",
        "text": "hi!\nBasically, I'm about to start reading for my dissertation and I am planning on exploring the Uncanny - deja vu, the double, dreams, ghosts (though not's not a big interest for me) - effectively anything that plays tricks on our minds, making us question our sense of self.\n\nI got into meditation recently, mainly because it is the idea of losing language and letting go of our discursive minds. My tutor then pointed out the difficulty of such a topic, because by it's definition it's indescribable. Therefore, the uncanny was a close second in exploring literatures relationship with the oddities of our mind and how it can bring our individuality into question.\n\nSo if you guys had any recommendations for critical theory to read, authors who explore this subject of interest, that would be a great help. (I've read Freud's the uncanny, Confessions of an Opium eater, I've also gathered Don De Lillo is good for this area? And is Derrida good? - I've heard his name pop up but we haven't covered him yet)\n\nThank you!",
        "created_utc": 1421591402,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a reason why George Eliot (Mary Ann Evans) is still published under her pseudonym?",
        "author": "waspoe",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2stj13/is_there_a_reason_why_george_eliot_mary_ann_evans/",
        "text": "Other females writers from the time who used pseudonym such as Jane Austin (Mrs Ashton Dennis) and the Bronte Sisters (Currer (Charlotte), Ellis (Emily) and Acton (Anne) Bell) are now published under their real names yet we still call Mary Ann Evans by her male pseudonym. Why is this?",
        "created_utc": 1421574854,
        "upvote_ratio": ""
    },
    {
        "title": "Thesis/Perspective ideas for Milan Kundera (The Unbearable Lightness of Being)",
        "author": "TheLanguageOfWaves",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2staee/thesisperspective_ideas_for_milan_kundera_the/",
        "text": "This semester I'm embarking on my \"C-Uppsats\" in literature studies, which is the Swedish equivalence for the dissertation. I had tons of ideas but my teacher turned them all down since they were too 'philosophical'. I have a huge interest and natural passion for Milan Kundera, his life, writings and novels, but I still can't find THE RIGHT theme and theory/perspective to start formulate my thesis statement. \nOne idea I had was a comparative study between Milan Kundera and Jack Kerouac, with the focus on their wish to detach from material weights and personal relationships, which Kundera called Lightness. I would prefer to write either a biographical study, or a comparative study. \nAnother vague thought was \"Stoicism in The Unbearable Lightness of Being\", and again focus on the Lightness, the detachment from things out of our control. \n\nDo you have ideas of where to start with this, any natural theories/perspectives that comes to mind?",
        "created_utc": 1421565582,
        "upvote_ratio": ""
    },
    {
        "title": "What work should I read after I read Paradise Lost?",
        "author": "trippinofflife",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sslfw/what_work_should_i_read_after_i_read_paradise_lost/",
        "text": "I have to read two pieces from the A.P. Literature and Composition recommended reading list (essentially any work with literary merit) for my English class and I've always wanted to read Paradise Lost. What else should I read? What would complement/contrast this work?\nThanks:)",
        "created_utc": 1421548200,
        "upvote_ratio": ""
    },
    {
        "title": "Annotations or explanations for honourable but complex English writing?",
        "author": "skerz0",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ss2ux/annotations_or_explanations_for_honourable_but/",
        "text": "TL;DR: Are there counterparts or equivalents to Sparknotes's *No Fear* series which simplifies [5 other works besides Shakespeare](http://www.sparknotes.com/nofear/lit/) and [Barron's Simply Shakespeare](http://www.barronseduc.com/0764120859.html), for complicated English writing starting from the 1700s?\n\nAlthough writing from 1700s onwards still belongs to the label of Modern English, I struggle with the harder writing style, and [suffer from problems like these Amazon reviewers'](http://www.amazon.com/Julius-Caesar-No-Fear-Shakespeare/dp/1586638475): sentence structures were more convoluted and longer, tricky syntax more prevalent and even trickier, etc... I never studied literature or linguistics formally, but want to read this for pleasure (*and NOT for any class*) now, so Shakespeare isn't the only writer to confuse me. I must grapple also with later authors like the Framers of the US Constitution (eg John Adams, Thomas Jefferson), Joseph Conrad, [Henry James](http://en.wikipedia.org/wiki/Henry_James), Virginia Woolf, ...\n\nSo this helpful aid or guide should gloss or explain the text, at least every few lines as needed,  \nright alongside the text for easy cross-reference,   \nand should advise on and reveal the steps and thought processes behind how to do so.\n\nI didn't post at http://www.reddit.com/r/SuggestMeABook  because I seek not a specific book, but a type of guidebook or resource. ",
        "created_utc": 1421537386,
        "upvote_ratio": ""
    },
    {
        "title": "High School English Literature Coursework",
        "author": "cloudy_limonade",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2ss1s4/high_school_english_literature_coursework/",
        "text": "Hi! I'm currently in my last year of high school in  England and taking English Literature as one of my subjects. As part of my coursework, we've been told to choose 2 texts and one poet to explore the theme of Men, Women, Love and Marriage.\n\nI've chosen: Nabokov's Lolita, Tennessee William's Cat on a Hot Tin Roof but I'm at a loss at what poet to choose and I have yet to finalise my title. I decided to base my essay on gender and power in relationships probably focussing on female sexuality (?).\n\nBut I'm quite confused about my title (and what poet to focus on...) because I'm not sure if I'll have enough to write about and I'd be really grateful if anyone could offer any insight or suggestions!\n\nThank you in advance :)",
        "created_utc": 1421536787,
        "upvote_ratio": ""
    },
    {
        "title": "\"Words are all we have\"- Beckett. Does anyone know where in Beckett's works this quote comes from?",
        "author": "kick_muncher",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2srow2/words_are_all_we_have_beckett_does_anyone_know/",
        "text": "I came across this quote which is PERFECT for my dissertation, but I haven't come across it before in any Beckett I've read. Anyone have any idea? Thanks!",
        "created_utc": 1421529938,
        "upvote_ratio": ""
    },
    {
        "title": "Stephen Dedalus as Dubliners (1914) narrator",
        "author": "nuschool_account",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sr7o5/stephen_dedalus_as_dubliners_1914_narrator/",
        "text": "The [Stephen Dedalus Wikipedia page](http://en.wikipedia.org/wiki/Stephen_Dedalus) states that Harold Bloom understood Stephen to be the narrator of the first three stories (or the Childhood section) of Dubliners. However, there is no citation there to say where Harold Bloom asserts that claim. Does anyone know where Bloom, or any other respected critic, made this statement?\n\nThank you. ",
        "created_utc": 1421520990,
        "upvote_ratio": ""
    },
    {
        "title": "Edgar Allan Poe, Parody, and Defamiliarization",
        "author": "thundahcunt",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sr5kz/edgar_allan_poe_parody_and_defamiliarization/",
        "text": "I'm currently working on a project that links Poe's parody of literary tropes to defamiliarization and the Russian Formalists. Unfortunately, I'm having an absolutely impossible time finding sources. I've searched the obvious combinations of my keywords, as well as individual works by Poe I'm thinking of using (Berenice, To Helen, An Enigma, To Science, and The Philosophy of Composition) in combination with those keywords. I've used every resource I have access to, including: MLA, Muse, JSTOR, EBSCO, my university's catalog, and google scholar. So far these tactics have turned up very little that is of actual help to me and my project.\n\nI'm hoping a kind soul here might either be able to suggest keywords I could use, or if they know of any, actual sources they believe could prove helpful.\n\nI'd appreciate any help or suggestion given - I'm desperate!",
        "created_utc": 1421519860,
        "upvote_ratio": ""
    },
    {
        "title": "What constitutes literature? Where do you draw the line?",
        "author": "satanspanties",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sqjm7/what_constitutes_literature_where_do_you_draw_the/",
        "text": "Films?  TV shows?  Video games?  Oral storytelling?  What about other written media like magazines, websites and newspapers?  Some people argue that comic books and graphic novels, and even works of non-fiction cannot be literature.  What do you think?  What are some of the arguments for and against?\n\nAlso, as somebody fascinated by the concept of defining what is and is not literature, is there anywhere in particular I should start reading (first year undergrad reading level)?",
        "created_utc": 1421507290,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly makes satire satire?",
        "author": "Saintfrank",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2so184/what_exactly_makes_satire_satire/",
        "text": "Jonathan Swift suggests in \"A Modest Proposal\" that destitute Irish families should sell their children as food to the rich. We understand the essay as satire in part because we know Swift's other works and we have records showing us that it was taken as satire. Now move forward 5,000 years and imagine that nobody knows anything about Ireland, UK or Europe. Would \"A Modest Proposal\" still come across as satire/humorous or as a horrible person proposing cannibalism? And stretching this question to extremes, could parts of Adolf Hitler's Mein Kampf be viewed as satire under the same circumstances (i.e., 5,000 years from now)? Why or why not?",
        "created_utc": 1421441850,
        "upvote_ratio": ""
    },
    {
        "title": "What are some books featuring female astronauts/space travellers?",
        "author": "360Saturn",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sipwy/what_are_some_books_featuring_female/",
        "text": "I'm doing a research project (EDIT: out of personal interest) where I'm not using/referencing films and most of the classic female space travellers (Ripley, etc) are from films as far as I know. Figured here would be a good place to ask!\n\nFrom any genre, just looking for some pointers. Doesn't have to be famous or 'canon' books. Thanks!",
        "created_utc": 1421334407,
        "upvote_ratio": ""
    },
    {
        "title": "Need advice: Russian Literature (mostly 19th century)/class discussions",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sh2zr/need_advice_russian_literature_mostly_19th/",
        "text": "I'm currently taking a senior-level Russian Literature class that is discussion-based. The books for the class are Anna Karenina, The Master and Margarita, From Karamzin to Bunin (anthology), and Lives in Transit (collection of women's writings). We're starting the course with the Karamzin to Bunin book. In fact, today we had our first discussion, which was over Karamzin's short story Poor Liza. I thought that I understood the story, but apparently I didn't because I had no idea what anyone was talking about. \n\nSo I was hoping I could get some advice on how to understand such writings at a higher level. If you want to talk about \"Poor Liza\" specifically, let me know. I was also hoping to get some advise on how to participate in book discussions because I literally had nothing meaningful to talk about today. Let me know if you need more information; I'm trying to keep this post short.\n \n\n",
        "created_utc": 1421289852,
        "upvote_ratio": ""
    },
    {
        "title": "Good travel writers?",
        "author": "justwuntime",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sffqx/good_travel_writers/",
        "text": "Can anybody recommend authors similar to Ian Frazier? I just finished \"Siberia\". I was blown away. ",
        "created_utc": 1421262121,
        "upvote_ratio": ""
    },
    {
        "title": "Any Communist literature?",
        "author": "ReaIJimShady",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2sbxif/any_communist_literature/",
        "text": "I'm a senior in High School. For my literature class, we spend all of 2nd semester working on a 25 page literary thesis to be turned in before finals. The topic I chose is on the development of Communist literature. So far, I've acquired:\nThe Communist Manifesto, The Motorcycle Diaries, and Quotations from Chairman Mao. \nDoes anybody have any recommendations/need to reads for this paper? All suggestions are welcome.",
        "created_utc": 1421187697,
        "upvote_ratio": ""
    },
    {
        "title": "Alright so I just finished the fountainhead",
        "author": "dyno23",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s74m2/alright_so_i_just_finished_the_fountainhead/",
        "text": "I've got a million questions and thoughts.  But I'd like to start with one.\n\nI'm curious what Roark thinks about children. And raising good people. Even good in his sense: little creators.  For society to move forward, obviously there needs to be reproduction.  And kids need nurturing and love.  And parents should be inclined to feel love and compassion towards their children.  Is this the one of the exclusions Rand references? Or is this a false statement under objectivism? Can you truly be fulfilled if your sole source of fulfillment is the self, the creation, if you have to deplete so much of your joy and love towards another human being? Perhaps children count as creation, which would make sense philosophically. Maybe Rands heroes would be terrible parents - the definition of which is complicated in this context and I would prefer to glaze over for the sake of this conversation. Thoughts?",
        "created_utc": 1421092502,
        "upvote_ratio": ""
    },
    {
        "title": "Intimidated by the thought of reading Samuel Beckett.",
        "author": "mikemcq",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s6y0f/intimidated_by_the_thought_of_reading_samuel/",
        "text": "For me, Samuel Beckett feels completely inaccessible. Each time I've started reading a work of his I've quickly become lost. The sort of ubiquitous praise for him probably has something to do with it. For almost any other writer that has initially confronted me with this feeling I have found some path into their ouvre. Not Beckett. I see his name referenced everywhere though when reading him I never seem to be able to figure out a way to connect the material with something (that at least feels) concrete. Existentialism, absurdism? Sure, but what makes Beckett such a standout among his peers? Why is he *so* praised?\n\nI feel sure that I'm missing something. Does anyone have any suggestions for toe-dipping into Beckett? Maybe an essay that focuses on an individual work? Thanks very much for your time.",
        "created_utc": 1421089510,
        "upvote_ratio": ""
    },
    {
        "title": "Significance of the shield in Sir Gawain and the Green Knight? (Pentangle)",
        "author": "LiteratureStudent",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s6iin/significance_of_the_shield_in_sir_gawain_and_the/",
        "text": "",
        "created_utc": 1421082319,
        "upvote_ratio": ""
    },
    {
        "title": "I am a neophyte to literary studies and hope, one day, to study it. Can any of you recommend a particularly good introductory textbook to Literary Theory?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s5oh7/i_am_a_neophyte_to_literary_studies_and_hope_one/",
        "text": "Hello there. I'm 20 and studying in my spare time; the objective of which is to study English or English Literature at University. \n\nI should be able to do this within the next year - possibly two.\n\nEssentially what I'm looking for is a well written, well respected and definitive introductory textbook on the subject of Literary Theory and Criticism. I've spoken to a few student friends who study the subject, and have received the following recommendations:\n\n[CTLS](http://www.amazon.com/Critical-Terms-Literary-Study-Lentricchia/dp/0226472035)\n\n[LTC:Oxford](http://www.amazon.co.uk/Literary-Theory-Criticism-Oxford-Guides/dp/0199258368)\n\n\n[LT: An Introduction](http://www.amazon.co.uk/Literary-Theory-Introduction-Terry-Eagleton/dp/140517921X/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1421063708&amp;sr=1-2&amp;keywords=literary+theory+introduction)\n\n\nAny help and feedback would be appreciated, guys. Thanks for taking the time to read and answer. Take care.\n\n***-K.***\n\n",
        "created_utc": 1421063843,
        "upvote_ratio": ""
    },
    {
        "title": "I need some help with creating theme statements.",
        "author": "mattsmithDW",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s497i/i_need_some_help_with_creating_theme_statements/",
        "text": "I was unsure as to where I might be able to ask. This was the closest I could find.\n\nMy lit/comp class has been reading \"The bean trees\" by Barbara Kingsolver\n\nWe have to come with a theme statement, and write a paper about it, however, even after reading the book, I have no idea what I am doing. currently i am failing lit/comp class. i decided its finally time to turn this around, i really need help though, i have no idea what i am doing, or how to find a theme in a book. I can read just fine, i just can't do anything with it really. i cant find motifs or themes or anything like that. Any help is greatly appreciated, even if it is a subreddit suggestion that might help me more.",
        "created_utc": 1421026234,
        "upvote_ratio": ""
    },
    {
        "title": "Kipling, word choice: \"Gentiles\"?",
        "author": "BadAtStuff",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s43jc/kipling_word_choice_gentiles/",
        "text": "I read a couple of his poems recently, and I *think* he's using the word \"Gentiles\" in a pejorative sense, or at-least as a negative contrast to something better.\n\nI'm trying to understand what/who he means by \"Gentiles\", and why he criticizes it/them?\n\nFor example, in *Our Lady of the Snows*,\n\n\"**Not for the Gentiles’ clamour—**\nInsult or threat of blows—\nBow we the knee to Baal,\"\n\nAlso, *Recessional*,\n\n\"If, drunk with sight of power, we loose\nWild tongues that have not Thee in awe—\n**Such boastings as the Gentiles use**,\nOr lesser breeds without the Law—\nLord God of Hosts, be with us yet,\"",
        "created_utc": 1421023195,
        "upvote_ratio": ""
    },
    {
        "title": "Help with textual analysis.",
        "author": "LaurenPatrick",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s3kmw/help_with_textual_analysis/",
        "text": "Hi!\n\nI have a schoolwork I need help with. I have to analyse an extract from \"Timbuktu\" (1999) by Paul Auster. I am having trouble with:\n\n* finding semantic or lexical threads\n* identifying images/metaphors\n* register, tone, evidence of an individual writing style.\nI would appreciate any thoughts and knowledge on that department. Anything helps :) Thanks in advance!\n\nHere's the text:\n\n&gt; Mr. Bones knew that Willy wasn’t long for this world. The cough had been inside him for over six months, and by now there wasn’t a chance in hell that he would ever get rid of it. Slowly and inexorably, without once taking a turn for the better, the thing had assumed a life of its own, advancing from a faint, phlegm-filled rattle in the lungs on February third to the wheezy sputum-jigs and gobby convulsions of high summer. All that was bad enough, but in the past two weeks a new tonality had crept into the bronchial music – something tight and flinty and percussive – and the attacks came so often now as to be almost constant. Every time one of them started, Mr. Bones half expected Willy’s body to explode from the rockets of pressure bursting against his rib cage. He figured that blood would be the next step, and when that fatal moment finally occurred on Saturday afternoon, it was as if all the angels in heaven had opened their mouths and started to sing. Mr. Bones saw it happen with his own eyes, standing by the edge of the road between Washington and Baltimore as Willy hawked up a few miserable clots of red matter into his handkerchief, and right then and there he knew that every ounce of hope was gone. The smell of death had settled upon Willy G. Christmas, and as surely as the sun was a lamp in the clouds that went off and on every day, the end was drawing near. \n\n&gt; What was a poor dog to do? Mr. Bones had been with Willy since his earliest days as a pup, and by now it was next to impossible for him to imagine a world that did not have his master in it. Every thought, every memory, every particle of the earth and air was saturated with Willy’s presence. Habits die hard, and no doubt there’s some truth to the adage about old dogs and new tricks, but it was more than just love or devotion that caused Mr. Bones to dread what was coming. It was pure ontological terror. Subtract Willy from the world, and the odds were that the world itself would cease to exist.",
        "created_utc": 1421013507,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I go to get my work reviewed and critiqued by literary critics?",
        "author": "Rllrllrrlrrl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s188i/where_can_i_go_to_get_my_work_reviewed_and/",
        "text": "",
        "created_utc": 1420951966,
        "upvote_ratio": ""
    },
    {
        "title": "Best \"On Writing\" books?",
        "author": "Rllrllrrlrrl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2s0h8h/best_on_writing_books/",
        "text": "Currently reading Hemingway On Writing. Looking for others.",
        "created_utc": 1420935595,
        "upvote_ratio": ""
    },
    {
        "title": "What is the consensus on the relationship between Peredur and Chrétien's Perceval ?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rzdzq/what_is_the_consensus_on_the_relationship_between/",
        "text": "The welsh *Peredur* and Chrétien de Troyes' *Perceval* share a lot of characteristics, yet diverge on key elements. Is there an actual consensus on their relationship ? Could they have a common \"ancestor\", an earlier text or legend that inspired them both ?",
        "created_utc": 1420914705,
        "upvote_ratio": ""
    },
    {
        "title": "Is personification about 'humanness' or 'sentience'?",
        "author": "FaerieStories",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rz85g/is_personification_about_humanness_or_sentience/",
        "text": "I always understood 'personification' to be about portraying a non-human thing as a human (a 'person'). So this could be something inanimate, or it could be an animal. I have to teach a class next week about [The Sea by James Reeves](http://www.poemhunter.com/poem/the-sea-36/), and many of the teaching resources I've seen claim that this poem uses personification to turn the sea into a \"hungry dog\". \n\nSo is this extended metaphor also an example of personification or not? Does making a non-sentient entity sentient (though not *human*) count as personification?",
        "created_utc": 1420911657,
        "upvote_ratio": ""
    },
    {
        "title": "Good introduction to film studies books for a freshman literature course?",
        "author": "DorianaGraye",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rtiga/good_introduction_to_film_studies_books_for_a/",
        "text": "Hello, everyone! \n\nI'm looking for a few recommendations for introduction to film studies books that I can use in my freshman literature course.  I'm teaching The Modern Western, and while we are reading a variety of texts, we will also be screening films like *Finding Nemo* and *True Grit.*  \n\nWhat I'm ideally looking for is a book that has nice, self-contained chapters that I could easily assign for outside reading.  It would also present information in an understandable, engaging way.  Since I'm teaching at a big R1 school, freshman level courses of all kinds tend to attract non-majors, so I want to make sure I'm assigning readings that works for a fairly generic group of students. \n\nRight now, I've been told *How to Read a Film* might be good for this, but I'm interested in more feedback/insight.  Any help would be much appreciated!",
        "created_utc": 1420774185,
        "upvote_ratio": ""
    },
    {
        "title": "If You Were to Creat a Video Game on Macbeth, What levels would you have on it?",
        "author": "TheSwaggaSauras",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rqqgn/if_you_were_to_creat_a_video_game_on_macbeth_what/",
        "text": "im a little bit stuck on this one? Yes for an English assignment and I Thought I could get a fresh pair of eyes on the concept. I would also make this imaginary game like Assassins Creed",
        "created_utc": 1420725028,
        "upvote_ratio": ""
    },
    {
        "title": "Literary examples of specific character trait - competition",
        "author": "lorakinn",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rpf46/literary_examples_of_specific_character_trait/",
        "text": "I think my question belongs here.  I was thinking tonight about how stories often portray the main character as a hero who must complete a quest to fulfill his destiny and learns stuff along the way, etc- and that there is also the anti-hero who doesn't fulfill his quest, etc. In addition, the hero (or anti-hero) might embody particular traits more than others (revenge, greed, hedonism, etc).  **What are some examples of characters who embody competitiveness - and can you think of examples of an anti-competitor?** ",
        "created_utc": 1420688380,
        "upvote_ratio": ""
    },
    {
        "title": "Adjectival term for interaction between characters...?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rpedk/adjectival_term_for_interaction_between_characters/",
        "text": "In an analysis I'm trying to explain the overall effect of both narratorial treatment and the interaction between characters.  Is there a more concise way of explaining interaction between characters, and if so, is this term able to be used adjectivally?  \n\nI can't think of any word that works.  If \"interaction between characters\" won't do, is there a term to use for a character's characteristics, if that makes sense?",
        "created_utc": 1420688027,
        "upvote_ratio": ""
    },
    {
        "title": "Literature (non-fiction) about the May '68 Student Riots in Paris?",
        "author": "slimaarons",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rp8y6/literature_nonfiction_about_the_may_68_student/",
        "text": "",
        "created_utc": 1420685077,
        "upvote_ratio": ""
    },
    {
        "title": "Any podcasts, videos, or speeches relating to literary studies that you folks might recommend?",
        "author": "UncleEggma",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rnyhl/any_podcasts_videos_or_speeches_relating_to/",
        "text": "I typically listen to music or an audiobook during my commute, but sometimes it's a bit nicer to listen to a conversation or speech by a famous critic/philosopher.  I've listened to a few talks by Slavoj Zizek in the past, which were fun and engaging, but I'm looking to hear from speakers I wouldn't normally think to consume.\n\nDoes anyone in the subreddit have some favorite or recommended spearkers?\n\nThanks!",
        "created_utc": 1420663057,
        "upvote_ratio": ""
    },
    {
        "title": "Does every line of a play reveal what the speaker wants?",
        "author": "prenis",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rkjyx/does_every_line_of_a_play_reveal_what_the_speaker/",
        "text": "I've enjoyed reading plays for awhile now and i'm trying to learn more about the more theoretical aspects of plays. I purchased 'Backwards and Forwards: A Technical Manual for Reading Plays' by David Ball. He says \"You do not really know a play until you see how every word is intended by it's speaker to overcome some obstacle to what the speaker wants\". \n\nIs this really a good way to understand a play? I understand that in any one particular scene, each character will have something they trying to achieve, but in each particular line? I'm thinking of my favorite play, Long Day's Journey into Night. In Act IV, Edmund has a lengthy monologue where he describes to his father some of the high points of his life. He details a moment on a ship when he experiences a kind of 'ego-death' (or at least, that was my interpretation). I always thought this speech served more to characterize Edmund, rather than achieve some kind of goal.\n\nIn Playwriting: The Merciless Craft, Carol Wolf writes \"Every actor, at every moment in a scene, asks himself 'What does my character want at this very moment?'\" \n\nIsn't it possible that some lines or parts of a play function simply to reveal info about the characters or advance the plot? Does every little line really express some kind of desire?",
        "created_utc": 1420588558,
        "upvote_ratio": ""
    },
    {
        "title": "Searching for resources: the trilogy structure in (children's) literature",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/2rk6s7/searching_for_resources_the_trilogy_structure_in/",
        "text": "Okay, so I'm doing some research on seriality, but less in the Victorian-periodicals or TV-episodes sense, and more in the there-will-be-three-books-no-more-no-less kind of way.\n\nI'd like to get some background on what people have said about trilogies in terms of their unique narrative structure, but the sources I'm coming up with (on an admittedly short search, so far) have been about *film* trilogies or the aforementioned Victorian serials.\n\nAny ideas?\n\nThanks!",
        "created_utc": 1420582389,
        "upvote_ratio": ""
    }
]