[
    {
        "title": "Do you agree with Nabokov when he said Gogol's Ukrainian stories are \"worthless\"?",
        "author": "coffiecup24",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11t7ki1/do_you_agree_with_nabokov_when_he_said_gogols/",
        "text": "Why/why not?",
        "created_utc": 1679003798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aside from the 5-7-5 schema, what is a haiku?",
        "author": "lappel__du__vide",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11t6d3s/aside_from_the_575_schema_what_is_a_haiku/",
        "text": "I’m familiar with the haiku as a concept, but I’ve never understood it. As it was taught to me, the only essential quality of the haiku, what formally separates it from any other three line phrase, is the 5-7-5 syllabic arrangement, but why is that? Unlike poetic meter or rhyming scheme or genre, because of the extreme generality of the 5-7-5 arrangement there seems to be no aesthetic similarities between haiku taken as a whole in the same way that there is for dactylic hexameter or the sonnet or the elegy or the Chinese sanqu. Is there some significance to the syllabic scheme of haiku in Japan that has been lost in translation, is there more to the traditional Japanese haiku than 5-7-5 arrangement that has been simplified away or it is truly just an arbitrary form?",
        "created_utc": 1679000971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help for Dissertation",
        "author": "Turbulent_Record_459",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11svy4a/help_for_dissertation/",
        "text": "Dear all,\n\nI am currently writing my master's thesis. I have collected several sources, drawn an outline, and selected numerous quotes. I should be able to write my final paper.... but I am experiencing writer's block. No matter how hard I try, I cannot find satisfaction in the sentences that I create; everything seems clumsy. I have not felt such dispair in the past and it's quite depressing.\n\nMy thesis is about Sylvia Plath's *The Bell Jar* and Ottessa Moshfegh's *Eileen*. I intend to demonstrate that the autobiographic qualities of both novels are not the byproduct of therapeutic writing, but the result of deliberate choices. By modelling their work on their lived experiences, Plath and Moshfegh place themselves in a long tradition of women writers who have used this strategy to claim discursive authority. \n\nI have decided to dedicate my chapters to the following topics: the relation between women's fiction and autobiography, food, and sexuality. The first chapter provides the theoretical knowledge on which my thesis is build, namely the androcentricity of Western culture. The subsequent sections of this chapter pertains to Plath and Moshfegh.\n\nThe chapter dedicated to food is twofold. Firstly, it explores the preparation of food in terms of gender roles. Secondly, it investigates both protagonist's eating disorders as a refusal of traditional, restrictive femininity.\n\nThe third chapter focuses on sexuality, and more particularly on Esther and Eileen's ambivalence towards it. Both heroines alternate between prudeness and intense lust. Their shifting desires are symptomatic of patriarchal oppression; women are either saints or prostitutes. \n\nHere are the requests I have, if you could be so kind as to help me:\n\n* How can I overcome writer's block? \n* How can I avoid akward, unelegant sentences when comparing two novels? (I would appreciate any  examples of sentences...)\n* Does my project seem coherent?",
        "created_utc": 1678977437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beyond the 5-7-5 syllabic scheme, what is a haiku?",
        "author": "Ubu__roi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11str79/beyond_the_575_syllabic_scheme_what_is_a_haiku/",
        "text": "[removed]",
        "created_utc": 1678972264,
        "upvote_ratio": 1.0
    },
    {
        "title": "W. H. Auden’s “O Where Are You Going”/“The Three Companions” - some questions",
        "author": "backintomybliss17",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11rk2lz/w_h_audens_o_where_are_you_goingthe_three/",
        "text": "Below is a poem by W. H. Auden called “O Where Are You Going” or “The Three Companions”:\n\n——————————————————————————\n\n\"O where are you going?\" said reader to rider,\n\"That valley is fatal where furnaces burn,\nYonder's the midden whose odours will madden,\nThat gap is the grave where the tall return.\"\n\n\"O do you imagine,\" said fearer to farer,\n\"That dusk will delay on your path to the pass,\nYour diligent looking discover the lacking\nYour footsteps feel from granite to grass?\"\n\n\"O what was that bird,\" said horror to hearer,\n\"Did you see that shape in the twisted trees?\nBehind you swiftly the figure comes softly,\nThe spot on your skin is a shocking disease.\"\n\n\"Out of this house\"---said rider to reader,\n\"Yours never will\"---said farer to fearer.\n\"They're looking for you\"---said hearer to horror,\nAs he left them there, as he left them there.\n\n—————————————————————————-\n\nI have the following questions on this poem:\n\n1. What does the line “That gap is the grave where the tall return” mean? I presume “tall” means bold or courageous here. Is the place so dangerous that even bold people turn back from there or do the (foolishly) bold die there?\n2. What does the line “Your footsteps feel from granite to grass” mean?\n3. Why would the bird and mysterious figures be looking for “horror”?\n4. This essay (c-j-l-c.org/portfolio/playing-with-fire/) describes the poem as “satirical heroic”. What in the poem suggests satire?",
        "created_utc": 1678849005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Admissions Season! Where ya headed? What for! Share you good news! Alternately: Share your bad news—",
        "author": "amishius",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11rhakw/admissions_season_where_ya_headed_what_for_share/",
        "text": "We've all been there! Grad admissions are a nightmare. On the days it's great, it's the best. On the days you get rejections...well...\n\nShare what you're up to, where you're headed, or if not— come for the sympathy. We've all been there, BELIEVE ME.\n\nTo those of you accepted and making decisions— how can we help?\n\nTo those of you not heading anywhere due to a bad application season, we're here to talk you through it, so have at!\n\nBest wishes\nAmishius",
        "created_utc": 1678842545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uk Crit Theory PhD or Literature PhD",
        "author": "tiqqunist",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11qugpu/uk_crit_theory_phd_or_literature_phd/",
        "text": "Which is the best option for employability post phd earned?\n\nAlso which is more respectable?\nI am a 3 times published poet and Theological Studies MA student currently, I am debating enrolling in an Theory MA if I don’t get into a PhD straight out.\n\nPlease advise. Bless.\nAlso is English major dying? I am out of the loop.",
        "created_utc": 1678762078,
        "upvote_ratio": 1.0
    },
    {
        "title": "History of the concept of prose (versus poetry)",
        "author": "themis_in_disorder",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11qe6iz/history_of_the_concept_of_prose_versus_poetry/",
        "text": "Hello!\n\nCan anyone recommend me a good introduction to the historical distinction between prose and poetry? I'm reading about the history of Art, and the Fine Arts, and Poetry is basically always included in the discussions (ancient greece, middle ages, renaissance etc.), to the exclusion of \"literature\" in general, or perhaps \"prose\" in particular. Is this a fair assessment, or am I missing something?",
        "created_utc": 1678724642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which character in ‘An Inspector calls’ has the most lines?",
        "author": "SignificanceOpen4935",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11pimkc/which_character_in_an_inspector_calls_has_the/",
        "text": "Sorry if this doesn’t fit the sub but I was wondering and Google didn’t turn anything up",
        "created_utc": 1678638309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing like (and for) a Japanese author but in English",
        "author": "Notamugokai",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11pcbv0/writing_like_and_for_a_japanese_author_but_in/",
        "text": "Initially I wanted my English work to be easily machine translated into Japanese (for a collab). I still want it to be easily translated, but now I want it to be also good enough to be read in English.\n\nMoreover I also want it to feel like it was translated from Japanese as the original language. Both are not incompatible, on the contrary.\n\nIn this line, I used to heavily mention the names in dialogues instead of the “you” pronoun, as I understood this is how it goes in Japanese, but this was too much and was driving some readers crazy, so I tuned it down a lot. Maybe it was a silly idea from the start, I don’t know.\n\nI keep some local expressions that do not translate well with our westerners habits, the usual “Onee-chan” to refer to the elder sister, and the likes. This seems to be fine.\n\nMaybe I should ask their opinion to professional English-Japanese translators?\n\nAnyway, here I’m asking your opinion about this dual goal, your guidance (any ideas to make it work) and some pointers as to where I could look.\n\nThank you! 🙏",
        "created_utc": 1678620474,
        "upvote_ratio": 1.0
    },
    {
        "title": "From MADAME BOVARY: \"So he gave up the flute exalted sentiment, the imagination.\"",
        "author": "thegeorgianwelshman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11p7b2v/from_madame_bovary_so_he_gave_up_the_flute/",
        "text": "So I'm reading MADAME BOVARY for the first time. And in part three, chapter six, when Leon is thinking of ending things with Emma--- thanks in part to an anonymous letter of warning, the disapprobation of his mother, and his own annoyance with the affair---there is this peculiar line that I can't quite figure out.\n\n\"So he gave up the flute exalted sentiment, the imagination.\"\n\nThis is in the same paragraph with the wonderful sentence: \". . . every notary carries about inside him the debris of a poet.\"\n\nThe paragraph is describing how Leon is beginning to realize that it would be best for him now to put aside his wild passionate affair with the doomed Emma, to nurture his sobriety and seriousness in order to preserve his standing in society and his future. \n\nBut the flute sentence is confusing to me. \n\nIs \"flute\" a euphemism?\n\nIs it an idiom that French readers of the 19th century would get?\n\nIs it merely figurative, and if so is it a reference that modern French readers are familiar with? Is it only thick American readers like me who stumble on this phrase?\n\nDoes the sentence itself provide its own explanation? Does \"exalted sentiment, the imagination\" provide the definition of the metaphoric \"flute?\"\n\nHelp a dummy understand.",
        "created_utc": 1678602046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not a recommendation thread, rather: what key words, search terms, resources, ratings, lists, forums, etc. could I use to more consistently find discussions of the more baroque, dense, ornate, stained-glass-rather-than-window, maximalist kinds of prose stylists?",
        "author": "Eihabu",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11o6kxu/not_a_recommendation_thread_rather_what_key_words/",
        "text": "Currently, I don’t know of any method besides posting and searching around constantly for “who writes like Faulkner/Pynchon/Peake\" and relying on the randoms scrolling past that day to toss out some recommendations. But there are so many people out there whose tastes run this way—there have to be more consistent resources available out there, no? I wish, among other things, I had a way to “set it and forget it;” as in, subscribe to an RSS feed and know that I’d be notified when a writer who’s being tagged this way puts something out. Of course, any resources devoted to hidden gems, or discussions of the Jameses and Prousts of the classic world, would be awesome too!",
        "created_utc": 1678496685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading Guide for Elliot's Wasteland?",
        "author": "oihfoisdf",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11nlvjr/reading_guide_for_elliots_wasteland/",
        "text": "I want to be able to appreciate the poem more deeply. Any suggestions on a reading guide or secondary sources?",
        "created_utc": 1678445517,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between paper presentation and poster presentation?",
        "author": "UniqueSandwich9972",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11n50xd/what_is_the_difference_between_paper_presentation/",
        "text": "Is there any difference between paper presentation and poster presentation in terms of the weight it adds to the CV?",
        "created_utc": 1678398751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendations for Literary Theory and Criticism",
        "author": "Sherry_G99",
        "url": "/r/Indian_Academia/comments/11mwpqv/book_recommendations_for_literary_theory_and/",
        "text": "",
        "created_utc": 1678381523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master's thesis recommendation",
        "author": "OtherwiseCall5817",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11mul7y/masters_thesis_recommendation/",
        "text": "I'm doing a masters in European literature and culture (specifically Italian, but also some French, German, English) and I am supposed to choose a topic that relates to Italian literature, or ties it to some other literature of the aforementioned languages. The thing is I am all out of ideas and I have no specific niche interests in this field because I am new to it (I did my bachelor's in languages and translation and barely ever studied any literature) so I am completely lost. \n\nPlease note that I do realize this is a ridiculous request. However I saw some interesting people on this sub and maybe one would actually be willing to give me a hint towards a specific researchable topic. I am mostly interested in modern Italian literature (e.g. Neorealismo) also because it's much more readable for a foreigner like me than, say, Dante or Boccaccio. Then again, Dante is interesting enough for me to sacrifice some of my sanity, so if you have anything on him, go ahead and say it. \n\nI would appreciate ANY kind of help",
        "created_utc": 1678374525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Citing lines of poetry in MLA format",
        "author": "jasperleopard",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11mu9mp/citing_lines_of_poetry_in_mla_format/",
        "text": "I have a quick question about MLA formatting. Please see below:\n\n&gt;Eliot's poem evokes the tropish relationship between springtime and romance: \"Memory and desire, stirring / Dull roots with spring rain.\" (Eliot, lines 3-4) \n\nIs that not MLA format? Is there some grave error in that in-text citation that does not align with MLA guidelines? I'd appreciate guidance.",
        "created_utc": 1678373775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain Yeats Gyer Theory and how it's related to Achebe's \"Things Fall Apart\"?",
        "author": "UniqueSandwich9972",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11mu7m5/can_anyone_explain_yeats_gyer_theory_and_how_its/",
        "text": "This is not for my homework. I have a test in a few days and I cannot seem to grasp the idea of gyre theory. Any help would be highly appreciated.\n\n\nThank you",
        "created_utc": 1678373642,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get started in feminist literary theory and criticism?",
        "author": "Tsundoku-San",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11mt3qt/how_can_i_get_started_in_feminist_literary_theory/",
        "text": "There seem to be quite a lot of introductions to and readers for feminist literary theory and criticism. Below are a few examples that I have found (in no specific order):\n\n* *Making a Difference: Feminist Literary Criticism* by Gayle Greene and Coppélia Kahn (1986),\n* *Feminist Literary Theory: A Reader*, edited by Mary Eagleton (1986; third edition 2010),\n* *A Readers Guide to Contemporary Feminist Literary Criticism* by Maggie Humm (1994),\n* *The Cambridge Companion to Feminist Literary Theory*, edited by Ellen Rooney (2010),\n* *Feminisms Redux: An Anthology of Literary Theory and Criticism*, edited by Robyn Price Herndl and Diane Warhol-Down (2009).\n\nI don't know whether any of these are a good place to start. And I don't know whether I should read a more general introduction to feminism (i.e. one not specifically focusing on literature) first. \n\nDo you have any recommendations for getting started?\n\n(I don't need general introductions to literary theory; I already have plenty of those ;-) )",
        "created_utc": 1678370851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me understand Dickinson",
        "author": "koutouzoff",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11ltfj1/help_me_understand_dickinson/",
        "text": "Hello everyone. English is my third language so I'm not very comfortable with this poem. The way I understand is that the word \"whim\" is about the mother's smile but I also think it may be like the mother is smiling \"at the whims of her family\".  Thank you all in advance &lt;3 \n\n&amp;#x200B;\n\n If Nature smiles -- the Mother must  \nI'm sure, at many a whim  \nOf Her eccentric Family --  \nIs She so much to blame?",
        "created_utc": 1678273293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contemporary Feminist&amp; Gender Equality Works",
        "author": "svartoggront",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11kxro2/contemporary_feminist_gender_equality_works/",
        "text": "Hi everyone, I'm trying to get more into Feminists works which are written in 21st century. I'm familiar with old works, since we look through them during class. However, my prof. does not suggest us any current works and I'm more interested in them tbh. Please let me know if you have any fav work, it can be both about feminism and gender inequality issues. Thank you :)",
        "created_utc": 1678191353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Genereal workflow in analyzing and interpreting literature",
        "author": "derinderhd",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11kvtgn/genereal_workflow_in_analyzing_and_interpreting/",
        "text": "Hi everyone,\n\n&amp;#x200B;\n\nI will soon have my final exam about feminism in english literature. I chose the topic myself because I am very interested in it and like to discuss it in my friend group. \n\n&amp;#x200B;\n\nI have no idea where to start. I will work through the books and LitChart/SuperSummary stuff but apart from that I am a total noob in literature. In 5 years of studying English to become a teacher in Germany I never really figured out what the hell I am supposed to do with literature apart from reading it and trying to understand it. I am currently looking for ressources that might help me to figure out what to do. \n\n&amp;#x200B;\n\nI will be very free in what I want to talk about. But apart from the plot I dont really know what to talk about. Even if I am curious about something and think about it for a long time no one cares because it always has to be linked to secondary literature as far as I know. For example when I start talking about oppression of women in the past (based on the texts that I read) I need background info to support what I am saying like authors commenting on the text or other works from that time that highlight what I want to point out. But how do I get this background info? \n\n  \nTLDR: I have to come up with stuff to talk about besides the plot of the texts. How can I figure out what to talk about and how can I back that stuff up with sources and secondary literature? What does your work flow look like when approaching a topic like this?",
        "created_utc": 1678185567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Horror in Internet culture",
        "author": "Make_ThinkAD1966",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11kcc76/horror_in_internet_culture/",
        "text": "I've been thinking a lot lately about the genre of 'online horror' and how it seems to be on the verge of a change.  The 'spooky GIF' and the Creepy Pasta forms are, I feel, on their way out.   So if online horror is about to change, what form do you think horror itself is going to take?",
        "created_utc": 1678133281,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between literary theory and literary criticism? I can't figure it out",
        "author": "datfreeman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11k3ghs/whats_the_difference_between_literary_theory_and/",
        "text": " Can you be as accurate as possible? \n\nI keep reading that the only difference is the dichotomy between the theoretical framework and practical application, but at the same time I find texts which trace a much more marked division between them: for example, some make the theory of literature match the period from the sixties to the end of the seventies, stating that with the death of the major exponents of that period (Foucalt, Lacan, Barthes) the theory goes out of fashion, returning to one state of anti-theory characterized by conversation and ideology. \n\nCan you help me?",
        "created_utc": 1678120076,
        "upvote_ratio": 1.0
    },
    {
        "title": "The legacy of the nouveau roman in English?",
        "author": "tegeus-Cromis_2000",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11k26xu/the_legacy_of_the_nouveau_roman_in_english/",
        "text": "I've been thinking about the *nouveau roman* recently. As far as I can tell, there have been two distinct phases of its influence on English-language literature. The first and more focused one took place in the '60s and early '70s and included writers like Ann Quin, B.S. Johnson, Christine Brooke-Rose, Susan Sontag, Robert Coover, etc. This is partly covered (for the UK) in Adam Guy's *The nouveau roman and Writing in Britain After Modernism* (2019). However, a second and more diffuse phase can be found in writers strongly influenced by the *nouveau roman* since the '80s. These would include Lydia Davis (who wrote her undergraduate thesis on the NR), Paul Auster, Nicholson Baker, and Tom McCarthy. \n\nTwo questions: is there any study on this second phase, either focusing on the influence of the NR on an individual writer, or a more synthetic view of such influences? And secondly, are there any other writers you would include in this second phase along with the four I mentioned? \n\nTo get things started, I can see a fainter but still distinct influence in a writer like Siri Hustvedt, where however we can sense a kind of \"renaturalization\" of NR conventions, probably as a result of the exigencies and pressures of the American publishing industry. (And of course the biographical connections of Davis, Auster, and Hustvedt are also a factor here.) This would lead to even more diffuse influence in something like Ottessa Moshfegh's *My Year of Rest and Relaxation*, where, while the influence of people like Auster and Hustvedt seems pretty clear, I don't even know if there is a conscious awareness of the several generations deep legacy of the NR. But it's particularly this kind of diffusion / dilution that I'm curious about. \n\nTIA.",
        "created_utc": 1678117238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationship between the titular poem and the rest of the collection",
        "author": "Lilacoranges",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11jxypr/relationship_between_the_titular_poem_and_the/",
        "text": "Some poetry collections contain a poem with the same title as the collection itself. One example is the collection Fadensonnen by Paul Celan that contains a poem also called Fadensonnen. \n\nDoes anyone know of any papers or books dealing with the relationship between the titular poem and the rest of the poetry collection?",
        "created_utc": 1678106803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literary theorists on readers diagnosing characters in literature?",
        "author": "Grandpies",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11jq2wq/literary_theorists_on_readers_diagnosing/",
        "text": "Honestly this is partially prompted by a recent post. But this is something that's been on my mind since my undergrad in English.\n\nTo preface my question, I'm not entirely comfortable with the way popular discourse approaches discussions of mental health and disability in literature. For one thing, I think the conversation seems to begin and end with diagnosing the characters which isn't entirely productive. Mental illness and disability are socially defined in my view, so just making the case that a character is depressed without going on to explain why that matters seems a little essentialist to me...\n\nSo my question is: should I just read more Foucault, or are there literary theorists who talk about the specific ways that you can go about analyzing or even diagnosing mental illness and disability in literature?",
        "created_utc": 1678082093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Early Twentieth Century Pop Fiction, Female Action Heroes, and Societal Attitudes towards Gender Roles?",
        "author": "z112",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11jhed9/early_twentieth_century_pop_fiction_female_action/",
        "text": "Apologies if this question is a bit out of bounds for this sub or focuses on, for lack of a better term, low-brow material. I've been curious as to why the early twentieth century, mainly 1920s-1940s pop action fiction in America, started having action heroines, i.e., female heroic characters engaging in combat as well physical fights/gun fights. For example, in the 1920s, the first written Buck Rogers story has female soldiers, not to mention plenty of pulp fiction heroines and early comic book superheroines. I'm trying to figure out why did early twentieth-century American writers start writing about these characters when nineteenth-century writers rarely, if ever, did? What changed in American society or pop culture at this type to instigate the emergence of these types of characters during this time period? Any information, theories, or resources would be appreciated.",
        "created_utc": 1678058595,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you rate each of these movie premises out of 10 and why?",
        "author": "SIDJFOSIJFOSIDFJOISD",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11jd6ry/how_would_you_rate_each_of_these_movie_premises/",
        "text": "How would you rate each of these movie premises out of 10 and why?\n\n&gt; **Somewhere with Elephants** [R] (Comedy) (Drama)\n\n&gt; Three estranged brothers have two days to drive their autistic younger brother across the country to their mother's funeral and break the news to him of her passing.\n\n&gt; **Shelby Oaks** [R] (Horror) (Drama)\n\n&gt; A woman's desperate search for her long-lost sister falls into obsession upon realizing that the imaginary demon from their childhood may have been real.\n\n&gt; **Anthology** [R] (Fantasy) (Adventure) (Mystery) (Drama)\n\n&gt; An ordinary teenage girl adventures through a surreal landscape of scenes from classic poems to solve a mysterious message they form revealing a hidden evil within her.",
        "created_utc": 1678049182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good online English translation of Boccaccio's Decameron",
        "author": "kevinonze",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11i9u1a/good_online_english_translation_of_boccaccios/",
        "text": "I'm hoping to have some senior undergrads read Story 2 from Day VII for a class, but the free online versions I have found are not great for teaching. The websites are either too busy, or the translation is antiquated. \nAs a modernist who doesn't normally delve into medieval literature, I'd be very grateful for some pointers from those in the know.",
        "created_utc": 1677956054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autism in old literature",
        "author": "coffiecup24",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11i8q0o/autism_in_old_literature/",
        "text": "Are there any autistic characters in old books? (even if the term \"autism\" is not used)",
        "created_utc": 1677953442,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you characterise Heaney as a poet?",
        "author": "sheephamlet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11hg0sl/how_would_you_characterise_heaney_as_a_poet/",
        "text": "I am writing notes on Heaney at the moment and, while reductionist, I want an epithet to describe his poetic style. I was thinking pastoral poet but this might be too limiting. Historical poet fits but again it doesn’t quite capture all his themes or style. \n\nOther poets such as Plath, for example could be comfortably branded as a confessional poet while John Donne could be called a metaphysical poet. What then is the best or most accurate way to label Heaney?",
        "created_utc": 1677880051,
        "upvote_ratio": 1.0
    },
    {
        "title": "The End of the English Major",
        "author": "mistyblackbird",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11h86qp/the_end_of_the_english_major/",
        "text": "Did anyone else read that New Yorker article? What did you think? I found these lines to be unfortunately rather accurate:\n\n“Some scholars observe that, in classrooms today, the initial gesture of criticism can seem to carry more prestige than the long pursuit of understanding. One literature professor and critic at Harvard—not old or white or male—noticed that it had become more publicly rewarding for students to critique something as “problematic” than to grapple with what the problems might be; they seemed to have found that merely naming concerns had more value, in today’s cultural marketplace, than curiosity about what underlay them. This clay-pigeon approach to inquiry struck her as a devaluation of all that criticism—and art—can do.”\n\n[The End of the English Major](https://www.newyorker.com/magazine/2023/03/06/the-end-of-the-english-major)",
        "created_utc": 1677865455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources on theories of aesthetics being applied to political practices",
        "author": "SecurityMammoth",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11grq69/resources_on_theories_of_aesthetics_being_applied/",
        "text": "Writing my dissertation on Nabokov and finally settled on a topic. I want to find out what kind of politics could potentially emerge from his aesthetics, from his views on art and literature. Any resources that discuss the connection between, and potential convergence of, politics and aesthetics would be very helpful, particularly any resources focused on modernist writing.",
        "created_utc": 1677819292,
        "upvote_ratio": 1.0
    },
    {
        "title": "How TF am I supposed to read Tristram Shandy?",
        "author": "artisticpineapple12",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11gfoy1/how_tf_am_i_supposed_to_read_tristram_shandy/",
        "text": "It's like... a smart person's book.",
        "created_utc": 1677794527,
        "upvote_ratio": 1.0
    },
    {
        "title": "French-English relations in poetry - French",
        "author": "-PolarDeer-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11gbnqg/frenchenglish_relations_in_poetry_french/",
        "text": "I am a student working on a research project exploring the themes of French-English relations in Canada through poetry. I was hoping someone might be able to recommend some French poems that reflect these issues.\n\nI am particularly interested in poems that explore the complexities of the relationship between French and English speakers in Canada, as well as those that reflect on the unique cultural identity of French Canadians. Any poems that touch on the history of French-English relations in Canada would also be appreciated.\n\nSo if you have any suggestions for poems or poets I should look into, I would be grateful for your recommendations!",
        "created_utc": 1677785682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples in books/film/television where characters use psychoactive drugs (Weed, LSD, Psilocybin) and become 'better people?'",
        "author": "halle42017",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11g84tk/examples_in_booksfilmtelevision_where_characters/",
        "text": "Hello everyone! I am doing a research project on cultural depictions of substance users and \"addicts,\" and I would like to utilize book/ film/ television examples that show characters going on a journey of self-reflection due to using cannabis, psilocybin, LSD, DMT, etc. Please let me know of any examples you like or dislike if you can think of some!\n\nthank you (: &lt;3",
        "created_utc": 1677777206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for someone interested in telling me about his or her dissertation topics so I can learn more, general knowledge-wise",
        "author": "HastyWriting",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11g10h6/looking_for_someone_interested_in_telling_me/",
        "text": "Hello,\n\nI (26M, GMT+1) am French and I am studying French literature (I would like to become a teacher). I do not know whether I can ask it here or not (sorry if that is not the right place): I would be looking for someone studying literature too to learn more about his or her specialization. \n\nHearing dissertation topics in literature summed up helps me learn more general knowledge-wise. I think any literature field would be interesting.\n\nI could also talk in return about my dissertation topic, it will be interesting for me, like a way to try summing up in an efficient way what I am working on. We could talk about that but also other things, basically we could become a type of literary-oriented penpals, and study at the same time remotely to get motivated.\n\nThanks in advance for your answer",
        "created_utc": 1677758409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is The Nibelungenlied formatted this way (verses that are split into two columns)?",
        "author": "BobRobot77",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11fy1wd/why_is_the_nibelungenlied_formatted_this_way/",
        "text": "Hello, I became aware of this German epic poem titled The Nibelungenlied. It’s apparently split into [two columns](https://commons.wikimedia.org/wiki/File:Nibelungenlied.jpg) and the [verse translation](https://ibb.co/XDc67jd) by Burton Raffel has kept this aspect. It’s not like you read one column entirely and then continue with the other. It works like this: You read one verse from the right column and then one from the left column. When I saw the preview for the Raffel translation I thought the digital text was simply poorly formatted but later I realized that the original was similar. Now, excuse my ignorance but I had never quite read anything like that.\n\nI suppose my question is: Was there a purpose or reason for this? Or was this just the standard format back in the day?",
        "created_utc": 1677747782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any sort of genre of literature consisting of the description of paintings or images?",
        "author": "Shintuku1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11fpfga/is_there_any_sort_of_genre_of_literature/",
        "text": " I'd like to learn how to better write physical descriptions, in particular, of architectural features and interiors, but I'd like to develop this ability in general. I was wondering, is there any genre of literature that focuses around describing paintings or pictures, or any place where I could find very extensive descriptions of images or paintings?",
        "created_utc": 1677722231,
        "upvote_ratio": 1.0
    },
    {
        "title": "What in the world is the limit?",
        "author": "Baahubali321",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11fmfd8/what_in_the_world_is_the_limit/",
        "text": "In AS Lit class today, we were doing Atonement and we were analysing a section with a description of a statue of Triton, the Greek god. A student in our class linked Triton to mermaids, then to the Odyssey, then to the Ulysses(off brand roman version) and then finally to Ulysses, by James Joyce. He then talked about how it was highlighting war. \n\nMy question is this: Is there a limit on how much mental gymnastics I have to do to make connections in an essay and end with a conclusion? Otherwise, I could talk about how the “iridescent green” of the statue reminds me of Harry Potter’s green eyes which links to trains which links to the Demon Slayer movie: Mugen Train which connects to Rengoku and how in the end, it symbolises tenacity and the willingness to keep fighting, even if you lose.",
        "created_utc": 1677714739,
        "upvote_ratio": 1.0
    },
    {
        "title": "good critique of Propp's morphology?",
        "author": "futurus196",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11f8g2g/good_critique_of_propps_morphology/",
        "text": "Hi all, do any of you have good recommendations of scholarly articles or books that offer compelling but constructive critiques of Propp's morphological approach to myth and folktales?\n\nThank you in advance!",
        "created_utc": 1677688788,
        "upvote_ratio": 1.0
    },
    {
        "title": "DH/Tech",
        "author": "yesgirlsplaydnd",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11eo705/dhtech/",
        "text": "Hello! I'm a new PhD English student and I'm starting work on a book list for my thesis. I haven't zeroed in on a field so far so I want to read as much as I can about DH--about technology, humanities, and the intersections between the two. My PhD is (probably) going to be an intersection of DH, gaming, and identities. Please suggest important books to read, as well as digital projects, journals, or anything, really. Seminal texts, specific ones, and anything you feel is important reading will do!\nThanks so much already!!",
        "created_utc": 1677628552,
        "upvote_ratio": 0.76
    },
    {
        "title": "What if all books are bad?",
        "author": "artisticpineapple12",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11em027/what_if_all_books_are_bad/",
        "text": "What if all books are bad and we just haven't had a good book yet but it will be wrote in the future and it will be good and make all the pervious literature bad literature and only one good book?",
        "created_utc": 1677623186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a list of books that could sufficiently replace a bachelor's degree in literature? I understand that college gives you the experience of speaking to others - but I wonder if there is a list of books that could sufficiently be degree equivalent?",
        "author": "Isatis_tinctoria",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11egcjr/is_there_a_list_of_books_that_could_sufficiently/",
        "text": "Is there a list of books that could sufficiently replace a bachelor's degree in some subjects such as literature? I understand that college gives you the experience of speaking to others - but I wonder if there is a list of books that could sufficiently be degree equivalent?\n\nWhich books would qualify as 50-100 books for a literature degree?",
        "created_utc": 1677609920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inquiry about peer review",
        "author": "jasperleopard",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11ef7jn/inquiry_about_peer_review/",
        "text": "Hello,\n\nI kindly ask that I am not ridiculed for asking this question. I have always used JSTOR for every assignment requiring secondary scholarship, and assumed every article on there was suitable. The work I'm completing uses the phrase \"peer reviewed\" – I am not certain what that means, and I can't adequately touch base with anyone in my program due to quarantine. So, r/AskLiteraryStudies, I am asking you for input. I need to find a peer reviewed article on a specific subject, so I went to JSTOR and found several suitable articles. However, none of the journals that published the articles identified whether or not they were peer reviewed. [I reviewed these guidelines,](https://guides.library.oregonstate.edu/c.php?g=285842&amp;p=1906145) and did not find any indicator of a journal/its articles being peer reviewed in my selections. I did not use the tool in the second half of that resource, because I wanted to reach out for assistance prior to taking further action. I feel like I am misunderstanding something incredibly integral to remainder of my academic career – are all journals on JSTOR peer reviewed as a standard, or am I looking in the wrong place or misunderstanding what peer review means altogether? As I said, I sincerely hope I am not ridiculed for this question and I appreciate any assistance. \n\nThanks,\n\n/u/jasperleopard",
        "created_utc": 1677607174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a ancient Latin script converter",
        "author": "assass123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11d4jl0/looking_for_a_ancient_latin_script_converter/",
        "text": "So I found this ([**https://omniglot.com/images/writing/latin\\_archaic.gif**](https://omniglot.com/images/writing/latin_archaic.gif)**)** and id like to be able to just paste stuff into a generator and convert it (Im working on a 3d model and i want to have old latin script lining some things)",
        "created_utc": 1677478387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Know of any highly annotated editions of the Iliad?",
        "author": "jckalman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11czlpt/know_of_any_highly_annotated_editions_of_the_iliad/",
        "text": "Akin to Singleton's Divine Comedy or Alter's Hebrew Bible. An edition where the annotations are longer than the work itself.",
        "created_utc": 1677462940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite literary (theory) journals?",
        "author": "Hungry-Narwhal-1091",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11cthat/favorite_literary_theory_journals/",
        "text": "",
        "created_utc": 1677447389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of short stories with a few specific devices",
        "author": "kevinonze",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11cqjha/examples_of_short_stories_with_a_few_specific/",
        "text": "I'm looking for good teaching stories for a senior-level undergrad course on \"the short story.\" Specifically, I'm looking for stories to illustrate the following devices/techniques:\n1. Frame narrator(s). I'm especially interested in a short story with multiple frames.\n2. Unreliable narrator. Apart from \"The Tell-Tale Heart,\" that is.\n3. Backwards narrative. Like *Time's Arrow* but short. \n4. Second-person narrator. (Jamaica Kincaid's \"Girl\" is not a second-person narrative.)\n\nThanks!",
        "created_utc": 1677440531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for when an author purposefully adds empty symbolism that causes the reader to add its own meaning?",
        "author": "EMulsive_EMergency",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11couef/is_there_a_term_for_when_an_author_purposefully/",
        "text": "Dont know if i worded it right but basically you read an excerpt and its made in such a way that it feels symbolic for something else but cant quite make up what. You give it a meaning you feel makes sense and somehow you can ask the author what they meant by that and they say: “nothing. I made it look symbolic because i get a kick out of people trying to add meaning where there isn’t”?",
        "created_utc": 1677436456,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to start academic career, probably going to speedrun it; how do I not get overwhelmed with stress?",
        "author": "enby-grinning-soul",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11ckcqw/about_to_start_academic_career_probably_going_to/",
        "text": "Greetings,\n\nI'm basically in my last couple of semesters of undergraduate studies, and for various reasons (family problems, a general lack of other viable jobs due to neurodivergency, and plans to possibly immigrate) I'm hopefully going to be jumping into a MA in another country in Asia before starting a PHD in the US immediately after *that's* done. One of the reasons I'm taking a terminal master's degree to give me more time to further develop my research interests and make my doctoral applications more competitive in light of this fast-paced schedule, and I guess that if this won't suffice I could further delay my PhD by one or two years at most (although I really don't want to since that means I'll have to go home), but either way, preparing to put these plans in motion in the very near future is giving me a lot of stress. I don't know how well versed I should be in theory before I start grad school, and thinking of every critical or even literary text that I could make use of that I haven't read yet is making me queasy. \n\nWhat accentuates this is that I'm part of a subfield that's very rare in the Global North — Southeast Asian literature — and I feel a lot of pressure to achieve some impossibly high ideal of expertise in it in order to make myself stand out in the job market, which is leading me to do shit like attempting to learn too much Indonesian in a single setting or binge reading works of interest from the region without ever truly absorbing them. And since my specific research proposal (finding a Southeast Asian 'marvellous real') necessitates some degree of familiarity with Latin American literature as well, I'm additionally training myself to read relevant works in Spanish, which makes these preparations even *more* tiring. And this doesn't even include how I should also be doing related shit like learning about literary modernism or the novel as a form...\n\nDoes anybody have any feedback on how helpful or unhelpful my current mindset is this early on? How do I not drown myself in too much 'extracurricular' (for the moment) learning? Am I overestimating how much I'll need to know as a fresh graduate student, even up until the first few years of my doctorate?",
        "created_utc": 1677426397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most Accessible Book by Cormac McCarthy",
        "author": "jewmungie69",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11ck4ho/most_accessible_book_by_cormac_mccarthy/",
        "text": "I've been wanting to read Blood Meridian, but I know I'm not up to the challenge yet.\n\nSo I was wonder, does he have any novels that are more accessible to the average reader?\n\nThanks.",
        "created_utc": 1677425824,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the most prominent version of Dante's Divine Comedy in Victorian London? Was It Henry Wadsworth Longfellow's Translation?",
        "author": "joshwontshutup",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11chuhr/what_was_the_most_prominent_version_of_dantes/",
        "text": "\n\n\nI am writing a Victorian story inspired by Dante's Inferno. In choosing which version to read for the first time, I want to pick the one that Victorians would have been familiar with.\n\nWikipedia tells me that Longfellow's translation in 1867 was the main one for the new world, from America, but it also tells me that Henry Francis Cary's one released around 1805 was the standard one for England and required in schools.\n\nIf you are familiar with which version would be most popularly familiar among the Victorian people of the 1800s in England, please inform me.\n\nThe reason why I want to know which version is most well-known among the Victorians is because the characters in my story will be familiar with Inferno, so I want to know what that version would be.",
        "created_utc": 1677420054,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some theories that fall under close reading?",
        "author": "duke_of_august",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11c7wvm/what_are_some_theories_that_fall_under_close/",
        "text": "",
        "created_utc": 1677395083,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you keep up with the latest trends in literary theory and criticism?",
        "author": "shiny_alpaca",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11c6ac2/how_do_you_keep_up_with_the_latest_trends_in/",
        "text": "Whenever I'm in class I hear professors talk about how this this and this is a trending topic in literary criticism and how that specialized field is very popular these days. My question is how do people keep up with these things? I feel like I only ever know things cause my professors tell me about them in class. How do you keep up with up and coming literary theory or trends? Is there a secret club? A group chat I can join? What should I be looking for?",
        "created_utc": 1677389122,
        "upvote_ratio": 1.0
    },
    {
        "title": "rhetoric question",
        "author": "Average-ThrowerZz",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11btjwo/rhetoric_question/",
        "text": "hey all, I was assigned a rhetorical analysis essay by my AP lang teacher, basically we have to pick a movie speech and analyze the rhetorical devices employed throughout the picked speech. I wanted to do tony stark’s/iron man’s interview/statement in the first movie, it is relatively short and I need three rhetorical maneuvers in order to make a proper analysis per my teachers criteria, I have found 2 of which I could work with, and I’m trying to figure out if him saying outright “I am Iron Man” is a rhetorical maneuver which I could use, considering the purpose I have written is “to deter the audience from the belief Tony Stark is Iron Man”, how would I work that in with my purpose? Normally i’d ask my teacher but she can’t get back to me anytime soon.",
        "created_utc": 1677353756,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the process of publishing a Research Article in a Journal ?",
        "author": "chicken_khakenacho",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11bpbra/what_is_the_process_of_publishing_a_research/",
        "text": "I have tried to research on internet about publishing a paper/article on a Journal. But sadly i could not find anything. I was tiring and i stand at zero. I just couldnt make sense of anything. I need to publish atleast 5 papers for becoming an Assistant Professor. I know how to write and format them into MLA style but dont know what to do afterwards. Can anybody help me ? On how to find Journals and make a submission. What is the waiting time ? Also enlighten me on free and paid journals. Thanks.",
        "created_utc": 1677343317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phd in English Literature",
        "author": "Spiritual_Student_50",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11bli64/phd_in_english_literature/",
        "text": "I have no idea what I want to specialise in. I just know that I want to stay in academia (be a professor). So, what would be useful? What will get me a job? How does life work? \n\nP.S: Would really love helpful insights",
        "created_utc": 1677333128,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would anyone mind giving me input on my personal statement?",
        "author": "Ovid738",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11bjyhg/would_anyone_mind_giving_me_input_on_my_personal/",
        "text": "I’m applying for a MA in Comparative Literature. Having been out of university for a while I would hugely appreciate any input on my statement, especially since my undergrad was specifically English Lit. I know there are some highly talented academics here who could give me better insight than anywhere else. \n\nApologies if this counts as homework help- the whole statement is written - if so I will duly remove.",
        "created_utc": 1677328345,
        "upvote_ratio": 1.0
    },
    {
        "title": "khumar barabankvi Poetry | Ye Misra Nahi Hai Wazifa Mera Hai",
        "author": "PoetryFever",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11biwmg/khumar_barabankvi_poetry_ye_misra_nahi_hai_wazifa/",
        "text": "[removed]",
        "created_utc": 1677324706,
        "upvote_ratio": 1.0
    },
    {
        "title": "If do not is contracted as don't, why is whyn't not accepted as why not?",
        "author": "Girthymanblade",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11bewkv/if_do_not_is_contracted_as_dont_why_is_whynt_not/",
        "text": "",
        "created_utc": 1677309499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a stigma in lit studies towards people who get 3 degrees from one institution?",
        "author": "Grandpies",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11b8qb5/is_there_a_stigma_in_lit_studies_towards_people/",
        "text": "I'm guessing this varies between countries and disciplines, but I want to hear from this sub. \n\nIf you want to get a job as a professor in English, is it going to significantly hurt your chances if you received all of your degrees from the same institution? I've heard that it leads people to the assumption that you've come up in an intellectual echo chamber.\n\nDoes having a strong CV balance that out? Like if you have a bunch of publications under your belt by the time you're out and a lot of conferencing experience, does that help?\n\nIt's just that everything is so expensive and awful, I'm thinking about going for my PhD but the town I'm in is cheap and my friends are here.",
        "created_utc": 1677289836,
        "upvote_ratio": 1.0
    },
    {
        "title": "In canon criticism, is classical poetry criticized specifically? Maybe like poetry from textbooks, laureates, professors/teachers, or academy websites?",
        "author": "Spare_8056",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11ar3yb/in_canon_criticism_is_classical_poetry_criticized/",
        "text": "Maybe including a kind of current canon? Not with  stereotypes like instapoetry, but for what's in journals or public events now? or in the last decade or two?",
        "created_utc": 1677244436,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to read to learn English Romantics?",
        "author": "oihfoisdf",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11apfmo/what_to_read_to_learn_english_romantics/",
        "text": "I am not very hopeful about my Romantics instructor this semester but I want to learn this stuff thoroughly. Any tips, advices, articles, books?",
        "created_utc": 1677238928,
        "upvote_ratio": 1.0
    },
    {
        "title": "MA Thesis Poetics",
        "author": "DeadAlive-Angel",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11a446g/ma_thesis_poetics/",
        "text": "Hello everyone,\n\nI am working on poetics for my MA Thesis and I am honestly completely lost because I am new to everything and I know little about literature overall but I am motivated and ready to do all the readings it takes during my research. I need to provide a literary work or two and a theory based on which I'm going to develop my thesis.\n\nI would like for to  be insights  about interesting poetic theories that have to do with linguistics and I am open to suggestions if there is an interesting poet to recommend because I don't have a topic in mind themes wise I am interested in imagination good and evil and mysticism",
        "created_utc": 1677175135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cruising Utopia by Jose Esteban Munoz",
        "author": "mielcheveux2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/119i9dv/cruising_utopia_by_jose_esteban_munoz/",
        "text": "I’m taking an undergrad level queer theory course this term. I have to give a presentation on Cruising Utopia, in which I’m supposed to select a cultural object (a film, book, television show, work of art, cultural practice, performance, etc.) that illustrates a theoretical concept with the text. I was just wondering if anyone had any suggestions of objects that might pair well with the text? thanks in advance for any help or suggestions",
        "created_utc": 1677110200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flowers - Symbolic meaning",
        "author": "Sen_7",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/119i00k/flowers_symbolic_meaning/",
        "text": "Hi, In not really sure if this is the right subreddit,\nMy gf is a very intellectual and sentimental person, she has degree in literature and history, while Im a bot more pragmatic by nature.\n\nI want bring her some flowers, but I do not have vast knowledge about their literary meaning.\n\nI want bring her flowers of species and colours that convey the love, affection, longing.\n\nIf someone has any suggestions I would love to hear please ( I thought maybe since in Literature you analyse symbolics, some of you may know the right stuff)",
        "created_utc": 1677109483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research on the importance of literature for combatting climate change?",
        "author": "sonnet44",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11991ar/research_on_the_importance_of_literature_for/",
        "text": "Hi folks,\n\nI’m new to ecocriticism, and I was wondering if there was any articles or research on the importance of literary works in the environmental movement.",
        "created_utc": 1677094214,
        "upvote_ratio": 1.0
    },
    {
        "title": "realism",
        "author": "Human-Ad-7216",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/1196739/realism/",
        "text": "what was the difference between the realism of balzac and the one of flaubert",
        "created_utc": 1677088263,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am planning to apply to universities in Europe and USA for PhD, I am not sure how to go about the proposal though, could someone please share their PhD proposal with me? If you are comfortable with this, please DM me. I hope the request doesn't seem inappropriate",
        "author": "General-Marzipan2861",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/118gxg7/i_am_planning_to_apply_to_universities_in_europe/",
        "text": "",
        "created_utc": 1677018097,
        "upvote_ratio": 1.0
    },
    {
        "title": "The last day of a condemned man",
        "author": "omnidotus",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/118bwso/the_last_day_of_a_condemned_man/",
        "text": "In the 42nd chapter of the last day of a condemned man, It is his last dream, and an old lady shows up from a closet and he torments her with a candle under her chin, and my teacher told me that this is a reference, I kept looking and looking using english and French resources, but unfortunately didn't find anything. So if anyone can help direct me to some place or give me the reference that would be a life saver.",
        "created_utc": 1677003019,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help understanding the whaling chapters of Moby Dick",
        "author": "VirtualAd1109",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/117oadb/i_need_help_understanding_the_whaling_chapters_of/",
        "text": "(I'm not asking this for help with homework I swear; I'm reading this on my own and just want to understand it better.)\nSo, I'm 302 pages in out 492, and while I was absolutely loving the book up until around 250-270, even saying that I thought, if it continued like this, it'd become my favorite book of all time. However, I've begun to feel bored by it, the main reason being that the chapters dedicated solely to whaling are so abundant. I didn't mind them in the first half of the book because they felt like listening to someone talk about something their passionate about, which is always interesting. That being said, I feel like there's got to be more to those chapters than just someone being passionate, but I can't figure out what that would be. I looked it up and the internet told me that they were there to display the difference between Ahab and Ishmael: Ishmael attempting to reason with nature, with God, while Ahab responds with violence, and both in the end failing. \n\nSo, my questions are: is what the internet told me true or is that a misguided interpretation, and if so, what is your interpretation? Also, if what the internet told me is correct, why do you think it was necessary to go on and on about whaling, when, possibly, fewer chapters would have still accomplished this goal?\n\nI really want to love this book, and have up until recently, so I'm very open to being persuaded.\n\nAlso, feel free to \"spoil\" the book. One of the things that, usually, distinguishes good literature from bad is if spoilers ruin the book, at least in my opinion.",
        "created_utc": 1676936236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Master's versus post graduate certificate",
        "author": "NidhiOnATree",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/117fih8/masters_versus_post_graduate_certificate/",
        "text": "I'm at crossroads. I want to specialize in copywriting,\nhence I chose a post graduate certificate. But everyone\naround me is highly qualified academically and I'm\nbeing peer pressured into a generic MSc in Marketing\ndegree. This is in Canada btw. Does it make a\ndifference to employers if my degree has a master's in\nfront of it? I'm really nervous as I don't really want to do\na master's because I hate thesis work and prefer hands\non work instead. Any advice? It would really help!",
        "created_utc": 1676915471,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find the history of words?",
        "author": "spicyycornbread",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/116rt97/how_to_find_the_history_of_words/",
        "text": "Hi folks,\n\nI was reading an article a scholar named James Levernier wrote the other day that provoked the question in the title. There was a part of his article where he analyzed a poem by breaking down the history of a word: \n\n“Condemning those whose “scornful eye(s),” an image usually associated with intellectual insight and spiritual justice…Far from negative in its connotations, this image evokes suggestions of nobility and natural dignity, and it stands in marked contrast to the “diabolical” connotations which Christians sometimes linked with the color black. Within the context of Puritan typology, [Cf. Increase Mather’s An Essay for the Recording of Illustrious Providences], for example, Satan was called “the Prince of Darkness” or “the black man,” and things black were automatically considered “diabolic.” \n\nI was wondering how scholars go about researching the history of a word and applying it to analyses. I’ve also seen scholars research the root of a term to contextualize its use. But when I look up a word like “diabolic” in the Oxford English Dictionary, I don’t glean nearly as much information.\n\nHow can I learn more in-depth about words? For instance, if I suspect a word is rooted in religious language, how would I go about confirming this?",
        "created_utc": 1676850311,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some works about how a particular generation/school understood what good literature and/or a good writer is?",
        "author": "General-Marzipan2861",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/116rdso/what_are_some_works_about_how_a_particular/",
        "text": "I am looking diverse things: both Eliot's \"Tradition and Individual Talent\" and Bloom's criticism of his contemporaries using feminism, marxism etc and not focusing on artistic merit in their literary criticism are good examples of what I am looking for. Both of these can be considered \"conservative\"  but I would really appreciate more \"progressive\" perspectives. Anything works!  \nThanks!",
        "created_utc": 1676849217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absurdist literary theory",
        "author": "Wise-Kaleidoscope-70",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/115jq2x/absurdist_literary_theory/",
        "text": "Were there specific writers or texts that address the absurd in poetry or fiction? I'm familiar with Camus' idea of life being absurd, but I'm not sure I have come across absurdism as a form of literary criticism/theory. Can anyone provide some leads on this?",
        "created_utc": 1676739427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literary theories on Paranormal or Supernatural",
        "author": "jack_jack-a",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/115egs3/literary_theories_on_paranormal_or_supernatural/",
        "text": "We are writing a page about Chinese supernatural on historical novel and fictional writings. We looked into Freudian theory, magical realism, Siritualism etc but couldn't find anything close to what we we're looking for. Can anyone suggest any theory related to supernatural?",
        "created_utc": 1676724058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deconstructing masculinities – looking for methodological sources",
        "author": "notveryamused_",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/115053s/deconstructing_masculinities_looking_for/",
        "text": "I'm one obligatory conference short this semester;) and my supervisor just mailed me one on deconstructing masculinities, but with only this weekend to prepare an abstract that I'd have to send on Monday. I've got an early modernist text that I could interpret in this way but unfortunately I'm not very well-read in methodologies concerning masculinity studies.\n\nMy early approach is as follows: masculinity, while on the surface a strong category, is in fact an aporia, an impossible model to follow, since it's defined only by its antitheses, always in danger of slipping away with the smallest gesture. It's a promising approach to the novel I'm about to talk about, since its main theme is the fear of losing the inherited insignia of power bestowed on the protagonist, who goes down in a spiral of impossible tasks he undertakes.\n\nThe papers and books on hegemonic masculinities and some psychoanalytic stuff I've browsed through don't really seem to work well with this angle, perhaps you'd have something to recommend? Thanks in advance!",
        "created_utc": 1676674481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me find this short story by (I think) Colm Tóibín...",
        "author": "yourdadsboyfriend420",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/114zmqt/please_help_me_find_this_short_story_by_i_think/",
        "text": "I took an Irish literature course in college and we read a few short stories by Colm Tóibín. The one I'm trying to find (I'm almost positive it was by him) is about a gay man visiting his elderly grandmother (or mother). When the man enters the home/room, the elderly woman has her back turned and believes that it is her priest who has entered. As such, she begins to speak to the \"priest\" about her concerns for her gay son/grandson. Does this sound familiar to anyone?  I've scoured the internet as well as his index of short stories from The New Yorker, but I can't find it anywhere. Maybe I made it up....\n\nThank you for your help!",
        "created_utc": 1676673133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any extensive publication on narrative techniques, that establishes categories, descriptions and typical use cases of those (narrative techniques)?",
        "author": "No_Finish6157",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/114vsto/is_there_any_extensive_publication_on_narrative/",
        "text": "Greetings, literary studies :)\n\nI recently got into literary studies, being a student in philosophy, I felt like taking a detour into the realm of imagination and evocation. And it's quite refreshing :) Being a person that tends to think in classes and subclasses and hierarchies and graph-like structures, I am really having trouble to understand narrative techniques in a through sense.\n\nI understand many individual narrative techniques when I encounter them, I am also familiar with the sub-classes of symbolism, plot, stylistic device etc. But I only ever find explanations on some specific or a selected set of narrative techniques. I would like to learn more about the big picture: What do all narrative techniques share, what makes them a category? And by which means are sub-categories created? Which sub-categories are common? What are the usual ways those are used, and what are usually affects or effects they evoke or cause?\n\nI would be really grateful if someone could give me some directions and tell me some names of researchers, books, theories, traditions, that engage with that topic :)",
        "created_utc": 1676663406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling a bit lost",
        "author": "Smartlmao",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/114smgq/feeling_a_bit_lost/",
        "text": "Hello everyone. I'm currently an English undergrad in a non-English-speaking country. This second bit of information is important because my undergrad experience has been very different compared to that of an English major from an English-speaking country - my program is quite heavy on linguistics, translation, and TESOL, and not so much on literature and cultural studies.\n\nI'm currently in my 3rd year of undergrad and have begun to essentially panic because I would like to do a master's and PhD in English literature, more specifically either Victorianism or Modernism, but I'm feeling very lost because of the lack of focus on literature in my program, whereas my master's is nigh and I have to make certain decisions when it comes to what I want to do.\n\nI guess I just feel very far behind compared to other literature majors, especially those from English-speaking countries, and I'm not quite sure if I can catch up when it comes to my interests as I have to devote a lot of my time to all the other... *stuff*... that I don't really care about. I *do* research the topics I care about, just not to the extent that I would like to.\n\nI guess the point of my somewhat-lengthy-and-vent-y-post is this: is it too late for me to dive deeper into the topics I care about? Should I focus on both Victorianism and Modernism or suck it up and stick to one since I feel like I'm too far behind? The only thing I know for certain is that I'm interested in feminist theory, gender, queer studies, etc., but besides that, I love all of English literature, these are just my top two choices. Sorry if this post seems kind of pointless, I guess I'm just looking for some guidance and/or reassurance that it's not too late to \"get more serious\", lol. I really gotta stop panicking and pick up some good books on Victorianism/Modernism to read, it's just really hard not to panic sometimes. If this post doesn't belong in this subreddit, please redirect me to the right place:(",
        "created_utc": 1676655372,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your profession?",
        "author": "Bodeddy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/114rvr5/whats_your_profession/",
        "text": "Hi everyone,\n\nReally random, I know, but I’ve been following this subforum for a while and love how good everyone seems to be at analysing literature. But I’m super curious to know what everyone does for a living and how much literature features in your job, or if it features at all.\n\nI’m a Marketing Assistant at a charity, so unfortunately my job has nothing to do with literature lol.",
        "created_utc": 1676653516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strictly speaking, could the fourth stanza of Plath’s poem, “Child”, be considered a volta for the abrupt change in tone it creates?",
        "author": "sheephamlet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/113uqn2/strictly_speaking_could_the_fourth_stanza_of/",
        "text": "The first three stanzas of Plath’s poem, “Child” are filled with hope and a playful energy. However, the fourth stanza injects an intense feeling of hopelessness that overshadows everything that came before it. Could it be considered a volta?",
        "created_utc": 1676565268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I specialise in both literature and history at the same time?",
        "author": "IndependentRate3887",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/112wy5j/can_i_specialise_in_both_literature_and_history/",
        "text": "Hi, I'm an English major who is starting her masters soon. I've been hesitating for a while whether I should go for literature or history since there are topics that interest me in both fields. There's a specific period in Anglophone history that I'm very fond of and I'd like to tackle it both on a historical and literary level, make it my topic of research if I pursue my studies to a higher level hopefully (PhD)\n\nMy question is, if I chose one of these fields (literature or history) as the focus of my masters research, will I have to continue with that choice if I decide to go for a PhD later?\n\nSorry if this is a stupid question, I'm very new to all of this.\n\nThanks.",
        "created_utc": 1676464321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for some notable works of American Latino and Chicano fiction!",
        "author": "HawkeKeating96",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/111iuv1/looking_for_some_notable_works_of_american_latino/",
        "text": "Hi, everyone!\n\nI realized recently that I have read very little American Latino fiction, and I'm interested in fixing that! I've heard of \"Bless Me, Ultima,\" \"I Am Not Your Perfect Mexican Daughter,\" \"The House on Mango Street,\" and \"The Brief and Wondrous Life of Oscar Wao,\" but that's pretty much the extent of my knowledge.\n\nRecommendations would be appreciated! Note that I am specifically interested in books that address the American Latino experience -- not books like Pedro Paramo or One Hundred Years of Solitude, which were written by Latin American authors.\n\nThanks so much!",
        "created_utc": 1676319561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book that goes into detail about literary writing styles",
        "author": "Ready-Bite8673",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/110vg6p/looking_for_a_book_that_goes_into_detail_about/",
        "text": "\nI’ve been getting  more into reading, and recently I’ve began to wonder about the technical differences between different authors’ styles. Terminology, word choice, technique, all that stuff that makes one different from the other. I’d like to learn about it all.\nThank you for any recommendations!",
        "created_utc": 1676250236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Side-by-side translations of Marlowe, Jonson etc.?",
        "author": "aeb8lith",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/110sfox/sidebyside_translations_of_marlowe_jonson_etc/",
        "text": "Apologies if this is not the right place to ask this. I've been enjoying the No Fear Shakespeare books with the original text on the left page and a modern English paraphrase on the other (don't worry, I'm still reading the original first! It's just sometimes hard for me to follow some of the metaphors all the way through and it's very helpful to flick my eyes over to the \"solution\" and back to the passage and figure out how it's working). \n\nNow that I'm finishing up the last of Shakespeare's plays, I'm wondering if there is a similar resource (preferably a book, but a website would be great, too) for Christopher Marlowe, Ben Jonson, Thomas Kyd or for that matter Geoffrey Chaucer or John Milton.\n\nThank you so much for the help. By the way, if anyone is in the same boat as me in regards to No Fear Shakespeare, there is a website called LitCharts who have a feature called ShakesClear that, although more amateurish (I'm far from an expert and even I have noticed a few flat out mistaken translations) is more in-depth and arguably better than NFS.",
        "created_utc": 1676241571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggest me some Studies about Stylistic Analysis based on Abdulrazak Grunah’s novels please!",
        "author": "Far_Detail9892",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/110hft4/suggest_me_some_studies_about_stylistic_analysis/",
        "text": "Hey guys! I’ve been working on anaphora and epiphora in Nobel Prize author Abdulrazak Gurnah’s novels - Paradise, Afterlives and Grave heart. And struggling to find some useful sources and studies based on Abdulrazak Gurnah novels since he got his Nobel prize on 2021 and not much of his works got recognised yet.\n\nAny sources or links relevant to anaphora and epiphora studies based on Abdulrazak gurnah’s novels might be useful!",
        "created_utc": 1676213453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which modern/post-modern feminist book will be the appropriate for thesis for under graduate students?",
        "author": "mueenmn",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/110gvpk/which_modernpostmodern_feminist_book_will_be_the/",
        "text": "",
        "created_utc": 1676211883,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is Dead souls a poem?",
        "author": "funnyfloss222",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/110gl96/is_dead_souls_a_poem/",
        "text": "It is prose but at the start Gogol says it is a poem. Is it a prose poem? Does it count like une saison en enfer? Or is Gogol just being wrong.",
        "created_utc": 1676211056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best literary-debate references that I should bookmark?",
        "author": "phobetor00",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/11015cq/best_literarydebate_references_that_i_should/",
        "text": "I'm looking for websites or podcasts that you'd consider good to keep up with the literary talk of our days. I'd like to get to know new books and authors, to listen to debates, to read thought-provoking lit. criticism.",
        "created_utc": 1676158184,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s one website that LIT grad student should regularly check?",
        "author": "Z_I_Z",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10zyw68/whats_one_website_that_lit_grad_student_should/",
        "text": "",
        "created_utc": 1676152078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help finding a short story/blurb",
        "author": "Jestersage",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10zv8le/need_help_finding_a_short_storyblurb/",
        "text": "I remember reading this as part of an anthology book, which also contain \"Shooting an elephant\" by George Orwell. I recall the teaching material used both to compare the fall of colonialism.\n\nThe story itself is as follow: A man and a beautiful girl were on an island. The girl cannot speak English. However, the man have a radio with him. So they started to listen to radio together. Gradually, the girl picked up English, from simple terms, to eventually able to understand English, to able to speak elegantly. So while the man on the surface is able to laugh at the girl's joke, deep inside he hates the girl is able to pick up English.",
        "created_utc": 1676142520,
        "upvote_ratio": 1.0
    },
    {
        "title": "The general and not the specific",
        "author": "Share-Rad-Vids5355",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10ztbgi/the_general_and_not_the_specific/",
        "text": "",
        "created_utc": 1676137586,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is literature important?",
        "author": "imnotanerd1997",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10zmdvp/why_is_literature_important/",
        "text": "Anyone know essays or books providing a solid argument (or defense?) for the social value of literature? Ie why is literature important in our society?",
        "created_utc": 1676118060,
        "upvote_ratio": 1.0
    }
]