[
    {
        "title": "What kind of era/category/themes of literature do the books Call of the Wild, Heart of Darkness, Nervous Conditions, and Communist Manifesto belong to? [SERIOUS]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5p06w8/what_kind_of_eracategorythemes_of_literature_do/",
        "text": "[removed]",
        "created_utc": 1484867965,
        "upvote_ratio": ""
    },
    {
        "title": "[FREE JОIN] 100% Freе-Sеx-Dаting-Wеbsite. Оur girls arе looking fоr just freе-sех. Mеmbers аrе frоm all ovеr the wоrld. Don't waste any morе timе lоoking fоr frеe-dаting-sitеs. Join us todaу.",
        "author": "Seannannlo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oxdix/free_jоin_100_freеsеxdаtingwеbsite_оur_girls_arе/",
        "text": "[removed]",
        "created_utc": 1484841819,
        "upvote_ratio": ""
    },
    {
        "title": "Started Upper division English this week, I feel in over my head.",
        "author": "Littlemoewiththegimp",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oub9w/started_upper_division_english_this_week_i_feel/",
        "text": "I just feel as though a lot of the stuff we are required to read is written in gibberish. Most of the theory is anyhow. We are working on Realism in my class. Just read a 20 page article by Cady and it kind of sunk in but then I thought about it some more and I don't get his point of defining Realism. I looked for Harold Bloom videos and there is nothing I found about him talking about Realism except maybe Emerson could be considered..if not Romantic. I don't understand why Harold Bloom is so popular, well maybe I do, he is so confusing, over my head, and knows his literature.",
        "created_utc": 1484797222,
        "upvote_ratio": ""
    },
    {
        "title": "The Magistrate and the Little Boy",
        "author": "alleffinidiots",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ottzw/the_magistrate_and_the_little_boy/",
        "text": "[removed]",
        "created_utc": 1484791557,
        "upvote_ratio": ""
    },
    {
        "title": "I am ungifted and uneducated, what can I do to encourage writing to be decent?",
        "author": "CurrentInterest",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5or057/i_am_ungifted_and_uneducated_what_can_i_do_to/",
        "text": "I don't have any education beyond high school. I am not a genius. And I don't possess any gifts I'm aware of besides a will and want to write good stuff.\n\nAnother downside is that after going through this subreddit and the other lit subs I realize my tastes are bad and the books I like (for the most part) are bad. How do I get on track to write worth-while fiction? I'm reading more 'good' books, but I don't feel a difference in my writing.\n\nP.S. Also if someone could point me to great books that are a little more modern, that would be appreciated.\n\nTITLE EDIT: *My* writing. Not a good start...",
        "created_utc": 1484763295,
        "upvote_ratio": ""
    },
    {
        "title": "Lady MacBeth's Death",
        "author": "blairop",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oqccd/lady_macbeths_death/",
        "text": "Just finished Macbeth and am curious to learn what happened to Lady M...the play says she dies but is unclear to me how...did Shakespeare omit details of the death...is this omitted for a reason.\n\nAny thoughts thanks!",
        "created_utc": 1484757087,
        "upvote_ratio": ""
    },
    {
        "title": "What literary name can I give my pup?",
        "author": "RollBos",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5olgc9/what_literary_name_can_i_give_my_pup/",
        "text": "[removed]",
        "created_utc": 1484693945,
        "upvote_ratio": ""
    },
    {
        "title": "CALL FOR PANELISTS: Roundtable AMA on degrees and careers in literary studies",
        "author": "coree",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oju35/call_for_panelists_roundtable_ama_on_degrees_and/",
        "text": "Hello dear readers, \n\nWe're organizing our second roundtable discussion on degrees and careers in literary studies! \n\nIn this future AMA, we will welcome questions regarding the ins-and-outs of doing literary research, the field at large, and the types of careers available to those with scholarly literary training.\n\nQuestions might fall under these categories:\n\nHow to do research in a specialized library\n\nHow to publish articles or books\n\nHow to present research to the public (seminars, colloquia, conferences, etc.)\n\nHow to situate oneself in a scholarly tradition\n\nKeeping abreast of current research\n\nHow to write a thesis or a dissertation\n\nThe academic job market, alt-ac jobs\n\nIf you are a current \"expert\" in this sub, or if you have a graduate degree or graduate experience in literary studies, you can ask to be a panelist in the comments below. You will not be required to list your current affiliation (unless you'd like to), but we would like to get a good sampling of different types of people: current graduate students at R1, R2, Ivy, Lib Arts; current visiting, adjunct, tenure-track, or tenure faculty; MA and PhD holders who've gone on to literature-adjacent or unrelated fields. \n\nPlease - ask in the comments (not personal or modmail) if you'd like to participate. \n\nThe AMA will take place over a series of days in late February/early March. \n\nHere is our last AMA for those interested: \n\nhttps://www.reddit.com/r/AskLiteraryStudies/comments/3h44w7/hi_were_a_panel_of_experts_and_professionals_in/",
        "created_utc": 1484678467,
        "upvote_ratio": ""
    },
    {
        "title": "what does this sentence/expression in Othello mean?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oj43n/what_does_this_sentenceexpression_in_othello_mean/",
        "text": "[removed]",
        "created_utc": 1484671571,
        "upvote_ratio": ""
    },
    {
        "title": "[FREЕ JОIN] 100% Frеe-Sех-Dаting-Wеbsite. Оur girls аre looking for just freе-sех. Mеmbеrs are frоm аll оver the world. Join us todaу. Dоn't wаste аnу mоre timе looking fоr frеe-dаting-sites.",
        "author": "Finnbarlo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oeh0j/freе_jоin_100_frеesехdаtingwеbsite_оur_girls_аre/",
        "text": "[removed]",
        "created_utc": 1484610601,
        "upvote_ratio": ""
    },
    {
        "title": "rеаdіng tесhnіquе fоr stuff уоu dоn't nееd tо rеtаіn",
        "author": "Redditmis",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5oafe1/rеаdіng_tесhnіquе_fоr_stuff_уоu_dоnt_nееd_tо/",
        "text": "І'm trуіng tо sрееd uр mу rеаdіng оf thіngs whісh І dоn't nееd tо rеtаіn \n\nВу stuff уоu dоn't nееd tо rеtаіn І mеаn mоst stuff уоu rеаd оnlіnе, соmmеnts еtс\n\nhеrе іs а соmрrеhеnsіvе lіst оf rеаdіng tесhnіquеs І fоund - whісh оf thеm dо уоu thіnk іs mоst suіtеd fоr thіs?\n\nhttp://www.learningtechniques.com/speed-reading-techniques.html",
        "created_utc": 1484567210,
        "upvote_ratio": ""
    },
    {
        "title": "Extracts in Othello worth analysing",
        "author": "Skrublord2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5o6mea/extracts_in_othello_worth_analysing/",
        "text": "So anyone who read Othello can tell me where in the play is there an extract (~30) lines that contains alot of symbols and themes and is worth talking about for ~15 mins, I can't quite find one and I feel all are too simple to talk that much about.",
        "created_utc": 1484516650,
        "upvote_ratio": ""
    },
    {
        "title": "I’vе triеd for manу оf dаting, but theу аsled mе feе fоr using. I’vе found proven dating website which helреd tо find 3 girls onlу for seх",
        "author": "Parkerprudar",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5o6ee3/ivе_triеd_for_manу_оf_dаting_but_theу_аsled_mе/",
        "text": "[removed]",
        "created_utc": 1484514340,
        "upvote_ratio": ""
    },
    {
        "title": "Heightened Sense of Anti-Semitism coming from British literature; especially Shakespeare and Dickens characters.",
        "author": "blairop",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5o5j1v/heightened_sense_of_antisemitism_coming_from/",
        "text": "Seems to be a noticeable exaggerated use of Jewish stereotypes in both Shakespeare's \"The Merchant of Venice\" and Dickens' \"Oliver Twist\" in the characters of Shylock and Fagin, respectively.\n\nHistorical analysis might shed light on the subject as European history has definite periods and strains of this type of antagonism towards the Hebrew in diaspora.\n\nI'm part Jewish myself and this area of study has always interested me and as of late have began investigating. \n\nTime periods withstanding I do realize after reading that both characters in question (and of course there may be more I'm not aware of--let me know if possible) have traits and developed portraiture that shows more complexity than maybe taken at first read/glance (in fact as person with shared Jewish ancestry I found the writing of these characters infatuating and quite thoughtful in many regards). Almost \"hero-like\" in there protagonist features.\n\nLooking forward to hearing thoughts on the matter",
        "created_utc": 1484505641,
        "upvote_ratio": ""
    },
    {
        "title": "Queer Studies in Mann's \"Death in Venice\".",
        "author": "blairop",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5o5gik/queer_studies_in_manns_death_in_venice/",
        "text": "Just finish reading the novella, Death in Venice by Mann, and was wondering if there are any thoughts or research done regarding main characters somewhat queer relationship to and infatuation with the boy named Tadzio.\n\nLearning this would shed some light on analysis and critique of this  text and would be interesting to learn anything about this type of theory.\n\n",
        "created_utc": 1484504945,
        "upvote_ratio": ""
    },
    {
        "title": "Simon DeBeauvoir: what should I be paying most attention to? What is a distraction?",
        "author": "AbbathOcculta",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5o53ps/simon_debeauvoir_what_should_i_be_paying_most/",
        "text": "I have started reading The Mandarins but I also have about 10 books by DeBeauvoir. I haven't read any of them. I just picked them up cheap and have always intended to. \n\nAny specifics I should be paying attention to? My collection is a mix of her novels and non-fiction. Is she a writer you can begin at any point or does a particular book benefit you most if you begin there?  Any help or suggestions about approach are appreciated.\n\n My goal is to spend te next little while reading her work unless it becomes apparent that I really, really hate it. But, that would be unlikely.",
        "created_utc": 1484501286,
        "upvote_ratio": ""
    },
    {
        "title": "What is the literary device where you describe something that is not an object with objects",
        "author": "OsmanTheMan",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5nyp9w/what_is_the_literary_device_where_you_describe/",
        "text": "example \"this is a period of time that had its flowers and its thorns\"",
        "created_utc": 1484416523,
        "upvote_ratio": ""
    },
    {
        "title": "Bulwark - Langston Hughes [Thoughts]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5npi6d/bulwark_langston_hughes_thoughts/",
        "text": "[removed]",
        "created_utc": 1484296140,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Americana by Don DeLillo?",
        "author": "Synney",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5nmwmi/thoughts_on_americana_by_don_delillo/",
        "text": "Currently a 5th year English Lit student, taking my last semester of my undergrad. For my US contemporary fiction course, we are reading the 1971 novel Americana by Don DeLillo and I am REALLY struggling with this text. \n\nWhen I'm not blinded by my hatred for it, I'm just left confused/wondering about what I am supposed to be taking away from this novel. Has anyone else read this book? Any thoughts/suggestions for themes, images, and so forth I should be paying attention to? ",
        "created_utc": 1484263904,
        "upvote_ratio": ""
    },
    {
        "title": "Fancy helping me round some mental blocks with a PhD funding statement?",
        "author": "Shamrayev",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5nj8mh/fancy_helping_me_round_some_mental_blocks_with_a/",
        "text": "Hullo all - I've got some great advice from this sub previously, so I thought I'd chance my arm one more time in the hopes of extending my 'academic journey'. I'm applying for funding here in the UK for doctoral research, and I've been bouncing drafts of my research proposal around between myself and a potential supervisor for weeks and weeks now, and it's crunch time.\n\nUnfortunately, it's also crunch time for MA essays, so I'm finding myself staring aimlessly at the screen trying to a) interpret and b) act on a few tricky bits of feedback which I'll share here in the hopes that a few more pairs of eyes can help to unpick this ~~so I can get that sweet, sweet grant money and kick back for five years~~.\n\n&gt;I will show how the shape of the modernist short story is intrinsically tied to periodical culture, with lasting magazines more able to provide **lasting influence**  upon the short story as a form than more transitory titles. \n&gt;&gt;&gt;**Feedback: What sort of influence do you have in mind? This is quite complex.**\n\nI haven't done the research yet, so I'm not sure what influence I'll find - but I'm thinking of ways in which publishing practices shaped the form of what we think of as a modernist short story.\n\n&gt;This research **will engage with**  scholarship on modernist magazines, particularly the work associated with the Modernist Journals Project and the resurgence of scholarly interest in the magazine editors of this period\n&gt;&gt;&gt;**Feedback: How? In what sense?**\n\nThis one is just me being dumb, but I'm drawing a total blank on how to define exactly how I'm going to 'engage' with scholarship. I'm gonna read their books, chat to nice people and go to conferences - is that what we're driving at here? Or is it more, 'my research will slot in ***here*** within the current understanding'?\n\nI appreciate this might looks like I'm asking you kind folks to do my work for me - I'm really not. But I am just staring at this feedback and watching the clock go by right now so any help understanding ways in which I might turn my vague language into something which will be clear, and impress a funding board, is more appreciated than you can imagine.",
        "created_utc": 1484226359,
        "upvote_ratio": ""
    },
    {
        "title": "For the creative writers out there",
        "author": "Littlemoewiththegimp",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ng9ro/for_the_creative_writers_out_there/",
        "text": "I have been conflicted on whether or not to share my writing, mostly out of fear and of criticism and negative feedback. I am a sensitive person but want to make a break in being published, earn awards and I just generally want to become a better writer. Today I submitted a short story for an Undergrad college creative writing scholarship. I am nervous to hear back on my submission and especially how it may be received. I want to get over my insecurities but don't know which community to join or who to ask for help at my University. There are so many online. I'm antisocial, shy, and afraid.",
        "created_utc": 1484183579,
        "upvote_ratio": ""
    },
    {
        "title": "On the value of being made \"uncomfortable\"?",
        "author": "headlessparrot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ncx4f/on_the_value_of_being_made_uncomfortable/",
        "text": "Almost more of a pedagogical question than a theory question, but there's enough overlap here.\n\nA common thread in some of my literature classes is that I have students say the reading is \"offensive\" (we're talking a community of 25-50% Seventh-Day Adventists, in some classes). Of course, when they say \"offensive,\" what they really mean is \"this challenges my beliefs\" and \"this makes me uncomfortable.\"\n\nI usually give a bit of a spiel about how this is actually one of the functions of art--that maybe (just maybe) being made uncomfortable will push us to think and reflect on some of these issues (as an Americanist, I recall David Foster Wallace's passing reference to the idea that \"good fiction should comfort the afflicted and afflict the comfortable\"). But I want to expand that segment of the class, and I'm wondering if there's any actual scholarly work out there on the idea of the merits of being made \"uncomfortable\" by lit. ",
        "created_utc": 1484150239,
        "upvote_ratio": ""
    },
    {
        "title": "Any good internet resources to follow?",
        "author": "truthOrDare006",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ncimq/any_good_internet_resources_to_follow/",
        "text": "As a college student of english, are there any good resources on the internet, such as websites or youtube channels that I can follow to learn more about literary studies?\n\nI found a cool youtube channel called LP Koshan that posts good, free lectures on literature.\n\nhttps://youtu.be/LPIduZJF09k\n\n Any more such stuff?",
        "created_utc": 1484145789,
        "upvote_ratio": ""
    },
    {
        "title": "Classic plays on TV?",
        "author": "zswagz",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5n6bj7/classic_plays_on_tv/",
        "text": "Is there a YouTube channel or Netflix series that makes it easy to watch classic plays like Henry V, No Exit, Doubt, Fences, etc.? I want to try and spend less free time watching TV this semester.",
        "created_utc": 1484069188,
        "upvote_ratio": ""
    },
    {
        "title": "Book Search - History of Literature",
        "author": "Calitalia",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5n4012/book_search_history_of_literature/",
        "text": "I am looking for a book on the history of literature. I have recently started to read more and become more involved in learning about some of history's great writers. I am interested in learning about the overarching themes through time of literature and a timeline per se of literary developments so that I can better appreciate what it is that I am reading (I am starting with classics so they vary widely in genre and period).\n\nI found this in my local bookshop but am not sure if it is the best option, it did look quite interesting nonetheless https://www.dk.com/uk/9780241015469-the-literature-book/\n\nI would appreciate any recommendations!",
        "created_utc": 1484038426,
        "upvote_ratio": ""
    },
    {
        "title": "Моst еffісіеnt rеаdіng tесhnіquе fоr nоn fісtіоn (nоt rеаdіng fоr еnјоуmеnt)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5n10a1/моst_еffісіеnt_rеаdіng_tесhnіquе_fоr_nоn_fісtіоn/",
        "text": "[deleted]",
        "created_utc": 1484002191,
        "upvote_ratio": ""
    },
    {
        "title": "Does rhyme scheme count as \"verse\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5n0as3/does_rhyme_scheme_count_as_verse/",
        "text": "[removed]",
        "created_utc": 1483995431,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a name for the technique wherein authors list rhetorical questions one after another?",
        "author": "technologicidity",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mwr2i/is_there_a_name_for_the_technique_wherein_authors/",
        "text": "An example could be: 'How many people had lost their voice? How long would it be until they found them? Could they even be found?'",
        "created_utc": 1483953744,
        "upvote_ratio": ""
    },
    {
        "title": "A story about racers",
        "author": "ar-fuirdun",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mwp3k/a_story_about_racers/",
        "text": "I'm looking for the one about an awesome mechanic who races the vehicular personification of death in a station wagon with a Cessna engine. Any help appreciated, thanks!",
        "created_utc": 1483952702,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Gatsby a deceiver?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mtrpg/why_is_gatsby_a_deceiver/",
        "text": "[removed]",
        "created_utc": 1483915419,
        "upvote_ratio": ""
    },
    {
        "title": "need help finishing my essay on 'parallax in to the lighthouse'",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mskqc/need_help_finishing_my_essay_on_parallax_in_to/",
        "text": "[deleted]",
        "created_utc": 1483903257,
        "upvote_ratio": ""
    },
    {
        "title": "Course on James Joyce",
        "author": "tjkool101",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ms3np/course_on_james_joyce/",
        "text": "I'd like some advice as to whether I should take an upper level course on James Joyce. We're reading Dubliners, Portrait, and Ulysses. I've never read Joyce, but I've read Proust, Aristotle, Aquinas, Tolstoy, Lawerence etc. The course is supposed to be very difficult, and I was wondering how hard it would be to not only understand Joyce's writing, but to also discuss it intelligibly. I'd appreciate any feedback or tips on reading Joyce!",
        "created_utc": 1483898329,
        "upvote_ratio": ""
    },
    {
        "title": "Drugs and surrealism?",
        "author": "gabsdixon",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mr52t/drugs_and_surrealism/",
        "text": "I'm sort of beyond confused about this... My essay question is to do with 'states of intoxication' and how they were celebrated in surrealism. But to my knowledge, they haven't been! My professor taught us that surrealists were against drugs and alcohol because surrealism should be able to take you to another place on its own. I can't find anything to support this though, in fact most sites say surrealists used drugs to enhance their automatic writing etc. Does anyone know of any texts where surrealists have condemned the use of drugs and alcohol? Am I even right in thinking this?",
        "created_utc": 1483886885,
        "upvote_ratio": ""
    },
    {
        "title": "Reading list database- is there such a thing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mnott/reading_list_database_is_there_such_a_thing/",
        "text": "[deleted]",
        "created_utc": 1483832815,
        "upvote_ratio": ""
    },
    {
        "title": "Is this a legit edition of Cloud Atlas?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mnece/is_this_a_legit_edition_of_cloud_atlas/",
        "text": "[deleted]",
        "created_utc": 1483829582,
        "upvote_ratio": ""
    },
    {
        "title": "Challenge: Construct as many Kennings (Old English Poetry, for example in Beowulf, 'Oar-Steed' means Ship) for the following words, in their current form (Imperative); 'Compose', 'Seek', 'Dream' and 'Imagine'.",
        "author": "Anglo_girl",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mkvtn/challenge_construct_as_many_kennings_old_english/",
        "text": "[removed]",
        "created_utc": 1483801937,
        "upvote_ratio": ""
    },
    {
        "title": "The Characteristics of Each English Literary Period",
        "author": "LinkTheJarBreaker",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mkkhv/the_characteristics_of_each_english_literary/",
        "text": "[removed]",
        "created_utc": 1483797257,
        "upvote_ratio": ""
    },
    {
        "title": "A couple of narration style questions (also in askliterature)",
        "author": "Squiddlepuss",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mi015/a_couple_of_narration_style_questions_also_in/",
        "text": "I just have a few questions about narration style. I've looked around and haven't been able to find the answers to my questions. What is it called when a narrator refers back to the book? - in the book I'm reading the narrator is third person objective. In one case the narrator describes the action of two characters, some dialogue and stuff happens with other characters and then it describes them again saying \"...which have already been alluded to\" What is that called?\n\nI'm also wondering what it is called when the third person narrator says something like \"we shall not describe the gratitude to the...\" (From the last of the mohicans) specifically the we part.\n\nFyi the book is The Last of the Mohicans by James Fenimore Cooper if that helps",
        "created_utc": 1483756606,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for Criticism on Music?",
        "author": "moop_doop",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mftnr/recommendations_for_criticism_on_music/",
        "text": "I'm an undergrad literature student, but I've always been interested in music. I'm wondering if anyone knows of any criticism/theory pertaining to music and specifically to jazz? I'm aware only of Adorno's critiques of jazz, and his is the type of writing I'm looking for. ",
        "created_utc": 1483733135,
        "upvote_ratio": ""
    },
    {
        "title": "Antigone before Sophocles",
        "author": "EnciclopedistadeTlon",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mfpo8/antigone_before_sophocles/",
        "text": "The [Antigone Wikipedia article](https://en.wikipedia.org/wiki/Antigone) mentions that\n\n&gt; **In the oldest version of the story, the burial of Polynices takes place during Oedipus' reign in Thebes, before Oedipus marries his mother, Jocasta.** However, in other versions such as Sophocles' tragedies Oedipus at Colonus and Antigone, it occurs in the years after the banishment and death of Oedipus and Antigone's struggles against Creon.\n\nIs there any record about this oldest version of the story? What I'm interested in knowing is what is the oldest known record of Antigone's story, I though it was Sophocles' *Antigone* but this may mean there's another one.\n\nThank you for your time.",
        "created_utc": 1483732017,
        "upvote_ratio": ""
    },
    {
        "title": "unorthodox use of language",
        "author": "somou",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mfevx/unorthodox_use_of_language/",
        "text": "Hi, last year I read \"A school for fools\" by Sasha Sokolov, and was fascinated by the writer's unorthodox use of language. Then, yesterday I read \"Mad toy\" by Roberto Arlt and I really liked it, and reading it in Spanish (the book's original language) made me realize that Arlt also has a really unorthodox use of language. So, I started researching about other works of literary fiction that have this feature, but I haven't had much luck finding some specific references on this matter. Does anyone know of any? \n\nThanks so much for reading. ",
        "created_utc": 1483729144,
        "upvote_ratio": ""
    },
    {
        "title": "Critics who strive to find the author/influences in a text.",
        "author": "Shamrayev",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mfech/critics_who_strive_to_find_the_authorinfluences/",
        "text": "Quick question because my mind has gone totally blank:\n\nI'm trying to discuss the apparent need amongst scholars to locate (biographically) Wyndham Lewis (particularly in this instance) within his fiction, and I know there's a school of thought for that but can't put my finger on it.\n\nAny help?",
        "created_utc": 1483729004,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence of Salinger reading and possibly commenting on Vonnegut or vice versa?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5mc113/is_there_any_evidence_of_salinger_reading_and/",
        "text": "[deleted]",
        "created_utc": 1483683479,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on the use of symbolism?",
        "author": "TheEnchantedHunters",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m98v6/thoughts_on_the_use_of_symbolism/",
        "text": "This is probably a strange and overly vague question, but I'm curious what people here think about the technique of symbolism. For example, what does it add to a story and how should it be used? I've always been averse to focusing on symbolism, because it always recalls the poorly-done high school English days of pointing out that the blue curtains represent sadness or something insipid like that. When do you think symbolism adds something to the story that wouldn't as well be communicated through the narration/tone/other elements? Does the heavy use of symbolism detract from the story by putting it more in the allegorical realm? How important is it for readers to be attentive to possible symbols? \n\nJust curious to hear general opinions!",
        "created_utc": 1483652069,
        "upvote_ratio": ""
    },
    {
        "title": "Could you consider Arthur Miller's 'All My Sons' a tragedy?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m829n/could_you_consider_arthur_millers_all_my_sons_a/",
        "text": "[deleted]",
        "created_utc": 1483640736,
        "upvote_ratio": ""
    },
    {
        "title": "Where to start with Harold Bloom?",
        "author": "claire947",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m7qo6/where_to_start_with_harold_bloom/",
        "text": "I want to start reading Harold Bloom but I don't know where to start! How to Read? Western Canon? Asking as someone with a decent background in literary and art theory, but wanting to read him more out of general interest and to help me focus my own reading as a writer....",
        "created_utc": 1483637687,
        "upvote_ratio": ""
    },
    {
        "title": "Internet in literature?",
        "author": "HartNoiz",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m74qg/internet_in_literature/",
        "text": "Hi guys! Could you give me some recommendations of American/British literary works dealing with internet as a theme? (To just give an example, something like Pynchon's Bleeding Edge). I've searched the topic a bit but pretty much everything regarding internet and literature concerns the use of the first as a medium for the latter, and that isn't really what I need. I'll be glad for any suggestions : )",
        "created_utc": 1483631656,
        "upvote_ratio": ""
    },
    {
        "title": "Contemporary settings?",
        "author": "son_of_the_mask",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m5xa7/contemporary_settings/",
        "text": "As a part of a reading challenge I am required to read a novel set in a contemporary setting. What is a contemporary setting?",
        "created_utc": 1483616297,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for suggestions: a poem to demonstrate polyvalent meaning",
        "author": "cuchlann",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m4b5n/looking_for_suggestions_a_poem_to_demonstrate/",
        "text": "I'm thrashing together my syllabus for next semester. I'm teaching a freshman level comparative humanities course. I'm changing my theme up a bit, since it's probably my last semester teaching it (my state elected a governor who hates colleges, so in an attempt to appease him my school, \"for budgetary reasons,\" killed my program. Never mind that now). \n\nI thought with *The Arrival* still floating around in the cultural scene I'd pick up where it led folks. So alongside \"Story of Your Life\" (the story the movie's based on) I thought I'd teach Lem's *His Master's Voice* and probably Zelazny's \"A Rose for Ecclesiastes.\" \n\nI always end up doing the thing where I draw out all the language diagrams from Saussure's work, so I thought I'd just run with the idea of what language and symbols are (and aren't). So I'd like, in the poetry section, to use a poem that shows how poetic language is really complicated. \n\nBasically, I'd like something easy to read that, upon examination, turns out to be more complicated. That's basically every work of literature, but hopefully I'm making myself somewhat clear? Something that can function as a \"primer\" for teaching how to look at poetic language itself. \n\nFor example, this text would probably come the class before I teach \"The Goblin Market,\" which I've done the past two semesters. I start that class by simply reading all the sexual language in the poem. Inevitably, over half the class giggles or blushes, because they didn't notice the language was sexual (because, you know, they were talking about *fruit*, not sex...). So I want a poem *before* that one to demonstrate how to look at words and phrases that point to more than one \"meaning.\"\n\nThis is a long post for a simple request. Sorry about that. \n\nOh, bonus points if the work isn't originally in English. We're comparative, so it's always nice to have stuff from other languages. I use a lot of Japanese poetry, like Basho, which turns on puns and witty references to seasons. ",
        "created_utc": 1483590911,
        "upvote_ratio": ""
    },
    {
        "title": "What would be some of items on an r/AskLiteraryStudies introductory reading list?",
        "author": "Dragon9770",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5m1r8c/what_would_be_some_of_items_on_an/",
        "text": "Hello all, recently found this place while trying to find a reddit to help introduce me to literary theory (got a project that I want to do but realize my handle on aesthetic/literary theory is sparse), but I was disappointed to not find helpful guide in your sidebar like so many other theory subs.  I am a intellectual historian and contiental philosopher first, so I already have the interdiscplinary basics of Marx, Benjamin's *Work of Art...*, and the general basics of Frankfurt Critical Theory under my belt, but I want to get into the kind of stuff that gets ignored by non-literary folk.  Sorry if this might be general, but this is really just an attempt to make up for the lack of a sidebar list, and hence must be very general.",
        "created_utc": 1483563561,
        "upvote_ratio": ""
    },
    {
        "title": "Brave New World Analysis",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5lxcyw/brave_new_world_analysis/",
        "text": "[removed]",
        "created_utc": 1483508570,
        "upvote_ratio": ""
    },
    {
        "title": "Whаt kіnd оf text shоuld аnd shоuldn't уоu sрееd rеаd?",
        "author": "Redditmis",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5lum5t/whаt_kіnd_оf_text_shоuld_аnd_shоuldnt_уоu_sрееd/",
        "text": "І rеаd sрееd rеаdіng саusеs уоu tо nоt rеtаіn thе іnfоrmаtіоn аs wеll аs, sо whаt kіnd оf rеаds dо уоu thіnk thіs wоuld bе оkау fоr? І'm sау sрееd rеаdіng rеddіt wоuld bе fіnе аs уоu dоn't nееd tо rеtаіn thе іnfо",
        "created_utc": 1483478687,
        "upvote_ratio": ""
    },
    {
        "title": "First academic conference-- trans person, dress code?",
        "author": "misstooth",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5lu3wd/first_academic_conference_trans_person_dress_code/",
        "text": "I'm excited because I got accepted onto my first academic panel, but I am slightly worried about how I'll be received as a genderqueer person-- i.e. a \"guy\" wearing a dress and makeup. I'm not going to change how I dress based on how others feel about me, but I am curious to know what kind of experience I'm in for. \n\nHope this is the right place to ask!\n",
        "created_utc": 1483473773,
        "upvote_ratio": ""
    },
    {
        "title": "Important Translation Question about *The Idiot*",
        "author": "svartsven",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5lto22/important_translation_question_about_the_idiot/",
        "text": "I'm currently listening to an audio book translation of Dostoevsky's *The Idiot*. The translation uses the term \"ass\" to refer to a donkey during a conversation between Prince and the Epanchin matriarch accompanied by her daughters. I'm wondering if the Russian term that's been translated as \"ass\" has the same triple meaning as the English term (i.e., donkey, moron, and butt), since this would seem to underscore the protagonist's simplicity and social ineptitude. \n ",
        "created_utc": 1483469445,
        "upvote_ratio": ""
    },
    {
        "title": "Biography of Milton?",
        "author": "WillieConway",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ln13x/biography_of_milton/",
        "text": "Any good overviews of Milton's life and times that anyone can recommend?",
        "created_utc": 1483385115,
        "upvote_ratio": ""
    },
    {
        "title": "Whаt's thе nеgаtіvе еffесts оf kіllіng subvосаlіzаtіоn?",
        "author": "Redditmis",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5lm7zy/whаts_thе_nеgаtіvе_еffесts_оf_kіllіng/",
        "text": "[removed]",
        "created_utc": 1483376547,
        "upvote_ratio": ""
    },
    {
        "title": "Can fiction correctly teach knowledge?",
        "author": "GetOffRedditASAP",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5lku7h/can_fiction_correctly_teach_knowledge/",
        "text": "By this, I mean does fiction literature (this can be extended to all art, I suppose) have any serious purpose and ability of teaching the concepts, facts, and theories of disciplines in the social sciences and non-literary based humanities? \n\n(Supplementary) All literature covers ideas to some superficial or in-depth length, whether informally or formally; Heart of Darkness involves concepts related to anthropology, War and Peace history, Brothers Karamazov philosophy, 1984 political science, The Tale of Genji psychology, and I’m sure there’s a novel related to literary theory and criticism itself. However, it seems that fiction literature, and art in general, is a poor medium to accurately and significantly communicate or theorize that knowledge which belongs to non-fiction; akin to televised political debates being poor environments for serious, legitimate argument over policy— art tends not to be as shallow though. ",
        "created_utc": 1483356675,
        "upvote_ratio": ""
    },
    {
        "title": "Personal and Social in Lit. Theory",
        "author": "dl_eberhardt",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5kxj2v/personal_and_social_in_lit_theory/",
        "text": "Hi everyone,\nI need to write an essay for my Angloamerican Literary Theory class; the title is \"The Intertwinement of Personal and Social in Literary Theory\". Does any of you have any suggestions what could be a good starting point for this? I find both \"personal\" and \"social\" to be quite vague terms and am thus quite confused about the whole point of this essay - any suggestion is way more than welcome. \n\nEdit: this is not necessarily the final title of the essay, it may be different in the end. For those of you asking what the syllabus is; well, we don't really have an extensive syllabus, it's more or less just random articles concerning various critical approaches. I am currently going through Eagleton's Literary Theory: An introduction for research. Some of my initial ideas were to present those approaches as more \"personal\" - perhaps New Criticism, focusing on a text as a closed, finished entity &amp; believing that meaning stems from the individual, and for \"social\" - perhaps post-structuralism with Barthes... although not really sure which part of it?\nThe whole thing is incredibly vague, I agree.",
        "created_utc": 1483027620,
        "upvote_ratio": ""
    },
    {
        "title": "Using Shakespeare's language in every day conversation?",
        "author": "hophopaway1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5kx80j/using_shakespeares_language_in_every_day/",
        "text": "Shakespeare's plays makes the english language really beautiful. Why doesn't anyone aim for that level of vocabulary in every day conversation? Would it impress anyone?",
        "created_utc": 1483023987,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Merit",
        "author": "samwisethebrave364",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5koss9/literary_merit/",
        "text": "I'm gonna keep this brief. I have an English teacher who has taken literature and told us there is basically one meaning in any given book, and one \"right\" way of interpreting it, that none of us see. He says that every single line in a piece holds significance to the plot, and that we shouldn't care about the characters, setting, plot, any of that, unless they contribute to the meaning, and if they don't, it's meaningless and isn't literature. My teacher has made me feel very upset and perplexed about literature and the way we look at it, and I feel like I've become a worse reader and not been able to enjoy reading anymore because I'm looking for symbols and not even able to trust myself to find the meaning of texts. I feel like literature is a formula now, not an art. I'm struggling, and I could use some thoughts.",
        "created_utc": 1482906244,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding truthfulness in knowledge/answers",
        "author": "phone_radio_tv",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5kold4/understanding_truthfulness_in_knowledgeanswers/",
        "text": "Have been trying to understand truthfulness in answers for questions. \n\nPramana (https://en.wikipedia.org/wiki/Pramana) talks about ways of acquiring truthful knowledge.\n\nHappy to get other references in literatures regarding the same.",
        "created_utc": 1482903236,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with problematic theorists",
        "author": "savdec449",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5kkeeu/dealing_with_problematic_theorists/",
        "text": "Hi all,\n\nIn the spirit of the holidays, I wanted to pose a question that has come up [again](https://lareviewofbooks.org/article/heidegger-anti-semitism-yet-correspondence-philosopher-brother-fritz-heidegger-exposed/): namely, how do you treat your sources with respect to their relation to the real people that actually wrote them? \n\nFor me, I can easily agree with a positive duty to cite--i.e., that I should make more effort to cite theorists and critics who aren't male, are of color, etc., who are writing on the same issues that my work tackles--e.g., citing Spillers as well as Butler when I want to talk about the historically mediated process of identity creation. \n\nHowever, I'm on less solid ground when it comes to dealing with figures whose work may be relevant, but whose personal political motivations may be hard to stomach (or even separable from their work). So, returning to Heidegger, what do we do with his work (especially since so much of his later writing serves as the basis of contemporary media theory) when his Nazism seems ever less and less tangential? Or, to use an example that may be closer to home in our everyday lives, what do we do with a figure like Harold Bloom, where the sexual assault allegations sit uncomfortably well with the disdain for the *ressentiment* of mainstream literary criticism? \n\nAnyways, I don't have an answer for the above, but I thought it'd be interesting to gather some more opinions!\n\nEdit: yada yada Author is dead yada yada, but simply saying the author is not the text seems too simple for me and too easy an out for issues such as these. ",
        "created_utc": 1482854655,
        "upvote_ratio": ""
    },
    {
        "title": "Is Mark Twain a romantic author?",
        "author": "lasaczech",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5kgw4b/is_mark_twain_a_romantic_author/",
        "text": "[removed]",
        "created_utc": 1482800591,
        "upvote_ratio": ""
    },
    {
        "title": "What are some great examples of contemporary formal analysis?",
        "author": "theJohann",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5kdvkk/what_are_some_great_examples_of_contemporary/",
        "text": "Hello all, I'm thinking of comparing the formal characteristics of two texts for an upcoming essay. The texts are quite decidedly postmodern, and I'm thinking of showing how both thus share the exemplary formal features of a postmodern text. \n\nHowever, I don't feel confident with only identifying and listing the formal elements of the texts. I certainly want to show how these elements are significant. But, how do I show their significance without straying into another kind of analysis entirely? What keeps my analysis one of form and not of something else? \n\nI would appreciate any articles, essays, chapters etc. that, in your opinion, are good formal readings of texts. Thank you so much! ",
        "created_utc": 1482761429,
        "upvote_ratio": ""
    },
    {
        "title": "Paradise Lost",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5k6ud7/paradise_lost/",
        "text": "[deleted]",
        "created_utc": 1482640118,
        "upvote_ratio": ""
    },
    {
        "title": "Atlantic Studies, Transatlanticism, Tranationalism, etc.",
        "author": "Vajennie",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5k0i54/atlantic_studies_transatlanticism_tranationalism/",
        "text": "You know that feeling when you're supposed to becoming in expert in something that you're supposed to already know a lot about, and you suddenly realize you haven't grasped the basics?\n\nWhat are some difference between these terms and how they are applied? ELI5.",
        "created_utc": 1482541052,
        "upvote_ratio": ""
    },
    {
        "title": "Which version of Wuthering Heights should I watch? Also, Best movie adaptations ever made?",
        "author": "heatseeker47",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jx1jx/which_version_of_wuthering_heights_should_i_watch/",
        "text": "[removed]",
        "created_utc": 1482499005,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Studies/Academia Question",
        "author": "anaimlessalpaca",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jwm6v/literary_studiesacademia_question/",
        "text": "Hello, I am wondering if someone can help me. English is my second language, and currently I am studying a third one, however I was always intrigued by the way of finding deeper meaning in content, whether it being stories,films,games, etc. I find that I do not have an articulate way of voicing my opinion or even a solution to a problem. I would love to learn how to do this myself. There is a person on YouTube who does videos about video game and films, most of the time he complains about them,but I find it amazing how he is able to present all these points and comparisons. His name is MrBtongue. I would appreciate it if someone could give me some guidance on how I would go about learning about subject matter and other stuff relating in academics. Mainly I would like to learn about:\nSubject matter\nBeing able to explain the \"bigger picture\".\nCompare and explain the setting, it's atmosphere,etc. Famous literary people.\nParticipation in content.\nThree levels of suspension of disbelief.\nWorld building - con-worlds.\nGraphical literation.\nAnalysing/Finding deeper meaning.\nWriting Essays/ General story writing.\nClever narrative work.\nEvoking feelings/Tone and moods.\nBuildups/ Rhythm of the story.\nNow I know that I am able to use a search engine to find many information regarding the listed things above, however I feel that sometimes other people may guide me to find new things to learn about or even tell me some more important things regarding a certain topic that I wouldn't find on the internet, being a personal opinion or generally another point of view. Anyway if you would be kind enough to answer with any resource, advice, tip, or even direct me to a certain book or site, I would sincerely appreciate it. Thank you for your time.",
        "created_utc": 1482491578,
        "upvote_ratio": ""
    },
    {
        "title": "Would you consider anything that represents something else to be a symbol of that thing?",
        "author": "bigcup321",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jwcsz/would_you_consider_anything_that_represents/",
        "text": "For example, in Ray Bradbury's \"The Veldt,\" the Happylife Home that caters to the family's every need represents modern conveniences in an exaggerated form, but I just don't feel like I would say the home is a symbol of modern conveniences. It just represents them.\n\nBut I have no reservations about saying that the green light in The Great Gatsby is a symbol of Gatsby's dream of reuniting with Daisy.\n\nIs it just me, or is there a difference?\n\nIn the case of The Great Gatsby, the green light is USED as a symbol WITHIN the story. Gatsby's feelings toward it change when the situation with Daisy changes.\n\nBut in the case of \"The Veldt,\" the thing that the Happylife Home represents is outside the story, so it only has one meaning to characters in the story. It couldn't be USED as a symbol within the story because to the characters it doesn't make a recognizable reference to anything else.\n\nDoes that make any difference? Would you consider them both to be symbols?",
        "created_utc": 1482486775,
        "upvote_ratio": ""
    },
    {
        "title": "Best English critique of Italian author Pirandello?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jt8me/best_english_critique_of_italian_author_pirandello/",
        "text": "[removed]",
        "created_utc": 1482442755,
        "upvote_ratio": ""
    },
    {
        "title": "Sample Papers? Will provide numerous forms of compensation!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jopdm/sample_papers_will_provide_numerous_forms_of/",
        "text": "[removed]",
        "created_utc": 1482382028,
        "upvote_ratio": ""
    },
    {
        "title": "Do we have a clear understanding of the history of punctuation and its uses in different languages?",
        "author": "TheNewRule",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jlz4y/do_we_have_a_clear_understanding_of_the_history/",
        "text": "I've done some googling and looked through some old textbooks but didn't find much. As a native-English speaker/reader, I'm curious as to how we came about our current practices of punctuation. Even more so, I'm curious about how punctuation is used in other languages.\n\nFor example, did Spanish have the exclamation point at the end of a sentence and inverted exclamation point at the beginning, then English adopted the punctuation at the end of the sentence? Basically, where does our punctuation come from in order to convey different meanings and how did it adapt to fit into different languages.",
        "created_utc": 1482349813,
        "upvote_ratio": ""
    },
    {
        "title": "Borges and Universalism",
        "author": "lcag0t",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jk1tu/borges_and_universalism/",
        "text": "Hello, I have been reading Borges lately, especially in Spanish with he help of Giovanni translations. At some point I found myself reading Aleph and Zahir stories again and again. They seem so universal, yet so personal. What can we say about those stories, Borges and universalism. Sorry for wide open question, but I myself do not know how to go specific. Maybe, a help to dive in details would help also. ",
        "created_utc": 1482329056,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions for graphic novels",
        "author": "the_doctoress",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jiipr/suggestions_for_graphic_novels/",
        "text": "I am working on an ecocritical analysis of American comics/graphic novels, mainly concentrating on their form. These are the texts I have so far- Craig Thompson's Blankets, Clowes' Ghost World, and Burns' Black Hole. My contention is that the setting and the auteur's engagement with it play a decisive role in the comics' affirmation/negation politics. Can anyone think of either similar comics OR secondary texts which might help my thesis?",
        "created_utc": 1482303105,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find historical sales figures for American poets?",
        "author": "Hyas",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jfnyy/where_can_i_find_historical_sales_figures_for/",
        "text": "Hello AskLiteraryStudies,\n\nI'm an English major and I'm in the process of writing my Bachelor's thesis about American political poetry from 1939-1941. I'm interested in how different poets dealt with the question of US intervention in the Second World War. \n\nThus far, I've selected three poets to focus on: Edna St. Vincent Millay, Langston Hughes and ee cummings. I would like to know how popular/influential these poets were when they engaged in the public debate over the war. I figured the most direct way to assess that would be sales figures of their publications. Do you have any idea where I can find these figures?",
        "created_utc": 1482266977,
        "upvote_ratio": ""
    },
    {
        "title": "Northern Irish literature",
        "author": "readingeliot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5jf03h/northern_irish_literature/",
        "text": "Hello fellow literary folk, \nI'm a student of English language and literature and for my British society &amp; culture module I've chosen to do a presentation on Northern Irish literature (since NI is so damn beautiful). I'm going to do my own fair share of research of course, but I was wondering if you know anything about it / would like to recommend something. \nSo far, all I've got to go on is Seamus Heaney. ",
        "created_utc": 1482260062,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"The Prince\" satire?",
        "author": "TerraViv",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5j6akd/is_the_prince_satire/",
        "text": "Just heard for the first time from a friend that Machiavelli's \"The Prince\" is satire. Curious what you guys think of this, since I'm fairly uneducated in the matter. Should I just take this to the history subs, or...? \n\nFor quick reference, I've got this thread which I've been going through:\n\nhttps://www.reddit.com/r/AskHistorians/comments/112y2b/was_the_prince_by_machiavelli_written_as_satire/\n\nas well as his link, here:\n\nhttp://www2.idehist.uu.se/distans/ilmh/Ren/flor-mach-mattingly.htm\n\nThoughts? Opinions? Other knowledge?",
        "created_utc": 1482152952,
        "upvote_ratio": ""
    },
    {
        "title": "Books on the contemporary reception of 'little magazines' inc. BLAST!",
        "author": "Shamrayev",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5j5mu2/books_on_the_contemporary_reception_of_little/",
        "text": "Title pretty much accounts for this. Researching Wyndham Lewis, little magazines and literary networks, so anything you can suggest in this field would be v. welcome. ",
        "created_utc": 1482141568,
        "upvote_ratio": ""
    },
    {
        "title": "Star Wars Novels",
        "author": "samwisethebrave364",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5j3ujn/star_wars_novels/",
        "text": "Are there any Star Wars novels out there, new or old, which have real literary merit? If so, what are they, and what qualifies them as such?",
        "created_utc": 1482113297,
        "upvote_ratio": ""
    },
    {
        "title": "From the medieval Spanish text \"El Conde Lucanor\", what is the source from which the 49th tale is taken?",
        "author": "ReclaimLesMis",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5j3cul/from_the_medieval_spanish_text_el_conde_lucanor/",
        "text": "Edit: Since I screwed up the title, by Spanish read Castilian (sorry to any Catalonians, Galicians or other linguistic minorities in Spain).",
        "created_utc": 1482106988,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any supplementary Shakespeare texts for better understanding that you would recommend?",
        "author": "Airtogold",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5j1fgu/are_there_any_supplementary_shakespeare_texts_for/",
        "text": "I'm getting ready to take a Shakespeare class for the first time, and while I enjoy Shakespeare, I don't feel like I'm getting nearly as much from the plays as I could. Are there any good books or sources that can help break through Shakespeare so that I can get more out of the plays when I read them?",
        "created_utc": 1482084270,
        "upvote_ratio": ""
    },
    {
        "title": "Is it correct to make sure that I interpret a quote as the author intended and avoid philosophical derivation, if yes then how?",
        "author": "Proverbs_18-15",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5izp6a/is_it_correct_to_make_sure_that_i_interpret_a/",
        "text": "",
        "created_utc": 1482057323,
        "upvote_ratio": ""
    },
    {
        "title": "Isolation and Lord of the Flies?",
        "author": "Ab41010",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5isfwv/isolation_and_lord_of_the_flies/",
        "text": "[removed]",
        "created_utc": 1481944114,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Affordable &amp; Contemporary Copy of Marcel Schwab's \"Imaginary Lives\"",
        "author": "trotskyjohnpaul",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5isfc4/seeking_affordable_contemporary_copy_of_marcel/",
        "text": "In an attempt to follow the trail of breadcrumbs Borges left from his journey through the above title to his first collection, *A Universal History of Infamy*, I thought I'd be doing myself a service by tracking down a copy on Amazon. [Cue trombone sounds] The more affordable paperback (presumably a 1952 printing) runs $48.98 before shipping.\nI would happily pony up the fifty-odd dollars for this, but I thought I would consult the Schwob experts, if there are any hiding in the recesses of this subreddit. \n\n**TLDR: Anybody know of an affordable, contemporary translation of Marcel Schwab's *Imaginary Lives*?**",
        "created_utc": 1481943874,
        "upvote_ratio": ""
    },
    {
        "title": "What is the term used when a character who was formerly 'bad' becomes 'good' or vice versa?",
        "author": "Mister_Positivity",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5iqm3u/what_is_the_term_used_when_a_character_who_was/",
        "text": "There must be a specific word for this but I cannot recall it for the life of me. Babyface wrestlers become heels. Villains become allies whatever. See this a lot in shows like Once Upon a Time for a common pop example.",
        "created_utc": 1481921142,
        "upvote_ratio": ""
    },
    {
        "title": "I ran into this bizarre author introduction this semester...",
        "author": "wowsuchdrum",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5iq7hc/i_ran_into_this_bizarre_author_introduction_this/",
        "text": "http://imgur.com/a/2f9BG\n\nCan anyone explain this?? From the Longman Anthology of British literature. We needed to read this before reading Milton this semester and I can't understand why such a bizarre anecdote would be made. Reading the rest of the page gives no clues as to what it even means. \n\nI had a good laugh anyway.",
        "created_utc": 1481916792,
        "upvote_ratio": ""
    },
    {
        "title": "What options open up to Literature Students at different levels of study?",
        "author": "Airtogold",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ik6ax/what_options_open_up_to_literature_students_at/",
        "text": "I am a student about to get their Associates Degree in English Literature and am planning on continuing on to a Bachelor's degree next. I'm faithful in my future, but I don't know what work I will be able to get with my degrees, which makes me nervous at times. What I'm wondering is: what career opportunities open up to you when you get to higher levels in your education? Is it worth it to continue on to a Masters or Doctorate? and is my idea about a lack of career opportunities once I've gotten a Bachelor's degree correct?",
        "created_utc": 1481836733,
        "upvote_ratio": ""
    },
    {
        "title": "How did average people in the audience understand Shakespeare's plays during his own time?",
        "author": "SteamingFirst",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ij8a0/how_did_average_people_in_the_audience_understand/",
        "text": "I mean, there's a very clear difference between the language he uses and that of his contemporaries. It is clearly much more difficult to understand, especially spontaneously on a stage. Just imagine being an average playgoer with no education and hearing this for the first time:\n\n\"...If it be now,\n'tis not to come; if it be not to come, it will be\nnow; if it be not now, yet it will come: the\nreadiness is all: since no man has aught of what he\nleaves, what is't to leave betimes?\"\n\nHow would they understand such complicated grammatical structures spoken out loud? They clearly would not be able to process it, even if they were highly educated. They must have understood the basic plot, but it's impossible that they completely understood some passages clearly. ",
        "created_utc": 1481827253,
        "upvote_ratio": ""
    },
    {
        "title": "Why were ancient and modern units used interchangably in Xenophon's Anabasis English translation?",
        "author": "tyrantOsiris",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5igwlq/why_were_ancient_and_modern_units_used/",
        "text": "I'm reading 'The March of the Ten Thousand' tranlation by H.G Dakyins and am curious as to why when measuring distances, it uses both the ancient units such as Parasangs and modern miles when describing similar scenarios. \n\nWhy does he do this?",
        "created_utc": 1481799139,
        "upvote_ratio": ""
    },
    {
        "title": "How do you really analyze a literary work?",
        "author": "Seymour_John",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ignea/how_do_you_really_analyze_a_literary_work/",
        "text": "I occasionally read published literary criticisms and it seems to me that what literary critics do mostly is close read this passage and then this passage and then this passage and connect them together. Is this actually how you can analyze a literary work? Could you give me some concrete guidelines on how I can do it correctly?",
        "created_utc": 1481794365,
        "upvote_ratio": ""
    },
    {
        "title": "Why is William Gaddis still on the fringe?",
        "author": "keats_stevens",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ifo48/why_is_william_gaddis_still_on_the_fringe/",
        "text": "Gaddis' work is deemed difficult reads, which many use as an explanation for its continuing obscurity; yet Ulysses, for example, is a more experimental and arguably more difficult novel, and yet it is world famous.\n\nWhy do you think this is?",
        "created_utc": 1481778382,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever met one of your favourite writers? How did it go?",
        "author": "readingeliot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i9i8g/have_you_ever_met_one_of_your_favourite_writers/",
        "text": "I'm going out for coffee tomorrow with one of the most famous writers in my country (Slovenia) / one of my all-time faves and I'm nervous af. ",
        "created_utc": 1481704091,
        "upvote_ratio": ""
    },
    {
        "title": "Have you ever met one of your favourite writers? How did it go?",
        "author": "readingeliot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i9i8d/have_you_ever_met_one_of_your_favourite_writers/",
        "text": "[removed]",
        "created_utc": 1481704089,
        "upvote_ratio": ""
    },
    {
        "title": "What is the state of Lawrence Buell's *Toxic Discourse* in ecocriticism? Is it overlooked, overshadowed, or has it even challenged how one approaches environmental and ecocritical texts?",
        "author": "emptydiner",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i67n4/what_is_the_state_of_lawrence_buells_toxic/",
        "text": "I'm open to any direction this takes and having a little problem with understanding the use of \"toxicity\" within toxic discourse.  Is it an attempt to measure, classify, or label the value of toxic discourse?",
        "created_utc": 1481663330,
        "upvote_ratio": ""
    },
    {
        "title": "I do not understand how Freud's writings on philosophy/psychology seemingly absolutely transformed our understanding of literature. Could someone dumb it down more than they think it is reasonable?",
        "author": "PCLD",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i64oa/i_do_not_understand_how_freuds_writings_on/",
        "text": "Here's what I've pieced together so far:\n\nFreud introduced the idea that the subconscious was a powerful force in our lives. Because of this, literature could reflect our subconscious and possibly be a better window into it than simple introspection and logical thinking, as (say) Descartes might have done. This gave literary departments a new tool to understand literature (through psychology), and psychology a new tool to understand psychology (through literature).\n\nI feel like I am missing so much, and what I have is wrong.",
        "created_utc": 1481662534,
        "upvote_ratio": ""
    },
    {
        "title": "Affective Turn",
        "author": "Happylittlehead",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i2aec/affective_turn/",
        "text": "Can anyone tell me roughly what people mean by the 'Affective Turn' in literary studies circa 1990s? \nI understand it's paying more attention to emotions etc. but could do with a bit more info, and who were the main theorists leading it? Are there any articles out there that might provide a good overview? When I search it doesn't seem to come up with much that is focused on literature. \n\nThank you in advance,",
        "created_utc": 1481613618,
        "upvote_ratio": ""
    },
    {
        "title": "What is the purpose of Joyce not using punctuation in his dialogue?",
        "author": "FKA-FKA-FKA",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i0oov/what_is_the_purpose_of_joyce_not_using/",
        "text": "[removed]",
        "created_utc": 1481592202,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a short story about humans leaving Earth, probably from Isaac Asimov",
        "author": "Malimalo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5i0l9t/looking_for_a_short_story_about_humans_leaving/",
        "text": "Hello. Hopefully I'm posting in the right place, please accept my apologies if I'm not.\n\nI'm trying to find the title of a short story I read a long time ago, which is most likely from Isaac Asimov (or maybe Ray Bradbury ?), in which humans permanently leave Earth to Mars (or Venus, I can't remember for sure) because Earth's ressources are becoming scarce (or because the planet is becoming too polluted, something along this line). Maybe it's the last spacecraft leaving Earth, I'm not sure.\n\n&lt;SPOILER&gt;\nOnce they get to Mars (or Venus), they find out (I don't remember how) that it's actually not the first time humans were on Mars (or Venus). They finally understand that the whole \"sucking everything from our home planet then leaving to a new one\" thing already happened once : humans were originally from Mars (or Venus), which they dried up and left to Earth, something which had then been forgotten.\n&lt;/SPOILER&gt;\n\nDoes this ring a bell to anyone ? Can you help me find the title of the short story ?\nThank you very much in advance\n",
        "created_utc": 1481591020,
        "upvote_ratio": ""
    },
    {
        "title": "Podcasts about literary studies or analyzing literature?",
        "author": "Chiquye",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hzva8/podcasts_about_literary_studies_or_analyzing/",
        "text": "Hey does anyone have an references for podcasts that analyze books and others, or lit theory in general? I have found some that occasionally touch on it (entitled opinions, some of the how stuff works network shows) and one that does (the casual academic) but I am looking for more, in order to broaden my scope. Thanks! ",
        "created_utc": 1481583045,
        "upvote_ratio": ""
    },
    {
        "title": "Value question about Dante's Divine Comedy",
        "author": "carryingbricks",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hy0ca/value_question_about_dantes_divine_comedy/",
        "text": "If one does not accept Theism, or Divine Command Theory, or the tenets of Catholicism, or any religious based ethical framework, does *The Divine Comedy* contain interesting, compelling insights about how we ought to live and how we ought to treat others? Can it be persuasively argued that the poem is in favor of what might be called secular ethical values? And, if not (as a bonus question), do you feel the cultural relevance or value of the poem is thereby diminished to a degree worth mentioning?\n\nThank you 😊",
        "created_utc": 1481565018,
        "upvote_ratio": ""
    }
]