[
    {
        "title": "Thoughts on These Two Lines",
        "author": "iuseyourwifi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/660s8f/thoughts_on_these_two_lines/",
        "text": "[removed]",
        "created_utc": 1492490591,
        "upvote_ratio": ""
    },
    {
        "title": "Criticism on Langstong Hughes and the Harlem Renaissance?",
        "author": "BronsonSenpai",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65x33t/criticism_on_langstong_hughes_and_the_harlem/",
        "text": "Starting a research paper, just looking for a good place to start. Any relevant works are appreciated, but I'm especially interested in his blues poetry.",
        "created_utc": 1492451064,
        "upvote_ratio": ""
    },
    {
        "title": "Passage of time in Shakespeare plays?",
        "author": "redditisntworthit",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65vuj5/passage_of_time_in_shakespeare_plays/",
        "text": "I'm reading Measure for Measure now which compresses what feels like a month's worth of events into a few days. Is this typical of Shakespeare, or does he have events unfold at different paces in different plays? In either case, is there any material that discusses this aspect of his plays?",
        "created_utc": 1492439164,
        "upvote_ratio": ""
    },
    {
        "title": "What would this Literary Technique be called?",
        "author": "iuseyourwifi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65ruvl/what_would_this_literary_technique_be_called/",
        "text": "In novel I am currently reading, the main character \"Charlie\" keeps mentioning \"finding the bad guy\". The way he speaks about it makes me think he knows deep down that he's the bad guy. But he's just too afraid to admit it to admit it to himself?  What literary technique would be in use here?  Thanks\n\nP.S- He is \"the bad guy.\"",
        "created_utc": 1492381969,
        "upvote_ratio": ""
    },
    {
        "title": "Is posible to write poetic prose?",
        "author": "ca3games",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65rej3/is_posible_to_write_poetic_prose/",
        "text": "Hi, I want to ask, is possible to write prose that follows the metrics and rules of poetrhy, or write prose that tries to tell a narrative like prose.\n\nOr a combination of both prose and poetrhy?",
        "created_utc": 1492376625,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding polygloth literature.",
        "author": "ca3games",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65qgvd/question_regarding_polygloth_literature/",
        "text": "Is there any literature where words from diferent languages are used in an artistic sense, disregarding actually looking to sound like a real language and more like a wordplay where the words are chosen because of their sounds, seeking in the end a musical effect?\n\nThe only one I can remember is the Chi chinese poem where all the poem is made from words that share the same sound, using diferent chinese dialects.",
        "created_utc": 1492365982,
        "upvote_ratio": ""
    },
    {
        "title": "Need some guidance regarding a Literature entrance examination I'm about to take",
        "author": "klopperpawt",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65q3lz/need_some_guidance_regarding_a_literature/",
        "text": "I've done by Bachelors in English literature through an open university correspondence course  and did not get many opportunities to develop my writing skills. I'm going to take an  entrance examination in a month which has essay type questions, each worth thirty marks. I'm very unsure how to go about formulating my answers. I'm aware of what I want to say (largely) but I don't know how long the answer should be or what the \"correct\" way of answering it is. \n\nFor example : 'Shakespeare is not an author, but a powerful cultural token' a site where meaning is established and where it must be contested. Discuss. \n\nThis is a question from a previous year's paper and I have no idea how to tackle it. \nAlso what is the best method to tackle unseen poetry? \n",
        "created_utc": 1492361864,
        "upvote_ratio": ""
    },
    {
        "title": "A question regarding the relationship of writing and music composition.",
        "author": "ca3games",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65p8tg/a_question_regarding_the_relationship_of_writing/",
        "text": "ok, so I've finished the TTC course on writing, and they explain writing as a process of crafting sentences and mastering long sentences.\n\nSo far I've saw it very related to music composition, at least in the academical sense, where a long and master work is started from a small phrase (both in music and writing) and develop this seed until it becomes a master work, through diferent means of composition.\n\nAm I correct in my suspiction?\nOr Am I missing something?",
        "created_utc": 1492351439,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of James Wood as a literary critic?",
        "author": "Seymour_John",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65oslf/what_do_you_think_of_james_wood_as_a_literary/",
        "text": "",
        "created_utc": 1492344327,
        "upvote_ratio": ""
    },
    {
        "title": "I'm considering studying literature, I just have a question.",
        "author": "hellopotentialfriend",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65ky61/im_considering_studying_literature_i_just_have_a/",
        "text": "...If you wouldn't mind answering.\n\nSo I'm very much into the arts, music, art, literature etc. I know what it feels like to fall in love with an artwork, be it a composition or a poem, and want to dedicate three years to this, studying literature as a mature student at some point. I just have one question.\n\nDo you have to work to appreciate? Obviously, I know an English Literature degree requires plenty of work, but is it the case that it takes long, sustained effort with a particular writer or poem to actually appreciate and enjoy it, before proceeding to study it in a critical sense? I love Sylvia Plath, Yeats, Shakespeare among others, but there are some authors like Eliot and Keats who I just don't get anything from. \n\nIs it the case that you just need to chip and chip and chip away at some authors in order to finally *get* it and be able to appreciate their artistry? Or is it the case that if I'm not feeling the artistry after a certain initial period, I probably won't ever? Is it normal for readers to approach writers/poems and at first feel nothing of the artistry, cultivating an appreciation over a sustained period of time? Or is there something deficient in my perceptive aesthetic abilities that I'm not immediately stirred and inspired upon reading a poem of Keats' (Keats as an example)?\n\nOf course, I know personal aesthetic taste comes into the equation too, but when the figures are so towering as Keats and Eliot (as examples) are, you have to wonder whether it's coming from the reader's end, rather than the author's. Thanks!",
        "created_utc": 1492284726,
        "upvote_ratio": ""
    },
    {
        "title": "BS Johnson literary techniques",
        "author": "amelie294",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65k4sc/bs_johnson_literary_techniques/",
        "text": "Hi. I am currently a masters student studying English and experimental writing. I am planning on writing an essay on BS Johnson's use of literary techniques, such as non-linearity and multiple retellings. Any suggestions of critical material or any useful comments would be much appreciated. Thanks.",
        "created_utc": 1492275747,
        "upvote_ratio": ""
    },
    {
        "title": "Your thesis is National identity in minority literature. How would you approach to methods and interpretation?",
        "author": "MajklE63",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/65i5zr/your_thesis_is_national_identity_in_minority/",
        "text": "My dissertation thesis is about national identity in literature of minorities. I read books from psychology, sociology and cultural studies. Also postcolonial theory. \n\nMy interpretation is based on acultural changes (assimilation, marginalism...), states of identity (diffusion, moratorium etc), contents of historic memory, but I think that I can do better. \n\nCan you recommend me anything, that can help? Methods of interpretation, approach? ",
        "created_utc": 1492245966,
        "upvote_ratio": ""
    },
    {
        "title": "Need help 'wising' up this idea/theme for an analysis essay on Things Fall Apart?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/652xyg/need_help_wising_up_this_ideatheme_for_an/",
        "text": "[deleted]",
        "created_utc": 1492052247,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions on how to approach Heart of Darkness?",
        "author": "redwildlingprincess",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/651vcm/suggestions_on_how_to_approach_heart_of_darkness/",
        "text": "Hey all,\n\nI'm currently an undergrad student majoring in English with a concentration in Literatures, Language, and Criticism. I am about to start reading Heart of Darkness for my Lit Theory class and I was wondering if anyone had some suggestions on what to look out for specifically, and important themes, or any extra reading I could do that might help me out. Thanks :)",
        "created_utc": 1492039834,
        "upvote_ratio": ""
    },
    {
        "title": "Q: method for analyzing the depiction of females in Donald Duck comics?",
        "author": "Wolkenwald",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64xka1/q_method_for_analyzing_the_depiction_of_females/",
        "text": "Dear redditors!\nI'm writing my thesis about the depiction of female characters in Donald Duck and Micky Mouse Comics. To be exact, I write about their depiction in the German magazine \"Micky Maus\" (which has comics from the USA in translation as well as European ones), which is printed every week since 1951 until now. I want to see if the depiction of females (Daisy Duck, Grandma Duck, Minnie Mouse...) has changed over the years.\n\nI already had a look at a lot of methods, but I couldn't find any that actually fits my topic. Do you have any ideas, reading tips etc.? I thought about discourse analysis, but now I think this isnt the right thing for the analysis of a single magazine but rather a bigger pool of printed things. Any ideas? Thank you so much!!",
        "created_utc": 1491996687,
        "upvote_ratio": ""
    },
    {
        "title": "In terms of genre, what exactly is \"fantasy-adventure\" and how does it differ from fantasy, high-fantasy and myth? What are its conventions?",
        "author": "KrombopulousPichael",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64w8yx/in_terms_of_genre_what_exactly_is/",
        "text": "I'm really struggling to differentiate between them, any help would be appreciated!",
        "created_utc": 1491974079,
        "upvote_ratio": ""
    },
    {
        "title": "Not losing the fiction you read",
        "author": "LightMyScars",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64w5vw/not_losing_the_fiction_you_read/",
        "text": "Lately, I have been developing a desire to remember more of what I read: the content, the reading experience and, perhaps most of all, my takeaways. I am finding it difficult, however, partly because of the sheer amount of material I am exposed to in literature and in other fields of art. (In a way, then, my question is equally relevant to these fields as well.)\n\nHow do you remember the fiction you read? Do you bother to take active steps to retain it (and if so, what are they)? Do you prefer creating \"gateways\" for re-experiencing fiction, such as placing sticky notes or highlighting passages you found especially worthy? Or are you just satisfied with whatever sinks in naturally?",
        "created_utc": 1491972840,
        "upvote_ratio": ""
    },
    {
        "title": "Advice about critical theory/political theory grad programs?",
        "author": "MisterMcNeil",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64s6wz/advice_about_critical_theorypolitical_theory_grad/",
        "text": "Hello! First time poster. Not sure if this kind of post is allowed in this sub. I'm in the process of searching for graduate programs that offer joint degrees in law and critical theory and I'm having a hard time finding resources to guide my search.  \n\nIf it helps, my favorite political/critical theorists are Wendy Brown, Benjamin, Deleuze, Wolin and Arendt. \n\nWould love to hear anyone's thoughts about programs or be pointed in the direction of ANY resources that might help me get some perspective on programs.",
        "created_utc": 1491930817,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to remember a certain term i learned in 8th grade",
        "author": "drjimmybrrungus",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64r7bi/trying_to_remember_a_certain_term_i_learned_in/",
        "text": "I'm not a guy that would normally ever frequent a board like this, but i'm just kind of bored and trying to remember a certain Literary term i learned in 8th grade, it's a word that means something along the lines of something magical or fantastical happening out of no where in an otherwise \"normal\" setting.\nI remember we learned it in reference to the part of Harrison Bergeron where he flys up into the air and dances at the end.  \nEdit: honestly now that i've thought about it a better way to describe it is when something \"surreal\" happens out of no where.",
        "created_utc": 1491921445,
        "upvote_ratio": ""
    },
    {
        "title": "Copyright Experiation of Walter Benjamin's \"The Origin of German Tragic Drama\"",
        "author": "JackDorito",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64ofsp/copyright_experiation_of_walter_benjamins_the/",
        "text": "I was wondering if anybody knew when the copyright for Walter Benjamin's *The Origin of German Tragic Drama* expires. I have been going over the English translation of this book extensively for my thesis, and it is riddled with conjugation errors and translations of words that obfuscate this text's relationship to other critical works, most notably Giorgio Agamben's *State of Exception.* It has been so frustrating to work with this translation that I would like to know if it would be possible to publish a new translation any time soon, or if Benjamin's estate still maintains rights over his works. ",
        "created_utc": 1491881088,
        "upvote_ratio": ""
    },
    {
        "title": "How can I know how strong my chance is of getting into a decent MFA program in the US?",
        "author": "mvssive",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64nfv1/how_can_i_know_how_strong_my_chance_is_of_getting/",
        "text": "I have no idea if my poetry is good enough, especially since I never studied English in undergrad. Not a big fan of wasting my time and money applying to MFA programs just to get rejected from any decent one that will at least partially pay for itself (I already have enough loans, thanks). I wish there was someone I could ask about my writing samples! ",
        "created_utc": 1491869603,
        "upvote_ratio": ""
    },
    {
        "title": "Info on African American Literary Theory?",
        "author": "NecroSpace",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64mv1r/info_on_african_american_literary_theory/",
        "text": "I'm doing a project on African American literary theory, but I've come into some trouble. I can't find any resources online revolving around the topic. I decided to go the library and couldn't find any books on the topic, only a book about literary theory where African American literary theory had less than a 2 page mention. Does anyone know any good resources for the topic?\n",
        "created_utc": 1491863299,
        "upvote_ratio": ""
    },
    {
        "title": "Good general works on literary criticism?",
        "author": "AnnaFromCT",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64m1l2/good_general_works_on_literary_criticism/",
        "text": "I'm looking to expand the language with which I *think* about what I'm reading. For an indicator of the \"general\" quality, in the past I've read and enjoyed to varying extent\n\n* How to Read Literature Like a Professor\n* How Fiction Works\n* Reading like a Writer\n\nI've had my eye on Eagleton, Gass, Nabokov, Bloom and other works in this area. I don't find that I'm much interested in theory. \n\nAre there any books/essays that you guys would recommend? Thanks for any help.",
        "created_utc": 1491855120,
        "upvote_ratio": ""
    },
    {
        "title": "Was the Hardboiled Detective of film noir and pulp magazines an answer to some earlier trope? For example can Philip Marlowe trace his lineage to Sherlock Holmes?",
        "author": "chikindiner",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64ll95/was_the_hardboiled_detective_of_film_noir_and/",
        "text": "Here's Philip Marlowe (Raymond Chandler's character):\n\n&gt;I'm a licensed private investigator and have been a while. I'm a lone wolf, unmarried, getting middle aged, and not rich. I've been in jail more than once and don't do divorce business. I like liquor and women and chess and a few other things. The cops don't like me too well, but I know a couple I get along with. I'm a native son, born in Santa Rosa, both parents dead, no brothers and sisters, and when I get knocked off in a dark alley sometime, if it happens, as it could to anyone in my business, nobody will feel the bottom has dropped out his or her life. \n\nSince I'm pretty sure everyone had just about the same voice in their head while reading that, a follow-up is: How did Humphrey Bogart's voice become emblazoned onto this character?\n ",
        "created_utc": 1491850871,
        "upvote_ratio": ""
    },
    {
        "title": "Critical theorists: I need some scholarly assistance here with some tricky literary terminology: cipher vs hieroglyph vs symbol. (Long question in text below.)",
        "author": "askingquestionsblog",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/64fjhy/critical_theorists_i_need_some_scholarly/",
        "text": "I have often used the word \"cipher\" to mean a character whose existence in a story or play is used represent an abstract, sort of like the young girl and the Colonel in Mona Gardner's \"The Dinner Party,\" who are not important to the story as human characters so much as exist to represent opposing forces of youth/the feminine/progressive, changing times/the oppressed, and tradition/authority/power/the masculine/oppression, respectively. They are not fleshed-out characters; they only exist to establish a situation that is reflected on later. I have always called this SPECIFIC type of symbol, i.e. a human de-humanized into an abstract essence, a \"cipher.\"\n\nI have recently heard others use the term \"hieroglyph\" in similar situations, and I'm wondering if anyone has come across that usage and what they think of it, and if there is a coherent set of parameters that divides and clarifies symbol vs metaphor vs cipher vs hieroglyph.\n\nI wish I spoke German, because the only help I have been able to get in this area in my research has been a one-sentence English translation of a German work on Romantic Symbolism: \"Vonessen argues that 'allegory, metaphor, cipher, hieroglyph, analogy, trope, representation' were all potentially used as synonyms for 'symbol' by the Romantics.\" This, from a essay called \"Der Symbolbegriff in der Romantik\" by Renate Vonessen, from an anthology called *Beiträge zu Symbol, Symbolbegriff und Symbolforschung* (1982).\n\nI don't want the kind of worksheet definitions 9th grade English teachers give their students (a metaphor is a comparison between two things that does not use \"like\" or \"as\"... oh, blah!). I'm looking for a more penetrating and thoughtful insight into the subtle differences between these terms, and how you understand them to be used. Thanks!\n",
        "created_utc": 1491773592,
        "upvote_ratio": ""
    },
    {
        "title": "Some assistance with these questions about English literature my professor gave us for midterm exams",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/649lnf/some_assistance_with_these_questions_about/",
        "text": "[removed]",
        "created_utc": 1491688074,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find great literary criticism for free? How can I access JSTOR as someone who's not in school?",
        "author": "-methane-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/648sou/where_can_i_find_great_literary_criticism_for/",
        "text": "Lately I've been mindlessly watching reaction videos of Dragon Ball Z Abridged on YouTube. There's something about seeing how other people feel about something I love that's always appealed to me. When I was in high school, I would read lit crit essays on Salinger, Faulkner, and Woolf, just for fun. \n\nNow that I'm getting back into classic literature, I'd like to do the same thing. But since I'm not in school, I'm not really sure how to find this stuff., especially since JSTOR seems to be restricted to students. Can anyone help me?",
        "created_utc": 1491678731,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions for MA thesis topic in English Studies",
        "author": "Bearisi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/642ci0/suggestions_for_ma_thesis_topic_in_english_studies/",
        "text": "I am interested in pursuing a masters degree in English Studies, however, I find myself to be stumped as to what to pursue as a topic. These are some of the ideas I have been deliberating:\n\n1. Something in the field of 'critical' English Language Studies as I work in a the education sector in South Africa, where there is a lot of controversy surrounding the teaching of English - so in particular I am interested in the Language in Education Policy here and the impact that has as well as the actual curriculum.\n\n2. I love African fiction. I've always thought that The Cry of Winnie Mandela would make a lovely book to do a study on because of its layeredness and depth. \n\n3. I also love feminist literature and theory... not sure which novel would be suitable here - there are so many!\n\nAny suggestions would be helpful. &lt;3\n",
        "created_utc": 1491591184,
        "upvote_ratio": ""
    },
    {
        "title": "Articles on New Sincerity / David Foster Wallace",
        "author": "Blaiser12",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/641dym/articles_on_new_sincerity_david_foster_wallace/",
        "text": "Since recently reading E Unibus Pluram for one of my classes, I've become somewhat fascinated with the concept of New Sincerity, largely because it articulates a lot of the issues I have with swathes of postmodern writing. I've been looking for articles taking this discussion further, but beyond passing references and Adam Kelly's article 'David Foster Wallace and the New Sincerity in American Fiction' I've struggled a little. \n\n\nTo be specific I'm not necessarily looking for articles on how Wallace's writing embodies these principles, but just broader considerations of New Sincerity, or as in contrast with works like Generation X that seem to exemplify the issues Wallace was talking about. ",
        "created_utc": 1491582005,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about how to conduct a discourse analysis",
        "author": "Izzi_Skyy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63z1n5/questions_about_how_to_conduct_a_discourse/",
        "text": "Hello, AskLitStu,\n\nI'm currently working on a project for my senior capstone. I'm working on looking at the relationships between class and sexuality in Edith Wharton's *The House of Mirth*. Specifically, I'm arguing how social status and economic class relate to sexuality and how sexuality reproduces the two, especially through marriage.\n\nI'm hitting a roadblock here because my professor is requiring a discourse analysis of something at the time. I'm attempting to look at marriage practices and the discourse around \"gold diggers\" (for lack of a better word). He's put a restriction that we can't use sources published more than ten years after the novel, so 1915 for me.\n\nI can't find anything with \"gold digger\" or other phrases like \"transactional marriage.\" Futhermore, my library database only searches 100 years back. Is there any way I could find a better term that may have been used then or other, related concepts? And is there any better place online to find historical documents, newspapers, etc. that were written more than 100 years ago?\n\nThanks in advance!",
        "created_utc": 1491551487,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a trope name or a genre that involves a big effort/journey/adventure eventually being useless?",
        "author": "EnkaOwakura",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63vgut/is_there_a_trope_name_or_a_genre_that_involves_a/",
        "text": "I am interested in texts were huge efforts of the characters end up being futile, specially when compared to simpler things, like coincidence. My writing always seems to have that element of frustration and \"all for naught\" mentality, but not with the typical man vs. fate aspect (as in Oedipus Rex). I have an example that I just imagined (my idea is stupid but I can't find anything right now that exemplifies what I mean.\n\nExample: Man dies. Investigators suspect said man was killed by mafia boss that tried to \"make it look like an accident\". Investigation ends with pretty much everybody (on both sides) dead or maimed. Truth is the man slipped and fell from stairs.\n\nText recs (preferably with English or Spanish as the original writing language) would be appreciated.\n\nP.D. sorry for my awful English.",
        "created_utc": 1491509243,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any similarities between Marxism and Derrida's works?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63tryz/are_there_any_similarities_between_marxism_and/",
        "text": "[removed]",
        "created_utc": 1491493908,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone please find me a quote in the 'War Photographer' which identifies the irony of the protagonist's powerless position?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63sprc/can_someone_please_find_me_a_quote_in_the_war/",
        "text": "[deleted]",
        "created_utc": 1491483116,
        "upvote_ratio": ""
    },
    {
        "title": "Notable critical works of Moby Dick",
        "author": "greg_is_dreg",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63rujk/notable_critical_works_of_moby_dick/",
        "text": "I just finished my first reread of Moby Dick. God, what a book.\n\nTo further my understanding of things I undoubtedly missed I was looking to read some supplementary work on the book.\n\nAny suggestions?",
        "created_utc": 1491470327,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain the history of the Sandman?",
        "author": "totallynotamurder2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63r51o/can_someone_explain_the_history_of_the_sandman/",
        "text": "I'm trying to get an idea of the timeline of peoples perceptions of the Sandman and how they evolved over time. I read the wiki-page on the Sandman but I wasn't totally satisfied with Wikipedia's answer. From the wiki-page, I discovered that the traditional story is that the Sandman would come and visit children and toss sand in their eyes to put them to sleep and bring them dreams. It wasn't until 1816 when ETA Hoffman developed a more sinister spin-off of the traditional folklore tale. ETA Hoffman's version depicted the Sandman as someone who sneaks into children's bedrooms and steals their eyes to feed his children living in an iron nest on the moon. From what I can gather that is the only reason why the Sandman is perceived as a sinister figure. For example, in the video game Fallout 4, there is a perk called 'Mr. Sandman' that allows for extra strength when murdering with a silenced weapon. Or in the TV Show Bates Motel, the song Mr. Sandman is played in the background when serial murderer Norman Bates is on screen. Is ETA Hoffman's version of the story the more accepted version of the story? When and where are the origins of the traditional Sandman legend? I know that it's a German tale, but it seems to have strong ties to many regions of the United States.",
        "created_utc": 1491457820,
        "upvote_ratio": ""
    },
    {
        "title": "Would this be a metaphor?",
        "author": "MrKit678",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63py0k/would_this_be_a_metaphor/",
        "text": "\"They went in with guns a blaze\"\nWould this be a metaphor? 1) Your saying it IS 2) Guns aren't actually \"a blaze\"",
        "created_utc": 1491442377,
        "upvote_ratio": ""
    },
    {
        "title": "What's a good humorous but also literary short story or poem?",
        "author": "TheLincolnZombie",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63ozrv/whats_a_good_humorous_but_also_literary_short/",
        "text": "For a piece of coursework, I have to write on a text in an informal style, and I feel this would be aided by a humorous text, but am struggling to think of or find examples written in a literary style by someone relatively well-known and well-considered (which I feel would be needed for the coursework).",
        "created_utc": 1491431914,
        "upvote_ratio": ""
    },
    {
        "title": "Arthur Bennett calls his 1902 novel \"The Grand Babylon Hotel\" a \"fantasia on modern themes.\" What does this mean?",
        "author": "arklatex811",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63oge3/arthur_bennett_calls_his_1902_novel_the_grand/",
        "text": "",
        "created_utc": 1491426527,
        "upvote_ratio": ""
    },
    {
        "title": "Hamlet: \"an act hath three branches—it is to act, to do, to perform.\"",
        "author": "diddlyhohum",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63nj0s/hamlet_an_act_hath_three_branchesit_is_to_act_to/",
        "text": "I'm having trouble understanding this passage from the gravedigger scene in Shakespeare's *Hamlet*:\n\n\"For here lies the point: if I drown myself wittingly, it argues an act. And an act hath three branches—it is to act, to do, to perform. Argal, she drowned herself wittingly.\" (Act V, Scene I)\n\nAct, do, perform, all strike me synonymous. Is there a tangible difference between these concepts, or is it merely a tautology? I'm curious about what others think.",
        "created_utc": 1491417895,
        "upvote_ratio": ""
    },
    {
        "title": "Can't find a source for a piece of contextual information about gender and the Penelope episode of Ulysses, can anyone help?",
        "author": "the_ragamuffin",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63m5p9/cant_find_a_source_for_a_piece_of_contextual/",
        "text": "I once read that the reason Molly Bloom's stream of consciousness is so flowing is because Joyce believed (as many may have done at the time?) that men think in fragments, and women in constant flows of information. However, I can't now find this information again. It may have been in an analysis or it may have been a quote from one of Joyce's letters; I'm just not sure. Could anyone help me with a source?",
        "created_utc": 1491405530,
        "upvote_ratio": ""
    },
    {
        "title": "Why did Hemingway include this line?",
        "author": "buffyasuo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63fxk7/why_did_hemingway_include_this_line/",
        "text": "From The Sun Also Rises, Ernest Hemingway:\n\n\n\"The girl came in with the coffee and buttered toast. \nOr, rather, it was bread toasted and buttered.\"\n\n\n&amp;nbsp;\n\n\nI don't understand why Hemingway included that second sentence. Is it supposed to be ironical in some way? Am I missing some part of the joke?\nI know it's a really insignificant thing, but it bothers me like nothing else.\n\n\n&amp;nbsp;\n\n\n&amp;nbsp;\n\n\nHere's some context:\n\n“What’s all this irony and pity?”\n\n“What? Don’t you know about Irony and Pity?”\n\n“No. Who got it up?”\n\n“Everybody. They’re mad about it in New York. It’s just like the Fratellinis used to be.”\n\nThe girl came in with the coffee and buttered toast. Or, rather, it was bread toasted and buttered.\n\n“Ask her if she’s got any jam,” Bill said. “Be ironical with her.”\n\n“Have you got any jam?”\n\n“That’s not ironical. I wish I could talk Spanish.”",
        "created_utc": 1491329892,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with interpreting a passage from Hamlet",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63f15x/need_help_with_interpreting_a_passage_from_hamlet/",
        "text": "[deleted]",
        "created_utc": 1491321940,
        "upvote_ratio": ""
    },
    {
        "title": "Favorite Great Literary Romances?",
        "author": "I_eat_faeries",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63aps1/favorite_great_literary_romances/",
        "text": "Spring is so captivating in California right now and I'm enjoying my annual revisit of *Pride and Prejudice* so much that I feel compelled to know who your favorite great literary romances are. Mine:\n\nElizabeth Bennet and Fitzwilliam Darcy\n\nMolly Bloom and Existence Itself\n\nConstance Chatterley and Oliver Mellors\n\nDorian Gray and Every Unsuspecting Gentleman in London\n\nClarissa Dalloway and Sally Seton \n\nAnd lastly, the most controversial one I expect: Kate and Petruchio of Shakespeare's *Taming of the Shrew.* I own that I'm looking, here, through my personal lens constructed of my personal epoch in history, but I believe that Kate is a tremendously complicated character who has a lot of fun with the ferocity that Petruchio proves himself capable of. He's not afraid of her, unlike EVERYONE ELSE, and his wit matches hers, unlike everyone else. I take her \"transformation\" at the end as just another means of upending others' expectations: at that point, the biggest shock she can give those around her is playing the role of the demure wife.\n\n",
        "created_utc": 1491264484,
        "upvote_ratio": ""
    },
    {
        "title": "Self-determination Catch 22",
        "author": "Slasher320",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/63a0ta/selfdetermination_catch_22/",
        "text": "[removed]",
        "created_utc": 1491257074,
        "upvote_ratio": ""
    },
    {
        "title": "What is the connection between \"Do not go gentle into the night\" and \"Macbeth\"?",
        "author": "TheMatrix507",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/637t5v/what_is_the_connection_between_do_not_go_gentle/",
        "text": "[removed]",
        "created_utc": 1491236397,
        "upvote_ratio": ""
    },
    {
        "title": "Critical and historical context for dystopian novels (1984 and Hanmaid's Tale)",
        "author": "Fairenough123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/635w4f/critical_and_historical_context_for_dystopian/",
        "text": "Hi AskLiteraryStudies, this is my first post here, so sorry if I don't get the format right :) \n\nFor my A-level exam, nearly 50% of the marks goes to historical/cultural/critical context. I'm alright with this for more canonical texts such as Paradise Lost and Hamlet, but I'm struggling to find relevant critical views and reception for my Dystopian novels. I'm studying 1984 and Handmaid's Tale, so I've looked into the obvious paths - Stalinism, Huxley, H. G. Well, contemporary review, Second-wave feminism etc, but I'm struggling to find stuff that directly tackles the text the way say Greenblatt's Historicism or the humoural theory does for Hamlet. \n\nJust wondering if you guys have any thoughts on this? ",
        "created_utc": 1491215079,
        "upvote_ratio": ""
    },
    {
        "title": "Online course recommendations?",
        "author": "TheEnchantedHunters",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/6333y0/online_course_recommendations/",
        "text": "What freely available lectures/resources have you guys tried and can recommend? I'm most familiar with the [**Yale Open Courses**](http://oyc.yale.edu/courses), which has great lectures on literary theory, Don Quixote, Paradise Lost, The Inferno, The Bible, and quite a few others. There are also torrents out there for **The Great Courses** series with many good ones like David Thorburn's Modern Literature lectures. I'm also interested in (text)books. For example, Camille Paglia's ***Break Burn Blow*** does some incredible poem exegeses that makes me feel like I'm sitting in on an upper-level seminar. I'm also familiar with the Norton Anthology of literature but haven't tackled it yet. \n\nAlways looking to make up for the literature degree I wanted but never was able to formally pursue :)\n\n\nYour suggestions:\n\n* [Northrop Frye - The Bible as Literature](http://heritage.utoronto.ca/northropfryelectures)",
        "created_utc": 1491176229,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the most well-known works of literary criticism on Goethe's \"Faust\"?",
        "author": "survivor_jane",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/632tk2/what_are_some_of_the_most_wellknown_works_of/",
        "text": "",
        "created_utc": 1491173067,
        "upvote_ratio": ""
    },
    {
        "title": "This is driving me crazy please help.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/62ymfy/this_is_driving_me_crazy_please_help/",
        "text": "[deleted]",
        "created_utc": 1491121687,
        "upvote_ratio": ""
    },
    {
        "title": "Quick question on contemporary/postmodern Italian literature",
        "author": "ChalkPie",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/62m41n/quick_question_on_contemporarypostmodern_italian/",
        "text": "I'm not too familiar with Italian literature, but just wanted to ask a quick question. I've read If On A Winter's Night A Traveller and just started reading The Name of the Rose, and I'm curious if its a common trend in Italian literature to be so \"upfront\" with their postmodernist structures and movements. (I'm not sure if this is really the best way to phrase this). I've read American authors who I think are pretty similar--Nicholson Baker, John Barth, even Jeffrey Eugenides--but they seem to integrate what it'd consider their postmodern aspects into their writing more subtlety or organically than the Italians. Italian films, especially Neorealism, seem to be in line with the Italian novels in this regard, even to an extent more recent releases like the TV series The Young Pope.\n\nI could also certainly be misled by the fact that my sample size is pretty small. I know that there are definitely other authors working with the text in a way similar to what I've seen in Italian novels--Nabokov and Paul Auster come to mind. Just thought it would be nice if anyone could provide some insight.",
        "created_utc": 1490976482,
        "upvote_ratio": ""
    },
    {
        "title": "Who the hell wrote \"A touch of Infinity\"?",
        "author": "Sexyspider420",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/62l4bf/who_the_hell_wrote_a_touch_of_infinity/",
        "text": "Some sources are telling me Harlan Ellison and others are saying Howard Fast.",
        "created_utc": 1490966186,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a formal name for the structural trope/device of beginning at present day then going back in time to tell the story of how we got here?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/62iub5/is_there_a_formal_name_for_the_structural/",
        "text": "[deleted]",
        "created_utc": 1490930387,
        "upvote_ratio": ""
    },
    {
        "title": "Help about The Absolutely True Diary of a Part-Time Indian.",
        "author": "vexq54",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/62g1a7/help_about_the_absolutely_true_diary_of_a/",
        "text": "[removed]",
        "created_utc": 1490900507,
        "upvote_ratio": ""
    },
    {
        "title": "Help understanding Julia Kristeva's notion of the semiotic",
        "author": "uzzy-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/62dyft/help_understanding_julia_kristevas_notion_of_the/",
        "text": "Hi, I've recently stumbled across Julia Kristeva's theory about semiotics (and considering I know next to nothing about linguistics), I would really appreciate it if anybody could help give a brief overview of her ideas. A little critique of those ideas, as well as pointing me towards some supplementary resources/criticism of them would also be a great help!\nThanks. ",
        "created_utc": 1490880753,
        "upvote_ratio": ""
    },
    {
        "title": "What are some topics that connect Othello and The Two Gentlemen of Verona?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/628re4/what_are_some_topics_that_connect_othello_and_the/",
        "text": "[removed]",
        "created_utc": 1490814805,
        "upvote_ratio": ""
    },
    {
        "title": "General Q's about Italian writer Dacia Maraini",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/626h5q/general_qs_about_italian_writer_dacia_maraini/",
        "text": "[deleted]",
        "created_utc": 1490792601,
        "upvote_ratio": ""
    },
    {
        "title": "Secondary literature on the way poems 'move'?",
        "author": "blackbluegrey",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61vrbi/secondary_literature_on_the_way_poems_move/",
        "text": "I'll keep this brief because I'm not even sure what I'm asking.\n\nI'm interested in studies of poetry that look at the visual side of things, and how poems 'move' between images. I'm thinking along the lines of narrative space and the way the 'frame' can expand and contract depending on what is being depicted (visually or otherwise) to emphasise certain elements and minimise others. This is in conjunction with modernist poetry, if that's any help.\n\nApologies in advance for the imprecision.",
        "created_utc": 1490657171,
        "upvote_ratio": ""
    },
    {
        "title": "Undergrad module choice: Milton or Deconstruction?",
        "author": "M_JPB",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61vr0z/undergrad_module_choice_milton_or_deconstruction/",
        "text": "Hi r/AskLiteraryStudies ! I'm entering my final year as an undergraduate in English Literature and have to make an unsettling decision about what modules to take. The module on Milton clashes entirely with the module on Derrida and deconstruction. Shouldn't this been seen as a crime in our vocation? What am I to do? Should I, and how should I, complain? Both Milton and Derrida seem equally integral to this field of study.\n\nMilton, as we know, is one of the most influential and ubiquitously admired figures in the history of English writing. Is my degree worth the paper its written on if I come away without knowing the first thing about him? Derrida, on the other hand, is held in such esteem that, if I was to go on to further study without some inkling towards his ineffable methodology, I should be laughed at.\n\nIs this a common predicament that shouldn't concern me or do I have good reason to be disgruntled? What advice and suggestions do people have, and what module should I prefer?",
        "created_utc": 1490657078,
        "upvote_ratio": ""
    },
    {
        "title": "Did the first editions of 19th century novels have illustrations/drawings in them?",
        "author": "-methane-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61v30o/did_the_first_editions_of_19th_century_novels/",
        "text": "I've noticed, for example, Mark Twain novels from Modern Library will have the original illustrations included with them. But this seems rather childish to me so I have to wonder... do they come from a separate edition for children or did all copies of books have these illustrations? Was it just something books from that time period did?",
        "created_utc": 1490650077,
        "upvote_ratio": ""
    },
    {
        "title": "What does r/AskLiteraryStudies think about the New Oxford Shakespeare's Authorship Claims?",
        "author": "burkean88",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61ufz4/what_does_raskliterarystudies_think_about_the_new/",
        "text": "The latest Oxford UP edition of Shakespeare gives Shakespeare partial credit for two previously unattributed anonymous plays, as well as assigning co-authorship to Christopher Marlowe for all three parts of Henry VI.\n\nThe Feb 19th New Yorker has an article that provides a good summary of the claims and the methods of statistical analysis on which these new attributions were based.\n\nI'm neither a statistician or a specialist on the period, but I am skeptical about the new claims, especially the Marlowe attribution. Three reasons: first, it seems too obvious and satisfying that the 2nd most famous dramatist of the period just happened to be Shakespeare's early collaborator- and not Nashe, Kyd, or any of the other traditional candidates. \n\nSecond, I assume that these Shakespearean scholars are not primarily statisticians. I doubt that their methods are strictly \"scientific\"- they seem to have been searching for evidence of this conclusion; I'm not surprised that a false positive could arise. \n\nLastly, I can't help but feel that attributing authorship to Marlowe based on the occurrence of a few key phrase forms overstates what the evidence suggests. Could the lines not have easily been cribbed or unconsciously echoed from Marlowe, or inserted erroneously at some later date? \n\nI'd be especially interested to hear from any Elizabethan/Shakespeare specialists and from anybody with experience in statistical analysis.  ",
        "created_utc": 1490643789,
        "upvote_ratio": ""
    },
    {
        "title": "Unreliable narration equals first person? help (term paper)",
        "author": "azraelone",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61tjio/unreliable_narration_equals_first_person_help/",
        "text": "Hi!\nI've read that there must be people who critic that no first person is reliable. I'm currently writing my term paper on exactly this topic and I need some sources where lyric critics state that \"no first person character can be relialbe\". (because we all perceive events differently thorough our entire lives etc) Could you help me out and give me any examples that I could refer too? I mean authors that stated this idea or even wrote books about their critic on the term \"unreliable narration\" and that its some kind of the same thing. I can't find it! I'm eager to find sources about people who state that everyone of us sees and perceives events through our own kind of glasses. Maybe someone can help me! &lt;3\nThank you thank you thank you!!!",
        "created_utc": 1490635303,
        "upvote_ratio": ""
    },
    {
        "title": "\"Go to where the pain is\" principle of interpretation",
        "author": "intpladyexperience",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61so1o/go_to_where_the_pain_is_principle_of/",
        "text": "I remember hearing this given as a principle of interpretation in my literary theory or aesthetics course in college and I thought it would be easy to find the quotation and the author but I can't seem to find it. Is anyone else familiar with this ? Come to think of it it may have been originally in Spanish. Alternately if you don't know where this comes from, could there be another theorist that has said something similar ?",
        "created_utc": 1490627063,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why does the world report that Kate doth limp?\"",
        "author": "I_eat_faeries",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61s35k/why_does_the_world_report_that_kate_doth_limp/",
        "text": "I'm wondering if any of you Shakespeare scholars or theatre fans have seen *The Taming of the Shrew*'s heroine portrayed as having a physical disability. It seems clear to me that when Petruchio says:\n\n\"Why does the world report that Kate doth limp? Kate like the hazel-twig is straight and slender and as brown in hue as hazel nuts and sweeter than the kernels...\"\n\nHe's describing a woman with a disability who's disability makes her no less beautiful in his mind. I haven't found any scholarship that discusses this, though. Why does the world *not* report that Kate doth limp?\n\nWould love any references or views of your own on this topic!\n\n(Apologies, by the way, for my deeply imperfect formatting. I only use Reddit on the app on my phone, so there's a lot I'd do for an essay that I can't do here.)",
        "created_utc": 1490620823,
        "upvote_ratio": ""
    },
    {
        "title": "Does Bhabha use the 'Other' in a Lacanian sense of the symbolic order?",
        "author": "theJohann",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61rcc2/does_bhabha_use_the_other_in_a_lacanian_sense_of/",
        "text": "When he writes in Of Mimicry and Man, for example, that 'colonial mimicry is the desire for a reformed, recognizable Other', is he using the term in the Lacanian sense? \n\nI suppose that my question also includes other postcolonial theorists/writers who use the capitalized Other. \n\nThank you for your help, all! ",
        "created_utc": 1490610194,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best English translation of J.K. Huysmans' \"A rebours\"?",
        "author": "commentcest",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61or02/what_is_the_best_english_translation_of_jk/",
        "text": "I've been burned before, and I just want to make sure I buy the right one. (I read the Muir translation of \"The Metamorphosis\" before I read the others--I have many issues with the Muir translation, so I'm always very discerning when looking for translations.)   \n\nAre there any new translations? The only two I've come across so far are the Robert Baldick (Penguin) and the Margaret Mauldon (Oxford) translations.\n\nWhat are the accepted translations in academia?\n\nThanks.\n\n",
        "created_utc": 1490571329,
        "upvote_ratio": ""
    },
    {
        "title": "The Master and Margerita - two similar names.",
        "author": "Blargian1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61o2ud/the_master_and_margerita_two_similar_names/",
        "text": "In Mikhail Bulgakovs masterpiece of a book i have noticed there are two characters with names that are very similar. The first is the poet Homeless, Ivan Nikolaevich, and the second is Nikanor Ivanovich, chairman of the tenants association of 302-bis Sodovaya street where the recently departed Berlioz's apartment resides. I don't think it's just coincidence but i also can't draw any deeper meaning from it other than it is perhaps Bulgakovs humour at work through word play?\n\nAnyone have any take on this?  ",
        "created_utc": 1490563589,
        "upvote_ratio": ""
    },
    {
        "title": "Daniel Defoe's Moll Flanders: ironic or genuine?",
        "author": "uzzy-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61h4mq/daniel_defoes_moll_flanders_ironic_or_genuine/",
        "text": "[removed]",
        "created_utc": 1490467687,
        "upvote_ratio": ""
    },
    {
        "title": "\"the stone that broke the wagon clean in two\"",
        "author": "PaperNPen",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61elbj/the_stone_that_broke_the_wagon_clean_in_two/",
        "text": "What does this phrase mean? \n(Is it somehow related to \"weight (wait) broke the wagon\"?)\nIn context, it relates to pushing someone over the edge to straight up kick doors open to enter a room.\n[from WoT Winter's Heart]",
        "created_utc": 1490429643,
        "upvote_ratio": ""
    },
    {
        "title": "Advice for MA Graduate &amp; Potential PhD Aspirations",
        "author": "dylarama_",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61e5pb/advice_for_ma_graduate_potential_phd_aspirations/",
        "text": "A bit of background--I received my BA in English in 2015 from a liberal arts school in the northeast (US) &amp; then spent the past year completing my MA in Modern &amp; Contemporary Literature at UCD in Ireland--I recently graduated with 1st class honors. SInce finishing, I've begun teaching English at a private highschool geared toward 1-on-1 education in California. \n\nMy question is--to ever have hopes of returning to get my PhD (something I know I definitely want to do--just not necessarily immediately) &amp; getting into a program like that of UC Berkeley's for instance, what should I be focusing on doing in the interim?  I think the teaching experience fills a gap in my CV. I know I should be continuing to refine some type of research focus.  I'm not entirely sure if I want to pursue exactly the same area I wrote my MA thesis on.  \n\nAny advice is appreciated :)\n\n\n",
        "created_utc": 1490420999,
        "upvote_ratio": ""
    },
    {
        "title": "Do you actively seek out themes, motifs, irony or other literary devices while reading?",
        "author": "HighFive_LoFi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61bioa/do_you_actively_seek_out_themes_motifs_irony_or/",
        "text": "Or do you just take it all in as a whole? Do you see the forest or the trees?",
        "created_utc": 1490388035,
        "upvote_ratio": ""
    },
    {
        "title": "Scholarship on the \"Eumaeus\" episode of Ulysses?",
        "author": "BenHalp",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/61ai1p/scholarship_on_the_eumaeus_episode_of_ulysses/",
        "text": "I'm writing a paper for a course I'm taking on James Joyce's *Ulysses*, and I'm wondering if any of you know of any good scholarship on the \"Eumaeus\" episode of the novel: I've searched through JSTOR and only been able to find one article that will be helpful for me.\n\nI'm not sure what I'm writing on it yet, but I'm trying to gather preliminary research to help me formulate an idea. It's a short paper (~2000 words), so I can't go too in depth on the episode itself, but I'm thinking of writing about either the clichés and tropes that make up the language of the episode, or the comments on class that are rather glibly dropped into the narrative (i.e., cops are only there to protect the upper-class, Corley assuming Stephen is affluent).\n\nAny help would be greatly appreciated!",
        "created_utc": 1490378205,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know what this book is or if it has any value?",
        "author": "johnnyblaze9875",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/616mv4/does_anyone_know_what_this_book_is_or_if_it_has/",
        "text": "[removed]",
        "created_utc": 1490324784,
        "upvote_ratio": ""
    },
    {
        "title": "What is effect that 'fictionalising' a real-life person, account, or biography have on the character? Please help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/613z6q/what_is_effect_that_fictionalising_a_reallife/",
        "text": "[deleted]",
        "created_utc": 1490296747,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Emily Bronte more difficult to read than her sisters?",
        "author": "-methane-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/613em2/why_is_emily_bronte_more_difficult_to_read_than/",
        "text": "I've read Jane Eyre and bits of Anne Bronte. Didn't have any trouble at all with them. Then there's Wuthering Heights and for the most part I'm quite confused and I feel stupid. The grammar is so different. \n\nWas Emily paying homage to a different, earlier style of writing? Or is her style just simply more difficult than her two sisters?",
        "created_utc": 1490291420,
        "upvote_ratio": ""
    },
    {
        "title": "The importance of John Edward Williams (Stoner, Butcher's Crossing)",
        "author": "boring_epitaph",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60xwgy/the_importance_of_john_edward_williams_stoner/",
        "text": "Is John Williams studied at all in tertiary institutions? He seems like a writer on the fringe, comparable to Gaddis (not in style but obscurity)",
        "created_utc": 1490221348,
        "upvote_ratio": ""
    },
    {
        "title": "Anti-science literature (particularly poetry)",
        "author": "David_Does_Dallas",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60rylj/antiscience_literature_particularly_poetry/",
        "text": "Edgar Allen Poe's anti-science poem \"Sonnet - To Science\" was supposedly inspired by Keats' Lamia which had an anti-science theme to it. Even Nietzsche, particularly in the birth of tragedy, is very anti-science in his attack on Socrates. My question, is there more works out there that focus on the opinion that science is harmful to man? Thank you.",
        "created_utc": 1490148471,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for a piece on the nature of the Self and the Other (specifics in description)",
        "author": "Blaiser12",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60pq0t/im_looking_for_a_piece_on_the_nature_of_the_self/",
        "text": "I'm currently writing an essay on the nature of modern doppelgangers, and have already referenced Lacan's Mirror Stage quite extensively. However, I'm looking for a piece (or even a succinct quote) that states how definitions of the self always require the other. By this I mean that you must always say I am not X in one regard, or I am like X in another. I have a feeling I read a piece very like this a few years back but I can't think what it might be for the life of me.",
        "created_utc": 1490124537,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for McSweeney's-like lit magazines?",
        "author": "zsheram",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60od4y/looking_for_mcsweeneyslike_lit_magazines/",
        "text": "McSweeney's isn't currently accepting submissions, I'm having trouble finding a renowned equivalent to submit some of my comedic pieces to. Any suggestions?",
        "created_utc": 1490111490,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone explain to me what Linda Williams means by \"Excess\"?",
        "author": "WitlessMean",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60imv7/can_anyone_explain_to_me_what_linda_williams/",
        "text": "I've read Linda Williams' Film Bodies: Gender, Genre, and Excess (or tried to read it) a couple times and reluctantly I'm not fully grasping what exactly she is trying to say. What exactly **is** excess? Further, why is it important that she displays it as a system? I admit, this essay is tough for me to read and I'm not understanding it. If anyone could help, that would be great. If you've never read and are interested, the essay is floating around online relatively easy to find. Thank you. ",
        "created_utc": 1490038117,
        "upvote_ratio": ""
    },
    {
        "title": "Help identifying Grimm's Fairy Tales",
        "author": "k1ll3rpanda",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60csmz/help_identifying_grimms_fairy_tales/",
        "text": "I got this book from my Grandpa after he passed away. I was wondering if anyone has any info on it. It doesn't have any publishing dates or edition information. The only date in it is 1896 on the last page in a hand written note. I tried searching the publisher with the title and author but can't this particular version. Any information would be awesome! Here is some pictures https://imgur.com/gallery/AAFNc",
        "created_utc": 1489962045,
        "upvote_ratio": ""
    },
    {
        "title": "Russian lit - Identify this book or play ?",
        "author": "justanothersat",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60cbb2/russian_lit_identify_this_book_or_play/",
        "text": "There is an old couple that sit on a bench (or something outside, along the water maybe?). They both loved each other but weren't together all their lives. They lived entirely separate lives and both got married to other people. ",
        "created_utc": 1489956629,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting chapter title schemes?",
        "author": "Undisclosed123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/60bbqz/interesting_chapter_title_schemes/",
        "text": "I've noticed this is an area in fiction that doesn't have a lot of standouts.\n\nDoes anyone have examples of books that used their table of contents in unique ways?\n\nAs in more than just numbers, or one-word summations of the events taking place?\n\nI'm drawing a blank.",
        "created_utc": 1489945746,
        "upvote_ratio": ""
    },
    {
        "title": "Ridiculous but serious question: your literary crushes?",
        "author": "I_eat_faeries",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/609xnz/ridiculous_but_serious_question_your_literary/",
        "text": "Any fictional characters that have grabbed you like a crush on a real person? Mine, through the years:\n\nLord Henry Wotton, *The Picture of Dorian Gray*\n\nWill Ladislaw, *Middlemarch*\n\nLady Brett Ashley, *The Sun Also Rises*\n\nStephen Dedalus, *A Portrait of the Artist as a Young Man*\n\nElizabeth Bennet, *Pride and Prejudice*\n\nJordan Baker, *The Great Gatsby*\n\nSally Seton, *Mrs. Dalloway*\n\nEdit: Authors and author personas are also welcome!",
        "created_utc": 1489928441,
        "upvote_ratio": ""
    },
    {
        "title": "literary criticism vs reading a book?",
        "author": "consciousdirt",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/609v9c/literary_criticism_vs_reading_a_book/",
        "text": "I don't understand the difference, I've never studied literary criticism before so I'd like to know what it is I'm missing out on. I love good literature like tolstoy, shakespeare and dostoevsky and currently I'm reading \"crime and punishment\". But I don't feel as though I'm urgently lacking in my knowledge of literature to be able to read \"crime and punishment\". I just read the book as I would any other book, though with a bit more reflective thinking as it is a far deeper book than say harry potter.\n\nIn any case I'm reminded of a quote from the English philosopher Mary Midgley. \n\n&gt;[A] new and vigorous Classics teacher offered to teach a few of us Greek, and that too was somehow slotted into our timetables. We loved this and worked madly at it, which meant that with considerable efforts on all sides, it was just possible for us to go to college on Classics … I had decided to read Classics rather than English – which was the first choice that occurred to me – because my English teacher, bless her, pointed out that English literature is something that you read in any case, so it is better to study something that you otherwise wouldn't. Someone also told me that, if you did Classics at Oxford, you could do Philosophy as well. I knew very little about this but, as I had just found Plato, I couldn't resist trying it.[2]\n\nI just don't understand what I'm missing out on without a formal study of literary criticism. Whats wrong with going through life just reading books and poetry without studying criticism, as Midgely suggests? What would such a person be missing out on? \n\n\n\n\n",
        "created_utc": 1489927305,
        "upvote_ratio": ""
    },
    {
        "title": "What authors belong to the non-English Language western canon?",
        "author": "ReclaimLesMis",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/604qm2/what_authors_belong_to_the_nonenglish_language/",
        "text": "Reading through [this thread](https://www.reddit.com/r/AskLiteraryStudies/comments/5ztko3/what_works_or_authors_are_generally_accepted_as/) I noticed that out of the authors mentioned, there are 176 authors who mainly wrote in the English language (177 counting Nabokov) to 80 who wrote mainly in any other language (a 2.2 English to non-English ratio). So, since that is patently absurd I'm compelled to ask, which non-Anglophone authors make up the Western canon? Surely there's been as many writers worthy of note in languages like French, Italian, German or Spanish, or even Latin and Greek.",
        "created_utc": 1489852453,
        "upvote_ratio": ""
    },
    {
        "title": "What makes Latin American literature so distinctive?",
        "author": "EJBKJWN",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/601eht/what_makes_latin_american_literature_so/",
        "text": "[removed]",
        "created_utc": 1489797496,
        "upvote_ratio": ""
    },
    {
        "title": "literary responses to Michael Fried's Absorption and Theatricality?",
        "author": "qdatk",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/600znp/literary_responses_to_michael_frieds_absorption/",
        "text": "I was wondering what the major receptions of Fried's *Absorption and Theatricality* are in literature and more general theoretical/philosophical fields. I assume there's some engagement with it in work on ecphrasis, but what else? Any attempts to translate into literary terms the argument that absorption aims to enthrall the viewer by pretending the viewer does not exist? Or his distinction between the dramatic form of painting (in which the passion of the subject matter absorbs the depicted characters and excludes the viewer -- quite Aristotelian) and its pastoral form (in which the viewer is enticed into the painting, and hence vacating the place of the viewer)?",
        "created_utc": 1489792485,
        "upvote_ratio": ""
    },
    {
        "title": "I am working on a project about Catch-22, and I need people who have read the book to fill out a survey.",
        "author": "Seigefried",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zzrri/i_am_working_on_a_project_about_catch22_and_i/",
        "text": "[removed]",
        "created_utc": 1489779403,
        "upvote_ratio": ""
    },
    {
        "title": "Austen spin-offs that are actually worth reading?",
        "author": "I_eat_faeries",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zw7x5/austen_spinoffs_that_are_actually_worth_reading/",
        "text": "So I'm going to suggest that I'm PROBABLY not the only person here who, when confronted with a fluffy romance novel centered around Mr. Darcy, either rolls my eyes or bursts into tears, depending on whether it's clear that the author has at least read any of Austen or unclear that they've ever read ANY book.\n\nThe last time I read Pride and Prejudice, though (I revisit it at least once every 2 years or so), I found myself inordinately intrigued with Lydia. It struck me how oddly contemporary she is, and I wanted to know more about the inside of her head: a place, I felt sure, that was a lot more complex than she let on, or than her father (much as I do adore him!) concluded.\n\nAfter searching through some TERRIBLE-looking books like the shamelessly trashy The Bad Miss Bennet, I managed to find one that I actually found deeply impressive, simply titled Lydia's Story. It's VERY detailed, nuanced, emotional without being TOO sensational, and clearly the well-researched work of an actual writer who's as devoted to Austen's craft as to Austen's accidental position of historian/sociologist of a certain time, place, and social class.\n\nI've been willing to bet that this is the ONLY Austen spin-off worth reading (I even found other books by the same author to seem indulgent and fanfiction-like, despite her worthy dialogue and description), but is there ANY chance I've missed something? I'm particularly interested in reading about Georgiana Darcy's rebellious phase, which I am convinced shakes Pemberley at the core of its foundations.\n\nedit: typo ",
        "created_utc": 1489734873,
        "upvote_ratio": ""
    },
    {
        "title": "Looking to start writing my final University dissertation after seven solid years of studying, could anyone help me?",
        "author": "TinysocksB",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zuf4t/looking_to_start_writing_my_final_university/",
        "text": "I don't know if this is against the rules here, but I am feeling very nervous about my final paper. I'm still not sure if I fully understand the question asked of me and would appreciate any and all help available. \n\n\nIf anyone experienced with University level English Literature work can spare me a few minuets I'd love to chat. Thank you so much. The actual question:\n\n‘Ideals of masculinity remain static throughout the English Restoration period’. Discuss the validity of this claim in relation to the set texts covered in the module. In your answer please demonstrate significant evidence of independent study and include references to critical sources.\n\nEDIT: Please note that I am not looking for a direct answer to my question, I'm just seeking a helping hand in understanding. ",
        "created_utc": 1489709993,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a meaningful difference between colonialism and imperialism? (in the context of Heart of Darkness)",
        "author": "high-house-shadow",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zuc53/is_there_a_meaningful_difference_between/",
        "text": "While introducing Heart of Darkness, our student teacher remarked that while Joseph Conrad was a supporter of colonialism, he was against imperialism. The whole class was pretty confused by this assertion. It seemed like a rather arbitrary difference, more literary apologism than useful context for understanding the text. So, did people at that time divide themselves so strictly into those categories of 'colonialist' and 'imperialist'? Would this difference really help us understand how Conrad felt?\n",
        "created_utc": 1489709130,
        "upvote_ratio": ""
    },
    {
        "title": "What works or authors are generally accepted as essential classic literature?",
        "author": "dewarr",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ztko3/what_works_or_authors_are_generally_accepted_as/",
        "text": "Of course, no question of this nature has a wholly definitive answer, but I assume there is widespread agreement on a decent amount of material, especially given the fact that literature is both a popular and academic pursuit. (I have yet to encounter a subject without a fairly well-agreed upon curriculum.) I never read much classic lit in school, and I would like to remedy this. For the purposes of this question, I am wide-open to works originally published in foreign languages, but am primarily interested in material considered a part of the western tradition, i.e. Dickens and Pushkin over Chinese works.\n\nI feel absolutely certain this question has been asked many times before, but my search-fu didn't turn it up. Thank you for any answers, or links to past threads.",
        "created_utc": 1489701006,
        "upvote_ratio": ""
    },
    {
        "title": "Have any writers or lit theorist speculated on what happened to Greta Samsa?",
        "author": "I_eat_faeries",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zs0z7/have_any_writers_or_lit_theorist_speculated_on/",
        "text": "Franz Kafka's Metamorphosis is one of my absolute favorite books; I think I'd almost call it uniquely perfect. But there's something I keep thinking about again and again. That ending, with Greta as a butterfly, adored by her now-free family and ready to live her life as a young woman. I KEEP wondering: what happened to her, in the years that followed?\n\nDid she really forget her brother? Have a nightmare about killing an insect and not remember why she was so scared? Was she wracked with guilt later on? Did SHE wake up, one morning, suddenly unable to move?\n\nI have no idea. I'd love to know if anyone else, published or not, has shared their thoughts at length about this.\n\n",
        "created_utc": 1489685866,
        "upvote_ratio": ""
    },
    {
        "title": "Any French Literature specialists here?",
        "author": "I_eat_faeries",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zrr4d/any_french_literature_specialists_here/",
        "text": "There are quite a few French novels I've been meaning to read for years, but given that my French is at pre-kindergarten level I have to go for English translations. Considering that I once thought I disliked Kafka because I'd read an unfortunate translation, I'm VERY careful about finding the best I can now!\n\nSo, for those of you who are familiar with this realm, I would be exceedingly grateful if you could recommend English translations of these titles. If you've read multiple translations and choose one as the best, I would love to know why.\n\nI'm looking for:\n\nBeauty and the Beast, by Suzanne Barbot de Villeneuve\n\nLes Miserables, by Victor Hugo\n\nThe Hunchback of Norte Dame, by Victor Hugo\n\nCandide, by Voltaire.\n\nAlternatively or in addition, I'm also open to more contemporary French titles in English translation that I may not be familiar with.\n\n",
        "created_utc": 1489683244,
        "upvote_ratio": ""
    },
    {
        "title": "Capote's In Cold Blood",
        "author": "JRainers",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zncte/capotes_in_cold_blood/",
        "text": "To anyone who has read Truman Capote's 'In Cold Blood', did you feel somewhat unsettled by the way Capote focalises the narrative through the perspectives of the different individuals involved in the murder of the Clutter family? There's something off/unsettling in the way Capote turns the murders into a narrative that I just cant seem to explain. I'm not sure if it's the lack of  fictionality of the book which is otherwise written like a fictional novel but something just feels 'off' about it. I'd love to read some people's opinions on this. ",
        "created_utc": 1489623979,
        "upvote_ratio": ""
    },
    {
        "title": "What does \"uncut english novels\" mean in Anna Karenina?",
        "author": "Richard_Reinhardt",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zm8k7/what_does_uncut_english_novels_mean_in_anna/",
        "text": "Does it mean no censorship?",
        "created_utc": 1489612508,
        "upvote_ratio": ""
    },
    {
        "title": "Fantastic genre in Japan",
        "author": "UTALOO",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zlqzf/fantastic_genre_in_japan/",
        "text": "Ok so our teacher asked us to make a presentation on the \"fantastic\" genre in japan. When I say Fantastic I mean the kinda books where there are 2 possible endings.\n- The ending where eveything explains itself in a realistic manner.\n- the ending where there is a supernatural element to it.\nI don't know if this genre exists in English but it exists in french (English isn't my native language)\nThe thing is we can't really find much.\nWas wondering if any of you knew anything about this specific genre in japan.",
        "created_utc": 1489607921,
        "upvote_ratio": ""
    },
    {
        "title": "Reading/Studying Posture/Positions?",
        "author": "Fanshawe89",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zlnov/readingstudying_posturepositions/",
        "text": "In the loosest possible way, I suppose this question falls under the category of methods of literary analysis.  I apologize if this is the wrong subreddit to ask this question.\n\nLately, I've been committing far more time towards reading and studying literature.  But as my sessions have gotten longer, I've been experiencing far more chronic lower back and neck pain. It's gotten to the point I'll have difficulty concentrating on the text due to acute discomfort and stiffness. \n\nSo my question is: if I want to continue a life long commitment to enjoying and studying literature, what are the proper reading positions to minimize the sort of issues I've been experiencing?  What are the proper sitting positions? Should I stand instead of sitting at all?  Etc.  ",
        "created_utc": 1489607072,
        "upvote_ratio": ""
    },
    {
        "title": "Nabokov Anticipates the Emoticon in 1969",
        "author": "burkean88",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5zlglu/nabokov_anticipates_the_emoticon_in_1969/",
        "text": "\"[Q:]How do you rank yourself among writers (living) and of the immediate past? [A:] I often think there should exist a special typographical sign for a smile- some sort of concave mark, a supine round bracket, which I would now like to trace in reply to your question\".\nVladimir Nabokov, Strong Opinions. McGraw Hill, 1973. 133-34.\n\nI thought this was an interesting little tidbit in a great book of interviews. Anyone know of any other early uses or mentions of typographical representations of nonverbal information?",
        "created_utc": 1489605273,
        "upvote_ratio": ""
    },
    {
        "title": "Should translated epic poetry be read in verse or prose?",
        "author": "SpuriousFurious",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ziufn/should_translated_epic_poetry_be_read_in_verse_or/",
        "text": "I just finished reading Robert Fagles' translation of The Aeneid. I found it cumbersome to read. Clarity felt sacrificed for form which created awkward sentence structure.\nThis got me wondering, what is the point in translating a poem while maintaining the structure? No matter how good the translation you can't gain an appreciation for the form and phonetic nuance of the original. It must also make the translation process itself more difficult since you can't focus solely on accuracy. Since those aspects can't be translated wouldn't accurate and clear representation of the story become paramount?\nIs poetic translation primarily an exercise for the author? What is the argument for a poetic translation over prose?",
        "created_utc": 1489578076,
        "upvote_ratio": ""
    }
]