[
    {
        "title": "Looking for books on film/literature and the creation of a national myth/identity",
        "author": "pauleglot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hqg90/looking_for_books_on_filmliterature_and_the/",
        "text": "Hey guys! \n\nI'm looking for books on how film/literature might be used to create a shared national myth/identity. Any good places to start? \n\nThanks! :)",
        "created_utc": 1481468976,
        "upvote_ratio": ""
    },
    {
        "title": "Need some urgent guidance!",
        "author": "postmodern_emo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hqaly/need_some_urgent_guidance/",
        "text": "[removed]",
        "created_utc": 1481466720,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone suggest particular databases or other resources for finding full-length plays?",
        "author": "siliconebones",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hmgop/can_anyone_suggest_particular_databases_or_other/",
        "text": "hope this is sub-appropriate: \n\n\nI'm specifically looking for well-shot productions of Six Characters in Search of an Author and/or Waiting for Godot. My school library has come up short and my Lit class needs something to watch during our end-of-semester ice cream party, yay. \n\nI've already ordered a DVD of a staging of Godot that I've seen before and like (so maybe I'll go with that), but I'd greatly appreciate any other tips. Thanks!",
        "created_utc": 1481405561,
        "upvote_ratio": ""
    },
    {
        "title": "Help me remember",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hlvc6/help_me_remember/",
        "text": "[deleted]",
        "created_utc": 1481398722,
        "upvote_ratio": ""
    },
    {
        "title": "Why do books/plays often \"reference\" a culture's literary foundations (e.g. the Bible, the Odyssey). What is the purpose of it?",
        "author": "mixolydiA97",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hlt1m/why_do_booksplays_often_reference_a_cultures/",
        "text": "Hello, I've never even looked at this sub before but I'm really stuck on this question. I'm writing a paper about the Oresteia (by Aeschylus) and I'm trying to explain why the trilogy's similarity to Hesiod's Theogony is significant. I believe that they're similar in the way the successions work (Ouranos-Cronos-Zeus, and Agamemnon-Aegisthus/Clytemnestra-Orestes). \n\nHowever, the reason why I'm stuck is because I can't think of a way to really explain why cultures make these kinds of references. I could relate many books in Western literature back to the Bible in the same way that I could relate a lot of the ancient Greek literature I've read back to either Homer or Hesiod. But why? Is it because the themes established in these \"foundation texts\" have just become part of their literary tradition? Is it shorthand for the reader, so that they can read something and then be able to compare it to something else? Any guidance would be appreciated.",
        "created_utc": 1481397951,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a preferred version of the KJ Bible for academic study?",
        "author": "thepersonfromporlock",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hl20t/is_there_a_preferred_version_of_the_kj_bible_for/",
        "text": "Hello! \n\nI'm taking a year out from my BA in English Literature to read some things I feel I should dedicate some serious time to, which includes the Bible. I've just finished Frye's Anatomy of Criticism, and want to read the KJ version from a secular point of view, paying particular attention to the \"grammar of images\" and archetypes within it. Is there a version for academic study you would recommend?\n\nBonus: I'm not planning on reading all of it because much of it seems to be far less rich from a literary perspective (looking at you, Book of Numbers). Which books would you say are 'essential reading'? \n\nThank you in advance for you help!",
        "created_utc": 1481389365,
        "upvote_ratio": ""
    },
    {
        "title": "Best Edition for Nicholas Trevet's Anglo-Norman Chronicles?",
        "author": "Mebediel",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hi1xb/best_edition_for_nicholas_trevets_anglonorman/",
        "text": "Hi! I'm writing a BA comparing Chaucer's \"Man of Law's Tale\" and Gower's \"Tale of Constance.\" My advisor told me that I should look into Trevet's tale of Constance but didn't have any specific recommendations for which edition I should use. Are there any particular editions which are noticeably better than others?",
        "created_utc": 1481338791,
        "upvote_ratio": ""
    },
    {
        "title": "Epithets in the Odyssey",
        "author": "CaninePajamas",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hfw90/epithets_in_the_odyssey/",
        "text": "Hi All,\nI'm writing an essay on epithets in the Odyssey and was wondering if I might call upon this wondeful community to assist me in finding specific times in Homer's greatest epic where the literary technique is not employed. I'd really appreciate any specific references you might provide.\n\nThanks!",
        "created_utc": 1481313099,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for self-referential texts like Roland Barthes' 'Death of an Author', but with known translations into different languages?",
        "author": "QPILLOWCASE",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5heiu9/looking_for_selfreferential_texts_like_roland/",
        "text": "Hi guys, I wanted to use a self-referential text like Death of an Author, but from what I've seen, there are no translations of this? I intended to find translations so I could compare the differences in language between the two, but so far I've only seen it in English.\n\nI tried to google 'self -referential' texts and it didnt' come up with any actual books or texts, probably mostly because I don't really know how to go about searching this. If anyone could give me tips on how to search books more effectively, thanks too :D\n\nIF you wanna help me find a text, it has to be kind of tongue-in-cheek and self-referential for this to work (as working with self-referential stuff is part of my study) , with a few translations available?\n\nit sounds like a tough job to find, so it would be awesome if anyone has book searching tips instead?\n\n Thank you !!",
        "created_utc": 1481299319,
        "upvote_ratio": ""
    },
    {
        "title": "Who, in your opinion, is the best translator to English of Pablo Neruda's poetry.",
        "author": "dante50",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5hax79/who_in_your_opinion_is_the_best_translator_to/",
        "text": "This question is asked for personal enjoyment reasons and not for scholarly reasons. \n\nAlthough I'm a monoglot, I have studied foreign language and I've read a few books and articles that articulate how difficult translation is. I get that any translation that I read will be different (maybe unrecognizable) from what the author intended in her or his original language. \n\nRegardless, I have enjoyed English translations of Neruda's poetry and would like read more. Which translations and translators are at the top of your list?\n\n[*I wish I could edit into the title a question mark.]",
        "created_utc": 1481246287,
        "upvote_ratio": ""
    },
    {
        "title": "Geniuses of the baroque prose style: Carlyle, Proust, Faulkner, Emerson -- who else?",
        "author": "siftingtothetruth",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5h930o/geniuses_of_the_baroque_prose_style_carlyle/",
        "text": "I love baroque prose styles, by which I mean those that tend to employ complex sentence structures in the service of expressing complex, layered thoughts. I'd put the following authors &amp; particular works on this list (I would not include more stream of consciousness authors like Joyce in Ulysses):\n\nAre there others?\n\n* Proust, In Search of Lost Time\n* Faulkner, Absalom, Absalom\n* Emerson, his essays\n* Ruskin, Sesame and Lilies\n* Carlyle, The French Revolution\n* Henry James, The Golden Bowl\n* Melville, Moby Dick",
        "created_utc": 1481226783,
        "upvote_ratio": ""
    },
    {
        "title": "Danish literature",
        "author": "readingeliot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5h66fe/danish_literature/",
        "text": "Hello fellow redditors,\nI'm an English student from Slovenia, but I a big enthusiast of Danish culture and since literature is just about my favourite thing in the world, can anyone recommend me any good (translated) Danish novels? Can be modern or old, or even poetry &amp; plays. \n",
        "created_utc": 1481191840,
        "upvote_ratio": ""
    },
    {
        "title": "Post 9/11 texts",
        "author": "FluxusRedux",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gywa3/post_911_texts/",
        "text": "Can you consider post-9/11 texts (fiction , nonfiction, theory/criticism) a specific genre? What are some post 9-11 texts that have stuck with you? Any explanation(s) are welcome- as a graduate student, I am endlessly interested in discussing this. ",
        "created_utc": 1481100731,
        "upvote_ratio": ""
    },
    {
        "title": "Recommended Literary Magazines and Journals",
        "author": "the-mighty-zabe",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gsva0/recommended_literary_magazines_and_journals/",
        "text": "I'm asking for magazine and journal subscriptions for Christmas from family and am looking for some good recommendations. I'm currently not subscribed to anything, so I'm open to all ideas. \n\nI'm looking for suggestions not only academic based research focused journals but also creative writing such as fiction, poetry and essays. \n\nI study Spanish, focused in South American literature, if that helps with suggestions. I was thinking of asking for classics like the Atlantic, the New Yorker, etc, but would also like more variety and some research focused publications.",
        "created_utc": 1481031411,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for short stories, novel excerpts or quotes about fears or phobias",
        "author": "princessnimb",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gs47m/looking_for_short_stories_novel_excerpts_or/",
        "text": "Hi\nI'm preparing a demo lesson for ESL adults who study English literature and I'm trying to find a short piece of literature (short story, novel excerpt or quote) whereby the students could easily identify the theme of fear. Any ideas would be greatly appreciated!",
        "created_utc": 1481019153,
        "upvote_ratio": ""
    },
    {
        "title": "Role call",
        "author": "sprack11",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gro7g/role_call/",
        "text": "Hey everyone! I'm new to this page and I'm also a literary studies major at Humboldt State University in Northern California. What do you all study? Have you read any good books recently? What college do you go to? It would be cool to hear back. ",
        "created_utc": 1481010614,
        "upvote_ratio": ""
    },
    {
        "title": "Should I read Joseph Frank's Dostoevsky before or after I read Dostoevsky's works?",
        "author": "Young_Neil_Postman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gp0ob/should_i_read_joseph_franks_dostoevsky_before_or/",
        "text": "Reading David Foster Wallace's essay on Frank's Dostoevsky when I had this question. I've read Crime and Punishment and excerpts from Brothers Karamazov, so far. Looking to further explore all this over Christmas break and the next few months.\n\nEdit: Also, should I read the condensed one volume version or should I seek out the unabridged five volume original work?",
        "created_utc": 1480977106,
        "upvote_ratio": ""
    },
    {
        "title": "Is joy not the devil?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gmpd4/is_joy_not_the_devil/",
        "text": "[removed]",
        "created_utc": 1480954227,
        "upvote_ratio": ""
    },
    {
        "title": "Why is not the devil? How is joy the devil? Is joy the devil?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5gmlht/why_is_not_the_devil_how_is_joy_the_devil_is_joy/",
        "text": "[deleted]",
        "created_utc": 1480953092,
        "upvote_ratio": ""
    },
    {
        "title": "William Carlos Williams' grasshopper transcendence",
        "author": "chronopede",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ghd2s/william_carlos_williams_grasshopper_transcendence/",
        "text": "Mariani's biography on Wallace Stevens makes reference to a concept that Williams supposedly called \"grasshopper transcendence\"; does anyone know where he discusses this concept? \n\nSome context:\n\n\"['Sailing after Lunch'] was a send-up, really, a mimicking and mocking of the Emersonian transcendent eye, expunging all connection with the human race and becoming instead a pupil (a student, yes, but also the pupil of the eye), which might provide not a transcendent vision but merely a 'slight transcendence': *what Williams would call a grasshopper transcendence—up, up, and then back to earth again* [...]\" (Mariani, 197)\n\nAny ideas? ",
        "created_utc": 1480881963,
        "upvote_ratio": ""
    },
    {
        "title": "How long does it take to read Finnegans Wake?",
        "author": "JohnExMan",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ggrig/how_long_does_it_take_to_read_finnegans_wake/",
        "text": "If I spent 40 hours a week for 4 weeks could I read this book with a good to strong understanding?\n\nEdit: With additional reading and guides.",
        "created_utc": 1480875508,
        "upvote_ratio": ""
    },
    {
        "title": "The opposite of onomatopoeia",
        "author": "brashull",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5g5lqm/the_opposite_of_onomatopoeia/",
        "text": "I came across the word 'pulchritude' which means beauty. It's an ugly sounding word and doesn't seem to match its definition. If this isn't the place to ask, please redirect me to an appropriate subreddit, I'm just curious to know if there is a term for a word that sounds like the opposite of what it means.\n\nThank you for your help.",
        "created_utc": 1480710999,
        "upvote_ratio": ""
    },
    {
        "title": "Critical analysis of a novel",
        "author": "gangger",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5g1s52/critical_analysis_of_a_novel/",
        "text": "I don't know if I'm asking at the right place but maybe someone can help me.\nSo this professor of mine required us to read this certain novel and submit a 5-page paper which contains our critical reading/analysis for the novel and the professor said that there is no need for us to summarize the novel because she already read it. \nI was able to submit it then it was returned recently. I received a failing grade but I was allowed to revise it and send it to her email.\nThere were comments on some paragraph (most probably the reason why I got the grade) saying: \n\"where is the 'state of war' (title of the novel)?\" \n\nWhat I did is i first mentioned a scenario in the novel then in the next paragraph, I related it to the contemporary situations in our country and society. I don't know what to do because I don't know what she meant.",
        "created_utc": 1480659191,
        "upvote_ratio": ""
    },
    {
        "title": "\"How to Read a Book,\" by Adler: How to analytically read",
        "author": "Mr_Davis_97",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5g1naj/how_to_read_a_book_by_adler_how_to_analytically/",
        "text": "So I have read Mortimer Adler's classic, \"How to Read a Book,\" and I have a few questions that I have no idea where else to ask. For anyone who has also read this book and understood it, here is my question.\n\nAdler splits analytical reading into three stages. Here is a link t a PDF that enumerates the three stages: http://keck.ucsf.edu/~craig/Mortimer_Adler_How_to_Read_a_Book.pdf\n\nI am confused about actually how to apply this model of reading. For example, for the first stage, we are told to \"state what the whole book is about with the utmost brevity,\" and \"enumerate it major parts in their order and relation, and outline these parts as you have outlined the whole.\" This is the first stage, but in order to complete it, it would seem that one would have to already have read through the entire book. So, do we read through the whole book then go back and complete stages 1-3, or do we complete these stages simultaneously as we read through the book once? In this sense, I do not know how to actually apply these rules; mainly I don't know when and in what order to apply them. Any help would be appreciated.\n",
        "created_utc": 1480657107,
        "upvote_ratio": ""
    },
    {
        "title": "Can this be investigated in enough detail? (for a 5k words essay)",
        "author": "Skrublord2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fzdrt/can_this_be_investigated_in_enough_detail_for_a/",
        "text": "[removed]",
        "created_utc": 1480628598,
        "upvote_ratio": ""
    },
    {
        "title": "I was assigned to do a presentation on Edgar Allan Poe's impact on Romanticism and I am stumped.",
        "author": "shrektoplasm",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fyq4w/i_was_assigned_to_do_a_presentation_on_edgar/",
        "text": "[removed]",
        "created_utc": 1480621952,
        "upvote_ratio": ""
    },
    {
        "title": "Postmodernism according to Jean-Francois Lyotard, and also how to apply his ideas when talking about literature and arts.",
        "author": "CasSoerensen",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fw3vb/postmodernism_according_to_jeanfrancois_lyotard/",
        "text": "[removed]",
        "created_utc": 1480591922,
        "upvote_ratio": ""
    },
    {
        "title": "Novels that are 'about' religion, but by Jehovah's Witnesses?",
        "author": "maybeanastronaut",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fsk84/novels_that_are_about_religion_but_by_jehovahs/",
        "text": "I'm wondering if any of you scholars are familiar with any lesser known but decent novelists who grapple with, express, etc being a Jehovah's Witness like Greene, O'Connor, J.F Powers, etc, do for Catholicism?  I've been unable to turn up any JW novelists besides Mickey Spillane. \n\nEdit: Would also be happy with short fiction. \n\n",
        "created_utc": 1480543716,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any scholarly attention on Milton's pre-PL poetry?",
        "author": "Rustain",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fmrz3/is_there_any_scholarly_attention_on_miltons_prepl/",
        "text": "The other day I picked up a copy of \"The Complete of Poetry of John Milton.\"  I started reading from the beginning of the book, and I am enjoying it and all; but when I tried to search for some information on his 1624-1632 and 1632-1640 poetry, almost nothing came out except for [this paper](https://www.jstor.org/stable/376174?seq=1#page_scan_tab_contents) and some wikipedia pages on his early life. On reddit, google search yields some mentions of *the Lycidas* and *the Mask*; anything else is about PL. The question then, is: with his canonical status as a poet considered, why is there so little attention paid to his pre-PL poetry?",
        "created_utc": 1480469966,
        "upvote_ratio": ""
    },
    {
        "title": "Help identify this book.",
        "author": "Aethelwulf839",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fg4jm/help_identify_this_book/",
        "text": "I found this cleaning a relative's house after he passed. It has a good amount of water damage but I'm curious as to it's content. He was close to 90 when he died, so I'm thinking this was a childhood book of his that he kept.\nhttp://m.imgur.com/t61JK9V,I7iKJuy,6SMhU52,jRhCXXA,NkF1UbO,yHG8TLf",
        "created_utc": 1480387415,
        "upvote_ratio": ""
    },
    {
        "title": "How to compare and contrast characterization?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ffbvg/how_to_compare_and_contrast_characterization/",
        "text": "[deleted]",
        "created_utc": 1480378279,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain to me what Michel Foucault's definition of power is?",
        "author": "WitlessMean",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5fbzg0/can_someone_explain_to_me_what_michel_foucaults/",
        "text": "In literary studies, Foucault is popular and I was hoping someone could answer this question for me. Everything I've read has me confused so I'm just asking if anyone here really gets it and can explain it in more simple (i hate to ask this) terms than he does. Thank you. ",
        "created_utc": 1480344121,
        "upvote_ratio": ""
    },
    {
        "title": "Psychoanalysis of Poe",
        "author": "marktbde",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5f8w77/psychoanalysis_of_poe/",
        "text": "[removed]",
        "created_utc": 1480296701,
        "upvote_ratio": ""
    },
    {
        "title": "What internet sources/web sites do you use for literature research?",
        "author": "CatPasture",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5f4dfb/what_internet_sourcesweb_sites_do_you_use_for/",
        "text": "Writing a paper on some of the earliest and most influential women of British literature. Cannot find useful resources. Everything costs money, requires a membership, or isn't reliable. Sources must be  \"academic\" in the words of my professor. Banging my head into a wall. ",
        "created_utc": 1480234359,
        "upvote_ratio": ""
    },
    {
        "title": "In Roberto Bolano's \"Distant Star\", the epigraph reads \"What star falls unseen?\" and is attributed to William Faulkner. Does anyone know the source of this quote?",
        "author": "heyheyheythatsok",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5f41u3/in_roberto_bolanos_distant_star_the_epigraph/",
        "text": "I've done a bunch of research and every source simply refers to the epigraph of \"Distant Star\". I haven't read much Faulkner so apologies if I'm missing an obvious reference.",
        "created_utc": 1480228105,
        "upvote_ratio": ""
    },
    {
        "title": "Comparing Catcher In The Rye to Slaughterhouse Five (and other Vonnegut Works)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5f2zma/comparing_catcher_in_the_rye_to_slaughterhouse/",
        "text": "[deleted]",
        "created_utc": 1480212048,
        "upvote_ratio": ""
    },
    {
        "title": "Just finished Ethan Frome. Why does the \"smash-up\" feel so... ambiguous?",
        "author": "steeldaggerx",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5f2067/just_finished_ethan_frome_why_does_the_smashup/",
        "text": "I am not exactly sure how to phrase this, so ambiguous seems to be the best word to describe the scene of the smash-up. It's as if the author never actually commits the crash to text. What's up with that?",
        "created_utc": 1480199417,
        "upvote_ratio": ""
    },
    {
        "title": "Is weather considered part of the setting?",
        "author": "OsmanTheMan",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5f05xm/is_weather_considered_part_of_the_setting/",
        "text": "Basically I am writing an essay about Jane Eyre setting and not sure weather I should include the weather (if I do I can talk about pathetic fallacy), so is weather a part of the setting or no?",
        "created_utc": 1480177405,
        "upvote_ratio": ""
    },
    {
        "title": "Just read \"The Sheriff's Children\" by Charles Chesnutt. How is he viewed today in literary circles?",
        "author": "ridiculousrssndoll",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5exz5c/just_read_the_sheriffs_children_by_charles/",
        "text": "I thought the story was really interesting, so I looked up Chesnutt online. I was surprised by his picture as the book I was reading said he is among America's earliest black authors, yet his wikipedia page claimed he called himself \"7/8ths white.\" I was wondering how, if at all, he is viewed today, particularly in regards to his own race/ethnicity. ",
        "created_utc": 1480137973,
        "upvote_ratio": ""
    },
    {
        "title": "Are MFAs worth it?",
        "author": "Tenner5000",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5evrg0/are_mfas_worth_it/",
        "text": "I skimmed through a few of the bios and noticed a few MFAs and MAs in creative writing. I was wondering if your MFA experiences were worthwhile. Last year, I was accepted into an MFA Poetry program that would have left me tens of thousands in debt. This year, I'll be applying to fully funded programs. One of my undergrad professors is helping me with the writing sample, but I've been collecting opinions on the MFA as a terminal degree and wondered if anyone thought their experience was worth the lost time. \n\nI was also wondering if anyone had any advice on the application sample. What could I do to make my application and sample stand out? \n\nThanks in advance! ",
        "created_utc": 1480107543,
        "upvote_ratio": ""
    },
    {
        "title": "What are good novels with historic, war, romance theme?",
        "author": "whiteteacup",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ev5cq/what_are_good_novels_with_historic_war_romance/",
        "text": "I am looking for something like The Game of Thrones themed, or Outlander. ",
        "created_utc": 1480100342,
        "upvote_ratio": ""
    },
    {
        "title": "Ноw dо уоu rеfеr bасk tо уоur bооks whеn mаkіng nоtеs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5er0ml/ноw_dо_уоu_rеfеr_bасk_tо_уоur_bооks_whеn_mаkіng/",
        "text": "[deleted]",
        "created_utc": 1480036975,
        "upvote_ratio": ""
    },
    {
        "title": "Where should I start if I want to teach myself as much about literature as I can without attending a university?",
        "author": "ThatLefty",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5eprxn/where_should_i_start_if_i_want_to_teach_myself_as/",
        "text": "My recent perusing of literature studies and opinions have made me realize all the books I like are shit (except *The Great Gatsby*) and I'm wrong for giving them a lot of praise.\n\nSo I want to see what I'm missing! I want to get engrossed in all of this amazing literature that I don't appreciate. I won't promise I'll like everything I read, but I want to know *why* people respect certain works so much and to refine my taste and literary eye.\n\nI'm pretty stupid so start me off easy, please. I also have an interest in political philosophy and ethics if that helps.",
        "created_utc": 1480019809,
        "upvote_ratio": ""
    },
    {
        "title": "What is the purpose of literary studies?",
        "author": "newstudentDU",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5eo9ev/what_is_the_purpose_of_literary_studies/",
        "text": "Most disciplines have an aim. Even in the humanities, disciplines like sociology or political science or economics have aims, that is better understanding of society or power or the economic system.\n\nWhat is the purpose of literary studies? To study literature, obviously. But what does that imply? What are we hoping to get out of devoting hours to \"studying\" literature? Isn't literature supposed to be enjoyed, and then moved on from? By over-analysing literature, attributing things to the author they possibly never intended to say, aren't we just missing the point of literature?\n\nHow does literary studies benefit society, in a way that study of economics or sociology or anthropology does? I remember reading this somewhere: \"There is no surer foundation for a humane society than cultivating a taste for literature among its adolescents.\" How?",
        "created_utc": 1480001687,
        "upvote_ratio": ""
    },
    {
        "title": "Ноw dо уоu rеfеr bасk tо уоur bооks whеn mаkіng nоtеs?",
        "author": "Redditmis",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5eo50h/ноw_dо_уоu_rеfеr_bасk_tо_уоur_bооks_whеn_mаkіng/",
        "text": "І tаkе nоtеs frоm bооks, but І'd lіkе tо mаkе а rеfеrrаl bасk tо thе bооks sо І'll rеmеmbеr whеrе І gоt thе nоtе frоm whаt's thе bеst wау tо dо thіs\nаlsо іs thеrе аnу оnlіnе bооk stоrаgе thаt lеts уоu сору а lіnk frоm а сеrtаіn раgе оr аrеа оf thе bооk sо thаt уоu саn аdd а lіnk tо іt whеn tаkіng nоtеs frоm thе bооk?",
        "created_utc": 1480000049,
        "upvote_ratio": ""
    },
    {
        "title": "[Greek literature] [urgent] Definition of archaic Greek lyric poetry, please help!",
        "author": "N0RAN3K0",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ehzbn/greek_literature_urgent_definition_of_archaic/",
        "text": "I'm having trouble finding a concrete definition of archaic Greek lyric poetry. I have to do a comparison between the archaic greek lyrics poetry and the modern lyric poetry, and I'll use Hegel's Aesthetics to describe the modern concept of lyric poetry, but I couldn't find anything about the archaic greek lyric poetry in Aristotle's Poetics, nor in Horace's Ars Poetica (only found information about epic and dramatic genres). \nWho wrote about the archaic greek lyric poetry's characteristics and composition rules??\n\nI need help as soon as possible! Thank you!\n\n(Please excuse any english mistakes I might have made, it's not my first language...there's a lot of terms and names above that I don't know if I used correctly in english)\n",
        "created_utc": 1479916521,
        "upvote_ratio": ""
    },
    {
        "title": "Books on existentialist's view on the world wars",
        "author": "Ninell",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ehwc7/books_on_existentialists_view_on_the_world_wars/",
        "text": "[removed]",
        "created_utc": 1479915590,
        "upvote_ratio": ""
    },
    {
        "title": "What is a \"poetic\"?",
        "author": "newstudentDU",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5egvfy/what_is_a_poetic/",
        "text": "Where the term Poetic is used as a noun.\n\nI am reading the Cambridge companion to Chaucer and on page 139 it says: \"Stylistically, not one of Chaucer's [Canterbury] tales is much like any other. Each is a unique work with its own distinct poetic, a poetic that ranges from large literary elements, such as a narrator and dialogue, down to the specifics of imagery, allusion and vocabulary.\"\n\nWhat does it mean?",
        "created_utc": 1479901370,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for climate change &amp; gender?",
        "author": "futurepostac",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5eempe/recommendations_for_climate_change_gender/",
        "text": "I'm putting together a tentative syllabus for next year on \"Women in the American West.\" I'm thinking about a unit on gender &amp; the environment that spends most of its time on Silko's *The Turquoise Ledge*, but finishes with the film *Z for Zachariah*. \n\nThe film is basically landscape, gender, and apocalypse. So I'm looking for a short piece (fiction or non-) that we could cover in a session or two on women and the west that has anything at all to do with climate change, which most likely means water. \n\nMuch obliged for any help! And any thoughts. ",
        "created_utc": 1479864906,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Snobs, Heart of Darkness and Do The Right Thing.",
        "author": "Littlemoewiththegimp",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ebrob/literary_snobs_heart_of_darkness_and_do_the_right/",
        "text": "Really I just wanted clarification on the Ice Scene in Do the Right Thing, and more elaboration because I couldn’t remember if Tina was blindfolded waiting for the Ice. But this morning I watched the scene again on YouTube, and while she was waiting and unaware, she was not blindfolded, but Mookie asked her to wait, and when I read Wiki, I realized that it said she was completely unaware of the race riots going on in the neighborhood. I like Tina but I didn’t like the Ice scene, it was sort of too sexual for my taste. I liked her in the opening credits and the Fight the Power song.\n“Fight the Power.” I came to this forum to clarify my subject on women in three different visual and prescribed texts for a class I am taking. Instead I got lambasted, probably because the people who responded to my question didn’t know anything about the subject. However, I’ve been given freedom from a professor to pretty much write about anything I want to. In this vague prompt, I came to the forum hoping to seek some validation and clarify a topic that I was wanting to argue in a very long paper, which is mostly a close reading. I was not seeking for anyone to outline my paper for me, nor was I asking for you to do my homework for me. My question was merely ‘discussion based’ and I wanted opinions from literary scholars who care. I was not expecting to be made to feel 1” tall for my question, and my attempt to ask for assistance. I decided to seek help on the film forum, they are much nicer than these literary snobs that snubbed me.\nHowever, this morning, because of the lambasting that occurred last night, I feel liberated in being able to validate myself and what I am doing. So, I am thankful for that. In my paper I am going to compare aspects of gender, mostly the female gender being closed off from knowledge of race and war in Heart of Darkness, Apocalypse Now, and Do the Right Thing. In this, I will compare the light bearing qualities from the Intended in Heart of Darkness, (a blindfolded woman carrying a torch in Kurtz’ painting). The secret that is kept from Tina in Do The Right Thing, when Mookie asks her to take off her clothes, she is unaware of the race riots occurring and the ice bath that is about to happen, and lastly the fantasizing of the Play boy bunnies in Apocalypse now that are only seen as sex objects flown in for a show for military men, but are blissfully unaware of the consequences of their appearance. They are unassuming too, as they seem to have no knowledge of the war in Vietnam and no lines in the film. \nI'm an English Major!! So there meanies!!\n",
        "created_utc": 1479833935,
        "upvote_ratio": ""
    },
    {
        "title": "What is the overall meaning of Fifteen Dogs by Andre Alexis?",
        "author": "moonstruck222",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ebqwn/what_is_the_overall_meaning_of_fifteen_dogs_by/",
        "text": "[removed]",
        "created_utc": 1479833697,
        "upvote_ratio": ""
    },
    {
        "title": "What was Oedipus Rex's Fatal Flaw(s)?",
        "author": "Zetaprime01",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e93mx/what_was_oedipus_rexs_fatal_flaws/",
        "text": "[removed]",
        "created_utc": 1479793121,
        "upvote_ratio": ""
    },
    {
        "title": "Do the right thing ice cube scene, apocalypse now and heart of darkness subjugation of women. Women as Lightbearers, fetishes or sex objects?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e88b6/do_the_right_thing_ice_cube_scene_apocalypse_now/",
        "text": "[deleted]",
        "created_utc": 1479781429,
        "upvote_ratio": ""
    },
    {
        "title": "Certain sources state W.B Yeats denounced Edgar Allan Poe and called him \"vulgar\". Any relevant affirmation of this?",
        "author": "Pangarfnn",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e3zw0/certain_sources_state_wb_yeats_denounced_edgar/",
        "text": "I read vague notions about this claim but can't seem to find any solid or direct info on where and when this actually was said.",
        "created_utc": 1479734622,
        "upvote_ratio": ""
    },
    {
        "title": "Myth and Archetypal Criticism",
        "author": "Almsivi90",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e3ozp/myth_and_archetypal_criticism/",
        "text": "Hello folks! \n\nBeen wondering what people think of Myth (Also seen it called Archetypal) Criticism. I read Northrop Frye's *Anatomy of Criticism* in my undergraduate, and I absolutely loved it. Read a bit of Campbell in my MA, and that was a lot of fun too! I was super interested in myth related theoretical approaches and so excited when I saw Myth Criticism mentioned as a legitimate type of critical theory among lists of larger theoretical approaches.\nMy professors, however, strongly urged me to abandon my pursuits. They insisted that it was a \"dead approach\" something no longer practiced and made useless by deconstruction. That was a shame! So I quickly abandoned it and shifted my focus towards Posthuman and eco-critical theories.\n\n I've always wondered though if anyone these days still felt like there was some value in myth criticism. Though I've been told it was a popular theoretical approach before deconstruction, I can't really find any theorists that used it other than Frye and Campbell. So any useful information regarding other uses of the approach would be much appreciated. I still feel like I have no real knowledge of how to actually apply the approach other than how Frye seemed to used it. Searches online haven't really helped me in this regard yet. \n\nI guess ultimately my question is simply why do you think that myth criticism fell out of favor so quickly? And do you believe that it might still have value as a theoretical approach? ",
        "created_utc": 1479729842,
        "upvote_ratio": ""
    },
    {
        "title": "What is up with the ending of Anna Karenina?",
        "author": "Anagram64",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e3dak/what_is_up_with_the_ending_of_anna_karenina/",
        "text": "I really love long 19th century novels. So I decided to read AK since I heard it was one of the best novels ever and also praised by Tolstoy as his best. I really liked almost all of it but that ending ruined it for me. I wish it would have stopped at the train station ( if you know what I mean having read it.) The last book seemed so unnecessary IMO.   \n\nDoes anyone know if it was added because of reader interest or was it planned? Wikipedia (not the best source) says that there was conflict between the author and publisher:\n\n*Tolstoy clashed with editor Mikhail Katkov over political issues that arose in the final installment (Tolstoy's negative views of Russian volunteers going to fight in Serbia); therefore, the novel's first complete appearance was in book form in 1878.*\n\nIt was serialized over four years so I never knew what drove the ending. Spirituality?\n\nBTW I read the Constance Garnett translation from 1901.\n\n",
        "created_utc": 1479723597,
        "upvote_ratio": ""
    },
    {
        "title": "Was Harold Bloom the proto-Gamer-Gater?",
        "author": "RodgeKirkland",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e30wy/was_harold_bloom_the_protogamergater/",
        "text": "[removed]",
        "created_utc": 1479716539,
        "upvote_ratio": ""
    },
    {
        "title": "Literature that concerns corruption of the law",
        "author": "RemoteSynergy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5e13cw/literature_that_concerns_corruption_of_the_law/",
        "text": "[removed]",
        "created_utc": 1479687390,
        "upvote_ratio": ""
    },
    {
        "title": "Why does Kafka leave out the beginning in The Metamorphosis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dxtjm/why_does_kafka_leave_out_the_beginning_in_the/",
        "text": "[deleted]",
        "created_utc": 1479644995,
        "upvote_ratio": ""
    },
    {
        "title": "Interpretation of Hamlet's 'we defy augury...'?",
        "author": "TheEnchantedHunters",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dvn0e/interpretation_of_hamlets_we_defy_augury/",
        "text": "&gt;we defy augury. There is special providence in the fall of a sparrow. If it be now, 'tis not to come; if it be not to come, it will be now; if it be not now, yet it will come—the readiness is all.\n\nfrom Hamlet, Act V, Scene ii\n\nThe main idea I get from it is that destiny is beyond our control. But then what does he mean by 'the readiness' and how does that differ from the idea of control that he seems to relinquish now? How does the idea of providence tie into this exactly? I'm pretty fascinated by this quote but also puzzled.",
        "created_utc": 1479603757,
        "upvote_ratio": ""
    },
    {
        "title": "Comparative Literature",
        "author": "McLionPeter",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dvglp/comparative_literature/",
        "text": "Hey,\n\nI'm an electrical engineer student and my wife is about to apply for a PhD in comparative literature. She was reading something about gravity and asked me what's the thing with derivatives and integrals. I told her about the concept of studying the behavior of functions and we thought: is there anyone, in comparative literature area, that every wrote (or read) something involving calculus?\n\nThanks! ",
        "created_utc": 1479601308,
        "upvote_ratio": ""
    },
    {
        "title": "Has Satre and Camus' reputation as heroic resistors in WW2 been all but destroyed in recent years?",
        "author": "FKA-FKA-FKA",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5duwxt/has_satre_and_camus_reputation_as_heroic/",
        "text": "",
        "created_utc": 1479594186,
        "upvote_ratio": ""
    },
    {
        "title": "Canonical texts which have inspired new interpretations in literary criticism",
        "author": "the_doctoress",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dr5ei/canonical_texts_which_have_inspired_new/",
        "text": "I am looking for canonical texts that have been rediscovered/reinterpreted in the past 15-20 years, or have inspired new trends in lit crit. ",
        "created_utc": 1479534696,
        "upvote_ratio": ""
    },
    {
        "title": "Which critical approach should I be using for my undergrad thesis topic?",
        "author": "alt1357",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dpicm/which_critical_approach_should_i_be_using_for_my/",
        "text": "[removed]",
        "created_utc": 1479510763,
        "upvote_ratio": ""
    },
    {
        "title": "How do you literary experts comprehend text?",
        "author": "muffinq",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5doo0m/how_do_you_literary_experts_comprehend_text/",
        "text": "My comprehension sucks. Many of you read often, and I assume comprehend well. Please leave comments on how to increase comprehension skills.",
        "created_utc": 1479501128,
        "upvote_ratio": ""
    },
    {
        "title": "One Flew Over the Cuckoos Nest (Ken Kesey 1962) literary criticism?",
        "author": "s_assafras",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dmpjn/one_flew_over_the_cuckoos_nest_ken_kesey_1962/",
        "text": "I have to do a research project for school on Ken Keseys 1962 Cuckoos nest. I am wondering if you guys can help me out finding literary criticism available online and free. There seems to be a lack of respected criticism on the book that i am finding via google. Thanks.",
        "created_utc": 1479479924,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a piece of literature \"fine\"?",
        "author": "218ly_",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dm0fc/what_makes_a_piece_of_literature_fine/",
        "text": "",
        "created_utc": 1479470099,
        "upvote_ratio": ""
    },
    {
        "title": "Source for this quote: Barthes \"literature is the question minus the answer\"",
        "author": "assortedneedles",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5djzs7/source_for_this_quote_barthes_literature_is_the/",
        "text": "Supposedly this is from the New York Times, 1978, but in numerous archives I have found no evidence of this. I am a curriculum studies grad student and it seems as though this quote is used in many high school classrooms (in AP literature especially.) Does anyone know where Barthes first wrote this? Thanks.",
        "created_utc": 1479435714,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Candide: \"Il faut cultiver notre jardin\"",
        "author": "mindhwhanna",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dh927/thoughts_on_candide_il_faut_cultiver_notre_jardin/",
        "text": "Hello!\n\nWhat are your thoughts on this famous line in the end of Voltaires Candide. What does it mean? Does it bear any significance to the story and/or the philosophical themes presented in the book? \n\nI am struggling in trying to make sense out of this fantastic story. If you have any articles, books or other writings about Candide that you'd recommend regarding this topic that would be much obliged. \n\nAnyway, let me ramble on with my thoughts on this book. \nI think Candide and his crew finally find their meaning in harmony with nature. As Pangloss points out after the conversation with their neighbor: \nYou are in the right,” said Pangloss; “for when man was put into the garden of Eden, it was with an intent to dress it; and this proves that man was not born to be idle.” \n\nI can't help thinking about the word culture and its origin. \"As an agricultural metaphor for the development of a philosophical soul\". \n\nTo cultivate ones inner garden, ones philosophical soul, is, in the bigger picture, a destructive process. \nWhat this inner cultivation does to you, and ultimately to mankind, is creating a way of life that is deeply egoistic and anthropocentric. I.e society and the general state of affairs (orchestrated and conducted by the west). Take for example the mutilated slave that Candide and Cacambo meet with. His state of being is a consequence for the luxuries of the wealthy and \"cultivated\" Europeans. \n\nI think \"il faut cultiver nous jardin\" is a call for intellectual balance. To not delve into the alluring and selfish operatives that maintain the destructive structures of our culture. Instead, engage yourself in activities that are natural, like gardening. Just like Pangloss Garden of Eden analogy suggests.\nI don't mean like an Emersonian Walden scenario or back to the natural state but a reflective understanding of our existance in this world. Therefore, this intellectual balance is a definition of reason. The golden middle way between these two extreme states of mind.\n\"Uncertainty is an unpleasant condition \n                      -\n       but certainty is absurd\" - Voltaire\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "created_utc": 1479405706,
        "upvote_ratio": ""
    },
    {
        "title": "Must Read English Novels ?",
        "author": "londoncidade",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dfe5f/must_read_english_novels/",
        "text": "Hi All,\n\nI know my question a little bit odd including generalisation, nevertheless, I've been reading mostly French and Russian Literature since my childhood.  I'd ask if we've a list of cult novels originally written in English ? \n\nthank you",
        "created_utc": 1479383543,
        "upvote_ratio": ""
    },
    {
        "title": "Need help finding Allusions in these songs please help?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ddplt/need_help_finding_allusions_in_these_songs_please/",
        "text": "[deleted]",
        "created_utc": 1479353911,
        "upvote_ratio": ""
    },
    {
        "title": "Help: the metamorphosis. Do you know of a text opposite to that?",
        "author": "everythingundersun",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5dc57b/help_the_metamorphosis_do_you_know_of_a_text/",
        "text": "I read \"the metamorphosis\". Can you reccommend me something that is the opposite of depressing? Not nessecarily manic but... I just feel it influenced me too much. Like days when I wake up and have no energy to go out of bed because its too cold I start to think about the metamorphosis and I just feel bad. I don't even nessecarily grt out of bed. That text made me feel bad because sometimes the world really is too real and overwhelming and cynical. I need something that can make me feel like It is okay to live. (By live I do not mean drink or smoke. I personally do not call that living. By live I mean have kids, have good daily dental and skincare rutines or delegating taxes)",
        "created_utc": 1479334858,
        "upvote_ratio": ""
    },
    {
        "title": "I want to read analytical works on urban spaces and the cityscape. Any suggestions?",
        "author": "the_doctoress",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5d98zk/i_want_to_read_analytical_works_on_urban_spaces/",
        "text": "So I am familiar with Bachelard, but his book doesn't really fit into my criteria. Will appreciate suggestions.",
        "created_utc": 1479303983,
        "upvote_ratio": ""
    },
    {
        "title": "Alexander Pope's The Rape of the Lock",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5d3iw7/alexander_popes_the_rape_of_the_lock/",
        "text": "[removed]",
        "created_utc": 1479228535,
        "upvote_ratio": ""
    },
    {
        "title": "English lit. Postgrad advice needed",
        "author": "bukorobe",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cykd4/english_lit_postgrad_advice_needed/",
        "text": "Hi, I was wondering if it would be worthwhile getting a masters in English literature at the Okanagan as a stepping stone towards getting a phd in the same field. I have the grades to get into the Okanagan campus, though I'm not sure that my grades are good enough to get into U of T, McGill, or UBCV's master's programs. my GPA will be roughly 3.25, from U of T, by the end of this academic year. Would it be more worthwhile staying an extra year or so to try to get my GPA to the minimum requirements for U of T/ to boost my final two years' GPA to the requirements for UBCV, or would it be more worthwhile to get a masters from UBCO - which I will ace; I did as poorly as I did in my undergrad because I slacked for my first few years - and then apply to a better school for my PHD? Time is an issue for me since I don't have any financial support from my parents, but I am completely willing to commit an extra year or two to my undergrad if a masters at another campus would be more valuable/ if my undergrad GPA needs improvement to get into a good PHD program. Any help is appreciated; I don't expect a comprehensive answer since I've posed a bunch of specific questions. Thanks!",
        "created_utc": 1479159294,
        "upvote_ratio": ""
    },
    {
        "title": "Critical texts on themes of love in literature",
        "author": "JPGoodale",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cydun/critical_texts_on_themes_of_love_in_literature/",
        "text": "I'm looking for some valid critical texts on the topic of love, relationships, etc in literature, especially poetry.",
        "created_utc": 1479157397,
        "upvote_ratio": ""
    },
    {
        "title": "Critiques of Genette?",
        "author": "kleinblack",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cwk6f/critiques_of_genette/",
        "text": "Will appreciate any interesting critiques of Genette, since I don't know where to begin.",
        "created_utc": 1479138164,
        "upvote_ratio": ""
    },
    {
        "title": "Need help understanding the meaning",
        "author": "sametees2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cv6bm/need_help_understanding_the_meaning/",
        "text": "[removed]",
        "created_utc": 1479116570,
        "upvote_ratio": ""
    },
    {
        "title": "Native American Historical and Theoretical Resources ....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5csxj7/native_american_historical_and_theoretical/",
        "text": "[deleted]",
        "created_utc": 1479081420,
        "upvote_ratio": ""
    },
    {
        "title": "Interpretation of Pound's 'La Fraisne'",
        "author": "TheEnchantedHunters",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5craye/interpretation_of_pounds_la_fraisne/",
        "text": "I'll say in advance, this isn't a school assignment-- I picked up a collection of Pound's poetry recently and this particular poem piqued my interest. I love the rhythm and emotion of it, but have a very hazy idea of what's going on. \n\nFirst few stanzas seem to suggest wisdom and strength are ephemeral and perhaps a distraction from something deeper? Is the tree really an object of love that caused him to leave human company (Apollonian sort of)? I also wondered if it's possible that the speaker is deceased. The tree is a coffin, he's been hushed, his face hidden where the oak spreads its leaves over him. He's left the company of men, wrapped his tears in ellum leaf and left them under a [grave]stone. \n\n\nI'm new to poetry and would love to hear some other observations and interpretations. \n\nhttp://www.bartleby.com/265/297.html",
        "created_utc": 1479062340,
        "upvote_ratio": ""
    },
    {
        "title": "Where to get started with Barthes for a beginner?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cp4sf/where_to_get_started_with_barthes_for_a_beginner/",
        "text": "[deleted]",
        "created_utc": 1479026023,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent has the concept of 'kitsch' or 'bad taste' in art emerged in different cultures throughout history?",
        "author": "propermandem",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5coe9c/to_what_extent_has_the_concept_of_kitsch_or_bad/",
        "text": "&gt;Kitsch (/ˈkɪtʃ/; loanword from German, also called cheesiness and tackiness) is a low-brow style of mass-produced art or design using popular or cultural icons. The word was first applied to artwork that was a response to certain divisions of 19th-century art with aesthetics that favored what later art critics would consider to be exaggerated sentimentality and melodrama. Hence, 'kitsch art' is closely associated with 'sentimental art'. Kitsch is also related to the concept of camp, because of its humorous and ironic nature.\n\nNot sure if this question fits here but I thought I would find some interesting and worthwhile responses: \n\nHow has aesthetic 'taste' in the arts been configured as a qualitative distinction between works, in particular those considered 'lower', 'vulgar', or even 'offensive'?\n",
        "created_utc": 1479011619,
        "upvote_ratio": ""
    },
    {
        "title": "I'm writing an article on fictionalized literary representations of Queen Elizabeth II -- can you suggest any that I may have missed?",
        "author": "NMW",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cn7e4/im_writing_an_article_on_fictionalized_literary/",
        "text": "The main ones I'm working on so far include:\n\n- Alan Bennett's *The Uncommon Reader*\n- Peter Morgan's *The Audience*\n- Sue Townsend's *The Queen and I* and *Queen Camilla*\n\nI can't believe for a second that this is the extent of fictionalized literary representations of the Queen doing and dealing with things. Can you suggest that I've missed?\n\nI've got plenty of examples from film and television as well, so don't worry about that unless you know of an obscure example!",
        "created_utc": 1478994331,
        "upvote_ratio": ""
    },
    {
        "title": "Need recommendations for an accessible book with themes surrounding social inequality for book swap with conservative partner.",
        "author": "rrhat",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cmspz/need_recommendations_for_an_accessible_book_with/",
        "text": "My partner and I have agreed to select 3 books each and then have the other one choose one of the three picked by the other to read. My partner has a high school education, grew up in the south in a military family, and has had little exposure to groups of people different than him (white, middle class, heterosexual Christian). I grew up in a diverse area in the northeast and am a PhD candidate in sociology. We have extremely different opinions on social and political issues. He's a good person but a lot of his opinions come from sheer ignorance and I want to take this opportunity to expose him to experiences and perspectives outside of what he knows, or thinks he knows. \n\n\nI particularly want to choose a book that will help him understand the history of race relations in this country and the implications because I know it's something he's ignorant to and something that gives him a lot of blind spots in his everyday thinking and life. \n\n\nHe is not a reader at all, so I need to be very strategic about the 3 books I give him to choose from. Dense, academic books will turn him off and those are all I really read anymore because of school and my career field. The books really need to be accessible. The terms of our agreement include that the books should be under 400 pages, which has been tough. The books can be fiction or non-fiction. \n\nI was thinking about A People's History of the United States, though it's over 400 pages and I'm worried it will be too much for him. \n\nAny recommendations would be really appreciated. Again, this is a really great opportunity to challenge his views, so I want to be really careful and strategic about the books I choose. \n\nEdit: Thanks very much for the recommendations. As an added note, one thing I'm worried about with books set relatively far in the past is that he'll still be able to think \"well things aren't like that anymore.\" ",
        "created_utc": 1478989012,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain this famous 'Faust' (Goethe) quote in context of the play?",
        "author": "gayforme",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5ckk68/can_someone_explain_this_famous_faust_goethe/",
        "text": "From Wikipedia: \nDas Ewig-Weibliche\nZieht uns hinan.\n\nThe Eternal Feminine\nDraws us on high.\n\nI sort of understand what is going on here and the basic idea of what is being said, but I feel that I'm missing something in interpretation because many people claim this is a very important part of the play. I don't speak German so I have to go off the English translation which I've also heard only roughly translates possibly hindering my understanding. If anybody could help at all, I'd greatly appreciate it, thank you!\n",
        "created_utc": 1478960205,
        "upvote_ratio": ""
    },
    {
        "title": "Did Samuel Johnson ever write about Pope's \"Essay on Man\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5chcmk/did_samuel_johnson_ever_write_about_popes_essay/",
        "text": "[deleted]",
        "created_utc": 1478903515,
        "upvote_ratio": ""
    },
    {
        "title": "Simile or Metaphor?",
        "author": "Kryton112",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5cablp/simile_or_metaphor/",
        "text": "From Shakespeare's 'As You Like It'\n\n\nOrlando: -for call you that 'keeping' for a gentleman of my birth, that differs not from the stalling of an ox?\n(act 1, scene 1, lines 7-8)\n\nThank you for your help.",
        "created_utc": 1478811636,
        "upvote_ratio": ""
    },
    {
        "title": "A question on literary analysis",
        "author": "monadoboyzanza",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5c930y/a_question_on_literary_analysis/",
        "text": "Here is some context. I am an senior in HL 2 for IB English and I struggle greatly with this class. I would like to ask how exactly I analyze a work and create social commentary in an essay since this is where my greatest source of difficulty is. I would also like to ask how to analyze a writer's style in an essay. Any help would be appreciated. Thank you ",
        "created_utc": 1478798996,
        "upvote_ratio": ""
    },
    {
        "title": "Third spaces",
        "author": "ModernContradiction",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5c90ks/third_spaces/",
        "text": "Preface: So I study literature but thought my question was more sociological in nature. However, posting this in /r/AskSocialScience didn't produce a single response, so I'll try you all here. \n\nQuestion: In something I'm writing I have found a need for a specific approach from what I believe to be a sociological direction-\nI'm searching for people who have theorized a sort of 'third space' that is created when two individuals communicate; an abstract space which is similar to that formulated by the likes of Bhabha in postcolonial studies and Soja in political geography or whatever you'd call him, but more specifically on the micro scale of one to one or group human interaction. Like, that essential thing we do every time we interact with others; indeed, that thing which is fundamental to being human (one might argue). If you can direct me to anything key in this area, whatever seems most relevant, I'd be glad to check it out. Thanks in advance.\n",
        "created_utc": 1478798307,
        "upvote_ratio": ""
    },
    {
        "title": "Help with PhD application writing sample on Faulkner",
        "author": "ICanHearYouClearly",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5c86sq/help_with_phd_application_writing_sample_on/",
        "text": "Hi, AskLiteraryStudies,\n\nI'm applying for a couple PhD programs and intend on studying American modernist and Southern literature. My background includes no publications and a middling graduate record, so I'm depending on my writing sample and statement of purpose.\n\nI plan on writing a new paper for my application since I'm not satisfied with any of my graduate work, including that for which I received great grades. As my title indicates, I'd like to write on Faulkner, particularly *The Sound and the Fury* (unless others feel scholarship on it is too profuse already, if that even matters in a PhD application).\n\nThe issue I'm encountering is that a current student in my dream program (the University of Florida's) said its faculty seem to value \"cutting-edge people\" that are \"pushing the boundaries of academic scholarship,\" and while I'm well-versed enough in Foucault, Barthes, Lacan, and other giants of mid-century theory, I have no idea what is considered \"cutting-edge\" or even relevant nowadays. Essentially, I am at a loss as to how I might approach my author and work of choice in such a way that I am one of those \"pushing the boundaries.\"\n\nI suppose my questions, then, are such: What are some trending theories? Does my paper even need to be grounded in a specific one (certainly, I've written many a paper simply exploring a concept not dependent on theory)? Are there any currently popular theories that might apply especially well to Faulkner?\n\nAny general advice regarding PhD applications would be appreciated as well. Sincerest thanks.\n\nEdit: Thank you to all who answered. I didn't expect such help from a seemingly relatively inactive sub, but it's been invaluable, and I'm glad I took the time to post!",
        "created_utc": 1478789456,
        "upvote_ratio": ""
    },
    {
        "title": "God of small things",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5bt2v9/god_of_small_things/",
        "text": "[deleted]",
        "created_utc": 1478610431,
        "upvote_ratio": ""
    },
    {
        "title": "Pudd'nhead Wilson Critique",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5bqrx1/puddnhead_wilson_critique/",
        "text": "[removed]",
        "created_utc": 1478573770,
        "upvote_ratio": ""
    },
    {
        "title": "Help in literary analysis?",
        "author": "OlliHF",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5bkgqf/help_in_literary_analysis/",
        "text": " My English classes from this year onward will be centered around literary analysis, and I can't seem to be any good at it. When I finally think I understand, my essay is returned with a marking of \"incorrect analysis\". Am I just not capable of the kind of thinking required for actual correct analysis? Any help would be appreciated, as my grades amongst other things depend on this.\nThanks.",
        "created_utc": 1478495866,
        "upvote_ratio": ""
    },
    {
        "title": "Is it Goneril or Albany saying this line in King Lear 5.3?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5be70w/is_it_goneril_or_albany_saying_this_line_in_king/",
        "text": "\"That were the most if he should husband you.\"\n\nMy Bevington Complete Works has Goneril saying the line, and I think this is correct, but a few texts have Albany saying that in the same place. Weird. \n\nExample: https://books.google.com/books?id=G70SDAAAQBAJ&amp;pg=PA1181#v=onepage&amp;q&amp;f=false\n\n-----------------------------------------------------------------------------------------------------------------------\n\nThanks for the answer /u/qdatk. I would like to encourage people now to give their opinion of which reading works better if they happen upon this question. Anyway, I want to give mine. I'd say Goneril makes a lot more sense here, because although Albany does have a personality that could say this, I think he would still be outwardly polite to Regan at this juncture. He's going to go on the offense against everyone momentarily, it's true, but more convincing evidence in Regan's response:\n\n\"Jesters do oft prove prophets.\"\n\nThis seems more likely to be directed at someone more familiar than her brother-in-law.",
        "created_utc": 1478406908,
        "upvote_ratio": ""
    },
    {
        "title": "History of books?",
        "author": "brngrs",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5b797x/history_of_books/",
        "text": "Hello. \n\nI'm writing an extensive work on early modern literature. Influenced by Franco Moretti, I got really interested in the connection between literary history and history of books. I'm reading a lot of stuff (Darnton, Chartier etc.), but, until now, I've found only two reference books: The Coming of the Book, by Lucien Febvre, and The Printing Press as an Agent of Change, by Elizabeth Eisenstein. Do you guys have any other suggestion? I couldn't find any more recent major works on this topic... ",
        "created_utc": 1478305368,
        "upvote_ratio": ""
    },
    {
        "title": "This may be the wrong place to ask--",
        "author": "QDefenestration",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5b1bue/this_may_be_the_wrong_place_to_ask/",
        "text": "[removed]",
        "created_utc": 1478228972,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure where to post this, a livestream decolonizing conference",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5b05s6/not_sure_where_to_post_this_a_livestream/",
        "text": "[deleted]",
        "created_utc": 1478214896,
        "upvote_ratio": ""
    },
    {
        "title": "The Road Less Traveled. M Scott Peck",
        "author": "TrueHanya",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5az2j6/the_road_less_traveled_m_scott_peck/",
        "text": "[removed]",
        "created_utc": 1478203708,
        "upvote_ratio": ""
    },
    {
        "title": "British Romanticism and Politics",
        "author": "saranoctoplate",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5avbb8/british_romanticism_and_politics/",
        "text": "Hello!\n\nI'm taking a Romanticism course and we haven't talked much about the politics or the history of the time. So, I'm wondering to what extent did Romanticism play on actual change rather than critique? I'm sorry if this is more of a history question. If it is I'll delete the question. ",
        "created_utc": 1478155392,
        "upvote_ratio": ""
    },
    {
        "title": "Time of text",
        "author": "romgal",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/5au8pl/time_of_text/",
        "text": "Redirected here.\nShort and sour question: is there a foolproof way of being able to tell the time when a piece of literature was written if your only knowledge of the text is the raw manuscript with no knowledge of the author and its whereabouts? I thought of following the motifs and style of the text but it could be contemporary or it could be written in the early XXthth century.\n\nIt's a chapter from a work of fiction. I can't tell if the author is mimicking the language/trying to set the scene in that time period or it was actually written back then.",
        "created_utc": 1478139688,
        "upvote_ratio": ""
    }
]