[
    {
        "title": "\"Beware the Ides of March\" - I need to know as much info about the accuracy of this phrase as I can.",
        "author": "Robot_Anne_Frank",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1aj5ip/beware_the_ides_of_march_i_need_to_know_as_much/",
        "text": "I'll try and keep this short. I was born on March 15th, and have been toying with the idea of getting a tattoo of this phrase. I really wanted something authentic, such as a copy of the original handwriting. A bit of research showed me that this wasn't possible. Now I'm looking for some experts to help me make sure that whatever I come up with is accurate. I need to know if the phrasing is exact (nothing like \"Bewareth you, the ides of march) in all versions. How it would have been written (capitalization, spacing, spelling, etc) in 1599. Also, if you all happen to know, what would be the most accurate font I could pick?\n\nThanks for your time!",
        "created_utc": 1363624742,
        "upvote_ratio": ""
    },
    {
        "title": "Any ideas on something interesting I can write regarding the esteemed Samuel Johnson?",
        "author": "CUNTMUSKET_MCGEE",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1aiqx1/any_ideas_on_something_interesting_i_can_write/",
        "text": "I must write a 4000 word undergraduate piece on Samuel Johnson, but whereas usually we're given prescriptive assignments, this time I have completely free reign to choose. So I'd really appreciate some inspiration!\n\nAs a background to my interests, I already wrote a short piece questioning whether his poem 'London' was successful as political satire. So I'm potentially interested in his politics, but at the moment I'm really keeping an open mind. I'm interested in anything from analysis of his language to his opinions on national identity. At this stage, I just need general ideas; I've never before faced a writer with such a varied canon.\n\nCould be any of his works: whether it's a body of his essays, his preface to Shakespeare, *Rasselas* etc.\n\nAlso, I'm keen for comparisons with relevant writers where possible! Whether that be a translation of Juvenal, or a poem of Pope's. The more interesting (and, if possible, some ground that hasn't been frequently covered), the better!\n\nThanks in advance.",
        "created_utc": 1363609466,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone give an interesting analysis of \"anyone lived in a pretty how town\"?",
        "author": "beckweathers51",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1aaptc/can_anyone_give_an_interesting_analysis_of_anyone/",
        "text": "I was reading it and am very confused by both the structure/punctuation and as well as the overall storyline.",
        "created_utc": 1363284404,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for a copy of 'On the value of Hamlet' by Stephen Booth?",
        "author": "Rincewind108",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1aa6ek/im_looking_for_a_copy_of_on_the_value_of_hamlet/",
        "text": "I've found a copy on google books but it is missing pages. Any good websites for finding literary criticism would also be appreciated. ",
        "created_utc": 1363267225,
        "upvote_ratio": ""
    },
    {
        "title": "Books on Romanticism/Modernismo and Nationalism/Mass Politics",
        "author": "philanchez",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a9hkm/books_on_romanticismmodernismo_and/",
        "text": "I'm an MA student in history and need some help for a paper on the connections between Romantic Literature and the rise of Nationalist politics. I was wondering if there were any books people could recommend, especially concerning French Romanticism and Latin American Modernismo. Thanks in advance! Oh, and any books discussing theoretical questions about the connection between literature and politics in general would be appreciated as well.",
        "created_utc": 1363231770,
        "upvote_ratio": ""
    },
    {
        "title": "H.G. Wells' Time Machine &amp; Queer Theory",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a7y5f/hg_wells_time_machine_queer_theory/",
        "text": "I've got to write a paper for a critical theory class applying queer theory to Wells' The Time Machine, and I'm totally hitting a wall even thinking about what direction I could take it. Can you think of an area in the story where we could stick a queer 'wedge' into the text? Any article recommendations or potential theses?",
        "created_utc": 1363189900,
        "upvote_ratio": ""
    },
    {
        "title": "Help on an interesting story to illustrate...",
        "author": "lucydill",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a7nqa/help_on_an_interesting_story_to_illustrate/",
        "text": "I'm an illustration student hoping for some **suggestions on an interesting book / short story** to illustrate.\n\nA short story which I thought might be quite visually exciting is 'The Yellow Wallpaper' by Charlotte Perkins Gilman. I'd love to find a great story which not many people know that I could almost introduce people to through illustrating it!\n\nIdeally I hope to find a story which is less iconic and well known compared to some classics such as 'Wuthering Heights' which many of my classmates are illustrating.\n\nAny suggestions would be brilliant! :) Thanks!",
        "created_utc": 1363179518,
        "upvote_ratio": ""
    },
    {
        "title": "Profs of r/ASL. Second opinion on an essay grade.",
        "author": "alsessay",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a7liz/profs_of_rasl_second_opinion_on_an_essay_grade/",
        "text": "Hi there. I'm a final year undergraduate who recently wrote on Ibsen and Pinero. I got slaughtered. I felt it incongruous. Would there be someone here who would be willing to take a peek at this thing (2000w)? \n\nPlease pm. I'd be indebted to you. ",
        "created_utc": 1363176258,
        "upvote_ratio": ""
    },
    {
        "title": "I need to better myself. Looking for some positive literature regarding women in society, their sexuality, or their femininity.",
        "author": "losingfaithinhumanty",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a74pe/i_need_to_better_myself_looking_for_some_positive/",
        "text": "As a multi-ethnic Canadian, I've never had a problem with predjudice or stereotyping others, but recent events have caused me to form a strong misogynistic view that I'd like to get rid of. I considered reading Simone de Beauvoir's \"The Second Sex\", but I've been told she actually has a strongly negative opinion in regard to women. I would really like something from a female point of view, or a just a psychoanalytical piece. Thank you.\n\nExtra: I'm not sure if this semi-blog is relevant in recommending a book so I'll just tack it on to the end since there's no spoiler tags. You can skip it if you'd like, plus it feels good to let it out. The cause of my misogyny comes from (I think) my first relationship, in which my girlfriend liked to be \"abused\" in bed and treated like a sex object. For the most part, she appreciated me if I acted like a jerk more than when I was genuinely kind. After breaking up because of the dirty feelings it gave me, the effectiveness of \"pick up artists\" began to degrade any respect for women I still had. If they are unknown to you, they essentially treat women like human garbage in exchange for sex. The nail in the coffin is the fact that in personal experience since then, acting like an asshole garners sexual attention while being a \"nice guy\" is completely ineffective. I'd really really really really really like to gain the respect for women back that I used to feel through understanding things from their point of view, considering my sister is part of that group.",
        "created_utc": 1363149486,
        "upvote_ratio": ""
    },
    {
        "title": "How would you pronounce this? (from Midsummer Night's Dream)",
        "author": "nikkikat",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a6vqc/how_would_you_pronounce_this_from_midsummer/",
        "text": "So I have to perform MNS for my English class and this happened to be one of my lines:\n\nMost brisky juvenal and eke must lovely Jew.\n\nHow would you pronounce the word eke? ",
        "created_utc": 1363141992,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any literary works about etymology?",
        "author": "Fuck_if_I_know",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a4e94/are_there_any_literary_works_about_etymology/",
        "text": "It seems somewhat likely to me that there is some postmodern author who has written a book where etymology plays a role and I would love to read such a book. Do you know of any?\n\nEDIT: I must clarify: I say postmodern, without knowing, of course, what it means. I was basically thinking of 'weird shit', like the sort of fantastic craziness of *La Disparition* (The Void) by Georges Perec.",
        "created_utc": 1363053685,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a beginner at poetry, and am looking for suggestions of classic poems that I can illustrate, along the lines of Under Milkwood/Jaberwocky",
        "author": "Jisusu23",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a3yip/im_a_beginner_at_poetry_and_am_looking_for/",
        "text": "I'm an aspiring children's book illustrator/animator, and really want some practice with poems and short stories. I'm new to poetry but would love to experience some awesome suggestions from those who love it, as I feel I'm missing out. I'm looking for poems to read/listen to that are strongly emotive and descriptive. Bonus points if there's a radio play version. Preferably no love poetry, but I would appreciate pieces like Jabberwocky, The Owl and the Pussycat and Under Milkwood that strongly communicate a mood and story using unorthodox metaphor. Also I would prefer classics that people may know and might be able to recognise if I eventually illustrate the piece. If you have any short story suggestions, that would also be welcome, as I'm a big fan of pieces like The Tell Tale Heart. If anyone's interested in seeing their favourites illustrated as well, I'd be happy to post when I'm done. ",
        "created_utc": 1363041335,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about Puck? [Shakespeare] ",
        "author": "ladywindermere",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a3vcx/what_do_you_think_about_puck_shakespeare/",
        "text": "I've read *A Midsummer Night's Dream* at least ten times in my life, and typically think of Puck as the main character/narrator.  I mentioned this to someone else, thinking it was common knowledge (or that I had been taught that by a teacher) and they seemed surprised.  Am I crazy? Or is Puck commonly categorized as the narrator/main character/\"author\" representation in the play?",
        "created_utc": 1363038988,
        "upvote_ratio": ""
    },
    {
        "title": "Science fiction litterature - twist and narrative strategies.",
        "author": "SteelDelicatessen",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a2w1s/science_fiction_litterature_twist_and_narrative/",
        "text": "Hi r/AskLiteraryStudies \n\nThis is my first post in this subreddit and I hope it's the right place to ask for help.\n\nI'm currently looking for theorists or other writers who may have looked for common trends in the narratives of science fiction litterature, particularly short fiction. More specifically I wonder if anyone has looked for any reason for the (I think) common use of the \"twist ending\" and what purpose this might serve. \n\nAll help will be greatly appreciated",
        "created_utc": 1363007956,
        "upvote_ratio": ""
    },
    {
        "title": "The Female Body within Paradise Lost - Ideas on Sin and Eve",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1a1byf/the_female_body_within_paradise_lost_ideas_on_sin/",
        "text": "I'm doing a paper on the Female Body within paradise lost, and have yet to narrow down my focus. I'm thinking about comparing descriptions of Sin and Eve (and also angelic bodies, adam, god, etc). Sin as allegory, and Eve as the performer of Original sin offers an interesting comparison and contrast.\n\nAny ideas and directions are appreciated. Looking at different books and theories. It can be as broad as books solely on the female form, or ideas on how to compare the descriptions of Sin and Eve.\n\nThanks in advance.",
        "created_utc": 1362943638,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone recommend good genre theory/narratological litterature on Science Fiction?",
        "author": "SteelDelicatessen",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19u9no/can_anyone_recommend_good_genre/",
        "text": "As stated in the title. More specifically I'm looking for something that might lay out common trends such as the \"twist ending\" (of course not exclusive to this genre but I find it very common in short fiction in particular.). I have plenty of litterature about symbolism and societal interpretations but I find myself at a loss when it comes to a theorist/writer laying out common narrative strategies.\n\nPerhaps some of this pertains more to the pulpy roots of the genre, but in any case I'd like to know if anyone has taken this up for closer examination.\n\nAll help would be most appreciated.",
        "created_utc": 1362656411,
        "upvote_ratio": ""
    },
    {
        "title": "\nwhy is referring to a previous author's iterations of your ideas a justification of your own thesis?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19mkli/why_is_referring_to_a_previous_authors_iterations/",
        "text": "I'm having a little trouble phrasing this question, so I'll give an example. I just finished Eugene Thacker's In the Dust of this Planet. I found this book to read like a literature survey rather than a set of coherent arguments for his thesis. The vast majority of the book was him pointing out examples of his theses in previous works (e.g. Goethe said the same thing in Faust that I'm saying here, see? Dante also said it in the Inferno, see?). I don't understand why this is accepted as support for an argument. And if it's not, what is the point of putting that in your book?",
        "created_utc": 1362380481,
        "upvote_ratio": ""
    },
    {
        "title": "Osvaldo Lamborghini, is he really is a great poet?",
        "author": "historiadelllanto",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19lui2/osvaldo_lamborghini_is_he_really_is_a_great_poet/",
        "text": "Having read him, he strucks me as trying too hard to be \"cool\" instead of \"wasting time\" being honest and opening his hearth. I dont think I have read a single line of him that wasnt trying hard to be cool,  \"metaliterary\", anecdotical, violent, etcetera. Do you agree with this? Can you explain why some people consider him the great \"poeta maldito\"?",
        "created_utc": 1362356662,
        "upvote_ratio": ""
    },
    {
        "title": "Please help. What story/book is this?",
        "author": "chunklemcdunkle",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19i5he/please_help_what_storybook_is_this/",
        "text": "I read a book a while back but can't remember who wrote it or what the title is. \n\nIts about a colonial (i believe) riflemaker who makes this really nice rifle. It goes into explaining in great detail how finely crafted it is, detailing almost every step in beautiful detail. \n\nAfter that it focuses on the rifles journey from person to person after it leaves his hands for whatever reason. I never got to finish it. \n\nIf anyone knows what this story is, i would greatly appreciate it because i dont read as much as i should and this would definitely help me get back on the ball.\n\nThank you!",
        "created_utc": 1362194219,
        "upvote_ratio": ""
    },
    {
        "title": "Textbooks for Close Reading",
        "author": "silly_walks_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19fh69/textbooks_for_close_reading/",
        "text": "Just like it sounds. I'm in need of a textbook for introductory courses that can walk students through the process of close reading / literary analysis. A step-by-step, in depth account would be best. I'd also be interested in specific chapters from books. Oh, and feel free to share what kinds of assignments you've given (or have been given in the past).\n\nNote: I do not want a theoretical justification of how or why we close read. ",
        "created_utc": 1362096457,
        "upvote_ratio": ""
    },
    {
        "title": "[Shakespeare/Anti-Stratfordianism] When I was in grad. school, it was fairly non-controversial to teach that there was some doubt as to the authorship of the texts attributed to Shakespeare; has Anti-Stratfordianism become more fringe than it was?",
        "author": "selfabortion",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19exnn/shakespeareantistratfordianism_when_i_was_in_grad/",
        "text": "When I last studied Shakespeare, it was routinely mentioned by professors that there was a reasonable chance that works attributed to Shakespeare could have in fact been another individual author or, in fact, multiple authors.  I never latched onto the notion and generally wasn't terribly interested in it, but it was presented as at least being a respectable position to take that Shakespeare might not have been who we say he is. At the time I remember generally being of the opinion (re: alternative authorship) that, \"Well, it seems unlikely, but I'm not going to be utterly dismissive of the possibility.\"\n\nHowever, I'm currently reading a book that discusses perpetuations of pseudoscience, conspiracy theories, and other sorts of misinformation.  In a section on various forms of denialism, the author brought up Anti-Stratfordianism in the same sentence as 9/11 Truthers, geocentrists, young-earth Creationists, and Birthers, which struck me as a substantial shift into woo-woo territory compared to where I last recall the matter.  \n\nI did my master's project on Shakespeare's *Titus Andronicus* many years ago, but I have not kept very current on Shakespeare studies, nor have I looked too deeply into this particular matter anyhow.  My question is, for those of you who have a particular focus on Shakespeare, is the Anti-Stratfordian view generally considered to be as ridiculous and unsupportable as the other topics I mention above, such as geocentrism?  Or is the author of the book I'm reading unreasonably inserting that position into the denialism catalogue?\n\nEDIT - Some grammars\n",
        "created_utc": 1362081421,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any metered, epic poems that use Heroic couplets?",
        "author": "ringsnmodules",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/19ai9j/are_there_any_metered_epic_poems_that_use_heroic/",
        "text": "I'm looking for more epic poetry, my favorite kind, but it seems most of the good ones, except for Paradise Lost, weren't written in English and so tend to lose a lot of the added techniques and fun stuff, such as alliteration, rhyme, and meter.\n\nAre there any good ones from English, or at least translated so they are still metered and rhyme?",
        "created_utc": 1361922328,
        "upvote_ratio": ""
    },
    {
        "title": "Topic for a term paper relating The Great Gatsby and The Waste Land?",
        "author": "senor_Juarez",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/199qj8/topic_for_a_term_paper_relating_the_great_gatsby/",
        "text": "My professor has assigned a paper to my class that must assess a common theme, symbol, motif, etc, in F. Scott Fitzgerald's The Great Gatsby and T.S. Eliot's The Waste Land",
        "created_utc": 1361901371,
        "upvote_ratio": ""
    },
    {
        "title": "Who is Doctor TJ Eckleburg? [The Great Gatsby]",
        "author": "fatsam101",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/194w11/who_is_doctor_tj_eckleburg_the_great_gatsby/",
        "text": "I am re-reading The Great Gatsby and I have a question about that Dr TJ Eckleburg fellow. So he is the man on the faded out sign staring down at travelers coming from East and West Egg to Manhattan. When I first read Gatsby I though he was representative of a god that is no longer relevant in this materialistic and wealth-centric society that is now so pervasive in the 1920's but now I feel like it is more than that. I'm not really sure what I am thinking but it seems too simple, too obvious to be an effective device. Thoughts?",
        "created_utc": 1361721361,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the study of literature important?",
        "author": "SecondBandOnTheMoon",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1911y2/why_is_the_study_of_literature_important/",
        "text": "I'm sure this question has been asked here many times before, but I have searched for an answer to it on Google, Reddit and through my own professors and have not had any luck finding a satisfactory answer.\n\nTo give a little background about where I'm coming from, I am a third year literary studies major and since middle school, I have lived and breathed literature, finding a friend in Hemingway and Fitzgerald and Joyce where I couldn't in high school. Literary studies seemed like the obvious path when I entered college, but now, nearing the end of my junior year, I more and more often find myself asking why?\n\nTo me, the study of literature seems very self contained, in that the scholarship being published is being published only for the benefit of other scholars or prospective students to use as a secondary source. While I understand that in most fields, the primary readership of scholarly articles is other scholars, I fail to see the \"payoff\" of literary studies, compared to say history, or psychology, or any of the hard sciences where those studies might lead to tangible result.\n\nThe most common answer I've heard is that the study of literature allows us to better understand the human condition, but does that really require a formal study of literature in college? Does using outdated Freudian psychoanalysis or analyzing the Bundren children based on birth order pseudoscience or studying race relations and misogyny in \"Indian Camp\" really further our knowledge in ways that actual studies in psychology and sociology cannot? Literature as a path of study, to me, only really seems beneficial as a supplement to a history degree, or a psych degree or something more specialized. \n\nPerhaps I have yet to really understand the study of art, but I would be very grateful for any answers you might have that might help me better understand the reason and relevance behind what I study. Thanks for reading through this!",
        "created_utc": 1361552384,
        "upvote_ratio": ""
    },
    {
        "title": "Design and Literature (xpost from r/design)",
        "author": "broomhahaha",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18yy7o/design_and_literature_xpost_from_rdesign/",
        "text": "I recently found a book about calligraphy, and have been having some wonderful thoughts about, I guess, a book as an object d'art. I'm trying to solidify some of these thoughts, sort of bring them from idea into concept, and I was looking for some resources.\n\nI'm imagining a sort of literary triptych, three distinct stories with structural and thematic similarities, divided by 'frames' that accentuate the common themes and structures. I'm thinking something like Finnigan's Wake meets the Voynich Manuscript; calligraphy and fractals.\n\nHave any visual artists examined written language, words and letters, not just as icons but as representations of themselves? Does anyone know of any work that examines the physical structure of prose? Does this remind you of any works of design or literature?",
        "created_utc": 1361474516,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good or \"classic\" stylistic analysis essays? (x-post r/Literature)",
        "author": "Paid_Spokesperson",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18yefr/what_are_some_good_or_classic_stylistic_analysis/",
        "text": "I am particularly interested in papers or essays that focus on a particular work or passage and give a clear, exemplary analysis of the text.",
        "created_utc": 1361457868,
        "upvote_ratio": ""
    },
    {
        "title": "I am looking for some critical/theoretical background on Apocalyptic fiction in the period 1960-Present day.",
        "author": "necrododo",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18the8/i_am_looking_for_some_criticaltheoretical/",
        "text": "I am writing my dissertation on the topic of apocalyptic fiction (not dystopian, not utopian but end-of-the-world narratives) including nuclear, climate, technological, plague or zombie. Drawing comparisons between modern and traditional, christian end-of-the-world narratives (i.e biblical prophecy), I argue that modern apocalyptic fiction expresses the secular fears of our generation (of both our infinite power and impotence, the thin veneer between order and chaos and the corruption of institutions) while retaining the traditional tropes of western eschatology, particularly in images, the importance of journeys and the fundamental tone of immediacy and inevitability entrenched in the christian narrative. This stems from Susan Sontag's quote in \"Aids as Metaphor\", that modern society has an attitude not of \"Apocalypse now\" but \"Apocalypse from now on\", meaning that we are constantly expecting our total destruction. I fundamentally disagree with this, and feel that this is a continuous theme of western existence that connects to our strong sense of mortality and the importance of death within a christian paradigm. I argue that apocalyptic fiction is not a reaction to self-destructive modern culture but rather a framework (as it has always been) in which to explore both timeless fears and modern ones.\nI am looking for theoretical or critical works related to this, preferably either supporting or opposing my argument, that I could have a look at and feed into my dissertation. If any one has any suggestions, I would be much obliged.",
        "created_utc": 1361284353,
        "upvote_ratio": ""
    },
    {
        "title": "Conflict in 'The Hollow Men' by T.S. Eliot ",
        "author": "ShazMaz",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18qr36/conflict_in_the_hollow_men_by_ts_eliot/",
        "text": "It's a long shot and this is the only subreddit that looks promising. I'm not sure if this fits, but any help I can get would be great. \n\nMy theme is 'Conflicting Perspectives'. My teacher gave us each a poem, mine is 'The Hollow Men' by T.S. Eliot. Despite how much I've read and all the analysis I've read, I can't find anything 'conflicting' within it. Any ideas? \n\n[Here's the poem - Sorry, it's a long read] (http://poetry.poetryx.com/poems/784/)\n\nEDIT: I'm not asking you to analyse it for me, I just need an idea I can work with. ",
        "created_utc": 1361178265,
        "upvote_ratio": ""
    },
    {
        "title": "Does Post-Modernism really exist?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18piwj/does_postmodernism_really_exist/",
        "text": "I was looking through a thread on /r/literature and came across the following comment:\n&gt;Exactly! It's supposed to be dizzying. DFW could often be heard to remark in interviews that real post-post-modernism is about using the style and content of your writing to induce a reader to feel the theme of a novel; to feel like they're the protagonist, in a way.\n[source](http://www.reddit.com/r/literature/comments/18lovn/just_finished_infinite_jestand_i_only_have_one/c8g0sci)\n\nNow I think I have a decent handle on what Modernism is in regards to the general movement, but I can't wrap my head around the idea of a post-modernism (or even the supposed post-post-modernism mentioned above). I can understand that general, broad shifts can signal perhaps a new, distinct \"movement\" (such as naturalism in the 19th century), but I'm not convinced that the particular development described above is anything of that nature.\n\nCan the idea of \"using the style and content of your writing to induce a reader to feel the theme of a novel; to feel like they're the protagonist\" really be considered anything beyond a modernist notion? Was not the whole point of stream-of-conciousness developed to accomplish exactly this? Certainly authors such as Faulkner used the style to capture the chaos of the \"now\" in order to push towards a convergence of narrator and reader. One of Faulkner's strongest themes throughout his collection of works is the notion of time, and the very purpose of his scrambled texts is to push away from the traditional reflective narrative (organized and given meaning through hindsight) towards one that tumbles headlong through the present, letting the reader experience the disarray and confusion that his characters certainly feel.\n\nAre DFW's efforts not of the same vein? I haven't read Infinite Jest myself, but I have read The Pale King and I can see how even the incomplete work develops towards instilling the theme on the reader in the way the quote above describes. I'm just wondering how this can be seen as anything more than simply a different way of reaching the same goal.\n",
        "created_utc": 1361134458,
        "upvote_ratio": ""
    },
    {
        "title": "Is Literature its own category?",
        "author": "irawwwr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18pgm8/is_literature_its_own_category/",
        "text": "I know this debate has been done to death in the last 60-70 years, but I am interested to know more about the discussions and arguments.\n\nWhat is literature and what separates it from say, an ad on newspaper, or a poster? ",
        "created_utc": 1361132557,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a poem a work of art worthy of framing, or publishing...?",
        "author": "wordplay86",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18nr0i/what_makes_a_poem_a_work_of_art_worthy_of_framing/",
        "text": "I have written dozens of pieces of amature poetry and submitted them here on reddit. Most of them came quickly, in a frenzied state of free-writing. Sometimes I'll refine them a bit by trying to structure them, clarify them, better them in any way I can.\n\n\nAlmost everything I have written has taken less then an hour, though some revisions occur over months and years. I feel like a work of art should take more time.\n\n\nI'm not sure any of them are worthy of being published or anything of that nature. Some of them are \"deep\" to me, and some of them might do a half-decent job of painting a picture with words.\n\n\nI'm not sure what I'm looking for here. I would love to create something refined, something poets and literary critics would actually enjoy and maybe even share.\n\n\nWhat makes a poem a piece of art worthy of this? Is it a combination of structure, focus, word-choice and imagery? Rhymes and alliteration?\n\n\nIs \"poetry\" to-par with the greats like Poe and Shakespeare (whom I actually don't enjoy that much) an impossible deed these days, the world being so over saturated with poems and poetry (mostly due to the internet)?\n\n\nDo I need to learn how to structure poems into \"feet\" or is this merely for analytical purposes?\n\n\nI know what I am asking is rather vague, and maybe impossible to explain. But if anyone can push me in the right direction I would appreciate it more than you could ever know.\n\nThanks for your time.",
        "created_utc": 1361053431,
        "upvote_ratio": ""
    },
    {
        "title": "What could be the literary significance of \"August\"?",
        "author": "katieya",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18kkvs/what_could_be_the_literary_significance_of_august/",
        "text": "I'm trying to analyze Ezra Pound's \"The Tea Shop.\"\n\nI think the line about August is really interesting and I was wondering if any of you had ideas about what it could mean. All that's coming to mind is sun damage and the passing of time. The end of summer maybe, the end of her summer season of beauty and all that? All ideas are welcome. I know Pound doesn't write things with less than a bajillion meanings... so anything is appreciated. \n\nHere's the poem:\n\n    The girl in the tea shop\n                   Is not so beautiful as she was,\n    The August has worn against her.\n    She does not get up the stairs so eagerly;\n    Yes, she also will turn middle-aged,\n    And the glow of youth that she spread about us\n                   As she brought us our muffins\n    Will be spread about us no longer.\n                   She also will turn middle-aged. ",
        "created_utc": 1360913722,
        "upvote_ratio": ""
    },
    {
        "title": "What is the poetry equivalent of a 'Roman à clef'",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18ecfh/what_is_the_poetry_equivalent_of_a_roman_à_clef/",
        "text": " \nWhat's the correct term for a 'novel with a key' when referring to poetry. \n\nPoésy à clef?\n\nPoéme à clef?\n\n\n\n\n\n",
        "created_utc": 1360701961,
        "upvote_ratio": ""
    },
    {
        "title": "Why did Golding use the pig to represent the devil in Lord of the Flies?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18btuc/why_did_golding_use_the_pig_to_represent_the/",
        "text": "First off, sorry if this is the wrong subreddit. Anyways, we just finished this book in class and this was a question that popped into my head. Did Golding ever say why he used the pig, instead of a different animal? Is there any symbolism at all to this? Thanks for your help in advance",
        "created_utc": 1360613943,
        "upvote_ratio": ""
    },
    {
        "title": "How can I critique Bloom?",
        "author": "DiracBlue",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/18akg7/how_can_i_critique_bloom/",
        "text": "In my literature class (Theory class on Authorship and Writing) we were tasked with writing a summary and critique of a critical argument. I was assigned an excerpt from Harold Bloom's \"The Anxiety of Influence\", and the only part we read in class was the introduction, \"A Meditation upon Priority, and a Synopsis\". I am completely unsure of how I am supposed to critique something by Harold Bloom who actually knows what he's talking about. Aside from understanding the surface levels of what Bloom was talking about, I don't think I know enough about literature (anything?) to actually critique this piece. I started researching and trying to read essays about this book/excerpt, but all the essays I read are about the entire book and therefore explore concepts that I technically cannot use in the essay I need to write for class. Any tips on tackling a critique? And Bloom? \n\n\nThanks!   ",
        "created_utc": 1360560563,
        "upvote_ratio": ""
    },
    {
        "title": "Advice in relation to Psychology in Naturalist Theatre",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1870ux/advice_in_relation_to_psychology_in_naturalist/",
        "text": "Hi r/AskLiteraryStudies, \n\nCan you offer any relevant papers regarding the salience of psychology in naturalist/realist drama? I am currently writing an undergraduate essay on Ibsen's A Doll's House and Pinero's The Second Mrs Tanqueray (how the emphasis on psychology exposes the workings of gender, sexuality, and the family). \n\nAny help would be greatly appreciated. ",
        "created_utc": 1360424310,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of a dictionary (online or otherwise) that shows etymologically similar words?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/186zcm/does_anyone_know_of_a_dictionary_online_or/",
        "text": "",
        "created_utc": 1360422325,
        "upvote_ratio": ""
    },
    {
        "title": "Is this the right subreddit to be asking for specific themed poems?",
        "author": "jackdona",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/183xck/is_this_the_right_subreddit_to_be_asking_for/",
        "text": "If it is, then would anybody know of a powerful poem that explores the ideas of power and authority? I've searched around to the best of my ability using the internet and have had pretty much no luck. Thanks in advance if you can help me. \nP.S. If I'm posting in the wrong subreddit then just tell me where I should be posting this. Thanks! \n\nEdit: Thankyou so much to everyone for your tremendous help ",
        "created_utc": 1360292745,
        "upvote_ratio": ""
    },
    {
        "title": "Kafka, Beckett and Spirituality question - pinning down definitions.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1830vc/kafka_beckett_and_spirituality_question_pinning/",
        "text": "I'm doing a paper exploring 'modern spirituality through Beckett and Kafka.' Mainly highlighting the silence and repetition of Endgame and Metamorphosis to underline this point. The hardest thing has been pinning down an idea of modern spirituality, because I'm wary to stay away from 'christianity' or 'judaism' even though I know both works have these influences. \n\nThe more I look into it, the more it appears to be a question of the modern 'human condition' or perhaps the modern human 'centre.' \n\n(My point of comparison is whilst the silence and repetition in endgame is obvious (included in the dialogue) it's a little more oblique in metamorphosis (gregor's silent submission to his parents, inability to articulate as an insect, his 3 repeated attempts at entering the room, repeated attempts to normalise the situation)\n\nMy point is that these plays highlight the inevitable decay, and winding down of someone hungry for spiritual reassurance and nourishment.\n\nA definition of 'spirituality' seems difficult.",
        "created_utc": 1360267664,
        "upvote_ratio": ""
    },
    {
        "title": "Late Antiquity/Middle Ages/Medieval/Renaissance/Early-Modern?? Halp!! ",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17yypf/late_antiquitymiddle/",
        "text": "As an English major who has just started grad school, I've been thinking about what area I want to specialize in. I'm not quite sure how to distinguish the terms in the title. These don't all belong to the same group, but I am really into stuff like: Consolation of Philosophy, Canterbury Tales, Troilus and Criseyde, Gawain and the Green Knight, The Death of King Arthur, Paradise Lost... I really like Dante, Chaucer, Milton, and Arthurian texts in general. Would anyone be able to help me understand where to draw the line among these periods, and  determine which of these terms would best describe my area of interest? Thanks so much for your time and help!   ",
        "created_utc": 1360114255,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Comparative Analyses",
        "author": "emperorlarsob",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17xtgp/literary_comparative_analyses/",
        "text": "So, I'm approaching the end of my undergraduate career, and I'm going to be working on my \"senior thesis\" paper this spring and summer, hopefully to have something together to send off as my writing sample to grad programs and hopefully present at undergrad research conferences and maybe become published.\n\nI have just nailed down my tentative topic and my questions at this point are numerous, but I'll limit my questions to a few things at this point:\n\n* I've never written a comparative analysis before. Are there any authoritative/useful texts that give good guidelines/starting points for this type of composition.\n* I want to make sure I have a good basis for my comparison. Is this something I will have to justify in this paper?\n* Can anyone point out some good comparative papers? Maybe some standards in the field?\n\nIn case you're interested, I'm looking at comparing the metaphors and other linguistic devices which inform the construction of identity in *The Brief Wonderous Life of Oscar Wao* and *The Ghost Writer* and subsequent novels in the Zuckerman series by Philip Roth.\n\nHowever, this thread is mainly a query regarding composition, structure, and the nature of literary comparisons. I'm just looking for suggestions about where to start because, while I'm glad I finally nailed down something to write about, a whole new universe of questions has opened up. Guidance in this endeavor would be appreciated. Please let me know if you need any more clarity to my inquiries in order to help me out. Thanks, guys!",
        "created_utc": 1360082261,
        "upvote_ratio": ""
    },
    {
        "title": "I'm after the source of a quote from James Joyce...",
        "author": "8sleef",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17q4xh/im_after_the_source_of_a_quote_from_james_joyce/",
        "text": "Hi guys,\n\nI'm currently researching James Joyce out of interest. I was listening to Terence McKenna's \"Surfing Finnegans Wake\" series on YouTube (which I would recommend up to about Part 7/13, where he begins to digress), and he related the following anecdote:\n\n&gt;“Joyce, once in a famous interview, said that if the whole universe were to be destroyed, and only ‘Finnegans Wake’ survive, that the goal had been that then the entire universe could be reconstructed out of this.”\n\nCan anybody help me find this \"famous\" interview? My googling skills are not good enough. I'm interested in hearing it straight from the horse's mouth - if in fact the anecdote is true.\n\nThanks.\n\n(PS: If you search for the above quote from TM then you will find a tumblr post where you can listen to the excerpt.)",
        "created_utc": 1359762912,
        "upvote_ratio": ""
    },
    {
        "title": "Works on 18th Century Sexuality/Eroticism",
        "author": "deconnexion",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17lktg/works_on_18th_century_sexualityeroticism/",
        "text": "Hello fellow Literati,\n\nI have a quick question regarding reference works for a current project. I am examining how eroticism/sexuality informs the novel Tom Jones. The character Blifil it is hinted has an auto erotic fixation and Thwacker certainly has a sadomasochistic bent. Can any of my fellow subreddit members point me toward works that would help me to examine the 18th century view on these topics and others?",
        "created_utc": 1359594766,
        "upvote_ratio": ""
    },
    {
        "title": "Just a Question About Writing Literary Criticism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17lkc8/just_a_question_about_writing_literary_criticism/",
        "text": "Does it ever get any easier? I'm currently reworking a paper I wrote last semester, and what seemed at the time a lucid argument, now feels terrible, clunky, forced, and just straight up wrong. I somehow got an A on this paper, and with this essay and another, my professor feels I have a chance of being published in a professional journal. However, when I read this essay I feel that things as simple as sentence structure are horribly convoluted (admittedly it is complex stuff) - simply put, if I read this paper in a journal, I'd dismiss it on those grounds alone. I spent a lot of time on this paper and its very frustrating to return to it with such a negative perception.\n\nDo these kinks straighten themselves out with experience and effort (which I am most certainly expending a lot of at this point)? I love literature as well as literary theory. In fact, I love and understand the latter maybe even a bit more than the former, but transferring my understanding of something (which feels very clear in my mind) to the page feels unnecessarily difficult. I'm now a senior in my undergrad and would rank maybe a total of five pages I've written thus far as solid. Is this a common experience? Am I tackling projects which are beyond my skill level? I read as much literature (American modernism is my fave) and theory as I have time to, I don't procrastinate or try to do things at the last moment, I rewrite and I research. Thanks for your input.",
        "created_utc": 1359594409,
        "upvote_ratio": ""
    },
    {
        "title": "What's your opinion on the idea of 'the death of the novel'?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17kbtz/whats_your_opinion_on_the_idea_of_the_death_of/",
        "text": "For example: Do you think the novel is in a state of decline? If so, what evidence do you think there is for this? On the other hand, if you think it's not, can you imagine such a thing ever happening? This question is for research purposes. Any opinions gratefully received. ",
        "created_utc": 1359559852,
        "upvote_ratio": ""
    },
    {
        "title": "Canterbury Tales Narrative Inconsistency Help!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17ha67/canterbury_tales_narrative_inconsistency_help/",
        "text": "Why are the logical, tonal, and or thematic inconsistencies of the narrative significant? \n\nThis is for my essay and i'm not very good at writing essays so can you guys please help\nI've tried googling this, but have only found examples and no explanation as to why they are significant",
        "created_utc": 1359435933,
        "upvote_ratio": ""
    },
    {
        "title": "(Lorrie Moore?) short story about an old college friend? Read it once and can't find it.",
        "author": "foreverfallingoff",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17gq0s/lorrie_moore_short_story_about_an_old_college/",
        "text": "I read this short piece once. I think it was Lorrie Moore but can't be entirely sure because it was a few years ago. I think it was written in the present tense.\n\nIt was written in a really nostalgic way about a guy the writer knew a long time ago. It's very short, I believe. Maybe not even a story. I read it online somewhere so I think it's out there somewhere.\n\nI know this is really vague but I remember loving it and wondered if anyone here could help me out. Thanks!",
        "created_utc": 1359420327,
        "upvote_ratio": ""
    },
    {
        "title": "Transmission - Shakespeare and Sappho",
        "author": "DiracBlue",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17gnnh/transmission_shakespeare_and_sappho/",
        "text": "In my literature class, we're talking about Sappho and Shakespeare and the effect transmission has on their works. I don't fully understand what 'transmission' is. If anyone could help me understand, or point me in the right direction I would be very grateful. I know it encompasses materials used and things like that, but the articles we read were focusing on the idea that Shakespeare might have been writing about/to a man, or the idea that 'Shakespeare' was really a collection of writers and their names were omitted/lost. How does this fall under transmission? And what does that mean, why does that matter?\nAs I mentioned, we were also looking at Sappho. The main cause of strife/point of discussion for Sappho was not the fact that all of her poems are fragments and on bits of broken pots, but that she was a)the first lyrical poet, b)the first woman poet and c) that the reader might be inclined to put both themselves and the author in the role of that \"I\". How does this fall under transmission? What am I missing?\nThanks!",
        "created_utc": 1359418528,
        "upvote_ratio": ""
    },
    {
        "title": "Social Realism in Literature",
        "author": "digitalslut",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17fxzd/social_realism_in_literature/",
        "text": "I'm looking for any articles that address social realism in literature, specifically in Anzia Yezierska's novel, \"Bread Givers.\"  Any information about social realism or the novel would be greatly appreciated.  ",
        "created_utc": 1359399099,
        "upvote_ratio": ""
    },
    {
        "title": "\"Narratology and intertextuality in the Legend of Zelda: Ocarina of time\" - possible master thesis?",
        "author": "_sia_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17ffko/narratology_and_intertextuality_in_the_legend_of/",
        "text": "Hi, good people of askliterary studies!\n\nI am currently getting my master's in comparative literature, and going on the second semester of a two-year degree. \n\nIn a few weeks' time, my class and I will start presenting rough drafts of project descriptions on our theses. Up to this point I have been at a total loss about choosing a subject - the above idea popped up in my head at random, mere minutes ago. Anyone have any thoughts or opinions they think I might benefit from hearing **before** diving head first into working on a project description? I know it's quite unorthodox, but I am basically pumped - just as much about the subject, as actually having an idea, I suspect. Which is why I'd love some opinions on this.\n\n**Bonus question:** What did you do your theses on? How was the experience for you, and would you have chosen differently today? \n\n^edit: ^formatting",
        "created_utc": 1359381981,
        "upvote_ratio": ""
    },
    {
        "title": "What are examples of cacophonous words?",
        "author": "Dilly_bar",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17dfvz/what_are_examples_of_cacophonous_words/",
        "text": "A while ago when my class- a high school class designed to supplement for a college-freshman course- was learning about diction we never went over what this meant but I thought it was interesting. Looking online, people only gave me examples like \"crackle,\" but not much more.\n\nReally I want to know a few more cacophonous words and which texts contain a  significant amount of cacophonous diction",
        "created_utc": 1359304258,
        "upvote_ratio": ""
    },
    {
        "title": "I remember an isolated island retaining a Shakespearean accent in a documentary I watched but now cannot find it for the life of me.  Help?",
        "author": "squigglesthepig",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/17cccn/i_remember_an_isolated_island_retaining_a/",
        "text": "",
        "created_utc": 1359246020,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know (or have a link) to the original text/form for Sonnet 35 from Astrophil and Stella by Sir Philip Sidney?",
        "author": "moarbodies",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/170z33/does_anyone_know_or_have_a_link_to_the_original/",
        "text": "I am working on an analysis for a class.  Looking at the indentations is a crucial part of this assignment. However, I have found three or four different versions online.  Many thanks",
        "created_utc": 1358818551,
        "upvote_ratio": ""
    },
    {
        "title": "Two New Subs",
        "author": "Rizzpooch",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16yb4s/two_new_subs/",
        "text": "Hey AskLitStu, \n\nI just wanted to invite all the practicing, aspiring, or even just curious Marlovians and Early Modernists among us to join two new subs:\n\n[/r/Marlowe](/r/Marlowe) \n\nand\n\n[/r/EarlyModernLiterature](/r/EarlyModernLiterature)\n\nHopefully these can become thriving and worthwhile communities, but that's going to take good contributions by smart people like you. Hope to see you all there!\n\n-Rizzpooch\n",
        "created_utc": 1358721609,
        "upvote_ratio": ""
    },
    {
        "title": "Help identify the Rhetorical Device. Is this aphorism an analogy, a metaphor, just an aphorism, something else entirely?",
        "author": "penguinturtlellama",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16x0or/help_identify_the_rhetorical_device_is_this/",
        "text": "Browsing /r/AdviceAnimals, I noticed a vulgar aphorism in the comments thread (re-quoted in the comments of *this* post for your convenience) which other commentors had identified as an analogy, but one in particular claiming it was a metaphor. The URL to the thread: http://www.reddit.com/r/AdviceAnimals/comments/16wleq/i_guess_bad_deeds_outweigh_good_deeds_in_our/c804fj4?context=3\n\nCan someone please identify what it is? I have tried looking up examples much like the original comment to figure out what device it is an example of, but I couldn't find anything. Perhaps I'm going about this the wrong way. Any insight is appreciated.",
        "created_utc": 1358660221,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a work on Literary Theory and Narrative Technique. ",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16ueji/looking_for_a_work_on_literary_theory_and/",
        "text": "Hi Folks, \n\nI was hoping you could point me in the direction of a particular text.\n\nI am an undergraduate student and would like to pick up an academic work that briefly covers and defines different types of literary theory. Furthermore, the ideal text would also examine the varying examples of narrative technique. \n\nAny help would be greatly appreciated. I figured you guys were the best to come to for something like this. \n\nThanks in advance. ",
        "created_utc": 1358549332,
        "upvote_ratio": ""
    },
    {
        "title": "Explicating a Poem - How do I find \"meaning\"?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16ubn4/explicating_a_poem_how_do_i_find_meaning/",
        "text": "For my English final, I must explicate a poem in two hours.\n\nThe problem that I have been having, when I'm practicing on random poems however, is that I have an extremely hard time developing the central focus of my explication.\nMy teacher essentially wants the paper to deal with the poem by finding the theme or meaning of the poem, and then connecting it to a single, overarching, and unifying element and discuss how that element is enhanced by other literary techniques and nuances and how the unifying technique enhances the reader's understanding of the theme.\n\nThe big problem for me, however, is that I simply can't seem to figure out what the \"meaning\" of poems are, its message. I look at some poems, and it takes me just such a long time to really figure any sort of message out, and it takes me even longer to find some sort of a central element to the whole poem that ties the thing together.\n\nHow do you guys go about identifying any sort of meaning in a poem quickly?",
        "created_utc": 1358546976,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for books on learning to write poetry, mostly with strict accent and syllable count, but am also interested in other types too.",
        "author": "ringsnmodules",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16ti68/im_looking_for_books_on_learning_to_write_poetry/",
        "text": "I just bought Poetic Meter and Poetic Form by Paul Fussell. He said that the book wasn't for someone trying to learn to write poetry, but for readers. That sounds like a great start, but I'm trying to get better at writing poetry. I was wondering if anyone knew a good book to help poets in writing.",
        "created_utc": 1358522438,
        "upvote_ratio": ""
    },
    {
        "title": "How do you define \"canon?\"",
        "author": "sarcasm24",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16klkh/how_do_you_define_canon/",
        "text": "Obviously, everyone has different opinions on which works are and which works are not canon, but that's all they are: opinions. While some opinions are more common than others, I don't think it's possible to definitively say, \"These are the canon works in [language],\" with any scientific certainty.\n\nHaving said that, I am interested to hear what you all think are good criteria for deciding whether a given work should be considered canon. For example, I think most would agree that Hamlet belongs in any list of canon works; what I want to know is, according to you, why?",
        "created_utc": 1358196661,
        "upvote_ratio": ""
    },
    {
        "title": "Immigrant / Assimilation Fiction",
        "author": "silly_walks_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16g514/immigrant_assimilation_fiction/",
        "text": "Anyone have a good critical sources on immigrant / assimilation fiction? Particularly for late-19th / early 20th century America? \n\nMy subject group is Northern European, so sources the deal exclusively with Latino / Asian groups won't be helpful unless they have a strong theoretical framework that can apply more broadly.\n\nNote: I have been looking on my own, but this is outside my area and I'm looking for the best possible sources. \n\nedit: please note that I'm only looking for **critical** sources.",
        "created_utc": 1358017367,
        "upvote_ratio": ""
    },
    {
        "title": "Hey there fellow ink and cellulose bugs! A question has been populating my mind and maybe I'm not alone: Have we become a \"read once and discard\" literary world? In other words, do you think today's popular books are lacking in the re-readability of the classics of days long gone?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16dy52/hey_there_fellow_ink_and_cellulose_bugs_a/",
        "text": "",
        "created_utc": 1357923934,
        "upvote_ratio": ""
    },
    {
        "title": "Keats - The Eve of St. Agnes (x-post from r/Verse)",
        "author": "Metapsychosis",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16bidr/keats_the_eve_of_st_agnes_xpost_from_rverse/",
        "text": "So, I have just read this, and although I am not a huge fan of the Romantic period, I must say I quite liked this poem. Keats obviously did a fine job on the imagery, especially when he describes a figure, carefully adding words that tingle with one's sense. Moreover, the poem definitely carries something deeper despite our sense feasting on the density of stimuli in each line, I am curious whether anyone else grasped this underlaying message and would be kind enough to share it?\n\nhttp://www.poetryfoundation.org/poem/173735\n",
        "created_utc": 1357834759,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Modernist discourses on Truth and Power",
        "author": "thebigcheese121",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/16atwj/looking_for_modernist_discourses_on_truth_and/",
        "text": "Hello bibliophiles! I'm doing some research on modernism and am looking for articles addressing nature of truth and power written by modernists. Thus far, I've only read \"Character in Fiction\" by Virginia Woolf and T.S.Eliot's \"Tradition and the Individual Talent\". Both have helped me understand the nature of Modernism, but I am yet to grasp their views on Truth and Power.\n\nAdditionally, if anybody can provide me with some articles written by Ezra Pound where he gives his \"make it new\" spiel, or even articles written by other people on Pound and his views. This would be much appreciated.\n\nFinally, if this community has links to other articles that deal with Modernism in any manner. Please provide it. This can only help.\nThank you.",
        "created_utc": 1357798045,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with satire writing on hardcore drug use and corruption on individuals",
        "author": "ldavis09",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/169npi/need_help_with_satire_writing_on_hardcore_drug/",
        "text": "Need advise/ideas or suggestions on how to write this satire. Any help would be appreciated.\nI have a nebulous dissembler but need help with litotes, hyperbole, paronomasias and exigencies :)",
        "created_utc": 1357763032,
        "upvote_ratio": ""
    },
    {
        "title": "Ideas on a Satire on internet censorship",
        "author": "Mytholl",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1678rk/ideas_on_a_satire_on_internet_censorship/",
        "text": "Today in English we were assigned to write a Satire on internet censorship. Could anybody give me any brainstorming ideas. I seriously have no clue what to write. Thanks -Mytholl\n\nEDIT: also need.\n\na. Nebulous Dissembler\n\nb. Litotes\n\nc. hyperbole\n\nd. Paronomasia\n\ne. Irony\n\nF. Exigencies \n",
        "created_utc": 1357675315,
        "upvote_ratio": ""
    },
    {
        "title": "Help with PhD proposal writing [Woolf, Irigaray, and Angela Carter]",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1640fe/help_with_phd_proposal_writing_woolf_irigaray_and/",
        "text": "Here is a link to the google doc. Any help with clarity, structure, or depth would be greatly appreciated. Modernism is not exactly my area of expertise, so any direction as to how to best address this subject would be fantastic, too. Thank you r/askliterarystudies!\n\nEDIT: I've removed the link as I've substantially edited the piece since posting it, and I am no longer soliciting opinions. Thanks for all your help.",
        "created_utc": 1357546792,
        "upvote_ratio": ""
    },
    {
        "title": "How do you keep up with contemporary poetry?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/160sg8/how_do_you_keep_up_with_contemporary_poetry/",
        "text": "In college I took a class on 21st century poetry. It was a great class and we read a wide variety of authors, but my knowledge of contemporary poetry is now limited to just the people we read in that class. I want to keep up with poetry and expand my horizons, I just don't know where to start. I could go out and buy more books by the authors I read in that class, but frankly once you've read one Kenneth Goldsmith book you don't want to read another.\n\nSo please tell me what magazines/blogs you read, which authors I should be reading, or anything else that will lead me into the world of contemporary poetry!",
        "created_utc": 1357416519,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis of Tim O'Brien's The Things They Carried and the water buffalo scene (original post on /r/literature)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15ux0i/analysis_of_tim_obriens_the_things_they_carried/",
        "text": "For an essay I'm writing on the value of art to reconstruct lost observations of nature, I'm using a specific scene in Tim O'Brien's *The Things They Carried* in which a baby water buffalo is graphically killed by a soldier. Does anyone have good suggestions for literary analysis of this particular scene? Are any available?\n\nThanks for any help.",
        "created_utc": 1357174560,
        "upvote_ratio": ""
    },
    {
        "title": "Literature That Changes Behavior - melodramas in which characters gradually evolve into role models for various social goals",
        "author": "postgygaxian",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15syyq/literature_that_changes_behavior_melodramas_in/",
        "text": "Previously I had explored the question of whether literature that depicts violence might glamorize violence.\n\nhttp://www.reddit.com/r/AskLiteraryStudies/comments/15a3bh/how_often_does_fiction_glamorize_violence_even/\n\nThere's an even better example of literature as a kind of advertising or propaganda that measurably changes behavior: contraceptive-promotion melodramas.\n\nhttp://www.peakprosperity.com/podcast/80326/bill-ryerson\n\n&gt;you brought up Population Media Center. One of the things that we do – and that is the primary thing we do – is to use a strategy of communications that has turned out, from everything we have been able to measure, to be the **most cost-effective strategy for changing behavior** with regard to family size and contraceptive use on a per-behavior change basis of any strategy we have found on the planet. And this is the use of long-running serialized dramas, melodramas like soap operas, in which characters gradually evolve from the middle of the road in that society into positive role models for daughter education, delaying marriage and childbearing until adulthood, spacing of children, limiting of family size, and various other health and social goals of each country. And we have now done such programs in forty-five countries. And I can give you a couple of statistics.\n\n&gt;For example, in northern Nigeria, a program we ran from 2007 to 2009 was listened to by 70% of the population at least weekly. It was a twice a week program. It was clearly a smash hit. And **it was a smash hit because it was highly suspenseful and highly entertaining. But it had a storyline dealing with a couple deciding to use family planning**, which is almost taboo in northern Nigeria because less than 10% of the people in that region use any modern method of contraception. We had eleven clinics have healthcare workers ask clients what had motivated them to come in for family planning, and 67% percent of them named the program as the motivation.\n\n\nWhat interests me is that pop entertainment, such as melodramas, promotes fictional role models  that measurably influence behavior.  This goes beyond guerrilla culture-jamming; this goes beyond product-placement advertising in fiction;  this goes beyond state-sponsored political propaganda.\n\nI don't know whether to call it \"[applied memetic engineering](http://old.disinfo.com/archive/pages/dossier/id133/pg1/)\" or \"thought contagion,\" or \"cultural engineering,\" but this kind of propaganda seems to be worthy of specialized study. ",
        "created_utc": 1357096129,
        "upvote_ratio": ""
    },
    {
        "title": "Help finding a passage from Madame Bovary please!",
        "author": "ianmikyska",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15s845/help_finding_a_passage_from_madame_bovary_please/",
        "text": "Hi all, I am looking for the passage in Madame Bovary in which she is in her room, contemplating on whether or not to cheat on her husband. I'm pretty sure it's there but it's been a few years since I've read it and it was a library copy - has anyone read it recently and could you point me to the chapter?\n\nThanks a lot!",
        "created_utc": 1357070504,
        "upvote_ratio": ""
    },
    {
        "title": "How old is the \"Actors that don't know it's all real\" plot?",
        "author": "RatZFisterectomy",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15pg5h/how_old_is_the_actors_that_dont_know_its_all_real/",
        "text": "The plot of movies such as \"Three Amigos,\" \"A Bug's Life,\" \"Tropic Thunder,\" and \"Galaxy Quest.\" \n\nFor some reason I feel like it is older than these movies. Can anyone think of older stories that share it?",
        "created_utc": 1356926282,
        "upvote_ratio": ""
    },
    {
        "title": "Who is the most misunderstood author?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15mqls/who_is_the_most_misunderstood_author/",
        "text": "Felt inspired by the two AskReddit posts on incorrect history and science.",
        "created_utc": 1356803250,
        "upvote_ratio": ""
    },
    {
        "title": "Which of Samuel Beckett's work do you think offers the best chance to explore puns, rhymes, repetitions, as well as the sound and rhythms of language?",
        "author": "CUNTMUSKET_MCGEE",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15md7p/which_of_samuel_becketts_work_do_you_think_offers/",
        "text": "I am about to start some writing, and I just cannot choose from his rich canon. If possible, I'd like to get some nice contrasts between works too.\n\nSo far, I have considered writing about Happy Days (will definitely write about this, so many good puns), Molloy, and Company... so I was just hoping for a bit of perspective and ideas as to where there is a gold mine of stuff to examine.",
        "created_utc": 1356779183,
        "upvote_ratio": ""
    },
    {
        "title": "New to this sub- help with Hawthorne and social conformity?",
        "author": "grassnut",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15edww/new_to_this_sub_help_with_hawthorne_and_social/",
        "text": "I'm a high school Sophmore and I'm having trouble with my essay on the Scarlett Letter. I'm supposed to cite papers by literary critics about Hawthorne's approach toward conformity in The Scarlett Letter to support my thesis. Does anyone know where I might be able to find such a thing? Thanks. Hope this is the right subreddit.",
        "created_utc": 1356396844,
        "upvote_ratio": ""
    },
    {
        "title": "Was John Keats inspired by Shakespeare's A Midsummer Night's Dream when writing \"La Belle Dame Sans Merci?\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15cpe1/was_john_keats_inspired_by_shakespeares_a/",
        "text": "\"La Belle Dame\" has been one of my favourite poems for years. So when I finally read *A Midsummer Night's Dream*, I was couldn't help but wonder if Keats drew inspiration from the play. \n\nAccording to one of Keats biographer Andrew Motion, the poet was “[devoted] to Shakespeare” (169). Shortly before his death, during his final days in Rome, Keats even kept his seven-volume edition of Shakespeare's works by his bedside, “as if they were a charm” (564). So with that in mind, let's compare the two works:\n\n-In *Midsummer*, during the “play within a play\" scene, one of the actors, Francis Flute asks, “What is Thisby? A wandering knight?” (I.i.39). Compare this to Keats' own ill-fated hero, the knight-at-arms, “alone and palely loitering” (La Belle Dame Sans Merci ll.2). \n\t\n-In the next scene in Shakespeare's play (I.i), he introduces the fairies: King Oberon, Queen Titania, Puck, and others. Keats' “Belle Dame” is said to be  “a lady in the meads” (ll.13), and a”faery's child” (ll.14). Shakespeare's fairies inhabit a place not unlike the imaginative meadows of Keats' creation, namely the magical woods of Athens.\n\t\n-Also observe that Titania (Queen of the Fairies) “crowns [her loved boy] with flowers, and makes him all her joy” (II.i.27). Keats slightly inverts this image, as his knight-at-arms makes a “garland for her head” (ll. 17), as she gazes towards him “as she did love” (ll.19). \n\n-Moreover, the image of the faery child's “elfin grot” (ll. 29) is arguably comparable to Titania's “bank where the wild thyme grows” (II.i.249). It is here that Titania commands her train of fairies to “Sing me now asleep” (II.ii.7), much like Keats' knight-at-arms recounts that “she lulled me asleep (ll. 33). \n\t\n-In fact, sleep holds a powerfully dangerous effect in both the works of Shakespeare and Keats. Regarding the fate of the young lovers Hermia, Helena, Lysander, Demetrius, and even his own wife Titania, King Oberon states that: “When they next wake, all this derision/Shall seem a dream and fruitless vision” (III.ii.370-371). In comparison, the knight-at-arms is also enchanted by the dreams brought forth by the Belle Dame, crying “woe betide!” (ll. 34) in agony. As he “awoke on the cold hill's side” (ll. 44), much like Shakespeare's characters, the knight-at-arms is left confused and abandoned by the Belle Dame, left to “sojourn here” (ll. 45).\n\nI have yet to find any scholarly articles linking these two works together, so what do you guys/gals think?",
        "created_utc": 1356314477,
        "upvote_ratio": ""
    },
    {
        "title": "Hesse Documentary Translation",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15cavy/hesse_documentary_translation/",
        "text": "Looking for Herman Hesse fans, willing to help translate this documentary into English:\nhttp://www.youtube.com/watch?v=mD9UlT2hCpo\n\nAnyone willing to help or point in a direction of those who might?\n\nOP:http://www.reddit.com/r/literature/comments/15bdm9/any_hesse_fans_willing_to_help_translate_this/\n\n",
        "created_utc": 1356297762,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry to barge in on your community here, but I would like a poetry/literary publication recommendation for gifting purposes",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15c8wk/sorry_to_barge_in_on_your_community_here_but_i/",
        "text": "I originally posted this to /r/poetry but was downvoted so maybe this thread will be more appropriate here. Anyway, my sister really likes poetry/short stories/ creative writing.\n\nI would like to get her a subscription to a publication of some kind that has one or all of those things. Preferably one that does 6-12 issues a year.\n\nThanks very much",
        "created_utc": 1356295405,
        "upvote_ratio": ""
    },
    {
        "title": "Hello R-Literary students, I have a question in terms of understanding if there's a difference from literary criticisms and applied philosophy in literature...",
        "author": "Meedior",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15bbsj/hello_rliterary_students_i_have_a_question_in/",
        "text": "Okay this question originally spawns from [another thread](http://www.reddit.com/r/continentaltheory/comments/15arnd/hello_fellow_rcontinental_theorists_i_need_some/) where I was trying to ask is there a balance between applying philosophy into literary papers?  I figured I'd ask it here as well since some of you guys are also students of literature.\n\nThe reason I ask this is because I seem to have a struggle of understanding what I should look for when writing a literature or English paper. I have a stronger strength in writing philosophy papers and it seems that does not necessarily fly in English. \n\nHowever, is it possible to use philosophical interpretations or concepts as a form of literary criticism or am I just doing applied philosophy?\n\nTLDR; Can philosophical concepts or interpretations become used as or in literary criticisms or papers? In other words how can you become philosophical without deferring from a literary or English paper if possible?",
        "created_utc": 1356239620,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me find references on Rev. Billing from Steinbeck's East of Eden?",
        "author": "wallychamp",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15ao2a/can_anyone_help_me_find_references_on_rev_billing/",
        "text": "I'm a little under halfway through East of Eden and am confused by the reference in the following passage:\n\n    True enough, the Reverend Billing, when they caught up with him, turned out to be a thief, an adulterer, a libertine, and a zoophilist, but that didn't change the fact that he had communicated some good things to a great number of receptive people.\n\nIt seems like every other person referenced in the book is either a historical/mythological figure, a character, or the neighbor/relative of a character but Rev. Billings seems to be an island. Is he a reference that I would understand if I was reading the book in the 50s? It just seems strange to me that in such a methodical book there would be a reference to \"this guy, who I'm not mentioning elsewhere.\"\n",
        "created_utc": 1356211127,
        "upvote_ratio": ""
    },
    {
        "title": "Mrs. Dalloway and my difficulties with modernism.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15a76w/mrs_dalloway_and_my_difficulties_with_modernism/",
        "text": "I'm reading ahead for my Brit Lit class next semester, and one required novel is Mrs. Dalloway by Virginia Woolf. This is my first real experience reading a modernist work, and I'll be honest, I don't really like it. \n\nSo, what I'm asking is, what am I missing? I'd like to appreciate it, but the lack of chronological order and structure is throwing me for a loop. I'm aware of the basic tenets of modernism (anti-naturalistic, emphasizes decenteredness) but I'm not sure how to enjoy it. Any help on how to read and process a modernist novel?",
        "created_utc": 1356191841,
        "upvote_ratio": ""
    },
    {
        "title": "How often does fiction glamorize violence, even though the author claims to be arguing against violence?",
        "author": "postgygaxian",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/15a3bh/how_often_does_fiction_glamorize_violence_even/",
        "text": "I often argue that various pieces of fiction preach or propagandize for a specific theme.\nPeople often object to my arguments, because (they say) I can never be sure of what the author intended.\n\nSo, for example, I can claim that Robert Adams' explicitly violent *Horseclans* books tend to glamorize violence, and anyone who cares to disagree can claim that Adams despised unethical violence, and was giving detailed descriptions of violence to show the horrors of war.\n\nThe problem is compounded when the author might have multiple purposes.  Suppose, for example, I suspect that the Marquis de Sade is trying to propagandize for two causes at once.  The first cause is sexual license, and the second cause is sedition against the French government.  The Marquis might object that he is writing for entertainment purposes only, and that no sedition is implied, and no sedition can be inferred.\n\nI don't think the writer's conscious intentions really matter;  I think a theme can get into a work without the writer intending to put it there.  For example, writer A might claim to be a pacifist, and he might try to write a story about personal courage, and the resulting story might read like a recruitment advertisement for the British S.A.S.  Writer A might object that he had no tolerance for the British government's involvement in war, but his subconscious mind might be writing pro-war propaganda without any conscious cooperation.\n\nI wonder whether sufficiently violent images just end up burning out our capacity for outrage.  I recall that a photojournalist published a book of photos of grisly war atrocities, titled *War Against War*.  His reasoning was that once people saw how bad war is, they would refuse to support it. Did he succeed, or did he just end up fueling the public desire for sensationalism?  If we show people the grisly details of violence, how often does it just make people see violence as a legitimate form of entertainment?  ",
        "created_utc": 1356185256,
        "upvote_ratio": ""
    },
    {
        "title": "xpost from /r/lit: short stories, good long form essays about genocide?",
        "author": "RansomIblis",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/155129/xpost_from_rlit_short_stories_good_long_form/",
        "text": "[original post here](http://www.reddit.com/r/literature/comments/1547ya/short_stories_good_long_form_essays_involving/). Any help would be appreciated!",
        "created_utc": 1355963693,
        "upvote_ratio": ""
    },
    {
        "title": "Help! Looking for a poem I read around the year 2000 in a female literature class.",
        "author": "darin_gleada",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/153y4o/help_looking_for_a_poem_i_read_around_the_year/",
        "text": "The title was something like \"Shipwreck'd\" and was essential about love between a wife and her husband. The wife likens her love for her husband to binding herself to a sinking ship. \n\nI've contacted the professor I've had and searched through the texts I still have with no luck. I wanted to add this to my vows years ago but didn't know about reddit then. I'm hoping to make this a part of a Christmas gift for my wife and have witnessed the awesome things reddit can do. ",
        "created_utc": 1355927301,
        "upvote_ratio": ""
    },
    {
        "title": "AP Literature student in desperate need of help!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1535zs/ap_literature_student_in_desperate_need_of_help/",
        "text": "I'm having a hell of a time completing this project and I was wondering if anyone knew of poems that had the following: onomatopoeia, syntax, parallel structure, symbol, and extended metaphor. We have to give examples and they have to be specific ones from the text but I can't find any. So if you have good examples please assist I beg of you. Sorry if this is in the wrong spot and sorry for the formatting on my phone",
        "created_utc": 1355885810,
        "upvote_ratio": ""
    },
    {
        "title": "Thinking about setting up a website/blog that does a line by line paraphrasing of Paradise Lost.",
        "author": "randomcatsoccur",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/151hzx/thinking_about_setting_up_a_websiteblog_that_does/",
        "text": "Not sure if this was the right subreddit, but maybe some people can give me some insight.\n\nDuring my undergraduate, I had to do some research on Paradise Lost and I had to do a close reading of the text. I did some online research and was looking for a \"No-Fear Shakespeare\" kind of deal to help speed things up, but I found nothing. \n\nSo I was wondering that if I invested time into doing something like this, would it be something people would consider checking out? Not as the DEFINITE translation/paraphrasing of the text, but as something that a regular layman or a confused student can consult to help them read this difficult text. I've a BA in English (I'm bracing myself for the incoming comments about English majors!) and I've got a lot of time on my hands while I work, and I thought setting up a website like this would be a worthwhile project to work on. I'm pretty sure there are future students who would be assigned Paradise Lost and I'd like for them to really get an idea of what Milton was writing, rather than brushing it off and saying \"it's too difficult and complicated to read!\" \n\nWhat do you think?\n\n\n",
        "created_utc": 1355813815,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for great descriptions of landscapes",
        "author": "Freddie_Sutton",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14zgyl/im_looking_for_great_descriptions_of_landscapes/",
        "text": "Any type of literature or poetry that have powerful and moving descriptions of nature or landscapes. It can be anything: forests, rivers, creeks, skies, cities, outer space, railroads... You name it, but I'm looking for powerful narrative that puts you in whatever setting it may be. Thank you!!! ",
        "created_utc": 1355731084,
        "upvote_ratio": ""
    },
    {
        "title": "Help tracking down a text by Barthes...",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14yddj/help_tracking_down_a_text_by_barthes/",
        "text": "In her preface to ROLAND Barthes first book (1953), *Writing Degree Zero,* Susan Sontag states:\n\n&gt;Barthes' vision of what thinking really is-an insatiable project, endlessly producing and consuming \"systems,\" metaphor-haunted classifications of an ultimately opaque reality - receives only a very elementary exposure in Writing Degree Zero.\n\nWhat other texts is she insinuating here? She wrote the preface in '67 so she must be talking about a book he wrote before then...\n\nAny help appreciated.\n\nEDIT: Barthes' essay \"From Work to Text\" looks like the key, thanks /r/asklit!",
        "created_utc": 1355688774,
        "upvote_ratio": ""
    },
    {
        "title": "What is a good essay topic concerning English literature in the Renaissance period?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14wljh/what_is_a_good_essay_topic_concerning_english/",
        "text": "The task is not to take a whole piece and analyze it, just a certain stanza, or act, or even a single verse. It can be Shakespeare, but I'd rather cover someone else.  \nThank you.",
        "created_utc": 1355599065,
        "upvote_ratio": ""
    },
    {
        "title": "Theory on Digital Media?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14qmub/theory_on_digital_media/",
        "text": "I'm wondering if anyone knows any good articles on the effects of digital media on literature and the ways literature has adapted to the world of the internet and blogs. I'm really interested in any theory relating digital media and literature.  \n\nThis isn't for a thesis or anything like that. I just feel that as an academic in literary studies I should have some knowledge about digital media since it's causing a shift in the way many people read. Papers focusing on narratology and stylistics in digital media would be most interesting to me.",
        "created_utc": 1355339950,
        "upvote_ratio": ""
    },
    {
        "title": "What sort of application can be used to enact more robust forms of writing?",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14qgcs/what_sort_of_application_can_be_used_to_enact/",
        "text": "I'm thinking specifically of the sort found in Only Revolutions: A Novel by Mark Z. Danielewski \n\nBy application I mean a computer program and by robust I mean having a greater capacity to process words with typographical dexterity, greater than the abilities of traditional word processors like Word and Pages.\n\n[eg1](http://i.imgur.com/butoF.jpg), [eg2](http://farm1.static.flickr.com/152/342767265_950aa6eb18.jpg)",
        "created_utc": 1355334294,
        "upvote_ratio": ""
    },
    {
        "title": "Critical and Philosophical Literature (x-post r/criticaltheory)",
        "author": "Ironyz",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14o716/critical_and_philosophical_literature_xpost/",
        "text": "",
        "created_utc": 1355244872,
        "upvote_ratio": ""
    },
    {
        "title": "Having trouble finding criticism on a specific topic (bodily fluids in literature) - any advice?",
        "author": "lemonyellosun",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14o68b/having_trouble_finding_criticism_on_a_specific/",
        "text": "I'm writing a paper on the use of water as a motif in relation to female characters, specifically bodily fluids and related functions like menstruation, lactation, pregnancy, urination. As for examples from literature, there's an abundance; one of my main focuses is Beloved. However, I'm hitting a wall trying to find any criticism, analysis, or theory about this specific topic. I'm wondering if the good people of this subreddit have any advice or have come across this topic before.",
        "created_utc": 1355244086,
        "upvote_ratio": ""
    },
    {
        "title": "[VOCAB] Quick Question: Consonance v. Coherence",
        "author": "LanceThaler",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14mntw/vocab_quick_question_consonance_v_coherence/",
        "text": "I was reading a judge's opinion for a class and came upon this sentence:\n\"In consonance with the foregoing, Public Health Law...\"\n\nI subsequently looked up consonance to find this definition:\n\"noun: agreement or compatibility between opinions or actions, e.g.: consonance between conservation measures and existing agricultural practice.\"\n\nIt seems that \"coherence\" would be a good synonym for \"consonance\" (when arguments \"cohere\") but I'm always curious about the differences in connotation and nuance between synonyms.\n\nI wonder if any of you might be able to give your thoughts on how these two words differ, possibly etymologically or how they differ in meaning in different contexts.\n\nJust got curious.",
        "created_utc": 1355178735,
        "upvote_ratio": ""
    },
    {
        "title": "I need help fellow redditors and hope I can find it here. The question is rougly: How the WWI influenced Hemingway and how he sees it through his main characters in Farewel to Arms, In our Time and The Sun Also Rises? A backstory inside.",
        "author": "Othrondir",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14lu9t/i_need_help_fellow_redditors_and_hope_i_can_find/",
        "text": "Hello guys and gals. I SERIOUSLY APPOLOGIZE FOR A LONG TEXT but I want to be sure that you get me and my issue and will not think that I just want to plagiarize. I know that the topic might be a little confusing but I am going to explain why. In short, I am a bit stressed and do not know what exactly to do. That is why my question looks like that. Basically, this September 2012 I have started to study my postgraduate degree in American Studies. I have always been aimed/focused on political sciences and history and those were the fields of my studies in my bachelor degree before. I have been studying Internation Relations with History and American Studies. Everything just political and historical topics. However, when I started my postgraduate year, I was given couple of subjects/courses I could choose from. I have immediately chose American Foreign Policy, Vietnam War, national security and simply subjects like that. However, what I did not know is that the American Studies department does not \"own\" these subjects, they are just \"borrowing\" them from other departments such as the Politics and History department and allowing us as the students of American Studies to attend these lectures as well. However, someone screwed up and there was a direct clash in the timetable between two courses I chose, one being from the Politics and other from History department. This forced me to choose another subject which got cancelled later that week. Being mad I was I got an email basically telling me that in order to get credits I have to take a course from a school of English called American Modernism as there was not any other course I could take that year. \n\nAnd here we go. Basically I have NEVER been studying literature and things like this. I am getting incredibly BORED at those lectures and being an international student (not a native English speaker and a foreigner to the UK) who has to read a WHOLE classical book such as already mentioned Hemingway, Willa Cather, Faulkner, Joyce and so on, I was going crazy. You know how hard it was for me to basically get through more than 250 pages of complex literature written in English from 1920s in 5 - 7 days with other things and part-time job to do? God... Thing is that we got an assignment we have to submit in half of January 2013. It is an essay on 5000-6000 words and we could choose a topic. \n\nAs I have found Hemingway the closest to my heart at those lectures (often did not even finish other books we had to read cos I simply could not read them in English so fast) I have chosen this structure:\n\nHemingway and the WWI - how the Great War affected and influenced him and how he sees the society in his books and how we can see this in his books.\n\nNow these books are only these: The Sun Also Rises/ A Farewel to Arms / In Our Time.\n\nI was thinking of analysing how he sees the war through the characters in these books and how the war influenced these characters, how Hemingway himself was shaped by it, how he sees the human society during and after the Great War.\n\nGod I know this is confusing but this fully reflects how confused I am myself.\n\nNow could you help me with this somehow? Give me some input, ANYTHING USEFUL I could read to better understand this?\nI have some basic idea lingering my mind somewhere but cannot create a whole picture of it. I do not want you to write anything for me, NO PLAGIARIZM or anything like that, just to help me and give me some ideas, links, refer me to some helpful books, articles, your ideas how to look into Hemingway's books themselves in order to find things I am looking for. I have never analysed literature the way we are suppose to do that this term (actually never before too) and I am a virgin in this. I have no idea if I have noticed enough / right things in those books while reading them, and re-reading them is not an option now. I do not have enough time. Only roughly one month.\n\nI have read them all and made notes of things I consider useful but am still confused. As I told, I have never studied literature and do not consider myself a literature-kind of person.\n\nANY HELP IS WELCOMED AND APPRECIATED!!!\n\n**TL;DR: If you want to help me, please read all I wrote. As I have no idea how to shorten this to make it understandable. Thanks!** \n\nEDIT: some grammar and changes in the text",
        "created_utc": 1355152588,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Sidebar with FAQs?",
        "author": "silly_walks_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14jvdw/meta_sidebar_with_faqs/",
        "text": "I've floated the idea to the mod, but I think it would be a really good idea to post a few links to the sidebar that can answer some of the questions that reappear every few weeks:\n\n* I'm thinking about applying to graduate school. What should I put in my SoP? / How do I study for the GRE? / How should I ask for a letter of rec? etc\n* What are the best journals in the field of _____?\n* I'm having a hard time understanding theory. Where can I find some good introductions/summaries?\n\nIn addition, we could think about creating a poll of the \"top-5\" best books on any particular subject, i.e. cannon formation, genre, queer theory, etc. I think that would save people a lot of time, and give people a very broad sense of the major issues. \n\nJust curious to know if anyone else agrees.\n\nedit: make sure to upvote/comment/add suggestions. I haven't seen the mod around for a few days, but I hope he will take care of it.",
        "created_utc": 1355070786,
        "upvote_ratio": ""
    },
    {
        "title": "What does it mean to study literature? Questions from a recent graduate with a major in English. ",
        "author": "therau",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14itg1/what_does_it_mean_to_study_literature_questions/",
        "text": "Having recently graduated with a BA in English (hello, terrifying-world-of-unemployment), I find myself reflecting back across the duration of my studies and feeling, well, at a loss. It's not that I haven't learned anything--I'm confident that I've surveyed most of the major writers, movements, and theories--or that I've lost my passion for literature. The problem is that I can't seem to piece it all together--to quantify \"literary studies\" as a discipline and to relate, comprehensively, what we learn, why we learn it, and how it fits into a cohesive, structured whole. \n\nI suppose what I'm searching for is a programmatic answer to the question, \"What do/did you study as an English major?\" Obviously, I'm not looking for the particulars of anyone's specialty or the minutiae of individual units (e.g., Renaissance adaptations of Petrarch, Coleridgean spirituality, etc). I'm also not interested in spirited proclamations of \"art for arts sake!\" or sweeping attestations to literature's moralizing qualities. I'm asking about the nuts and bolts--the aims and outcomes of English/literary studies as a discipline at modern universities. \n\nSo, if you were tasked to define or describe the study of literature, how would you do it? \n\nMy current approach is to break literary studies down into three levels. At one level--the smallest scale, so to speak--we analyze *how meaning is created and received*: the characteristics and archetypes of genre and form, the technical elements of style and composition, etc. At a broader level, we consider *what that meaning is*: we interpret and evaluate texts, positioning them in relationship to other texts/canon. At the largest scale, we examine philosophies of literature: the ontology of literature/texts, and the myriad theoretical frameworks that aim to systematize the analysis of literature (New Criticism, Post-Structuralism, Post-Colonialism, Feminist Theory, etc etc). \n\nI suppose all I'm really doing is drawing a distinction between literary criticism and literary theory. I guess part of the difficulty in defining literary studies is its necessarily multidisciplinary nature--certainly, my own studies in English seemed to entail as much philosophy, history, politics, sociology, and theology as they did literature. \n\nAnyway, to reiterate my earlier question: What does the study of literature entail? How do you describe or define literary studies as a discipline?\n \n\n\n\n\n\n",
        "created_utc": 1355011873,
        "upvote_ratio": ""
    },
    {
        "title": "Potent literary studies journals",
        "author": "Fzpeter",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14ikzg/potent_literary_studies_journals/",
        "text": "Anyone can help me with a list about the english journals that focus in literary studies (more specific: contemporary literature) and deserve the regular attention?\nThanks for your help",
        "created_utc": 1355003367,
        "upvote_ratio": ""
    },
    {
        "title": "Epilogue to \"Day of the Locust\"?",
        "author": "BurningOfThrowaway",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14h7wx/epilogue_to_day_of_the_locust/",
        "text": "Hi all,\nI remember reading \"Day of the Locust\" and loving it back in high school. After we read the book, our teacher gave us all a photocopy of a last chapter or epilogue to the book that he said Nathaniel West had cut from the final draft. It was about a page long; I seem to remember that it involved Tod showing up at Claude's house and ranting about the coming revolution or something (but narrated in third person without dialogue) in a manner that repeated some salient phrases from earlier in the book. I always thought it was an interesting \"alternate ending\" to the book. Unfortunately, I've lost my copy of it.\n\nSo, does anyone know anything about what I've described? Is it authentic? (It seemed to have West's voice, but that's my uneducated opinion). Why did West choose to leave it out? And, most importantly, where can I get another copy?",
        "created_utc": 1354932561,
        "upvote_ratio": ""
    },
    {
        "title": "Composer here, I need amazing Impressionist (or like it) poems. French is fine, but english is best.  ",
        "author": "shostimcnasty",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14h4ce/composer_here_i_need_amazing_impressionist_or/",
        "text": "I'm looking to expand my knowledge of Impressionist poetry.  Most of my settings have been of Symbolists.  Any suggestions?  Thank you in advance",
        "created_utc": 1354928540,
        "upvote_ratio": ""
    }
]