[
    {
        "title": "The Effects of Society on Wordsworth",
        "author": "AlbieAndTripp",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14gr77/the_effects_of_society_on_wordsworth/",
        "text": "I posted this same topic in r/literature, but it was deleted - I think I'm being misunderstood. I'm going to make a better effort on clarifying what I'm exactly looking for.\n\nI'm writing a research paper on the influence that society had upon Wordsworth's poetry. In his *Preface to Lyrical Ballads*, he mentions how poetry is the \"spontaneous overflow of emotion\" and that poetry should be influenced by the individual and by nobody else. I disagree with this. I find it impossible that society does not have some influence on what is being written. I've already collected 20 books from my school's library so it looks like secondary sources are covered. What I am seeking help on is primary sources. \n\nObviously one my primary sources will be *Preface To Lyrical Ballads*, but I will also be using  Anne Louise Germaine de Stael's treatise *The Influence of Literature on Society*. Contrary to the title, it does show how a governing body/author needs to be aware of the audience in order to effectively do their job. \n\nMy question is, if anyone knows of any additional primary sources that may be helpful to me, I would greatly appreciate it. Of course, I will continue my search on my own, but I didn't think it could hurt to ask anyone else. \n\nI want to clarify that I'm not asking for answers, but rather where I may find them. I would much rather read the material and interpret for myself. \n\nTL;DR - If anyone knows any primary sources that suggest how Wordsworth's poetry (or writing poetry in general) was not entirely subjective and that society does have an effect on what he writes, that would be awesome. I have two sources already (*Preface to Lyrical Ballads* and *The Influence of Literature Upon Society*), but I just want to see if there's any good ones that I may have missed that you know of.",
        "created_utc": 1354915761,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know of any poems or short works that are responses to The Iliad?",
        "author": "sheepcheats",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14f4lt/do_you_know_of_any_poems_or_short_works_that_are/",
        "text": "I have read a few translations and am looking for what I said in the title. I know of Simone Weil’s “Poem of Force” and Keats' \"On First Looking in Chapman's Homer\" but am looking for anything else! Much thanks in advance.",
        "created_utc": 1354845935,
        "upvote_ratio": ""
    },
    {
        "title": "What makes a poem good or bad?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14ds4q/what_makes_a_poem_good_or_bad/",
        "text": "I know what makes prose good or bad, but in poetry it seems like a lot of the rules of writing go out the window. \n\nMaybe it changes depending on the form? Would a sonnet that doesn't follow the right meter, or a haiku with the wrong number of syllables, be a bad poem? Or maybe it's just dependent on whether or not the poem accomplishes the intended purpose of the poet, like causing you to feel a certain way or picture a certain image? \n\nIs there a checklist that makes a poem good or bad, or is poetry completely subjective? For example, you can call a novel bad if it's full of cliches and 2-dimensional characters (which is not to say that some people still won't enjoy it!). Can you do the same with poetry?",
        "created_utc": 1354801254,
        "upvote_ratio": ""
    },
    {
        "title": "Howard's End essay inquiry",
        "author": "AteTheTuna",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14ankd/howards_end_essay_inquiry/",
        "text": "Dear reddit i am in an epochal level of fuckedness. Could use some help in regards to a Howard's End paper i am writing for my class. My thesis is how the characterization of Leonard Bast shows Forster's view that social standing will ultimately bring individuals down rather than help. Any thoughts? at this point i am just looking for other things that can help this paper keep moving forward.  ",
        "created_utc": 1354670691,
        "upvote_ratio": ""
    },
    {
        "title": "What is the main difference between Bakhtin's novel theory and (structuralist) narratology?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/147c4t/what_is_the_main_difference_between_bakhtins/",
        "text": "What the title says^\n\nI have read both of the theories above, but I am still not sure what the main differences are; when is it most suitable to use one of the theories over the other?\n\n\n\n",
        "created_utc": 1354549025,
        "upvote_ratio": ""
    },
    {
        "title": "The Mermaid by A.J.M. Smith. Need help for freshman year English project",
        "author": "DEADxRAMONE",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/144n9m/the_mermaid_by_ajm_smith_need_help_for_freshman/",
        "text": "Hi r/AskLiteraryStudies\n\nI am in my first year of university and taking an English course. We have been assigned this poem and a number of questions on it. We have to scan it, determine its rhyme scheme and all the stuff that would be asked of structure as well as some analysis questions. This poem is written by a Canadian poet and is therefore no where online. I come here asking for clarification of what this poem is about. I know it is a blazon describing a mermaid mounted on the front of a ship but after that I really have no idea. If you guys could help me out that would be awesome. Poetry isn't my thing.\n\n**The Mermaid**\n\nDark green and seaweed-cold, the snake-bright hair\n \nStreams on the golden-sun-illumined wave\n \nThat sways as gently as two bells the grave\n\nSmall coral-tinted breasts to starboard there \n\nWhere salt translucency’s green branches bear 5\n\nThis sea-rose, a lost mermaid, whose cold cave,\n \nLeft lightless now, the lapping seatides lave\n\nAt base of Okeanos’ twisted stair.\n\n\nShe’s come where bubbles burst, crisp silver skims; \n\nWhere the tall sun stands naked; where he shines; 10\n\nWhere live men walk the shrouds with fork-like limbs.\n\n\nShe smiles: and the head of the shipmite swims;\n\nBut the bo’sun bawls for the grappling lines,\n\nAnd the Chaplain fumbles in his book of hymns.\n\n",
        "created_utc": 1354409930,
        "upvote_ratio": ""
    },
    {
        "title": "Application essay help. ",
        "author": "OverDressedPrep",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/141du2/application_essay_help/",
        "text": "So, I know this has nothing to do with literary studies, but I think you guys are pretty smart and I really value your opinion. I also figured your in college if you're studying literature. \n\nRight now I'm applying to schools and I'm really struggling with my essays. I've got a 500 word max and just can't compose anything good in such a small restriction. I've already written quite a few, and trashed them. Am I being to critical? \n\nI was just hoping to get some wisdom from people who have gone through this, and are literary experts. Thanks so much. ",
        "created_utc": 1354252153,
        "upvote_ratio": ""
    },
    {
        "title": "Need help: Anyone good, and I mean good, with The Odyssey, trying to find instance of a character, named MYLLUS",
        "author": "crazymixn",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/14186v/need_help_anyone_good_and_i_mean_good_with_the/",
        "text": "ok last subreddit that could help. much appreciated for any feedback. \n\nokay doing some work, and Eustathius in his commentary *On the Odyssey* p. 1885.21 says that Myllus was proper name of an old actor and used masks painted with milium. \n\nI'm working out of Loeb so I don't have access to Eustathius to see where in Odyssey he is referring to.\nCan anyone tell me if this character Myllus is in the Odyssey, or why would Eustathius would find it pertinent to mention in his commentary. \n\nMuch appreciated. Not exactly required but am stuck as to why it is in his commentary on the Odyssey when I can't find this character in the text or anything related to him. idk ugh NEED ANSWERS lol",
        "created_utc": 1354246294,
        "upvote_ratio": ""
    },
    {
        "title": "Is the stage direction of a play considered the voice of the author, or the voice of the play itself?",
        "author": "Kinch_",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/141598/is_the_stage_direction_of_a_play_considered_the/",
        "text": "In particular, I'm reading O'Neill's *Long's Day's Journey*, and it's kind of an anomaly in terms of how much stage direction there is. Some of it is impossible to recapture, though (i.e. characters share common facial structures), and it seems to go much further than just the author making suggestions to the actors.\n\nDoes it depend on the play? Or is it all plays? I would usually argue that it's the author's voice, but O'Neill is really throwing me off here. \n\n",
        "created_utc": 1354243589,
        "upvote_ratio": ""
    },
    {
        "title": "The Dark Tower Cycle by Stephen King...",
        "author": "Lauren0",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/140uab/the_dark_tower_cycle_by_stephen_king/",
        "text": "So I am thinking about writing my Master's thesis over the dark tower, and the repetitive nature of trauma, blah blah.... Before I posted over in /scholar though, I was wondering if any of you knew of any scholarly writing over the series. I've been going through the MLA bib, but I'm having a hard time finding anything. Help would be appreciated!  ",
        "created_utc": 1354233618,
        "upvote_ratio": ""
    },
    {
        "title": "The Harlem Renaissance?",
        "author": "Tetzel",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13zobp/the_harlem_renaissance/",
        "text": "Hi guys, I'm looking to write my Long Essay (mini dissertation) on the Harlem Renaissance from the 1920's to the 1930's and was wondering if you guys could give me help with any essential texts on the time period? \n\nMy basic line of thought right now (and it is oh so basic) is that the Harlem Renaissance is a 'truer' Renaissance than the Italian renaissance because it gave a sense of identity and a stable self to a disenfranchised group of people, and gave the concept of an identity to a group of people who were denied that when it was already an established idea for the rest of the population.\n\nIt's messy I know, but my thought is that because the Harlem Renaissance was a period of cross-disciplinary collaboration (writers and artists, actors and musicians, etc) it was a much truer Renaissance than the Italian Renaissance which mainly allowed for the development of an artists work in one discipline.\n\nFor my actual essay content I'd probably be looking at either 2 books or plays, or 4 short stories, and comparing the representation of the individual in them. For example, I might look at Doctor Faustus and how the representation of religion does/does not disrupt the possibility of a stable/unified self and world, and compare this with a similar Harlem Renaissance text. No idea what that text will be yet, but I'm working on it.\n\n\nWhen I say the 'Italian Renaissance' I do of course mean the Renaissance in general, and would be mentioning the works of Renaissance artists across Europe like Düre. Similarly, the Harlem Renaissance doesn't just equal New York, but also includes Paris, London, and the Caribbean. To think of the term Renaissance in the broadest sense it makes more sense when applied to the Harlem Renaissance, which was literally an international groundswell of black creativity, which wasn't restricted by class, and was the true birth of the black individual.\n\nI know it's all over the place but I'm basically looking for the most essential Harlem Renaissance texts which might pertain to what I'm talking about? There's a whole wealth of information and I don't really have any idea where to start. Any experts on the matter able to chip in?\n\nMy essay isn't in for like 6 months, so I have heaps of time to truly form my ideas, but I need to deliver an abstract eventually and I'd rather get ahead if I can.\n\nThanks.\n\n\n",
        "created_utc": 1354192972,
        "upvote_ratio": ""
    },
    {
        "title": "Long shot, but can someone help me find a poem?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13ywxl/long_shot_but_can_someone_help_me_find_a_poem/",
        "text": "I read this poem a while back and remember liking it, but I can't remember the specifics of it. All I remember was that the themes of the poem included multiple types of darkness, both literal and metaphorical. Each stanza was about a different type of darkness. I know there are a million poems like this though...\n \nI remember reading the poem then looking it up on Wikipedia so it can't be that obscure, but I don't know if my description is specific enough. Any help is appreciated, it's been bugging me for weeks. Thanks!",
        "created_utc": 1354154696,
        "upvote_ratio": ""
    },
    {
        "title": "Learning the meaning of a text makes it more beautiful to me. Does this happen to you? ",
        "author": "hurlingheadlong",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13x619/learning_the_meaning_of_a_text_makes_it_more/",
        "text": "In a lot of Literary Theory I have been reading, people seem to talk about the beautiful, beauty, and the experience of beauty as something separated and severed from a cerebral, maybe even content-based, analysis of the text. While I get that something that does not make any sense cerebral-ly can be found beautiful, I personally am highly concerned with finding the meaning/intention of the artwork/text/etc before I can really appreciate its beauty? Is this a critical (in the sense of critiques and being able to critique) weakness? Please discuss and critique! :)\n\nEdit:\nSo I have this notion of \"a beautiful idea\"--generally this means an idea I find clever, revolutionary, \"out of the box,\" and just brilliant. What does it mean when beauty is found in an idea rather than say the form of it? Is that even possible? ",
        "created_utc": 1354081915,
        "upvote_ratio": ""
    },
    {
        "title": "Help in metre, foot etc.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13tirk/help_in_metre_foot_etc/",
        "text": "Hello guys, currently struggling a bit with the structure of poetry, especially with metre.\n\nLike, when it's supposed to be a \"iambic tetrameter\" I'm completely lost, be it why its a tetrameter instead of another metrical form and wheter its iambic or not. \n\nThanks for the help &amp; Best regards",
        "created_utc": 1353949924,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions for additional reading to compliment a close reading of the beginning of 'A Doll's House.'",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13s4g3/suggestions_for_additional_reading_to_compliment/",
        "text": "Doing a close reading of the beginning of 'A Doll's House,' and would love any criticism or additional reading that applies to it or any of its themes (especially in relation to modernity)",
        "created_utc": 1353884615,
        "upvote_ratio": ""
    },
    {
        "title": "Barthes's S/Z, Applications, and Final Goal.",
        "author": "emperorlarsob",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13qoog/barthess_sz_applications_and_final_goal/",
        "text": "Warning: My thought process on this is very convoluted, but I need the help of some more experienced minds to help me sort through what feels like a mess. I need to bounce ideas to make sure they're coherent before I take them to class.\n\nSo, for my undergraduate literature theory class, our final project encompasses taking any work of art and applying and analyzing it using a theory we covered in Rivkin and Ryan's tome this year. Sounds simple enough, right? Just do some race theory stuff about some James Wright or genre theory about Vonnegut, right? Nope. I think I got myself into something from which I'm going to have to pry myself haughtily. The specificities of my methodological conundrum are as follows:\n\nThis is going to be broken up in to sections to help me more clearly articulate my dilemma(s). \n\n**S/Z**\n\nSo, I really like Junot Diaz's novel *The Brief Wondrous Life of Oscar Wao.* I decide I want some way to answer the questions that the novel seemingly leaves up in the air (What exactly is the Fuku? What about Oscar's identity makes him unable to survive the novel?). Concurrently, in light of the reading we've been doing in my theory class, I've been interested in the writings of Barthes, particularly after reading excerpts from *Mythologies.* (Particularly interesting is how Barthes represents this kind of bridge between Saussure's semiotics and the budding post-structuralism, if you see it that way.) Anyway, I read about his work *S/Z* and how it tore apart the \"codes\" in the text on a sentence-level analysis, allowing for multiple layers of meaning in one \"lexia.\" I figured this would be a good way to (to go in to some Barthesian parlance) find \"entrances\" into the text, a good way to map the paths of a text, to reassemble meaning through non-temporal, \"readerly\" process. Basically, it boils down to a methodical identification of signs and their possible \"connotative\" meanings, if you ask me.\n\nI'm about a third of the way through actually reading *S/Z* right now and some problems are beginning to occur. I'll keep it to ones pertaining directly to Barthes's book in this section:\n1. He talks about the necessity of finding signs to identify the plurality of the text, but also how that does not necessarily engender meaning; \"we shall propose the semantic substance...of several kinds of criticism...;it will then be up to each kind of criticism to come into play, to make its voice heard...\" (14-15). So, after a semantic analysis of the novel in this kind of \"lexical\" fashion based on Barthes's Five Codes, am I left with open meaning? I mean he does say somewhere in the beginning of the work that the goal is not to break down the text by codes and reconstruct a \"virtual object.\" In short, I guess I'm just confused about where I'm going to end up.\n\nEven in the sections by which he plods through *Sarrisinne,* the lexias and their explanations only offer revelations regarding how the code is imprinted into the prose, not the connection to the thematic importance(s) of the text at all. Take, for example the first lexia; all he does is state the dual meaning of the title and that it is coded for femininity and sets up an hermeneutic enigma (17). Not to be too blunt, but so what? \n\nI don't see it possible, using these five codes to establish any sort of critical statement about *Oscar Wao.*\n\n**Application**\n\nMy main question in application is, can I do this with a novel? Barthes goes through Sarrasine line by line. I obviously can't do that to a novel in a ten-page paper.\n\nIf I am going to pick and choose, how do I do so? Should I just pick a subject matter (identity, gender roles, etc.) and identify the passages (read, lexia) that I think inform the construction of these subject matter through the lens of the five codes? This moves me into the final section of my question:\n\n**Making a Critical Statement**\n\nWith *S/Z* I feel like I'm more doing the work of exposure; while the analysis within may help to clarify semantic, symbolic, temporal, enigmatic, and referential structures in the text, that comes to no fruition. Maybe I'm wrong. Where am I headed here, do you think that a Barthesian reading of the *Oscar Wao* will come to any great critical statement on its own? Or do you think I'd have to tie in a work like *Orientialism* to make a statement about the significance of the way the codes arrange the signs to form something like identity? \n\nINSTA-EDIT: Maybe Barthes does make actual critical statements about the art, but I don't see one beyond the fact that it isn't \"readerly.\" Its \"writerly\" because of the superfluous temporality. As you can see, in my quest for methodological clarity, I've stumbled farther into the swamp of confusion on a step-by-step level. (Funny, he uses that term in the book...)\n\nOne or two well thought out responses from some great minds would help me a lot in my endeavors here. In the meantime, I'll just keep reading.",
        "created_utc": 1353809325,
        "upvote_ratio": ""
    },
    {
        "title": "Articles on the instability of the self",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13p6yc/articles_on_the_instability_of_the_self/",
        "text": "I'm writing a paper on films where the protagonist goes undercover. I'm making the argument that one of the central conflicts in the movie is the protagonist dealing with the fact that the self is not stable. We like to think that there is some stable core self. \"I would never be a gangster, I respect the law!\" but these characters seem to be discovering that the self is a construction and is far more malleable than we like to believe.\n\nThis is a concept that I've had professors mention, and one that I (at least the current 'I') find compelling, but I'm not familiar with any theorists that write specifically on this concept. I guess Foucault writes about agency being a myth, but that doesn't seem like precisely the same thing.\n\nIf any of you can suggest any theorists/articles/books, I would be eternally grateful, until I'm a different person.",
        "created_utc": 1353729460,
        "upvote_ratio": ""
    },
    {
        "title": "Assemblage Theory and Literature",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13o1wk/assemblage_theory_and_literature/",
        "text": "I've become interested in assemblage theory, and I'm beginning to think how it might be applied to literature, but I'm still lost as to *how* it might actually be applied. So I'm looking for some examples to follow. Has anyone ever done this before? A quick comb through the MLA database didn't show anything especially promising.\n\nThat being said, I'm still relatively unacquainted with the theory. I've watched some lectures by Manuel DeLanda a few times, I've read some Hayles (who employs assemblage theory briefly when talking about digital texts), and I've just begun to read *Thousand Plateaus*, and that's all. But even with my limited understanding, it seems to be a very powerful theory with implications that would apply to literature, but I'm not exactly sure what those implications would actually tell me. \n\nSo if you know anyone who has talked about literature at length with assemblage theory, I would be very interested in knowing about them. If that doesn't exist, do you feel the theory is practically applicable to literature?\n\nThanks for your time.",
        "created_utc": 1353681293,
        "upvote_ratio": ""
    },
    {
        "title": "Question about graduate applications.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13h56c/question_about_graduate_applications/",
        "text": "I've spent the last couple months applying to gradschool, and now I have two of my three recommendations in at most of the schools. The trouble is the third professor. She's my senior thesis advisor, and has had me for four classes. She's very high ranking to the point where she's one of the main faculty members of the department, and at 75 doesn't do much except teach and sit on university committees/boards. Being active in the 'politics' of the school even beyond just the English department keeps her busy, but I'm having problems getting in contact with her. She has only written me back two out of eight times, but she still insists she really wants to write the letter for me. The problem is that the first application deadline is two weeks away and I still haven't heard from her, nor has she submitted the letter. I know she has a hard time getting papers and emails back to people so I'm beginning to really freak out. I gave her two months head start and still with two weeks away I have nothing. And with the holidays I fear that it won't get done... Should I go find her in person, or keep sending multiple emails? Do schools typically allow letters to come in after the deadline?",
        "created_utc": 1353366214,
        "upvote_ratio": ""
    },
    {
        "title": "I have and assignment in which I must select a text and apply some theories to it; I have a text and some ideas about its most striking elements, but I am not sure where to start. I would be so grateful for some assistance!",
        "author": "YoungRL",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13eufa/i_have_and_assignment_in_which_i_must_select_a/",
        "text": "(I can't believe I missed the typo in the title... my apologies!)\n\nI'm taking a Literary Theory course, and the big assignment is to select a text and apply some literary theories to it and see what shakes out.\n\nI have selected a text, but I am at a loss as to where to begin in terms of what theories may be good to apply to it.  Thus, I turn to this community for assistance.  I am deeply in need of help.\n\nThe text I have selected is a science fiction novel by John Ridley, *Those Who Walk in Darkness*; it was published in 2003.  A number of elements in the story jumped out at me as possible areas that I could examine.  Let me give you some ideas on what I'm talking about:\n\nThe novel takes place in the nearish future in the United States; humans with genetic mutations have emerged as superheroes and then in response to those heroes, villains.  At first things were all well and good, but then San Francisco was completely destroyed in a clash between one hero and villain, and the president issued an executive order that all metanormals needed to leave the country immediately or face the consequence of being hunted down and deported, or killed if they resisted.\n\nMetanormal Tactical Units (MTac Units) have been formed in major cities as police units that respond to the threat or appearance of metanormals.  The protagonist, Soledad O'Roark is an agent on one of those units.\n\nShe is driven by a deep hatred for metanormals--not because she was personally affected by their existence in any way, so far as I could tell from everything I read, but merely because on the destruction of San Francisco, which she had always wanted to visit, she saw them as a danger and a threat, and cannot abide by their existence.  If metanormals were viewed as a different race of humans, she would be, undeniably, deeply and incredibly racist.\n\nNot all metanormals are \"bad guys,\" though; many of them continue to live normal lives, keeping their abilities a secret so they won't be forced out of the country or killed.  They do not act as superheroes or villains, and can be seen as \"good guys\" because they don't use their powers to harm anyone and they wish merely for a quiet existence.\n\nMore on Soledad: she is actually fairly antagonistic towards others, as well as antisocial.  She is tough and independent and keeps everyone else, including her family, at a distance.  Her work as an MTac agent is an absolutely key element to who she is; it's her reason for being.  She's a 26-year old, highly intelligent black woman (she has created a specialized weapon for fighting metanormals: a gun with different types of bullets to counteract the powers of the different types of metanormals).\n\n(One of the \"incognito\" metanormals is encountered within the story; Soledad still regards him with deep mistrust and disgust.)\n\nOne of the storylines within the novel focuses on her romantic relationship with a man she meets during the story, Ian.  At first he doesn't know what her line of work is, but eventually she shares this with him.  They also eventually exchange \"I love yous.\"\n\nAt the very end of the story, after the resolution of the main conflict with the main metanormal antagonist, Soledad and Ian are in a car accident; the woman in the other vehicle, which has caught fire, is trapped, and Soledad cannot get into the car.  She screams at Ian to help her, and he regards her for a moment, before acting to save the woman.\n\nIn order to save the woman's life, he must reveal that he is a metanormal, of the \"intangible\" type.  He is able to become ethereal, and reach through the mangled car to grasp the woman inside, thereby making her intangible as well, and pull her through the car to safety.\n\nIan was one of those metanormals who was attempting to live a normal life, and even continued to see Soledad after he discovered her line of work and her deep hatred toward his \"race.\"  There is no doubt that he is a \"good guy,\" as he sacrifices his secret in order to save a life.\n\nDespite this, Soledad vows to him that she will develop a bullet for her weapon that will be able to destroy an intangible metanormal, and she will hunt him down and kill him.\n\nThe text has a strong stylistic flavor.  Short, choppy sentences, often incomplete.  Heavy use of slang and African American vernacular.  It easily comes across as a story being told to you by *someone*.\n\nThe author, John Ridley, is a black man who has experience with screenplays and graphic novels; some reviews of the book point out that it reads as a book intended to be made into a movie or as a graphic novel without the illustrations.  I think that's pretty apt, really.\n\nAdditional characters include at least two other strong women, one of whom is Asian.\n\nI think race--in terms of \"real-world\" race and the \"race\" within the story, of the metanormals--plays a significant role in the text, as does feminism, given that the protagonist is a strong female.  I have also entertained the notion that Victor Shklovsky's idea of defamiliarization plays a role here, in reimagining the idea of racism in a science-fiction environment, with metanormals being an \"Other\" (the idea of which I have read about briefly but have no solid ideas on in regards to what source might be best to use if I were to include the idea of the Other in my paper).\n\nI have a few databases at my disposal, and my textbook (the third edition of Richter's *The Critical Tradition*) seems to be a very good source to at least start with.\n\nI have had some difficulty with understanding structuralism and deconstruction (I am decidedly *not* a fan of Derrida, lol), and I have had trouble with reading and understanding Lacan.  I am intrigued by the ideas behind reader-response theory, and Barthes' *The Death of the Author*, but I am not sure there is really a way I could apply these areas of thought to the text I have selected.\n\nIf anyone has read all of this, let me thank you sincerely.  If anyone can assist me in any way--point me in any helpful direction(s), anything--I would be deeply grateful.",
        "created_utc": 1353270529,
        "upvote_ratio": ""
    },
    {
        "title": "Help with Euripides Medea",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/139ino/help_with_euripides_medea/",
        "text": "In my Greek literature class I was assigned a homework assignment in which I have to, in a way, create a modern adaptation of this play. I have some stuff that I feel is good, but I could use some help. Here are the guidelines. I suppose I'll just type them off of the assignment prompt. I know this isn't a homework help subreddit, but I couldn't think of a better place to ask this. Any help is very appreciated.\n\nTake the role of a producer of a contemporary performance of this play, and explain the play's overall meaning for the ancient audience and why you think this meaning could be relevant for today's audiences.\n\nSuggest a possible actor for one of the main characters. Justify your choice by analyzing the personality, motivations, and characterization of the role you wish him/her to play.\n\nDiscuss how you would bring out what you see as the mafor symbolism and themes of the play through staging, set, costuming and/or special effects. Include how you would integrate the role and meaning of the chorus.\n\nFor your closing statement, chose a line or very short passage from the play to serve as a marketing slogan, and explain why you chose this particular passage.",
        "created_utc": 1353018276,
        "upvote_ratio": ""
    },
    {
        "title": "Could someone help me find a poem?",
        "author": "ScalaNaturae",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13945g/could_someone_help_me_find_a_poem/",
        "text": "I have been searching for this poem for a year, although I read it back in high school. From what I remember, it has to do with death. It is probably from the point of view of the person who is dead and buried. I think they are thinking about their love in some way. A hill may or may not be involved. I remember something to do with a horse-drawn carriage passing overhead because this guy is buried, or maybe it's a girl. I think some of the verses repeat, almost in a song-like way.\n\nI know this is a really awful description but even narrowing it down will help me because I think I will recognize it right away.",
        "created_utc": 1353005797,
        "upvote_ratio": ""
    },
    {
        "title": "what's /r/asklit's favourite citation/pdf manager for big research projects? EndNote - Mendeley - Zotero",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1387mf/whats_rasklits_favourite_citationpdf_manager_for/",
        "text": "mac or pc?",
        "created_utc": 1352959795,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for Literary Criticism from the Perspective of Post-Humanism",
        "author": "shreekingeels",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/134it5/looking_for_literary_criticism_from_the/",
        "text": "Writing a paper on Wallace Stevens's poetry and post-humanist theory/philosophy. So far I've got a good mix of writing on Stevens and post-humanist theory. What I'm really lacking is a kind of middle ground; that is, literary theorists who have applied post-humanist thought to literature. So far I've got Bill Brown, including his book \"A Sense of Things\" and a good selection of other articles he's written. Is there anyone else like him out there that looks at the way \"things act\" in literature? Really any application of post-humanism to literature would be helpful, but of course if you know anyone who does this with Stevens, then that would be helpful x 100!\n\nThanks",
        "created_utc": 1352821450,
        "upvote_ratio": ""
    },
    {
        "title": "Suggested works on Venedikt Erofeev",
        "author": "classic_water",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/134862/suggested_works_on_venedikt_erofeev/",
        "text": "Could anyone suggest some essays or any kind of critical studies on Venedikt Erofeev? I'm particularly interested in his epic poem \"Moskva-Petushki\" (Moscow to the End of the Line).\n\nMany thanks in advance!",
        "created_utc": 1352804558,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone want to help me analyze a sonnet by Paul Muldoon? (x-post from /r/poetry)",
        "author": "TristanSolder",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1344cb/anyone_want_to_help_me_analyze_a_sonnet_by_paul/",
        "text": "from The Old Country  \n\n\nI  \n\n\nWhere every town was a tidy town  \nand every garden a hanging garden.  \nA half could be had for half a crown.  \nEvery major artery would harden  \nsince every meal was a square meal.  \nEvery clothesline showed a line of undies  \nyet no house was in dishabille.  \nEvery Sunday took a month of Sundays  \ntill everyone got it off by heart  \nevery start was a bad start  \nsince all conclusions were foregone.  \nEvery wood had its twist of woodbine.  \nEvery cliff its herd of fatalistic swine.  \nEvery runnel was a Rubicon.  \n\n\n-Paul Muldoon  \n\n\nTidy Town was a competition in Ireland for nicest or tidiest town. It started in '58 (after WWII, before the Troubles). Hanging garden of Babylon. Dishabille - partial undress. Woodbine might be a reference to the English made cigarette brand that was discontinued after a century in 1988. They were apparently popular with soldiers in WWI and II. The cliff of swine references the exorcism of Legion by Jesus. A runnel is the tiniest of rivers (even a drop running down the windshield). The Rubicon was crossed by Caesar, and is a metaphor for point of no return.\n\n\nI'm curious about this sonnet specifically, but will point out that it is the first in a run of 13 sonnets, each of which the last line is reused as the first line of the subsequent sonnet (implying a lost sonnet? Another thirteen? Casualties at Bloody Sunday, or Christ and the apostles...pretty certain it's not that last one!)\n\n\nIs this an Italian or English sonnet? Is it neither? Two quatrains and two tercets is the strambatto by Lentini (i.e. the original 14 line sonnet), but the rhyme scheme of the sestet seems to be Muldoon's own.\nWhat is the volta here? What does it divide? What does it all mean? I have some ideas, but this is getting long so if anyone would like to start a discussion, please do.\n\n\ntl;dr Treating /r/poetry like /r/askscience.",
        "created_utc": 1352795344,
        "upvote_ratio": ""
    },
    {
        "title": "Have any major theorists written about humor or comedy writing, especially the comic novel? Do any have strong opinions on the genre?",
        "author": "poseurpoetry",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/133vtq/have_any_major_theorists_written_about_humor_or/",
        "text": "",
        "created_utc": 1352782639,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on personal statement for grad school programs in literature?",
        "author": "mathematicalrock",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1336mt/advice_on_personal_statement_for_grad_school/",
        "text": "Currently drafting a personal statement. Besides my scholarly goals and research interests, what kind of information should I provide? What kind of tone should I strive for?",
        "created_utc": 1352760389,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions for sources about Margaret Cavendish's support for animal rights?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1336bb/suggestions_for_sources_about_margaret_cavendishs/",
        "text": "Writing a paper on one of the less explored aspects of her life. Anyone have an idea of some decent sources that might address her animal rights activism and how that was manifested in her work? Primarily looking at The Blazing World.",
        "created_utc": 1352760130,
        "upvote_ratio": ""
    },
    {
        "title": "Does the amphibrach exist?",
        "author": "ardisarbor",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/132i0x/does_the_amphibrach_exist/",
        "text": "Question for the prosodically-inclined. My favorite book on prosody is Stephen Adams' Poetic Designs. In his chapter on scansion he claims that the amphibrach and the amphimacer are unnecessary and leaves them out of his system. I'm inclined to believe him, but I don't know how he would get around a line like this from Frost's \"Mowing\":\n\nAnd that was why it whispered and did not speak.\n\nWithout seeing \"it whispered\" as an amphibrach, how would you scan this line? And more generally, do you know of any other systems that don't allow for the amphibrach/amphimacer? ",
        "created_utc": 1352739339,
        "upvote_ratio": ""
    },
    {
        "title": "What is the importance of the American Diner in 20th century American Literature?",
        "author": "mrawesomep",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/132dop/what_is_the_importance_of_the_american_diner_in/",
        "text": "I only ask this as my partner is getting exasperated with her dissertation on the American diner. generally hers is an essay on the juxtaposition of public and private spaces but could do with more suggestions on essays and books with examples of diners. thank you. ",
        "created_utc": 1352734812,
        "upvote_ratio": ""
    },
    {
        "title": "Narratologists: Narrative-we in Joshua Ferris's _Then We Came to the End_",
        "author": "dubyakcwell",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/131jzl/narratologists_narrativewe_in_joshua_ferriss_then/",
        "text": "I realize *Then We Came to the End* is a relatively new work. Link [here](en.wikipedia.org/wiki/Then_We_Came_to_the_End) for anyone seeking more information about it.\n\nNarratologists (and, of course, anyone else familiar with Ferris's novel), is there any narratological work out there on *Then We Came to the End* that I am unaware of? I'm currently writing a paper on it, and I've not come across a single critical examination of the novel, other than light reviews, summaries, etc. I want to be certain I haven't missed an important reading of the text somewhere along the way. \n\nThanks to all! ",
        "created_utc": 1352689474,
        "upvote_ratio": ""
    },
    {
        "title": "Suggested works/essays on Kafka?",
        "author": "lemur_tamer",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/13132r/suggested_worksessays_on_kafka/",
        "text": "Hello all. I was wondering if anyone here would be willing to suggest some of the more well known and/or foundational texts in Kafka criticism. In particular, I'd like suggestions in regards to pieces that touch on *In the Penal Colony.* This could include collections or individual essays- I'm really just concerned with acquainting myself with some of the more influential writings on Kafka.\n\nThank you much!",
        "created_utc": 1352672982,
        "upvote_ratio": ""
    },
    {
        "title": "Starting to read Midnight's Children by Salman Rushdie.  What is the ideal way I can read this?",
        "author": "trashed_culture",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1312yj/starting_to_read_midnights_children_by_salman/",
        "text": "I picked this up at the thrift store awhile back, just because I knew his name and the book won the Booker prize.\n\nI'm a few pages in now, and I'm thinking about how I saw Rushdie on a list of complex authors recently.  So, I'd like to try to read this from the perspective of someone who is studying it as literature.\n\nWith that in mind, what should I look out for in the text?\n\nHow do I catch important allusions?\n\nWhat is it about his writing that is important?\n\nIs this a book that I should expect to read on multiple levels, or is it complex in some other way?\n\nThanks in advance to you wonderful scholars.",
        "created_utc": 1352672875,
        "upvote_ratio": ""
    },
    {
        "title": "What writers are considered the literary heirs to Faulkner, be it in style or subject selection? ",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/130azd/what_writers_are_considered_the_literary_heirs_to/",
        "text": "I'm on a Faulkner kick, and I can't seem to get out of it. \n\nAlso, what academics on Faulkner are most notable and worth reading. ",
        "created_utc": 1352639665,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of any good studies on narrators or speakers in poetry?",
        "author": "PoeticallyInclined",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1302l0/does_anyone_know_of_any_good_studies_on_narrators/",
        "text": "Specifically, I'm curious about the way we treat or don't treat the presence of speakers in poems. Although I'm not going to be writing on fiction, narratological studies of narrators/speakers in novels/short stories would also work as a nice point of comparison. ",
        "created_utc": 1352618429,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for work on canon formation, with (if possible) particular emphasis on \"rescuing\" marginalized forms (esp. speculative fiction)",
        "author": "headlessparrot",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12zh0a/looking_for_work_on_canon_formation_with_if/",
        "text": ". . . Within the context of American literature, in particular, would be nice, but anything about canon formation, or perhaps the violence done to the study of literature when we rip out 'genres', or how popular (ostensibly 'non-literary') writing like speculative fictions/westerns/mysteries/etc., might be recuperated into a more 'open' or 'holistic' canon.\n\nThere are some obvious works that I'm aware of, because they pop up so often on American lit reading lists--Cathy Davidson's *Revolution and the Word* has a number of sections which interrogate the very idea of reading lists and canons, Jane Tompkins' *Sensational Designs* basically illustrates the way literary reputation and canon formation are political, and Nina Baym addresses the systematic biases that have left out (for example) women writers. But I'm wondering if anyone out there has taken these ideas and run with them specifically in the context of articulating a space for popular/genre fiction in the canon.",
        "created_utc": 1352590464,
        "upvote_ratio": ""
    },
    {
        "title": "Works dealing with the use (or purpose) of literary theory/criticism?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12x263/works_dealing_with_the_use_or_purpose_of_literary/",
        "text": "Could anyone recommend any books or articles that try to examine exactly what the use of literary theory (or literary criticism) is? \n\nI'm not really looking for anti-theory polemics (I only add that because I think it might look like my question is leading in that direction), but more nuanced looks at what exactly literary theory does. I hope that makes sense.",
        "created_utc": 1352477767,
        "upvote_ratio": ""
    },
    {
        "title": "I've been really interested in Trauma Theory....",
        "author": "Lauren0",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12w5gg/ive_been_really_interested_in_trauma_theory/",
        "text": "Does anyone know of any good sources or places to start? Thanks. ",
        "created_utc": 1352428389,
        "upvote_ratio": ""
    },
    {
        "title": "Texts to study alongside Cormac McCarthy's The Road for a dissertation?",
        "author": "ryanbtw",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12vtm5/texts_to_study_alongside_cormac_mccarthys_the/",
        "text": "As part of my dissertation for English, we've to write a 4000-word comparative analysis of two or three texts (recommended is two) of our choosing, composing our own question and terms.\n\nI've decided to study Cormac McCarthy's The Road because it's a book I enjoy reading and won't grow tired of writing about, and revising analysis for. However, I do need a book to analyse it side-by-side. Any ideas?\n\nI was originally going to do the literary representation of the journey and all that entails - companions, obstacles along the way, trials, aid - by comparing it with The Lord of the Rings, but I've since strayed from that idea.\n\nWhat do you think, Reddit? Suggestions? It does have to be prose, a novel.",
        "created_utc": 1352417097,
        "upvote_ratio": ""
    },
    {
        "title": "How is technology transforming the nature of literature, writing and reading?",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12vqil/how_is_technology_transforming_the_nature_of/",
        "text": "I'm beginning to research material for my doctorate and am wondering if reddit could suggest scholars, articles or texts that may deal with this subject in any direct or indirect way?\n\nSo far I'm thinking of using Latour (ANT) and Foucault (discourse analysis) for theoretical frameworks, and intend to use websites such as 4chan, reddit and facebook to examine how people are using the web to collaborate, create and share writing in new and 'revolutionary' ways.\nIdeally I'd be interested in any actual texts that have in someway been formed or transformed by the internet/technology/social media etc.",
        "created_utc": 1352414164,
        "upvote_ratio": ""
    },
    {
        "title": "Shortstory (constructive feedback please) (735 words)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12thv8/shortstory_constructive_feedback_please_735_words/",
        "text": "",
        "created_utc": 1352323424,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best daily news source that you know of?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12tc76/what_is_the_best_daily_news_source_that_you_know/",
        "text": "I'm trying to find a blog or site that offers a daily summary of all the breaking news for that day, world wide. \n\nMy plan is to link to its rss feed for nice little daily updates to my email. \n\nI'm willing to bet there's a blogger out there who does this, something along the lines of a writen version of youtuber sxephil's program, but so far I can't find anything worth while. \n\nthanks!\n\n ",
        "created_utc": 1352318730,
        "upvote_ratio": ""
    },
    {
        "title": "Has this plot already been written?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12t2xx/has_this_plot_already_been_written/",
        "text": "I'm thinking of writing a short story but it seems like it may have already been done. The story is about a woman who suddenly dies and it is discovered that she has many simultaneous lovers who heretofore had no idea of each other's existence.  The story progresses to cause the men who loved her so much to end up hating her after she can no longer plead her defense.\n\nHas it been done? ",
        "created_utc": 1352310864,
        "upvote_ratio": ""
    },
    {
        "title": "When I read Kafka, do the social interactions seem odd to me because they are the conventions of an entirely different time and place, or does Kafka mean to subvert commonplace social interactions?",
        "author": "mepc36",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12srby/when_i_read_kafka_do_the_social_interactions_seem/",
        "text": "I'm just thinking of all the times in his books (Trial, America, short stories), when people seem to completely overreact to small things, or else act out in very unexpected ways. I'll try to list some:\n\n1. When K. basically falls in love at first sight with Leni, and creeps on her, and starts to be possessive of her as if she were his girlfriend or even fiancée - I thought this was even more forbidden back then?\n2. Furthermore, the sudden anger he displays at Fraulein Burstner when he goes to visit her, grabbing her wrist as he goes to leave.\n3. When the Uncle throws out the main guy (forget his name) in America early on in the book because he didn't come back to New York by 12\n\nI mean, every book is written in a certain time and place, and I don't think it's any stretch to say that the conventions of Jewish people in Prague early on in the 20th century are vastly different from those I view in my own life and the life of many of you, a Western European, Christian-informed, 21st century state of mind. But some things just seem...odd, like as I've described above.\n\nCan anyone help me out?",
        "created_utc": 1352300032,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know some good books on futurism?",
        "author": "Flowerpig",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12r9q5/do_you_know_some_good_books_on_futurism/",
        "text": "I'm mostly interested in the russian variety, but anything good is good. Both anthologies and critical works are of interest. \n\nOh, and I'm familiar with Jakobson and Bakhtin, so I'm mostly after contemporary works - context, history and that jazz.",
        "created_utc": 1352242638,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone provide/link an example of deconstruction as a form of literary criticism?",
        "author": "skepticMelody",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12pmhs/can_someone_providelink_an_example_of/",
        "text": "I have to write critical literary essay on Heart of Darkness, and I've been assigned Deconstruction. I've read the Wikipedia page, the handouts he gave me, but I still have no clue what it means. A lot of the links I found online elaborate of Derrida's philosophy, but I don't really get how I can apply it to an essay.\n\nFrom what I understand, it's about how the language an author uses can convey multiple meanings, even meanings that contradict the message he thought he was saying. In order to show my teacher these multiple meanings, I need to find quotes that contradict each other or create ambiguity, as well as opposites (whatever that is). \n\nBut isn't this what high school English teachers do anyway? Show how something in a novel can mean five different things? How is this different from a standard analysis essay? ",
        "created_utc": 1352175594,
        "upvote_ratio": ""
    },
    {
        "title": "Help with analyzing poem. ",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12nod0/help_with_analyzing_poem/",
        "text": "Hey r/askliterarystudies, I posted this question in r/literature, but I thought I might get some insight from here, too. I'm hoping you can help me out. I'm trying to analyze the poem \"Fire\" by Philip Levine, but I'm having some trouble with it. There's a lot of imagery here, however I'm not sure what it's saying or means. I think he may be using \"fire\" as a metaphor? What about themes, symbols, and forms? All help is appreciated.\n\nFire by Philip Levine:\n\nA fire burns along the eastern rim\n\nof mountains. In the valley we\n\nsee it as a celestial prank, for\n\nin the summer haze the mountains\n\nthemselves are lost, but as the night\n\ndeepens the fire grows more golden\n\nand dense. On this calm ground\n\nthe raw raging of burning winds\n\nthat cuts the eyes and singes the hair\n\nis seen as a pencil-line of light\n\nmoving southward. I know my son\n\nis there, has been for four days,\n\nmoved in and out by helicopters\n\nwith his squad of fire fighters.\n\nBy now, without sleep, they've\n\ngone beyond exhaustion. Some can't\n\nwaken, some are crazed, a few\n\ngo on-- the oldest-- working steadily.\n\nI know this from the stories he\n\nhas told me of other famous fires\n\nfrom which he returned as from\n\na dream, his eyes glazed with seeing,\n\nhis time and place gone.\n\nHe would raise his shaking right arm\n\nabove his head, and with his palm\n\nopen sweep it toward me again\n\nand again and speak without grammar,\n\nsometimes without words, of what\n\nhad taken place. I knew it was true.\n\nNow in the cool of the evening I catch\n\na hint of the forest, of that taking\n\nof sudden breath that pines demand;\n\nit's on my skin, a light oil, a sweat\n\nborn of some forgotten leaning into fire.",
        "created_utc": 1352099206,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me find a recent opinionated article (N.Y or L.A Times) which connects to a prevalent theme in Huckleberry Finn? ",
        "author": "Waffles_In_My_Hands",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12n262/can_anyone_help_me_find_a_recent_opinionated/",
        "text": "",
        "created_utc": 1352076438,
        "upvote_ratio": ""
    },
    {
        "title": "\"Doing a poetry analysis paper on, \"The Red Wheelbarrow.\" I need help figuring out if this poem is used anywhere else... like movies, music.. etc",
        "author": "mayguncoheed",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12n0b4/doing_a_poetry_analysis_paper_on_the_red/",
        "text": "http://en.wikipedia.org/wiki/The_Red_Wheelbarrow\n\nI checked on wiki already under \"in popular culture\" so I'll be adding those sources to my paper... but does anyone else know of songs, movies, or anything else it may be cited in?",
        "created_utc": 1352074774,
        "upvote_ratio": ""
    },
    {
        "title": "Question about the Great Gatsby plot (x-post askreddit) Link inside",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12msd8/question_about_the_great_gatsby_plot_xpost/",
        "text": "http://www.reddit.com/r/AskReddit/comments/12mrno/why_did_the_gatsby_get_to_drive_home_with_daisy/",
        "created_utc": 1352067517,
        "upvote_ratio": ""
    },
    {
        "title": "Carroll's Alice in Wonderland: Children or Adult Literature? (x-post from r/Literature)",
        "author": "Metapsychosis",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12mcg3/carrolls_alice_in_wonderland_children_or_adult/",
        "text": "Recently I've re-read it and I stumbled into a few questions - is it really a kid's story about a little girl's odd adventures or are there several other underlaying messages that, if deciphered, might have some kind of impact on the youngsters? In other words, from your point of view, what would be the main difference between a child's perspective of this story or of a grown-up person?",
        "created_utc": 1352052211,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a poem or short story suggestion to do a close reading of...",
        "author": "GuerraGatitoJr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12lc4p/looking_for_a_poem_or_short_story_suggestion_to/",
        "text": "I am in Eng 300 and we are supposed to find a well known/researched/written about short story or poem to use to learn the process of close readings. I was wondering if anyone had a suggestion for a good piece to learn on? Thanks! Also, Lit theory is blowing my mind!!! Fucking Foucault is the man. So any suggestions for some ways to delve deeper into that broad category would be appreciated as well. Cheers!",
        "created_utc": 1351993058,
        "upvote_ratio": ""
    },
    {
        "title": "A lot of fiction includes renowned private detectives who are well-known in their own time and place (fictional of course), e.g. Monk, Nero Wolf, etc. Does this have any historical basis in any society? If not, where does this trope come from?",
        "author": "HubbleTrain",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12kcsr/a_lot_of_fiction_includes_renowned_private/",
        "text": "I posted this in /r/asksocialscience but it was recommended I try here for a fuller answer.",
        "created_utc": 1351953963,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for brief archaeology of famous post-colonial and anti-imperialist authors and traditions in literary studies.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12j94t/looking_for_brief_archaeology_of_famous/",
        "text": "Hi /r/AskLiteraryStudies, \n\nI want to feature some post-colonial and anti-imperialist authors and perhaps many of their famous texts on my new subreddit /r/Postcolonialism. \n\nThat said, in order to maintain a balance, I want to focus on imperialism where ever it may exist in the world apart from simply zeroing-in on Africa. As such, I'm looking for writers from anywhere else -- the Middle East and Latin America in particular tend to catch my eye. \n\nConsidering how my familiarity is predominately theoretical, if you could better orient me in the direction of these sort traditions in literary studies in particular, or if you'd like to contribute a post in /r/Postcolonialism yourself, I would greatly appreciate it if you could help me \"return to the text\" as it were.\n\nBest,\n\nBT.",
        "created_utc": 1351891529,
        "upvote_ratio": ""
    },
    {
        "title": "First conference next week! Any advice?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12iyuc/first_conference_next_week_any_advice/",
        "text": "I'll be attending the 2012 SAMLA conference in Durham, NC. (If anyone else here is going, please send me a message) I'm getting steadily more nervous about my research and presentation, does anyone have any recommendations or advice about attending and presenting at literary conferences?\n\nAlso, if anyone has a background in French poststructuralism and psychoanalysis and has 15 spare minutes, I'd really appreciate getting feedback on my paper and help on anticipating questions. Thank you.",
        "created_utc": 1351881641,
        "upvote_ratio": ""
    },
    {
        "title": "Can you explain The Crying of Lot 49?",
        "author": "trashed_culture",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12iv34/can_you_explain_the_crying_of_lot_49/",
        "text": "Hey Folks,\n\nI read a lot, but I don't have any formal literature training after high school.  Well, I studied Philosophy in college, but that's different.  I don't really know how to analyze a piece of literature.\n\nAnyway, I know that the Crying of Lot 49 is well regarded by some, but I'm not sure I know why.  I have some general thoughts and questions, and please feel free to point me to a good reading guide or seminal article on the subject.  I have access to journal articles if you an provide the title.\n\nSo, first of all, how much am I missing simply because I am reading this 50 years later?  I know the 60s were a major turning point in social politics in the US, and abroad.  Does this book deal with some social consciousness that I'm not a part of?\n\nTo me, a major part of this book is the murky distinctions between liberal/conservative and libertarianism/government-hegemony.  Specifically, why does the USPS exist, rather than a variety of free-market mail carriers.  I suppose this question is coming into play again in the current decade, but with different overtones.\n\nIn some weird way this book reminds me of the Life of Pi.  At the end, Pynchon writes that there are 4 options for Oedipa.  In some of those options she is incorrectly observing reality (insane/hallucinating), and in others she is the victim of a fake conspiracy or a real conspiracy.  It reminds me of Life of Pi in how that book asks us to question how we interpret the subjective truth of belief and faith, and how that juxtaposes to our normal, blase lives.\n\nI know that the book is also well regarded due to its wordplay.  Other than the obvious naming of characters, what should I be looking for?  What about allusion to other literature and cultural events?\n\nAlso, what's up with the title.  I fully expected Lot 49 to be the used car Lot that Mucho had worked at.  \n\nIn short, what do I need to do to \"get\" The Crying of Lot 49.\n\nThanks, and happy Friday!",
        "created_utc": 1351878062,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for an good introduction to Bruno LaTour's Actor Network Theory.",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12ci7j/looking_for_an_good_introduction_to_bruno_latours/",
        "text": "Any recommended articles appreciated. I have access to Jstor and the like.",
        "created_utc": 1351617967,
        "upvote_ratio": ""
    },
    {
        "title": "Institutional history of lit studies",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12cdhx/institutional_history_of_lit_studies/",
        "text": "Hi everyone.\n\nI was hoping someone might know of some resources about the history of literary studies in universities. I know, for example, that it was only recently (I mean, past 200 years) that literary studies became a coherent unit in universities (and therefore as a discipline) - but I don't know how I know it (or even if it's accurate). How did we get english, french, german, comp lit, departments? What did they grow out of? Where have all the philologists gone? \n\nIt seems pertinent to make this history more well-known, considering the indeterminate future of some of our fields, the neglect for liberal arts-style degrees in favor of STEM, the blatant disregard for adequate funding in the humanities, rabble rabble, etc. ",
        "created_utc": 1351613647,
        "upvote_ratio": ""
    },
    {
        "title": "Suggested reading for modernism, particularly how/to what extent it was influenced by emergent theories of psychoanalysis?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12b1ag/suggested_reading_for_modernism_particularly/",
        "text": "I'm utterly deficient in early 20th century literature and would appreciate any help in finding the right direction for my research. Thanks!",
        "created_utc": 1351553422,
        "upvote_ratio": ""
    },
    {
        "title": "(Much better then the last) discussion of analytic philosophy vs. 'continental' philosophy or French post-structuralism",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/12a6h0/much_better_then_the_last_discussion_of_analytic/",
        "text": "http://www.reddit.com/r/askphilosophy/comments/129k5u/why_is_that_in_some_philosophy_departmentsfields/",
        "created_utc": 1351529024,
        "upvote_ratio": ""
    },
    {
        "title": "Article access help please?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/124ma7/article_access_help_please/",
        "text": "",
        "created_utc": 1351266402,
        "upvote_ratio": ""
    },
    {
        "title": "Periodization in Literary Study",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1226po/periodization_in_literary_study/",
        "text": "To what extent do you think this is still a useful concept in the study of literature?\n\nI'm finding myself increasingly hostile towards the idea, which seems to be perpetuated as much out of an organizational necessity as it is any actual legitimacy. \n\nIt seems that the sort of periodization we do is willfully constructed to do some degree. In other words, we find commonalities in a period, then focus on those and say that was the aesthetic of the period. I've had a professor tell me that he would love to teach Tristram Shandy in his contemporary literature course, because it fits the style and the aesthetic very well, but of course he can't because it was written 200 years too early.\n\nI think we'd be better off grouping our study by... well, anything except chronology. If we were to group by common themes, common aesthetics, etc. which seems to be how we construct these periods anyway, I think we'd be better off.\n\nNow, I do realize that there is a certain historicity to literature in that artists usually read their predecessors, I'm just not convinced that structuring our study around that chronology is a good idea, or a useful one.\n\nSorry if this is sort of rambling. I'm not entirely solid on these ideas. That's partly why I'm posting here. What do you all think? ",
        "created_utc": 1351163938,
        "upvote_ratio": ""
    },
    {
        "title": "If a book is called a 'classic' does this automatically mean it is canonical?",
        "author": "lvhitch",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/120ecu/if_a_book_is_called_a_classic_does_this/",
        "text": "I guess what I'm trying to get my head around is whether the terms 'canonical' and 'classics' are interchangeable terms.",
        "created_utc": 1351094242,
        "upvote_ratio": ""
    },
    {
        "title": "Criticism of John Keats' \"Ode to Indolence\", specifically in the context of his other Odes?",
        "author": "InDubiousBattle",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1200gk/criticism_of_john_keats_ode_to_indolence/",
        "text": "[Link](http://englishhistory.net/keats/poetry/odeonindolence.html)",
        "created_utc": 1351076420,
        "upvote_ratio": ""
    },
    {
        "title": "Someone help me please, has anyone got any readings or criticisms of 'The Erl King'? Also of 'The Lottery' ",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11ww43/someone_help_me_please_has_anyone_got_any/",
        "text": "Hey guys! I'm doing a piece of coursework for college, the short stories we can compare are\n\n Roald Dahl\n\n 'The Landlady'\n 'Lamb to the Slaughter'\n\n Angela Carter \n\n'The Erl King' \n'The company of wolves'\n\n Edgar Alan Poe \n\n'The Tale Tell Heart'\n'The cask of Amontillado'\n'The Masque of the red death'\n\nShirley Jackson\n'The Witch'\n'The Lotery' \n\nSo yeah anyway, I think I'm going to compare The Erl King and The Lottery so if anyone has any good criticisms of readings of this, I would be so appreciative :) If anyone recommends I compare two different short texts I would love to hear your ideas!\n\nCheers guys ",
        "created_utc": 1350951333,
        "upvote_ratio": ""
    },
    {
        "title": "Name for a form of figure speech.",
        "author": "erhector",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11wj6x/name_for_a_form_of_figure_speech/",
        "text": "Hi. Not sure if this is the right place to ask (I *think* it is) ...\n\nI'm writing an essay on *noir* fiction, and forgot what's the name of the figure speech when you say you refer to something or someone by saying you wont mention it.\n\ne.g. \"I will not tell you about how I fell in you at first sight\"\n\nThank you.\n\nEdit: It might be important to let you know english is not my native language. JUST IN CASE.",
        "created_utc": 1350925490,
        "upvote_ratio": ""
    },
    {
        "title": "Themes in contemporary fiction: what do you see?",
        "author": "EyeAmerican",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11ugqw/themes_in_contemporary_fiction_what_do_you_see/",
        "text": "I initially specified 'American' fiction, but it hit me that such a title would marginalize my fellow readers across the ponds and over the fences, whose writers may very well share every motif as ours. Either way, the question remains broad. But my hope is that any sincere discussion at all will lead us to a narrowing, to the specific fibers in fiction that make our ears and hearts perk up most. \n\nFeel free to post any thoughts, hunches, likes and dislikes. Be as abstract or specific as you'd like. I'm wondering if we could simply isolate the most overt themes and the most latent, pinpoint what we'd like to see more of or less of, and maybe even isolate common forms used to approach these topics (i.e. electronic correspondence).\n\nEach of us are allowed our own definition of what's contemporary--mine happens to be the last two hundred years--and please bring up whichever authors and themes get you excited, so long as we keep the focus on what we talk about when we talk about fiction today. ",
        "created_utc": 1350833025,
        "upvote_ratio": ""
    },
    {
        "title": "Can you name a book that may or may not have been from the 1800s or early 1900s that had a rich man isolated at his estate and included a room with turtles who had gemstones encrusted on their shells?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11sjrn/can_you_name_a_book_that_may_or_may_not_have_been/",
        "text": "I read this book a long time ago because it was recommended to me as in some ways being similar to the short stories of Thomas Ligeti.  I cannot for the life of me remember the name of the book or author, only that I loved the book.  Does anyone know what I'm talking about?\n\nIt was pretty old, and featured a rich man who isolated himself and used his immense wealth to create various extreme sensory experiences, the turtle, an organ that played either lights or smells or tastes (I don't recall), etc.  He may have had two old servants as the only humans he interacted with.  It was less of a plot and more of a fantasy on unusual sensory experiences.  \n\nDriving me crazy, figured you folks might know the book.",
        "created_utc": 1350727095,
        "upvote_ratio": ""
    },
    {
        "title": "I am posting to inform you of the unacceptable behaviour of your regular contributor, Unicormfarts",
        "author": "genericusername47",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11qij4/i_am_posting_to_inform_you_of_the_unacceptable/",
        "text": "",
        "created_utc": 1350628344,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for novels about (or involving) drug/alcohol use/abuse/addiction by African-American authors",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11nuoi/looking_for_novels_about_or_involving_drugalcohol/",
        "text": "My partner is teaching a course in drugs/alcohol in American lit next term, and was looking for a book by an African-American author to round out the syllabus--a contrast to the fact that all the big abuse novels seem to be by the pasty white folk (Kerouac, Burroughs, etc.,). I couldn't think of any off the top of my head, but it's not my field, so I'm wondering if /r/AskLiteraryStudies can think of any.",
        "created_utc": 1350520943,
        "upvote_ratio": ""
    },
    {
        "title": "Dog-Modernist explains the difference between (essentially) literary/cultural criticism and analytic philosophy",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11nlmi/dogmodernist_explains_the_difference_between/",
        "text": "http://www.reddit.com/r/philosophy/comments/11kam7/simulacra_and_simulation_baudrillard_pdf/c6nasvu\n\nThere's a pdf of Baudrillard's Simulacra &amp; Simulation in the thread to boot.",
        "created_utc": 1350512792,
        "upvote_ratio": ""
    },
    {
        "title": "On r/IrishHistory someone has posted a thread;Did the Gaelic revival and nationalism turn people off Irish Literature in Ireland?",
        "author": "CDfm",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11n8pj/on_ririshhistory_someone_has_posted_a_threaddid/",
        "text": "Someone suggested we ask here because it covers literature and history ;\n\n\n\n&gt;Recently I was related a story by a French friend of mine who teaches English in Trinity about a comment from one of her students that he 'hates hates hates Irish literature'. She was shocked that this was not a unique attitude and could not understand why so many of her students hated it.\n\n&gt;I offered the opinion that it was because it was closely associated with nationalism. Has anybody else seen an aversion to irish literature amongst young Irish people?\n\nHere is the link . \n\n\n\nhttp://www.reddit.com/r/IrishHistory/comments/11men2/did_the_gaelic_revival_and_nationalism_turn/\n\n",
        "created_utc": 1350501772,
        "upvote_ratio": ""
    },
    {
        "title": "Would anyone be interested in a blog about my MA thesis?",
        "author": "melvillelongstreet",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11m3mr/would_anyone_be_interested_in_a_blog_about_my_ma/",
        "text": "Over the last few months I have been keeping a blog detailing the grand plan for my master's thesis about the American Civil War and the poetry of Walt Whitman and Herman Melville. I explore some literary theory that I plan to use and some of the issues that I will address in my final paper. If anyone has any suggestions for articles, books, authors, really anything I would be most appreciative if you would post them here or on my blog.\n\nLink: http://andrewpearcy.wordpress.com/",
        "created_utc": 1350447679,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to understand a section of a book.",
        "author": "someguy514",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11lpik/trying_to_understand_a_section_of_a_book/",
        "text": "\"One fellow, of gigantic proportion, whose long, tattered great-coat just reached below the middle of his bare red legs, and, like charity, hid the defects of his other garments, or perhaps concealed his want of them, leaped upon the rocks and flourishing aloft his shilelagh(wooden club), bounded and capered like a wild goat from his native mountains. \"\"Whurrah! my boys!\"\" he cried,\"\"Shure we'll all be jontlemen!\"\"\n\nNow, i'm no expert... But is this stating he jumped on a rock and flashed his dick around? If it is the i will use this in my essay, but if it isn't, I don't want to look like an idiot to the teacher. ",
        "created_utc": 1350435317,
        "upvote_ratio": ""
    },
    {
        "title": "Would anyone be interested in a digital hypertext I am creating with love letters across the years? (please suggest more appropriate subreddits if not)",
        "author": "necrododo",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11kbef/would_anyone_be_interested_in_a_digital_hypertext/",
        "text": "This is a project that I am doing for a Digital Humanities course where you travel via hyperlink between love letters across the years, connected through reflected motifs, themes, tone and imagery. This includes 16th century courtship poems, Joyce's pretty filthy letters to Nora, text messages, skype transcripts, texts and anonymous notes. I am currently trying to work on it for a presentation but if anyone would be interested in seeing the finished project, I would like to know. If there's enough interest I will keep working on it and put it up when I think it's at an appropriate level. \nIf any of you can think of another subreddit that would appreciate this more, please let me know.\n\nEDIT: UPDATE Still not finished but if you'd like to take a look - http://jamesandaoife.wordpress.com/",
        "created_utc": 1350383342,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone used the psychoanalytic literary criticism to analyze The Waste Land?",
        "author": "egm924",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11jne3/has_anyone_used_the_psychoanalytic_literary/",
        "text": "I'm writing a paper and trying to analyze The Waste Land using psychoanalysis. My thesis is that the poem is a dream. I'm really having trouble with examples/reasons now. ",
        "created_utc": 1350351011,
        "upvote_ratio": ""
    },
    {
        "title": "Can any one please help with the poem by Edgar Allan Poe?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11jmzx/can_any_one_please_help_with_the_poem_by_edgar/",
        "text": "I don't know if this is the right subReddit, but I need help. I have to find 2 pieces of evidence that support that there was violent events in the poem, The Raven. Can anyone here please help me?",
        "created_utc": 1350350701,
        "upvote_ratio": ""
    },
    {
        "title": "Sir Gawain &amp; The Green Knight -&gt;Assignment Help",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11jacc/sir_gawain_the_green_knight_assignment_help/",
        "text": "",
        "created_utc": 1350339563,
        "upvote_ratio": ""
    },
    {
        "title": "An ignorant husbands plea for Howards End and the lumping that may or may not take place",
        "author": "manicmann",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11j5ci/an_ignorant_husbands_plea_for_howards_end_and_the/",
        "text": "Background: My wife is in grad school and just wrote a paper on Howards End. Trying to be a good husband I read the paper to show my support and interest in what she is doing. One thing is bugging me. She wrote a block quote from the book as follows:  \n\n\"I mean to dislike your husband, and to tell him so. I mean to make no concessions to Tibby. If Tibby wants to live with me, he must lump me. I mean to love you more than ever.\"\n\nMy question is what is the action of \"lump\" they speak of. It bugged me so much that i tried using my 4 years of computer school and google to get the answer and I cant find it. Please shed some light on this if you can. There are no context clues that i can see to tell me the context of the word \"lump\". Thanks in advance.\n\nTL;DR: What does the action \"lump\" mean?",
        "created_utc": 1350335151,
        "upvote_ratio": ""
    },
    {
        "title": "Drugs as/and literature as a means of achieving moments of freedom, a short analysis. Criticism welcome.",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11ikxa/drugs_asand_literature_as_a_means_of_achieving/",
        "text": "Drug writing, or literature and/as drugs, can help interrogate and stretch our understanding of the limits of freedom and the nature of existence. Is absolute freedom possible and if so, does it include freedom from free will?  Is freedom from autonomy and responsibility possible, and if so, at what cost? Can an individual use drugs responsibly or are they doomed to addiction? Can the Author assume complete control over the work? In the preface to Samuel Taylor Coleridge’s poem Kubla Khan, the narrator troubles the authenticity and authorship of the work by claiming in the distant third person that upon reading the words “Khan Kubla commanded a palace to be built... the Author” fell into a “profound sleep, at least of the external senses” and upon awaking transcribed his vision (52). In the poem proper, the speaker realizes that the utopian, limitless freedom symbolized by the pleasure-dome’s “caverns measureless to man / Down to a sunless sea,”  eschew a sinister chaos. The speaker continues to describe Xanadu as “A savage place!” and cautions, “Beware! Beware!”  (58). Similarly, individuals who test the limits of their own supposed volition through “responsible” drug use can find the consequences ontologically chaotic. As members of society we are free to choose health, happiness and prosperity (if we’re lucky). We are also free, to make choices sanctioned by society as harmful. If we, like Kubla Khan, feed on Xanadu’s “honey-dew” and drink “the milk of Paradise” by experiencing a drug altered reality, we must be prepared to face the effects and affects of such indulgence (58). Namely, that the path of drug use has a slippery slope, “that deep romantic chasm which slanted / Down the green hill” to euphoria, can lead to desire for nothing but the substance of our desire, or the thing known as “addiction” (58).\n\nAt what point does the act of repeatedly making a choice become a habit and at what point does a habit become “addiction”? Drugs have historically been seen as things used by individuals as a means of exercising the freedom to choose. Eve Sedgwick argues in her essay “Epidemics of the Will,” that when in the exclusive domain of the wealthy and powerful, drug use was seen as a behaviour rather than an identity, “it brought into realistic conformity... their levels of concentration, their temporality or their alertness to... pain” (582). Since the humanist revolutions of France and America in late nineteenth century, the self as a subject of autonomous control and responsibility has evolved alongside the emergence of systems and structures of governance able to execute, hedge and enforce these nascent individual rights and freedoms. The understanding of the nature of substances (and behaviours) known as “drugs”, can be traced to the “changing class and imperial relations,” and the transformation of “a question of acts crystallized into a question of identities” (582). As a result, drug users are stripped of their own subjectivity just as soon as they’d secured the inalienable right to it, becoming objects of laws and governments whom presumed to know best. As a result, “normal” people are duped into believing themselves different from drug users, while in reality both groups’ volition has been silently appropriated by the State or the drug respectively. It is the drug users who are thrust into into dueling and inexorable fatalistic narratives of “addiction” or “kicking the habit” (582). Both groups however are ultimately trapped, their freedom to choose, an illusion; but the “addict” by definition, knows it.\n\nThese fatalistic narratives are symptoms of the addict’s (and “normal” societies) real lack of choice. The institutional patholigization of the behaviour of drug use into the identity of the addict only confounds and hypostasizes a complex process. For example, when consuming an intoxicant, the plant (in Coleridge’s case, the opium poppy) does one of two things: it triggers memories, ideas, or associations that would otherwise have remained dormant, or it quells thoughts and feelings (like anxiety, fear or pain) that are painful or stifling. Coleridge may have taken anodyne for relief from physical suffering and as a result, had powerful visions or hallucinations that he otherwise might never have conceived and which inspired him to write Kubla Khan. Another person, maybe a poor nineteenth century British peasant living in squalor, may have sought refuge from their daily struggles by drinking alcohol to excess in order to experience a dissociative calm or tranquility. In either case, the individual attempts to exert control over their material experiences of reality and attain a feeling that such an exertion of control is successful, when in reality they are powerless. Sedgwick shows that with addiction, it is “the structure of a will that is always somehow insufficiently free, a choice whose volition is insufficiently pure,” and it is the assertion of will itself that has come to appear addictive (584).\n\nIn Crack Wars, Avital Ronell argues that not only are the histories and genealogies of literature and the things called “drugs” inextricably linked, but that through experimentation they can help question the limits of propriety and ontology. The question of freedom, both public and private, is at the root of this problematic “dissociation of autonomy and responsibility” (Ronell 59). In Kubla Khan’s Preface, Coleridge dissociates himself from authorship, renounces his poem from the history and genealogy of poetry and hazes the boundaries of his artistic responsibility as author by claiming that  his writing lacks  any poetic merit and that he only published at the request of “a poet of great and deserved celebrity” (52). This attempt at renunciation is mirrored by the addict, whom Ronell argues is “the non-renouncer par-excellance,” but whom regardless of the fruitlessness of their actions, manage to establish “a partial separation from an invading presence” (9). Written under the influence of narcotics, Kubla Khan is an example of literature that blurs and challenges the limits of freedom while helping to redefine the responsibility and identity of the poet while exploring the liminal space occupied by drug writing.\n\n\nEDIT: revised and polished",
        "created_utc": 1350316737,
        "upvote_ratio": ""
    },
    {
        "title": "I posted this q in lit and didn't get any answers. I found this subreddit and realized it might be more appropriate here. Original q: Lit profs-or anyone more versed than myself-please help me explain my feelings about qualities of different lit/writing styles.",
        "author": "BeatrixPD",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11ffjm/i_posted_this_q_in_lit_and_didnt_get_any_answers/",
        "text": "So, I recently finished reading 100 Years of Solitude. I enjoyed it immensely! I didn't even know what 'magical reality' was until I read it. I got confused midway through, so I researched the book a bit more and realized that I had to really suspend disbelief to 'get' the book. Anyway, I gave a friend Understanding the Borderline Mother, which she devoured. Granted, that is also a fantastic book. Not lit, though. More academic. In return, she gave me The Celestine Prophecy. I feel somewhat obligated to read it since 1-I accepted it, and 2-She read mine. However, after reading the first chapter, I realize it's just crap literature and I can't quite put my finger on it..I'll compare it to something by Nicholas Sparks. I hate to call Nicholas Sparks books crap because I know he has a large fan base. Still, once when I was in the Navy, it was the only thing I had access to in the female berthing. There was an entire, entirely BANAL chapter about how the dude baked a potato for his at-home dinner date with the female character in the book. I'm getting the same feeling about the way the dialogue and everything in this book is written. It seems to be littered with completely superfluous words. I can't quite explain what I mean, therefore I'm here. I feel like there are so many points interjected and actions explained that add nothing to the plot and leave even less to the imagination. For instance, the first chapter explains how the guy met the girl for lunch to discuss stuff. I'm paraphrasing here, but at one point, the author explains how when the food arrived, the female 'paused to take a bite of salmon from his plate, wrinkled her nose and giggled'. My only thought was 'so-fucking-what!'. Please pardon the profanity. Do any of you know what I mean? Can you help me understand this observation between real, quality lit and the more childish stuff? I feel like my conundrum seems obvious, but it's still bugging me a lot. **TL:DR I hope this isn't too esoteric, but what makes one book fantastic and the other so silly and shallow. This isn't a very good TL:DR, so please take a minute to read the entire question. I'd really like to discuss this/be educated.**",
        "created_utc": 1350159743,
        "upvote_ratio": ""
    },
    {
        "title": "Let's say I have an MA in Comp Lit that I got over 4 years ago, but let's say I'm woefully deficient in some embarrassing areas.  Could you help me a little bit with some theory?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11ehkp/lets_say_i_have_an_ma_in_comp_lit_that_i_got_over/",
        "text": "As said I actually did go to grad school (and I'm a contributor over on r/askhistorians, in fact - ask me something about Africa!  Let me redeem myself!), but even though I have the piece of paper, I know almost nothing of literary theory.  How can this be?  I faked it when I had to and focused on my strengths the rest of the time.  I managed to get through 4 years of college and 2 years of grad school and did some decent work, but I couldn't tell you the first thing about deconstructing anything, or something something structure something.  Yes, this is how disinterested I was.  Thankfully I've never worked in academia at all so it hasn't mattered, but I am proof that you can shadily bs your way through anything if you're desperate and cynical enough.\n\nWith mea culpa aside, just recommend me something basic, please:  an overview.  I need an intro to theory, something a fledgling English major might read. I need to not look stupid among my \"peers,\" and I would actually like to learn something.\n\nJust to be clear, I am pretty well read, and I do have some sort of education, so academic works don't scare me.  I just stick to the actual literature and history.  And yes, this is sad.",
        "created_utc": 1350102243,
        "upvote_ratio": ""
    },
    {
        "title": "What are some fundamental ideas in literary analysis?",
        "author": "AgonistAgent",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11egvf/what_are_some_fundamental_ideas_in_literary/",
        "text": "As an engineering/natural sciences kind of person, I've noticed that fields tend to have essential/underling concepts that are critical to understanding them - biology has layers of complexity and cells as a basic unit, mathematics has its axioms, economics has supply vs demand, etc.\n\nSo what are some core concepts in literary analysis? When I look through literary essays and such, I can somewhat understand what's going on. However, I also get the general feeling I'm missing the overall picture, much like a layman missing the concept of empiricism and replication in the sciences and being confused by conflicting studies.\n\nI'd guess that one is the inherent subjectivity of the field (no right answers, only defensible answers has been drilled into me and my peers ever since middle school).",
        "created_utc": 1350101270,
        "upvote_ratio": ""
    },
    {
        "title": "How do you locate articles?",
        "author": "MilsonBartleby",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11dje5/how_do_you_locate_articles/",
        "text": "I know this is the very basics of research, but I just want to make sure I'm not missing anything, so please respond under the assumption I know nothing about research. \n\nSo let's imagine I want to read some recent articles or books on TS Eliot - where do I start? What resources do I need to look at? How do I find these articles?",
        "created_utc": 1350064456,
        "upvote_ratio": ""
    },
    {
        "title": "Recent critics of TS Eliot?",
        "author": "MilsonBartleby",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11din6/recent_critics_of_ts_eliot/",
        "text": "Who are some recent critics of TS Eliot? Critics who have published on Eliot within the last 10 years - so not the likes of Hugh Kenner, etc. \n\n",
        "created_utc": 1350063721,
        "upvote_ratio": ""
    },
    {
        "title": "What does one call it when using a product or proper noun as a verb? eg. 'to Febreze a room' or to 'Google something'",
        "author": "TomCook24",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11d7b4/what_does_one_call_it_when_using_a_product_or/",
        "text": "",
        "created_utc": 1350052152,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good resources (i.e., videos or things you can read) to help introduce an underperforming high school student to the value of literature?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11cra1/what_are_some_good_resources_ie_videos_or_things/",
        "text": "Hey, everyone!  I'm working with some students who are in an after-school program for inner-city, low-income, but college-oriented high school students.  One girl in particular is having trouble with the required reading for her English class; she likes reading books with entertainment value, soap opera-style drama, and love stories, but doesn't \"get\" literature.  The most she sees in it is the didactic side, the \"take home\" lessons that you can get from a book.\n\nWe're going to be discussing the book she's reading one-on-one and in doing so encouraging her to relate herself to the characters, think about history, answer book club-type questions, and other such approaches, but I'm interested in ALS's input on different people's answers to \"Why Literature?\"  I may ask her to read them herself or I may distill them; feel free to suggest readings that would be appropriate for either approach.  They can be any level of answer; she's not a student who needs to be talked down to.  I really think that it's a matter of being presented with a way of expanding her horizons and thinking about it from a different perspective.\n\nThanks so much!",
        "created_utc": 1350020980,
        "upvote_ratio": ""
    },
    {
        "title": "[The Importance of Sleep in Decision Making] by yours truly",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11bodb/the_importance_of_sleep_in_decision_making_by/",
        "text": "",
        "created_utc": 1349982853,
        "upvote_ratio": ""
    },
    {
        "title": "Criticism on Kundera's The Joke?",
        "author": "ianmikyska",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11b5kd/criticism_on_kunderas_the_joke/",
        "text": "Hello everyone, just wanted to ask whether anyone could recommend any essays or books on Kundera's Joke, in English or Czech.\n\nThank you!",
        "created_utc": 1349964952,
        "upvote_ratio": ""
    },
    {
        "title": "How were what we consider \"classics\" viewed at the time they were published? (x-post from r/askHistorians)",
        "author": "SilverPhoxx",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11b3ce/how_were_what_we_consider_classics_viewed_at_the/",
        "text": "Were books like *Great Expectations* and *Moby Dick* social media crazes like *Harry Potter* and the like are today? Also, were classics critically analyzed for their deep moral subtexts then, like they are now?",
        "created_utc": 1349962142,
        "upvote_ratio": ""
    },
    {
        "title": "What is it called when two characters in a story allude to a previous conversation to fool you (the reader/viewer) into believing a false story.",
        "author": "VerbableNouns",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/11a4jx/what_is_it_called_when_two_characters_in_a_story/",
        "text": "While watching the most recent episode of Elementary, \n\n[Spoilers]\n\nin which Watson asks Holmes to \"trust me, or I will be the opposite of helpful.\"  In the following scene it then appears that the Homes  trusted Watson with information and that Watson is indeed being helpful.  In what is later found to be a ruse the characters put on a show in front of a suspect in which the police show up at Watson's request and Holmes says \"The opposite of helpful?\" to Watson. \n\n[/Spoilers]\n\nThat line of dialogue has no bearing on the scene except to present to the viewer that this is not staged.  This is one example of many I have seen in books/on T.V., and \n\nI would like to know, does this technique have a name or is it just poor writing?",
        "created_utc": 1349913689,
        "upvote_ratio": ""
    },
    {
        "title": "Is disappointment a literary mood?",
        "author": "Wolfzee",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/117w3y/is_disappointment_a_literary_mood/",
        "text": "I always get tone and mood confused, so it disappointment a mood? If not what would be the most closely related mood to disappointment?",
        "created_utc": 1349822178,
        "upvote_ratio": ""
    },
    {
        "title": "Question about dates/locations in classic literature.",
        "author": "MyVaginaIsReady",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/117axz/question_about_dateslocations_in_classic/",
        "text": "Hi, lately I've been reading a lot of Romantic/Victorian novels for two of my classes, and I had a question. A lot of the novels seem to block out years (i.e., \"In the year 18--\") and locations (\"We returned to ----shire\"). I was wondering if anyone knew why this was? It just seems like a really odd thing to do...",
        "created_utc": 1349800845,
        "upvote_ratio": ""
    },
    {
        "title": "Help with the Gothic",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1173o2/help_with_the_gothic/",
        "text": "I'm studying Gothic lit this semester, but my tutor hasn't really gone into detail about what the Gothic is. He just gave us the reading list and told us to get on with it.\nAs a newcomer to the genre, any suggestions of introductory critical texts, be they books, links or whatever else would be greatly appreciated. Also, any other useful critical texts would be great.",
        "created_utc": 1349793490,
        "upvote_ratio": ""
    },
    {
        "title": "Coleridge - Imagination vs Fancy",
        "author": "MisfortunesOfSade",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/115rzc/coleridge_imagination_vs_fancy/",
        "text": "In his essay \"Biographia Literaria\", he attempts to distinguish the differences between Imagination and Fancy. Can someone explain this to me in a very simple way? ",
        "created_utc": 1349733075,
        "upvote_ratio": ""
    },
    {
        "title": "Avital Ronell on Baudelaire on getting wasted- am I missing something?",
        "author": "yyiiii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/113nn1/avital_ronell_on_baudelaire_on_getting_wasted_am/",
        "text": "From Ronell's book *Crack Wars*:\n\n&gt;Baudelaire assimilates intoxication to a concept of work. Indeed, the plant puts you to work on a whole mnemonic apparatus. Intoxication names a method of mental labour that is responsible for making phantoms appear. It was a manner of treating the phantom, weither by making it emerge-or vanish. It was by working on Edgar Allan Poe that Baudelaire recognized the logic of the tomb, to which he attached the stomach. The stomach *became* the tomb. At one point Baudelaire seems to ask: whom are you preserving in alcohol? This logic called for a ressurectionist memory, the supreme lucidity of intoxication, which arises when you have something in you that must be encrypted. Hence the ambivalent structure stimulant/tranquilizer. (5)\n\nI've not read Baudelaire directly, what does he mean when he refers to phantoms? She cites *Artificial Paradise* as the book from which she is expanding on these ideas, has anyone read it?\n\nMy understanding is that when consuming an intoxicant, 'the plant' (cannibus for hash or the poppy for opium) either triggers memories, ideas, or associations that would otherwise either remain dormant in an individual *or* conversely, quells those thoughts and feelings (eg. anxiety and fear) that for another person are all consuming. \n\nSo one person smokes a stimulant like opium and has visions and/or hallucinations enabling him to write a poem (a al Coleridge and *Kubla Khan*) that he otherwise would never have been able to conceive and another person, perhaps a veteran soldier traumatized by her experiences in war smokes hash in order to experience calm and tranquility.\n\nIn either case, the person is attempting to exert control over their material experiences of reality though the 'lucidity of intoxication' because in reality, on some level they realize that they in fact have no control. Does that sound right?\n\nAlso, I like the bit about 'the logic of the tomb' and having something within 'that must be encrypted'- I was wondering if the wordplay around **tomb** and en**crypt**ed is significant. As in by consuming an intoxicant, we are literally swallowing a substance and entombing it within our bodies... I don't think I'm quite understanding this though.",
        "created_utc": 1349640642,
        "upvote_ratio": ""
    },
    {
        "title": "A question on Korean poetry",
        "author": "Throwaway21491",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/112hlg/a_question_on_korean_poetry/",
        "text": "I'm looking for a style of poetry, preferably traditionally Korean, but if not, than at least one that fits the language well. Ideally, it would be roughly analogous to a sonnet in length, and in rules- I'm looking for a style that would have fairly strict rules on rhyme or meter. I don't really know much at all about Korean poetry, so I don't even really know what distinguishes poetry from prose in that culture; do Korean poems rhyme? Are there restrictions on characters as well as on the sounds of the words? Help would very much be appreciated!",
        "created_utc": 1349573052,
        "upvote_ratio": ""
    },
    {
        "title": "Deconstructive Methodology",
        "author": "emperorlarsob",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/110890/deconstructive_methodology/",
        "text": "Ok, so, I'm kind of flooding this sub, but that's not hard considering the pace on this board is tortoise-like. Anyway:\nMy Lit Theory class only has two actual papers in it, a four-pager \"justifying the theory\" and a 10-12 pager \"using the theory,\" employing the same work.\nThis being said, after reading Derrida, Johnson, etc, I still have a shoddy idea of how deconstruction works. I know it involves an inversion of previously held assumptions, but I'm not sure what the actual operation of this involves.\nMy prof gave me this article to give me sort of a grounding: http://www.jstor.org/stable/40003005 . While I understand it, I'm not quite sure how its going to apply to what I'll be doing. I'll be doing the best I can to work with my instructor.\nCan anyone suggest a text which may lay out the methods through which texts are deconstructed, more of a methodology? I get more lost the more I learn, it seems.",
        "created_utc": 1349463810,
        "upvote_ratio": ""
    }
]