[
    {
        "title": "1 Is there historical significance or some historical purpose for reading classic literature?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bn0fo/1_is_there_historical_significance_or_some/",
        "text": "[deleted]",
        "created_utc": 1523501844,
        "upvote_ratio": ""
    },
    {
        "title": "Best place to quickly look up translations of Late Antiquity and Middle English words?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bmj54/best_place_to_quickly_look_up_translations_of/",
        "text": "Wiktionary works pretty well. I did not have much luck with the archaic Oxford Dictionary though. I think Minnesota University offers one as well but the parameters confuse me.\n\nI am aware that many words may be one vowel or letter off due to mistranslation or general language shift but this is not often my problem and I will try a couple spellings before giving up but some words just are not on google.",
        "created_utc": 1523497322,
        "upvote_ratio": ""
    },
    {
        "title": "Best Rumi Translation?",
        "author": "eebandflow",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bjq9e/best_rumi_translation/",
        "text": "I wanted to get into some poetry by Rumi. I was wondering who is the best translator for his works. Thank you so much!",
        "created_utc": 1523473956,
        "upvote_ratio": ""
    },
    {
        "title": "What are some classic deconstruction case studies? like classic \"deconstruction-in-action\" text",
        "author": "Rustain",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bijmw/what_are_some_classic_deconstruction_case_studies/",
        "text": "Searching for google only yields article on what deconstruction is, but nothing on deconstruction at work...",
        "created_utc": 1523465112,
        "upvote_ratio": ""
    },
    {
        "title": "What are some literary movements or authors that reject individualism and emphasize interdependence?",
        "author": "timnuoa",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bhoqv/what_are_some_literary_movements_or_authors_that/",
        "text": "",
        "created_utc": 1523458556,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of any good study resources for Romeo and Juliet?",
        "author": "goldenfox4",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bh8bw/does_anyone_know_of_any_good_study_resources_for/",
        "text": "[removed]",
        "created_utc": 1523454903,
        "upvote_ratio": ""
    },
    {
        "title": "Want to do a PhD in Literature – how do I maximize my chances of landing a teaching or research position?",
        "author": "JehovasLastWitness",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bgf6j/want_to_do_a_phd_in_literature_how_do_i_maximize/",
        "text": "I've kind of been back and forth with myself these past years on whether I would try to pursue a PhD in literature. I have an English undergrad degree, and all I want to do is work with literature. \n\nNow, I've heard about the difficulties involved in obtaining work in academia as a post-doctorate, but I recently read [an article](https://blog.jobs.ac.uk/post-phd-life/how-likely-are-you-to-land-an-academic-job/) which claims that there are 3,6 English language and literature PhDs for every teaching and research staff openings. \n\nSo, about a 28-29 % chance of being among the lucky candidates who land a job? \n\nI figure it's worth a shot. \n\nI have two big questions though: I will have to do my masters in Norway, at a fairly inconspicuous university. I'm hoping that getting perfect grades might be enough to get me in the door at some prestigious university in the States where I can hopefully do the PhD part. I guess it's a very particular question, but I hoped someone here would know enough about the matter to tell me if this is even realistic? Or would I definitely have to do my graduate degree in the States if I wanted to move on to a PhD there? \n\nSecondly I was wondering if there are any particular specializations that are more likely to land you a research and teaching position than others? Pre 1800s literature for example? Or something branching into contemporary philosophy of semantics? \n\nAs you probably realize, I'm not very knowledgable about particulars related to pursuing a PhD, so I just wanted to say that I'm extremely grateful to any of you who might take the time to help me on my way.\n\nThanks! \n",
        "created_utc": 1523447206,
        "upvote_ratio": ""
    },
    {
        "title": "Different versions of 'The Last of the Mohicans'?",
        "author": "PotentialSurprise",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bgd5r/different_versions_of_the_last_of_the_mohicans/",
        "text": "I'm working off Peter Barry's essay 'Re‐thinking Textuality in Literary Studies Today', which defines multitextuality as \"the different extant versions of the study text (such as drafts, variants, amended editions and so on)\".\n\nDoes anyone know if there are different versions of James Fenimore Cooper's text 'The Last of the Mohicans'? Not necessarily different published editions, unless there are significant changes, but anything would be useful! Specifically looking for versions of the text here, rather than the film/TV adaptations. Thank you!",
        "created_utc": 1523446564,
        "upvote_ratio": ""
    },
    {
        "title": "Who influenced the style of Virginia Woolf’s novels (particularly To The Lighthouse, Mrs. Dalloway, and The Waves)? Especially The Waves. Also, anything similar to those novels (while not being derivative)? I found Jean Rhys’s Good Morning, Midnight to be similar in tone, but that’s about it.",
        "author": "Woolwoman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bec67/who_influenced_the_style_of_virginia_woolfs/",
        "text": "",
        "created_utc": 1523420087,
        "upvote_ratio": ""
    },
    {
        "title": "Three Musketeers - Dumas Preface",
        "author": "deadashellhp",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bdkhn/three_musketeers_dumas_preface/",
        "text": "I do not understand this sentence:\n\n“In the meanwhile, as the godfather is a second father, we beg the reader to lay to our account, and not to that of the Comte de la Fère, the pleasure or the ennui he may experience.”",
        "created_utc": 1523412188,
        "upvote_ratio": ""
    },
    {
        "title": "for those very familiar with dictionaries, what would you advise would be the most accurate dictionary currently when reading literature, and how various ppl are using their words? (usages of words)",
        "author": "nixos_learner",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8bdh8a/for_those_very_familiar_with_dictionaries_what/",
        "text": "[removed]",
        "created_utc": 1523411303,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know what are the themes in the poem Lord Ullins Daughter by Thomas Campbell",
        "author": "i_am_loki_",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8b6u2p/does_anyone_know_what_are_the_themes_in_the_poem/",
        "text": "[removed]",
        "created_utc": 1523359165,
        "upvote_ratio": ""
    },
    {
        "title": "Myth in Spanish/Hispanoamerican literature",
        "author": "ctormenta",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8b64sb/myth_in_spanishhispanoamerican_literature/",
        "text": "Hello everyone. I have a very veeery specific question about the Hispanic literature. I need an author for my tesina (for my high school graduation). I need to find an author that talked about myth in the 19th or 20th century or around it. The hard thing is that I need myths about the agricoltural life, like myth about the ways to fertilise the lands and so on. If you need any clarification just ask. I really need help for this because even my teacher can't figure it out.",
        "created_utc": 1523349745,
        "upvote_ratio": ""
    },
    {
        "title": "What reading techniques can you recommend?",
        "author": "Seymour_John",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8b5nxr/what_reading_techniques_can_you_recommend/",
        "text": "Is annotating necessary while reading or can I just pause every now and then when reading and summarize to myself what I have read so far? Can you give me some examples of techniques you use to better appreciate a literary work?",
        "created_utc": 1523343066,
        "upvote_ratio": ""
    },
    {
        "title": "In what ways were plebeians UNimportant to the success of leaders in the Roman society depicted in \"Julius Caesar\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8b47ft/in_what_ways_were_plebeians_unimportant_to_the/",
        "text": "[deleted]",
        "created_utc": 1523327104,
        "upvote_ratio": ""
    },
    {
        "title": "Is Rushdie criticizing Fanon when one of his characters in The Satanic Verses says \"These powerless English! - - Did they not think their history would return to haunt them?\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8atyxu/is_rushdie_criticizing_fanon_when_one_of_his/",
        "text": "[deleted]",
        "created_utc": 1523229729,
        "upvote_ratio": ""
    },
    {
        "title": "What does 'self-reflexiveness' mean in the context of post-modernist writing?",
        "author": "Aretasthe17",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8arbtd/what_does_selfreflexiveness_mean_in_the_context/",
        "text": "As the title says, I came across this in an essay and I am not an expert (basically explain to me like I was five please ) :D",
        "created_utc": 1523207483,
        "upvote_ratio": ""
    },
    {
        "title": "Critical material that discusses moving beyond postmodernism",
        "author": "lucidparoxysm",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8aqdtj/critical_material_that_discusses_moving_beyond/",
        "text": "As the title suggests, I wondered if anyone could point me in the right direction in regards to criticism that is engaging with post-postmodernism. I have found Alan Kirby who writes about 'pseudo-modernism' and 'digimodernism', but I would appreciate any other thoughts on the topic. Thanks",
        "created_utc": 1523199054,
        "upvote_ratio": ""
    },
    {
        "title": "How to take notes for memorization when reading?",
        "author": "RawOat",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8aq7ht/how_to_take_notes_for_memorization_when_reading/",
        "text": "I want to start note taking as I feel it would help me memorize what I have read a little more. \n\nBut, I do not exactly know what to write down. Are there any guides out there? What do you guys do?",
        "created_utc": 1523197267,
        "upvote_ratio": ""
    },
    {
        "title": "How do literary critics avoid anachronisms?",
        "author": "EmilyMarsh",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8amu7i/how_do_literary_critics_avoid_anachronisms/",
        "text": "It might be a naive assumption made by someone not too familiar with the field, but it seems to me that the historical context of the critic makes them biased and hinders their effort to understand the work they are analysing in the context in which it was written. Hence, there are observable trends in the history of literary studies and difference in how each work was interpreted by critics of different time periods.\n\nIs this simply an unavoidable case of everyone having their biases? Is the sole purpose of literary studies to understand the work as intended by its author, or is there a legitimate interest in how it may be perceived by current society? Does the evolution of literary theory make it more prone to anachronisms, or is it simply a matter of examining fossiles under modern microscopes?\n\nSorry if it's a silly question, I just couldn't find answers anywhere else.",
        "created_utc": 1523151683,
        "upvote_ratio": ""
    },
    {
        "title": "Whenever you write a paper for something as informal as a colloquium, do you usually get feedback from some professors?",
        "author": "miss-septimus",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8ak5fc/whenever_you_write_a_paper_for_something_as/",
        "text": "Hello there! \n\nI was just curious about this because I just got back from my first experience attending a grad school colloquium for the Humanities. Someone from a different department (Art Studies) told me that she didn't ask any of her professors to read her paper and presentation for the colloquium. This honestly surprised me because I expect getting a professor to read my paper for a conference or a journal submission.This elicited some fear and anxiety in me. \n\nAm I wrong or should research be entirely independent? Aren't journal articles constantly being refined by other scholars' feedback? I'm asking this because term break will be in June, and I'm planning to write some papers for submission to an American Studies conference or for another colloquium of some sort.\n\nI do apologize. I'm currently a month or so away from finishing my first term in grad school. I graduated from the Speech Communication program. I'm now an MA English student, but these programs are housed in the same college. \n\nThank you for any helpful feedback! This subreddit is really one of the most helpful, edifying ones.\n\nEdited: changed the term 'feedback' and rephrased it to one on having professors read papers before a presentation",
        "created_utc": 1523126981,
        "upvote_ratio": ""
    },
    {
        "title": "Having a hard time deciding a topic to write for my final project.",
        "author": "moozart-",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8agv8f/having_a_hard_time_deciding_a_topic_to_write_for/",
        "text": "[removed]",
        "created_utc": 1523090845,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a good introduction to World Literature.",
        "author": "ricouer",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8agtjj/looking_for_a_good_introduction_to_world/",
        "text": "Please recommend some.",
        "created_utc": 1523090074,
        "upvote_ratio": ""
    },
    {
        "title": "[discussion topic] fiction or non-fiction? - graphic novels, first thoughts",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/graphicnovels/comments/8ae6w0/fiction_or_nonfiction/",
        "text": "[deleted]",
        "created_utc": 1523082495,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of an analysis of Billy Budd that draws parallels between Claggart and Frollo?",
        "author": "CaiusCassiusLonginus",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8afe3z/does_anyone_know_of_an_analysis_of_billy_budd/",
        "text": "I'm not a student (literature degree, finished uni long ago), but BB is a big favourite of mine and I realized these two have a lot of similarity. Is there an essay on this? I can't be the only one seeing it. (For clarification: I got the idea from the opera version and Hellfire, not just the books.)",
        "created_utc": 1523070864,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for books or poems written by blind people.",
        "author": "G0lden_Ratio",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8abcy9/im_looking_for_books_or_poems_written_by_blind/",
        "text": "Hey guys! Can you suggest me any books or poems written by blind or visually impaired people?",
        "created_utc": 1523035283,
        "upvote_ratio": ""
    },
    {
        "title": "1 I need some help/hints for my literature class essay. Topic: narrative perspectives in 'Macbeth' and 'Udolpho' and how they affect the texts' presentation of villainy",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8a3h1p/1_i_need_some_helphints_for_my_literature_class/",
        "text": "[deleted]",
        "created_utc": 1522961883,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Bible considered an immutable masterpiece from a literary perspective?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8a10hg/is_the_bible_considered_an_immutable_masterpiece/",
        "text": "I've heard a lot of religious people tell me that the Bible is an unassailable classic from a literary perspective, so I wanted to ask what the general opinion of it was from a relatively unbiased source. Is the Bible an immutable masterpiece? Such as that, if one read it and didn't appreciate it, they could said to be wrong by most objective standards?",
        "created_utc": 1522944649,
        "upvote_ratio": ""
    },
    {
        "title": "Which Dostoyevsky book is most relevant to studying Nihilism?",
        "author": "MinimalMinimall",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89xv56/which_dostoyevsky_book_is_most_relevant_to/",
        "text": "I have a university essay due in a month regarding Dostoyevski and Nietzche's differing views on nihilism, and will likely not be able to read multiple Dostoyevsky books. Currently to me, it seems the brothers Karamazov is the book to go to, but does anyone have any other suggestions? Is notes from the underground at all relevant?\n",
        "created_utc": 1522914888,
        "upvote_ratio": ""
    },
    {
        "title": "How many people here have heard of Will and Ariel Durant's \"The Story of Civilization?\" And would it be a good idea to begin reading this before I begin a long list of classics?",
        "author": "WinterNightThrowaway",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89v3jt/how_many_people_here_have_heard_of_will_and_ariel/",
        "text": "Hello everyone. So, I used to be a reader in high school but after graduating three years ago, I have largely stopped reading for the most part. I want to get into the hobby again because I literally have felt empty these past few years without it. In order to get back into the hobby I have compiled a large list of classics (listed in chronological order) which I want to read and go through. In addition to doing this I am also going to begin keeping a reading journal in order keep track of everything I read and I want to start with these books. \n\nMany people might think me foolish for beginning reading as a hobby with a long list of difficult classics but I want to do so for two reasons: 1) Classical literature is the foundation upon which our contemporary literature is based, and they obviously came first, so I thought it would make sense to begin with them, and 2) I am mainly interested in classic literature and do plan on rereading many of these books throughout my life. \n\nThis is not the point of these questions however. The main thing I wanted to ask is how many people here have heard of a long historical series called \"The Story of Civilization\" by husband and wife historians Will and Ariel Durant? This massively long set of books was given to me as a gift by my grandfather back when I graduated high school and I have not actually read them yet. Since I am interested in history almost as much as I am interested in literature I have thought a lot about first reading these books before I begin my list of classics in order to provide me with an in depth examination of history that will massively aid me when it comes to reading The Bible, Homer, Confucius, Plato, Virgil, Dante, Shakespeare, Voltaire, and all of the other greats. \n\nThe other question I also have to ask in addition to this one though is whether or not this is worth it. The Durants' books were published between 1935-75 so they are, needless to say, out-dated in many aspects. I did some research and discovered that many people like Durant and his work while others do not and even strongly criticize him.\n\nUltimately it comes down to a number of questions. What are your opinions on the Durants' work? And would it be worthwhile to read this massive history series before I begin my list of classics? Or, since I already have a basic understanding of world history and will always use notes and supplementary material when reading, is it worth it to just go ahead and jump into my list of classics and read the Durants' work once I am done? What do you guys all think?\n\nAny answers will be greatly appreciated.",
        "created_utc": 1522887613,
        "upvote_ratio": ""
    },
    {
        "title": "Thesis pre-writing: post modern theorist",
        "author": "moty21",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89uvcp/thesis_prewriting_post_modern_theorist/",
        "text": "Did any of you guys used Baudillard in literary criticism? I'm thinking of applying his thoery of Simulation and Hyperreality on Milan Kundera's Unbearable Lightness of Being. I want some tips or some word of caution, or maybe even related review of literature.\nDon't hold back when you're explaining things.",
        "created_utc": 1522885785,
        "upvote_ratio": ""
    },
    {
        "title": "Texts on the First World War and Ulysses?",
        "author": "AManWithoutQualities",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89rqw0/texts_on_the_first_world_war_and_ulysses/",
        "text": "Hi are there any texts exploring the influence that the shadow of the First World War has on Joyce's Ulysses? Thanks. ",
        "created_utc": 1522864059,
        "upvote_ratio": ""
    },
    {
        "title": "Writing for the modern literary audience and critiques?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89lbvc/writing_for_the_modern_literary_audience_and/",
        "text": "[deleted]",
        "created_utc": 1522807959,
        "upvote_ratio": ""
    },
    {
        "title": "Did Ralph Ellison intentionally name his book Invisible Man similarly to H.G. Wells' book The Invisible Man?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89hy7p/did_ralph_ellison_intentionally_name_his_book/",
        "text": "[deleted]",
        "created_utc": 1522785930,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Works Influenced By Heidegger's Philosophy?",
        "author": "vaginaspektor",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89geck/literary_works_influenced_by_heideggers_philosophy/",
        "text": "After coming across with Taste of Cinema's \"The 10 Best Movies Influenced by Heideggerian Philosophy\", I decided to check Heidegger's philosophy and I was wondering whether there are novels or short stories influenced by Heidegger's philosophy.",
        "created_utc": 1522777417,
        "upvote_ratio": ""
    },
    {
        "title": "\" a child is the father of man\" what does it mean for you?",
        "author": "suma1298",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89ekx8/a_child_is_the_father_of_man_what_does_it_mean/",
        "text": "\" a child is the father of man\" what does it mean for you? can you tell me any personal opinion about this quote ? and why would a man wants to return being a child ? why would you want to return or stay a child ? \n",
        "created_utc": 1522767186,
        "upvote_ratio": ""
    },
    {
        "title": "Poetry dissertation recommendations pls!",
        "author": "Happylittlehead",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/89c4r0/poetry_dissertation_recommendations_pls/",
        "text": "Hi,\nI'm about to start reading for my MPhil dissertation on Lisa Robertson's (the contemporary Canadian poet) poetry/essays. At a very early stage right now, but am generally thinking to write about the female body, desire, 'nilling', phenomenology... \nI'd like to compare her approach to another female English-language poet who focuses on similar concerns... Can anyone recommend someone? \nSo far my ideas have been, maybe, Juliana Spahr (feminism/eco), Andrea Brady (women/motherhood)...\n\nThank you!",
        "created_utc": 1522749866,
        "upvote_ratio": ""
    },
    {
        "title": "Could I Honestly Get Into a Part-Time Grad School?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/896z7d/could_i_honestly_get_into_a_parttime_grad_school/",
        "text": "[deleted]",
        "created_utc": 1522717097,
        "upvote_ratio": ""
    },
    {
        "title": "Extremely Specific Reading Recs: best books if you’re looking for a cathartic cry on an airplane",
        "author": "tinyblinkies",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8956bc/extremely_specific_reading_recs_best_books_if/",
        "text": "[removed]",
        "created_utc": 1522702165,
        "upvote_ratio": ""
    },
    {
        "title": "Literature on Music to Text Transformations?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88zuoo/literature_on_music_to_text_transformations/",
        "text": "[deleted]",
        "created_utc": 1522680520,
        "upvote_ratio": ""
    },
    {
        "title": "What are the greatest English language novels (that you've read)?",
        "author": "BildgeMcNamara",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88zhxg/what_are_the_greatest_english_language_novels/",
        "text": "The Portrait of a Lady - James :\nUlysses - Joyce :\nTo the Lighthouse - Woolf :\nMolloy - Beckett :\nThe Recognitions - Gaddis :\nThe Solid Mandala - White :\nSuttree - McCarthy :\nThe Enigma of Arrival - Naipaul :\nThe Tunnel - Gass :\nDisgrace - Coetzee ",
        "created_utc": 1522677620,
        "upvote_ratio": ""
    },
    {
        "title": "Biblical references/allegories in Barbara Kingsolver’s “The Poisonwood Bible”",
        "author": "make-that-monet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88n4m8/biblical_referencesallegories_in_barbara/",
        "text": "I’m currently reading “The Poisonwood Bible,” but I’m doing it independently for fun rather than for a class. As a result, I’m feeling pretty lost when it comes to the biblical references and allegories that I’m pretty sure are there, and that I’d imagine are pretty important for getting a really good grasp of all the levels the story works on. \n\nI was not raised with any kind of religion—so I’ve never read the Bible—but through a little online research, I’ve been able to determine that each of the main characters’ names has something to do with some biblical/religious story or another. I decided to come here because I have a few questions, but I’m only about 100 pages in, so I didn’t want to risk googling specific characters from TPB for fear of coming across spoilers. I just wanted to check in on a few things in the hopes that I’d read the rest of the book with a clearer focus and understanding:\n\n- Leah says early on that her sister Rachel’s middle name is Rebeccah, so “she feels free to take after Rebekah, the virgin at the well.” Does this mean Rachel’s character is more directly related to the Rebekah from the Bible, or does she just like to see herself that way, and is actually more like Rachel from the Bible after all? Or is she both? (I’m trying to figure this out so I have a better idea of which woman to look into when doing the background research).\n\n- Is Orleanna’s name derived from the Maid of Orlean, Joan of Arc? Is that something I should keep in mind when looking at her character?\n\n- When I went looking into Adah, I found that there were 2 main ones that came up: One who “gave the world its first musician,” and one who “became a grief of mind.” Is Kingsolver’s Adah supposed to be a mix of the two, or is her deformity and refusal (so far) to speak an ironic reference to the Adah who gave the world a musician? \n\n- I’m pretty familiar with the story of Cain and Abel—I’ve read “East of Eden” several times and had to research the biblical background pretty thoroughly to get a good handle on it. Are Leah and Adah, in addition to being named after other characters from the Bible, a Cain and Abel-type pair? I only ask because they talk about how Leah’s so perfect and loves her father, while Adah is considered deformed and kind of rebellious in the way she keeps to herself and doesn’t really care about being dammed or whatever.\n\nHonestly, if anyone has any ideas or sources they could point me to that might clear some stuff up, that’d be great. As I said, I’m not very far into the book and I’m really enjoying it, so I don’t want to go searching and stumble on spoilers. I’m really just looking for a few answers to guide my research a little so that I’ll end up with a better understanding of all the different allegories and influences on TPB as I go along. Thank you!",
        "created_utc": 1522543967,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why Communism doesn't work\" as written by a Marxist/Socialist, any choice texts?",
        "author": "dyvog",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88loxd/why_communism_doesnt_work_as_written_by_a/",
        "text": "Hello!\n\nI'd be very interested in reading some about the failures of communism, the nation states that adopted it, etc. But I'd  like to read it from a Marxist perspective, not from a gloating standpoint. Anything come to mind?",
        "created_utc": 1522530500,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice - English lit student feeling like I've lost love for my passion",
        "author": "cryerrytiem",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88l290/looking_for_advice_english_lit_student_feeling/",
        "text": "Hi! Sorry to bother you all - long time lurker, first time poster! \n\nTo give you all the tldr background - I've loved literature and storytelling for as long as I can remember, and I like to think I'm pretty good at studying it! However, since starting university with an English Lit major in Wales, I feel like I hate reading. It's hard to keep my focus, to get into a book, to WANT to read anymore. I genuinely feel like it's a chore. I listen to all non-course books as audiobooks now to better enjoy them.\n\nIs there any advice from people who have been in situations similar (or just an outsider looking in) that anyone can offer? \n\nThank you!! &lt;3",
        "created_utc": 1522524822,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for recommendations:American texts (especially poetry) that lends themselves to ecocriticism or climate-change readings?",
        "author": "the_doctoress",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88ig2d/looking_for_recommendationsamerican_texts/",
        "text": "I am specifically looking to do an analysis of American ecocritical texts with respect to American myths of the land (Manifest Destiny etc). \n\n*lend",
        "created_utc": 1522500960,
        "upvote_ratio": ""
    },
    {
        "title": "Question about writting about specific group of writters",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88ec3z/question_about_writting_about_specific_group_of/",
        "text": "If i want to writte the history of a group of poets from south america, this means to research their works and comment on their common characteristics as the style and themes, but also maybe about their relationships, would this be a work of literary studies or a work of History?\n\nDo any of you good book reccomendations for this kind of work? thanks\n\n",
        "created_utc": 1522449242,
        "upvote_ratio": ""
    },
    {
        "title": "Where Shall Wisdom Be Found",
        "author": "chaosgems",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88c7uz/where_shall_wisdom_be_found/",
        "text": "[removed]",
        "created_utc": 1522431825,
        "upvote_ratio": ""
    },
    {
        "title": "Must All Contemporary Fiction be so Self-Aware?",
        "author": "stooster99",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/88b0mm/must_all_contemporary_fiction_be_so_selfaware/",
        "text": "Correct me if I am misled, but it seems to me that for a work of contemporary fiction to have staying power, it must to some degree be \"self-aware.\"\nLet me explain what I mean by this. Take Nabokov's *Pale Fire*, for instance. The work pokes fun at the idea of artistic criticism. Meanwhile, the novel itself is structured as a piece of artistic criticism, (a poem followed by a commentary) and for years after its publication, it has lent itself to loads of artistic criticism. It prods and laughs at that which its own elegance of form invites! \n\nOr take Stoppard's *Rosencrantz and Guildenstern are Dead*. Here is a play about two goofballs walking around a play. Throughout the play, the audience is teased. We the audience begin to wonder: Do these characters know they are being watched?\n\nThis is a trend that I'm sure is well-documented in literary studies, but my basic question is this: Why aren't we simply satisfied with a good story anymore? A storyteller in the vein of Dickens or Trollope would no doubt be respected as a good writer today, but would this storyteller's work be remembered in seventy years, if it simply dwelt on plot and made no efforts to wink at the reader? \n\nOur conception of reality is man in a hall of mirrors gazing at endless simulacra of himself. If a work of art wishes to have staying power, it must reflect this contemporary reality by functioning to some degree as a criticism of itself. It seems a genuine, innocent story is no longer enough to satiate us. Is this a real trend, or am I exaggerating?",
        "created_utc": 1522422460,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for some good twitter profiles about literature. Any recommendations ?",
        "author": "ZiggyStarmate",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/882msw/im_looking_for_some_good_twitter_profiles_about/",
        "text": "",
        "created_utc": 1522340651,
        "upvote_ratio": ""
    },
    {
        "title": "What are some subjects/styles you might consider too \"pop\" as depicted by perceived trends in American literary novels being published today?",
        "author": "BookishRipple",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87xmaq/what_are_some_subjectsstyles_you_might_consider/",
        "text": "I love gossip, that's all it is. Curious about the murmurings anyone might have on this subject. Frankly, I think a lot being published by writers coming out of the MFA machine assembly line reads fairly tone-death of globalizing aesthetics (namely, things that might remotely be considered for the Nobel Prize). Or, on the subject of experimental literature, which my professor once famously described as \"it tends to call itself experimental because its own experiment failed.\" ",
        "created_utc": 1522288979,
        "upvote_ratio": ""
    },
    {
        "title": "Textual Intervention",
        "author": "mattflint42",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87xfrm/textual_intervention/",
        "text": "Hey guys,\n\nSo it appears everyone was confused when I used the word 'text transformation' only to find out the appropriate naming is 'text intervention'. On that note, does anyone have any short stories, poems, songs or even mythology that is appropriate and open to textual intervention? This could include transforming the text to contempary setting etc.\n\n\nCheers",
        "created_utc": 1522287282,
        "upvote_ratio": ""
    },
    {
        "title": "Foundational Texts for Performance Studies",
        "author": "asametrical",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87wf22/foundational_texts_for_performance_studies/",
        "text": "I’m going to more time for extra reading after the semester ends and I’m hoping someone here can recommend me some texts that would provide a good intro to performance studies? I’m more interested in complete book-length works than anthologies. Thanks!",
        "created_utc": 1522278116,
        "upvote_ratio": ""
    },
    {
        "title": "recommendations please: fiction relating to \"the uncanny\", the foreigner and landscape",
        "author": "stateless52",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87rxm0/recommendations_please_fiction_relating_to_the/",
        "text": "I'm looking for fiction recommendations for my dissertation (English Lit). \n\nI have to write about something related to \"the uncanny\" (Freud) and I wanted to talk about this in relation to the strangeness of the foreigner in relation to landscape. So any books relating to displaced persons... travelers amidst nature and what it means to forge an identity aided by one landscape and feel strange amidst another. \n\nsomething like Walden by Thoreau (i don't think this is 'strange' enough though)\n\nnothing war related please. \n\nthanks!",
        "created_utc": 1522244080,
        "upvote_ratio": ""
    },
    {
        "title": "Digital Reading Group for Postmodernism",
        "author": "Writing_Weird",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87ko2t/digital_reading_group_for_postmodernism/",
        "text": "Hi all,\n\nI want to begin a digital reading group for the month of April '18 for Jameson's *Postmodernism*! Now, the way I picture this would be an interdisciplinary approach to the reading group. Or, as interdisciplinary as lit studies can get recruiting people from reading. Ideally, we could have people from various periods and literatures each speaking about the way their -field- utilizes the text or sections of the text. So, each week we'd read about 3 chapters and then have a discussion on Friday-Sunday utilizing a Google Doc I can create and manage. Throughout the week, participants can post questions or passages they find particularly difficult. \n\nI'd like to have two groups of people: participants, or those who don't feel a sense of mastery over their field or the text itself (I totally fall into this category and would like to act more as an administrator) and facilitators, or those who feel they can pretty accurately represent their field and have experience with this text.\n\nThe role I imagine facilitators playing involves posing thought provoking questions, interesting passages, the way they themselves or people in their field have taken up particular passages within the text and utilizing it at the end of the week in *short* 100-350 word passages. It's then up to the discretion of the facilitators to either answer questions/engage the discussion in the google doc, or to allow the discussion to evolve organically. One way this could be particularly rewarding to facilitators is the workshopping of ideas related to this text. If you're working on an article or maybe diss chapter it could be helpful to get feedback on ideas from a variety of people in various disciplines. I'm not sure how I feel about monetary awards, as I'm particularly broke at the moment. But, maybe we can crowd-source donations for amazon gift cards or something of that nature. \n\nI've broken up the chapters into the following order for the month of April: \n\n\nWeek1\n\n\nIntroduction,\n\n\n1 The Cultural Logic of Late Capitalism,\n\n\n2 Theories of the Postmodern,\n\nWeek2\n\n\n3 Surrealism without the Unconscious,\n\n\n4 Spatial Equivalents in the World System,\n\n\n5 Reading and the Division of Labor,\n\nWeek 3\n\n\n6 Utopianism after the End of Utopia,\n\n\n7 Immanence and Nominalism in Postmodern Theoretical Discourse,\n\n\n8 Postmodernism and the Market,\n\nWeek 4 \n\n\n9 Nostalgia for the Present,\n\n\n10 Secondary Elaborations, \n\nPlease comment below if you're interested with your field, your choice of participant or facilitator, and if facilitator-- what week you're interested in taking over. As I come to think of it, there really is no limit to how many facilitators can sign up per week! It would be cool to have a smorgasbord of approaches! I'm really hoping for critical race/gender academics out there interested in approaching this text! Last note! Please bring a work of fiction in mind that you can discuss with! And spread the word to your colleagues! ",
        "created_utc": 1522174190,
        "upvote_ratio": ""
    },
    {
        "title": "I'd like to learn everything I can about Gustave Flaubert's work",
        "author": "Write_Write_Write",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87kfpw/id_like_to_learn_everything_i_can_about_gustave/",
        "text": "I would like to know more about Flaubert's writing style, his personal writing process, analyses/criticism of his work, a great biography book on him, his literary influences, and even any personal opinions/philosophy/advice on literature/art/life. \n\n\nIn case you're wondering, I'm deep into Madame Bovary, and as an aspiring writer I'm taking very detailed notes about every single page of his work and to me it is flawless, it is everything I want out of literature. And his quotes when you google \"Gustave Flaubert quotes\" are so exciting to me.\n\n\nThank you so much!",
        "created_utc": 1522172566,
        "upvote_ratio": ""
    },
    {
        "title": "What type of poetry does Margaret Atwood write?",
        "author": "calerydeux",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87k5fu/what_type_of_poetry_does_margaret_atwood_write/",
        "text": "I’m not very well-read in terms of modern poets, and I have a very hard time not seeing modern poetry as one big lump. What movement does Atwood’s poetry belong to? ",
        "created_utc": 1522170507,
        "upvote_ratio": ""
    },
    {
        "title": "The Texts About Post-Colonialism To Read The Left Hand of Darkness",
        "author": "vaginaspektor",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87ih5u/the_texts_about_postcolonialism_to_read_the_left/",
        "text": "I am planning to write a paper Le Guin's The Left Hand of Darkness and I will read it through post-colonialism and gender. However, I am not familiar with post-colonial studies. Any book, article to help me to relate these studies to the novel?",
        "created_utc": 1522157925,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Postcolonialism",
        "author": "Cedamihn",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/87bhf8/question_about_postcolonialism/",
        "text": "My professor ended last week's lecture with saying something like \"Postcolonialism is characteristic of whiteness.\" As far as I know imperialism and colonization are not unique to the west. Could someone more experienced in this field than me elucidate the reasoning behind this? I'm sure this is a dumb question and that it's been asked before but I can't find anything about it.",
        "created_utc": 1522089283,
        "upvote_ratio": ""
    },
    {
        "title": "Literature for Text Transformation",
        "author": "mattflint42",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8756m5/literature_for_text_transformation/",
        "text": "Hey guys,\n\nDoes anyone have any goods older short stories, poems or songs that could be open for a modern day text transformation?\n\nCheers",
        "created_utc": 1522025435,
        "upvote_ratio": ""
    },
    {
        "title": "Why does Literary Studies continue using debunked theories like Freud/Jung/Lacan?",
        "author": "fortythousandyearsof",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/871mlq/why_does_literary_studies_continue_using_debunked/",
        "text": "Psychoanalysis is considered to be junk science, and is not taken at all seriously by psychologists and hasn't been for a long time. Even if you look at, say, Freud, he falsified research, made stuff up, didn't follow the scientific method, and so on, and therefore his \"theories\" have more in common with fiction than anything that could be called science or a description of reality or true in any meaningful sense.\n\nIt seems obvious that if you then use those baseless/junk theories as a foundation of your analysis of a text, your analysis is also baseless/junk.\n\nSo why the continued popularity of psychoanalytic theory as a basis of literary criticism? Is literary studies just that out of touch with the science that they think this stuff has the slightest shred of credibility/validity (which it does not)?\n\nWhy can't we just dismiss every analysis based on Freud as junk on the basis that Freud is junk and so anything based on Freud is also junk?",
        "created_utc": 1521994010,
        "upvote_ratio": ""
    },
    {
        "title": "DFW",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/871jsj/dfw/",
        "text": "[deleted]",
        "created_utc": 1521993376,
        "upvote_ratio": ""
    },
    {
        "title": "How to stay academic when out of academia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8702xo/how_to_stay_academic_when_out_of_academia/",
        "text": "[deleted]",
        "created_utc": 1521976287,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone know of a \"canon\" of 25-50 novels since 2000 or 2010?",
        "author": "jsbnb",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86yq2k/anyone_know_of_a_canon_of_2550_novels_since_2000/",
        "text": "Considering applying for MFA or MA programs.  Was wondering if there is a sort of \"canon\" for more contemporary writing.  I feel like my knowledge of the \"big stuff\" starts to drop off around early 1990s.",
        "created_utc": 1521953744,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to apply literary criticism to XXX rated material?",
        "author": "hailrazers",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86rf2y/is_it_possible_to_apply_literary_criticism_to_xxx/",
        "text": "Or more to the point can erotic material, even if not able to be categorised as art, still make valid commentary on the real world and in turn be subject to literary criticism, deconstruction and analysis?\n\nAsking in reference to a transformation fetish comic that inexplicably reminded me of Franz Kafka.",
        "created_utc": 1521873479,
        "upvote_ratio": ""
    },
    {
        "title": "Secondary/applied reading of Jameson's theory of postmodernism?",
        "author": "DanyisBlue",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86l19o/secondaryapplied_reading_of_jamesons_theory_of/",
        "text": "I'm currently having a bit of trouble fleshing out my understanding of Jameson's theory in \"The Cultural Logic of Late Capitalism\" given how wonderfully straightforward (/s) his writing is. Usually I would look at how other writers have approached or used the theory to develop a more nuanced understanding of that theory, but I'm having real trouble find articles/books that deal directly with Jameson's theory. \n\nAny help would be very much appreciated. \n\nThanks! ",
        "created_utc": 1521815278,
        "upvote_ratio": ""
    },
    {
        "title": "School essay help",
        "author": "Spafght",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86j442/school_essay_help/",
        "text": "[removed]",
        "created_utc": 1521793971,
        "upvote_ratio": ""
    },
    {
        "title": "what defines a genre?",
        "author": "ppbrrro",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86hy6t/what_defines_a_genre/",
        "text": "I've got in this discussion with a friend about this topic multiple times, basically he says that all genres are define about what is the the plot of it and how you tell it but i am of the idea that the definition of a genre depends of the genre since what makes speculative fiction what it is is the setting where the story takes place no matter what the plot of the characters on it are or do, but he tells me the plot still defines the genre because the world is a reflection of the inner world of the character, he makes the example of a Neanderthal in our world would be a fantasy story and almost all stories who deals with the mono-myth(as a psychological journey more than a physical one) are fantasy, but we aren't expert on the topic and no one can convince the other, so we would like to have your input about this to settle it once and for all.\n\n\nThanks, and sorry for bad english :)",
        "created_utc": 1521778574,
        "upvote_ratio": ""
    },
    {
        "title": "What DC &amp; Marvel superhero runs are as intelligent and ambitious as Karen Berger's Vertigo titles and Alan Moore's Watchmen?",
        "author": "OCD_Geek",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86g0gq/what_dc_marvel_superhero_runs_are_as_intelligent/",
        "text": "Hey, everyone. I've finally made the jump into comics and have been blown away by Karen Berger's Vertigo superhero titles (Moore's Swamp Thing, Gaiman's The Sandman, Death &amp; The Books of Magic, Delano, Ennis &amp; Ellis's Hellblazer, Carey's Lucifer, Wagner &amp; Seagle's Sandman Mystery Theatre #1-52, Morrison's Animal Man &amp; Doom Patrol and Milligan's Shade, The Changing Man #1-50) as well as Alan Moore's Watchmen.\n\nWhat DC and Marvel superhero runs would you consider cut from the same cloth in terms of intelligence and ambition? Ostrander's The Spectre and Robinson's Starman seem to usually be mentioned in the same breath as those works. Is there anything else that you'd recommend?\n\nNOTE: If you feel this post isn't appropriate for this subreddit and want it deleted, I completely understand. I just wanted to cast as wide a net as possible to achieve a more robust response with more diverse points of view than posting solely in the comic book, DC and Marvel subreddits would have provided.",
        "created_utc": 1521760125,
        "upvote_ratio": ""
    },
    {
        "title": "Why does \"Tristram Shandy\" namedrop so much?",
        "author": "grinter_haha",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/86actt/why_does_tristram_shandy_namedrop_so_much/",
        "text": "Due to virtually no knowledge of other novels during this period I cannot tell whether all the namedropping of philsophers, writers, scientists, etc. in the book is either a commonplace thing for that time or to show how well-read characters are (or to show their pretentiousness). ",
        "created_utc": 1521713007,
        "upvote_ratio": ""
    },
    {
        "title": "Has anybody here used Bakhtin's theory of Dialogism in their research?",
        "author": "Gregory_Neil",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/869vt4/has_anybody_here_used_bakhtins_theory_of/",
        "text": "and if any of you have, what are the procedures? how did the study go?",
        "created_utc": 1521706257,
        "upvote_ratio": ""
    },
    {
        "title": "World View / Text Centred Criticism",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/867o4b/world_view_text_centred_criticism/",
        "text": "[deleted]",
        "created_utc": 1521681018,
        "upvote_ratio": ""
    },
    {
        "title": "Fictional universes as imaginary spaces - a way of thinking about adaptations.",
        "author": "Secretalias666",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/8634u2/fictional_universes_as_imaginary_spaces_a_way_of/",
        "text": "Hi there, \n\nI’m studying adaptations at the moment, and we’re encouraged not to think of them in terms of a hierarchy, fidelity and so forth. I’m finding I’m increasingly attracted to the idea that a work of fiction is a representation (?) of events which take place in a particular imaginary space. (Be it in the mind of the author, a team, or a whole subset of society even) This seems natural, as are comfortable talking about, say, ‘The Marvel Universe’.\n\nAre there any critics who talk about this in this way, and explore this idea? \n\nMany thanks! ",
        "created_utc": 1521647392,
        "upvote_ratio": ""
    },
    {
        "title": "How, if at all, does the field of psychoanalytic criticism today account for the fact that Freudian analysis is now seen as scientifically unproven and outdated?",
        "author": "tomayeto",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85z7ee/how_if_at_all_does_the_field_of_psychoanalytic/",
        "text": "Psychoanalysis is an incredibly valuable tool for understanding the works of authors influenced by Freudian thought, but what about pre- and post-Freudian authors? Seeing that psychology now rejects his theories, is it erroneous to look at authors uninfluenced by Freud through the lens of his often invalid theories? Obviously, literary studies is not a scientific endeavor, but do you think a line should be drawn here? I'm open to debate.",
        "created_utc": 1521604181,
        "upvote_ratio": ""
    },
    {
        "title": "Good edition(s) of Christopher Marlowe's plays?",
        "author": "unicyclebear",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85ykoz/good_editions_of_christopher_marlowes_plays/",
        "text": "Howdy. I'm on the hunt for a good edition of Marlowe's plays (and, really, any non-Shakespeare Early Modern Drama); I've enjoyed the Oxford World's Classics editions of Webster's and Ford's plays, but I'm *really* not a fan of the endnotes. Is there anything in the vein of Norton's Complete Works or Arden Shakespeare for Marlowe's plays?\n\nI was just looking at New Mermaid, but Amazon wouldn't let me look inside to see what the notes are like.\n\nA good edition of *Arden of Faversham* would be nice as well :)",
        "created_utc": 1521597997,
        "upvote_ratio": ""
    },
    {
        "title": "Is it stupid to begin reading as a hobby by starting out with a long list of classics?",
        "author": "WinterNightThrowaway",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85yiz5/is_it_stupid_to_begin_reading_as_a_hobby_by/",
        "text": "Hello everyone.\n\nLet me start off by saying that in high school I was a big reader and regularly read a lot of books throughout my high school years. Since graduating three years ago though, do to being distracted and unfocused, I have largely given up on reading as a hobby and now do not often engage in the activity. I do however plan to get back into reading once again and I wanted to ask you guys for advice about something when it comes to this.\n\nAlthough I have always been a fan of books classic literature has had the number 1 spot in my heart for a long time. A few months ago I was thinking about creating a Goodreads account and getting back into reading again by starting with some easy/contemporary authors, like J.K. Rowling for example. I felt like before I got into reading classic literature I should start off by reading some easier works first so that that way I can work myself up towards the more difficult books.\n\nLately, however, I have been thinking about reading the classics first before I begin reading the contemporary books of today's era. I have compiled a large list of more than 130 classic authors ranging from Homer, Plato, Aristotle, Virgil, Dante, Cervantes, and Shakespeare, to more modern authors like Poe, Dickens, Tolstoy, Dostoevsky, Twain, Nietzsche, Joyce, and dozens more. If you interested at all you can look up a book called \"The New Lifetime Reading Plan,\" by Clifton Fadiman and John S. Major, as this is the list I am going by although I am changing it a bit and adding some more authors I feel should be on there. Even before I begin going through this list I plan on first reading the famous historical series \"The Story of Civilization\" by academics Will and Ariel Durant. That way, I will get a good review of history which will provide me with a great overview that will help me in tackling this list of classics I have chosen.\n\nI want to get back into reading again by beginning with classic authors not only because I enjoy classic literature the most but also because I feel as though classic literature is the foundation upon which our contemporary literature is based. Reading through this list will not only educate and entertain me will also help me to understand contemporary literature and today's books even more. Another part of me, however, says that starting off with the classics is a bad idea because some of these books are no doubt too complicated for me right now to comprehend and that I should begin with more contemporary books because they are easier.\n\nWhat are your opinions on this? Am I stupid for doing this or is this okay?",
        "created_utc": 1521597546,
        "upvote_ratio": ""
    },
    {
        "title": "How can I differentiate my own research if my essay topic has already been discussed?",
        "author": "tomayeto",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85u5sx/how_can_i_differentiate_my_own_research_if_my/",
        "text": "I was interested in analyzing Shakespeare's Titus Andronicus from a New Historical standpoint, assessing possible connections to the conflict of royal succession during the War of Roses. However, when I searched for New Historical essays on the play on the MLA International Database, the same exact topic was one of the first results. What are some ways that you've found help you to mark your own niche or give your own perspective when your research has been done before? Advice or criticism on my specific topic is certainly appreciated, but more general answers are equally welcome.\n\nEdit: I was also interested in looking into the play's extensive focus on virginity and bastardy in connection to Queen Elizabeth, the \"Virgin Queen\". I'm not sure if this would be a viable avenue, or if it would make sense given the fact that Shakespeare (to my understanding) had very admirable views towards her? ",
        "created_utc": 1521564006,
        "upvote_ratio": ""
    },
    {
        "title": "Terminology question",
        "author": "shalomcruz",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85t81k/terminology_question/",
        "text": "Hi all. This has been vexing me for years: is there a specific literary term for the closing passage of a novel? For instance, from *Middlemarch*: \"[T]he growing good of the world is partly dependent on unhistoric acts; and that things are not so ill with you and me as they might have been is half owing to the number who lived faithfully a hidden life, and rest in unvisited tombs.\" Another example might be the final line from *The Great Gatsby*.\n\nIs there even a term for this? Obviously, elegy is inappropriate, as it refers specifically to poetry. In any case, appreciate your feedback.",
        "created_utc": 1521556948,
        "upvote_ratio": ""
    },
    {
        "title": "Text Transformations in Literature",
        "author": "mattflint42",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85q7rc/text_transformations_in_literature/",
        "text": "[removed]",
        "created_utc": 1521522115,
        "upvote_ratio": ""
    },
    {
        "title": "How do you know you have gotten enough out of a book you read?",
        "author": "RawOat",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85p0im/how_do_you_know_you_have_gotten_enough_out_of_a/",
        "text": "I have read war and peace, but it seems that I can only recall vague detail.\n\nWhat am I doing wrong? ",
        "created_utc": 1521509773,
        "upvote_ratio": ""
    },
    {
        "title": "Which Proust translation is best for beginners?",
        "author": "dtkleiner",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85noma/which_proust_translation_is_best_for_beginners/",
        "text": "I'm about to start reading Proust's In Search of Lost Time but I'm overwhelmed by all the available translations...\nI've heard that Lydia Davis' translation of Swann's Way is great for those who plan on just reading Volume I... But I'd like to read all the books in ISLT (or attempt to at least)... Should I just start with the revised Montcrieff translation? Or start with Davis' and then switch to Montcrieff's?",
        "created_utc": 1521498484,
        "upvote_ratio": ""
    },
    {
        "title": "What is the earliest example of a 'shared universe' in fiction?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85m7o5/what_is_the_earliest_example_of_a_shared_universe/",
        "text": "[deleted]",
        "created_utc": 1521487372,
        "upvote_ratio": ""
    },
    {
        "title": "What is it called when referring to the moon in writing?",
        "author": "MeenaBeti",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85ixj3/what_is_it_called_when_referring_to_the_moon_in/",
        "text": "I heard about a literary technique, especially used in gothic ficiton, where the writer references the moon in their writing. Does this technique have a particular name?",
        "created_utc": 1521461010,
        "upvote_ratio": ""
    },
    {
        "title": "Why the term \"comparative literature\" isn't suited?",
        "author": "Sometimes_a_smartass",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85hwrl/why_the_term_comparative_literature_isnt_suited/",
        "text": "Greetings. I'm currently enrolled into a comparative literature and literary theory class, and i have a question that i can't seem to find in my notes. \n\nanyway, the question is in the title. Why the term isn't suitable for what it actually does? Why do other languages, like french have better (or worse) names for it? \n\nif anyone can help me with this, i would greatly appreciate it.",
        "created_utc": 1521447660,
        "upvote_ratio": ""
    },
    {
        "title": "Memoirs that include snippets of diary entries?",
        "author": "Timberdoodler",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85cs69/memoirs_that_include_snippets_of_diary_entries/",
        "text": "Hi all,\n\nI'm wondering if anyone knows about any memoirs that include snippets of diary entries. So, it would be like a memoir that at certain points in the text also has pieces of diary entry, probably from the author but not necessarily, interwoven into the prose. Anyone know any?\n\nThis would be for a research project that analyses how diary writing is incorporated into the memoir genre.\n\nThank you!",
        "created_utc": 1521395156,
        "upvote_ratio": ""
    },
    {
        "title": "Any recommended Bildungsroman novels?",
        "author": "Heaalyn",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85blau/any_recommended_bildungsroman_novels/",
        "text": "Hi, I’m doing an essay on Flowers for Algernon, and I was wondering if there’s any other similar novels I could use as a secondary source to compare the characterization of the main protagonist. There are many  Bildungsroman novels out there, so I’m searching for one that could potentially fit in well when comparing with the protagonist. Thanks!",
        "created_utc": 1521384002,
        "upvote_ratio": ""
    },
    {
        "title": "How can I find contemporary sources?",
        "author": "Secretalias666",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/85abgk/how_can_i_find_contemporary_sources/",
        "text": "Hi there,\n\nI’m at uni, so I have access to JSTOR and a whole boatload of other stuff, but I’m not sure where to look. I’m doing an essay on how Victorian literature (The Moonstone and Great Expectations) represents criminality, and how Victorian assumptions are upheld or subverted. I’d like to engage with some contemporary sources about both the works themselves, and criminality in Victorian England. \n\nHow do I find these? \n\nHas anyone got any suggestions for potentially useful works?\n\nMany thanks! ",
        "created_utc": 1521365827,
        "upvote_ratio": ""
    },
    {
        "title": "[Help]Essays of 20th or 21st centuries with the theme of a city/urban culture?",
        "author": "co-axed",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/856i96/helpessays_of_20th_or_21st_centuries_with_the/",
        "text": "Hi everyone!\nI am trying to find interesting essays in European languages including English (mid. 20th-21st c.) with the dominant theme of city, urban life, daily routines, celebrations etc. I would grateful for any suggestions! Maybe you happen to love an essay just like that (or a piece of poetry)",
        "created_utc": 1521319045,
        "upvote_ratio": ""
    },
    {
        "title": "Hemingway, Capote, Manic Pixie Dream Girls",
        "author": "Fraxalato",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84szbk/hemingway_capote_manic_pixie_dream_girls/",
        "text": "[removed]",
        "created_utc": 1521175775,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good sources for Yeats criticism?",
        "author": "blazes-boylan",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84s4wt/what_are_some_good_sources_for_yeats_criticism/",
        "text": "the title.",
        "created_utc": 1521166801,
        "upvote_ratio": ""
    },
    {
        "title": "The medieval Greek poem-Digenis Akrites",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84pdvg/the_medieval_greek_poemdigenis_akrites/",
        "text": "[deleted]",
        "created_utc": 1521143360,
        "upvote_ratio": ""
    },
    {
        "title": "Works of literary criticism most useful to fiction writers?",
        "author": "tyrannus19",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84o71q/works_of_literary_criticism_most_useful_to/",
        "text": "I'd give as a good example The Rhetoric of Fiction, by Wayne C. Booth. Intensely learned, but also interesting and useful to a writer.",
        "created_utc": 1521134395,
        "upvote_ratio": ""
    },
    {
        "title": "Essays on Literary Criticism",
        "author": "Robojop",
        "url": "https://www.reddit.com/r/literature/comments/84ku8j/essays_on_literary_criticism/",
        "text": "",
        "created_utc": 1521125987,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion of William T. Vollman? How is he perceived in academia?",
        "author": "grinter_haha",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84lspw/what_is_your_opinion_of_william_t_vollman_how_is/",
        "text": "",
        "created_utc": 1521114054,
        "upvote_ratio": ""
    },
    {
        "title": "[X-Post /r/books] Literary Studies: Perspective",
        "author": "vincoug",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84lfe5/xpost_rbooks_literary_studies_perspective/",
        "text": "I'm from /r/books and we're starting a new feature today: Literary Studies.  I'd like to invite anyone over who wants to join in our discussion.  Our topic this week is [perspective](https://www.reddit.com/r/books/comments/84l3ep/literary_studies_perspective_march_2018/).",
        "created_utc": 1521109484,
        "upvote_ratio": ""
    },
    {
        "title": "Tattoos in Victorian fiction",
        "author": "FredrikBlanc",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84h8y7/tattoos_in_victorian_fiction/",
        "text": "Hi everyone,\n\nI am looking into tattoo practices and representations within literature and culture from a Gothic frame of reference (hopefully, as a starting point for a PhD). I’m trying to find instances of tattoos representations in 19th and early 20th century fiction (I already have a few, like Moby Dick, Mr Meeson’s Will, and the Penal Colony), Do you have any other example that comes to mind, however minute?\nThanks in advance!",
        "created_utc": 1521063899,
        "upvote_ratio": ""
    },
    {
        "title": "How do you find a research area?",
        "author": "ricouer",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84g0x2/how_do_you_find_a_research_area/",
        "text": "I want to go into a PhD program after I finish my MA, but I have not decided on a concrete proposal yet. To be honest, I don't even know what to do.\n\nMy problem is that despite being a literature grad I don't read that much fiction. Most of my reading is non-fiction. I enjoy reading political philosophy mostly. Is there a field in literature that would allow me to explore political questions, such as questions of nationhood, citizenship, space/spatiality, to whom a space belongs, national identity etc? What author/time period/genre is particularly fruitful for political readings like this?\n\nI enjoy analysing literature, and I enjoy discussing it in class. I'm sure I would enjoy teaching, its just research that has me stuck.\n\nPlease help.",
        "created_utc": 1521054500,
        "upvote_ratio": ""
    },
    {
        "title": "Referencing Query",
        "author": "m0nst3r666",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84f851/referencing_query/",
        "text": "First of all I apologise if this isn’t the correct subreddit but seeing as I’m writing a literature essay it seemed like the best place to go. \nI’m writing about the Uncanny in Katherine Mansfield’s ‘At the Bay’ and I was reading an article about Mansfield’s writing that used a very good Freud quote, is it plagiarism for me to use the same Freud Quote and copy the footnote/bibliography for that quote? I wanted to be absolutely certain as the last thing I want to do is plagiarise!!\nThanks in advance ",
        "created_utc": 1521048636,
        "upvote_ratio": ""
    },
    {
        "title": "Books On Creative Writings ?",
        "author": "farhan206",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84d4tx/books_on_creative_writings/",
        "text": "I'm looking for interesting books dealing with creative writing. For instance, the books about how to write book reviews or creative articles.\nCould you please suggest me such books ? ",
        "created_utc": 1521031918,
        "upvote_ratio": ""
    },
    {
        "title": "Luck and Decadence",
        "author": "chaosgems",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/84cr70/luck_and_decadence/",
        "text": "Hello, everyone! I'm working on a project for a PhD in Literary Theory and I came up with this theme: the idea o luck in decadence. It has to do with Baudelaire's \"Le joeur generaux\", a portuguese poet's will to be surprised and even Lucretius' idea of 'clinamen' in the start of «De rerum natura». Would you mind giving me some advice on what should I explore or search for, any newer and good books on decadent poetry? What kind of books would you suggest to research on these themes (like Foucault's «Folie et Déraison»).\nI'm leaning towards focusing on the works of Walter Pater, Oscar Wilde, Charles Baudelaire, Huysmans, D'Annunzio and Camilo Pessanha. ",
        "created_utc": 1521028213,
        "upvote_ratio": ""
    },
    {
        "title": "How do you pronounce Toril Moi's name?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/844d3u/how_do_you_pronounce_toril_mois_name/",
        "text": "[deleted]",
        "created_utc": 1520949802,
        "upvote_ratio": ""
    }
]