[
    {
        "title": "Heart of Darkness and Nihilism",
        "author": "GangaDin",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4bjc1q/heart_of_darkness_and_nihilism/",
        "text": "I have recently ventured in to Heart of Darkness but through an odd portal. I've been try to wrap my head around nihilism, that is the implications existentially, what I make of it as far as my choices. Also, I'm trying to frame historically and understand why it arose. What historical backgrounds brought this idea to light during the late 19th century. Incidentally, Conrad looks to be doing the same thing. I've been led into Heart of Darkness because I've been led to believe that Conrad answers both of these questions. He uses Marlowe and Kurtz to answer the understanding of what we can do with this idea and he uses the European Ivory companies in the Congo to frame it and help his readers understand it. I've made my way halfway through the book and I'm trying not to miss anything relating to this. Is there anything I shouldn't miss if I'm trying to connect this story with nihilistic ideas? And better yet, is there a better clarification of nihilism to understand before associating the two?",
        "created_utc": 1458679854,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for works which examine the way literature reflects and/or influences the culture in which it was written",
        "author": "Sovem",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4bh6ae/looking_for_works_which_examine_the_way/",
        "text": "I am wanting to understand the way literature reflects the culture in which it was written, specifically in regard to a culture's morals and values. I am particularly interested in folktales, morality plays and the like, but would be happy with any sort of essay, thesis, book, or even online courses or lectures that discuss the way literature reflects a society's values, no matter the type of literature examined. \n\nAlso, I'm curious, is there a name for this type of examination, so I can better narrow my searches?\n\nThank you for any direction you can provide.",
        "created_utc": 1458649642,
        "upvote_ratio": ""
    },
    {
        "title": "Are 'wrong' and ' incorrect' truly synonymous in modern discourse?",
        "author": "the1cracker",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4bgym9/are_wrong_and_incorrect_truly_synonymous_in/",
        "text": "",
        "created_utc": 1458644933,
        "upvote_ratio": ""
    },
    {
        "title": "Is it so/why does it seem that every young person trying to write a novel writes the main character as a thinly-veiled version of themselves?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4bejpl/is_it_sowhy_does_it_seem_that_every_young_person/",
        "text": "[deleted]",
        "created_utc": 1458598004,
        "upvote_ratio": ""
    },
    {
        "title": "What does this phrase mean in 'The Pleasures of Ignorance' by Robert Lynd?",
        "author": "logophile2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4bbh09/what_does_this_phrase_mean_in_the_pleasures_of/",
        "text": "A contemporary English novelist was once asked by a foreigner what was the most important crop in England. He answered without a moment's hesitation: \"Rye.\" Ignorance so complete as this seems to me to be touched with magnificence; but the ignorance even of illiterate persons is enormous.\n\nWhat is he saying? That the ignorance of ‘contemporary English novelist’ is magnificent, and the ignorance of ‘illiterate persons’ is not magnificent enough to reach that level, but it still is enormous? Please give me a thorough explanation.",
        "created_utc": 1458548338,
        "upvote_ratio": ""
    },
    {
        "title": "Classic texts of American Transcendentalism after Thoreau and Emerson",
        "author": "KingTutsstache",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4b9x0y/classic_texts_of_american_transcendentalism_after/",
        "text": "Hi, \n\nI am currently trying to gain a good understanding of Transcendentalist literature. I have read a Walden and a good amount of Emerson. But as I am starting to read others on the topic like Amos Alcott, all I am confronted with are essays, journal entries and short snippets on the topic. I was wondering if there is any other writings on this topic like Walden? By that I mean more on the side of a longer text on the issue, not simply short essays. \n\nThanks!",
        "created_utc": 1458517548,
        "upvote_ratio": ""
    },
    {
        "title": "Is this situational irony?",
        "author": "dethray1234",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4b9sv1/is_this_situational_irony/",
        "text": "[removed]",
        "created_utc": 1458515712,
        "upvote_ratio": ""
    },
    {
        "title": "Did we keep Novalis' personal notes?",
        "author": "PM_MOI_TA_PHILO",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4b5374/did_we_keep_novalis_personal_notes/",
        "text": "After his death did anybody keep his notes? Is there a place (on the Internet by any chance) to look at them? By notes, I'm talking about drafts, works, etc. Notes that led him to writing The Novices of Sais or Hymns to the Night. \n\nI read his diary that he wrote after the death of Sophia Kuhn (1st wife) but I was wondering if his personal notes have been kept. Like we did with Nietzsche (his notebooks are still kept and available on the Internet).",
        "created_utc": 1458426471,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some general articles/books regarding magical realism",
        "author": "apartment50",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4b0jot/looking_for_some_general_articlesbooks_regarding/",
        "text": "I'm potentially starting a project involving magical realism and Russian (particular Soviet and post-Soviet) literature next year. Doing some preliminary reading now, so I'm looking for articles or books on magical realism as a literary mode, more on the theoretical, analytical, and critical side of things. Anything great you'd recommend?",
        "created_utc": 1458339917,
        "upvote_ratio": ""
    },
    {
        "title": "Paranoia and Don DeLillo's \"White Noise\"",
        "author": "HartNoiz",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4azhdf/paranoia_and_don_delillos_white_noise/",
        "text": "Hi! I'm working on an MA paper on the theme of paranoia in Pynchon's \"Crying of a Lot 49\" and DeLillo's \"White Noise\" and I have a small problem with the latter. After I got through the novel the first time, I was sure that the whole depiction of media culture posses some kind of a paranoiac nature. However, I still have some difficulty in establishing a concrete definition and theoretical basis for this theme. Up to now I've read some Baudrillard, Ghunter Anders and some other works dedicated to media and general postmodern condition of paranoia and I'd like to ask for some similar recommendations. Maybe there's someone who worked on \"White Noise\" and have some ideas to share? I'll be really glad for any help.",
        "created_utc": 1458324420,
        "upvote_ratio": ""
    },
    {
        "title": "Literary criticism on War &amp; Peace?",
        "author": "wjfitzy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4ar77t/literary_criticism_on_war_peace/",
        "text": "[removed]",
        "created_utc": 1458183593,
        "upvote_ratio": ""
    },
    {
        "title": "First ever conference (undergrad)",
        "author": "the-mighty-zabe",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4aqq9m/first_ever_conference_undergrad/",
        "text": "I'm presenting my research at an undergraduate conference in a few weeks but have no clue what to expect. My research compares two texts through the lens of feminist theory (it is a women and gender studies conference). This is my first ever conference. \n\nSo, any advice? Do you remember your first ever conference? How did you do?\n\n**EDIT**: Thank you all for your advice! I'm feeling more confident thanks to your help and can't wait to present. :) ",
        "created_utc": 1458175920,
        "upvote_ratio": ""
    },
    {
        "title": "Dissertation on Anarchism/Anarchist literary theory in texts but not sure where to go with it",
        "author": "significantthrowaway",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4aq2ac/dissertation_on_anarchismanarchist_literary/",
        "text": "[removed]",
        "created_utc": 1458165757,
        "upvote_ratio": ""
    },
    {
        "title": "What are some major discussions/analyses/criticisms of Sean Burke's 'Death and Return of the Author'?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4ao5i7/what_are_some_major_discussionsanalysescriticisms/",
        "text": "[deleted]",
        "created_utc": 1458140046,
        "upvote_ratio": ""
    },
    {
        "title": "Need help on an essay",
        "author": "Mike0124",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4am511/need_help_on_an_essay/",
        "text": "I have an essay due soon, I need help on a thesis for the essay. 5-6 pages long. Directions: Select one or more literary works that we have discussed in class and analyze the theme by focusing on one or more of the following aspects of the work{s} listed below. The topic you choose will be narrowed to one or more works and one or more specific aspects of the work. You can combine the elements of literature with the works of literature in any way you find fruitful. Remember to support your interpretations by references to and quotes from the text. List of aspects: Metaphor Simile personification foreshadowing symbol setting plot tone narrator structure irony conflict point of view\n\nSo far we have gone over Frankenstein, Paradise Lost, Manfred. I am lost mostly because i havent really had time to focus on this assignment and we only meet twice a week for this class.\n",
        "created_utc": 1458100723,
        "upvote_ratio": ""
    },
    {
        "title": "looking for a discussion on \"a man who was to die young\"",
        "author": "qdatk",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4aks1e/looking_for_a_discussion_on_a_man_who_was_to_die/",
        "text": "It's one of those times when you distinctly remember you've read something, but you haven't the foggiest idea where you've read it. I'm looking for a theorist/writer who wrote about the way we talk about things in the past in the context of what was to happen later, specifically, there was something about \"a man who was to die young\" (may have been something else, like \"to die at age thirty\"). The argument was about how what was to happen later colours our perception of the past. Does this ring any bells?\n\nEdit: Found in Benjamin, below! On the other hand, I'm now also getting a kind of Proustian vibe from this. Perhaps there's a bit in Proust too?",
        "created_utc": 1458080211,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing With Ambiguous Symbolism",
        "author": "RoejaStrick",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4agrns/dealing_with_ambiguous_symbolism/",
        "text": "So, I posted this on /r/Literature, and it was deleted. Hopefully this is the correct place to put this.\n\nI'm really struggling with a concept. I'm a senior in high school, and I've loved reading and discussing literature my entire life. Recently, however, due to a particular teacher whose course I'm taking this semester, I'm starting to doubt my ability to understand symbolism and, more importantly, the pertinence that symbolism has to the themes of the texts we're reading in class.\nThis teacher is somewhat self-absorbed. While she acknowledges that certain elements in literature can contain more than one intended meaning, and though she is open (thankfully) to alternative interpretations in essays and exams, she tends to shut down any in-class discussion that strays from her line of thinking. Whenever I or a classmate mentions an alternative understanding of a symbol or theme in a text, she considers it for a minute (almost mockingly) and then dismisses it, claiming that our suggestions are far from what the author intended in his writing. Then, when we ask her to elaborate on her ideas about the text, she moves on to another topic, as if she was frightened by our different ideas and didn't know how to respond to them. I'm not sure whether I should take this as a cop-out on her part, or if I, along with the rest of my class, am simply not understanding the texts.\n\n\nThis leads me to my question: How is the reader supposed to accurately disambiguate symbolism in accordance with the author's intention?\n\n\nForgive me if this is too simple of a question for this sub. I'm just genuinely at a loss here. I've been doing a lot of reading on this subject and I've gotten some conflicting answers. The claim that most intrigues me is that, while the author probably has a particular interpretation in mind when he writes the text, the true meaning is subjective to the reader in that everybody has a different repertoire of experiences to recall from in order to decipher. While the author may only understand his work in the way he intended it, one reader may understand the author's intention along with the understanding that comes with his personal experiences. Another may understand only his personal experiences and completely miss the point of the author. If this is the case, what's the point of writing symbolism into literature? How can an author communicate any ideas if they'll simply be corrupted by the context of the reader's thoughts and experiences?\n\n\nI hope to study biology next year in college and eventually go on to medical school, but, though I will not be focussing on it in my studies, I hope to continue reading literature throughout my life. I'm simply concerned, now, that I'm completely missing the point.\n\n\nI apologize for the length of this post and for my digression, but I thank you all in advance for your thoughts on this matter!",
        "created_utc": 1458012964,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about this?",
        "author": "andreeazy52",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4agq9a/what_do_you_think_about_this/",
        "text": "[removed]",
        "created_utc": 1458012310,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a name for this sub-genre?",
        "author": "TummyCrunches",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4ae87d/is_there_a_name_for_this_subgenre/",
        "text": "For months I've been going crazy trying to learn more about what I've been calling the 'fictional glossary' sub-genre: works like Borges' *A Universal History Of Infamy*, Schwob's *Imaginary Lives*, Wilcock's *The Temple of Iconoclasts*, Bolaño's *Nazi Literature in the Americas* and Lem's *A Perfect Vacuum*.\n\nIs there an actual name for it?  And is there somewhere I can learn more about it's history?",
        "created_utc": 1457978419,
        "upvote_ratio": ""
    },
    {
        "title": "Is Questia worth the investment?",
        "author": "artweary",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4adgud/is_questia_worth_the_investment/",
        "text": "I am an independent researcher and currently have access to various databases such as jstore, ebscohouse, and gale through the New York Public Library.  Each has there strengths and weaknesses.  If you have a view on the value of Questia please let me know; I am trying to determine if it is worth the 100.00 per year investment. Thanks in advance for your opinions",
        "created_utc": 1457968399,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of any essays that talk about narrator reliability in autobiographical works?",
        "author": "unicornsarehung",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4ad5r4/does_anyone_know_of_any_essays_that_talk_about/",
        "text": "Pretty much anything that may point to how much truth we get when an author talks about him/herself. How we can read into their tone, etc.  ",
        "created_utc": 1457963547,
        "upvote_ratio": ""
    },
    {
        "title": "What's the point of introductions and do you read or skip them when starting with a new book?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4a7vgp/whats_the_point_of_introductions_and_do_you_read/",
        "text": "[deleted]",
        "created_utc": 1457863546,
        "upvote_ratio": ""
    },
    {
        "title": "What is teaching comp like?",
        "author": "lifetc",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4a3knl/what_is_teaching_comp_like/",
        "text": "Hi guys. I just got into a program on a teaching assistantship. I'm teaching one class of freshman comp per quarter. As an Englishman, I don't really know what freshman comp is, or anything about teaching as a grad student. Do you have any estimates on how much time this is going to eat up? I've heard 20 hours a week from the school - sound fair? Less, even? Thank you!",
        "created_utc": 1457783623,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of literary device is used in this song?",
        "author": "dapperchameleon",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4a3h6q/what_kind_of_literary_device_is_used_in_this_song/",
        "text": "http://www.azlyrics.com/lyrics/wanted/gladyoucame.html\n\n\"Glad You Came\" by the Wanted\nthings like:\nturn the lights out NOW\nNOW I'll take you by the HAND\nHAND you another DRINK...\nmore specifially, how the last word goes in with the first word of the next sentence",
        "created_utc": 1457780997,
        "upvote_ratio": ""
    },
    {
        "title": "What are some older books/poetry that romanticised mental illness?",
        "author": "AspiringUofTStudent",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49xodd/what_are_some_older_bookspoetry_that_romanticised/",
        "text": "I am looking for books/poetry of this specification from before 1990s",
        "created_utc": 1457680236,
        "upvote_ratio": ""
    },
    {
        "title": "Help with high school paper on Romeo and Juliet",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49wqxs/help_with_high_school_paper_on_romeo_and_juliet/",
        "text": "[deleted]",
        "created_utc": 1457662380,
        "upvote_ratio": ""
    },
    {
        "title": "Job security with a PhD in comparative literature",
        "author": "xlee145",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49uvzu/job_security_with_a_phd_in_comparative_literature/",
        "text": "I'm not sure if this is the kind of question that goes here, but I'm not sure where else to ask and it seems like here is a good bet. I'm currently an undergraduate considering a PhD in comparative literature. I would like to study the ways that African, Caribbean and African-American literature of French and English expression encapsulate the Black experience as it evolved in the 20th century, during the era of independence, civil rights and neo-colonialism. However, I'm wondering about the job security for CompLit PhDs. At the end of the day, I'd like to teach comp lit classes but I realize that this is unlikely to happen during my first few years as a professor. I will likely be hired to teach English or French classes, but I am wondering whether or not a comparative literature degree may impede my candidature to teach in an English or French department. Does anyone have any experiences or know of any situations where this has occurred? ",
        "created_utc": 1457636515,
        "upvote_ratio": ""
    },
    {
        "title": "Hi, I need to write an essay about two short stories (Cliffedge and The Tell-Tale Heart) and could use your help!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49u0n7/hi_i_need_to_write_an_essay_about_two_short/",
        "text": "[deleted]",
        "created_utc": 1457625589,
        "upvote_ratio": ""
    },
    {
        "title": "Poetry, Medicine, Experiencing Life",
        "author": "AlanKurt47",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49s944/poetry_medicine_experiencing_life/",
        "text": "[removed]",
        "created_utc": 1457589746,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone read The Yiddish Policeman's Union? I was thinking about writing a term paper comparing its use of language to a Clockwork Orange. Would anyone have any pointers?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49qq00/has_anyone_read_the_yiddish_policemans_union_i/",
        "text": "[deleted]",
        "created_utc": 1457564966,
        "upvote_ratio": ""
    },
    {
        "title": "Studies on how novelists generate emotion?",
        "author": "penitence4",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49qnlv/studies_on_how_novelists_generate_emotion/",
        "text": "Are there any really good studies -- with sufficient specificity to be useful to a writer -- of how novelists achieve emotional effect (eg is it by making the reader identify with a character, or chiefly by choice of image and metaphor, or by rhythm and cadence, etc.)? Obviously it's not just one thing, but who has deeply looked at the techniques of fiction as ways of stimulating and evoking emotion?",
        "created_utc": 1457564088,
        "upvote_ratio": ""
    },
    {
        "title": "Question on The theatrical space in Athenian performances",
        "author": "Brparadox",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49pppy/question_on_the_theatrical_space_in_athenian/",
        "text": "What kinds of symbolic weight does movement from Argos to Delphi, for example, carry, or from outside to inside? Or from Thebes to Athens? How and what does Troy signify in relationship to Argos? And Aulis and Phocis? And what weight do the invocations of Mt. Kithairon or Corinth or the crossroads carry in Oedipus the King? These are geographical places, but places that are situated in cultural frames.\n\nThese are some examples that my professor gave me. What are some symbols with setting? Like in Agamemnon and Oedipus.",
        "created_utc": 1457552366,
        "upvote_ratio": ""
    },
    {
        "title": "What made Douglas Adams' \"Hitchhiker's Guide to the Galaxy\" stand out when it was first published in 1979?",
        "author": "Honolulu-Humor-Hut",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49n5dy/what_made_douglas_adams_hitchhikers_guide_to_the/",
        "text": "",
        "created_utc": 1457510549,
        "upvote_ratio": ""
    },
    {
        "title": "Social class after the Civil War",
        "author": "Onsatko",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49khqs/social_class_after_the_civil_war/",
        "text": "Good afternoon,\n\nI would like to ask if any of you could recommend a good book dealing with the social class during / after the Civil War?\n\nWhat I need is to find out what people used to be like before the war, during the war and after it ended, what changed, especially considering the social classes, what impacts the war had, how the people lived, what important changes and events affecting the people and social classes came after the war, etc.\n\nAny help with finding books addressing these topics would be much appreciated. Thank you.",
        "created_utc": 1457470070,
        "upvote_ratio": ""
    },
    {
        "title": "What are some important canonical and contemporary papers/works on semantic meaning and its relation to meaningfulness?",
        "author": "rmgi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49hj5w/what_are_some_important_canonical_and/",
        "text": "Basically looking to see the way that semantic meaning is created and what role that plays in terms of things being meaningful. Is there a difference between semantic meaning and semiotics?",
        "created_utc": 1457424379,
        "upvote_ratio": ""
    },
    {
        "title": "I seem to have found a completely alternate version of Yeats' The Wanderings of Oisin and I'm very confused",
        "author": "i_post_gibberish",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49gq9u/i_seem_to_have_found_a_completely_alternate/",
        "text": "So I found [this](https://books.google.ca/books?id=Rn04AAAAYAAJ&amp;pg=RA1-PR5&amp;lpg=RA1-PR5&amp;dq=For+our+best+were+dead+on+Gavra's+green&amp;source=bl&amp;ots=0DzBQ5Z0pL&amp;sig=cgqlLjMhNOApPUPn2VSJEKCvwYg&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjJzrjHnbDLAhWLlIMKHe7uBrQQ6AEIHjAB#v=onepage) on Google books. It's a first edition of Yeats' The Wanderings of Oisin, which seems to be a completely different version of the poem than the one found in any modern edition and contains hundreds of lines that appear nowhere else. In fact the scholarly edition of Yeats' collected poems that I have doesn't even mention that there *was* ever an earlier version of the poem. Am I going completely insane here, or is it widely known to Yeats scholars that an earlier version existed and I, being for the most part a casual reader, just can't find any mention of it because I don't know how to search academic sources properly, or am I actually the first person to notice the difference?",
        "created_utc": 1457411147,
        "upvote_ratio": ""
    },
    {
        "title": "Oscar Wilde's Aestheticism",
        "author": "Happylittlehead",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49den7/oscar_wildes_aestheticism/",
        "text": "This is a very vague question because I've only just today had the idea, so I apologise in advance for its simplicity...\n\nBasically I'd like to write an essay on Oscar Wilde's 'The Picture of Dorian Gray' thinking about aestheticism (I did warn you). I need to pick another novel to discuss in relation to it and the issues it raises.\nSo I guess something with enough similarities but also important differences.\nMy lecturer recommended Henry James's The Spoils of Poynton, but I'm not a huge James fan, so was wondering if there was anything else that might go well with it?\n\nThanks a lot.",
        "created_utc": 1457368301,
        "upvote_ratio": ""
    },
    {
        "title": "Carrierbag Fiction and Death vs Life stories",
        "author": "CourageousWren",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/49bxck/carrierbag_fiction_and_death_vs_life_stories/",
        "text": "This question assumes you have read Ursula Le Guins \"Carrier Bag Theory of Fiction\" or know of it. \n\nI am wondering if anyone has heard of anything similar to her theory. I am really surprised *no one* seems to have used it to analyze texts, when it has popped into my head about 3 times in the past 3 months whilst reading various things. Perhaps there is a similar theory out there of which I am unaware. \n\nBasically it separates stories as follows:\n\n- Weapon stories: hunters, heroes, death, destruction, glory, tragedy, status, rising action/climax/falling action\n\n- Carrier bag stories: gatherers, everyman, life, preservation, happiness, birth, comedy, relationships, meandering narrative\n\n- some ecocritical and gender studies mixed in. It's not anti men as both men and women gathered, but it describes carrier bag as delveloping first, and hunter behavior, which brought home only 20-40% of the calories in most cultures and got people killed but did provide a lot of excitement, as an offshoot of the more normal and necessary method of living but which somehow nonetheless became the dominant type of story. \n\nLike it or hate it, its a fun theory to play with.  \n\nBut weirdly no one has written on such a thing.  \n\nSo... what am I missing? ",
        "created_utc": 1457343673,
        "upvote_ratio": ""
    },
    {
        "title": "German speaker - significance of simile about wound in Ein Landzart",
        "author": "Earthsophagus",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/499qbw/german_speaker_significance_of_simile_about_wound/",
        "text": "In /r/bookclub we're talking about the [wound on the patient's hip](https://www.reddit.com/r/bookclub/comments/48xmm9/reactions_to_a_country_doctor_by_franz_kafka/) which is compared to a mineshaft, or a surface mine, or a mining pit - every translation is different.  The German is below (hoffentlich).  Would you who read both languages say it empasizes a tearing up of the earth, or deep ~~pemetration~~ penetration, shaftiness?\n\n&gt; In seiner rechten Seite, in der Hüftengegend hat sich eine handtellergroße Wunde aufgetan. Rosa, in vielen Schattierungen, dunkel in der Tiefe, hellwerdend zu denRändern, zartkörnig, mit ungleichmäßig sich aufsammelndem Blut, offen wie ein Bergwerk obertags",
        "created_utc": 1457306578,
        "upvote_ratio": ""
    },
    {
        "title": "about perseus",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/495yzx/about_perseus/",
        "text": "[deleted]",
        "created_utc": 1457240578,
        "upvote_ratio": ""
    },
    {
        "title": "What does a literary theory research paper consist of?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/495etq/what_does_a_literary_theory_research_paper/",
        "text": "[deleted]",
        "created_utc": 1457230781,
        "upvote_ratio": ""
    },
    {
        "title": "Help! Can anyone please compare this text from 'We' to 1984 from Orwell. They're both dystopian novels.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4952wb/help_can_anyone_please_compare_this_text_from_we/",
        "text": "[removed]",
        "created_utc": 1457225305,
        "upvote_ratio": ""
    },
    {
        "title": "I'm trying to form a thesis for a New historicism critique on \"cat on a Hot tin roof\"",
        "author": "kevintbn",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/490z6p/im_trying_to_form_a_thesis_for_a_new_historicism/",
        "text": "[removed]",
        "created_utc": 1457150898,
        "upvote_ratio": ""
    },
    {
        "title": "Atheism, Sade, and the Enlightenment",
        "author": "801_chan",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48yjwl/atheism_sade_and_the_enlightenment/",
        "text": "I've been reading a lot of Enlightenment characters, lately, and I'm very interested in the development of deism and the advent of atheist philosophers. I've read some Hume, la Mettrie, Voltaire, and Holbach, but I'd like to know if you've read any good articles out there specifically on atheism in this era. I'm reading *Justine* at the moment and Sade's doing some wonderfully bold things with religion. If you have any perspectives on his life and philosophy, I'd snatch those up, too.\n\nThank you.",
        "created_utc": 1457115789,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis of the use of language in Ursula K. Le Guin's The Word for World is Forest",
        "author": "Ucsc_slug",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48uri2/analysis_of_the_use_of_language_in_ursula_k_le/",
        "text": "I'm about to begin my first read through of The Word for World is Forest and I was planning on writing an essay on the usage of language in the novel. If perhaps there are some veteran readers of this novel who are more familiar with the book, could you give me some advice on what passages, themes, and reoccurring motifs that I should be on the look out during my read through? Don't worry about giving away spoilers. You help is much appreciated. ",
        "created_utc": 1457049617,
        "upvote_ratio": ""
    },
    {
        "title": "Analysis of the use of language in Ursula K. Le Guin's The Word for",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48upp1/analysis_of_the_use_of_language_in_ursula_k_le/",
        "text": "[deleted]",
        "created_utc": 1457048917,
        "upvote_ratio": ""
    },
    {
        "title": "Loss of Innocence",
        "author": "SaulJones",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48u80a/loss_of_innocence/",
        "text": "I'm taking a senior-level college course on American Literature and the syllabus focuses overwhelmingly on the theme, \"Loss of Innocence.\" I find it exhausting.\n\nThis has become a catch-all phrase to mean any kind of new understanding a character receives or how a youth begins to enter adulthood. We're studying *To Kill a Mockingbird*, *Rule of the Bone*, and the *Scribner Anthology of Contemporary Short Fiction*.\n\nI'm looking for any good writing or analysis about Loss of Innocence in general. I need fresh ideas because the ones in my class' text are stale. Essays, books, scholarly analysis, anything. I just need a new perspective. There has to be more to this theme than what I've found in my class so far, which is next to nothing.\n\nThank you for any assistance.",
        "created_utc": 1457042092,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone done a genealogy of literary theory?",
        "author": "electricdidact",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48sim8/has_anyone_done_a_genealogy_of_literary_theory/",
        "text": "I've been thinking, it would be really cool to have an infographic or some sort of document tracing essential literary theory questions in a tree illustrating the major successions of arguments made by theorists. \n\nDoes anyone know if such a holy grail exists?",
        "created_utc": 1457020037,
        "upvote_ratio": ""
    },
    {
        "title": "Genette and narratology - some suggestions",
        "author": "Jopinate",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48sdgu/genette_and_narratology_some_suggestions/",
        "text": "I'm very interested in Gerard Genette's book \"Narrative Discourse\", and would like to read studies by other scholars that use his concepts (order, frequency, duration, voice, and mode) to analyse literary texts. I checked a few databases and found nothing. Do you know of any such studies? ",
        "created_utc": 1457018076,
        "upvote_ratio": ""
    },
    {
        "title": "Accessible books on semiotics?",
        "author": "togeekornot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48rhbh/accessible_books_on_semiotics/",
        "text": "I enjoyed studying semiotics as part of my literature degree but have forgotten most of the theory. Can anyone recommend some books on semiotics that are worth reading and fairly accessible/readable?",
        "created_utc": 1457001781,
        "upvote_ratio": ""
    },
    {
        "title": "The deacon by mary gordon",
        "author": "catastrophe_ts",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48reo8/the_deacon_by_mary_gordon/",
        "text": "[removed]",
        "created_utc": 1456999909,
        "upvote_ratio": ""
    },
    {
        "title": "Examples of postmodernism in the arts?",
        "author": "fatherfoamhorse",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48o9cd/examples_of_postmodernism_in_the_arts/",
        "text": "Other than the obvious examples of literature, I'd also like to expand this to other mediums. Postmodernism in film, music (both pop and classical, but especially pop, as the only postmodern band I can name is Talking Heads), painting, video games, architecture.\n\nI realize this is both within and beyond the scope of this particular subreddit, but as there is no subreddit devoted in particular to postmodernism, I felt this was this best to post in.",
        "created_utc": 1456951687,
        "upvote_ratio": ""
    },
    {
        "title": "Contemporary writers who deal with technology, networks, the internet, etc.?",
        "author": "patanoster",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48m7mq/contemporary_writers_who_deal_with_technology/",
        "text": "Where is a good place to start looking for writers who deal, either thematically or formally, with the role of the internet and accelerating technological change? There are obvious roots of this in 20th century sci-fi but I don't know who is writing about this in an interesting way nowadays. \n\nI am hoping to test out accelerationist theories against creative responses to technology but am not especially up-to-date with contemporary literature and poetry, so any advice would be appreciated. ",
        "created_utc": 1456926883,
        "upvote_ratio": ""
    },
    {
        "title": "Is a dynamic character and round character the same thing? Same as flat character and static character?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48kyjm/is_a_dynamic_character_and_round_character_the/",
        "text": "[deleted]",
        "created_utc": 1456900251,
        "upvote_ratio": ""
    },
    {
        "title": "What is The Gaze?",
        "author": "illradhab",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48jn4s/what_is_the_gaze/",
        "text": "Lacan, McClintock, Foucault... I am wrestling with trying to figure out how to begin to think about this. Some fingers pointed in the right direction would be a blessing.",
        "created_utc": 1456880186,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding James Joyce's Multilingualism",
        "author": "CHRISTMAS_SNAKE",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/48csyz/question_regarding_james_joyces_multilingualism/",
        "text": "Apologies if this has been asked before, a quick search turned up no results.\n\nI'm currently studying Ulysses as part of an English Literature course and Its great to finally having a good excuse to persist with this text, it's one I've started dozens of times only to put down when the going gets tough.\n\nOne thing that's really impressing me is Joyce's grasp of other languages. Looking into his biography, it seems he was proficient in at least English, Italian, Latin, French, German and he seems to have been conversant in Norwegian and Greek.\n\nThis is obviously enormously impressive, but has lead me to wonder whether he spoke much Gaelig? For a text in which Dublin has such a palpable presence, there's been (so far) a distinct lack of the language itself. \n\nIf anyone can shed any light on this for me that would be much appreciated. Also, any sources would be fantastic as I am considering basing my final essay on a postcolonial reading of Ulysses.",
        "created_utc": 1456783398,
        "upvote_ratio": ""
    },
    {
        "title": "What makes Victorian Literature Victorian? (x-post from r/AskHistorians)",
        "author": "l3eater",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47z0wx/what_makes_victorian_literature_victorian_xpost/",
        "text": "Hi there, I was kindly pointed here from /r/AskHistorians. My question was:\n\n&gt; Apart from the simply fact that it's generally literature written during the reign of Queen Victoria, what specifically makes Victorian Literature Victorian? Why are authors like Charles Dickens, Lewis Carroll, Arthur Conen Doyle etc. considered Victorian authors? More generally, how is literature divided and assigned a historic era or age?",
        "created_utc": 1456616285,
        "upvote_ratio": ""
    },
    {
        "title": "Theories of \"gaps\" or \"absences\" in narrative?",
        "author": "headlessparrot",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47xbsd/theories_of_gaps_or_absences_in_narrative/",
        "text": "Perhaps an overly broad question, but I could use a hand.\n\nProposed a conference paper to a fairly prestigious organization on a whim, not expecting acceptance, that basically said, \"hey, I noticed in these two books the narratives *write around* certain events--they're never mentioned by name, or referred to explicitly, but they nevertheless seem to loom always in the background, colouring our reading of the texts. That's awful interesting. I want to talk about it.\"\n\nAnyway, the proposal was accepted, surprisingly, and now I'm trying to avoid embarrassing myself in a field that isn't really my strength. So I'm wondering if there are any essays or texts or philosophies out there that might offer some perspective on these kinds of gaps. I know there is some post-structuralist talk of \"presence of absence/absence of presence,\" and I'm hunting that down to see if it fits with my experience, but any further guidance would be quite helpful.",
        "created_utc": 1456600168,
        "upvote_ratio": ""
    },
    {
        "title": "Does this description of a poem ring any bells for any experts here on Chinese lit?",
        "author": "TobiBaronski",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47r687/does_this_description_of_a_poem_ring_any_bells/",
        "text": "From a thread on 4chan's /lit/ where the OP asked if Rimbaud is the peak of Western poetry. Somebody replied:\n\n\"The peak of poetry died in the 1980s in China and left behind an unfinished poem that combines elements of Nietzsche, high Mysticism, Taoism, multiple voices, and some of the most powerful and rigorous cosmic and natural imagery out there. See if you can find him.\"\n\nGoogle isn't helping.",
        "created_utc": 1456519112,
        "upvote_ratio": ""
    },
    {
        "title": "What does 'truth' in literature mean exactly other than \"it resonates well enough with certain people?\"",
        "author": "doublementh",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47qybd/what_does_truth_in_literature_mean_exactly_other/",
        "text": "Excuse le reddit STEM xD mentality. I majored in English and minored in Comparative Literature, and I've struggled with this big time. Can anyone help me out?\n\nEDIT: Your responses were all so helpful. Thank you so much!",
        "created_utc": 1456516804,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to find an essay by Steinbeck, 'Argument of the Phalanx",
        "author": "lemon0o",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47op5q/trying_to_find_an_essay_by_steinbeck_argument_of/",
        "text": "Hello there dear reader,\n\nI'm writing an essay on Steinbeck at the moment and of particular interest to me is his essay 'Argument of the Phalanx' that I find references to and discussions  of, everywhere. Yet nowhere can I find the essay as a text in itself. Many articles and books quote it, and it is really doing my head in. If anyone knows where I might be able to track it down I would be forever grateful.\n\nApologies if this is the wrong place to ask, wasn't sure where else I could do so. \n\nCheers",
        "created_utc": 1456487747,
        "upvote_ratio": ""
    },
    {
        "title": "Where are Literary Theorists employed and in what capacity?",
        "author": "sirredcrosse",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47n7v0/where_are_literary_theorists_employed_and_in_what/",
        "text": "My deepest apologies if this is the wrong place to ask, but I'm currently a young English Major w/ a concentration in Literature in the sophomore year of my Bachelor's Degree and I'm very interested in Literary Theory and Criticism. But what job does one look for [after Grad School, I assume, of course] in which you can explore the frontiers of theory? Is it kind of like moonlighting as a theorist writing essays while your day job is a college professor or something? \nThe world of academia has remained woefully mysterious to me, despite my deep interest. Much thanks for all your help!",
        "created_utc": 1456458089,
        "upvote_ratio": ""
    },
    {
        "title": "What's Alice Walker's intention behind this quotation from historical point of view ( Historicism ) ?! What biographical and historical proof is there?",
        "author": "Claym0re1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47kvp6/whats_alice_walkers_intention_behind_this/",
        "text": "This quotation is taken from \" Everyday Use\" \n\"Sometimes I can still hear the flames and feel Maggie's arms sticking to me, her hair smoking and her dress falling off her in little black papery flakes. Her eyes seemed stretched open, blazed open by the flames reflected in them",
        "created_utc": 1456429239,
        "upvote_ratio": ""
    },
    {
        "title": "Assistance with analysing Great Expectations",
        "author": "marktbde",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47jq8y/assistance_with_analysing_great_expectations/",
        "text": "Hi /r/AskLiteraryStudies - I'm hoping someone could offer me a bit of help: I'm finding this particular assignment that I am working on to be extremely trying, I've hit what feels like a mental brick wall with it and, for one reason or another, I cannot seem to dispel this notion. \n\nMy tutor is currently out of office for a week and my queries to the dept. head have gone as of yet unanswered, so I'm left with very few options for assistance, and on a tight deadline to get my work completed. \n\nMy essay topic is as follows \"**Referencing your text, write an essay exploring how the development of the novel as a genre plays out alongside important questions of identity. You may wish to focus on one aspect of identity, such as class, religion, race, nationality, gender or sexuality.**\n\nI don't feel like I really understand what is being asked of me here or what I need to focus on. \n\nFoolishly and prematurely I really committed to the idea of writing about the interesting gender questions presented in Great Expectations, specifically with Joe, Mrs. Joe, Miss Havisham and Estella. They reverse the usual gender identities of the times in many respects, but adhere to them in other instances. Up to this point all my research was based on the assumption that I could mould this question to fit my purpose, but now I just can't get my head round a way to do so. \n\nCan anyone assist me with this? I feel like I don't understand the question at all, and thus have no way of linking it to my desired topic now. \n\nThanks in advance for any assistance anyone can provide, and apologies for my ignorance - I've been tearing my hair out over it for a week now. \n\n\n",
        "created_utc": 1456418109,
        "upvote_ratio": ""
    },
    {
        "title": "Figuring out a specific author who wrote or was part of a Paris-based school of thought.",
        "author": "CookedIllustrations",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/47feup/figuring_out_a_specific_author_who_wrote_or_was/",
        "text": "Hello! \n\nThis one has been driving me insane for ages, and it might be a little too vague. \n\nRecently I saw a video who described a particular author (can't recall the name) who spoke fondly of a group of writers, artists and philosophers who were Paris based. Or maybe he was the philosopher... Anyhoow. He mainly wrote about not the Paris of the Eiffel Tower and famous monuments, but of the nooks and crannies hidden in the city, of getting lost through streets and finding hidden gems that nwould've remained hidden had you not dared to let the city swallow you. \n\nI know it is very vague, and I've been trying to find the original source I found for this to no vail. Any help would be tremendously appreciated. \n\nCheers!",
        "created_utc": 1456352282,
        "upvote_ratio": ""
    },
    {
        "title": "Being wet refers to liquid, what is the word for being covered in a viscous material?",
        "author": "tomerjm",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/477yut/being_wet_refers_to_liquid_what_is_the_word_for/",
        "text": "[removed]",
        "created_utc": 1456251814,
        "upvote_ratio": ""
    },
    {
        "title": "What would you say are the most important critical studies and articles on William Shakespeare?",
        "author": "CalaveraManny",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/477f3d/what_would_you_say_are_the_most_important/",
        "text": "I know \"on William Shakespeare\" is way too broad a topic, but I'm just looking for reading material so I'll take any recommendation. What academical studies would you say are *essential* to read his work? ",
        "created_utc": 1456245689,
        "upvote_ratio": ""
    },
    {
        "title": "Why is J. California important to american literature?",
        "author": "xMythrin",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/476kxp/why_is_j_california_important_to_american/",
        "text": "[removed]",
        "created_utc": 1456234254,
        "upvote_ratio": ""
    },
    {
        "title": "Walter Benjamin's \"Dialektik im Stillstand\": reception and influence",
        "author": "qdatk",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/475smm/walter_benjamins_dialektik_im_stillstand/",
        "text": "Hey folks. I'm hoping to canvass for any texts that directly engage with this phrase of Benjamin's. Is there even a sustained treatment in Benjamin himself? I only know of the essay on epic theatre and the bits from the *Passagenwerk*. This is for a kind of personal reading list/things to explore in the future, so any and all suggestions will be very welcome!",
        "created_utc": 1456218212,
        "upvote_ratio": ""
    },
    {
        "title": "Year of the action in Frankenstein - mentioning 1798 Rime when date is 17--",
        "author": "Earthsophagus",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/474sda/year_of_the_action_in_frankenstein_mentioning/",
        "text": "Frankenstein starts with letters dated in December 17--, but mentions the Rime of the Ancient Mariner in the second letter (March 17--).  First publication of Lyrical Ballads was 1798, I don't know the month.  But Walton's been in Russia since Dec 17--. \n\n *If* Shelly was being deliberate w/r/t publication history it seems the story must be set it 1799  (he read the poem in 1798, wrote first letter 1798, second letter in 1799, and after that the 1700s are plumb out.)\n\n Is this consensus opinion, or is it \"obvious\" that she was careless about the dates, or was the poem circulated before Lyrical Ballads?",
        "created_utc": 1456199207,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any structuralist schools that focus on poetry?",
        "author": "EddieVisaProphet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/473vbg/are_there_any_structuralist_schools_that_focus_on/",
        "text": "Is there any schools that focus on poetry with a structuralist framework? I know that there's narrative theory which focuses on the analysis of narrative through a structuralist framework, so if the poem is a narrative, voila, but are there any that are focused strictly on poetry of all kinds but lays out the building blocks of the genre in a similar way as narrative theory?",
        "created_utc": 1456186105,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for information on Santiago Vaquera Vásquez",
        "author": "spanishspanish1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4734l5/looking_for_information_on_santiago_vaquera/",
        "text": "Title says it all. Researching for a class, and can come up with only about 5 actual sources. He is a chicano writer living in the states. Most of which have recopied the same biography again and again. Thank you for you help in this research endeavor and any help with new sources on his biography. ",
        "created_utc": 1456176912,
        "upvote_ratio": ""
    },
    {
        "title": "In Frankenstein, what is Mary Shelly implying about narrative, truth and belief",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/471nen/in_frankenstein_what_is_mary_shelly_implying/",
        "text": "[deleted]",
        "created_utc": 1456159289,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking help regarding Literature",
        "author": "Florentine-Pogen",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/471iu1/seeking_help_regarding_literature/",
        "text": "I am an undergrad about to obtain his bachelor's in business. I want to pursue becoming a professor of literature for a master's and career. I am thinking about focusing on poetry, but anyways -- I need advice on how to make this dream happen. Some of my professors have been extremely supportive and they believe that I have the skills for the job; however one of my professors has informed that this field is expiring and will offer no job security, opportunities, or financial stability...\n\nPlease, any advice is very appreciated -- I am at a difficult crossroads in my life, and am reaching out for help.",
        "created_utc": 1456157769,
        "upvote_ratio": ""
    },
    {
        "title": "What role in the culture were later symbols from The Canterbury Tales by Geoffrey Chaucer? esp. music and bagpipes?",
        "author": "wigi1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46zys7/what_role_in_the_culture_were_later_symbols_from/",
        "text": "esp: http://www.litcharts.com/lit/the-canterbury-tales/symbols",
        "created_utc": 1456130442,
        "upvote_ratio": ""
    },
    {
        "title": "Link between Eliot's 'Prufrock' and the final episode in Woolf's 'The Waves'?",
        "author": "blackbluegrey",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46rva5/link_between_eliots_prufrock_and_the_final/",
        "text": "Just finished reading The Waves and the final episode had what appeared to be a lot of references to The Love song of J. Alfred Prufrock. I didn't jot down any quotes from The Waves but, going through Prufrock now, I'll list some of the similarities I recall:\n\n* Most obviously, both feature an elderly speaker looking back wistfully.\n* \"certain half-deserted streets\" - I'm sure there was a mention of this.\n* \"Time to turn back and descend the stair\" - same as the above.\n* \"In the room the women come and go\" - similar mention of drawing rooms in The Waves, I think.\n* \"I have measured out my life with coffee spoons\" - Bernard talks of flicking the table with a spoon. He also speaks of 'coffee cups' in relation to the passing of time.\n* \"And I have seen the eternal Footman hold my coat\" - Bernard leaves the restaurant and collects his coat and believes the act carries a degree of importance.\n* \"I have seen them riding seaward on the waves\" - I don't think this one needs expounding.\n\nThere were most likely a few others. This isn't solely a request for existing criticism regarding the relationship; I'm also wondering if anyone else noticed these connections when reading either one - hell, for all I know, this could be something blindingly obvious to most readers.",
        "created_utc": 1456001179,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a literary term",
        "author": "eggs_benedict",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46qzsj/looking_for_a_literary_term/",
        "text": "Is there a literary term which refers to a moment within a piece of work, be it poem, short story, novel etc, when the title is mentioned.\nFor example the new Margaret Atwood novel entitled The Heart Goes Last, at one point within the novel a character explaining a death says 'and the heart goes last.'\nDoes this have a specific term to define it?",
        "created_utc": 1455989005,
        "upvote_ratio": ""
    },
    {
        "title": "What's the socio-political background of Macbeth?",
        "author": "galactic-milk",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46pzp8/whats_the_sociopolitical_background_of_macbeth/",
        "text": "[removed]",
        "created_utc": 1455973345,
        "upvote_ratio": ""
    },
    {
        "title": "Critical bibliography for Beckett",
        "author": "bloom2013",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46lggx/critical_bibliography_for_beckett/",
        "text": "Hi! I'm looking for some bibliography to do some research on S. Beckett... Anything you guys suggest, especially if it's fairly canonical would be of great help. ",
        "created_utc": 1455899854,
        "upvote_ratio": ""
    },
    {
        "title": "How important of a writer is John Barth?",
        "author": "xxxerox",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46kuzk/how_important_of_a_writer_is_john_barth/",
        "text": "From what I understand, the only work of his people still pay attention to is *Lost in the Funhouse* and every once in a while, you'll find somebody who's read *The Sot-Weed Factor*.\n\nDo we see him as a progenitor of metafictional postmodernism? As an American author swept under the rug?",
        "created_utc": 1455891900,
        "upvote_ratio": ""
    },
    {
        "title": "Literature dealing with river adventures...",
        "author": "dbp123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46i1ar/literature_dealing_with_river_adventures/",
        "text": "I need to find a book, excerpt, short story, poem, some piece of literature that deals with rivers and adventures by the river... The obvious ones such as \"The adventures of Huckleberry Finn\" and \"The Wind and the Willows\" are taken, so I was wondering if someone can point me towards some piece of literature dealing with rivers and river adventures... \n",
        "created_utc": 1455843315,
        "upvote_ratio": ""
    },
    {
        "title": "Key texts on how language and perception shape each other.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46h95r/key_texts_on_how_language_and_perception_shape/",
        "text": "[deleted]",
        "created_utc": 1455832958,
        "upvote_ratio": ""
    },
    {
        "title": "Help with terminology: verisimilitude, mimesis, diegesis",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46fnjy/help_with_terminology_verisimilitude_mimesis/",
        "text": "[deleted]",
        "created_utc": 1455814008,
        "upvote_ratio": ""
    },
    {
        "title": "What's with the post-structuralist french feminists?",
        "author": "gummer8",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46e20c/whats_with_the_poststructuralist_french_feminists/",
        "text": "In my highschool lit class, the teacher was talking about feminism and mentioned that the french post structuralists focused on, and sought to promote female authors. This seems confusing to me, as I thought that one of the main points of post structuralism was the dismissal of the author's circumstances and their intent? ",
        "created_utc": 1455789201,
        "upvote_ratio": ""
    },
    {
        "title": "Need a pre-20th century text about a man \"out of his time/era,\" \"resistance to change,\" or \"forgiveness of the past\"",
        "author": "Gooey_kablooy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/46c33e/need_a_pre20th_century_text_about_a_man_out_of/",
        "text": "[X-post from r/literature] We're reading August Wilson's Fences which is engaging and has important themes and motifs, but we want to pair some pre-20th century texts as well so that students engage regularly with archaic vocabulary and syntax. Some of the themes in Fences are redemption, conflicts/boundaries with society that lead to internal conflicts/boundaries, a man out of his time, resistance to change, and forgiveness of the past. Recommendations?",
        "created_utc": 1455756646,
        "upvote_ratio": ""
    },
    {
        "title": "Japanese (and/or East Asian) Tragedy. Why so much of it?",
        "author": "Big_Yehudah",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/469vs2/japanese_andor_east_asian_tragedy_why_so_much_of/",
        "text": "Why is it that Manga, Anime, and all forms of Japanese fiction writing often have tragic endings? I have a vaguely formed theory. The Old World, Europe, Asia, Africa, all have suffered horrific wars, atrocities, famines, and various disasters. The US has largely been protected by the ocean from this. But what is it about Japanese fiction writing specifically. Real world tragedies apply to ALL of the Old World, not just Japan. I'm very curious about this. If I'm way off, let me know.\nI don't know if this is the proper forum to ask. I've already asked in /r/japan, and surprisingly no results as yet.",
        "created_utc": 1455730786,
        "upvote_ratio": ""
    },
    {
        "title": "What does \"a water measure's time\" mean?",
        "author": "drackss",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/468usy/what_does_a_water_measures_time_mean/",
        "text": "I am reading \"The Egyptian\" by Mika Waltari, and it has this passage:\n\n“In the morning my mother would take me with her to the vegetable market. She never had many purchases to make, yet she could spend a water measure’s time choosing a bunch of onions and the whole of every morning for a week if it were a matter of choosing new shoes. ”\n\nI have no clue what he's trying to say here.",
        "created_utc": 1455719243,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any works of prose consisting only of dialogues?",
        "author": "the_rigo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4674ve/are_there_any_works_of_prose_consisting_only_of/",
        "text": "I have an idea for my local community of English learners, and for this I would like to have a full-fledged work of prose that consist *solely of dialogues*. I don't mean \"mostly of dialogues,\" but of conversations exclusively.\n\nThe only thing that came to my mind was the short story [They're Made Out of Meat](http://www.terrybisson.com/page6/page6.html) by Terry Bisson. It does indeed contain a single dialogue between two unnamed characters. This fits perfectly, but what about something larger than a short story?\n\nPlays obviously come to mind, but they actually contain much more than just dialogue, but stage directions and more.\n\nIt would be great if the text was in public domain. And the larger the work—the merrier, as what I have in mind will require some serious teamwork.\n\nUPDATE: \nI've found some nice overview [“THE.” “DIALOGUE?” “NOVEL!”](http://therumpus.net/2014/08/the-dialogue-novel/), it is all about classics, which is good, but may not be that exciting.\n\nI found [Shakespeare. The Tragedy of Hamlet, Prince of Denmark](http://shakespeare.mit.edu/hamlet/full.html) - great, but a bit difficult for learners.",
        "created_utc": 1455693974,
        "upvote_ratio": ""
    },
    {
        "title": "Short story about toy maker?",
        "author": "Ashleynam",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/466ngn/short_story_about_toy_maker/",
        "text": "We read it in undergrad. Its about a kingdoms royal toy maker and he makes beautiful miniature models. And he is begins to make tinier and tinier models until no one but him can see. In the end he stays up in his tower making perfect tiny models that no one can see.",
        "created_utc": 1455684969,
        "upvote_ratio": ""
    },
    {
        "title": "Where &amp; how did ancient authors like Thucydides \"take notes\" for their works?",
        "author": "___--__",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/4665q2/where_how_did_ancient_authors_like_thucydides/",
        "text": "I'm reading the History of The Peloponesian War and in the introduction it is mentioned that Thucydides took and kept notes that he would later use to compose his book and I found that super weird and interesting. What was the ancient greek equivalent of a pen and notebook and how available were they for people back then?\n",
        "created_utc": 1455677849,
        "upvote_ratio": ""
    },
    {
        "title": "Works of fiction that deliberately play with language?",
        "author": "the_doctoress",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/461v88/works_of_fiction_that_deliberately_play_with/",
        "text": "Besides 'House of Leaves' and 'Through the Looking Glass', i.e.",
        "created_utc": 1455617947,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any major historiographies of the development of modernism into Postmodernism? [expost from r/askhistorians]",
        "author": "vikingsquad",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45xnby/are_there_any_major_historiographies_of_the/",
        "text": "Hi all, I'm completing my undergraduate thesis [History and Comparative Cultural Studies] on the 1974 novel Dhalgren as interpreted through the collaborative works of Gilles Deleuze and Felix Guattari in the Capitalism and Schizophrenia project.\n\n\nThe novel valorizes aspects of the counterculture: black power, gay liberation/depictions of queer and polyamorous sex, drug use, the hippies, biker culture.\n\n\nI'm looking for something which specifically and in-depth explains the conditions of possibility and emergence of such a thing as \"counterculture.\" My readings so far on the subject, admittedly a bit theoretical rather than historical, are Herbert Marcuse's One-Dimensional Man and Theodore Roszak's The Making of a Counterculture. I also have Todd Gitlin's The Sixties: Years of Hope, Days of Rage on my to-read list. Books I've read/enjoyed in the past on the subject include Bloom &amp; Martin's Black Against Empire: The history and politicis of the black panther party as well as John D'Emilio's Sexual Politics, Sexual Communities: The making of a homosexual minority in the US, 1940-1970.\n\n\nFrom these titles it's probably clear that I'm fairly theory-inclined and am drawn to \"cultural history,\" but any possible suggestions don't necessarily have to meet those requirements. [Any particularly significant primary sources- preferably memoirs etc- would be appreciated but are not crucial].\nThanks!\n\n\nEDIT: I should add I'm only looking at the U.S.\n\nEdit 2: I copy-pasted the text of my original post but for this sub I thought I'd add that I am well-versed in Jameson's description of PoMo, as well as Brian McHale's. What I'm looking for are texts written by historians rather than literary critics which I realize may be a bit far afield in this sub but it can't hurt to ask. I think the major reason that postmodernism has not been written about from the perspective of a historian is that it's still very contemporary and therefore more the domain of literary/cultural theorists, whereas modernism is far enough removed in time that historians are writing about it. ",
        "created_utc": 1455558164,
        "upvote_ratio": ""
    },
    {
        "title": "Georg Luckacs, The Theory of the Novel, 1915",
        "author": "henryclone",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45v077/georg_luckacs_the_theory_of_the_novel_1915/",
        "text": "Would I be right in saying that his main point is that literature from the past is different because it is from the past? And after that he describes the differences.",
        "created_utc": 1455514142,
        "upvote_ratio": ""
    },
    {
        "title": "Definition of Irony?",
        "author": "Gogosox22",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45uk9n/definition_of_irony/",
        "text": "So on the show Its aways sunny, the opening credits show shots and all of the shots are dark. They say that is irony because name of the show is its always sunny. I have no evidence, but I remember learning that isn't a type of Irony. Am I wrong? Also, I have no idea if this is the right sub to ask. Thank you!",
        "created_utc": 1455506750,
        "upvote_ratio": ""
    },
    {
        "title": "Is Wordsworth's \"Lines Written in Early Spring\" a Lyric or a Narrative Poem?",
        "author": "thetreetopflyer",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45tjv4/is_wordsworths_lines_written_in_early_spring_a/",
        "text": "[Text of the poem](http://www.poetryfoundation.org/poem/181415)\n\nJonathan Culler distinguishes: \"Narrative poems recount an event; lyrics, we might say, strive to be an event.\" (*Literary Theory. A Very Short Introduction*)\n\nSince this poem is quite short and contemplative as opposed to lengthy and eventful I would think it is lyric. However, I'm thrown off by the \"I heard\", \"I sate\", etc. Wouldn't an overt speaker paired with past tense be someone who tries to \"recount an event\"?\n\nI'm also aware of Wordsworth's definition of his poetry as \"spontaneous overflow of powerful feeling [...] recollected in tranquility.\" For me, spontaneity feels more akin to the lyric, recollection more to narrative poetry.\n\nWhat do you say?",
        "created_utc": 1455491320,
        "upvote_ratio": ""
    },
    {
        "title": "Bakhtin, chronotopes, and the internet",
        "author": "ModernContradiction",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45rqit/bakhtin_chronotopes_and_the_internet/",
        "text": "I'm posting here because I am reading Bakhtin's theories lately (mostly those four in *The Dialogic Imagination*) and am having that feeling of intellectual excitement that doesn't happen every day, nor every week. I am particularly curious about his theories of the chronotope. My questions would then be: \n\n1. have his theories been advanced upon? He talks a lot about time but admits to leaving questions of space pretty open. \n\n2. Are you aware of any exemplary discussions of chronotopes in fiction, preferably something more recent rather than not? \n\n\nWhile I'm here, I'd like to ask a third, more open question, with the background being that I've been reading a lot of Bakhtin and am thinking about language and dialogic interaction as the fundamental basis for our understanding of the world:\n\n3. If a primary problem of the world today is the way that our ways of receiving knowledge / communicating has been rapidly evolving due to technology, what contemporary authors are dealing with this in the most insightful way? Don Delillo has been heavily concerned with this, as was David Foster Wallace, as well as many others. But who is publishing (relevant) books in the last five years dealing with these ideas? \n\n*edit: I don't know why that third number is a 1 when I put 3, but there you have it. ",
        "created_utc": 1455470107,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain Paul De Man's literary theory of writing as defacement and the flight from self?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45o8nn/can_someone_explain_paul_de_mans_literary_theory/",
        "text": "[deleted]",
        "created_utc": 1455418969,
        "upvote_ratio": ""
    },
    {
        "title": "What are the literary influences on Nathaniel Hawthorne?",
        "author": "ajvenigalla",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45lgkx/what_are_the_literary_influences_on_nathaniel/",
        "text": "What were the literary influences on Nathaniel Hawthorne?\n\nI am aware that Hawthorne admired authors such as John Bunyan and Edmund Spenser for their allegorical energy and vivid imagination. I am sure he was inspired by *The Faerie Queen* and *The Pilgrim's Progress*, two of the greatest allegories of all time, and perhaps their allegorical spirit helped shape *The Scarlet Letter* as one of the greatest allegories of all time as well. He also admired Herman Melville and other authors. \n\nI would like to know some more of the authors and books and stories Hawthorne admired and how they influenced his fiction.",
        "created_utc": 1455383166,
        "upvote_ratio": ""
    },
    {
        "title": "Need help finding theorists on how to read the \"I\" of a poem",
        "author": "whatevenisthis123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45l4lq/need_help_finding_theorists_on_how_to_read_the_i/",
        "text": "Basically, I'm writing my dissertation on Anne Sexton at the moment. I basically argue that she is undervalued as a poet because she was read as more confessional than her contemporaries, like Lowell or Berryman. To further explain: the reviewers at the time (who were mainly men) were easier able to empathise with the \"I\" of a Lowell poem (ie: read it as a lyric poem, almost) because the author was not any sort of \"other\" (ie: wrote nothing political about his own gender, class, or race). Meanwhile, with Sexton, her poetry is undeniably female (obsessed with menstruation, the female experience of sex, motherhood) that the typically male reader at the time would feel alienated from this and, rather than empathising with the I, read the poems in the POV of \"you\" -- heightening the feeling that the author is confessing something to them or even writing a diary. I hope this makes sense!\nI'm basically looking for theorists who talk about how we should read a poem -- should we attempt to place ourselves in the point of view of the \"I\"? Should we read poems from a distant? I'm sure \"Death of the Author\" and even Eliot's idea of poetry as an \"escape from personality\" come into play somehow here, but I've not made the puzzle pieces fit. I'm also potentially going to link this with psychoanalysis, and how psychoanalysis kind of problematised the \"I\" of a poem by making it less straightforward (ie: with Freudian theory, there are obviously multiple \"I\"s: the ego, super ego, and id).\nI know some of this may sound like rambling, but I'd really appreciate some help! I'm a longtime lurker here.",
        "created_utc": 1455379951,
        "upvote_ratio": ""
    },
    {
        "title": "Is the genre of tragedy merely what makes you sad and cry, or makes you enjoy being sad?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/45jg5w/is_the_genre_of_tragedy_merely_what_makes_you_sad/",
        "text": "I'm having difficulty understanding what makes a tragedy.  The definition in wiki (\"is a form of drama based on human suffering that invokes an accompanying catharsis or pleasure in audiences\") is confusing.  So it makes it seem as if it has to be enjoyable to cry, as if a romantic comedy type of thing where you might feel sad but not too sad.  Sort of like horror movies.  People want to enjoy being terrified, not watch a documentary of a child being tortured or something, that's TOO horrifying, not pleasantly horrifying.  Anyhow, and what about mindless tear-jerkers?  \n\nBritannica defines it this way: \"Tragedy, branch of drama that treats in a serious and dignified style the sorrowful or terrible events encountered or caused by a heroic individual.\"\n\nWhich makes me wonder what \"serious and dignified\" style means.  And what if bad things happen to non-heroic individuals, miserable people who don't overcome anything, somebody gets a bad disease and dies and his life is not heroic (like despite being poor or having terminal illness, winning a race or becoming rich or something)?\n\nOkay I'm gonna stop speculating and let you answer me.  Thank you.",
        "created_utc": 1455352471,
        "upvote_ratio": ""
    }
]