[
    {
        "title": "What's the worst colonial-American poem?",
        "author": "scarredbirdjrr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r6zhc/whats_the_worst_colonialamerican_poem/",
        "text": "I'm asking this because I believe that just as there is/was good poetry, there is/was bad poetry. Any ideas, thoughts, personal opinions?",
        "created_utc": 1385092390,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know authors, who, theoretically or practically had intetestings concepts of space and literature?",
        "author": "jazzjan",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r2q3a/do_you_know_authors_who_theoretically_or/",
        "text": "Oh mighty redditors of AskLiteraryStudies,\n\ni am currently working on a longer paper on space and literature. I found some interesting ideas and concepts in other disciplines like Foucaults heterotopia or the research on imagined geographies that is happening in Human Geographies (James Kneale is a good author to start with, if you are interested).\nBut it seems that Literary Studies themselves are still a bit blind on that spot. Of course, there is that whole postcolonial thing that started with Edward Said, but it seems to me, that their concepts are hard to use in a context that has no relation to colonialism. Besides that i only found Michail Bakhtins essay on the chronotope, that is both: Very interesting and quite esoteric.\nWhat am i missing? Do you happen to have some recommendations?\nThanks for reading this and sorry for the bad english, i am actually a germanist from, big surprise, germany ^^",
        "created_utc": 1384972072,
        "upvote_ratio": ""
    },
    {
        "title": "What is/was used in place of \"Oh my god\" in non-monotheistic cultures?",
        "author": "Kiloku",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r29m2/what_iswas_used_in_place_of_oh_my_god_in/",
        "text": "Was there something slightly common to different cultures? What expression did each culture use?",
        "created_utc": 1384960763,
        "upvote_ratio": ""
    },
    {
        "title": "What is the earliest known expression of the \"teach a man to fish\" principle?",
        "author": "red13",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r1pfy/what_is_the_earliest_known_expression_of_the/",
        "text": "I just read a comic playing with the proverb: \"Give a man a fish and you feed him for a day. Teach a man to fish and you feed him for a lifetime.\" Neither Biblical nor Chinese, this particular expression appears to be attributed to [Anne Isabella Thackeray Ritchie](http://en.wikipedia.org/wiki/Anne_Isabella_Thackeray_Ritchie), a 19th century British writer. [[1](http://www.phrases.org.uk/meanings/give-a-man-a-fish.html)], [[2](http://en.wiktionary.org/wiki/give_a_man_a_fish_and_you_feed_him_for_a_day._Teach_a_man_to_fish_and_you_feed_him_for_a_lifetime)]\n\nHowever, I'm wondering if there have been previous expressions of this same principle. What got me thinking about this was a similar quote from Benjamin Franklin's autobiography that came to mind: \n\n\"... if you teach a poor young man to shave himself, and keep his razor in order, you may contribute more to the happiness of his life than in giving him a thousand guineas. This sum may be soon spent, the regret only remaining of having foolishly consumed it; but in the other case, he escapes the frequent vexation of waiting for barbers, and of their sometimes dirty fingers, offensive breaths, and dull razors; he shaves when most convenient to him, and enjoys daily the pleasure of its being done with a good instrument.\" [[1](http://www.ushistory.org/franklin/autobiography/page61.htm)]\n\nI'd be very interested to learn of previous examples of this principle or of potential inspirations for them. Can anyone offer assistance?\n\nThank you!",
        "created_utc": 1384934511,
        "upvote_ratio": ""
    },
    {
        "title": "Thesis: In Rappaccini’s Daughter Hawthorne objectifies Beatrice, the only female character, as nothing more than the allegorical representation of science. Is that too obvious/inarguable?",
        "author": "GhostPirateRobot",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r0xxq/thesis_in_rappaccinis_daughter_hawthorne/",
        "text": "Just wanted some opinions on a thesis for my final paper in my survey of American literature class. I am supposed to be writing a research paper that includes opinions about a piece of literature from experts. I need to have a somewhat original argument. I am building off the Beatrice is the allegorical representation of science. I want to discuss sexism and female representation.",
        "created_utc": 1384911818,
        "upvote_ratio": ""
    },
    {
        "title": "Research Q:What does or doesn't make Reddit a good research tool for the English classroom? (x-post DigitalHumanities)",
        "author": "L51",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r0rrg/research_qwhat_does_or_doesnt_make_reddit_a_good/",
        "text": "I'm working on a project for a digital humanities/rhetoric class.  Asking this question of this forum is not only allowed, it is encouraged. In no way will responding to my question be \"doing my homework for me,\" as I am only looking for interesting ideas and quotes, and will cite anything used. Proof, once completed, can be provided.\n\nSo, how would you use Reddit as a research tool in the classroom? What subreddits would be most useful? What do you think it offers that other research tools do not? Any other comments or ideas that do not directly address these questions are useful as well.  Because my argument is pro-Reddit as a research tool and is not directly addressing a counterargument, I would prefer positive answers, though pointing out potential flaws in the concept is valuable as well.  Thank you in advance to anyone who responds!\n\nedit: Thanks to those who responded to my meta-question.  It gave me some great fodder.\n",
        "created_utc": 1384907756,
        "upvote_ratio": ""
    },
    {
        "title": "Advice on taking notes while reading literature",
        "author": "rusmaul",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r0rmm/advice_on_taking_notes_while_reading_literature/",
        "text": "(I searched a bit and didn't find any posts like this, so my apologies if this is redundant.)\n\nIn high school, I attended a creative writing program at my state arts school. It did a much better job of introducing me to the study of literature than any English class I took in high school. In my time there, though, I failed to develop one skill that I'm now beginning to wish I had: taking notes on the text while reading. I always hated the idea of writing in my books (still do), so I never took notes in English classes; I carried this over to the creative writing program, which was possible because all of the tests comprised fairly directed open-book essays. This gave me time to mull over the text and decide how to approach the topic, and, when we had our discussions (usually the day following the test), I would be prepared to join the conversation thanks mainly to the thought that went into taking the test.\n\nHowever, I'm finding myself a bit more challenged in university. I'll read the book as I'm used to doing it, taking no notes, but when it comes time to discuss in class I find myself almost silent. I suspect this is because I'm no longer forced to engage with the text beforehand like I was while taking the tests back in the writing program. It's not that I'm really forgetting any of the factual details about character or plot; I just find I have very little to add to a discussion.\n\nThen, when it comes time to write a paper (unprompted, unlike the ones I had to write in the writing program), I find myself lost entirely. I've done well on the few that I've done so far, but the premises for those papers only came after a few hours of me flipping back through the text, trying to latch on to some idea. This feels way too scattered to keep doing, and I know there's a better way.\n\nI think the answer to both of these problems would be to take notes while I'm reading. I'm about to put this to the test by rereading Tolstoy's *Childhood* (which we just read, so it's fresh in my mind) and taking notes. Does anybody have any tips, particularly when it comes to filtering what's important to take not of? I'm concerned that I'm going to end up writing down far too many minor details and end up with a bunch of disordered ideas that will be no more helpful than flipping through the book was.\n\ntl;dr: I've never bothered taking notes before while reading a book; I think it's holding me back; I want to start now, so I'm looking for advice.",
        "created_utc": 1384907676,
        "upvote_ratio": ""
    },
    {
        "title": "The Country Wife by William Wycherley",
        "author": "MoonisaSickleCell",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r0mfb/the_country_wife_by_william_wycherley/",
        "text": "How do you think women are viewed in the play? I don't know what Wycherley's personal views on women were and there are a lot of misogynistic monologues but all the characters seem to be equally foolish and cynical, male and female. Also, Alethea Pinchwife is probably the most admirable person in the play. And there is the line about \"But methinks wit is more necessary than beauty.\" ",
        "created_utc": 1384904248,
        "upvote_ratio": ""
    },
    {
        "title": "Where was the story \"Thank You M'am\" by Langston Hughes published and who was the publisher :\\",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r0ird/where_was_the_story_thank_you_mam_by_langston/",
        "text": "",
        "created_utc": 1384901988,
        "upvote_ratio": ""
    },
    {
        "title": "The Fall of the House of Usher",
        "author": "Jakobissweet",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1r060w/the_fall_of_the_house_of_usher/",
        "text": "I am currently attempting to write a character analysis on Roderick Usher thats thesis is that the House, Lady Madeline, and the narrator are aspects of Roderick's mind all depicting his progressively debilitating mental illness. It is for a class at my school, and it requires me to use scholarly articles to re-affirm my statements. The issue is that I am having trouble finding such articles! A link to somewhere I could find something, or anything really, would be greatly appreciated! Thank you!",
        "created_utc": 1384894205,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Poetry/Doggerel from the American Colonial Period",
        "author": "scarredbirdjrr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qxvqu/bad_poetrydoggerel_from_the_american_colonial/",
        "text": "I've got a project due for american lit and I need help with this ASAP. PLEASE",
        "created_utc": 1384823437,
        "upvote_ratio": ""
    },
    {
        "title": "Prof wants me to explain a poem in psychological terms-- how would one go about that?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qxofn/prof_wants_me_to_explain_a_poem_in_psychological/",
        "text": "The poem is \"On Something that Walks Somewhere\" by Ben Jonson",
        "created_utc": 1384818501,
        "upvote_ratio": ""
    },
    {
        "title": "Question on Kurt Vonneguts Slaughterhouse V and how Billy Pilgrim \"has come unstuck in time\".",
        "author": "peffi",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qx8jh/question_on_kurt_vonneguts_slaughterhouse_v_and/",
        "text": "Hey there, /r/askliterarystudies, I hope I am in the right place here to ask a question about a book we are reading in English class (I am from Germany, so bear with my English). Now this has really nothing to do with homework or assignments but just a question that came up when we discussed the phrase \"Listen: Billy Pilgrim has come unstuck in time.\"\n\nIt's right at the beginning of the second chapter and refers to the protagonists \"ability\" to change what time in his life he experiences, although without him being able to control when it happens and to where he travels in time. We haven't talked about the \"ability\" a lot yet but as far as I understood it, it's a mix of his post traumatic stress disorder he got during/after the Second World War and the plane crash he survived 20 years after, where he hit his head and lost his wife in another traumatic accident right after. \n\nBut the problem lies in pinpointing when he actually got the \"ability\" to experience past events in his life. In chapter two, it says \"Billy says that he first came unstuck in time in 1944, long before his trip to Tralfamadore.\" But he says that in the context of him being on a radio show in 1968, right after his plane crash. Surely, it would mean that until the plane crash, he wasn't able to \"come unstuck in time\" but the first event he can jump back to, is in 1944. In this case, he would not be telling the truth in the radio show because before the plane crash he never seemed to go back in time, since his wife (or was it his daughter?) remarked that he changed so much since the accident and it was only then when he invented his story about the aliens, who view time just like he does. \n\nMy teacher and lots of people in my class agreed that he seemed to have the \"ability\" (basically the trauma) the first time in 1944 and that this was the time that triggered his ability to \"come unstuck in time\". But in the protagonists small biography in the beginning of chapter 2, it never said that he gained this \"ability\" in 1944 but he talked about it the first time in 1968.\n\nThis is really complicated, due to the time travelling, so I hope I could make you understand the issue.\n\nThanks for your answers in advance.\n\nEdit: Corrected some grammar and spelling",
        "created_utc": 1384808657,
        "upvote_ratio": ""
    },
    {
        "title": "How did Harper Lee affect society via her book \"To Kill a Mockingbird\"?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qv4wi/how_did_harper_lee_affect_society_via_her_book_to/",
        "text": "",
        "created_utc": 1384739890,
        "upvote_ratio": ""
    },
    {
        "title": "The Satanic Verses - what am I missing?",
        "author": "trashed_culture",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qraux/the_satanic_verses_what_am_i_missing/",
        "text": "I'm about halfway through the Satanic Verses.  The last thing I was reading about a group of people about to undertake a pilgrimage to mecca. \n\nI feel like I'm missing a lot in this story.  I don't have much background in abrahamic religions, including Islam.\n\nA key thing I don't understand is how the two main characters, Gibreel and Saladin come to be an angel and devil.  I can see that Gibreel is being treated like an angel, and Saladin like a devil, or at least an imp.  I don't see if there is something about them that makes them good or bad.  At first I thought it was a kind of irony, because Saladin is treated so poorly in England, that really he should be treated like an angel instead?  Are they supposed to be modern day representations of the same battle going on in the dream sequences?\n\nSpeaking of dream sequences - so far I see it like this: Islam is brought into the city, and it's a threat because of it's monotheism.  Islam does battle with some representative gods of hindu polytheism and generally gains ground.  Then, for some reason, Islamic leaders go to another town and from there decide to take a pilgrimage to Mecca.  Except it's suddenly no longer ancient times, but modern.  (the reluctant man says ~take my car to get there faster~, despite all previous references being to carts and walking and ships, not planes).\n\nSo, what background am I missing?  Will I understand it better as I go along?\n\nThanks",
        "created_utc": 1384607897,
        "upvote_ratio": ""
    },
    {
        "title": "How much did the first audiences of Shakespeare's plays actually understand? (Warning: uneducated rant)",
        "author": "anonpost17",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qqz3i/how_much_did_the_first_audiences_of_shakespeares/",
        "text": "This has bothered me for a long time. I've always found Shakespeare in live performance to be an utterly exhausting and unpleasant affair. The task of interpreting the dialect puts my mind in overdrive for the full length of the play, and that's just to process the literal meaning of what's being said. I've been told I need to just loosen up, but I'd really like to know how 'loosely' or distantly the original audiences were listening. It's one thing to muse over one of Shakespeare's lines at one's own pace and with a scholarly edition, but how on earth did the original Elizabethan audience do it with _no text_ and in _real time_!? (Not to mention standing upright in the dirt, in rainy English weather!) Did they pay to see the same play multiple times? Did they take notes? Did their illiteracy free up some part of their brain for super verbal processing powers? \n\nI happen to be trained in textual interpretation, but it can still takes me _hours_ to unpack a single poem or chapter or prose; and that's with the aid of an ever-present _text_ that I can read back-to-front in my own time. How the fuck did an illiterate peasantry do it _in real time_!!? Relative to Shakespeare's implied or ideal reader (or listener, I suppose) I actually feel like I have a learning disability. I'm not kidding. (See this video: https://www.youtube.com/watch?v=jZhRf2fxlyw---this is _exactly_ how I feel.) Going to see Shakespeare is like playing a video game on \"nightmare\" mode: \"You didn't quite get that line? Well tough shit, that was your _one_ opportunity to hear it, and now it's gone---now keep up with the next line or you'll miss that too.\" And even when by some miracle I manage to parse the literal sense of a line, I can't afford to explore its multiple meanings without risking a 'micro-daydream' that obliterates the next five lines of dialogue.",
        "created_utc": 1384586379,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a list of French literature cited by Milan Kundera",
        "author": "AstroAztec",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qpf86/looking_for_a_list_of_french_literature_cited_by/",
        "text": "Hi  everyone, I've been unsuccessfully looking for a list of French literaure cited by Milan Kundera in 'The Curtain'. It was a poll of French intellectuals taken in the late 20th century and published by a Paris newspaper (he does not mention which newspaper) and the specific question that was posed: \"What are the books that have made France what it is?\" Some of the entries he mentions:\n\nLes Miserable - Victor Hugo (1)\n\nWar Memories - Charles de Gaulle (11)\n\nThe Red and the Black - Stendhal (22)\n\nMadame Bovary - Gustave Flaubert (25)\n\nGerminal - Emile Zola (32)\n\nThe Human Comedy - Honore de Balzac (34)\n\nIf anyone knows where to find a copy of this list or can remember which publication compiled it, I would be very grateful.",
        "created_utc": 1384539362,
        "upvote_ratio": ""
    },
    {
        "title": "Any advice on studying Macbeth?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qontc/any_advice_on_studying_macbeth/",
        "text": "Hello, I have a yearly English lit exam coming up. The topic is about Macbeth. The problem is I was hospitalized for most of the semester, and apart from a play I just booked to watch, I am quite inexperienced with the play. My exam is in 5 days. What is the best way to study it? I was thinking, Sparknotes. I don't know what else? Does anyone have any tips?\n\nRegards,",
        "created_utc": 1384513080,
        "upvote_ratio": ""
    },
    {
        "title": "Russian vs. English Lit for BA",
        "author": "rusmaul",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qod3z/russian_vs_english_lit_for_ba/",
        "text": "I'm a first year undergraduate, and one of the two options I'm considering pursuing is literature. The default option, then, would be to go with English, but a large part of me is far more attracted to the idea of doing Russian instead. I'm currently taking a survey of 19th Russian literature, and I'm in love with everything we're reading. I would definitely enjoy studying English literature, probably just as much as Russian, but I'm also considering the size of the departments. I'm at a relatively large public university, and the English department is obviously glutted with students compared to the tiny Russian department. I'd like to pursue an Honours degree, which would involve more credits and a senior thesis, and from what I've seen this would be easier to do with Russian; the English department, being so much larger, has much stricter prerequisites for joining the Honours program.\n\nThe concern that brings me here is that, no matter what I do, I'm going to want a strong foundation for studying literature later on, be it Russian or anything else. I know every university is different, but in general: will a strictly Russian literature-based curriculum prepare me well to study literature in general? Or is that goal far better served by an English-based curriculum?",
        "created_utc": 1384496921,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to remember the name of a poem.",
        "author": "Telamonian",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qmrla/trying_to_remember_the_name_of_a_poem/",
        "text": "There is a poem that I read a few years ago and it is on the tip of my tongue, but I just cannot remember the name or even style or time period. Basically it is about how when you fall in love, or are already in love, telling other people how in love you are will make it lose its meaning. At the same time, if love is just understood and not constantly declared, people might confuse it for lack of love. I also distinctly remember a reference to the myth of Philomela. Unfortunately I do not remember the context. Any help would be greatly appreciated!",
        "created_utc": 1384455152,
        "upvote_ratio": ""
    },
    {
        "title": "Good Parodies of bad poems/poetry",
        "author": "scarredbirdjrr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qlg66/good_parodies_of_bad_poemspoetry/",
        "text": "I'm doing a project on parodies of bad poems, and thought that you guys could give me a hand. How about it?",
        "created_utc": 1384406164,
        "upvote_ratio": ""
    },
    {
        "title": "When was the poem St. George, by Nancy Senior, first published?",
        "author": "qmechan",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qi8r0/when_was_the_poem_st_george_by_nancy_senior_first/",
        "text": "Cannot find this for the life of me.",
        "created_utc": 1384310066,
        "upvote_ratio": ""
    },
    {
        "title": "How do you find information about the number of print runs/editions of novels?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qgp2b/how_do_you_find_information_about_the_number_of/",
        "text": "Is there a good source for looking up the number of copies a specific novel has sold and when? I've already looked at all the contemporary reviews and more recent secondary sources on the author that I can find. \n\nWould the Library of Congress, for instance, have some service that I could use? Or some secret book where all the publication info about books printed in the US are stored? ....I know this probably doesn't exist, but, just maybe ya'll might know a resource that I'm unaware of. \n\nSpecifically, I'm looking for information about Mary Murfree's 1886 novel *In the Clouds*. ",
        "created_utc": 1384273611,
        "upvote_ratio": ""
    },
    {
        "title": "Any advice for someone applying to PHd programs as a theorist?",
        "author": "buckykatt31",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qf46n/any_advice_for_someone_applying_to_phd_programs/",
        "text": "I'm working on my applications for MA/Phd programs. I've been writing multiple drafts of my statement of purpose, and I am having some trouble. My main interest is theory/psychoanalysis/continental philosophy rather than a specific period of literature. \n\nI feel as if the fear of the politics of theory loom to much in my mind as I try to write my statement. Any advice from people who have succeeded this way?",
        "created_utc": 1384217554,
        "upvote_ratio": ""
    },
    {
        "title": "Metaphysical Estrangement??",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qea18/metaphysical_estrangement/",
        "text": "Could you please explain how someone could be estranged from a community not by an objective situation but by his own conceptions of the world?",
        "created_utc": 1384198178,
        "upvote_ratio": ""
    },
    {
        "title": "What was the difference between the Transcendentalists, Anti-Transcendentalists, Dark Romantics, etc. in the US during the 19th century?",
        "author": "RenaissanceMan-God",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qd7y4/what_was_the_difference_between_the/",
        "text": "The entire American Romantic movement seems really complicated. I've searched around (Reddit and the rest of the web) and nothing really explains it well. In essence, what was the difference between all these groups and what were the American Romantics really trying to say (other than \"whooh nature!\")?",
        "created_utc": 1384161493,
        "upvote_ratio": ""
    },
    {
        "title": "I want to get a Master's degree in English Literature. Which schools are thought highly of in this field?",
        "author": "MegaOctopus",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1qbykp/i_want_to_get_a_masters_degree_in_english/",
        "text": "Everything is pretty much in the title.  Which English programs have a good reputation?  I don't know much.  So, any advice would be appreciated.  ",
        "created_utc": 1384120526,
        "upvote_ratio": ""
    },
    {
        "title": "How \"in the air\" was hypertext in the 1980s?",
        "author": "sopen",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1q18g0/how_in_the_air_was_hypertext_in_the_1980s/",
        "text": "I was somewhat aware that \"hypertext theorist\" was a thing around 1995. And I was wondering how much of a hypertext dream existed in the 1980s and so on. And, for that matter, why the number of hypertext new-form experimental novels turned out to be 'just a handful', so far as I can tell. People seemed so into the promise of new ways to tell stories for a little while there.\n\n(I'm somewhat more aware of hypertext history from the technical side -- Xanadu, Hypercard, etc.--but never knew about any of this until HTML pushed into the public eye.)",
        "created_utc": 1383756142,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to remember a poem...",
        "author": "steve_z",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1q01nm/trying_to_remember_a_poem/",
        "text": "I think there's a guy sitting next to a window, looking out and watching the leaves change as he grows old, and he wonders if anything matters... but it does, his lover has made it all worthwhile. I know this is in one of my fucking anthologies but I can't find it for the life of me. The word \"autumn\" may be in the title. Cheers\n\nedit: here are keywords for the poem, sprung out of my head - man, winter, autumn, change, aging, time, meaning, accomplishments, love",
        "created_utc": 1383707872,
        "upvote_ratio": ""
    },
    {
        "title": "Outer Dark by Cormac McCarthy",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1q0162/outer_dark_by_cormac_mccarthy/",
        "text": "Hello! I am reading the book Outer Dark by Cormac McCarthy. I have a question about the novel, and so if anybody has read it, I would appreciate it if you could comment below so I can ask you a question. It is strictly plot based, about something I don't understand.\nThank you!",
        "created_utc": 1383707506,
        "upvote_ratio": ""
    },
    {
        "title": "It's not a catch-22... but what is this?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pzae6/its_not_a_catch22_but_what_is_this/",
        "text": "Is there a term for when performing an action would subsequently render that action useless?\n\nExample: You have $50. You spend your $50 on a nice wallet to keep your money in. Now you have no money to put in it, and it has defeated the purpose.\n\nKind of similar to a catch-22 but not really.",
        "created_utc": 1383688611,
        "upvote_ratio": ""
    },
    {
        "title": "I don't get the reference",
        "author": "TooCloseForComfort",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pyi7e/i_dont_get_the_reference/",
        "text": "In Christian Kracht's Imperium, in the end of chapter four, August Engelhart sees a Berliner eating sausages in the rain on Alexanderplatz. The narrator says that this German later will be painted (that is, a picture will actually be painted) like that.\n\nWho is he? What picture are we talking about here? Help!\n\nEdit: Clarifying language. I'm translating on the fly here.",
        "created_utc": 1383669567,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone provide me with a PDF of \"Esther Newton: Mother Camp\"?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pwsch/can_anyone_provide_me_with_a_pdf_of_esther_newton/",
        "text": "I need it for college and can't find it in any book stores.  I'd really appreciate it.\n\nIf this is the wrong place to ask, please point me in the right direction and I'll delete this thread.",
        "created_utc": 1383607933,
        "upvote_ratio": ""
    },
    {
        "title": "Help me remember a term!",
        "author": "Hank_Fuerta",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pumy5/help_me_remember_a_term/",
        "text": "It's a literary term used to describe writing that takes on the qualities of the thing(s) being described. For example, if something boring is being described, the writing becomes boring itself. It's on the tip of my tongue and bothering the crap out of me. ",
        "created_utc": 1383533853,
        "upvote_ratio": ""
    },
    {
        "title": "Has there ever been a novel written by someone who never read a novel?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pu5yv/has_there_ever_been_a_novel_written_by_someone/",
        "text": "",
        "created_utc": 1383520448,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to remember a poem by Alexander Pope...",
        "author": "RowdyRabbi",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1ps5co/trying_to_remember_a_poem_by_alexander_pope/",
        "text": "Several years ago I read a poem that I am almost certain was by Alexander Pope and there was a section about a mermaid that I wrote down in a notebook (one that has since gone missing). Does anyone out there remember any striking passages wherein Pope writes about mermaids or uses a mermaid analogy? Sorry there's not much to go on. If anyone could solve this for me I'd be ecstatic. I actually offered my students a five dollar reward if any of them could locate it before I did.",
        "created_utc": 1383438744,
        "upvote_ratio": ""
    },
    {
        "title": "What romantic poem should I write on?",
        "author": "GeoffreyDaGiraffe",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1ps502/what_romantic_poem_should_i_write_on/",
        "text": "I'm taking an elective at university on romanticism, in the frame of how it criticizes enlightenment thinking relating to climate crisis. That is to say it was during the enlightenment period that we as humans really began shifting our mode of thinking which lead us down the path of destroying the world and nature. \n\nI have to pick a poem from one of the big 5 romantics and analyze it in this frame, I can draw from other poems and poets as as support/contrast but I have to focus on one poem specifically. ",
        "created_utc": 1383438447,
        "upvote_ratio": ""
    },
    {
        "title": "Bad American Poems",
        "author": "scarredbirdjrr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pn5ts/bad_american_poems/",
        "text": "Now we all know about poems that are american classics, Langston Hughes, Walt Whitman and the like, but what about *bad* american poetry. \n\nI'm doing a project on it, and was wondering if you guys could give me some pointers in the right direction.",
        "created_utc": 1383253445,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding the typical concepts and ideas found in Metaphysical Poetry.",
        "author": "camo2227",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pgh32/understanding_the_typical_concepts_and_ideas/",
        "text": "I am studying many metaphysical poets such as Donne and Jonson for my concept for my extension 2 course. I was led to believe that they were overtly critical of and satirical towards religion but i am finding it hard to see this. Can somebody please explain the typical concepts and ideas explored in Metaphysical Poetry and possibly the context too.",
        "created_utc": 1383045525,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any modern poems that has an unchanged, repeating chorus?",
        "author": "ylaena",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pe5sz/is_there_any_modern_poems_that_has_an_unchanged/",
        "text": "In 20th and 21st century poetry, musicality rarely entails set rythm and rhyme structures. Instead, the language moves towards Kristevas *semiotic* sphere (among other things, of course). And - I argue - it uses some of the same principles of structuring as those you find in music. Now, I can come up with a lot of examples of literary fugues, variation forms, etc. But when it comes to the **rondo**, I'm at a loss. Celans *Todesfuge* and Eliots *Prufock* is close, but the function of the repeating parts isn't necessarily as a unchanged \"chorus\". Do you guys have any better examples?",
        "created_utc": 1382976479,
        "upvote_ratio": ""
    },
    {
        "title": "Theories about identity formation?",
        "author": "elseaelsea",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pe4j1/theories_about_identity_formation/",
        "text": "Hello /r/AskLiteraryStudies! I was looking for suggestions on theories I might want to research that pertain to identity formation. I've been suggested \"Imitation and Gender Insubordination\" by Judith Butler, which has been great, but I'd like to get a broader scope of lit theory pertaining to how an identity--ANY identity--is created, performed, maintained, etc. I would especially love recommendations on how racial identity is formed/performed.\n\nThanks!\n",
        "created_utc": 1382975574,
        "upvote_ratio": ""
    },
    {
        "title": "Who are some authors known for approaching the idea of \"literary writing\" with a critical tone in their work?",
        "author": "nycdk",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1pcfo6/who_are_some_authors_known_for_approaching_the/",
        "text": "I feel as if usually these are humorous writers - George Saunders, Don Barthelme, Kurt Vonnegut, Roberto Bolano (to an extent). You can read them and come across certain points where they're actively trying to move away from the idea of \"literary\" writing in order to just right a good story. \"Antipoetry\" by Nicanor Parra is another good example. They actively detest the mold or move for direct meaning in their forms. \n\nThoughts?",
        "created_utc": 1382915984,
        "upvote_ratio": ""
    },
    {
        "title": "John Keats' narrative technique in 'The Eve of St. Agnes'",
        "author": "lonelyboii",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1paum8/john_keats_narrative_technique_in_the_eve_of_st/",
        "text": "I am to analyze Keats' technique as a naarative poet in 'The Eve of St. Agnes'. \nCould someone please highlight what I should be discussing in my essay so that I have some basic idea of how to go about it. \nWould really appreciate the help. \nThank you",
        "created_utc": 1382855152,
        "upvote_ratio": ""
    },
    {
        "title": "What reading techniques and tips have you used to improve comprehension?",
        "author": "Jb0289",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1p8yxw/what_reading_techniques_and_tips_have_you_used_to/",
        "text": "Possibly odd to ask in /r/askliterarystudies, but my reason for doing so is to hopefully get more experienced answers from people who read with a little bit of rigor. I would like to think I have good reading skills, but I would like to improve on this, there are still some things I miss when reading, so out of curiosity what techniques and skills when reading can be used to really grasp a reading in depth. I take notes, review as I go along, and I consciously slow myself down to really read \"word for word,\" but I would like others opinions, so from the *ground up*, how do you read efficiently?\n\nI guess I'm wanting to review, test, and refine my own methods.",
        "created_utc": 1382779278,
        "upvote_ratio": ""
    },
    {
        "title": "Straight From BA to PhD?",
        "author": "shreekingeels",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1p7t7n/straight_from_ba_to_phd/",
        "text": "How common is it to go straight from your bachelors into a doctorate program? I've heard conflicting things and was hoping to get a few more answers. As I look through faculty profiles, I've noticed that almost no one skips an MA. Is this the case? Thanks so much!",
        "created_utc": 1382732837,
        "upvote_ratio": ""
    },
    {
        "title": "Characteristics of Romantic poetry",
        "author": "pulpish",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1p72wb/characteristics_of_romantic_poetry/",
        "text": "Hello /r/AskLiteraryStudies,\n\nI am taking a course that covers poems written during the Romantic Era. Blake, Burns, Byron, Shelley, and Wordsworth are some of the authors we deal with.\n\nI am having trouble understanding what is so special about Romanticism, and what features I should look out for while reading a poem that would define it as Romantic. \n\nCould somebody please offer some insight about the Romantic period and how it is significant in these poems? My professor always points out, for example, if the speaker in the poem seems to be self-obsessed, then that is a Romantic feature. \n\nI just don't understand it, and reading about history didn't really help me either. Are there specific elements I should notice when reading Romantic poetry? ",
        "created_utc": 1382713227,
        "upvote_ratio": ""
    },
    {
        "title": "What Old English poem am I thinking of?",
        "author": "5972376",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1p244i/what_old_english_poem_am_i_thinking_of/",
        "text": "It's on the tip of my tongue and driving me crazy. It is about a woman who is visited by her lover or husband who she thought to be dead (I think). The two of them end up on a boat where the man turns into a giant devil, sinks the ship, and drags them both into the sea. ",
        "created_utc": 1382545352,
        "upvote_ratio": ""
    },
    {
        "title": "The Kite Runner by Khaled Hosseini",
        "author": "Rdeasnuts",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1owujj/the_kite_runner_by_khaled_hosseini/",
        "text": "Reading the kite runner, i was confused on if kite runner should be taught by american literature or world literature set in the middle eastern zone. It is an american book, published in american and Hosseini is an \"afghan-born american novelist\". But my understanding of american literature is mostly from 1700's til Early 1900's, not including recent books (1980's-present) while world lit contains every area. but, The Kite Runner focuses on the cultural aspects of the middle east, giving it a worldly perspectives to americans. Do you think The Kite Runner should be taught in american literature or World Literature and why?",
        "created_utc": 1382374615,
        "upvote_ratio": ""
    },
    {
        "title": "Grad Programs with Strong Emphasis in Religion/Spirituality Studies?",
        "author": "shreekingeels",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1ovhuh/grad_programs_with_strong_emphasis_in/",
        "text": "Hi all, I'm currently looking into Grad programs in literature and my biggest interest (alone with post-structuralism) is religion in literature, particulary in 19th and 20th century American literature. Can anyone recommend programs with faculty who specialize in this area? Thank you!",
        "created_utc": 1382321480,
        "upvote_ratio": ""
    },
    {
        "title": "Application of narrative paradigms outside of literature",
        "author": "themaccattack1983",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1ouu6w/application_of_narrative_paradigms_outside_of/",
        "text": "Hi all,\n\nI'm hoping that this is in the right place, so my apologies if not...\n\nI'm currently trying to research the application of narrative paradigms as a way to cross boundaries within varying disciplines, looking specifically at the diversity of modern society/culture and how most postmodern critical/analytic outlooks are no longer well-enough equipped to handle the myriad of media that we have access to in the information age.\n\nWould anybody happen to have any interesting applications/examples/texts that deal with this kind of thing by and chance?\n\nI'm familiar with narrative theory and some of the emerging analogical methodologies being used in engineering/computing, which have provided a great start. Ideally, I want to delve further than just the existing usage of narrative that has existed in art/architecture/psychology etc. for several decades and look to other, perhaps less know, examples.\n\nAny help at all would be hugely appreciated!\n\nThank you",
        "created_utc": 1382302255,
        "upvote_ratio": ""
    },
    {
        "title": "A question regarding Romanticism and poetry.",
        "author": "WhatsInAName39",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1orr3k/a_question_regarding_romanticism_and_poetry/",
        "text": "A question was asked in class today - how does the use of nature in romantic poetry serve to define the human self? I was wondering what your perspectives are. Thank you!",
        "created_utc": 1382179232,
        "upvote_ratio": ""
    },
    {
        "title": "Need help finding a secondary source to support my thesis (for an ENG essay critiquing Atwood's 'Variations On The Word Love') - am I understanding my Prof's instructions?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1oriol/need_help_finding_a_secondary_source_to_support/",
        "text": "Long story short, I was planning on using Chuck Palahniuk's '*Choke*' as a secondary source, as the main characters analysis of the experience/definition of love was similar (IMO) to Atwood's. \n\n***I decided against Palahniuk since it was a fiction (based on truth) novel and my professor - who is out of town and not answering e-mails now - sent out an e-mail saying we may use \"journal articles, books, and/or chapters in books\"....am I wrong to assume that I should abandon Choke and find another source? He also mentioned something about literary criticism...a little unsure here (this probably sounds terribly stupid so I apologize in advance)?***\n\nIf anyone could help me on how to search for an article/book/anything to help me with this, that would be amazing! I know how to use the online library of my university to search for articles, but I usually only do so for psychological experiments - this is new for me! ",
        "created_utc": 1382163269,
        "upvote_ratio": ""
    },
    {
        "title": "Poems (mainly) or other literature regarding Love, specifically what Love is.",
        "author": "dotdotdotto",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1orhpb/poems_mainly_or_other_literature_regarding_love/",
        "text": "Assuredly a great deal of works deal with Love in some aspect or another. I am looking for great, classic works that discuss or address what Love is, in that the works will deliberate the meanings and conditions of Love, rather than a Love story one draws meaning from. I will happily receive any suggestion, however, I feel as if poetry holds the most poignant (not to mention succinct) results. Thank you in advance, you beautiful literary people you...",
        "created_utc": 1382161881,
        "upvote_ratio": ""
    },
    {
        "title": "What insights have been drawn from the poetry written by Henry VIII, Elizabeth I, and Mary Queen of Scots?",
        "author": "Biomancer",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1oqtg8/what_insights_have_been_drawn_from_the_poetry/",
        "text": "",
        "created_utc": 1382136041,
        "upvote_ratio": ""
    },
    {
        "title": "Theory relating to Ulysses",
        "author": "wilky27",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1oqp5p/theory_relating_to_ulysses/",
        "text": "My friend and I have decided to start reading theory along with the fiction that we are reading and I was wondering what would be good to read along side of Ulysses.",
        "created_utc": 1382132302,
        "upvote_ratio": ""
    },
    {
        "title": "Which aspects of critical/literary theory are useful for a beginning fiction writer?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1opouw/which_aspects_of_criticalliterary_theory_are/",
        "text": "Which introductory subjects could help a fiction writer improve his reading and writing skills?",
        "created_utc": 1382103133,
        "upvote_ratio": ""
    },
    {
        "title": "Are there resources for contemporary criticism that don't require academic access?",
        "author": "BHawkeye",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1oo3zu/are_there_resources_for_contemporary_criticism/",
        "text": "As much as I wish I could have remained in school forever, I had to join the real world eventually. Unfortunately, it's not really in my budget to be purchasing articles piecemeal from JSTOR. What are my options?",
        "created_utc": 1382042879,
        "upvote_ratio": ""
    },
    {
        "title": "Foucault vs. Nietzsche/ Discipline and Punish (The Panopticon) vs. The Will to Power/ New Historicism vs. Deconstruction Please help.",
        "author": "wsdmskr",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1o6y91/foucault_vs_nietzsche_discipline_and_punish_the/",
        "text": "I'm trying to write a paper about these two approaches to literary theory, I just can't seem to crystallize my thesis. These are some of the comparisons I'm looking at. Am I way off base?\n\nFoucault vs. Nietzsche:\n\n* Regulation of individual's power vs. Individual's instinctive drive for power\n\n* Internalized \"concepts\" of power vs. \"Truth (like power) based on interior \"illusions\"\n\n* Control is effected through perception vs. No \"right\" perception\n\n* \"Knowledge-power relations\" vs. \"It is the powerful who made the names of things into law..\"\n\n* Categorization of the \"Leper\" vs. \"The inventive force that invented categories labored in the service of... our need for security...\" \n\n\nMy general thrust, I suppose, is that the power of the signifier confers power on those who do the signifying (for example when the State declares a man \"insane\" society adapts a new set of principles by which it deals with that man). Yet, I feel like I'm off in the weeds with that approach, almost as if I'm being distracted by their philosophy instead of how it applies to literary criticism.\n\nCan anyone with a greater understanding of these two authors point me in a general direction? This is my first graduate level class and I feel like I may be missing something.\n\nThanks for any and all pointers!\n\n",
        "created_utc": 1381458590,
        "upvote_ratio": ""
    },
    {
        "title": "Etymology question. Where did the \"k\" in \"knowledge\" come from? Strange as it looks, shouldn't it be \"gnowledge?\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1o6mnb/etymology_question_where_did_the_k_in_knowledge/",
        "text": "",
        "created_utc": 1381449415,
        "upvote_ratio": ""
    },
    {
        "title": "What do you guys think of Literary Darwinism? Doesn't it 'box' literature?",
        "author": "bluepwrranger",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1o5f3n/what_do_you_guys_think_of_literary_darwinism/",
        "text": "",
        "created_utc": 1381419609,
        "upvote_ratio": ""
    },
    {
        "title": "Question Regarding Story by Edgar Allan Poe",
        "author": "thegabbinist",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1o52xy/question_regarding_story_by_edgar_allan_poe/",
        "text": "Begging pardon if this is a stupid question, but in *The Unparalleled Adventure of One Hans Pfaall*, the narrator describes a balloon (what I'm assuming is a hot-air balloon) as  having \"...by way of car, an enormous drab beaver hat\". \n\nNow, I assumed \"car\" meant \"carriage\" (I looked it up afterwards to be sure), but I'm still a little uncertain if what I'm understanding is what was supposed to be conveyed. It's a hot-air balloon with the carriage part being an upturned beaver hat? ",
        "created_utc": 1381409920,
        "upvote_ratio": ""
    },
    {
        "title": "What is the importance of blindness in literature?",
        "author": "cholt150",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1o4c2a/what_is_the_importance_of_blindness_in_literature/",
        "text": "For my AP Literature class, one of our recent assignments is to analyze the importance of blindness in two plays, *King Lear* and *Oedipus Rex*. I already have a good idea of what my analysis should be, but I was also looking for some input from complete strangers who also happen to be literary scholars. I recognize that Blindness is a trait used in literature to emphasize strengths, morally or otherwise, as well as being used to symbolize a greater weakness of character, or moral/emotional blindness, as seen in the latter part of *Oedipus Rex*. All I am really wondering is how exactly does blindness contribute as a theme to Literature in general, and why is it so important, aside from my aforementioned common symbolisms that I have already noticed. Any input with this would be greatly appreciated. Thanks!",
        "created_utc": 1381377155,
        "upvote_ratio": ""
    },
    {
        "title": "References for learning about colonialism and postcolonialism",
        "author": "UniformConvergence",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1o13si/references_for_learning_about_colonialism_and/",
        "text": "Hello /r/AskLiteraryStudies! I have very little background in literary studies, but I'd like to learn more about colonialism and postcolonialism. I'm interested in decolonial aesthetics and the way in which Western ideals of beauty have come to dominate discussion about art and aesthetics, and more generally, the dominance of the Western intellectual tradition in literary studies.\n\nI'm open to any reading recommendations since I don't know much about the field, though books and articles that are beginner friendly (do such things exist?) are particularly appreciated. Thanks!\n\nEDIT: Thanks for all the suggestions guys! I now have a good base of books with which to start reading about postcolonialism.\n",
        "created_utc": 1381282745,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for help with a phrase found many times in Tom Brown's School Days - Thomas Hughes, 1857.",
        "author": "letshaveawank",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nzzdr/looking_for_help_with_a_phrase_found_many_times/",
        "text": "Sorry if this is the wrong sub, but I thought that this problem would fit in better here than in /r/linguistics, as it is tied directly to a book. \n\nI read Tom Brown's School Days today, and found the phrases 'You can go to Bath, Bill! / You go to Bath, Bill! / and you're in Bath, Bill!' repeated quite a few times through the book. \n\nIn context, it seems to be used much as someone today would say 'go to hell!'.\n\nWas Bath considered a particularly unpleasant place at the time? Who was Bill? \n\nIf anyone can help me with the history of this phrase, it will be much appreciated, Google isn't being helpful today. \n\n\n",
        "created_utc": 1381254927,
        "upvote_ratio": ""
    },
    {
        "title": "Forgotten Poem Title: Mistress POV speaking about wife - driving me insane trying to find it!",
        "author": "SearMe",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nyxxt/forgotten_poem_title_mistress_pov_speaking_about/",
        "text": "So I have googled and I have dusted off my poetry books on my shelf.. and now I am here. Please assist me to find this poem! I am thinking it's early to mid 1900's..\n\nIt is from the point of view of a mistress and she is comparing herself to her lovers wife. Basically it was about how she was nothing/not permanent compared to the wife.\nI recall imagery of smoke and the wife taking care of children.. That is all my brain can recall. Any assistance will be greatly appreciated! \n\n",
        "created_utc": 1381217577,
        "upvote_ratio": ""
    },
    {
        "title": "What new lit theories have emerged over the past 3-5 years?",
        "author": "deltalitprof",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1ntu6q/what_new_lit_theories_have_emerged_over_the_past/",
        "text": "When you pick up a typical high-tier journal, what do you see the articles doing? For me they continue to consolidate the gains of the \"historical turn\" of three or four decades back.  Speech-Act theory does seem to be cropping up a bit more of late, but seldom are we seeing anything that goes beyond the following templates we've been working with for 40 years or more:\n\nfeminism, psychoanalysis, Marxism, New Historicism, New Criticism (in its Boston University iteration), gay/queer studies, post colonial.\nDeconstruction has ebbed but remains an influence.\n\nAre there any new theoretical frameworks you think scholars and teachers in English should be becoming aware of today, or do you think we're in an era of continuing to fully explore what the post-structuralists have shown us?",
        "created_utc": 1381038364,
        "upvote_ratio": ""
    },
    {
        "title": "Literary Criticism AND Deconstruction",
        "author": "J-AlfredPrufrock",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nrpck/literary_criticism_and_deconstruction/",
        "text": "Hello everyone! I'm an English Literature and Professional Writing who is looking for two books on literary criticism. The books, or perhaps two or three, I'm looking for are as follows...\n\nFirst, I'm looking for a book on LITERARY Deconstruction. You have no idea how many philosophic books I find on it. I understand how the two disciplines correlate, but I need a book that applies the ideological structure of Deconstruction TO TEXT. The books I find seem to give the background and then fail to demonstrate how to apply it to a text. \n\nSecond, I also want to move past Decon. into other types of Lit. Crit. The second book I'm looking for should be like a survey or introduction book to Lit. Crit. I'd like, preferably, for emphasis to be on the quantity of criticism: brief summaries of many criticism, instead of detailed explanations of only a few criticisms. \n\nFor reference, here's the ISBNs of books I've all ready tried/read/explored: 9780415974103, 0130333972\n\nAny suggestions, points of directions, hint &amp; tips are greatly appreciated! :D\n\nCheers.",
        "created_utc": 1380947609,
        "upvote_ratio": ""
    },
    {
        "title": "Help finding a poem!",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nprvy/help_finding_a_poem/",
        "text": "Hi, if there's any help you could give be finding this poem, be it a subreddit suggestion or so on, it's totally welcome. \n\nI think I read this poem about two years ago, and it rang something within me, but I appear to have completely lost it. I'm pretty sure it's by a poet of renown, it's about a certain type of person. The type that flares like a spark instead of burning out slowly, lonely type of people who maybe search for each other? I think I recall it being slightly ambiguous on the morality of these people, but it very much focused on them being alone and different. \n\nThanks!",
        "created_utc": 1380882235,
        "upvote_ratio": ""
    },
    {
        "title": "Books on Beggars Cant/ Secret Languages?",
        "author": "magicmagz",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nnbla/books_on_beggars_cant_secret_languages/",
        "text": "A while back someone posted this article on some subreddit or other: http://www.nytimes.com/2013/08/19/opinion/learn-to-talk-in-beggars-cant.html?nl=opinion&amp;emc=edit_ty_20130819&amp;_r=1&amp;\n\nIn short (for those who might not be arsed reading this article) it's an article by Daniel Heller-Roazen, basically summarising his book \"Dark Tongues\", which details the ways people have used jargon to complicate language, making it secret and hidden and ultimately defying common understanding. As such it can be seen to subvert authority and power in some cases.\n\nI'm fascinated by this topic and interested in linking his ideas to literature. My question, then, is - are there any books out there that come to mind when you think of characters that twist or subvert language? Perhaps they even abstain from \"typical\" language and using other forms of communication - like dancing, singing, keeping silent? From the top of my head I am thinking of Friday's muteness in J. M. Coetzee's \"Foe\" but I'm racking my brains to think of better examples. Any help would be very much appreciated!",
        "created_utc": 1380799893,
        "upvote_ratio": ""
    },
    {
        "title": "19th-Century American Best-Sellers (Research Question)",
        "author": "FF6Kefka",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nj1ay/19thcentury_american_bestsellers_research_question/",
        "text": "Dear AskLiteraryStudies.\n\nI'm currently working with a professor on a research project concerning 19th-century American Literature (I'm currently a senior in an English program in Southeastern America). We are attempting to ascertain what the best selling books in America were between 1865 and 1875, and I was hoping that someone here could potentially point me to some useful journals or books.\n\nWe're trying to simply find the raw number of units sold in an attempt to understand the American consuming public's literary zeitgeist in the decade after the civil war. Thus far, I've been having trouble finding sources that could provide me with this information. I'm having the professor I'm working with order several books on publishing history and best-sellers in America, and I was wondering if anyone can suggest any additional works that might round out my research.\n\nThus far, I have ordered:\n\n*[DLB #49, American Literary Publishing Houses, 1638-1899](http://bit.ly/19UXyhi)\n*[A History of the Book in America, Volume 3: The Industrial Book, 1840-1880](http://bit.ly/1dUntZB)\n*[Myths and Mores in American Best-Sellers, 1865-1965](http://bit.ly/19V7nM6)\n*[Fiction and the American Literary Marketplace: the role of newspaper syndicates, 1860-1900](http://bit.ly/1fGmTmu)\n\nI have also combed through several journals on book publishing, but found very little of use outside of bibliographical data that led me to the previously-mentioned books. \n\nAny additional resources I should consult?\nAny seminal books on the subject I'm just unfamiliar with?\n\nThank you all so much for any assistance you can offer!\n\nTL;DR, I'm helping a professor do research about American best-sellers from 1865-1875. Where can I find this information?",
        "created_utc": 1380653277,
        "upvote_ratio": ""
    },
    {
        "title": "Can poetry or short fiction ever be uplifting?",
        "author": "jeniverous",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nfs8j/can_poetry_or_short_fiction_ever_be_uplifting/",
        "text": "I remember reading, somewhere, I'm not sure where, the idea that short fiction is always anchored in loneliness and disconnection.\n\nPoetry too seems to be an art primarily centred around expressions of despair, dissatisfaction or general malaise.\n\nI would like this not to be true. I believe that both short fiction and poetry should be able to uplift or exonerate the reader's existence.\n\nSo what is the most uplifting poem or work of short fiction you can recommend?",
        "created_utc": 1380548412,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Christmas Carol a dream vision?",
        "author": "inveterate-thinker",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nf8hb/is_the_christmas_carol_a_dream_vision/",
        "text": "Has anyone ever examined or analyzed a Christmas Carol through the lens of dream visions as a literary genre? What are other people's thoughts?",
        "created_utc": 1380519163,
        "upvote_ratio": ""
    },
    {
        "title": "Connection with Nature in Faulker's Go Down, Moses",
        "author": "themooooon",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1ndip0/connection_with_nature_in_faulkers_go_down_moses/",
        "text": "I'm having an extremely difficult time with this book. First one I've read Faulkner. I need to write a paper addressing man's connection with nature in two stories from the book -- probably The Bear and The Old People. Can anyone give me a few concepts to work with, so I can have a place to work from, or give any sort of help/advice. I'm dyin' over here.",
        "created_utc": 1380464082,
        "upvote_ratio": ""
    },
    {
        "title": "Searching for a digital copy of Todorov, The Fantastic: A Structural Approach to a Literary Genre",
        "author": "chayan5",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1nal40/searching_for_a_digital_copy_of_todorov_the/",
        "text": "Hello, apologies in advance if such requests aren't allowed...I don't mean to clutter the subreddit...but, anyway, I'm in the process of researching various texts on the uncanny and gothic tradition in Russian lit. as part of an undergrad thesis and was wondering whether anyone here has a digital copy of Todorov's work they would be willing to share/link to (I've searched for an hour or so for an ebook with no luck). I'm asking here because otherwise it'll be necessary to request it via interlibrary loan, which isn't ideal for consulting the work on and off; that and for whatever reason my abstract is due October 15, and it might not arrive in time given that I've had previous requests cancelled due to missing books, etc. \n\nMany thanks, and apologies if I ought to have asked elsewhere.",
        "created_utc": 1380341589,
        "upvote_ratio": ""
    },
    {
        "title": "Emile Durkheim is an annoying writer",
        "author": "GhostPirateRobot",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1n80sf/emile_durkheim_is_an_annoying_writer/",
        "text": "I am looking to try for some extra credit in my social theory class by analyzing the poor structure of Emile Durkheim's *Division of Labor in society*. The fact that I study sociology and not English means that I lack terminology for bad writing methods. I need technical terms for the following things (if they exist).\n\n1. unnecessarily wordy sentences\n2. Jumbled themes, i.e. leaving ideas open and jumping from one to another irratically.\n3. Lack of any kind of transitions or connectors from one idea to the next.\n4. Hinting at big ideas but not delving into them which only serve to distracts the reader.\n5. Overly repetitive\n6. Too many pronouns (I do not know what he is talking about sometimes because of this).\n7. Poor translations (not Durkheim's fault)\n\nI was frustrated reading this material to the point that I approached my professor about this possible extra credit. Help me",
        "created_utc": 1380249754,
        "upvote_ratio": ""
    },
    {
        "title": "Need help!",
        "author": "Ziggey",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1n7d0w/need_help/",
        "text": "I'm stuck on a study question and I can't find an answer that i'm sure is right. \nI read an excerpt from The Oval Painting by Edgar Alan Poe and i'm suppose to find out what it imparts, i'm stuck between curiosity, frustration, and apprehension. \nI'd really appreciate it if someone could help me out!\nHeres the excerpt :\nThe rays of the numerous candles (for there were many) now fell within a niche of the room which had hitherto been thrown into deep shade by one of the bed-posts. I thus saw in vivid light a picture all unnoticed before. It was the portrait of a young girl just ripening into womanhood. I glanced at the painting hurriedly, and then closed my eyes. Why I did this was not at first apparent even to my own perception. But while my lids remained thus shut, I ran over in my mind my reason for so shutting them. It was an impulsive movement to gain time for thought?—to make sure that my vision had not deceived me—to calm and subdue my fancy for a more sober and more certain gaze.",
        "created_utc": 1380230633,
        "upvote_ratio": ""
    },
    {
        "title": "A recent novel about consciousness?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1n3bf2/a_recent_novel_about_consciousness/",
        "text": "I'm an undergraduate in English who is currently mildly obsessed with themes of consciousness over multiple literary periods - romanticism, post-romanticism, modernism, postmodernism, etc. The time of year has rolled around in which I'd need to find a thesis for my dissertation, and I'm now hoping to discover a contemporary novel which discusses consciousness in a new, exciting, or relevant way.\n\nThe question is, then - are there any contemporary novels that come to mind when you think about consciousness - perhaps ones that specifically examine consciousness and misery, consciousness and authority, consciousness and language...? All of the aforementioned or possibly more? Thanks.",
        "created_utc": 1380098491,
        "upvote_ratio": ""
    },
    {
        "title": "May I have your opinion on my planned course of study for an MA?",
        "author": "firstroundko108",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1n2civ/may_i_have_your_opinion_on_my_planned_course_of/",
        "text": "TL;DR: What do you think of an [MA in Arthurian literature](http://www.bangor.ac.uk/english/listcourses.php.en?view=course&amp;prospectustype=postgraduate&amp;courseid=359&amp;subjectarea=26) from Bangor University, Wales?\n\nHello /r/askliterarystudies, I am an American student closing in on an English BA with a concentration in education. During the past few semesters, I developed a passion for stories and poems about King Arthur. I even went so far as to write a music album on *Le Morte D'Arthur*. I have been thinking about applying for grad school lately, and when I stumbled upon Bangor University's MA program for Arthurian literature, I fell in love with the idea. Just to give you a bit more information, the two professors at the head of the program have produced books on the subject in addition to creating the  International Arthurian Society and its relative journal. Here are a few questions I'm hoping you can shed light on:\n\n1) As I intend to eventually go for a phD and teach at the university level, would a degree in Arthurian literature \"pigeon-hole\" me into too specific of an area?\n\n2) I am a military vet and an above-average student with a 3.9 GPA. Should I be paying for grad school with loans, or is it possible to get a full-ride scholarship with my accomplishments? It seems my only option at Bangor is an international scholarship that reduces my tuition by 50% and loans to cover the rest.\n\n3) Are UK master's degrees generally equated with US master's degrees? I may decide to return to the US for a phD if the cost of staying in the UK becomes too high. \n\n4) Any other expert input is most welcome :)",
        "created_utc": 1380065421,
        "upvote_ratio": ""
    },
    {
        "title": "Victorian era reading journals, letters, or other sources where the fairly average reader talks about what they're reading?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1n0t7c/victorian_era_reading_journals_letters_or_other/",
        "text": "Posted this on r/VictorianEra a few days ago, figured it would be appropriate to post here too. Does anyone happen to know where I might find things like this? I've managed to dig up some of the correspondence between Catherine and Emily Winkworth, and the moments they discuss their reading are fascinating to me.",
        "created_utc": 1380019929,
        "upvote_ratio": ""
    },
    {
        "title": "Enjoyable, strife-free literature?",
        "author": "swerveofshore",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mzemt/enjoyable_strifefree_literature/",
        "text": "Burnt out grad student checking in. Can you all recommend some literature, poetry, stories that are calming, playful, enjoyable. In other words I'm looking for the \"feel good blockbuster\" of literature. Strange question, but I'm in a strange place as I expect some of you can sympathize with. \n\nEDIT: Thanks everyone, appreciate the responses and look forward to some pleasure readgin!",
        "created_utc": 1379968481,
        "upvote_ratio": ""
    },
    {
        "title": "James Joyce and The Dubliners",
        "author": "Animalmother95",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mz01u/james_joyce_and_the_dubliners/",
        "text": "What are your opinions on the theme of drunkenness through the novel? I believe it represents the stagnation of the Irish and there inability to do anything about their society and political nature. Would you guys agree?\n\nAll discussion is welcomed!",
        "created_utc": 1379958011,
        "upvote_ratio": ""
    },
    {
        "title": "Illustration student seeking suggestions of poems with contrasting themes / moods to illustrate!",
        "author": "lucydill",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1myr7f/illustration_student_seeking_suggestions_of_poems/",
        "text": "I am seeking some poems or even short stories with contrasting themes / moods to illustrate for my final project at university. \n\nI'm not too familiar with poetry but one very rough idea I had was looking at poems by Hardy, for example *'The Darkling Thrush'* has some hopeful elements, *'The Voice'* has a lot of regret and ghostly elements and *'Under the Waterfall'* some themes of love even though all the poems have dark elements.\n\nFrom what I understand his poems reflect his life, would there be any other poets who's poems reflect different points of their life, maybe ideally with really high happy points in contrast with low depressing points?\n\nI hope this makes sense and any feedback would be a huge help to me!\n",
        "created_utc": 1379951597,
        "upvote_ratio": ""
    },
    {
        "title": "Number of publications for Grad student?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mtihv/number_of_publications_for_grad_student/",
        "text": "It was tough to see the numbers in MLA's recent job postings. The job market will be and is competitive, to say the least. I do not plan to teach at an R1 institute - though it wouldn't be out of the realm of possibilities. I am thinking more in terms of a SLAC...or at least that is the pipe dream. \n\nWhat would you say is the number of publications one needs in a peer-reviewed journal to be competitive on the job market? ",
        "created_utc": 1379734103,
        "upvote_ratio": ""
    },
    {
        "title": "What is the right way to to use a quotation mark with other punctuation marks near it?",
        "author": "karthus25",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mr8ia/what_is_the_right_way_to_to_use_a_quotation_mark/",
        "text": "Lets say I want to say - She told us, \"Hello\"\n\nHow would I write that when I want to continue it, here's an example of what I'm exactly trying to do.\n\nShe yelled, \"Hello!\", as we walked down the street.\n\nWould I put the comma in there and not have the exclamation? Would the exclamation end the sentence completely? Do I need a space after the quotation if I need a comma? What if I needed to end the sentence after the \"Hello\", would I put a period after the comma, would I have the exclamation, would the exclamation end it the sentence even though there's another mark after it (quotation mark)? There are things that no teacher has ever made clear to me and I just need to know. Would I need the comma at all?",
        "created_utc": 1379647493,
        "upvote_ratio": ""
    },
    {
        "title": "What was the first sequel?",
        "author": "trashed_culture",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mq9qc/what_was_the_first_sequel/",
        "text": "That's all.  I was discussing Don Quixote and suggested that if written today, then it might have been broken into multiple novels.  This led to the question above.\n\nI'm still reading it, so no spoilers please. ",
        "created_utc": 1379618483,
        "upvote_ratio": ""
    },
    {
        "title": "Space &amp; Place Theory?",
        "author": "bloglib",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mq95y/space_place_theory/",
        "text": "Can anyone give me a good starting point for the major critics in space &amp; place theory? I am differentiating between ecocrit on purpose here - though I guess geocriticism would be close enough. \n\nI am familiar with Cresswell and Massey, but looking for other big names/important critical texts. ",
        "created_utc": 1379618072,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the impact of a discovery of all \"lost\" Ancient Greek plays, literary works, etc?",
        "author": "magusj",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mpz09/what_would_be_the_impact_of_a_discovery_of_all/",
        "text": "Whenever I read Ancient Greek dramatists I'm astounded at how we only have a tiny sample of their works.  Sophocles for instance wrote over 100 plays but we only have a surviving 7.  Aeschylus (my fave) had roughly 80 and only 7 survived as well. For all we know we got some of his less good plays.\n\nImagine if most of Shakespeare's works had been lost, and we judged him on King John, The Phoenix and the Turtle, and some of the less good sonnets.\n\nWhat would be the impact on world literature, study, history, etc. if some excavation in Greece or Turkey found some cave or chest with most if not all of the lost \"plays\" of the Greek dramatists, philosophers, etc. in well preserved form?  Something analogous to Dead Sea Scrolls, only on much bigger scale.  Just going down the list in wikipedia of classical lost works, there's a ton of stuff that was lost to the world.\n\nWould it perhaps lead to a renewal in classical studies with a wealth of new works to be analyzed, discussed, etc.? Perhaps a huge revival of Classics, Ancient Greek majors, and so on?  Or would most of the world just shrug its shoulders and carry on?\n",
        "created_utc": 1379610291,
        "upvote_ratio": ""
    },
    {
        "title": "Pat Moon: Earth's Clock (1993) - Analysis",
        "author": "Tastener",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mmry4/pat_moon_earths_clock_1993_analysis/",
        "text": "Dear redditors, \nwe need your help to analyze the poem \"Earth's Clock\". We think that it's generally supposed to show that mankind takes only a small place in history. Nevertheless, they managed to do a lot of things, both positive and negative ones. The last sentence makes us aware of the fact, that we can still change something. In addition, we found some rhetorical devices:\n-\"Earth's Clock\" (metaphor)\n-\"Rains\" (exaggeration)\n-\"soupy seas\" (alliteration)\n-\"twenty to twelve\" (alliteration)\nWe don't know how to interpret them though.\nSo we would really appreciate your help.\nHere the poem:\n\nEarth's Clock\nImagine that the earth was shaped twenty four hours ago\nThen at 6 a.m. rains fell from the sky\nTo form the seas below\nAt 8 a.m. in these soupy seas\nThe first signs of life appeared\nThe dinosaurs calles twenty minutes ago\nBut at twenty to twelve disappeared\nMan arrived just one minute ago\nThen at thirty seconds to midnight\nRaised himself from his stooping stance\nAnd started walking upright\nIn the thirty seconds man's walked the earth\nSee what he's managed to do\n\nEarth's clock continues ticking;\nThe rest is up to you.",
        "created_utc": 1379495967,
        "upvote_ratio": ""
    },
    {
        "title": "If You Aren't Interested in Politics, What Options do You Have Going Into Grad School?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mja0h/if_you_arent_interested_in_politics_what_options/",
        "text": "The basic question is in the title. I'm an undergrad looking at MA and Phd programs to apply to. I'm not particularly interested in thinking, reading, and writing about politics in literature. I do have some interests in theory, just not the overtly political ones. I guess you could say I'm more of a close reader with interests in modern poetry.\n\nDo any programs come to mind right away that don't particularly favor the political approach? Thanks",
        "created_utc": 1379373438,
        "upvote_ratio": ""
    },
    {
        "title": "Discourse vs. Ideology",
        "author": "Chichikov",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mieum/discourse_vs_ideology/",
        "text": "I am under the impression (perhaps a mistaken one) that in recent decades the ideological analysis (e.g. Jameson, Althusser, Marxism, Feminism &amp;c.) of the 60s &amp; 70s has been supplanted by discourse analysis (New Historicism, Greenblat &amp;c.). Am I simply wrong, or if not, then why did this happen and through whose work?",
        "created_utc": 1379350683,
        "upvote_ratio": ""
    },
    {
        "title": "Where to find historical uses of a word?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mh8f2/where_to_find_historical_uses_of_a_word/",
        "text": "I am looking for the meaning of the word \"hoary\" during the late 1700s.  I tried Oxford English online, but that didn't work...\n\nBasically, I need to know whether, at that time, \"hoary\" meant old and venerated, or old and trite, as those are both definitions of the word.\n\nSuggestions?\n\nThanks!",
        "created_utc": 1379303035,
        "upvote_ratio": ""
    },
    {
        "title": "Journal Search? How can I figure out which journal I should submit to?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mfno8/journal_search_how_can_i_figure_out_which_journal/",
        "text": "It is my first semester in my graduate program, and my Romantic Literature class requires that we write and submit an article to a literary journal.\n\nIs there a searchable database (like duotrope for fiction) where I can find a good match for my article (it will be on William Godwin)?  Or does anyone have any suggestions for journals that look for Romantic period articles?\n\nThanks!",
        "created_utc": 1379257154,
        "upvote_ratio": ""
    },
    {
        "title": "What object(tangible/intangible) can be associated with happiness/positivity like knowledge is to light?",
        "author": "hachi88",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mfger/what_objecttangibleintangible_can_be_associated/",
        "text": "",
        "created_utc": 1379246896,
        "upvote_ratio": ""
    },
    {
        "title": "Support global literacy by participating in /r/literature's celebratory fundraising campaign for Room to Read.",
        "author": "sushisushisushi",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1meoz9/support_global_literacy_by_participating_in/",
        "text": "[Full discussion here](http://www.reddit.com/r/literature/comments/1meo3x/congratulations_on_50000_readers_rliterature_to/).",
        "created_utc": 1379206711,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate is the 2010 \"animated epic\" version of Dante's Inferno?",
        "author": "dak0tah",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mcusa/how_accurate_is_the_2010_animated_epic_version_of/",
        "text": "http://movies.netflix.com/WiMovie/Dante_s_Inferno/70128700?trkid=13462100\n\nI'm wondering about stuff like Dante wielding the demon's axe, the army of unborn babies, when he sets the glutton's spirit free in the belly of cerberus, that scene with the three women inside the second circle, all the flashbacks to Dante and Beatrice's backstory, Virgil the Jedi/tourguide, Dante fighting his father, and the cross thzt was sewn to his chest and then turned into a snake at the end.",
        "created_utc": 1379127142,
        "upvote_ratio": ""
    },
    {
        "title": "where did the English language get the \"ph\" sounding like \"f\"",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1mb496/where_did_the_english_language_get_the_ph/",
        "text": "",
        "created_utc": 1379070494,
        "upvote_ratio": ""
    },
    {
        "title": "Feminist Criticism of Robert Penn Warren's \"All The King's Men\"",
        "author": "Jahaza",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1m9bvr/feminist_criticism_of_robert_penn_warrens_all_the/",
        "text": "Can anyone point me to feminist criticism (articles, books) that particularly address Robert Penn Warren's *All the King's Men*.",
        "created_utc": 1379007273,
        "upvote_ratio": ""
    },
    {
        "title": "Structure, Sign, and a Question",
        "author": "TuscanLeather",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1m1vgh/structure_sign_and_a_question/",
        "text": "Dear literature heads, I have been trying to grasp the concept of post-structuralism over the last few days, and although I have studied it thoroughly I have trouble understanding how to apply post-structuralism (my main reference point is Derrida's \"Structure, Sign, and Play in the Discourse of the Human Sciences\") to the reading of a text. \n\nAs I understand it, post-structuralism is more of a philosophic movement rather than a literary one when it comes to the center anchoring structures and allowing it to play, and an \"event\" happening that changes the structure. A post-structuralist would think using scientific methods to understand literature are naive, they would be fixed on the material aspect of language, and they are anxious about achieving knowledge through language.\n\nToday someone deconstructed e.e. cummings' [in Just-] for me, by looking at Richard Kennedy's view on the poem. Kennedy says in *Dreams in the Mirror: A Biography of e.e. cummings* that \"Spring thaws filled a low spot in the street... with a huge puddle, a \"mud luscious\" site. In years to come, the memory of this annual occurrence plus the advent of the balloon-seller, blowing his whistle, and the remembered joy of childhood play coalesce to inspire e.e. cummings' best known poem \"in Just-/spring\"...\"  As I understood it, Kennedy created a structure and implied a core, as he says that the centre (of the text?) is about the joy of childhood. Furthermore, he looks at the old world versus the young world, maturity versus immaturity and innocence versus sexuality. And then there's the post-structuralist view, who would focus more on the sexual tension in the text, about how the balloon man tries to lure the children into sexuality and about the orgasmic joy in child's play. A post structuralist would look for elements that refer to the fact that language is unstable. An \"event\" that would be happening in the poem is something strange that happens all of a sudden, so maybe these would be the inconsistencies on a textual level: the old balloonman suddenly turning into the balloonMan. (I'm not really sure if I get this right!).\n\nI'm wondering if you could correct me where needed, and explain to me as how to analyse a text this way myself? It made sense to me when someone else did it for me, but I now have to deconstruct an assigned text (metafiction) myself, interpreting it and fixing a centre then *subverting* it, and I don't really know where to start. I think I understand how to analyse poems like cummings' now but applying post-structuralism to metafiction (in the story I have to analyse, the author comments on the story's progress as he goes) has me completely lost for words, let alone 500! Any tips would be massively appreciated! \n\nThank you in advance and apologies for the sea of words but I really don't know how to explain my problem of not understanding post-structuralism briefly, but I guess I'm just trying to \"do\" a Derrida! ",
        "created_utc": 1378754199,
        "upvote_ratio": ""
    },
    {
        "title": "Ethics of publishing posthumously",
        "author": "coree",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1m1b2x/ethics_of_publishing_posthumously/",
        "text": "Hi guys,\n\nI was wondering what you thought of publishing incomplete or previously unpublished works by dead authors. Is it ethical to publish something that the author may not have intended to? How can the editing process work if the author isn't there to insure his/her wishes are respected? \n\nThe problem is even more prickly when the author specifically requests his/her works to be destroyed. Kafka, if I remember, wanted his works destroyed, so we wouldn't be able to read the Metamorphosis if someone hadn't decided to ignore the author's wishes. \n\nUnfinished things like \"Bartleby the Scrivener\" by Melville are also presented to readers in a deceptive way. By being published separately, with a title and all the trappings of a completed book, it makes it seem like the author intended it to be published this way - when that is far from the truth. A great example of this is Flaubert's \"Bouvard et Pecuchet\" which is always published as a stand-alone novel. However, we have no idea HOW Flaubert wanted to publish it, since it was found along with a number of other odd texts, like a satirical dictionary and a well-curated list of quotes. We have no way of knowing that we are accurately interpreting his work, since we don't know its context.\n\nThe last question that this brings up is, are we ever properly reading a posthumous book? Or, in a more generous phrasing, what does reading a posthumous book do to your interpretation of it? \n\nThis is more of a discussion topic than a question. I just wanted to hear your thoughts. Also I'd love to hear about more books whose publication history is plagued with posthumous editing. \n\nEDIT: OK, great talk guys see you later. ",
        "created_utc": 1378738692,
        "upvote_ratio": ""
    },
    {
        "title": "/r/literature now has a sister subreddit, /r/literatures (with an 's'), for the discussion of world literatures and literature written in languages other than English",
        "author": "sushisushisushi",
        "url": "http://www.reddit.com/r/AskLiteraryStudies/comments/1lzpob/rliterature_now_has_a_sister_subreddit/",
        "text": "Please come on over and subscribe!\n\nAll languages and literatures are welcome.\n\n/r/literatures",
        "created_utc": 1378674498,
        "upvote_ratio": ""
    }
]