[
    {
        "title": "What preliminary reading would be necessary to understand \"Powers of Horror\" by Julie Kristeva? In other words, what concepts or thinkers (Lacan, say), should I acquaint myself with before studying Kristeva? Thanks a lot.",
        "author": "modonoghue",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10yxiz6/what_preliminary_reading_would_be_necessary_to/",
        "text": "",
        "created_utc": 1676049786,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the consensus on the authenticity of Dante’s letter to Can Grande Della Scala on Allegory? I can’t find out what most scholars think.",
        "author": "sadsackerpro",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10ym9s0/whats_the_consensus_on_the_authenticity_of_dantes/",
        "text": "",
        "created_utc": 1676020721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone aware of some papers on the topic of the influence of Ancient Mesopotamian epic poetry on Homeric poetry?",
        "author": "Mockingbird-M",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10y8xis/is_anyone_aware_of_some_papers_on_the_topic_of/",
        "text": "Specifically, whether the series of myths of Gilgamesh influenced the legends of Achilles.",
        "created_utc": 1675983202,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this translation good?",
        "author": "artisticpineapple12",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10xsqr1/is_this_translation_good/",
        "text": "[https://www.waterstones.com/book/the-penguin-book-of-russian-poetry/boris-dralyuk/irina-mashinski/9780141198309](https://www.waterstones.com/book/the-penguin-book-of-russian-poetry/boris-dralyuk/irina-mashinski/9780141198309)",
        "created_utc": 1675943020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spiritual progeny of Valery, Nietzsche, etc.?",
        "author": "sammyboy123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10vfziq/spiritual_progeny_of_valery_nietzsche_etc/",
        "text": "It seems to me that the kinds of things that someone like Paul Valery did in an essay like Poetry and Abstract Thought or that Nietzsche did in The Birth of Tragedy are largely quite different than what literary criticism does today. \n\nSo into what critical schools did the thought and sensibility of writers like these find a home, if any? \n\nIn which contemporary critics might we find an engagement with kindred concerns and the use of congruent methods?",
        "created_utc": 1675712599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Lord Byron so popular in mainland Europe?",
        "author": "Burner__Account123",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10vf7l0/why_is_lord_byron_so_popular_in_mainland_europe/",
        "text": "Hi, I just wanted to ask why Byron is so popular in mainland Europe compared to other English poets of the same era. Although he's obviously celebrated in the canon of English romantic literature,  he doesn't seem to have the same status as Keats, Blake or Wordsworth in critical circles (at least from what i've read). Despite this, many prominent European intellectuals (Nietzsche, Pushkin, etc) seem to single him out for praise, why is this?  Is it because of his participation in European politics?  I know that he was more popular in his day than any of the other English poets mentioned, but why has he maintained this reputation in Europe? Sorry if I'm missing something.",
        "created_utc": 1675710827,
        "upvote_ratio": 1.0
    },
    {
        "title": "a question about the tenant of wildfell hall",
        "author": "SnowdropWorks",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10v8qqp/a_question_about_the_tenant_of_wildfell_hall/",
        "text": "a question about the tenant of wildfell hall\n\nI just finished the tenant of wildfell hall and it was an incredible book. Easley one of my new favorites. \n\nI do have one question about the story that I couldn't figure out.\nWhen Helen goes back to grassdale, how does she know Mr Huntington is hurt in the first place?\nI thought only Millicent and eather knew where she went and had means to contact her brother. But the former wasn't living in that neighborhood anymore. The latter only came to helpt when Helen got there herself, so it didn't seem to me she knew.\nAm I missing something?",
        "created_utc": 1675695716,
        "upvote_ratio": 1.0
    },
    {
        "title": "any good literature on vampirism in egyptian mythology?",
        "author": "secondaccountofyaboy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10upwe7/any_good_literature_on_vampirism_in_egyptian/",
        "text": "i am writing a paper on the poem 'oil and blood'by william butler yeats and id really like to link the poem with early notions of vampirism in egyptian mythology.\n\nmy problem is that, while i found quite a few books that connect sekhmet with vampirism, almost none could be seen as academic sources.\n\nas such id like to ask if any of you know any good sources on vampirism in egyptian mythology! thanks in advance!",
        "created_utc": 1675636929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any good Bible commentaries from a literary studies point of view?",
        "author": "DifferenceTone",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10upue8/are_there_any_good_bible_commentaries_from_a/",
        "text": "",
        "created_utc": 1675636799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Value of critical essays for a writer?",
        "author": "after-hours-zone",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10ugmd0/value_of_critical_essays_for_a_writer/",
        "text": "How valuable are critical essays on authors or their written work for a writer? I’m certain some have interesting takes on the subject but aren’t they essentially like video essays for movies?",
        "created_utc": 1675614704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scroll to read - Dante Alighieri's The Divine Comedy: Inferno - fully rhymed English edition (Canto I)",
        "author": "StarMakerVisual",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10tn198/scroll_to_read_dante_alighieris_the_divine_comedy/",
        "text": "[removed]",
        "created_utc": 1675534305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scroll to read - Dante Alighieri's The Divine Comedy: Inferno - fully rhymed English edition (Canto I)",
        "author": "StarMakerVisual",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10tmeh3/scroll_to_read_dante_alighieris_the_divine_comedy/",
        "text": "[removed]",
        "created_utc": 1675532806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a source",
        "author": "TheEnchanterTimothy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10tgf80/trying_to_find_a_source/",
        "text": "Good day literary friends!\n\nI've recently read the works of Joseph Conrad, which has led me to Chinua Achebe's *An Image of Africa*. Therein Achebe quotes what he says is Conrad's account of his first time meeting a black person, and it is very unflattering. I have been trying to find the source for this quote but have been unable to do so.\n\nHelp appreciated!",
        "created_utc": 1675517328,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Fight Against Defeat",
        "author": "Arshad9898",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10sqsyn/the_fight_against_defeat/",
        "text": "[removed]",
        "created_utc": 1675447424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best translation of Mallarme?",
        "author": "ImportanceInternal",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10sa3e9/best_translation_of_mallarme/",
        "text": "I wanted to check out the poems of Stephane Mallarme, and was thinking of getting the oxford edition by Blackmore or the the translation by Peter Manson. I see good reviews for both and no bad reviews, which is suspicious for french poetry, any suggestions?",
        "created_utc": 1675395691,
        "upvote_ratio": 1.0
    },
    {
        "title": "help",
        "author": "Funny-Bat7634",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10s2ar4/help/",
        "text": "hello there guys!\nI'm thinking of entering comparative literature (bachelor's)\nbut i need some information about the major\nwhat is the major about?\nIs it worth it?\nwhat are the job opportunities after graduation?\ni tried to look it up, but this major isn't really very known where i come from.\nthanks in advance :\")",
        "created_utc": 1675375327,
        "upvote_ratio": 1.0
    },
    {
        "title": "I still don’t fully understand hyperboles",
        "author": "zDodgeMyBullet1",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10qifhn/i_still_dont_fully_understand_hyperboles/",
        "text": "For example I understand basic hyperboles like I am hungry enough to eat a horse, but what about hyperboles like the cloud destroyed the moon, or the cloud split the moon since it was the in the middle of two parts of the moon\n\nOr my finger destroyed the sun, or me pointing at it split it in half for example, these are ludicrous statements, but would they be considered as hyperbole, and if they are couldn’t I make possibly anything up and make it a hyperbole? Or are these sentences not hyperboles?",
        "created_utc": 1675219568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for some writing on Flaubert's 'A Sentimental Education'",
        "author": "LoudExplanation",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10q6z78/looking_for_some_writing_on_flauberts_a/",
        "text": "Can be anything: essays/criticism, academic work, etc\n\nThanks!",
        "created_utc": 1675190775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salinger bio recommendations",
        "author": "JJWF",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10q4xnr/salinger_bio_recommendations/",
        "text": "Are there any biographies of Salinger that anyone would recommend? I'm preparing to teach *The Catcher in the Rye* and some short stories, and would like to give some background on Salinger and the time as well. I'm rewatching the *Salinger* documentary now and reading the accompanying book, but I'd like to have a more traditional biography as well. Thanks!",
        "created_utc": 1675186051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is pathetic fallacy the same as Sylvia Plath’s use of the “psychic landscape”?",
        "author": "sheephamlet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10q3s89/is_pathetic_fallacy_the_same_as_sylvia_plaths_use/",
        "text": "The psychic landscape refers to Plath’s tendency to use nature or an element of the natural world to convey an inner state of mind. Is this not the same as pathetic fallacy?",
        "created_utc": 1675183391,
        "upvote_ratio": 1.0
    },
    {
        "title": "What other literature/educational book-related subreddit are you subscribed to?",
        "author": "alittlelargerthanuni",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10pxmbz/what_other_literatureeducational_bookrelated/",
        "text": "I am sorry if this kind of question is not allowed, or at least encouraged, but I wanted to ask this question since I want to broaden my horizon as a reader, and hopefully, as a writer. I am subscribed to some \"Ask\" subreddits and the ones linked in the sidebar. Graphic novel subreddit to boot. I am specifically looking for places to be recommended scientific and historical books and places to see news about newly released literature books as well. Any suggestions, be them webzines, subreddits or fora are welcome.",
        "created_utc": 1675167620,
        "upvote_ratio": 1.0
    },
    {
        "title": "I read somewhere that Dickens spent a couple of years in his early 20s seeing plays almost every night. Does anyone know the London theatre scene of that time well enough to be able to hazard a guess as to what sort of fare he most likely saw?",
        "author": "ItaloSvevo111",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10pqqya/i_read_somewhere_that_dickens_spent_a_couple_of/",
        "text": "",
        "created_utc": 1675146235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fiction for studying emotion",
        "author": "awesomeness1212",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10pmfbq/fiction_for_studying_emotion/",
        "text": "Hi! I'm studying emotion in an interdisciplinary way, and currently don't have any fiction on my \"roster.\" Due to the nature of the study, I'd prefer short works -- poetry, short stories, or chapters/passages of novels that stand on their own -- that address either one or multiple of these questions:\n\n* What is an emotion?\n* How do emotions affect us and our behavior?\n* How do we address emotional distress?\n\nYour help is appreciated!!",
        "created_utc": 1675134328,
        "upvote_ratio": 1.0
    },
    {
        "title": "What animals represent characters in the epic Odysseus ,by Homer.",
        "author": "Beneficial-Highway52",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10pm6ze/what_animals_represent_characters_in_the_epic/",
        "text": "",
        "created_utc": 1675133690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t remember the short story",
        "author": "peanutbuttercrawfish",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10pksx0/cant_remember_the_short_story/",
        "text": "I read a beautiful short story once about a long forgotten ancient deity who existed merely because a small statue of them was in a museum. But there was a woman who came to the museum who loved the statue and would come to the museum just to look at the statue. \n\nIt was so lovely and I think about it often. Does anyone know this story, it’s title or author? Is there a better subreddit to ask? Thank you in advance!",
        "created_utc": 1675129795,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Nature of Metafiction and Escapism",
        "author": "telerislayer",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10pa1ug/the_nature_of_metafiction_and_escapism/",
        "text": "As a novelist myself, I have been wondering how the likes of Tolkien in The Lord of The Rings or Gaston Leroux in The Phantom of The Opera compose their work of fiction so fluidly that their claims of their works being \"not fiction\" become so natural. If one reads Orhan Pamuk's The Museum of Innocence he can easily acquire certainty that this is a work of fiction and that the museum that exists in the material is simply formed by Pamuk's own collection, while he does not stumble upon any artificialness in Tolkien's fantasy which should be less believable than Pamuk's down to earth literature. What makes the difference?",
        "created_utc": 1675103410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frame story",
        "author": "nonationo",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10p9q0y/frame_story/",
        "text": "I study a Brazilian romance from the '20s in which the narrator, which is a neutral omniscient narrator until that point, suddenly, on the last chapter of the book, speaks in first-person for the first time and reveals that he heard the whole story from one minor character(the narrator itself was not a character in the story), and that he decided to tell it now and so on.  So this is kind of an inverted frame story, in which the framing is only revealed in the end. \n\nCan you think of any other literary example in which something similar happens? Do you have any relevant bibliography to recommend?\n\nThank you!",
        "created_utc": 1675102631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparative literature question",
        "author": "AoSora71",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10p9npg/comparative_literature_question/",
        "text": "Maybe I haven't read enough about it or maybe I have misunderstood it, but it's hard to wrap my head around it. I have seen it defined as \"the study of universal literature\" which makes sense but it seems like too big of an endeavour for someone to claim that what they're studying is the whole of literature of the world, and since it's impossible to know all the languages on earth is like defining it \"the study of translated literature\". Or is it the encapsulation of the comparison of two or more literatures and adding up those studies you one of each of the languages and that's what makes it universal, so not one person is studying universal literature (I know one person can't practically study universal literature taken literally, some people can probably know enough to claim universality).\n\nTo a more pragmatic point even though I hate to be overly pragmatic, what even is the point to insist that studying multiple countries literatures, especially those outside Europe and North America as is often insisted, even studying one country's literature is a tall feat and it often looks to me that it's demonized if the country you choose is a major power, and insisting that literature scholars should double as diplomats brings it back to pragmatism.",
        "created_utc": 1675102478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does The Narrative of Arthur Gordon Pym of Nantucket end inconclusively?",
        "author": "bhbhbhhh",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10onkf1/why_does_the_narrative_of_arthur_gordon_pym_of/",
        "text": "Did something in Poe's life prevent him from finishing? Wrote himself into a corner? Conscious creative choice?",
        "created_utc": 1675038507,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean for philosophical writing to be great, significant literary works?",
        "author": "s5ng",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10on4sf/what_does_it_mean_for_philosophical_writing_to_be/",
        "text": "What does it mean for philosophical writing to be great, significant literary works?\n\n\n\n\nBritish philosopher [Nigel Warburton](https://www.philosophersmag.com/interviews/16-nigel-warburton-virtual-philosopher) says the same thing in his books. Emboldenings are mine.I know that some French literature syllabi include [Camus](https://www.quora.com/Is-The-Stranger-by-Albert-Camus-considered-literature-Can-I-use-this-book-on-an-AP-exam) and  Sartre. But at least in English, I have never seen philosophy books in any school or university literature syllabus!\n\n#### What exactly does Warburton mean by great,  significant literary work? How can philosophy texts be literature too? \n\n&gt;The history of political philosophy includes many of the greatest and most widely \nstudied works of philosophy, from Plato's *Republic* through to John Rawls's *A Theory \nof Justice*. In this book we are focusing on seven works by indisputably great thinkers. \nThese books are intrinsically interesting, in some cases qualify as **significant works of \nliterature**, and, most importantly, contain ideas that have a continuing relevance \nbeyond their original contexts of composition. Our book has been written in the firm \nbelief that studying the history of philosophy should not be like a visit to a dusty \nmuseum of superseded thought, but rather a challenging and invigorating \nengagement with the ideas of the great thinkers of the past. \n\n*Reading Political Philosophy Machiavelli to Mill*, [page vii](https://www.google.com/books/edition/Reading_Political_Philosophy/KGZ9AwAAQBAJ?hl=en&amp;gbpv=1&amp;dq=nigel%20warburton%20%22works%20of%20literature%22&amp;pg=PR7&amp;printsec=frontcover).\n\n&gt;These are known as the\nPlatonic Dialogues and are **great works of literature** as well as of\nphilosophy – in some ways Plato was the Shakespeare of his day.\n\n*A Little History of Philosophy*, 2011, [page 4](https://www.google.com/books/edition/A_Little_History_of_Philosophy/SGL4QPwDTVsC?hl=en&amp;gbpv=1&amp;dq=nigel%20warburton%20%22works%20of%20literature%22&amp;pg=PT12&amp;printsec=frontcover).\n\n&gt;The history of philosophy is a fascinating and important\nsubject in its own right, and many of the classic philosophical texts\nare also **great works of literature**: Plato’s Socratic dialogues, René\nDescartes’s *Meditations*, David Hume’s *Enquiry Concerning Human\nUnderstanding*, and Friedrich Nietzsche’s *Thus Spake Zarathustra*, to\ntake just a few examples, all stand out as compelling pieces of writing\nby any standards.\n\n*Philosophy: The Basics*, 2012 5th Edition, [page 2](https://www.google.com/books/edition/Philosophy_The_Basics/1TGBAAAAQBAJ?hl=en&amp;gbpv=1&amp;dq=nigel%20warburton%20%22works%20of%20literature%22&amp;pg=PA2&amp;printsec=frontcover).\n \n&gt;This book consists of thirty-two chapters, each focused on a single great \nphilosophical book. The point is to introduce each book, bringing out its most \nimportant themes. The books dealt with here are worth reading today because they \nengage with philosophical problems that are still worth discussing, and because they \ncontinue to offer insights. Apart from that, many of them hold their own as **great \nworks of literature**. \n\n*Philosophy: The Classics*, 2014 4th edition, [page 1](https://www.google.com/books/edition/Philosophy_The_Classics/2qHIAgAAQBAJ?hl=en&amp;gbpv=1&amp;dq=nigel%20warburton%20%22works%20of%20literature%22&amp;pg=PT17&amp;printsec=frontcover).\n\n\n### https://literature.stackexchange.com/q/23976",
        "created_utc": 1675037395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking samples of weird, incongruous literary writing about sex",
        "author": "kevinonze",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10oas5n/seeking_samples_of_weird_incongruous_literary/",
        "text": "As part of a project on creative writing about sex, I am collecting as many quotations as possible that illustrate a particular sort of sex scene: it has to be odd, incongruous, intentionally or unwittingly funny. It's intention may or may not be to arouse, but its result is most certainly something else: hilarity, perplexity... whatever. My favorite example of such as scene is from Beckett's *Malone Dies*:\n\n\"There sprang up gradually between them a kind of intimacy which … led them to lie together and copulate as best they could. For given their age and scant experience of carnal love, it was only natural they should not succeed, at the first shot, in giving each other the impression they were made for each other. The spectacle was then offered of Macmann trying to bundle his sex into his partner’s like a pillow into a pillow-slip, folding it in two and stuffing it in with his fingers.\" \n\nI already have quite a few Beckett quotations of this nature, and a lot from Nicholson Baker too. I'm never sure about the intention behind Jeanette Winterson's sex scenes, but more than a few are quite hilariously weird too.\n\nTo be clear, I'm not looking for cringy bad sex writing, or generic *Clan of the Cave Bear* or *Fifty Shades of Grey* sex writing. \n\nIf you know of any, please share them with me. If they're nsfw, DM me. If sfw, share with the world! Please cite your sources, ideally with page numbers!\n\nThanks",
        "created_utc": 1675007484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Dostoyevsky in Proust",
        "author": "B0ngyy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10nk9lz/question_about_dostoyevsky_in_proust/",
        "text": "I’ve been working through In search of lost time the last few months and I noticed that in volume 3 the name is spelled “Dostoievski” and in volume 7 it is spelled “Dostoyevsky”  \n\nI know volume 7 is translated by a different person (I’m reading the Moncrief translation) so I assume that’s the reason it’s spelled differently, but was wondering if anyone knew if maybe the style of transliterating russian names had changed over the course of the publication of the English translation? Or is this likely just different translators using their own preferred spellings? Thanks",
        "created_utc": 1674926449,
        "upvote_ratio": 1.0
    },
    {
        "title": "studies",
        "author": "Top_Ad_9322",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10nhoe2/studies/",
        "text": "i have already search some journals related to stubborn patients PHILIPPINES but no luck. Does anyone have it? or some link specifically PHILIPPINES study journals",
        "created_utc": 1674919786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics/morals",
        "author": "Paslaer_flurt2154",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10mgoxr/ethicsmorals/",
        "text": "",
        "created_utc": 1674811051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best app for tracking book wish list",
        "author": "ManueO",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10m52qi/best_app_for_tracking_book_wish_list/",
        "text": "I read a lot of obscure literary studies from the last 50 years and I want to get better organised at tracking books I want to read.\n\nI tend to jot down names as I encounter them in my research/readings on my phone, or on an Amazon wish list (I try and avoid buying from Amazon as much as I can but the wish list function is handy) but a lot of them are hard to find or pricey so it might take a while between writing them down and actually finding them so I often end up having several lists on the go which make things harder.\n\nI use library books when I can, and spend a lot of time going through second hand bookshop, and it would be great to have an app where I can add the titles as I go along, maybe with a priority rating (and maybe something I can share with others, in case my friends and family are feeling generous). Bonus point if it can tell me where I could buy some of the books I enter.\n\nI can see a number of apps online but I assume they are mostly designed for fiction rather than academic essays so I was wondering if you guys are recommendations?\n\nIn case it matters I am based in Europe and the books I read tend to be in French or English so something not solely focused on the Us would be marvellous!",
        "created_utc": 1674773513,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm about to complete a rhyming version of The Divine Comedy: Inferno, and...",
        "author": "StarMakerVisual",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10lpvcp/im_about_to_complete_a_rhyming_version_of_the/",
        "text": "Hi all,\n\nThanks in advance for your advice. I'm about to finish an English-version, fully rhymed adaptation of The Divine Comedy: Inferno. (all of it) I'll be preparing some illustrations and assembling the book for Amazon/etc., and putting it all together in the next week. It'll be ready soon.\n\nThe question I have is - once it's done, where exactly should I talk about it to let people know it exists? I have a feeling that contacting a bunch of university professors isn't going to be useful.",
        "created_utc": 1674733161,
        "upvote_ratio": 1.0
    },
    {
        "title": "on theorising refuge",
        "author": "dcgpark",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10llpq5/on_theorising_refuge/",
        "text": "hi all, I came across haraway's writing on anthropocene and the refuge in her [article](https://read.dukeupress.edu/environmental-humanities/article/6/1/159/8110/Anthropocene-Capitalocene-Plantationocene) (2015) \"Anthropocene, Capitalocene, Plantationocene, Chthulucene: Making Kin\", in which she defines the Anthropocene as one in which \"destruction of places and times of refuge for people and other critters\". \n\nI would love to know if \n\n1) anyone has responded to haraway since the publication of her article   \n2) if anyone knows of theorists who have written on the idea of refuge and refugia wrt literary studies\n\nthanks!",
        "created_utc": 1674715425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a meaning behind the following \"footnotes\" in H.G. Wells' The Time Machine?",
        "author": "KwaverKat",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10lfypk/is_there_a_meaning_behind_the_following_footnotes/",
        "text": "Sorry if this isn't the right place to ask, but I'm beginning to read a copy of the 1898 Tauchnitz Edition of *The Time Machine* and *The Island of Doctor Moreau* (only finished 2 chapters of the former so far) and I noticed some strange text that I can only describe as footnotes. On page 17 (7th page of the content) there is the title of the text on the bottom left accompanied by the Arabic numeral 2 on the same horizontal axis, closer to the right margin. Two pages later (pg. 19) the title, as with most pages, is not written in the bottom margin, but in the same place as the 2 in pg. 17, \"2\\*\" is written.\n\nLooking forward, the same happens with 3 and 3\\* on pg. 33, 35; 4 and 4\\* on pg. 49, 51; 5 and 5\\* on pg. 65, 67; 6 and 6\\* on pg. 81, 83; and so on. This also seems to continue into Doctor Moreau.\n\nI was wondering: what is the meaning behind these numbers (if they do in fact have meaning)? They're absent in my 2001 copy of the book with from Broadview Press edited by Nicholas Ruddick, so I assume it's something to do with publishing/printing as opposed to actual literary significance, but I am curious about what the numbers mean regardless.\n\nAlso, if there is a better sub to ask this in, please do let me know. Thank you in advance.",
        "created_utc": 1674696924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chaucer - Physician's Tale - Why is it narrated by a doctor?",
        "author": "_strawberrydaydream_",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10lbezz/chaucer_physicians_tale_why_is_it_narrated_by_a/",
        "text": "Apologies if this is the wrong sub, but I took a class in 2016 for the Canterbury Tales. When we concluded the course, I still didn't understand why the Physician's Tale was about a father beheading his daughter to save her virginity. In researching this question (because it does keep me up at night still -- I work in higher edu and have been periodically returning to my one unanswered question from undergrad), I can't find any clear answer or proposed theory. The physician narrator concludes the story about how sin always ends in death essentially, but this tale of morality (or allegory of virginal virtues) seems abstruse with the narrator being a doctor. Any thoughts, recommended reading, or suggestions are welcome -- thank you in advance!",
        "created_utc": 1674684908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did I read this?",
        "author": "ryickhard",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10laxek/where_did_i_read_this/",
        "text": "There's this story within the Greek, or was it Roman, canon. It's supposed to be a real episode of the author's life, so not fiction. Several couples go out to some sort of festivity, at which point the author starts explaining that there exists several types of love: agape, filia, eros, and so on. \n\nI can't for the life of me find the book. At first I thought it was something from Lucretius, but then I couldn't find it anywhere. \n\nI summon the power of bookworms united.",
        "created_utc": 1674683728,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did Hughes write the poem 'Thrushes'???",
        "author": "Able_Fan5963",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10kz46l/when_did_hughes_write_the_poem_thrushes/",
        "text": "",
        "created_utc": 1674654823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Tools for Building Glossary for Literary Translation",
        "author": "mantacraft",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10kvjx6/best_tools_for_building_glossary_for_literary/",
        "text": "[removed]",
        "created_utc": 1674642170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a philosophical essay a literary device?",
        "author": "UwU_Engineer_0_",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10k9ip4/is_a_philosophical_essay_a_literary_device/",
        "text": "If so, I'm curious about its origin and examples",
        "created_utc": 1674578008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be possible for humans to detect better-than-human literary skill?",
        "author": "11112222FRN",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10jjpyn/would_it_be_possible_for_humans_to_detect/",
        "text": "Hello, everyone. Odd question for you, if you don\"t mind: Do you think it would be possible for human experts to detect compositions written with superhuman levels of skill or sophistication?\n\nI may be stepping into a minefield that I'm unaware of here -- my background is not in literary studies, and I don't know how contentious the idea of literary skill or quality of work is. I guess my initial attempt to define it would be analogical: experts can usually detect a difference in sophistication between (e.g.) a dystopian story composed by an eight year old, and one composed by a bestselling novelist whose work is taught in literature classes, like Atwood or Orwell.\n\nMoving that analogy a step further: If there was something (or someone) capable of producing literature in a particular genre with greater-than-human skill, would it be possible for humans to spot the difference? If so, what methods do you think would be most promising in finding superhumanly good literary composition? Would the answer differ significantly by genre?",
        "created_utc": 1674498832,
        "upvote_ratio": 1.0
    },
    {
        "title": "HEY FOLKS, I'm Saurabh Azad, I teach English Literature to students pursuing their bachelor's, master's degree or preparing for the UGC NET exam. I teach online and the timings are flexible. If you want to deep dive into the ocean of literature then contact me email: profsaurabhazad@gmail.com",
        "author": "Prof_Saurabh_azad",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10ji0jp/hey_folks_im_saurabh_azad_i_teach_english/",
        "text": "",
        "created_utc": 1674494843,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Picture Of Dorian Gray",
        "author": "Embarrassedhooman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10je1du/the_picture_of_dorian_gray/",
        "text": "Can anyone help me understand the following sentence?\n\"The mutulation of the savage has its tragic survival in the self denial that Mars or lives.\"",
        "created_utc": 1674484925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with: readings on crisis",
        "author": "ModernContradiction",
        "url": "/r/CriticalTheory/comments/10j9r5m/help_with_readings_on_crisis/",
        "text": "",
        "created_utc": 1674471289,
        "upvote_ratio": 1.0
    },
    {
        "title": "How best to describe Addison and Steele's THE SPECTATOR?",
        "author": "thegeorgianwelshman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10j3s8h/how_best_to_describe_addison_and_steeles_the/",
        "text": "So THE SPECTATOR (of Addison and Steele) wasn't really a newspaper in the sense that it printed mainly hard news, correct? And it wasn't as lowbrow as icebreaker-games or conversation starters, either. I'm aware of its famous handle, \"to enliven morality with with and to temper wit with morality\" and that Addison and Steele envisioned it as indispensable in tea parlors, and for well-educated and well-spoken women---\n\nBut what did it actually publish?\n\nDid it stoop to gossip?\n\nDid it ELI5-ify philosophical matters?\n\nIt apparently was also read in the American colonies at the time, so it was delivered via boat? Wouldn't that be phenomenally expensive, given how heavy it would be as cargo and how perishable it would be in such a wet and moist environment?\n\nAnd if it was such a sensation, why did it last so comparatively briefly?\n\nWas it succeeded by another paper of its type?\n\nAnd again---how exactly would you describe \"its type?\"",
        "created_utc": 1674448205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canadian online bookstore query",
        "author": "tegeus-Cromis_2000",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10isygx/canadian_online_bookstore_query/",
        "text": "Hi all. I don't know if this question is appropriate for this sub. If not, please let me know what sub would be better. \n\nI'm trying to buy a copy of a pretty obscure French lit crit book, and the only copy I can find that is anywhere near to reasonably priced is on a site called raffin.leslibraires.ca . I'm in the States. If you've used them before -- is this a trustworthy site? Leslibraires.ca seems to be like a Canadian Abebooks -- is that right? And Librairie Raffin seems to be a bookstore in Montreal, though the site gives no indication of its physical location. \n\nAny opinions?",
        "created_utc": 1674418387,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about The Picture of Dorian Gray and specifically the Norton Critical Edition.",
        "author": "Burngis12",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10ibpol/a_question_about_the_picture_of_dorian_gray_and/",
        "text": "I’ve been wanting to read Dorian Gray for a while now. I started it recently, was profoundly moved by what I read but unfortunately life got in the way and I didn’t finish. Anyway. I just learned of the Uncensored version and I’m very intrigued.\n\nMy question is: is the Uncensored version the version within the Norton Critical Edition? I understand that in the NCE it has the 1890 and 1891 versions, but is that 1890 version the same as the Uncensored version? Having both in one copy would be incredible!\n\nThanks!",
        "created_utc": 1674364236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any books that outline Western (English &amp; French mainly) literary movements throughout history?",
        "author": "Jaerek",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10h0e60/any_books_that_outline_western_english_french/",
        "text": "Disclaimer: not a lit major.\n\nI am about to start reading Zola, however it occurred to me that I’d get the best out of the older classics by having an idea of the context they were written in as well as the movement the author subscribed to.\n\nAre there any books that can help with that? So far I’ve been recommended “From Dawn to Decadence: 500 Years of Western Cultural Life”, which seems interesting but I’m not sure if it fully covers what I want.",
        "created_utc": 1674230061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has There Been Any Research on What Exactly Makes a Text \"Flow\"?",
        "author": "Beautiful_Semantics",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10gzp5x/has_there_been_any_research_on_what_exactly_makes/",
        "text": "",
        "created_utc": 1674228353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bicycles in \"The Garden of the Finzi-Continis\"",
        "author": "Historical_Ad3828",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10gkrc7/bicycles_in_the_garden_of_the_finzicontinis/",
        "text": "I'm currently taking a lit class and we're reading \"The Garden of the Finzi-Continis.\" We're almost done with it but no one has yet brought up the meaning behind the bicycles. They keep popping up and I thought it might be a symbol for the division between the narrator and Micol (he gets a new electric bike, and she seems kind of indifferent about its safety) but that doesn't really get carried through. Are the bicycles just a symbol of innocence and being carefree?",
        "created_utc": 1674181484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended Audiobooks (or, youtube lectures)",
        "author": "wehavedrunksoma",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10gjdgy/recommended_audiobooks_or_youtube_lectures/",
        "text": "This has been asked a few years ago, but worth asking again. I realise that criticism can be a tricky thing to handle in audiobook format - but it's still been attempted. Does anyone have any recommendations? There are quite a few Harold Blooms available, for example. \n\nA secondary question is around lecture series that are available, either as \"audiobooks\" or just as youtube lectures. The latter is a sprawling category and it's hard to sort the wheat. I have found, and enjoyed, Geoffrey Hill and Simon Armitage doing their Oxford Poetry stuff in recent years.  \n\n\nThanks :)",
        "created_utc": 1674177722,
        "upvote_ratio": 1.0
    },
    {
        "title": "timbre?",
        "author": "99999www",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10g7pxj/timbre/",
        "text": "Is there a literary equivalent for the musical term timbre? \n\n  \nTimbre (Pronounced Tam-ber) is the quality of a musical note. It is what makes a musical note sound different from another one. Words like **round, brassy, sharp, or bright** can be used to describe the timbre of a sound.\n\nThanks!",
        "created_utc": 1674149615,
        "upvote_ratio": 1.0
    },
    {
        "title": "humanism in Elizabethan drama",
        "author": "drgooseberry",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10g0l68/humanism_in_elizabethan_drama/",
        "text": "what it be accurate to say that humanist thought that emerged from the Renaissance placed more emphasis on character development, internal thoughts, and emotions (in contrast to aristotelian emphasis on action and spectacle over character development and psychology)",
        "created_utc": 1674131615,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get started with Comparative Literature for self-study?",
        "author": "Fire_From_Nowhere",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10ffuqc/how_to_get_started_with_comparative_literature/",
        "text": "HI \n\nI've become interested in comparing literary texts in general.\n\nI've got a bachelor's degree in anthropology but never got as deep into literature as I would've liked  after my lower division English courses.. I'm pretty intrigued by the idea of comparative literature as a  field.\n\nAnother degree isn't in the cards right now, but I'm looking to do some  self study.  I need some reading suggestions, and online lectures if available.\n\nParticularly, I'm  looking for something focused on methods and theory  aimed  at the uninitiated. \n\nHow might I best attempt giving myself a comparative literature education without professorial oversight? \n\nThanks for reading.",
        "created_utc": 1674069168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fictions that depict lives of common people, challenges, problems in the developing nations (apart from South Asia)",
        "author": "SharonzHere",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10f7i39/fictions_that_depict_lives_of_common_people/",
        "text": "\nHey, so I am Indian and want to read about developing nations of other parts of the world apart from just South Asia.\n\nRecently read several Nigerian authors and loving them (The vagabonds, Every day is for the thief, The famished road, The fishermen, The man who fell from the sky and other stories, Half of a yellow sun)\n\nSpecial areas of interest - lives and rights of women, human migrations, urban vs rural life, inequality, corruption, social problems, lives of minorities, languages, micro-history in these regions, western influence on indigenous life etc.",
        "created_utc": 1674048787,
        "upvote_ratio": 1.0
    },
    {
        "title": "secondary lit sources",
        "author": "AromaticBit849",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10elyds/secondary_lit_sources/",
        "text": "Hi all, I have a paper due for German Literature (Bachelor year 2), mainly on Anette von Droste-Hüllshoffs Die Judenbuche ( theme: ecological novella avant la lettre?)\n\nThere are secondary sources on droste-portal.lwl.org/de/\n\nUnfortunately, my uni does not have rights to any of the publications, I have requested the library (a paying service) for pdfs of some chapters, but with the past holidays it’s taking ages. So I thought I might take my chances here, if anyone can access these publications, I would be immensely grateful. \n\n1) Literarische Krisenreflexionen im Zeichen der Ökologie : Mensch-Umwelt-Beziehungen in Annette von Droste-Hülshoffs Dichtung\nherausgegeben von Barbara Thums\n\n(Droste-Jahrbuch / im Auftrag der Annette von Droste-Gesellschaft und in Verbindung mit der LWL-Literaturkommission für Westfalen und dem Germanistischen Institut der Universität Münster, 13 : 2019/2020）\nWehrhahn, 2021\n\n2) Schubenz, Klara: Der Wald in der Literatur des 19. Jahrhunderts Geschichte einer romantisch-realistischen Ressource. Konstanz: University Press 2020. 505 S.\n\n3) Detering, Heinrich: Menschen im Weltgarten. Die Entdeckung der Ökologie in der Literatur von Haller bis Humboldt. Göttingen Wallstein 2020. 464 S.\n\n4) Jahnke, Uwe: Annette von Droste-Hülshoffs „Westphälische Schilderungen“ (1841/42). Neu gelesen als ein literarischer Beitrag zum aktuellen Umweltdiskurs. In: Österreich, Geschichte, Literatur, Geographie. Jg. 64 H. 2. Wien: Inst. für Österreichkunde 2020, S. 182–195.",
        "created_utc": 1673985930,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is historicist content analysis and an evaluative epithet?",
        "author": "spicyycornbread",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10dvtga/what_is_historicist_content_analysis_and_an/",
        "text": "Hi folks,\n\nI’m an undergrad who’s currently reading about American poetry. More specifically, Joseph Harrington’s, “Why American Poetry Is Not Poetry?”\n\nHe uses a lot of terms I’m not familiar with or that I have little exposure to. For instance, he says, “a textualist analysis of individual “literary” texts (be it a formalist explication or a historicist content analysis) is of more value as illustration than as model” (Harrington 497). I wasn’t sure what he meant by this. Does historicist content analysis have anything to do with old historicism versus new historicism? Is it referring instead to structure versus content in poems? I’m trying to break down some of the terms to get the bigger picture. \n\nAnother term he uses is evaluative epithet: “As a social form, poetry is not simply a value-neutral, universal taxonomic category but an interpretive cue and an evaluative epithet that shapes and uses judgments of texts” (497). I took this to mean that poetry has become more than itself. But do epithets have anything to do with the split between abstract/reality? And how is it evaluative? I feel like I’m missing a lot of context, and unfamiliar with some of the literary theory and literary history.\n\nAnyway, that was very long. Thank you in advance?",
        "created_utc": 1673911007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forest/trees in literature: Cannot come up with a good topic for Bachelor thesis!",
        "author": "Loud-Let-4403",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10d98r3/foresttrees_in_literature_cannot_come_up_with_a/",
        "text": "Hey redditors,\n\nI'm supposed to write my bachelor thesis on the topic of forest/trees in a chosen piece/pieces of anglophone literature. I find it really hard to find a focus of my investigation that would not be too broad but at the same time allow me to write +- 40 pages. Do you have any ideas that might help?\n\nIn terms of books I was thinking about LoTR, Narnia, the Hunger Games or fairy tales. Topics could be related to anthropomorphism, freedom, religion, ancient knowledge, etc.\n\nI would appreciate any suggestions!!",
        "created_utc": 1673857517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: Is there a term for contextual \"padding\"?",
        "author": "theologi",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10cy5j4/q_is_there_a_term_for_contextual_padding/",
        "text": "Is there a technical term for the parts displayed in italics here?\n\n&gt; *He closed his eyes again*, \"XXXXXXX\", he mumbled.\n\n&gt; The XXXXX was YYYYYY, *she noticed exasperated*.\n\nThey don't really describe much, and they don't move the plot along. Most of the time these fragments are inserted between dialogue as to avoid the typical variations of \"he said\".\n\nI was wondering if these snippets of narrative padding have their own name?",
        "created_utc": 1673824471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Thomas Paine use both \"hath\" and \"has\" in the same sentence?",
        "author": "VegasBallroom",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10cpy4i/why_did_thomas_paine_use_both_hath_and_has_in_the/",
        "text": "In the year 1693 records show \"hath\" and \"has\" were equally used, and 100 years later \"hath\" was still used about 15% of the time as it was slowly being transitioned out by newer generations.\n\nNevertheless, if \"hath\" is just an older form of \"has\", then why would someone use both, let alone in the same sentence?\n\n\"...but it hath so far happened that the first has failed, and the second has withdrawn her influence.\"\n\nThomas Paine's Common Sense 1776\n\nIn this work he uses \"hath\" 83 times and \"has\" 14. What's more, 20 years earlier in Tristram Shandy (1759) he uses \"hath\" 4 times and \"has\" 378.\n\nThis makes me think it is a literary device of some sort, but what it is meant to convey is beyond me.",
        "created_utc": 1673804967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: works about places/cultures that are intellectually backward, dominated by corrupt intellectuals, etc.",
        "author": "ainsi_parlait",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10cgnku/q_works_about_placescultures_that_are/",
        "text": "Hi, all, \n\nI am wondering if I can get some pointers regarding the topic I put above. More narrowly, I would like to know about works (fiction, nonfiction, film...) that are set in colleges, where intellectual culture has so degenerated that anything close to \"the life of the mind\" is made something of a mockery. \n\nMore broadly, I would welcome anything that exposes what can be characterized as \"intellectual backwardness\" in a culture (or \"intellectual backwater\" as a culture). \n\nThere must be something (if not \"tons\") out there that are about these things, but I couldn't think of anything myself. I will welcome all suggestions!",
        "created_utc": 1673778849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most Scholarly edition of Chaucer's works?",
        "author": "AggressiveChair7",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10c1se9/most_scholarly_edition_of_chaucers_works/",
        "text": "Hi everyone,\n\nI was wondering what is the primary edition people use for Chaucer scholarship or in an academic setting? I know the *Riverside Chaucer* was that edition for a long time, but I don't know if that is the case anymore. I'm asking since I want to read him because I didn't get to take a Brit Lit survey in undergrad. I also thought it would be useful for my eventual graduate studies of Spenser. Any help would be appreciated!",
        "created_utc": 1673734093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on choosing a class?",
        "author": "strawberryswing2",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10c040g/advice_on_choosing_a_class/",
        "text": "I’m a current sophomore in undergrad studying English + Cognitive Science, and I hope to attend graduate school. However, I feel as if the English classes I have taken have been narrow in scope so far, and I’d like to take a class this semester that grants me a solid, widely applicable framework of knowledge for my future studies in literature. I’m deciding between 1) Postcolonial Theory + Literature (reading Spivak, Fanon, Cesaire, etc) and 2) Tolstoy + Dostoevsky (reading Anna Karenina, The Brothers Karamazov, their shorter stuff, and exploring the context behind these works). I was wondering if taking a particular one of these would be more “useful” for me; I’m really torn between the two!",
        "created_utc": 1673731635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are voltas exclusive to sonnets?",
        "author": "sheephamlet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10bt6t2/are_voltas_exclusive_to_sonnets/",
        "text": "Can voltas appear in other types of poems or are they a feature only found in sonnets?",
        "created_utc": 1673715293,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the point of Literary theory: An Introduction by Terry Eagleton?",
        "author": "Revolutionary_Swim83",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10bj92z/whats_the_point_of_literary_theory_an/",
        "text": "Can someone tell me the purpose of Terry Eagleton why he wrote this? Why did he want to define literature?",
        "created_utc": 1673683938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sources from Karl Marx and beyond explaining or discussing crude, or vulgar, socialism?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10b7bp8/sources_from_karl_marx_and_beyond_explaining_or/",
        "text": "Is there a body of work dealing with this subject matter in more depth, than Marx's original framework; or is it pretty much just Marx and them explaining his ideas?\n\nI'm looking for research to write about crude socialism for a literary thesis, also cross posting this to r/askphilosophy\n\nBonus if you know materials by reputable authors (ideally peer reviewed, but book reviews for popular publications are good too) who utilize Karl Marx's framework to discuss works of fiction, i.e. like maybe the ents from *Lord of the Rings* are crude socialists for some reason. (Silly example, I know)\n\nNote: if it matters, this is not for homework, and I am not in school.\n\nPlease help me find my source materials! Thank you!",
        "created_utc": 1673648287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Rimbaud considered a good poet?",
        "author": "funnyfloss222",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10b18wy/why_is_rimbaud_considered_a_good_poet/",
        "text": "what makes him so special compared to any other ordinary teenage poet?",
        "created_utc": 1673633514,
        "upvote_ratio": 1.0
    },
    {
        "title": "How good was Pound's Greek?",
        "author": "ItaloSvevo111",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10b0xph/how_good_was_pounds_greek/",
        "text": "I remember reading an early essay of his where Ezra Pound expounds on the history of poetry, citing obscure Greek poets and novelists of the 2nd and 3rd century AD. He clearly put some time into understanding classical literature. How good, do you suppose, was his Greek? Could you slide him some Thucydides or Pindar in the original and watch him spin it outwards into brilliant English ala Gilbert Murray or Oscar Wilde? I ask because he claims that he broke free from Victorian prosody by means of a careful reconciliation between the rules of Modern and Classical prosody. I want to know how thorough and automatic a comprehension of Greek speech he was basing that reconciliation upon.",
        "created_utc": 1673632788,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we aquire knowledge about literature?",
        "author": "sanchopantsa",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10atdja/how_do_we_aquire_knowledge_about_literature/",
        "text": "In a sense, this *could* be considered homework, but maybe you'll find the discussion interesting non the less:  \n\nMy boss asked the faculty a hypothetical: How is knowledge aquired in our different fields, and if we could \"put the three most important objects that represent this in a museum, what would the objects be?\"  \n\nFor an astronomer, this would most likely be the telesope, maybe a physisist would choose a spectrometer - but what would *we* (literary theorists etc.) choose? I suppose it would have to be a concept or idea more than a physical object for us.  \n\nObviously, the abilities to read/think/reason are true for all diciplines, as is the invention of the alphabet, printing, pagination etc.\n\nI've been racking my brain for a while, debating everything from the wheel and the agricultural revolution (efficiency in farming/production allocating more free time to leasure/academic endevours) to free speech and sociocultural understandings of epistemology.\n\nThen, maybe the answer is pieces of literary theory or poetics, that helped transform literature into an academic field of study, i.e. Aristoteles' *Poetics*, Frazer's *The Golden Bough*, theoretical frameworks like formalism, new criticism, post-structuralism etc., that this is the locus where theories about literature turns into knowledge?\n\nMaybe hermeneutics is the answer? Medieval exegesis? \n\nWhat do you believe are the most important aspects or instruments of aquiring knowledge about literature, historically or today? Is the question even answerable?",
        "created_utc": 1673612969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would anyone be willing to read over my statement of purpose for my Master's program application? (sorry if this isn't allowed)",
        "author": "nnnnbbbbb",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10abe7s/would_anyone_be_willing_to_read_over_my_statement/",
        "text": "I'm applying to literature MA programs and would really appreciate a read over of my statement of purpose from some literary studies-minded folks. Any and all help is welcome, but I would be especially grateful for advice/criticism from those of you who are familiar with reviewing these sorts of documents for admissions committees.\n\nLet me know if you're able to and I'll send the doc :) Thanks!",
        "created_utc": 1673559155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was MOBY-DICKS published in England before the United States?",
        "author": "thegeorgianwelshman",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/109xgd5/why_was_mobydicks_published_in_england_before_the/",
        "text": "I was just browsing though some rare book sites and I came across a first edition of M-D and its description said that it was a first \"US\" edition, which appeared slightly after the English one. \n\nWhy would this be the case?\n\nHow did a New York writer sell his book first to an English publisher? Especially in a time when trans-Atlantic communication was so laborious?",
        "created_utc": 1673522966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Novels (other than Proust) that deal with the recovery of lost memories?",
        "author": "sixmarks",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/109mghm/novels_other_than_proust_that_deal_with_the/",
        "text": "Short stories too…",
        "created_utc": 1673487226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help: Confusion Regarding Poststructuralist Discourse Analysis",
        "author": "Wholeigh",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/109m6o7/help_confusion_regarding_poststructuralist/",
        "text": "I was directed by a kind user in r/literature to ask my question here. So, can anyone here explain poststructuralism in simple terms? Specifically, what a poststructuralist discourse analysis would entail? \n\nI am currently in the running for a PhD position. My proposed project aims to explore queer representation in anti-trafficking discourse in the US, as well as to document and compare queer experiences of trafficking. I chose intersectionality and queer theory as my theoretical background. My data will be collected and analyzed in two stages: the first method will be feminist, poststructuralist discourse analysis, and the second will be narrative interviews. \n\nI received the following feedback on my project proposal: \"She explains about choice of methodology, and mentions, among other things, poststructuralist discourse analysis. It seems a bit farfetched, and it does not become clear how this is 'Rejecting the notion of “truth” as a research goal.' This choice of methodology is hardly compatible with her choice of theoretical perspectives in the proposal.\"\n\nTheir feedback was a bit confusing to me, so I am trying to better understand poststructuralism before my interview. In the comments below, I will include the two relevant paragraphs I wrote in my project proposal (in case it helps). Thank you so much in advance!",
        "created_utc": 1673486490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendation for books on the history of poetic forms.",
        "author": "loselyconscious",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/109anmb/recommendation_for_books_on_the_history_of_poetic/",
        "text": "Hi Everyone; I am enrolling in a Comparative Literature graduate seminar in a couple of weeks. Part of the seminar is theory-based, which I have a lot of background in, but another part is poetics which I need to gain more knowledge of. The Prof recommended that I brush up on  \"matters in the history of the form (about sonnets; the history of the prose poem and its relation to verse-line; the couplet; poetic meter;  etc\" He recommended an encyclopedia to me, but I've also been looking for some works that more meant to be read (rather than used as a reference) \n\nAny recommendations for good books or articles on these subjects",
        "created_utc": 1673458769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the poem \"Elm\" by Sylvia Plath incorporate prosopopoeia?",
        "author": "sheephamlet",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/1099enj/does_the_poem_elm_by_sylvia_plath_incorporate/",
        "text": "Is the poet embodying the eponymous elm tree an example of prosopopoeia or am I mistaken?",
        "created_utc": 1673455839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my edition of Bleak House abridged?",
        "author": "DeadFlagBluesClues",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/108adfe/is_my_edition_of_bleak_house_abridged/",
        "text": "I bought an old hardcover edition of *Bleak House* at Goodwill published in 1953 by \"The Literary Guild\" with illustrations by Edward Gorey. This guy: [https://www.abebooks.com/Bleak-House-Dickens-Charles-Edward-Gorey/31282365443/bd](https://www.abebooks.com/Bleak-House-Dickens-Charles-Edward-Gorey/31282365443/bd)\n\nOn the title page, it says \"Arranged for Modern Reading\" and now I'm wondering if it's abridged?\n\nIt's 595 pages, whereas Amazon lists the current Penguin Classics as 1036 pages --- although that will include an intro and notes, and it's a  paperback, this is a larger format hardcover, so... feels inconclusive.  More intriguing, the Penguin Classics lists 67 chapters, whereas mine  has 66 --- it looks like my edition lacks chapter 63 \"Steel and Iron.\"\n\nIt looks like my edition is based on the text of the first (or an early) standalone edition because it includes a preface to the first edition written by Dickens, whereas the [Penguin Classic](https://www.amazon.com/Bleak-Penguin-Classics-Charles-Dickens/dp/0141439726/ref=sr_1_1?crid=2AQK9YDDO3ETV&amp;keywords=bleak+house+penguin+classics&amp;qid=1673319591&amp;qu=eyJxc2MiOiIzLjIwIiwicXNhIjoiMS42NSIsInFzcCI6IjEuODcifQ%3D%3D&amp;sprefix=bleak+house+penguin+classics%2Caps%2C112&amp;sr=8-1&amp;asin=0141439726&amp;revisionId=&amp;format=4&amp;depth=1) is based on the serialized publication --- Amazon preview and Google Books preview won't let me read the notes on the text, but the table of contents on the Penguin includes markers in roman numerals for what I'm guessing are serialized sections (like 3 chapters per section), and it doesn't seem like it includes the preface.\n\nSo I was thinking that maybe Dickens expunged the \"Steel and Iron\" chapter when it was published standalone. But [this copy on Project Gutenberg](https://www.gutenberg.org/cache/epub/1023/pg1023-images.html)  includes the Preface to the first edition and the \"Steel and Iron\" chapter. Maybe \"Steel and Iron\" was too subversive for the modern reader in 1950s America? Is it *Communist*?!\n\nSo idk what's going on. Didn't find anything weird about that chapter googling. Aside from that one chapter my table of contents lines up with the Penguin. Does anyone here know anything about the publication history of that chapter (was it left out of some editions?) or about the specific edition I have (is it abridged)?",
        "created_utc": 1673358837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any scholars who use formal logic, category theory or other mathematical approaches to study literature? (Not quantitatively!)",
        "author": "TheMadPrompter",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/107wbs1/are_there_any_scholars_who_use_formal_logic/",
        "text": "",
        "created_utc": 1673313372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite metaphors of the underworld/hell in literature?",
        "author": "parachutesandsparks",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/107v077/favorite_metaphors_of_the_underworldhell_in/",
        "text": "",
        "created_utc": 1673309876,
        "upvote_ratio": 1.0
    },
    {
        "title": "On the subject of so-called critical plot points (or 'sp01l3rs') in literature",
        "author": "Antonio-Mallorca",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/107qg3j/on_the_subject_of_socalled_critical_plot_points/",
        "text": "Do 'sp01l3rs' really ruin books like it's popularly believed or is that only a psychological trap? When you think about history, we all know the broad strokes just by cultural osmosis. Napoleon lost at Waterloo, Joan d'Arc was burned at the stake, the Confederates lost the American civil war, list goes on. Yet, at least personally, knowing the outcome doesn't destroy my interest on the narratives because I still want to know all the details and try to understand what happened, how it happened, why it happened, etc. I think if a narrative relies too much on a surprise, if a surprise is all it is, then it was already weak and shallow from the beginning and meant only to be consumed and disposed like a cheap commercial product rather than to work on multiple levels and to lend itself to multiple readings like a work of art. In my experience, 'sp01l3rs' are more talked about in genre fiction than in literary fiction.\n\nGenre fiction tends to be more plot-driven and in some cases plot is the whole reason of being, so knowing an important aspect of the plot can fundamentally alter the experience. While in 'serious' or literary fiction, plot is of second or third importance, so knowing a critical plot point cannot damage the reading that much because there are still multiple levels and dimensions to explore, understand, and analyze.\n\nIn the past, novels even used to summarize plot points at the beginning of each chapter and that included character deaths. I wonder, has an interesting article or book been written on the subject of 'sp01l3rs' in literature? Does it completely ruin our enjoyment, understanding or analysis of a work of fiction? Is there a certain element of psychology behind it? Or is this concept just a modern invention mostly?",
        "created_utc": 1673299314,
        "upvote_ratio": 1.0
    },
    {
        "title": "On the subject of so-called 'spoilers' in literature",
        "author": "Antonio-Mallorca",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/107qcgq/on_the_subject_of_socalled_spoilers_in_literature/",
        "text": "Do spoilers really ruin books like it's popularly believed or is that only a psychological trap? When you think about history, we all know the broad strokes just by cultural osmosis. Napoleon lost at Waterloo, Joan d'Arc was burned at the  stake, the Confederates lost the American civil war, list goes on. Yet,  at least personally, knowing the outcome doesn't destroy my interest on the narratives because I still want to know all the details and try to understand what happened, how it happened, why it happened, etc. I think  if a narrative relies too much on a surprise, if a surprise is all it  is, then it was already weak and shallow from the beginning and meant  only to be consumed and disposed like a cheap commercial product rather than to work on multiple levels and to lend itself to multiple readings like a work of art. In my experience, spoilers are more talked about in genre fiction than in literary fiction. \n\nGenre fiction tends to be more plot-driven and in some cases plot is the whole reason of being, so knowing an important aspect of the plot can fundamentally alter the experience. While in 'serious' or literary fiction, plot is of second or third importance, so knowing a critical plot point cannot damage the reading that much because there are still multiple levels and dimensions to explore, understand, and analyze. \n\nIn the past, novels even used to summarize plot points at the beginning of each chapter and that included character deaths. I wonder, has an interesting article or book been written on the subject of spoilers in literature? Does it completely ruin our enjoyment, understanding or analysis of a work of fiction? Is there a certain element of psychology behind it? Or is this concept just a modern invention mostly?",
        "created_utc": 1673299091,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’d like to be a nature writer; does anybody in the field have advice for a neophyte like me?",
        "author": "PolymerLilac",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/106w2uq/id_like_to_be_a_nature_writer_does_anybody_in_the/",
        "text": "For context: I’m 18, from the U.K, and will be starting university next year to study English Literature.\n\nI haven’t always been academically-minded, but my love of nature has always been there. Although I lost interest as a young teen, a silver lining of the pandemic was the excess free time I had to explore my local countryside (Dorset, Hampshire, Wiltshire), and the walking bug has been there ever since. \n\nIn that time, I also discovered my love of literature - and learning altogether. I’d always been mediocre at school, but I’ve worked incredibly hard in the past two years to voraciously read in my free time whilst improving my school grades. I was happy with my A-Level grades, and I have offers to study at the universities of Edinburgh, Durham and St. Andrews: I find out whether I’ve been accepted into Cambridge in 2 weeks.\n\nIn terms of the canon, I am particularly fond of Modernism, The Irish Revival, Romanticism, Beckett &amp; Pinter, Larkin, and the Decadent Movement. An eclectic mix of reading inspires my own writing in so many ways, and I am so excited to begin my degree and discover new works and styles. I also understand that my writing direction may very well change in three of four years time. \n\nAnd yet, nature writing is what grabs me - particularly that of Robert MacFarlane, but Thoreau, Richard Jeffries and Krakauer also. Even in terms of poetry, it is the likes of Hardy, Housman, the Romantics and pastoral Roman poets like Virgil that resonate with me. But, in terms of nature writing, what strikes me about MacFarlane is the perfected blend of poetry, biography and historical research. He evokes such beautiful imagery in a subject prone to tired metaphor: nature, and yet, with his ‘poetry’ comes such carefully-curated research on his landscapes that bring them to life. In reading works such as ‘The Old Ways’, MacFarlane’s genuine, passion for walking is obvious, and the emotional pull that comes with his writing never outweighs his inspiring academic touch. Nick Hayes’ ‘The Book of Trespass’ also comes to mind.\n\nI write poetry and short-stories in my free time, and, of course, write essays for school. But I have only began writing non-fiction recently; i’m currently working on a piece on the Jurassic Coast in Dorset, concerning my hiking experiences near St. Oldham’s Chapel, Corfe Castle and the general Purbeck landscape. But I’m unsure on what to do with it. \n\nDo I start a blog? Do I wait until it’s a finished product, and I’m at university, and speak to my professors about publishing articles for student papers or publishing my work locally? And, how do I go about finding the right literary circles to feed ideas with and get my name out there? I’m thinking I should keep writing and gaining new experiences, and then decide what to do with my writing once I’ve began my degree. \n\nI will without a doubt find my current writing puerile in 5 years time, so perhaps working only on improving my craft is the way forward. There isn’t any rush, as such, to start thinking about publishing. I do realise though that the younger I consider these questions, the more experienced I’d be when it comes to writing further down the line.\n\nI apologise if this was heavy-winded, and any advice would be greatly appreciated.",
        "created_utc": 1673216115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having trouble understanding a passage. I think there might be some sort of typo because it really doesn’t make any sense to me (but I’m not native so, of course, I might be wrong)",
        "author": "QuirkyRedhead16",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/106gzol/having_trouble_understanding_a_passage_i_think/",
        "text": "Hey guys, happy 2023!\nSo, I was wondering if you could come to my help once again. \nLike the title says I can’t figure out what this sentence means: “They would have a woman stripped and cobbed if she did anything they didn’t like”. I imagined that “cobbed” meant something like “beaten up” but none of the vocabularies I’ve consulted seems to confirm my thesis. But then, what the heck “cobbed” means in this context? The quote is from Susan Boggs and is contained in a bell hook’s book (this chapter, as you might have guessed, is about slavery).\n\nThanks to anyone willing to help!",
        "created_utc": 1673177114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is formalism dead?",
        "author": "y-e-l-p",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/105tnzi/is_formalism_dead/",
        "text": "What were the demerits of Formalism and is it out of fashion now? If not, then who are the contemporary formalists in lit crit",
        "created_utc": 1673110558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which turkish books are considered as superior?",
        "author": "Mountain_Invite5797",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/105qvqe/which_turkish_books_are_considered_as_superior/",
        "text": "I‘m looking for turkish works considered as superior or of high quality.",
        "created_utc": 1673103344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would Knowledge of Hermeneutics Benefit a Writer in Any Way?",
        "author": "chickenstuff18",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/105q60e/would_knowledge_of_hermeneutics_benefit_a_writer/",
        "text": "",
        "created_utc": 1673101383,
        "upvote_ratio": 1.0
    },
    {
        "title": "What genre or style of humour is the webcomic \"Sathurday morning breakfast cereal\"?",
        "author": "Relative-View3431",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/105gmnv/what_genre_or_style_of_humour_is_the_webcomic/",
        "text": "Hello guys, first of all, I hope this is the right subreddit to be asking this question. So I've always enjoyed this webcomic ( for those of you who aren't familiar with it I'll be leaving a link so you can check it out), but I'm not knowledgeable enough to understand what exactly makes it so unique and funny.\n\nOne of the things that I love about it, and definitely its main distinctive characteristic is how they employ an unnecessarily complex form of language to talk about mundane ideas or situations, it's especially funny when the characters are children.\n\nWhat is that kind of humour called? Is it a whole genre or perhaps a subgenre?\n\nThanks in advance!\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nLink to SMBC comic: [https://www.smbc-comics.com/comic/treadmill](https://www.smbc-comics.com/comic/treadmill)",
        "created_utc": 1673068523,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I interpret a book?",
        "author": "Otherwise-Tie-9906",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/10552u6/how_do_i_interpret_a_book/",
        "text": "I've read some books on literary theory which were cool, but they haven't answeared my question. I open a book... and now what? What do I do? What are the steps? I know I should look for some patterns but that's about it. How can I find the theme? Could you recommend me some book/lecture?",
        "created_utc": 1673038143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what Object Oriented Literature is?",
        "author": "lemonpuro",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/104b6a8/does_anyone_know_what_object_oriented_literature/",
        "text": "",
        "created_utc": 1672955092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for critical examinations of members of an oppressed population being used to oppress other members of a given oppressed group",
        "author": "WhiteMorphious",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/104b4ut/looking_for_critical_examinations_of_members_of/",
        "text": "Even just a name for the concept or direction of any kind would be great. I was watching severance and in that opening scene when she’s sprawled out on the table and mark is in the other room there’s a shot of a security camera on the wall behind them, and I started thinking about the use of Sepoys by the British, I understand (broadly) the social mechanisms and incentives behind it, but I’d be interested in reading more. \n\nThank you!",
        "created_utc": 1672954997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love in the Time of Cholera and La Violencia",
        "author": "yeezy_fought_me",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/1046hnf/love_in_the_time_of_cholera_and_la_violencia/",
        "text": "I’m about halfway through this wonderful, if sprawling, story and there is a lot of mention of “civil war.” To my understanding, Colombia’s La Violencia didn’t start until the mid-1940’s, and the book takes place between about 1880-1930. \n\nIs the “civil war” a different one than La Violencia? Does it involve the Spanish? It seems they have already left the country by this point. \n\nI guess this is more of a history question, heh.",
        "created_utc": 1672944069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Figuring out the sub-field of interest for PhD application",
        "author": "cavegod",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/1043rx2/figuring_out_the_subfield_of_interest_for_phd/",
        "text": "I'm interested in narratives research, especially looking at narratives using ideas and understandings from the field of psychology. For example, I read research on Event and Object Perception, Schema Theory, Situation Models, etc. I've come across cognitive narratology as a sub-field before, but there's hardly anyone in it. How do you guys go about  identifying and deciding on the sub-fields you want to work in? What do you write in your SOPs about that? (I'm looking to apply in the US)\n\nAlso, I read people saying apply for the top 20 universities. How do you figure which colleges are top for English Phds!? \n\nThank you.",
        "created_utc": 1672937569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! I need the 101, format, and best practices on how to write a critical analysis essay for MA/MFA admission.",
        "author": "Easy_Vegetable7636",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/103zvhu/help_i_need_the_101_format_and_best_practices_on/",
        "text": "While I am a writer, I don't have an undergrad background in Literature and didn't need to write critical analysis essays. I'm now applying for MA and need to submit a sample.\n\nI'm looking up the 101s, format, and best practices online but the advice is very unconsolidated. The essays I'm able to find online are also not particularly sharp and read like Sparknotes.\n\nWould anyone here be kind enough to share an essay sample with me? Also, direct me to any best practices? Especially the format.\n\nCheers!",
        "created_utc": 1672927920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Americans pronouncing Goethe with a “r”?",
        "author": "Imperial-Green",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/103lfz3/why_are_americans_pronouncing_goethe_with_a_r/",
        "text": "",
        "created_utc": 1672881708,
        "upvote_ratio": 1.0
    },
    {
        "title": "It never occurred to me: Anyone else headed to MLA???",
        "author": "amishius",
        "url": "https://www.reddit.com/r/AskLiteraryStudies/comments/1036go3/it_never_occurred_to_me_anyone_else_headed_to_mla/",
        "text": "In the future maybe I should plan an AskLit MLA gathering!\n\nI’d say drop panels but I don’t want anyone to dox themselves!",
        "created_utc": 1672846400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Editor at Penguin Random House",
        "author": "DazzlingDanielle",
        "url": "/r/publishing/comments/1028cgf/editor_at_penguin_random_house/",
        "text": "",
        "created_utc": 1672753065,
        "upvote_ratio": 1.0
    }
]