[
    {
        "title": "What is the most over-complicated article you've stumbled upon?",
        "author": "sawgeh",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86qd69/what_is_the_most_overcomplicated_article_youve/",
        "text": "I've been digging into a rabbit hole of wikipedia pages and some of these entries use the most unnecessary language. Its like someone busted out a thesaurus and fluffed some of them up",
        "created_utc": 1521859947,
        "upvote_ratio": ""
    },
    {
        "title": "How much can I be hacked if I log on to a government website with a personal machine?",
        "author": "flappingavocado",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86q7g0/how_much_can_i_be_hacked_if_i_log_on_to_a/",
        "text": "I'm a complete noob with netsec. If I were to log on to a government website with any machine not owned by the government, how much could they do?\n\nCould they \"hook\" into the machine from then on and have full access to the machine? I don't know. What sort of things *can* be done just through logging in?",
        "created_utc": 1521858255,
        "upvote_ratio": ""
    },
    {
        "title": "Job choice advice.. anyone move from sysadmin to compliance?",
        "author": "zukolfe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86pwx6/job_choice_advice_anyone_move_from_sysadmin_to/",
        "text": "I have a few offers on the table all within a comparable salary and I'm not really sure which to take since I have not worked in the security side of things before...if you have worked for more than one of these types of roles do you have any input? Best for longevity, interest, and work/life?\n\n\nMy personal goals lie with high management with a large company or doing blue team work...or management on a blue team would be cool I guess. Currently enrolled in a cybersecurity technology masters program.\n\n\nOffer #1: cybersecurity analyst for a large company supporting government contract. Shift work. (Log monkey + writeups? That's what it sounds like from the job description) 2 wks pto 85k\n\nOffer #2: security consultant for a top compliance company doing mainly fedramp assessments, scans and compliance, ability to move into pen testing if I get bored possibly (zero hands on technical implementation work)  prob 2 weeks pto (idk salary yet)\n\nOffer #3: promotion at current company to IT Manager for cloud services in a MSP (won't be touching security at all, half technical implementation and rolling out cloud stuff for our clients, half workflow improvement/management stuff). One direct reports, maybe 2. work from home 3x/wk, 3-4wks PTO. 90k base + potential bonus up to 94k (unlikely with the requirements)\n\n\nTo me job #2 sounds the most interesting. My fear is that I am stepping away from my highly technical role right now (network admin/systems consultant dealing with cloud infrastructure, 75k) and the experience there won't be useful to me in the future if I want to go back for a technical role. #3 is probably the one I am leaning away from the most because I don't really like my company, it's so small and I wear so many hats it's ridiculous (incident response, remediation, buildouts, engineering, presales, scoping, backup management, basically anything that touches our cloud offering I can be responsible for doing). #1 just sounds SUPER boring but I've never done it so I could be wrong?\n\n\nTldr if you were entering infosec/2 years into your career which would you choose? The more I get into the deep end of systems engineering work the more I realize I'm expected to know anything and everything and fix it... I think switching to compliance work might be better for my happiness(?) Long term.",
        "created_utc": 1521855252,
        "upvote_ratio": ""
    },
    {
        "title": "[Q] How do I find the IP address of a Vulnhub machine i just imported / what range to give in netdiscover",
        "author": "should_be_read_it",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86p693/q_how_do_i_find_the_ip_address_of_a_vulnhub/",
        "text": "",
        "created_utc": 1521848034,
        "upvote_ratio": ""
    },
    {
        "title": "website login auditing",
        "author": "timtekk876",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86nqf4/website_login_auditing/",
        "text": "Hello. I manage several fortinets for a small bank. They have a new request they'd like me to look into. They want to audit and log every administrative website login. My thought was I could use fortinet DLP with deep inspection to create triggers to search for terms like administrator, admin plus any other users they would like to monitor and log.\n\nI tested this and I did in fact get a log hit, however the log entry does not mention the expression that was matched. Meaning, I went to a website, used 'administrator' to attempt to login to the site - and I saw this logged in the fortinet. But again, it did not mention in the log that I was attempting to login with 'administrator'. It just really logged that fact that it matched a dlp trigger.\n\nAm I missing something? Should I be doing this differently with a different solution?\n\nThank you.\n",
        "created_utc": 1521835995,
        "upvote_ratio": ""
    },
    {
        "title": "Fresh out of College, SIEM Analyst to be, Looking for Some Pointers",
        "author": "furmuter",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86n5gj/fresh_out_of_college_siem_analyst_to_be_looking/",
        "text": "Hello All!\nI am graduating from university in a month and have a job lined up as a SIEM Analyst for a very very large global company. I would be lying if I wasn't a bit nervous about starting. I guess what I ask of you is if any of you, seasoned professionals, have any pointers or words of advice for a newbie starting out in this position. I am currently nearing the end of a great 1-year internship as an InfoSec intern, but my work comprised mostly of security systems administration tasks (System/Application Deployment and Management). I am currently doing research on the SIEM Product that they currently have in place to better understand the product and how it works, but I want to be as prepared as possible when it comes time to start in about a month.\n\nThank you in advance for any input that you guys have.",
        "created_utc": 1521831377,
        "upvote_ratio": ""
    },
    {
        "title": "Have you all had experience taking courses with MIS TI?",
        "author": "Astrobratt",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86mrqa/have_you_all_had_experience_taking_courses_with/",
        "text": "My boss wants me to look into to taking CISM course from the MISTI.COM training seminars, has anyone taking a info sec course from them? how did it go? any advice or thoughts would be welcome, thanks \n\nhttps://misti.com/\n",
        "created_utc": 1521828564,
        "upvote_ratio": ""
    },
    {
        "title": "Please Explain Encapsulation",
        "author": "N_04",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86m406/please_explain_encapsulation/",
        "text": "Hi guys, I'm a computer security student in Canada. Right now I'm reading through some slides my teacher has provided and he keeps talking about 'encapsulation'. \n\nA quick google search provides some definitions of the word, but I still feel like they aren't explaining the whole picture. Google defines encapsulation as \"the action of enclosing something in or as if in a capsule\". \n\nI would like to know what exactly this means in the context of a VPN.\n\nThanks for any help!\n______________________________________________________________________________________________________\nThanks for the responses guys, I think I get it now. Really appreciate the help :)",
        "created_utc": 1521823574,
        "upvote_ratio": ""
    },
    {
        "title": "\"value must match the pattern\" registry check",
        "author": "opl3sa2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86lxqu/value_must_match_the_pattern_registry_check/",
        "text": "Hi All,\n\nI used the SCAP 4.2 utility to identify vulnerabilities for classified systems compliance, and one of the fixes said that the registry value \"must match the pattern\" for reg_sz type.\nSpecifically, the value must match the pattern = '^$'\n\nThis is repeated several times in related to the EMET enhanced software protection registry values.\nUnfortunately this system is not hooked up to a domain, so I'm unable to manage this via group policy, and the local group policy editor on the machine doesn't have these values assigned.  It's a Windows 7 laptop.\n\nI'm getting an error when I set the value to *equal* \"^$\"  and other suggestions such as putting a space or two spaces or '123' or something do not work (the check still fails the requirement)\n\nHas anyone seen this type of language?  What do I do?\nThanks in advance for any help!\n\nRyan",
        "created_utc": 1521822287,
        "upvote_ratio": ""
    },
    {
        "title": "Project ideas with a spare router",
        "author": "Feel_the_Bernanke",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86leev/project_ideas_with_a_spare_router/",
        "text": "I just got a spare TP Link AC1200 router. What are some projects I can do with it? I’m open to any ideas. ",
        "created_utc": 1521818120,
        "upvote_ratio": ""
    },
    {
        "title": "What can you do with a memory dump?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86k7o7/what_can_you_do_with_a_memory_dump/",
        "text": "[deleted]",
        "created_utc": 1521807911,
        "upvote_ratio": ""
    },
    {
        "title": "Secret Clearance: Marijuana Usage?",
        "author": "throwaway19961003",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86hvol/secret_clearance_marijuana_usage/",
        "text": "Not sure if this is the right place but I'll ask anyway: \n\nI've recently accepted an internship for 8 months with a government contractor (engineering) and they require a secret clearance. On my SF86 I answered truthfully and put that I had used weed 6 times between November 2015 and September 2017. Will I likely be denied based on this? I have never bought/sold/trafficked any weed or any other drug, and I record is basically perfect aside from this. I also expressed that I did not wish to continue using.",
        "created_utc": 1521777838,
        "upvote_ratio": ""
    },
    {
        "title": "RAT with p2p support.",
        "author": "r3d-c0d3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86ht1k/rat_with_p2p_support/",
        "text": "As I don't have static public IP and an organization which I am trying to pentest doesn't have one. I need a trojan or payload which can support public trackers, p2p.    \nAny and all suggestions are appreciated. ",
        "created_utc": 1521777061,
        "upvote_ratio": ""
    },
    {
        "title": "Alternate sources for crackstation's master dictionary?",
        "author": "justahomosexual",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86hb5q/alternate_sources_for_crackstations_master/",
        "text": "I've tried multiple times to download [this](https://crackstation.net/buy-crackstation-wordlist-password-cracking-dictionary.htm) dictionary, but it fails every time. I've tried both torrenting and the http mirror, on both my tablet and desktop. It always stops at about 4gb. I recall someone uploaded it to a MEGA account a few years ago, but I can't find the link.\n\nThanks1",
        "created_utc": 1521771992,
        "upvote_ratio": ""
    },
    {
        "title": "Hacked?",
        "author": "DigDougDig",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86h792/hacked/",
        "text": "I am trying to understand how I am being hacked. Someone has been sending emails or social media posts or some other form of information to discredit my character because of some of the odd conversations I have had and lack of communication from some friends. And the very strange part is that no one will talk to me about it even the people I though were my closest friends. So, whatever is being said, is quite awful.\n\nI am nearly positive they are using my devices to do this because my batteries discharge overnight or at strange intervals during the day. The other day, I lost 10% over a period of 15 min with light usage. I have tried changing my passwords and resetting my computer and devices, but no luck, they somehow still have access to my devices.\n\nI am running Windows 10 on two laptops and have an iPhone 6. Before going to bed, I have tried to disable wifi and bluetooth through the task bar, device manager, and the wifi through BIOS. I have even set a password through BIOS. When I changed the BIOS settings, the battery drain stopped for a couple of days, but eventually started up again. I am losing about 7-10% battery from my phone and computer most nights. I am pretty sure this is not from bad batteries because it is not every night, and my phone does not lose charge when turned off or stuck inside a foil-lined box.\n\nNow for the even stranger part. I removed the wifi/bluetooth card from one of my laptops. Twice now, while on the lockscreen, the message \"Your device is having trouble recognizing you. Please try again.\" has refreshed repeatedly for over an hour. It only stopped once I went to repeatedly use the fingerprint sensor (I used the wrong finger to see what would happen, which was a locked sensor and required to use a PIN/password to login).\n\nIs someone attempting to access my computer despite removing the wifi card? How? Also, how can someone access a computer in which the wifi and bluetooth are disabled through device manager or when wifi is disabled through the BIOS? How can I protect myself?\n\nThank you!",
        "created_utc": 1521770911,
        "upvote_ratio": ""
    },
    {
        "title": "Edmodo Dump Help",
        "author": "ValueNull",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86goi3/edmodo_dump_help/",
        "text": "I might have been compromised in the Edmodo dump. I'm still not sure if one of my accounts was affected as I didn't get a HaveIBeenPwned email, but was registered before the hack happened.\n\nDoes anyone have a torrent/link to the file they could share with me so I can check if my account was leaked?",
        "created_utc": 1521765975,
        "upvote_ratio": ""
    },
    {
        "title": "MiTM &amp; SSL decryption vs. iOS Certificate Pinning",
        "author": "cnr0",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86fwun/mitm_ssl_decryption_vs_ios_certificate_pinning/",
        "text": "Dear Friends,\nthere is a shady iOS app and I am trying to analyse its traffic to see what kind data does it sends to cloud. I set up a nice MiTM proxy and SSL decryptor using Burp Suite, Wireshark and Ettercap. \n\nMy problem is, when I start SSL decryption using self signed certificate, this iOS app rejects any kind of connection. As far as I understand, there is some kind of certificate pinning, and it refuses establishing connection except this particular certificate is in use. \n\nIs there anything you can suggest for overcoming this? I am also ready to install this app into an Android device, but not sure if it helps.\n\nAlso another question: there are many SSL decryption appliances like BlueCoat and Websense. Does it mean, if you are using these boxes for decrypting SSL, some apps can be broken? Or how does they do it? \n\nThanks a lot,",
        "created_utc": 1521759308,
        "upvote_ratio": ""
    },
    {
        "title": "[eu, GDPR] What can be done when website won't delete your personal identifiable information?",
        "author": "Star-Lord_95",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86f93x/eu_gdpr_what_can_be_done_when_website_wont_delete/",
        "text": "Art. 17 GDPR Right to erasure (‘right to be forgotten’) defines 6 points that needs to be fulfilled in order to be permitted the *right to be forgotten* I have spent a couple of days now cleaning up my online portfolio. Most sites doesn't have a *delete* button, some offer a *deactivation*, some have been helpful during support request.\n\nThough there are some sites that refuse to delete my account(personal information). \n\nHow can I force the organization to delete my data? Is there a EU-service to force compliance to organizations? \n\nThe following needs to be fulfilled for *the right to be forgotten*.\n&gt; The data subject shall have the right to obtain from the controller the erasure of personal data concerning him or her without undue delay and the controller shall have the obligation to erase personal data without undue delay where **one of the following grounds applies**:\n\n&gt; a) the personal data are no longer necessary in relation to the purposes for which they were collected or otherwise processed;\n\n- \"I no longer wish to use their service\" - must be good enough?\n\n&gt; b) the data subject withdraws consent on which the processing is based according to point (a) of [Article 6](https://gdpr-info.eu/art-6-gdpr/)(1), or point (a) of [Article 9](https://gdpr-info.eu/art-9-gdpr/)(2), and where there is no other legal ground for the processing;\n\n- I'm not a lawyer or anything but I withdraw my consent.\n\n&gt; c) the data subject objects to the processing pursuant to [Article 21](https://gdpr-info.eu/art-21-gdpr/)(1) and there are no overriding legitimate grounds for the processing, or the data subject objects to the processing pursuant to [Article 21](https://gdpr-info.eu/art-21-gdpr/)(2);\n\n- I just don't want their service anymore. I object!\n\n&gt; d) the personal data have been unlawfully processed;\n\n- Probably not..Or maybe?\n\n&gt; e) the personal data have to be erased for compliance with a legal obligation in Union or Member State law to which the controller is subject;\n\n- Dunno about that. But the other reasons must be good enough\n\n&gt; f) the personal data have been collected in relation to the offer of information society services referred to in [Article 8](https://gdpr-info.eu/art-8-gdpr/)(1).\n\n- Sure! Some of them.\n\n\nIt seems to me that I should be able to have my information forgotten on various sites. \n\nHow can we make online services comply to the GDPR directive?\n\n\nSources:\n[Art. 17 GDPR Right to erasure (‘right to be forgotten’) - link](https://gdpr-info.eu/art-17-gdpr/)",
        "created_utc": 1521754117,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, what informations are stored in a TCP SYN queue Entry ?",
        "author": "Sidxzx",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86d30t/hello_what_informations_are_stored_in_a_tcp_syn/",
        "text": "",
        "created_utc": 1521737920,
        "upvote_ratio": ""
    },
    {
        "title": "Security of Webapp and Native App Delivery",
        "author": "TemporaryDecision",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86ctm0/security_of_webapp_and_native_app_delivery/",
        "text": "Hi, everyone, I hope I'm posting this in the right sub.\n\nSo, I vaguely remember someone saying that webapps are less secure than native ones.\nThe reason being that the server could be hijacked to serve malware when the user opens the app.\nHowever, isn't this applicable to native apps too? The server could serve you with malware when you download the app!\n\nHence, I want to ask several question about this:\n\n* Is what they're saying true?\n* If it's true, what's the difference between webapps and native apps that makes native apps more secure?\n* Also, is there anything people can do to make webapp deliveries as secure as native apps?\n\nEdit: some formatting",
        "created_utc": 1521736064,
        "upvote_ratio": ""
    },
    {
        "title": "nordvpn and duckduckgo still get targeted adverts",
        "author": "ctbkeep",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86bwlr/nordvpn_and_duckduckgo_still_get_targeted_adverts/",
        "text": "I use nord vpn( using double vpn)  and duck duck go - on android. but noticed that after i do , in the next chrome browser session ( with vpn NOT on ) i will see adverts featuring the country i just vpn'd through.\nWhy?  Does this mean these steps are worthless?",
        "created_utc": 1521728973,
        "upvote_ratio": ""
    },
    {
        "title": "Review a mini investigation, offer comment?",
        "author": "searchcandy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86aqtx/review_a_mini_investigation_offer_comment/",
        "text": "Hi Guys,\n\nI think I summed it up in my highly exhaustive title, I wondered if any security professionals wanted to have a pre-release look over an investigation I have put together? Also the opportunity is there to offer a comment that will be included.\n\nWithout giving too much away, I specialise in SEO - this is look at a particular service that due to technical failings is extremely vulnerable to a specific type of phishing. Wouldn't necessarily be a huge problem, were we not talking about one of the most popular financial websites in the world.\n\nFeel free to DM.\n\nEdit:\n\nIf I am breaking a rule or there is a better place to request this do let me know.\n\nCheers",
        "created_utc": 1521717742,
        "upvote_ratio": ""
    },
    {
        "title": "PCI-DSS - SAP Sybase column encryption and key management",
        "author": "AnakimiscoN",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86am1h/pcidss_sap_sybase_column_encryption_and_key/",
        "text": "Hi!\n\nAs part of a PCI-DSS certification, PAN numbers in database has to be encrypted at rest (condition 3.2) and key management must be implemented.\n\nSAP Sybase DB is used, and by default, the key used for data encryption is encrypted with a password stored inside the same database (with key custodian role etc). \n\nHowever, it seems like key-encrypting keys must be stored physically separately from data-encrypting keys to be compliant with PCI-DSS.\n\nIs it correct ? Am I misunderstanding something ?\n\nAnd my problem is that I can’t find any compatibility with HSM or KMIP protocol for Sybase product.\n\nHave you experienced this issue ? How did you managed it?\n\nThank you!",
        "created_utc": 1521716132,
        "upvote_ratio": ""
    },
    {
        "title": "Any Jason Bourne fans--I need some insight with a flag I found while practicing on a VM.",
        "author": "WadeEffingWilson",
        "url": "https://www.reddit.com/r/AskNetsec/comments/869va8/any_jason_bourne_fansi_need_some_insight_with_a/",
        "text": "I am working on my pentesting skills by downloading VMs from VulnHubs. I downloaded BlackMarket1 and started with the standard enumeration. It exposed several ports including port 80--low hanging fruit. I brought up my browser and navigated to the VM, requesting the root index. Nothing really on the page so I viewed source and I found a flag at the very end of the markup that was base64 encoded. A quick decode revealed that the flag reads 'CIA - Operation Treadstone'. An even quicker Google search tied that to the Bourne movies. \n\nI watched the first one years and years back but I haven't seen any others. I know it's a long shot but does anyone here know how that could be translated? A coworker that is working on OSCP said the latest one had some hacking in it but I haven't found anything online that points me to anything useful. For context, I have 3 points of access, the first (and location of the flag) is the login page at the web servers root index. I've tried 'jbourne' as the username and 'treadstone71'/'Treadstone71' as the passwords but I got nothing. I tried 'CIA' as the username and 'Operation Treadstone' as the password but *nada*.\n\nDoes anyone have any insight into the movies that might be possible login credentials? I'm trying not to brute force or use metasploit as it shouldn't require that to gain root.\n\nThanks!",
        "created_utc": 1521706064,
        "upvote_ratio": ""
    },
    {
        "title": "pci compliance interview question",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/867j23/pci_compliance_interview_question/",
        "text": "[deleted]",
        "created_utc": 1521679772,
        "upvote_ratio": ""
    },
    {
        "title": "How can you observe packets going through a VPN?",
        "author": "the_e_user",
        "url": "https://www.reddit.com/r/AskNetsec/comments/866hkp/how_can_you_observe_packets_going_through_a_vpn/",
        "text": "I hope everyone is well. My question derived from my curiosity on how VPNs encrypt your data, I wanted to know if there is a monitor packets being sent from your machine to the router and observe how the data is being encrypted through a VPN? If there is a video or article that goes through this that you recommend, I’d greatly appreciate it! \n\n",
        "created_utc": 1521671201,
        "upvote_ratio": ""
    },
    {
        "title": "Discord Server about hacking, the Darknet and more!",
        "author": "kakiluro",
        "url": "https://www.reddit.com/r/AskNetsec/comments/866dhy/discord_server_about_hacking_the_darknet_and_more/",
        "text": "https://discord.gg/9uh7W7X This Discord Server is the „Invisible Web“. The server is about the Darknet, Hacking (with Social Engineering and programming) and more. We make weekly hacking challenges and try to be as active ad possible! The server is always growing and thats why you should join aswell",
        "created_utc": 1521670370,
        "upvote_ratio": ""
    },
    {
        "title": "Security in a local developmental server",
        "author": "ZER_0_NE",
        "url": "https://www.reddit.com/r/AskNetsec/comments/864luj/security_in_a_local_developmental_server/",
        "text": "I will be creating a local developmental server using flask framework of python which will be connected to the local network(wifi or LAN). I will be using the webpage for hosting some information which I don't want to leak or in any way let other users connected to the same wifi know. What can be the possible security drawbacks that the local dev server can have? What can I do to eliminate them?",
        "created_utc": 1521657739,
        "upvote_ratio": ""
    },
    {
        "title": "Best Blue team SAN's course?",
        "author": "MT_work",
        "url": "https://www.reddit.com/r/AskNetsec/comments/864fhx/best_blue_team_sans_course/",
        "text": "I've already passed the SEC504. My current role is mostly IR, SIEM mgmt, DLP with more progress into a CASB/ Cloud infrastructure mgmt. I was thinking of taking SEC511 or since we are heavy Windows, FOR500. Work will pay for it. Any experience with either course, would you recommend?",
        "created_utc": 1521656559,
        "upvote_ratio": ""
    },
    {
        "title": "Request for OSWE Alternative or Similar Certification",
        "author": "droptableuserme",
        "url": "https://www.reddit.com/r/security/comments/85qybv/request_for_oswe_alternative_or_similar/",
        "text": "",
        "created_utc": 1521643712,
        "upvote_ratio": ""
    },
    {
        "title": "Career Paths in Security",
        "author": "CirclesWeRun4",
        "url": "https://www.reddit.com/r/AskNetsec/comments/862kcv/career_paths_in_security/",
        "text": "So this is about the millionth time I’ve asked for career path advice on reddit regarding security. I am fairly confident I am officially committed to network security. After being told I need to specialize in one part of cyber security since I started this journey I’m glad to finally know what I want to work with. \n\nThat being said, is network security too broad? Do I need to specialize in my specialization? What are some career paths in net sec? I like the idea of consulting/pen testing but I can’t really think of anything else other than being a network engineer. I suppose analysis is a big one or forensics? \n\nMy goal is to know networking inside and out and understand the best way to not only attack networks but more importantly defend networks. Is there a special name for this kind of career path? I’d imagine it’s something like network security consultant.\n\nThanks for the help! ",
        "created_utc": 1521643081,
        "upvote_ratio": ""
    },
    {
        "title": "Telegram Loses Bid to Block Russia From Encryption Keys",
        "author": "fredrikaurdal",
        "url": "https://www.reddit.com/r/AskNetsec/comments/862e9f/telegram_loses_bid_to_block_russia_from/",
        "text": "What do you think? https://www.bloomberg.com/news/articles/2018-03-20/telegram-loses-bid-to-stop-russia-from-getting-encryption-keys",
        "created_utc": 1521641791,
        "upvote_ratio": ""
    },
    {
        "title": "What's the easiest way for some still in school to get experience in this field?",
        "author": "MattJaccino",
        "url": "https://www.reddit.com/r/AskNetsec/comments/862atj/whats_the_easiest_way_for_some_still_in_school_to/",
        "text": "",
        "created_utc": 1521641043,
        "upvote_ratio": ""
    },
    {
        "title": "Was given a Zywall USG20 for free - What neat features should I look at?",
        "author": "Kukkacola",
        "url": "https://www.reddit.com/r/AskNetsec/comments/861jgf/was_given_a_zywall_usg20_for_free_what_neat/",
        "text": "Hi there!\n\nI have always had a slight interest within netsec on both homelab and enterprise level, but I haven't untill recently started homelabbing abit related to netsec.\n\nI work as a jack-of-all-trades sysadmin fulltime aswell.\n\nI was given a USG20 for free, and the only experience I have with them is portforwarding and basic usage.\n\nI guess that it has alot of features that I haven't thought about, can someone give me some tips on what to look at? What's neat with it?\n\nGreets.",
        "created_utc": 1521634016,
        "upvote_ratio": ""
    },
    {
        "title": "I think i may have a virus.",
        "author": "Oxlivous",
        "url": "https://www.reddit.com/r/AskNetsec/comments/861g1c/i_think_i_may_have_a_virus/",
        "text": "So i just logged in my computer everything is normal. I do a malware check with AVG daily when i wake up. But my security was off like all is off. So i tried to turn security protection on but it didnt work. I used Security Task Manager and it didnt show anything suspicious. I did a scan wiith AVG and no malware showed up. I tried going on google but it didnt allow me. The only way i could go on it by using the \"google it\" feature using Security Task Manager. Also while writing this i heard strange noises through my headphones. Please help!",
        "created_utc": 1521632991,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of an ISP employee can view one's internet history?",
        "author": "_G0D_87",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8617qv/what_kind_of_an_isp_employee_can_view_ones/",
        "text": "Logs are being kept in the UK. So for example you phone up your ISP for technical help can even they see your viewing history/habits? without the use of a VPN.",
        "created_utc": 1521630201,
        "upvote_ratio": ""
    },
    {
        "title": "A little more wisdom from you guys for my future path. (OSCP)",
        "author": "phillysliq",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85zz7q/a_little_more_wisdom_from_you_guys_for_my_future/",
        "text": "Hey NetSec-ians,\n\nFirst and foremost, thanks for all the inputs and help on my last question thread in regards to the Sec+ and the CISSP.\n\nI just had some more questions if all of you guys wouldn't mind answering.\n\nSo, I have set a path and wanted some input from those who have already been here and gone beyond. I'd greatly appreciate it if you could put your two cents in.\n\n\nNext week I will be taking my Sec+, which I am studying for very hard, but I am really looking forward to my future Pen Testing and have been mapping out a path. After my Sec+ I had been thinking of trying to go straight for my OSCP. To prepare for the OSCP I plan to complete the Udemy courses thoroughly, learn them inside and out.\n\nThe Complete Nmap Ethical Hacking Course : Network Security\n(https://www.udemy.com/the-complete-nmap-ethical-hacking-course-network-security/)\n\nKali Linux Hands-on Penetration Testing Labs\n(https://www.udemy.com/kali-linux-hands-on-penetration-testing-labs/)\n\nI was wondering if any other users could provide any other courses from Udemy, or anywhere else that would help me prepare for the OSCP. I know enumeration is a huge part to the OSCP and I really want to make sure I become extremely familiar with it. Also, on a side note, is nmap the BEST tool for enumeration? Or is there better one, or are they all pretty much equal?\n\nAlso, what are some other tools or things I should learn extensively for the OSCP? From what I researched, you can use metasploit ONCE, but thats it. \n\nLastly for those who have their OSCP's...\n\n1. What were your experiences with the OSCP? \n\n2. How long did you prepare for the the OSCP(days/months spent with how many hours of practice a day?)\n\n3. How did you study for the OSCP? Any books or other study material?\n\n4. After getting the OSCP how quickly can you find a job?\n\n5. Going from no certs, to my Sec+, then my OSCP, am I reaching for too much? or is it quite do-able? Is there a different path that you guys might suggest for me? \n\n6. I don't want my OSCP to be my end goal, where should my path branch out to after? What is the usual route?\n\nAnyways, thanks in advance for your guys' time and insight! Can't tell all of you how appreciative the collective wisdom from all you guys.",
        "created_utc": 1521613419,
        "upvote_ratio": ""
    },
    {
        "title": "Bypassing web redirects?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85zgtz/bypassing_web_redirects/",
        "text": "[deleted]",
        "created_utc": 1521607009,
        "upvote_ratio": ""
    },
    {
        "title": "Vulnerability Management Programs",
        "author": "clayjk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85zexk/vulnerability_management_programs/",
        "text": "Our company has been using tools to scan our networks for a long time now to identify Vulnerabilities. The program has been working okay but is quite manual in assigning out findings for remediation as we have multiple teams that are responsible for multiple aspects of our environment. With the size of our environment (1000+ servers, 3000+ workstations, plus lots of other random connected devices) it’s become a major effort to identify appropriate owners to resolve issues.\n\nHow are others building in automation to their Vulerability management program around assigning findings to owners to remediate and following up on remediation efforts?\n",
        "created_utc": 1521606399,
        "upvote_ratio": ""
    },
    {
        "title": "Can you have an IT job when youre 16? and can you get Certifications if you're 14-16?",
        "author": "AEarl8",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85z0un/can_you_have_an_it_job_when_youre_16_and_can_you/",
        "text": "Hello im just here to ask again a question , Reddit is so friendly ! So my question is can you have an IT job when youre 16 or 15? Also if you can get certification when you're just 14 -16? Thank you guys for reading",
        "created_utc": 1521602305,
        "upvote_ratio": ""
    },
    {
        "title": "Curl and sshd files modified -- Possible malware on Linux?",
        "author": "_Nexor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85yjgf/curl_and_sshd_files_modified_possible_malware_on/",
        "text": "So I recently found out about rkhunter and `rkhunter --check`ed to see what I'd get and I found the following lightly concerning lines:\n\n\n    [22:51:41]   /usr/sbin/sshd                                  [ Warning ]\n\n    [22:51:41] Warning: The file properties have changed:\n\n    [22:51:41]          File: /usr/sbin/sshd\n\n    [22:51:41]          Current hash: 82dfc680d1d33318e59abc2db032b4fb223144bb4417e1549a90719f800b153e\n\n    [22:51:41]          Stored hash : 680b25cfbdf8b006bb7d0383a384a37c71aa580802041827f2b5391648478b7a\n\n    [22:51:41]          Current inode: 6555790    Stored inode: 6557437\n\n    [22:51:41]          Current size: 791024    Stored size: 799216\n\n    [22:51:41]          Current file modification time: 1516284967 (18-Jan-2018 12:16:07)\n\n    [22:51:41]          Stored file modification time : 1489673087 (16-Mar-2017 11:04:47)\n\n    [22:51:41]   /usr/sbin/tcpd                                  [ OK ]\n    [22:51:41]   /usr/sbin/useradd                               [ OK ]\n    [22:51:41]   /usr/sbin/userdel                               [ OK ]\n    [22:51:41]   /usr/sbin/usermod                               [ OK ]\n\n    [22:51:41]   /usr/sbin/vipw                                  [ OK ]\n\n    [22:51:41]   /usr/bin/awk                                    [ OK ]\n\n    [22:51:41]   /usr/bin/basename                               [ OK ]\n\n    [22:51:41]   /usr/bin/chattr                                 [ OK ]\n\n    [22:51:41]   /usr/bin/curl                                   [ Warning ]\n    [22:51:41] Warning: The file properties have changed:\n    [22:51:41]          File: /usr/bin/curl\n    [22:51:41]          Current hash: e9682a9de75066479d4f73b0da2c875e5e2b99e9b7431059c6d235f9b77ae5f6\n    [22:51:41]          Stored hash : 4f694241b99fa80789f7711605fb2f48190f9c80224eb36a71c1b597b9913f93\n    [22:51:41]          Current inode: 6553774    Stored inode: 6562237\n    [22:51:41]          Current file modification time: 1521051165 (14-Mar-2018 15:12:45)\n    [22:51:41]          Stored file modification time : 1511895355 (28-Nov-2017 16:55:55)\n\nDoes that mean that curl binary and sshd have somehow been compromised? Is it ok to have these files overriden somehow, like it says in rkhunter log?",
        "created_utc": 1521597670,
        "upvote_ratio": ""
    },
    {
        "title": "Blacklists checking site",
        "author": "beiroot_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85yarp/blacklists_checking_site/",
        "text": "Do you know any sites / services that enable you to check if your ip, domain, email address is blacklisted? \nI know there are thousands of them, but perhaps there is \"one to rule them all\", even if it's commercial?\nSomething like: http://multirbl.valli.org/ but with more dev-friendly interface or API?\nthanks!",
        "created_utc": 1521595439,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the biggest, most well known, and regarded Incident Response companies?",
        "author": "nEv3rl4nd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85y1n2/who_are_the_biggest_most_well_known_and_regarded/",
        "text": "I'm looking for the opportunity to apply my skills and knowledge, and to effectively respond to and handle APTs and perform the kinda cool stuff that we get to read about on the news. I only know of FireEye and CrowdStrike is there any other company who should be on my radar?",
        "created_utc": 1521593208,
        "upvote_ratio": ""
    },
    {
        "title": "Advice for email hosting",
        "author": "Searchlights",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85xuhg/advice_for_email_hosting/",
        "text": "Having moved everything to a password manager last year, set up 2FA on everything I could, and moved all my connectivity  to VPN, I'm thinking I need to turn my attention to the gaping hole in my personal security that is Gmail.\n  \nDoes anyone have advice about best practices for secure email?  I'm wondering if I should register a domain and then layer that email address in to Protonmail or something like that.  \n  \nIs there a privacy and security conscious email hosting provider you'd recommend?  What would I need to do about spam, phishing and virus filtering?\n  \nIdeally there's a provider that would let me register a custom domain, that has strong built in filtering, and isn't going to sell or give away my data to the first company or government entity that asks for it.",
        "created_utc": 1521591446,
        "upvote_ratio": ""
    },
    {
        "title": "Bypassing UAC - IFileOperation",
        "author": "vicyry3pi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85vbgy/bypassing_uac_ifileoperation/",
        "text": "So I was looking at tutorials like \"Anatomy of UAC Attacks\"  from fuzzysecurity, it was pretty interesting to look around for exes with elevated privileges that are missing dlls. So I tried DLL Hijacking and stuff but the IFileOperation always pops a dialog box on my Windows 10 machine. \n\nSo I saw some mentions about elevated COM operations. The problem is I am not familiar with the windows subsystem.\n\nIs there anyone that can point me to the right direction on learning more about COM and DCOM objects? I am more interested in reading about them from an offensive perspective but anything would help me learn more about them.\n\nThanks in advance. ",
        "created_utc": 1521572185,
        "upvote_ratio": ""
    },
    {
        "title": "Best practice for packet analysis",
        "author": "rd_kldp",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85uslh/best_practice_for_packet_analysis/",
        "text": "could anyone tell me, is there any way/specific/best practice to analyze packet. I mean from where to start, what should I see or what content I can ignore or anything?",
        "created_utc": 1521568493,
        "upvote_ratio": ""
    },
    {
        "title": "Questions for pentesters",
        "author": "sephstorm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85tjhr/questions_for_pentesters/",
        "text": "What do you wish you had learned or knew as a junior tester, and what skills do you think new testers need to practice/master?\n\nI expect reporting to be a top thing, but i'm already aware of that, as well as skill in talking to clients and explaining things to them in a non-technical way.",
        "created_utc": 1521559456,
        "upvote_ratio": ""
    },
    {
        "title": "is there any other way/library/software to implement SSL/TSL instead of using OpenSSL library.",
        "author": "rd_kldp",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85tj55/is_there_any_other_waylibrarysoftware_to/",
        "text": "is there any other way/library/software to implement SSL/TSL instead of using OpenSSL library. also, want to know about OpenSSL 1.0.1 vulnerability for SSL/TSSL if possible.",
        "created_utc": 1521559373,
        "upvote_ratio": ""
    },
    {
        "title": "Did your college gpa ever keep you from landing a job? If it did what is it (if you don't mind)",
        "author": "MattJaccino",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85suek/did_your_college_gpa_ever_keep_you_from_landing_a/",
        "text": "I'm a student in college right now and i'm going down the cyber security concentration for computer science.  I'm taking these ridiculous classes like advanced chem and i'm not doing too hot.  Just looking for reassurance.\n\nSide question:  would it be better to try to learn violent python or learn java for this field?",
        "created_utc": 1521553838,
        "upvote_ratio": ""
    },
    {
        "title": "Security Assessment/Pentesting Company",
        "author": "MastrM",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85stmx/security_assessmentpentesting_company/",
        "text": "Hello /r/Asknetsec - \n\nI'm considering starting up an Inc., offering pentesting services.\n\nI have a bunch of Security Advisory experience, \nsome pentesting experience, but mainly looking to just own the business, and hire expert pentesters...\n\nAny advice for this kind of business?  If any of you guys have experience owning, or even working in a pentesting company.\n\nRegulations/Laws I should be cognisant of?  Any sectors to maybe focus on or avoid even? haha\n\nMy main concern is how to go about marketing/obtaining a client base...  I feel like cold calling acquaintances and/or strangers, asking if they would consider a pentest, may not be the most efficient solution.\n\nAny recommendations/advice would be appreciated!\n\n**  EDIT: Wow thank you guys so much for all the fantastic advice!  Love this community\n",
        "created_utc": 1521553640,
        "upvote_ratio": ""
    },
    {
        "title": "I do not know where else to ask this,I did not receive a lot of feedback in /r/itcareerquestions.Please provide some insight regarding my career crossroads",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85renx/i_do_not_know_where_else_to_ask_thisi_did_not/",
        "text": "[deleted]",
        "created_utc": 1521538460,
        "upvote_ratio": ""
    },
    {
        "title": "Logging Guidelines",
        "author": "nuubles",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85q9zt/logging_guidelines/",
        "text": "Is there a best practices logging guidelines you leverage?\n\nSomething that includes level of logging by type (Desktop, Server, Proxy, etc.) along with recommended retention?",
        "created_utc": 1521522861,
        "upvote_ratio": ""
    },
    {
        "title": "Are residential backconnect networks legit?",
        "author": "Mr_Nice_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85pwp2/are_residential_backconnect_networks_legit/",
        "text": "I scrape a lot of data so sometimes need to rotate my ip.  I have recently come across several companies advertising online that offer residential backconnect networks.  They claim anywhere in the range of 50,000-15,000,000 ips.\n\nThis sounds suspiciously like a botnet but if it's a botnet how can they all be advertising on adwords?\n\nIs there some legit way these companies gain access to all these IPs?",
        "created_utc": 1521518635,
        "upvote_ratio": ""
    },
    {
        "title": "[Using Metasploit on Kali] exploit/windows/smb/psexec with correct credentials fails with error “connection reset by peer”",
        "author": "ElectroMagCataclysm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85osw8/using_metasploit_on_kali_exploitwindowssmbpsexec/",
        "text": "Hi. First time post here. I thought someone could possibly help me with this. Thanks so much for any and all help. \n\nThis is the only information given about the error. When using psexec.exe from a windows computer, everything works fine and I can get a cmd shell for example. The solutions listed here do not change the error, and I haven't found any helpful descriptions of or solutions for this error code anywhere else online.\n\nEdit:\n\nI have tried every suggestion from the comments here and still receive the same error. The error is, exactly:\n\nAfter \"authenticating to &lt;IP:Port&gt;|localhost as user &lt;username&gt;...\":\n\nExploit failed [no-access]: Rex::Proto::SMB::Exceptions::LoginError Login Failed: Connection reset by peer\n\nExploit completed, but no session was created\n\nHowever, I did discover a few weird things that may be relevant:\n\nWhen I tried to run the same exploit and payload from a windows machine with Metasploit, the error was different. It was:\n\nRex::Proto::SMB::Exceptions::LoginError Login Failed: An existing connection was forcibly closed by the remote host.\n\nAnother thing to note: when running psexec.exe on a windows computer (not through metasploit), the connection fails (access denied) when run like so:\n\npsexec -s \\compname -u localadminusername -p localadminpassword cmd\n\nor\n\npsexec \\compname -u localadminusername -p localadminpassword cmd\n\nor\n\npsexec -s \\compname\\localadminusername -u localadminusername -p localadminpassword cmd\n\nor any other combo like that. However, for some reason, if I first run:\n\nrunas /netonly /user:compname\\localadminusername cmd\n\nthen enter the password, then (in the runas cmd window) type:\n\npsexec.exe -s \\compname cmd\n\nIt runs fine and I get a shell. I hope this is helpful info for the resolution of this problem. Thanks again for your help. :)",
        "created_utc": 1521507850,
        "upvote_ratio": ""
    },
    {
        "title": "Alex Stamos, leaving Facebook, this is bad right?",
        "author": "jduffle",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85obyw/alex_stamos_leaving_facebook_this_is_bad_right/",
        "text": "https://mobile.nytimes.com/2018/03/19/technology/facebook-alex-stamos.html?referer=http://digg.com/\n\nThis is bad right, seems to me Alex is respected for standing up for what is right. He left yahoo for their crap, which means Facebook is now being shady too?\n\nI mean Facebook was already evil, but I am wrong that this is a really bad sign?",
        "created_utc": 1521503836,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Marked IP address sending out data/\"calling home\"",
        "author": "button_R",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85mwog/malicious_marked_ip_address_sending_out/",
        "text": "I posted on /r/AntiVirus but perhaps could get some insight here.\n\n\nI use Spiceworks to scan computers in my corporate network and it flagged one of the systems as communicating with a malicious website from AlienVault's OTX database (might need an email address to view, I can post a screenshot if needed) from the report it has about 168 associated domains.:\n\n\nhttps://www.alienvault.com/open-threat-exchange/ip/199.59.242.150 \n\n\nNone of the virus or malware scans came up with anything.\n\n\nI checked the firewall logs and realized multiple computers were sending outbound data on high 30000-60000 TCP ports to 80/443 TCP ports.\n\n\nI disabled the IP address on the firewall as a workaround right away. And am still watching for blocked traffic.\n\n\nWireshark shows many [SYN] flagged data attempting to reach out incrementing high TCP ports and is lacking in terms of data.\n\n\nIt is quick but while I was seeing traffic from Wireshark I ran:\n\n\n    netstat -abop tcp\n\n\n\nand was able to get this:\n\n\n    [chrome.exe]\n    TCP    10.1.0.50:30904        199.59.242.150:https   SYN_SENT        23672\n    [chrome.exe]\n    TCP    10.1.0.50:30905        199.59.242.150:https   SYN_SENT        23672\n\n\n\nI removed all plug-ins, deleted all data, uninstalled Chrome, removed AppData\\Local\\Google folder, then reinstalled and we are still getting the data attempting to reach. It seems like affected users are using Chrome and it seems from Windows and Android devices.\n\n\nMy manager was one of the few not having the issue and had Adblock Plus enabled and once he disabled it packets were attempting to push through. I installed and enabled it on another system and was unable to see any further activity.\n\n\nIt seems to have a few screenshots and websites that have redirected to it, all related to ads:\n\n\nhttps://urlscan.io/result/7959d8e2-1cdb-44b7-a7e5-0921ed694891#summary\n\n\nI guess I am just trying to figure out what related sites and what exactly is the trend here and if anyone has any extra information on this or advice to find what exactly is trying to get sent out. \n\n\nIt may just be a matter of block and move on.",
        "created_utc": 1521492414,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to inject code into a javascript variable?",
        "author": "Elias4918",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85mrmc/is_it_possible_to_inject_code_into_a_javascript/",
        "text": "I found an XSS vulnerability in a site that allows me to change the variable document.body.style.backgroundColor to whatever I want. Is there anything I can do with this other than change the color?",
        "created_utc": 1521491385,
        "upvote_ratio": ""
    },
    {
        "title": "Digital Signature/Certificates",
        "author": "fAAlcor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85llcy/digital_signaturecertificates/",
        "text": "So I think I understand this from a conceptual point of view and want to confirm. Outlined below it my understanding, please let me know if I am right or wrong, thanks.\n\nDigital Signature = write message &gt; hash the message &gt; encrypt the message w/ private key &gt; send\n\nMessage is received by recipient and de-crypted with senders public key. The hash is then ran again to ensure integrity of message.\n\nDigital Certificate = The senders public key for the digital signature which is provided by a certificate authority or intermediary.\n\nIs my understanding right?",
        "created_utc": 1521482839,
        "upvote_ratio": ""
    },
    {
        "title": "What are TEMP.* names ?",
        "author": "jeff597",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85lcrl/what_are_temp_names/",
        "text": "Hello,\n\nI noticed the some APT group's names are prefixed with TEMP, for instance : TEMP.Zargos, TEMP.Periscope, and TEMP.Reaper. Is it sort of ID ? please could you give more information ?\n\nKind regards. ",
        "created_utc": 1521481080,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Am I the only one who is unable to teach myself? Its seems I can only learn from real world experience.",
        "author": "bleepsnap2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85l7na/meta_am_i_the_only_one_who_is_unable_to_teach/",
        "text": "Its odd, and could apply to any heavily technical field. But I have a difficult time learning on my own. When I'm put in a real world scenario, like a job, I learn quickly. I graduated with an engineering degree at a 3.8 GPA, but I attribute this only to the guided framework of the academic environment. \n\nMaybe this is a learning disorder? It makes me feel stupid, and is definitely lowering my potential. The way I got my first InfoSec job was by saying, literally, \"I don't have any experience in this field, but I have a passion for security and just need someone to give me a chance\". No joke, they told me that got me hired. (I was still able to answer most of the technical questions like how many ports are there etc...)\n\nI quit my job in November and just kind of feel lost. Sorry for the rant, I'm just hoping someone can relate to this.",
        "created_utc": 1521480029,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best place (podcast, journals, YouTube channel, etc) to read about security (cyber being one of them) from an engineer (systems, EE, SW) not a sys admin point of view.",
        "author": "surfingNerd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85l5o4/what_is_the_best_place_podcast_journals_youtube/",
        "text": "I've followed a few podcasts, which have good information, but not really applicable to what I want to do. Can't seem to find a systems/software engineering focused security forum.\n\nOpen to suggestions.",
        "created_utc": 1521479611,
        "upvote_ratio": ""
    },
    {
        "title": "Network and web app security get alot of attention and have plenty of learning resources, but what about cloud security?",
        "author": "bleepsnap2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85l35y/network_and_web_app_security_get_alot_of/",
        "text": "I wouldn't even know where to start. I find it interesting but completely lack the knowledge. When I think of cloud, I think alot of high powered VM's really. Anyone here specialize in it? Any interesting perspectives you could share?",
        "created_utc": 1521479105,
        "upvote_ratio": ""
    },
    {
        "title": "HTTPS on Router",
        "author": "AbdulaOblongata",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85kock/https_on_router/",
        "text": "How much of a risk is it to leave HTTP enabled for the local web interface.  I'd prefer to use HTTPS but enabling HTTPS opens port 443 from the WAN interface even though remote management is disabled.",
        "created_utc": 1521476107,
        "upvote_ratio": ""
    },
    {
        "title": "Okay to block Trovi and Conduit?",
        "author": "Infosecpleb",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85k9ic/okay_to_block_trovi_and_conduit/",
        "text": "We have a decent amount of users that seem to have adware directing them to these adware sites.  I want to block them.  Any reason why I wouldn’t?  Our checkpoint firewall blades are only blocking the traffic sometimes.  I’m trying to figure out why that is too.",
        "created_utc": 1521472878,
        "upvote_ratio": ""
    },
    {
        "title": "Confusion resulting from /etc/shadow and MD5 hashing while trying to crack passwords on practice VM",
        "author": "SecurityBoons",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85jwg9/confusion_resulting_from_etcshadow_and_md5/",
        "text": "[removed]",
        "created_utc": 1521469972,
        "upvote_ratio": ""
    },
    {
        "title": "Cisco Nexus simulator",
        "author": "CatsAndIT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85jwel/cisco_nexus_simulator/",
        "text": "Hello all!\n\nI've been tasked with learning Cisco's Nexus OS, but unfortunately, we don't have any spare equipment to practice on at the moment. I was wondering if there are any decent (and free) Cisco Nexus simulators?\n\nThanks in advance!",
        "created_utc": 1521469960,
        "upvote_ratio": ""
    },
    {
        "title": "SSLScan with a local proxy",
        "author": "spark-mcfargle",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85jq4v/sslscan_with_a_local_proxy/",
        "text": "I'm trying to get SSLScan to use a local proxy for its tests, because the target is only reachable via the proxy. I can't find anything relevant in the man pages.\n\nOn Kali I tried to configure the http/https proxy with:\n\n    export http_proxy=\"http://PROXY_SERVER:PORT\"\n    export https_proxy=\"https://PROXY_SERVER:PORT\"\n\nBut sslscan does not seem to care and fails to test the target as it's not reachable without proxy.\n\nI can't use an online tool. How can I force sslscan to use a proxy for its tests?\n\n**edit:** SSLyze offers a `--https_tunnel` option, which works just fine. But I'm still searching for a solution with SSLScan.",
        "created_utc": 1521468548,
        "upvote_ratio": ""
    },
    {
        "title": "Do penetration testers make lower salaries than other InfoSec professions?",
        "author": "Knight_of_the_Stars",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85jhwb/do_penetration_testers_make_lower_salaries_than/",
        "text": "I read somewhere that penetration testers make lower salaries than other InfoSec fields, because everyone wants to be a penetration tester so there is more competition. Is this true?",
        "created_utc": 1521466531,
        "upvote_ratio": ""
    },
    {
        "title": "Dll hooking Android app?",
        "author": "rJohn420",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85iwkq/dll_hooking_android_app/",
        "text": "Hi, I was thinking of hooking into an Android app (from an emulator).\n\nHow could I do that?\n\nI also need to fetch some data,  but I do not know where this data is located nor how it is called inside the app.\n\nThis is uncharted territory for me so I am making only assumptions: memory dump (to know where and how the data needed is located)?\n\nAlso, are there tools that might help me in this task?\n",
        "created_utc": 1521460727,
        "upvote_ratio": ""
    },
    {
        "title": "How to run attack defense CTF?",
        "author": "giomke",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85ipo0/how_to_run_attack_defense_ctf/",
        "text": "Hi guys.\nI want to run attack defense ctf at office for fun. what frameworks and platforms can you suggest me",
        "created_utc": 1521458435,
        "upvote_ratio": ""
    },
    {
        "title": "Where to create my own pentesting methodology?",
        "author": "j6keey",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85in6z/where_to_create_my_own_pentesting_methodology/",
        "text": "I would like to start documenting different commands and making my own methodology for pentests that I do. I'm looking for some sort of platform that I can access from my work and personal laptops. I have tried using Github but have been struggling to keep it organised. Any suggestions are greatly appreciated. ",
        "created_utc": 1521457574,
        "upvote_ratio": ""
    },
    {
        "title": "Moving from an unsecure email address",
        "author": "Pug55",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85h9vw/moving_from_an_unsecure_email_address/",
        "text": "Hi, I'm not sure if I'm asking in the right subreddit but I'm hoping some people here have insight on what my options are.\n\nI've used the same email address for &gt;10 years and every day I get about 10-15 people trying to log in to it, trying to sync to it etc as well as Paypal and Apple phishing scams constantly. I've got a good password and 2FA but I'm worried that eventually something might cave, seeing as it's a Microsoft account. I want to move to a new Gmail address and have it as my 'master', so that a bunch of other emails I use for various things can use the new one for recovery etc. I also want to move my Paypal and all my other services to a new email. Is there any speedy way of doing this short of going into every service and changing it? Or should I quit worrying?",
        "created_utc": 1521438582,
        "upvote_ratio": ""
    },
    {
        "title": "Sec+ and the CISSP",
        "author": "phillysliq",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85h13i/sec_and_the_cissp/",
        "text": "Hello AskNetSec-ians,\n\nI just hate a quick questions and wanted the more experienced member knowledge and insight on this matter.\n\nI read somewhere that the Sec+ covered nearly 70% of the CISSP material, and that if you pass the Sec+, with a little more studying, you should easily be able to pass your CISSP. \n\nFrom your experience, how true is that? Also, how much does the Sec+ really compare with the CISSP in your opinion?\n\nAlso, I want to become a pentester, and as a pentester, would it be worth getting? I know the CISSP is a bit expensive, but how much really would it be helpful to my career as a pentester? (In regards to salary and my skills as a pentester)\n\nThanks in advance for your guys' insight!",
        "created_utc": 1521435484,
        "upvote_ratio": ""
    },
    {
        "title": "are malware author not aware?",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85gka8/are_malware_author_not_aware/",
        "text": "i see that a lot of infections make use of external connections to command and control servers to download additional tools but don’t they know if we restrict internet connections out then wouldn’t that thwart their attempts ?",
        "created_utc": 1521430036,
        "upvote_ratio": ""
    },
    {
        "title": "Confusion resulting from /etc/shadow and MD5 hashing while trying to crack passwords",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85fsrm/confusion_resulting_from_etcshadow_and_md5/",
        "text": "[removed]",
        "created_utc": 1521422115,
        "upvote_ratio": ""
    },
    {
        "title": "Election security: disclosure and transparency vs. security by obscurity?",
        "author": "sp00k3yac710n",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85fja4/election_security_disclosure_and_transparency_vs/",
        "text": "Hello netsec world,\n\nI am not a netsec professional or even an amateur, so please forgive my lack of technical knowledge.\n\nI’m looking for your opinions on if there is a case to be made for an election authority, say at state/county/municipal levels, to invite auditing or pentesting/red teaming of election infrastructure, and to share the results with the public (presumably after any discovered vulnerabilities were patched). \n\nIf you, as a netsec professional, had to make the case for this, what would it be? \n\nIs security by obscurity ideal or effective for election infrastructure? \n\nIs there a better case to be made for open security, and/or security by design? \n\n",
        "created_utc": 1521419519,
        "upvote_ratio": ""
    },
    {
        "title": "Two years in a compliance role and not really sure where to take things from here.",
        "author": "bleepsnap2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85f2cf/two_years_in_a_compliance_role_and_not_really/",
        "text": "So I'm looking for some guidance on how to get started in my situation. My end goal is not  necessarily to become a full-blown pentester but I would like to understand the fundamentals. I have two years of information security Consulting under my belt but this was more focused on General compliance audits based on Frameworks like nist, Sans, those kind of things. jumping straight into pentesting with sources like vulnhub and things like that are obviously an excellent way to learn. However my working knowledge of networking is limited and I feel like that is something I need to start with. I did take a fairly comprehensive networking class in college however it was high level but detailed. We covered the OSI layers with great detail but none of it was Hands-On or vendor specific. We designed networks but never implemented them. I'm thinking it would be beneficial to take a class on something like udemy either focusing on networking+ or CCNA, I'm not sure.\n\n The feedback I'm looking for is if you guys agree that brushing up on networking first would be the what to go, and if so if you have any resources you would suggest getting started with. My degree was in software engineering. But to be blatant I am not a skilled coder. I went straight into a compliance position which required an understanding of technology, networking, essentially the jargon, without any hands on. we did the occasional nessus scan but for the most part that was left to the pentesters. Due to the risk associated with knocking out a server from an aggressive scan, scanning and technical testing took alot of coordination with the client for obvious reasons. \nI know there are some compliance guys on here. Any of you compliance guys pivot from the  generalist role into a more technical position?\n\n Really my end game is just to have a more comprehensive and rounded out understanding of security. I'm not after an oscp or any of the well known pen testing certifications. I simply want to extend the breadth  of my information security knowledge before I go more into depth into a certain area. Any feedback on where to head from here would be very much appreciated.\n",
        "created_utc": 1521415024,
        "upvote_ratio": ""
    },
    {
        "title": "GICH or GCED?",
        "author": "brc55",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85exze/gich_or_gced/",
        "text": "I’m deciding between training for either the GIAC Certified Enterprise Defender and GIAC Certified Incident Handler. I’m looking to be a security analyst/engineer. Which would be the best to take first? I have 2 years experience - combination of IT audit and cyber defense. \n\nThanks!",
        "created_utc": 1521413908,
        "upvote_ratio": ""
    },
    {
        "title": "Confusion resulting from /etc/shadow and MD5 hashing while trying to crack passwords",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85ef43/confusion_resulting_from_etcshadow_and_md5/",
        "text": "[removed]",
        "created_utc": 1521409244,
        "upvote_ratio": ""
    },
    {
        "title": "Attack vectors in my online security, feedback needed.",
        "author": "RiBc_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85cnwa/attack_vectors_in_my_online_security_feedback/",
        "text": "I have envisioned this setup that would fit my needs and keep my online accounts safe, and would appreciate if a more knowledgeable security person would revise it and give me feedback:\n\n- Using a spare phone for 2fa (kept always offline) with recovery phrases written on a typewriter (printers have caches) and keeping them in a safe\n- Using lastpass for password management with FIDO u2f key\n- Using a FIDO u2f key to access my main google account (which is linked to all my relevant online accounts for communication/password retrieval)\n\nMy main questions with this are:\n\n- Currently I use my daily phone for 2fa, but due to malware and theft, I consider this to be vulnerable. Am I paranoid, or is using a second phone offline reasonable? Also, one thing that has been bothering me is that many accounts require a telephone number as a second option in case I lose my 2fa authenticator (paypal offers only sms verification). Is it a big security risk to give these services my phone number for account recovery as someone could theoretically social engineer my operator and get a replacement sim card, or is it just paranoia?\n- Would you reccomend any other app (lastpass seemed to have the best UI and supports u2f)? Is using a password management app a possible attack vector ?\n- Would you reccomend using one main google account which is linked to all of my other accounts, with a very strong (30 char) password and a u2f key, or rather use multiple accounts also using u2f? This is more of a convenience issue, whether it is usefull or just a waste of time to have multiple accounts for every major account (banking, paypal, etc.).\n\nSome other question regarding general security:\n\n- I am using norton antivirus on all devices. I have read very good reviews on kaspersky total security, and using norton mobile has been a total pain (significant performance impact). What alternatives would you recommend, It could even be using multiple programs (anitviruses do not catch everything). I have very limited knowledge of detection rates and benefits of using multiple security programs, so more elaboration on this would be helpful.\nAny help would be greatly appreciated. I know this is a complex post, so thank you to anyone who bothers reading.",
        "created_utc": 1521394095,
        "upvote_ratio": ""
    },
    {
        "title": "Where is my JavaScript exploit for Spectre that is going to own the world?...",
        "author": "fsckewe2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85bprv/where_is_my_javascript_exploit_for_spectre_that/",
        "text": "I had the please of listening to a \"hacker\" ...aka pentester... tell me all about Spectre and how his \"team\" was actively developing a JS exploit that would \"own everything that had a broswer.\" Which was fun, because when I asked him about flushing cache, or tracking hit and miss cache reads, I got a deer in headlights look.\n\nSo, where the fuck is my remote JavaScript exploit that is going to own the fucking internet?",
        "created_utc": 1521385246,
        "upvote_ratio": ""
    },
    {
        "title": "Use old router as Rogue AP rather than hostapd?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/85b7of/use_old_router_as_rogue_ap_rather_than_hostapd/",
        "text": "[deleted]",
        "created_utc": 1521379760,
        "upvote_ratio": ""
    },
    {
        "title": "What videos and articles should I make to show I know what I’m doing so I can get a decent CyberSecurity job?",
        "author": "jeremiaht",
        "url": "https://www.reddit.com/r/AskNetsec/comments/859y05/what_videos_and_articles_should_i_make_to_show_i/",
        "text": "Hello I just passed my security plus exam and have a decent resume/background in web development. But I’m having quite a difficult time trying to secure a cybersecurity job. I decided to create a Learning site on my website and see if that would attract more interest to my skills. The list is [here](learning.jeremiahtillman.com)\n\nBut I feel that list of topics is too rudimentary. Does anyone have any suggestions of what to add to my list?\n\nThanks",
        "created_utc": 1521358967,
        "upvote_ratio": ""
    },
    {
        "title": "My attacker can see my monitor",
        "author": "whalewomen",
        "url": "https://www.reddit.com/r/AskNetsec/comments/859tbc/my_attacker_can_see_my_monitor/",
        "text": "I got new attacker or maybe part of attacker group(location is same but not sure). but they newly started stealing my programs since 2017/11.  \nThey can literally see my Offline and Tails laptols. unless they can steal my encrypted program from VM that has Tor access only. and decrypt it.  \nTheir sites stopped when I update my programs in offline PC and store it to this Tor VM or some apt-get(not only once. this happen literally every month). then applyed it to their articles.  \nUnpacking the module and analyzing it is relatively easy tho. it's nearly impossible to steal it from my Tor VM. Plus they could see even Tails access sometimes.  \nIt's more reasonable to think that they can see my laptop monitors. I can't belieave both. but in my security. this is more reasonable.  \nBut considering the fact that my direct neigbhor is always lighting up his room 24/7. even more reasonable to me. I think he is collaborator to them. somehow he is broadcating  my PC monitors to his frends. and doing this shit.  \n\n\n\n \n\n",
        "created_utc": 1521356583,
        "upvote_ratio": ""
    },
    {
        "title": "Blackhat talk that showed using multiple AV vendors inroduces vulnerabilities",
        "author": "backwardsthong",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8581pv/blackhat_talk_that_showed_using_multiple_av/",
        "text": "Mid-2000s someone presumably Argentinian from Core Security (aka the Argentine \"Tax Office\") gave a talk accompanied by many PoC, demonstrating having multiple AV scanners (maybe 1 vendor at the border and another on the endpoint) actually increases risk because they liberally interpret specs, discect many file formats that are equally or more vuln than native readers.\n\nName that tune mother fuckers!\n\nG-d bless LSD (.pl!)",
        "created_utc": 1521334195,
        "upvote_ratio": ""
    },
    {
        "title": "Further Action Needed After Firewall Block?",
        "author": "seeqr",
        "url": "https://www.reddit.com/r/AskNetsec/comments/855v0x/further_action_needed_after_firewall_block/",
        "text": "I clicked on a link from google search results, and my Symantec firewall blocked it. Is there any further action necessary on my part? The text that popped up in Firefox was pretty scary, talking of freezing bank accounts. I'm hoping that's unnecessary.",
        "created_utc": 1521313228,
        "upvote_ratio": ""
    },
    {
        "title": "RSA SecurID type token for personal use?",
        "author": "bamhm182",
        "url": "https://www.reddit.com/r/AskNetsec/comments/854pit/rsa_securid_type_token_for_personal_use/",
        "text": "I work in a place that forbids USB devices and cell phones, but I really want to have some sort of 2 factor authentication device that I carry around on my keychain. They've recently implemented RSA SecurID devices on some of the systems and after playing around with it, something like that would be great for what I'm looking for. Unfortunately, the cost doesn't work for someone who's just interested in a little extra security on their hobby and personal accounts. I'm just looking for a simple TOTP token that I can integrate into things such as LastPass, Gmail, GitLab, etc. I've been looking at Yubico for a while and might try to get permission to carry one of their products if there's nothing more suitable to my needs. Looking forward to your recommendations. Thanks!",
        "created_utc": 1521303091,
        "upvote_ratio": ""
    },
    {
        "title": "Help Me , I want to be a Cyber Security Expert ! What path should i take?",
        "author": "AEarl8",
        "url": "https://www.reddit.com/r/AskNetsec/comments/853thf/help_me_i_want_to_be_a_cyber_security_expert_what/",
        "text": "Hello Sir / Maam , I want to be a Cyber Security Expert . Im 14 Years Old . (Im not a kiddie haxor who wanna be a cool kid) I really need a tip and help from you guys. Im going to Senior Highschool Next Next Year. I want to learn early , can you give me something to start at. Because i dont know where would i start. Also what track should i take in my Senior High School , There are 4 Tracks but im only going to name 2 because i know theyre useless (Academic Track :with 4 Strands (GA)(HUMMS)(STEM)(ABS) or (Technical-Vocational-Livelihood Track : with 4 Strands (Agri-Fishery Arts)(Home Economics)(Industrial Arts)(Information and Communications Technology). Anyone who can help me to develop my skills ? thank you for reading guys",
        "created_utc": 1521294484,
        "upvote_ratio": ""
    },
    {
        "title": "SANS Technology Institute anyone?",
        "author": "GangBangMeringue",
        "url": "https://www.reddit.com/r/AskNetsec/comments/851fbj/sans_technology_institute_anyone/",
        "text": "Hey all. I've been looking into STI for a possible Master's degree a bit down the road. Just wondering if anyone has gone through the program or any of their certificate programs. Would love to hear your thoughts on it; workload, subject matter level, amount/quality of instruction provided, resources during your non-classroom time, anything else worth sharing. Thanks!\n\nMore info here for those not familiar: https://www.sans.edu",
        "created_utc": 1521259758,
        "upvote_ratio": ""
    },
    {
        "title": "Security website forums",
        "author": "xSteviex",
        "url": "https://www.reddit.com/r/AskNetsec/comments/850gy4/security_website_forums/",
        "text": "Hi. I can't find any information about security website forums. I'm interesting in defense. In internet there are many information about offense. Anyone can share blogs/article/books/forums about security defense or any subject that have relative?",
        "created_utc": 1521249529,
        "upvote_ratio": ""
    },
    {
        "title": "i am missing something on the following issue on Santander bank",
        "author": "bleahbloh",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84zz9b/i_am_missing_something_on_the_following_issue_on/",
        "text": "since i am not a expert on this and by default one can think i am missing something but i dont understand what please help me understand \n\nrecently i had to call santander bank two times and is natural for them to check my ID number and so on and after they asked for ID number both times they asked for two position(like 2nd and 3rd character) of my password to verify the person on the phone \n\n\nhow ? how they can verify that ? afaik the only way to do it is having the passwords on plain text stored in the db \n\ni am missing something on this ?",
        "created_utc": 1521244664,
        "upvote_ratio": ""
    },
    {
        "title": "Website database hacked, I think? Can anyone help me diagnose this?",
        "author": "SkepticWolf",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84zxed/website_database_hacked_i_think_can_anyone_help/",
        "text": "I'm having a big problem here and I'm really hoping someone can help.  I'm not even sure if I'm in the right sub.  Here's the symptoms:\n\nA few times now, my file system (shared hosting, Hostgator, over 10 domains hosted) has been filled with some bullshit.  What I will find is a rewritten \"Index.php\" in the home directory with a redirect added to the beginning to a \"config.php\".  That config file absolutely doesn't belong there.  I really don't know exactly what that file is doing 'cause it's all encrypted.  \n\nThere's also a bullshit \"sitemap.xml\" file full of all kinds of links to image files on my site that shouldn't exist.  There will also be a directory added with a crapton of image files, all tiny files, none of which are openable, all of which are named with crazy set of characters.  My guess is that they're image files broken up into pieces and assembled by whatever code they've installed.  Probably storing CP or some such nonsense on my server space.\n\nObviously I don't know that for sure, but it seems like a reasonable guess.  Especially as the intent appears to be that my site's continue to work unaffected.  They don't appear to be trying to attack site visitors, just use my webspace for their purposes.\n\nI've tried changing CMS passwords, CPanel password, and cleaning all of it out.  And it comes right back.  I can see the logs showing it all getting loaded at like 3 am.  Currently I'm getting totally bombarded with hits for (again) links on my site that shouldn't exist.  Most of them come in as \"/index.php/oqnefonqnfonq&lt;--lots of gobledygook.  I would just block that IP, but whoever it is seems to be masking it as a googlebot.  It's showing google's IPs and everything.  I blocked a few specific IP's that seem to be used most often which seems to slow it down, but it's clearly not a permanent solution.\n\nGiven that I changed all the passwords and cleared out all the crap in my file system (I'm fairly certain) and it keeps reappearing, I'm guessing they must somehow have access to my databases?  I should note, I'm a not trained at any of this, I'm a music teacher.   That said, I think I'm decent enough at handling the file system side, but I'm a total moron with SQL and databases and the like.  I always have the CMS to do that for me.\n\nCurrently I have everything clear, CMS firewalls up as best I can manage, and passwords changed.  I also added?/changed? passwords for the only user listed with access to those specific databases.  I don't know if it's going to work, but I'll find out tomorrow morning.\n\nHowever I don't think it will.  I'm looking for suggestions.  I really want to avoid paying Sitelock thousands of dollars to fix a bunch of personal websites that I run for zero income.  Anyone have any ideas?",
        "created_utc": 1521244183,
        "upvote_ratio": ""
    },
    {
        "title": "What keeps viruses and other malicious programs from naming themselves something innocent like \"Windows Host Process\" or something?",
        "author": "smallbritishboy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84y0p6/what_keeps_viruses_and_other_malicious_programs/",
        "text": "Or *do* they do that, and I'm just not noticing?\n\n A lot of the time they're named something completely sketchy like \"NETMINER\" or something. Because of that lots of people say to search for unknown folders and processes and it works just because they stand out...\n\nWhy aren't all malicious things made to blend in? ",
        "created_utc": 1521227805,
        "upvote_ratio": ""
    },
    {
        "title": "What degree will set me up the best for becoming a cyber-security specialist",
        "author": "CNN_Politics",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84y09f/what_degree_will_set_me_up_the_best_for_becoming/",
        "text": "So basically, I've got a good GPA good test scores, and fit into the average for schools such as Johns Hopkins! I can reasonably pursue almost all degrees/schools except Ivy League! What educational route would raise my chances for getting a job as a cyber-security specialist?\n\nPs.\nComputer Science degree VS. Cyber Security degree?\n\nPps. I've had a High-school level cyber security class and basic programming classes already\n\nEdit:\nJust wanted to say that I really love hacking, and it's a passion of mine, but I'm only a little ways past a script-kiddie! I only know how the attacks work in theory, and conceptually! However I have no practical, in depth knowledge of both how to protect the system, and even how the attacks truly work!\nI can tell you all about basic networking stuff, and how a Rowhammer Bit-flip works, but If you asked me to demonstrate I'd need a tool!",
        "created_utc": 1521227717,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion: Is a machine certificate a second factor of authentication?",
        "author": "snorkel42",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84wnoc/opinion_is_a_machine_certificate_a_second_factor/",
        "text": "Hi folks,\n\nMy coworkers and I have been having an argument for over a year, and I'd be curious to hear your opinions on it.  The question is basically what is in the title..  Would you consider a machine certificate to be a second factor of auth for something like VPN access?\n\nMy co-workers mostly say yes.  You first have to login with username/pass (something you know) and then the VPN solution requires a valid machine cert to connect (something you have).\n\nI say no.  The machine cert isn't linked to the user in any way.  It is not something the user has, it is something the machine has.  The machine cert requirement is a good control and should be present, but for a true second factor it has to be something uniquely tied to the individual user that is authenticating (FOB, thumbprint, push notification to user's phone, etc).\n\nIf forced to argue the opposite stance, I could make a case that the system with the cert being issued to the individual employee makes that system and therefore the installed machine cert linked to the user.  However, I feel this is a bit of a stretch.  \n\nAnyhoo, this is for the most part academic, but I'm curious to hear where other folks stand on this.",
        "created_utc": 1521217169,
        "upvote_ratio": ""
    },
    {
        "title": "DLP solution",
        "author": "joker197cinque",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84vfdn/dlp_solution/",
        "text": "Hi guys, can you please suggest a robust DLP solution for Windows ?\n\nI see that Symantec, Forcepoint and Digital guardian are the most popular.\n\nI'd prefer it cloud based.\n\nThanks for letting me know your favorite one and why.",
        "created_utc": 1521207102,
        "upvote_ratio": ""
    },
    {
        "title": "Help needed to analyse Skype-Android hack",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84tj9h/help_needed_to_analyse_skypeandroid_hack/",
        "text": "[removed]",
        "created_utc": 1521183130,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give me a practical overview of Recon-NG and its uses?",
        "author": "nuubles",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84t6wi/can_someone_give_me_a_practical_overview_of/",
        "text": "Want to do some osint scanning on my companies ip-space but im having trouble finding exactly what kind of outputs recon-ng will give me or how practical it will be. What are some of the common whitehat uses?",
        "created_utc": 1521178406,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Science May graduate looking for a netsec job",
        "author": "RandalSavage",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84sbbq/computer_science_may_graduate_looking_for_a/",
        "text": "So my degree has an area of emphasis in cybersecurity, but im finding that a lot of infosec job postings that are junior or entry level are looking for skills that i dont have. I feel way under qualified for entry level IT jobs also. \n\nI initially wanted to be a software developer, but ive always been interested in security and im leaning pretty heavily towards it as a career now. I knew that my degree was going to be more academic concepts and software developing, but i didnt realize how far removed it was going to be from the skills for security. My area of emphasis comes from classes in networks, distributed systems, and cybersecurity.  Im currently taking the cyber security class and so far we have just been focused on hacking - buffer overflows and ROP.\n\nIm already working towards getting my security+ and then maybe CEH, although im undecided on that. Later on I definitely want my OSCP and CISSP, but i need to find a job to help me get the experience necessary.  I had an internship last summer but it was Java development. \n\nI dont think i can land an entry level analyst or engineer role, even internships are asking for more than what ive got. Im going to apply to those regardless, but what kinds of other jobs would help start me on a path where i want to be? Im also wondering how could i get the administration, analysis, and hardware knowledge that these companies want? I dont think i can land a system or network admin job either and i dont want to work towards a CCNA if im going for a security career, but if its absolutely necessary im willing to. ",
        "created_utc": 1521168595,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to detect a synflood attack using OSSIM",
        "author": "unm3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/84s73q/trying_to_detect_a_synflood_attack_using_ossim/",
        "text": "Good day,\n\nUsing VMWare, (3 VMs, kali, w2k12 and OSSIM) I am trying to detect a SYN flood attack using OSSIM (Alienvault). I am launching the DoS from Kali and directing it to a Windows 2012 server. I can see the NIC card reach 100% but I don't seem to get any logs in the SIEM from the attack IP to the victim IP. \n\n\nDo I have to install an agent on the Windows 2012 server?\n\nNotes: \n\n- I can ping between the VMs.\n\n- Fresh install of OSSIM, it seems to have detected the other machines on the network. but the real-time traffic doesn't show anything when I launch the flood.\n\nAny directions/tips are appreciated. Let me know if I should have ask this inside another subreddit.\n\nRegards",
        "created_utc": 1521167417,
        "upvote_ratio": ""
    }
]