[
    {
        "title": "Do enterprises implement IP based controls on VPN services?",
        "author": "bawlachora",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yqdjk0/do_enterprises_implement_ip_based_controls_on_vpn/",
        "text": "I want understand if it is fairly common practice in enterprise security where they implement IP based controls on VPN solutions to prevent incidents. Targeting and exploiting VPN products is a  theme within among adversaries, not just limited to vulnerability but also abuse of credentials.\n\nSo I just wondering if IP based controls can help? or practicle at all without impacting user access. Logically I sense whitelisting would be the way to go or do they use blocklisting IP address? In either case, since setup is for remote user and he can be anywhere, how do they go about implementing it? Do they use some advance engine that takes into account behavioural aspect, traffic patterns or IP reputation rather than simple listing out blocked/allowed IP address as in good old ACLs.",
        "created_utc": 1667985637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get hacked by clicking on a YouTube video?",
        "author": "Foreign-Magician-767",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yq5llt/can_i_get_hacked_by_clicking_on_a_youtube_video/",
        "text": "Not from any links, just straight through a youtube video on the site. I clicked on some YouTube video for a song I liked which was leaked from an artist I listen to. It turned out to be a fake channel with his name and profile picture. I'm kinda worried now. I get overly paranoid about this kinda stuff. There were about 15k other people who watched this video.",
        "created_utc": 1667959611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Static Code Analyzer for JAVA development: any recommendations ??",
        "author": "salgak",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yplkyd/static_code_analyzer_for_java_development_any/",
        "text": "Seeing the new Secure Software Development Framework, NIST SP-800-218, I see that static code analysis is now mandatory.\n\nAny recommendations out there ?  Checkmarx and Synk keep popping up in searches, but would like t hear from people who  have implemented and/or used Static Code Analysis, and specifically for JAVA Development environments. . . .",
        "created_utc": 1667912594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a job in cybersecurity with misdemeanors?",
        "author": "Ornery_Item_520",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ypbhki/getting_a_job_in_cybersecurity_with_misdemeanors/",
        "text": "hey all, \n\nI have my associates in CIS and was about to do my bachelors in Cybersecurity in the upcoming winter semester; specifically digital forensics but am open to other options. However, I have a couple misdemeanors on my record now; Retail Fraud 3rd degree (shoplifting), DUI, and Leaving the scene of a PI Accident (Hit &amp; Run). How realistic is it for me to successfully enter the field after graduation, if I choose to continue with this program; or should I consider another field of study. thanks in advance for the honest advice.\n\n&amp;#x200B;\n\nTLDR: Can I enter cybersecurity field with Shoplifting, DUI, and Hit and run on my criminal record??",
        "created_utc": 1667882904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help with setting up a cyber security discord, and review how it looks so far. Any feedback is greatly appreciated!! Thanks",
        "author": "Jazzlike_Heart_7184",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yp3cnf/can_anyone_help_with_setting_up_a_cyber_security/",
        "text": "https://discord.gg/92F9h788JG",
        "created_utc": 1667861185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Devs who had their work penetration-tested: what was the most surprising result or fact you heard/learned?",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yp3cga/devs_who_had_their_work_penetrationtested_what/",
        "text": " \n\nI was just curious about what your oddest or funniest or worst experiences were, what you learned or what surprised you the most.\n\nThats all folks :)",
        "created_utc": 1667861174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about DatAshur SD",
        "author": "mrmh1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yoxjxr/question_about_datashur_sd/",
        "text": "Quoting from their website:  *datAshur SD* is a PIN authenticated, hardware encrypted, USB Type-C flash drive designed to incorporate removable iStorage microSD Cards.   \nIt is FIPS 140-3 Level 3 certified which means it is tamper-proof.   \n\n\nSo my view is: tamper proof is only USB stick aka SD card reader, not SD card itself. Why would I hack into HW (USB stick)  when all valuable data is stored on SD card?  \nI can take SD card from that FIPS 140-3 Level 3 reader, insert it into a $10 SD reader and start brute forcing.   \nWhole other level are regular USB sticks with fixed memory chip. If they are FIPS 140-3 Level 3 certified that means you cannot remove the memory chip (which stores your data in encrypted form) without destroying the chip itself.\n\n&amp;#x200B;\n\nThe problem of losing SD card and its consequences are not explained at all. There's one comment on Youtube saying \"SD card should not be readable in other device\". How did they achieve it?",
        "created_utc": 1667849386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teach me something about telephony security!",
        "author": "DeMiNe00",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yos5i3/teach_me_something_about_telephony_security/",
        "text": "Over the past year, I have been working on a concept for an ECC(Emergency Communications Center aka a 911 Dispatch Center) focused security platform offering.\n\nI have been finding via outreach and research that cyber-attacks both on computer networks and CAD(Computer Aided Dispatch) telephony systems are becoming more and more prevalent.\n\nIt almost feels like every time I talk to an ECC director I hear a new story about some ransomware attack that brought the ECC back to operating on pen and paper or an ECC that experienced a telephony denial of service attack that caused all of their 911 trunks to ring at capacity(Effectivly knocking an entire 911 center out of action).\n\nOne of the things I love about my job is that solving these problems helps first responders save lives! So, help me help all of our first responders and public safety workers out there! \n\nTell me about what you guys know specifically about telephony based cyber-attacks. Things like telephony denial of service, spoofing and common ways to protect against those types of attacks. Tell me about your experiences with Telephony security in general! \n\nIf you work in Public Safety IT/Security; tell me about your experience with ANI/ALI and CAD security!",
        "created_utc": 1667838571,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Earn Money in Online without any invest, just download these apps, no refferal codes",
        "author": "Beautiful-Relief1004",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yoq1u6/how_to_earn_money_in_online_without_any_invest/",
        "text": "[removed]",
        "created_utc": 1667834371,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on automated pentest tools?",
        "author": "Hinata778",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yolk71/what_are_your_thoughts_on_automated_pentest_tools/",
        "text": "Our team is thinking of getting cloud best pentest tools. Such as Fortipentest? \nDo you think this can replace manual pentest? \nJust wanted to get some advice before we invest into this. Or just keep up with the traditional pentest? \nThanks.",
        "created_utc": 1667824554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Knowledge management systems for small teams",
        "author": "fishy-colinmclean",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yofxbe/knowledge_management_systems_for_small_teams/",
        "text": "I have a small pentesting team (&lt;10 people), which works great on a technical level, but we realized systematically storing knowledge and making it accessible for everyone is annoyingly hard.\n\nI'd love to keep it as simple as possible.\n\nI'm now trying out various tools. I've only heard good things of obsidian, notion and joplin.\n\nWhat tools do you recommend to structure, store and share knowledge?",
        "created_utc": 1667806338,
        "upvote_ratio": 1.0
    },
    {
        "title": "turning on bluetooth remotely of any person.see name of bluetooth which is hex in both pics.software generated hex name. any stalkers phone can be used to connect to your body implants emitting bluetooth signals. i have many more such evidence of bluetooth being turned on remotely .",
        "author": "shallotalternative1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yodrim/turning_on_bluetooth_remotely_of_any_personsee/",
        "text": "[removed]",
        "created_utc": 1667798886,
        "upvote_ratio": 1.0
    },
    {
        "title": "turning on bluetooth remotely of any person.see name of bluetooth which is hex in both pics.software generated hex name. any stalkers phone can be used to connect to your body implants emitting bluetooth signals. i have many more such evidence of bluetooth being turned on remotely .",
        "author": "shallotalternative1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yodny6/turning_on_bluetooth_remotely_of_any_personsee/",
        "text": "[removed]",
        "created_utc": 1667798557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Associate of (ISC)² - CISSP, worth it if my employer pays for it?",
        "author": "hey_its_meeee",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yo2gw5/associate_of_isc²_cissp_worth_it_if_my_employer/",
        "text": "Hi everyone,\n\nIn the coming months, my employer will require the CISSP certification for everyone on my team. Since a few, including me, haven't cumulated 5 years of experience, we will only have the mention of Associate of (ISC)². My employer will pays for the study material and exam.\n\nI am wondering how this certificate title will looks on my curriculum vitæ? I currently have AZ900, AZ500 and SC100 and around 3 years of relevant cybersecurity experience. Some people on Reddit thinks that it's not worth it and I have a hard time believing this.\n\nEdit : I need to add that this info is based on rumors circulating inside the team, but even if the upper management chose to not go ahead with this requirement, I want to earn the certificate anyway.",
        "created_utc": 1667768148,
        "upvote_ratio": 1.0
    },
    {
        "title": "TF-CSIRT TRANSITS Workshops",
        "author": "FreakySeahorse",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yo0ubk/tfcsirt_transits_workshops/",
        "text": "If you've ever attended any of the Trusted Introducer TRANSITS workshops, I'd love to ask about your opinion on them, if it was worth it, what it was like, if it was more hands-on with exercises, or more lecture-like. Thanks!",
        "created_utc": 1667764711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for master thesis on Cyber Security - Ethical Hacking?",
        "author": "electronixxx",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ynxjx0/ideas_for_master_thesis_on_cyber_security_ethical/",
        "text": "Hey all, I need to decide a topic in order to present to my professor for my master thesis. The problem is that I still have no idea what to be focused on, because I have some constraints. Since at the moment I'm an intern consultant for a cybersec company, and I'm doing penetration testing there, I should do the thesis with things related to vulnerability assessment and pentesting. I like cryptography as well and my idea was related to a development of a decentralized CA, but as I said I guess it's not part of the ethical hacking stuff. Any idea/suggestion before I talk with my professor?",
        "created_utc": 1667757880,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a huge company with *horrendous* password procedures. Is there anyone to report this to?",
        "author": "yrdz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/yn800g/i_found_a_huge_company_with_horrendous_password/",
        "text": "As I was signing up for an account on this company's website, I noticed the following:\n\n* Answers to security questions are stored in plaintext\n* The maximum character limit for passwords is 10\n* Only alphanumeric characters are accepted\n* Easily predictable name-based usernames are assigned to each user and are unchangeable\n\nIt's hard to overstate how big this company is within its field. Practically a monopoly. It's a more hidden part of the website, which is why I think it probably hasn't been updated in over a decade, but pretty much everyone who uses the site will have to create an account there at some point.\n\nThey seemingly have no dedicated webmaster or security person to contact. I will email their support, but I highly doubt this will lead them to redo their entire system.\n\nI know this isn't *technically* a security vulnerability, but it is pretty much the definition of a best practices violation. Is there any sort of organization or agency I should contact about this? And how much time should I give them before I disclose this to the public? There are a *huge* amount of people using this system with no idea their security is at risk.\n\nOh, and does the fact that there is a maximum password limit imply that they are storing the passwords in plaintext too? I looked it up and saw some people point out that properly stored passwords would probably be the same length in the database if they were hashed and salted.",
        "created_utc": 1667686385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Root password randomly stopped working, fixed after reboot",
        "author": "elcric_krej",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ymp9xm/root_password_randomly_stopped_working_fixed/",
        "text": "My root password randomly stopped working, or, at least, any `sudo` prefixed command did.\n\nI am 99.999% sure I was using the correct password, to the extent I typed it in a text file to make sure nothing came out the wrong way, tried sudo-ing 12+ times, typed very slowly, kill the terminal and started a new one twice, etc.\n\nI was *very* dumb and didn't try to just su into root (tried `sudo su` -- which failed due to password issues) *nor* did I try switching TTYs and seeing if the problem persisted there.\n\nI restarted the laptop and... everything back to normal.\n\nLooking at the logs using journals I can see my many failed attempts at sudoing, but no password changed.\n\nIs there any reason why this might happen? I see no reason why someone might get remote access to my system, and, even more so, why they'd change the root password in an impermanent way (or fail to change the harddrive encryption password) -- but I see little reason why successive logins would fail, other than a cosmic-radiation-bit-flip sort of thing, but I'm unsure if that probability of that is high enough. Are there any simpler explanation why this might have happened? Or things I should look out for to confirm a given theory?\n\nNote: I'm using Endeavor OS, it's an experiment but I used arch for 4+ years, so I assume I haven't done anything horribly wrong setting things up",
        "created_utc": 1667640919,
        "upvote_ratio": 1.0
    },
    {
        "title": "OverTheWire type resources to learn Google hacking",
        "author": "palm_snow",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ym96c7/overthewire_type_resources_to_learn_google_hacking/",
        "text": " I loved [OverTheWire WarGames](https://overthewire.org/wargames/) to learn Linux. I am wondering if there are any similar idea/site to learn google hacking?",
        "created_utc": 1667592982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Government/Country has the best Network Security/ Information security?",
        "author": "DeerInTheHerbGarden",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ym95yk/which_governmentcountry_has_the_best_network/",
        "text": "In this question I'm not talking about oh so and so government has this incredible encryption that required five peoples eyebrow hair to unlock type thing. \n\nI am more talking about the day to day stuff that doesn't make headlines but is just quietly acknowledged as actually quite good. \n\nFor a practical example the UK has a lot of fancy sounding achievements for their cybersecurity and likes to boast about how seriously they take it... but then in practice ministers are using WhatsApp to talk about important information and the NHS as well as other government sectors have regularly been crippled by cyber attacks. \n\nWhat government do you think actually takes their Network Security seriously and actually implements it effectively? Or if you can't think of one then just one where you've heard what its like and think \"Oh that's actually quite good\"",
        "created_utc": 1667592958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a way to find out where a gps tracker sends data to?",
        "author": "kappadoky",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ym5z1u/is_there_a_way_to_find_out_where_a_gps_tracker/",
        "text": "A friend of mine recently found a GPS tracker in his car. Is there a way to find out where its sending the data? It has a SIM card in it, so I assume its sending the location via mobile internet.",
        "created_utc": 1667585339,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some modern web security books?",
        "author": "pentesticals",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ylxrdl/what_are_some_modern_web_security_books/",
        "text": "The two best books I am aware of for web security are the \"The Tangled Web\" and \"The Web Application Hackers Handbook\" and while these are both fantastic books, they were both released in 2011, and while the majority of the content still applies, there have been many changes to both server and browser security mechanisms over the last decade which are not present. \n\nDo you know of any other great modern web security books I can add to my collection? Thanks!",
        "created_utc": 1667565008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creating an automated vulnerability alerting system from different sources.",
        "author": "tryingtoworkatm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ylx2cl/creating_an_automated_vulnerability_alerting/",
        "text": " Hello,\n\nI want to find a way to automate alerting for newly found vulnerabilities. We have scanners that will scan, but I want to implement another solution that will notify us every week from different sources like mitre, nvd, opencve, [cisa.gov](https://cisa.gov/), etc. searching with keywords for example: Ubuntu, windows 10, java, or some frameworks and libraries and their version.\n\nHow are big companies doing it or can you recommend how to approach the project? I'm confused, should I write a script or something or just use PowerAutomate with an dedicated email account.  Is there any preferred method or tools to do it with. How should I download the resources - RSS feed, API calls, XML-s, JSON?\n\nThanks!",
        "created_utc": 1667563075,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a way to find who's spamming website contactme??",
        "author": "handsupcacto",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ylshnj/is_there_a_way_to_find_whos_spamming_website/",
        "text": "Recently a friend has been getting disgusting messages through the contact me page on her website. Personal attacks, wishing death upon children, telling her to kill herself. All kinds of stuff. After going to the police and it still continuing is there a way to somehow find out who's doing it when they keep making new fake email addresses?? \n\nAny advice would be greatly appreciated as she is getting pretty shaken up about it",
        "created_utc": 1667549596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been DNS Hijacked at home",
        "author": "Tylar27",
        "url": "https://www.reddit.com/r/AskNetsec/comments/ylm51l/been_dns_hijacked_at_home/",
        "text": "Last night when I was playing PUBG, and I suddenly lost connection to the server. The weird thing is my Discord was working OK so I was still able to chat with friends (and we were joking the game hacker was ddos attacking me). Then I noticed my Internet access sign (Windows 10) shows no internet connection. This issue impacted the whole home's internet so I reset the router, but it didn't help. Meanwhile, strangely enough, even though there was \"no internet\", I can still use Google and browse Youtube, while some other apps are failing. I connected one laptop with Cable directly to the optical network terminal and it was the same. So the issue is on the ONT side rather than my router. Then I did Internet troubleshooting, it says \"the dns server isn't responding\". Followed some youtube videos sharing fix by changing IPv4 DNS server from automatically to preferred ones, which solved my problem. \n\nStill, I'm a bit worried about my cyber security. Contacted the isp and they said everything is normal on their end. Feels likely someone hacked my ONT. Also, I'm wondering why changing the DNS server from automatic in just one machine resolved the whole problem?",
        "created_utc": 1667528187,
        "upvote_ratio": 1.0
    },
    {
        "title": "blf parser?",
        "author": "j0rmz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k9tz8/blf_parser/",
        "text": "I'm trying to get the content of a Binary Logging Format file. Any recommendations?",
        "created_utc": 1538340295,
        "upvote_ratio": ""
    },
    {
        "title": "Container vulnerability scanning",
        "author": "stevenacreman",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k7sib/container_vulnerability_scanning/",
        "text": "My background is DevOps/SRE but more recently I've been getting interested in security. Specifically on Kubernetes, but some of it applies to containers in general.\n\nToday I spent the afternoon trying out lots of different container vulnerability scanning tools. Most of them free and open source.\n\nI was surprised to find that every tool I tested returned different results.\n\nMy question is: are most security scanning tools like this in term of unreliable results? I was expecting to see almost identical results as they all compare against the same CVE database.\n\nI guess container scanning is becoming more common in companies. It would be good to hear some feedback from people who have evaluated other scanning tools.\n\n[The work I did today is written up here](https://kubedex.com/container-scanning)",
        "created_utc": 1538325770,
        "upvote_ratio": ""
    },
    {
        "title": "Simple question.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k67yh/simple_question/",
        "text": "[deleted]",
        "created_utc": 1538312849,
        "upvote_ratio": ""
    },
    {
        "title": "Facebook “View As” exploited",
        "author": "riverclark",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k5343/facebook_view_as_exploited/",
        "text": "I’m sure everyone has heard that Facebook has announced they’ve had a security issue with the View as function that allowed attackers to gain access tokens for people’s profiles. Millions are affected. \n\nAnyone have any info on this? Ive been googling for awhile and can’t find a site that gets into the technobabble. Interested in how it worked. Facebook took the feature out so poking around in retrospect is obviously out of reach. ",
        "created_utc": 1538300433,
        "upvote_ratio": ""
    },
    {
        "title": "First VM to post from vulnhub",
        "author": "HEAD5HOTNZ",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k500f/first_vm_to_post_from_vulnhub/",
        "text": "Posted this on /r/vulnhub and got no replys.. Must be a dead sub.\n\nSo asking here\n\nHi guys.\n\nHave googled this question, but netted 0 useful information.\n\nWhat are the recommendations for the first VM to download?\n\nThanks in advance.",
        "created_utc": 1538299603,
        "upvote_ratio": ""
    },
    {
        "title": "For the people looking for reviews on the WiFi Hacking in the Cloud Video Course",
        "author": "i_rsX",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k4t01/for_the_people_looking_for_reviews_on_the_wifi/",
        "text": "So, I've setup this private forum for my students and recently posted the first (Introduction) video there and thought I should share a review since many people were asking for it the last time I talked about it [here](https://www.reddit.com/r/AskNetsec/comments/8pzhes/wifi_hacking_in_cloud_oscp_like_course_and_ctf/).\n\nHere is a screenshot of the review: [https://i.imgur.com/0UkoRoH.png](https://i.imgur.com/0UkoRoH.png)\n\n&amp;#x200B;\n\nand as u/haxxysz suggested earlier, I have also added subtitles for the ease of accessibility. Here is a screenshot of the lightboard that is being talked about in the review and subtitles along: [https://i.imgur.com/ho29hAr.png](https://i.imgur.com/ho29hAr.png)\n\n&amp;#x200B;\n\nI'll be adding the Introduction video with subtitles soon so that you can see what works best for you 4K or 1080p on 60 fps and check audio quality, accent as well. Please stay tuned. :)\n\n&amp;#x200B;\n\nHardeep Singh",
        "created_utc": 1538297059,
        "upvote_ratio": ""
    },
    {
        "title": "More info about netsec, programming, and certs",
        "author": "Cerphix",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k2wn3/more_info_about_netsec_programming_and_certs/",
        "text": "Hi r/AskNetsec, \n\nI currently work as a software developer and have two years experience under my belt with Java API, Python, C#, SQL, and C++. It seems to me it goes without saying that many developers have little to no experience when it comes to security (at least for what I’ve seen in the past two years). I’d like to take the ability to write software and use it to create security and more secure applications. I would also love to have an opportunity in working in the field directly involving defensive security. \n\nI have read and studied Network+, but have not yet taken the exam. If I skipped the Network+ exam and went straight to Security+ (obviously after studying) would companies still have interest? \n\nI understand that Security+ is the next step up and I am feeling somewhat impatient to start learning and applying my skills in the field. And if the Network+ is possible to be skipped without any impact it would definitely save me some money. \n\nIn addition to the above, if I applied to a cyber security job, will I benefit the knowledge of programming I currently have. I love using networking tools (have not dealt with many security tools) and I am always curious as to the code that creates these applications. I also do enjoy creating my own tools rather than using someone else’s if possible. \n\nI appreciate all the information I can get! ",
        "created_utc": 1538276478,
        "upvote_ratio": ""
    },
    {
        "title": "[MacOS] Running KnockKnock as sudo on Mojave produces odd terminal output",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k2kvj/macos_running_knockknock_as_sudo_on_mojave/",
        "text": "[deleted]",
        "created_utc": 1538273272,
        "upvote_ratio": ""
    },
    {
        "title": "[Noob] question about how my reddit bot could be abused",
        "author": "SwimmingLack",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k19hc/noob_question_about_how_my_reddit_bot_could_be/",
        "text": "Howdy y'all! I'm making a reddit bot that will hopefully be able to automatically process paypal payments. I'm using selenium and a custom transaction id system because I want to be able to receive payments via friends and family, which I believe paypal doesn't enable via their API.\n\nHere's the current model I have for verifying a payment:\n\n1. The bot pms a uniqe ID to the redditor\n2. The redditor pays the agreed upon amount to my paypal address and copies the ID I gave them into the notes section of their paypal transaction\n3. The bot searches for the ID and compares the notes section of each search result against the ID it gave to the redditor. Once it finds a match (and the price also matches), the transaction has been confirmed.\n\n[Here](https://pastebin.com/uDJNaxwU)'s the relevant code. I'm concerned this isn't secure, specifically at step 3. Say the bot gives a user the ID 567. If the user now sends a small transaction with \"567 random garbage\" in their notes section, their transaction will still come up in the search, and the bot will try to match \"567 random garbage\" against \"567\" on line 22. I'm not concerned about \"567 random garbage\", but I'm unfamiliar with security and suspect that this could be abused. I'd appreciate any advice, thank you!",
        "created_utc": 1538261103,
        "upvote_ratio": ""
    },
    {
        "title": "Best way to go about getting a job in the cybersecurity field with a computer science degree in Canada?",
        "author": "roboprogramming",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9k117d/best_way_to_go_about_getting_a_job_in_the/",
        "text": "I'm currently in grade 12, and will be going to university relatively soon. I'm planning on doing a computer science major at a good university that has coop. My main interest has always been cybersecurity. What's the best way to go about getting a job in this field in my circumstance? I was thinking about taking as many cybersecurity related electives as possible, try to aim for cybersecurity coops (I want diversity, so not all my coop terms will be in cybersecurity, if I get in, but some will be more software engineering related at tech firms). And then also getting cybersecurity related certificates (not sure which one's, so please let me know). ",
        "created_utc": 1538259109,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for eecommendations when LLMNR and NBTNS *can't be switched off a large Corpoarte Windows Domain.",
        "author": "onlyuseful",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jzxrr/looking_for_eecommendations_when_llmnr_and_nbtns/",
        "text": "After a recent pentest I found, as per usual, a simple way to retrieve passwords of users by responding to challenges requests in the usual manner on a Windows network using Responder.py \nAfter some deliberation and technical analysis the client decided that switching these protocols off is too much of a risk and requested suggestions for mitigation alternatives. \nLooking for your views, if this has come up before  during engagements what have you recommended?\n\nThoughts, \n\nConfigure a SIEM that monitors for DNS updates and flag anything that responds that isn't the firms DNS servers. (Not sure how well that would work in practice) guess it would be too late regardless.. \n\nAny advice greatly appreciated. \n\n\n",
        "created_utc": 1538250402,
        "upvote_ratio": ""
    },
    {
        "title": "How does one assess the size of a p2p botnet or find its c&amp;c?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jzs9c/how_does_one_assess_the_size_of_a_p2p_botnet_or/",
        "text": "[deleted]",
        "created_utc": 1538249181,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I learn more about the consulting side of pentesting?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jzjnz/where_can_i_learn_more_about_the_consulting_side/",
        "text": "[deleted]",
        "created_utc": 1538247332,
        "upvote_ratio": ""
    },
    {
        "title": "Does your ideal manager/supervisor have great tech skills, or being a fantastic leader/people person?",
        "author": "TerminusFox",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jxvmd/does_your_ideal_managersupervisor_have_great_tech/",
        "text": "Yes, yes, I know people say \"both\" but real world often doesn't operate on that.\n\nSo if you had to choose between a manager who's tech skills are mediocre on a *good* day (for a variety of reasons, had to deal with corporate bullshit, hasn't had enough time to keep their skills as sharp as they were in his/her younger career days), BUT their communication and leadership are genuinely exemplary and fantastic.\n\nor\n\nThe guy above you is a kind of dick or doesn't really know how to talk to people, BUT when it comes to the actual job, not only does he contribute, he does a good chunk of the heavy lifting because he's THAT more knowledgeable than the rest of you AND your coworkers. He's pretty much the reason why the team is successful. Maybe not \"carrying\" in a sense, BUT if he left, you all would be feeling his loss damn near immediately. ",
        "created_utc": 1538235677,
        "upvote_ratio": ""
    },
    {
        "title": "Monitoring the Office 365 Audit Log?",
        "author": "danpage617",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jwuz9/monitoring_the_office_365_audit_log/",
        "text": "Anyone here doing any sort of active security monitoring for the audit log in Office 365? Or is it mostly useful for generating reports and doing... audits.\n\n\nI work at an MSSP and we just started supporting the API integration into our SIEM. Boss wants to generate alerts for events coming from O365, but I really don't see anything useful from a general viewpoint. We don't have enough insight into our customer environments to know what is/isn't normal behavior, so things like 'Non-admin User X is doing things that require admin privileges' aren't feasible.",
        "created_utc": 1538228896,
        "upvote_ratio": ""
    },
    {
        "title": "CYBERSEC Career Path/ No Experiance/ Guidance",
        "author": "Saeling_Song",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jvgsr/cybersec_career_path_no_experiance_guidance/",
        "text": "Hi Guys\n\nIm 24\n\nAll my prior work experience is in the hospitality industry\n\nEverything from tourism to waiter, to barman ( 5 Years more or less )\n\nI have very strong communication skills from these 5 years working with customers\n\n&amp;#x200B;\n\nMoving on\n\nI  have prepared and studied for N+ Server+, Linux +, Security +, CCNA  R&amp;S Through this year ( Took a year morning to evening studies) as  well as learning the language python this year, I will be picking up  other languages according to what I need to learn as the years go  forward\n\nI believe this should be a very strong base to start off with\n\nI  have used a Cisco home lab kit to practice as well as i have documented  how i set things up, how i did things and how i have solved my problems\n\nSo for this year I'm sorted\n\n2019\n\nIs comptia cloud worth my time?\n\nNext year - following certs I want to get 2019\n\nOffensive Security PWK\n\nRed Hat CSA\n\nCCNA Security\n\nThen at the end of they year - RHCE and Maybe OSCP\n\nFrom the following year 2020\n\nThis is where it gets tricky\n\n1  year experience in work at this point I'm looking to find the most  junior position and hopefully a company that will hire me as a pen  tester,\n\nIn this year\n\nI also wish to do the following certs\n\nCCNA Security\n\nCCNA Cloud\n\nand 2 of the RHCE course that lead towards RHCA\n\nand maybe slide in VMWARE\n\nIn 2021\n\nI wish to do my last 3 RHCE courses to write my RHCA Cloud at the end of the year with a focus on cloud\n\nin 2022\n\nCloud - AWS\n\nMCSA - 2016, CLoud, Linux on azure\n\nMCSE - Cloud , Maybe MSCE mobility\n\nAWS architect\n\nGoogle Cloud Architect\n\nIn 2023\n\nI wish to do my GCUX\n\nSANS  GPYC - I wish to focus on python mainly through out these years as I  have also picked up an interest in robotics and making robots for fun  with lego\n\nin 2024\n\nI wish to my big one CISSP\n\nPlease note I wish to funnel in cash throughout the years into a massive flat lab that I can study and learn all these things\n\nI  do not  plan to buy a house till i'm in  my late 30s as I wish to  financially secure myself first and renting a flat is the most frugal  option till then\n\nMy main focus though is to work in this time period as a Pen Tester and do the non security certifications in my spare time\n\nI understand this may appear to be a collect a cert way\n\nFor  me personally I'm viewing them as milestones on having the BASE  understanding obviously further education and training is needed aswell  as constant learning and education as this field goes\n\nThis is my 5 - 6 year goal path\n\n&amp;#x200B;\n\nThank you for taking your time to read the following\n\nany advice that can be given will be appreciated",
        "created_utc": 1538216512,
        "upvote_ratio": ""
    },
    {
        "title": "MY DB IS FUCKED BY FUCKING HACKER",
        "author": "kiyeopyang",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jvbnk/my_db_is_fucked_by_fucking_hacker/",
        "text": "One day, one of my customer said \"service is not working\" and I found server db is fucked by fucking hacker.\n\nOnly one document data was remained and it contained a letter from him.\n\n\"your db data is in my server, if you pay me 0.2 BTC and i'll return it to you. my email is [backupsql@protonmail.com](mailto:backupsql@protonmail.com)\"\n\nI didn't have other choices because of the importance of data for my customer and I sent money to him.\n\n0.2 BTC is not much expensive and I think that's because of the small data size.\n\nbut the saved data was very much important.\n\nIt has been 2 days from when I paid to him.\n\nbut I don't have any response from him yet.\n\nfuck.\n\n&amp;#x200B;\n\nIs there anyone fucked by [backupsql@protonmail.com](mailto:backupsql@protonmail.com) here??",
        "created_utc": 1538214522,
        "upvote_ratio": ""
    },
    {
        "title": "Podcast tips?",
        "author": "devzeroo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jsaxw/podcast_tips/",
        "text": "I listen to darknet diaries, do u guys know any other God security podcast?",
        "created_utc": 1538180841,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to receive hands on SOC training for couple of days or weeks",
        "author": "toptryps",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jrfgm/is_it_possible_to_receive_hands_on_soc_training/",
        "text": "Lately I have noticed that I could use a bit of refresher, hands on training in a SOC so as to (re)/familiarize myself with some old/ new technologies and techniques and may be learn something new. \n\nI am specifically looking to get hands on training on \n\nIPS/IDS, Palo Alto Firewalls, Q radar, Sailpoint, deep packet analysis and may be malware analysis etc. \n\nThe question is how do I go about it?\n\nIdeally, I would love to actually sit down in a SOC, observe, may be try my hands a bit and then practice at home later on. I won't even mind paying for it but doubt if anyone would even let me in. \n\nAlternatively I can learn remotely from someone who has a solid lab setup with some of the above components and pay him for his time and access. \n\nWhat do you guys suggest?   \n\n  ",
        "created_utc": 1538173350,
        "upvote_ratio": ""
    },
    {
        "title": "Can somebody please tell me which of these academic programs for Information Security looks better judging by the list of courses offered? It would really be a huge help.",
        "author": "Dmitri_P_KaramazovII",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jrdfv/can_somebody_please_tell_me_which_of_these/",
        "text": "I am deciding between two schools to study Information Security at this January. One is a 4-year bachelors degree program and the other is a 3-year advanced diploma. Despite the extra year, about 10 of the additional courses in the 4-year program are electives so both programs cover about the same number of subject-related courses. I know the degree seems like a better option than the diploma all else being equal, but I'm wondering which of these looks most comprehensive based on just the courses offered? Both have 3 co-op work terms.\n\n**School A:**\n\n* Systems Loss Prevention Methodologies\n* Intro to Programming\n* Computer Math 1\n* Intro to Communication Networks\n* Intro to Unix Operating Systems\n* Composition and Rhetoric\n* Security Threats and Risk Assessment\n* Object-Oriented Programming 1\n* Computer Math 2\n* Structured Database Modelling\n* Object-Oriented Programming 2\n* Statistical Methods\n* Algorithm Development and Data Structures\n* Database Implementations and Management\n* Information Systems Forensics and Investigation\n* Multi-Tier Programming\n* CPU Architecture &amp; Assembly Programming Language\n* Internetworking\n* Adv. Info. Systems Forensics &amp; Elec. Discovery\n* Software Engineering\n* Network &amp; Distributed Systems Security\n* Operating Systems Design &amp; UNIX Systems Prog.\n* Database Security\n* Intro to Cryptology\n* Secure Software Development\n* Information Systems Security Auditing\n* Information Age Ethics\n* Information Systems Intrusion Detection &amp; Prevention\n* Malicious Code: Design and Defense\n* Advanced Cryptology\n* Wireless Security\n* ISS Graduation Project (Phase 1)\n* Computer Security\n* Advanced Topics in Information Security\n* ISS Graduation Project (Phase 2)\n* Ethical Hacking\n\n\n**School B:**\n\n* Operating Syst Fundamentals for Security\n* Networking Fundamentals for Security\n* Programming Fundamentals for Security\n* Database Fundamentals for Security\n* Ethics\n* Cyber Security\n* Cybercrime\n* Network Components\n* PHP Fundamentals\n* Cryptography &amp; Authentication Systems\n* Securing Linux\n* Securing Windows Systems\n* Communications for IT\n* Network Protocols\n* Scripting for Security\n* Web Security 1\n* Security Mechanisms\n* Auditing &amp; Security Controls\n* Security Management\n* Technical Writing &amp; Presentation\n* Criminology\n* Wireless &amp; Mobile\n* Network Monitoring\n* Evolving Technologies &amp; Threats\n* Computational Intelligence for Security\n* Web Security 2\n* Digital &amp; Network Forensics\n* Perimeter Defence &amp; Design\n* Attack Vectors &amp; Analysis\n* Incidence Handling &amp; Response\n* Penetration Testing\n* Network Security\n* Research Project &amp; Entrepreneurship\n* Secure Network Architecture\n* Hacking Techniques &amp; Exploits\n* Penetration Testing - Advanced\n* Malware Analysis &amp; Response",
        "created_utc": 1538172910,
        "upvote_ratio": ""
    },
    {
        "title": "Device that provides turnkey VPN access to a home's ISP network?",
        "author": "quinncom",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jr1si/device_that_provides_turnkey_vpn_access_to_a/",
        "text": "I need help finding a device I can plug into my home network that provides remote VPN access, allowing me to use my home's residential IP address while I'm traveling abroad. \n\nMy bank's website refuses connections from non-USA and cloud-provider IP addresses. Normally, I connect to an Algo VPN on a DigitalOcean server when I travel, but my bank also rejects connections from there. I must connect from a \"residential\" US IP address. Using a VPN-enabled device installed at home seems like the easiest way to achieve this (if anyone has an alternative suggestion, please do say). \n\nIdeally, I would plug in a small, cheap device that runs Algo's IKEv2 setup, but anything that will work with macOS and iOS and isn't shit would be fine. I don't want to have a full computer running all the time at home. Hopefully, someone here can recommend a cheap device I can buy online and configure in a few minutes (I.e., I don't want to spend hours installing and configuring OpenWRT on a router; turnkey is the key). Thanks!",
        "created_utc": 1538170412,
        "upvote_ratio": ""
    },
    {
        "title": "Cipher Suite Best Practices",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jpugt/cipher_suite_best_practices/",
        "text": "[deleted]",
        "created_utc": 1538161855,
        "upvote_ratio": ""
    },
    {
        "title": "Automatic call to Venezuela from my Mercedes?",
        "author": "stixix",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jpqkg/automatic_call_to_venezuela_from_my_mercedes/",
        "text": "Hi All. Today something strange happened. My iPhone 6s was in my bag in my car. It was connected to my car (Mercedes 2018 E class, W213). Out of the blue, it dialed a strange number (+58 368782725) in Venezuela. No hits on google, no incoming calls from that number. \nI believe either my phone or the car has been compromised.\n\nMy question: How can  I find out if it was the car or the phone who dialed the number?",
        "created_utc": 1538161092,
        "upvote_ratio": ""
    },
    {
        "title": "What actions did you take to restore privacy on google products?",
        "author": "TrentBinc",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jolt8/what_actions_did_you_take_to_restore_privacy_on/",
        "text": "So currently im in the pickle of:  \nA) studying a bachelors in cyber security, reading up and realizing how bad google is for privacy\n\nand\n\nB) Pretty much relying on googles services, I love gmail, I love chrome, I love google drive, calander, keep, maps..... the list goes on.\n\n&amp;#x200B;\n\nIs there any way at all I can disabled their tracking within these programs or do I just need to take the painful leap off of these programs/utilities? What did you do?",
        "created_utc": 1538153204,
        "upvote_ratio": ""
    },
    {
        "title": "Is contacting hacked companies/orgs a bad idea?",
        "author": "searchcandy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jogb9/is_contacting_hacked_companiesorgs_a_bad_idea/",
        "text": "Hey Guys,\n\nI am not a professional netsec person, though I am good with search engines and SEO.\n\nFor the last 6-7 years on and off I have used my search skills to find and contact around 100-200 companies and organisations in the UK (where I am from) who have had their website hacked.\n\nLast night I picked it up again, contacted around 10 sites, a mix of schools, an NHS site, companies, and even a big official organisation that hands out film classifications.\n\nThe 30% or so of people that have replied so far have generally been appreciative.\n\nI wondered though however - do you think what I am doing carries a significant risk, in that one day a site owner could take it the wrong way and accuse me of being the hacker or similar?\n\nOther than wording my emails very carefully, is there anything you guys think I absolutely should or should not be doing to cover my back?\n\nThanks in advance for any answers.",
        "created_utc": 1538152135,
        "upvote_ratio": ""
    },
    {
        "title": "School me in Client Certificates, SSL, and Web Server protection",
        "author": "mactalker",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jo8p3/school_me_in_client_certificates_ssl_and_web/",
        "text": "Can someone please assist regarding my understanding Client Certificates? Let's say you have a publicly exposed IIS server and it has the usual protections: SSL, Firewall, IDS/IPS, WAF, Logging, etc.\n\n1) What is the best way to protect someone unauthorized from even accessing the port 443 web layer (below SSL) to try and enumerate or exploit the server?\n\n2) If you use client certificates for authentication, can you block a malicious actor from hacking anything beyond the SSL handshake protocol? I think I am confused because maybe there are multiple implementations of client side certs, one where you can reach the login page and need the cert when sending username and password vs. completely blocking attempts before serving any login page.\n\n3) If you do use client certs, they should be issued by an internal server correct? General client certs issued from a publicly trusted CA would provide too broad access to any other customers that signed certs with that same root. Or are there managed PKI solutions where they create a Root CA in your name and sign certificates with it?\n\n4) If not, is there another way to do this without White listing IP addresses or using VPN? Maybe using a proxy server which requires client certificates before allowing a connection to servers behind a load balancer? Zscaler?\n\nThanks! =_=",
        "created_utc": 1538150656,
        "upvote_ratio": ""
    },
    {
        "title": "I want a career in cyber security and I have questions...",
        "author": "AspiringRedTeam",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jo2c4/i_want_a_career_in_cyber_security_and_i_have/",
        "text": "Here is my background - I am 34 years old, I retired from the military when I was 26 due to wounds sustained in Afghanistan. I have full retirement benefits, so I am not doing this specifically for money. I plan on getting my Network+ certification as a first step, but I am unsure of where I want to go after that. I like computer programming/development and I also like web design. I'm open to all ideas, if you all could make some recommendations it would be much appreciated. Thank you in advance. ",
        "created_utc": 1538149424,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any website other than youtube that uploads hacking videos?",
        "author": "PabloSkywalk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jnwon/is_there_any_website_other_than_youtube_that/",
        "text": "So recently YouTube is banning some of the channels that were uploading hacking videos for violation of its rules even tho they mentioned at the beginning that these are for educational purposes only\n\n\nso is there any replacement for YouTube for these kind of videos **that does not have to follow these kind of rules?** like maybe a Russian based website or something? ",
        "created_utc": 1538148346,
        "upvote_ratio": ""
    },
    {
        "title": "Are there resources to help write a siem or ids?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jnssw/are_there_resources_to_help_write_a_siem_or_ids/",
        "text": "[deleted]",
        "created_utc": 1538147572,
        "upvote_ratio": ""
    },
    {
        "title": "Over the wire bandit level 20, help!",
        "author": "not-an-exp3rt",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jnq3m/over_the_wire_bandit_level_20_help/",
        "text": "Is anyone else able to login and complete this level ? My understanding is that it is teaching you how to have multiple separate terminal sessions running at the same time and to complete the task you need to connect a port and submit the password for level 20 and in another session you need to listen on the same port where the password for the next level will be sent if the password you sent matches. The walkthroughs I have checked seem to be getting the password on different ports and when i do a port scan the ports used by the walkthroughs do not come up ?!?! What am I missing? ",
        "created_utc": 1538147049,
        "upvote_ratio": ""
    },
    {
        "title": "Caldera In Practice",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jnofp/caldera_in_practice/",
        "text": "I just setup Caldera in my test lab.  I am wondering how prevalent this tool is in the real world.  If so, are they are good tutorials online?  I couldn't get the \"easy\" Docker deployment to work so I and to build it by scratch.",
        "created_utc": 1538146711,
        "upvote_ratio": ""
    },
    {
        "title": "haveIbeenPwned - looking for a specific dump",
        "author": "rogueit",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jn9fo/haveibeenpwned_looking_for_a_specific_dump/",
        "text": "Does anyone know of a way to search which dumps contained a specific password and/or email address.\n\nIf my email address was rogueit@reddit.com and that email address shows up on haveibeenpwned, can i find which dump \ncontained my email address\n\nThanks,",
        "created_utc": 1538143708,
        "upvote_ratio": ""
    },
    {
        "title": "\"All\" my log in sessions suddenly expired",
        "author": "velourtube",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jlzkx/all_my_log_in_sessions_suddenly_expired/",
        "text": "Today, I had to re-login to Apple ID, Facebook, Outlook365, and a few other services, both on my phone and my PC. Should I be worried and change my passwords, or is this just a random thing that happens because of glitchy time servers or whatever?",
        "created_utc": 1538132456,
        "upvote_ratio": ""
    },
    {
        "title": "Noob asking questiion's for the first time",
        "author": "robowoohoo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jk2fl/noob_asking_questiions_for_the_first_time/",
        "text": "Greetings\n\n&amp;#x200B;\n\nSo this would be a two part question one to critique my desired education path and second with lack of a better phrase be about if anyone has any side 'hustles' ? besides working full time in infosec.\n\n&amp;#x200B;\n\nSo my desired educational path is to take a 3 year cyber security diploma and become more fluent in python and ruby, also get certificates in CompTIA network+, Security+, CySA+, Pentest+ as well as offensive security OSWP and OSCP well still in school with a career goal of Red teaming/ PenTester after a few years of possibly network admin or SOC. Are these good certificates and languages to learn?\n\n&amp;#x200B;\n\nand my second part question does any one in the industry have any sort of side hustles unrelated to infosec?  is that unheard of in the industry? the reason why I ask is because I'd also like to get into commercial/Industrial real estate. The plan is to work a 9-5 in infosec and then 5-9 in commercial real estate. or would the money for the real estate courses be better served by putting it into a mobile workstation? \n\n&amp;#x200B;\n\nThanks in advance for the response or criticism",
        "created_utc": 1538110311,
        "upvote_ratio": ""
    },
    {
        "title": "Career path for ethical hacker?",
        "author": "iceJJfesh",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jidpc/career_path_for_ethical_hacker/",
        "text": "Hey, I'm curious what the career path to an ethical hacker would be for someone with no GED or high school diploma. I have a passion for cyber security and will get all the certifications required but I'm not sure what a entry level job would be?",
        "created_utc": 1538095308,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding TEMPEST and other types of unintentional airgapped data exfiltration, how (in)secure are the various Raspberry Pi models?",
        "author": "TiagoTiagoT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jhigz/regarding_tempest_and_other_types_of/",
        "text": "",
        "created_utc": 1538088271,
        "upvote_ratio": ""
    },
    {
        "title": "How to batch enumerate domain names",
        "author": "ericnyamu",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jgp2a/how_to_batch_enumerate_domain_names/",
        "text": "hi ,\n\nDoes anybody here know how to combine gnu parallel with gobuster? or how to you guys dns enumerate a list of domain names ?",
        "created_utc": 1538082222,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with school exercise",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jgmgf/need_help_with_school_exercise/",
        "text": "[deleted]",
        "created_utc": 1538081710,
        "upvote_ratio": ""
    },
    {
        "title": "Coming from Web Development / Cloud...SOC Analyst?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jgctl/coming_from_web_development_cloudsoc_analyst/",
        "text": "[deleted]",
        "created_utc": 1538079771,
        "upvote_ratio": ""
    },
    {
        "title": "Enterprise SSO Options?",
        "author": "Javathemut",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jg8ru/enterprise_sso_options/",
        "text": "Looking to implement SSO in an enterprise with everything on-prem. Any reason to go with a COTS IdP rather than ADFS? We will be integrating with smartcard TFA if that makes a difference. Looking for a full SSO experience once the user authenticates to a workstation.",
        "created_utc": 1538078979,
        "upvote_ratio": ""
    },
    {
        "title": "Personal pen test lab",
        "author": "brc55",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jg70j/personal_pen_test_lab/",
        "text": "Hello all,\n\nHas anyone set up their own lab for pen testing purposes? I want to set up my own at home to practice on. If via VM, would like some direction as to how to create a vulnerable box. I’m fairly new into info sec and have been on a pen test project for work as well as other different info sec projects. \n\nWould appreciate any insight and/or articles or websites that discuss setting up a lab. \n\nThanks!\n",
        "created_utc": 1538078631,
        "upvote_ratio": ""
    },
    {
        "title": "Sourcefire question",
        "author": "akairyuryu",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jfmcn/sourcefire_question/",
        "text": "I am getting SFR requested ASA to bypass further packet redirection. What does that mean and is that normal?",
        "created_utc": 1538074567,
        "upvote_ratio": ""
    },
    {
        "title": "Why EIP address change on 2nd times I press \"g\" on windbg?",
        "author": "r__al",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jflk7/why_eip_address_change_on_2nd_times_i_press_g_on/",
        "text": "&gt; 0:000&gt; g\n(7d0.ee0): Access violation - code c0000005 (first chance)\nFirst chance exceptions are reported before any exception handling.\nThis exception may be expected and handled.\neax=0012fe60 ebx=7ffdb000 ecx=005726d0 edx=baadf000 esi=00000000 edi=00000000\n**eip=37694136** esp=0012ff68 ebp=69413569 iopl=0         nv up ei pl nz ac pe nc\ncs=001b  ss=0023  ds=0023  es=0023  fs=003b  gs=0000             efl=00010216\n**37694136** ??              ???\n\n\n&gt; 0:000&gt; g\n(7d0.ee0): Access violation - code c0000005 (first chance)\nFirst chance exceptions are reported before any exception handling.\nThis exception may be expected and handled.\neax=00000000 ebx=00000000 ecx=41306d41 edx=77f071cd esi=00000000 edi=00000000\n**eip=41306d41** esp=0012fa18 ebp=0012fa38 iopl=0         nv up ei pl zr na pe nc\ncs=001b  ss=0023  ds=0023  es=0023  fs=003b  gs=0000             efl=00010246\n**41306d41 ??**              ???\n\nWhy this is happen? I disable DEP and ASLR / Win-7.",
        "created_utc": 1538074406,
        "upvote_ratio": ""
    },
    {
        "title": "Referred to Hiring Manager.",
        "author": "Iamth0r92",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jf1wp/referred_to_hiring_manager/",
        "text": "I applied for an IT Specialist (Infosec) for a DoD agency. I got referred to the hiring manager to 3 different locations I chose. Since the job listing stated it was direct hire, I’m assuming they’re hurting for people because they listed 10+ locations.\n\nHow long is the turnaround after you’ve been referred? \n\nShould I get my hopes up?",
        "created_utc": 1538070597,
        "upvote_ratio": ""
    },
    {
        "title": "Enterprise USB Drive Blocking and Encryption Software",
        "author": "chriscrowder",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jew5m/enterprise_usb_drive_blocking_and_encryption/",
        "text": "I've been tasked with researching some USB encryption and drive software.   Basically, we want to allow only approved USB drives, and have the data encrypted in case they're lost or stolen.  Do you guys have any recommendations on software that does this?  Thanks in advance!",
        "created_utc": 1538069476,
        "upvote_ratio": ""
    },
    {
        "title": "Can I write a siem in ruby?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jeqmz/can_i_write_a_siem_in_ruby/",
        "text": "[deleted]",
        "created_utc": 1538068418,
        "upvote_ratio": ""
    },
    {
        "title": "Alternnative wireless protocols?",
        "author": "user01110",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jee04/alternnative_wireless_protocols/",
        "text": "What other wireless protocols exist to send data between devices, besides Bluetooth and Wi-Fi?\n\nHobbyist question, rather than practical.",
        "created_utc": 1538066007,
        "upvote_ratio": ""
    },
    {
        "title": "Are all the NSA tools which were leaked by shadow brokers included in the latest version of Kali Linux?",
        "author": "PabloSkywalk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9je6cy/are_all_the_nsa_tools_which_were_leaked_by_shadow/",
        "text": "So are they all included in the latest version of Kali? if not, is there any safe website that uploaded them? \n\nand if some of them are included and some are not, which ones are missing and why? ",
        "created_utc": 1538064474,
        "upvote_ratio": ""
    },
    {
        "title": "A password manager with two features: local sync and multi-platform (at least Windows, Linux and iOS)",
        "author": "nar2k16",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jdudb/a_password_manager_with_two_features_local_sync/",
        "text": "Hi folks, I'm currently looking for a password manager with the two mentioned features. I'd like to be able to sync my passwords locally -  through a file that I need to transfer or whatever - between my Windows, Linux, and iOS machines. Does that exist? KeePass looked promising but has no iOS official app. Could I do that with Bitwarden? Something else? I don't mind paying if I have to. Thanks!",
        "created_utc": 1538062167,
        "upvote_ratio": ""
    },
    {
        "title": "Everyday life and technology.",
        "author": "Twinboi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jcy7d/everyday_life_and_technology/",
        "text": " \n\nI've never been good at asking questions, so bear with me. I tried to find a previous question of this, but couldn't. If there is, feel free to link me.\n\nI just wanted some opinions. I had a conversation with a coworker in which I said I hated Amazon Echo devices because it seems like a government surveillance system. He said \"well you carry a phone, right?.\" Now, I'm in college for a netsec degree, but it's nothing crazy. I like the pen-testing aspects and analyzing packets and such, but I never stopped to ask small questions. I'm not going to pretend that I'm intelligent, I still don't know how a lot of stuff works. But I carry a phone with me everyday, and so does everyone else. How does the netsec community feel about this? Has there been proof of information being sent to governments? What can be done to prevent such things, other than smashing my phone? Should we be okay with giving up privacy for such conveniences? This may be a loaded question, and I don't know if it's silly for this subreddit, but still. It's on my mind either way.",
        "created_utc": 1538055531,
        "upvote_ratio": ""
    },
    {
        "title": "Is fofa.so just a web front of shodan's data?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jciil/is_fofaso_just_a_web_front_of_shodans_data/",
        "text": "*tl;dr* What is fofa.so?",
        "created_utc": 1538052025,
        "upvote_ratio": ""
    },
    {
        "title": "Rapid7 InsightVM",
        "author": "toastedcheesecake",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9jatpj/rapid7_insightvm/",
        "text": "Does anyone use InsightVM? What are your thoughts on this product? Things you like, things you don't? ",
        "created_utc": 1538033902,
        "upvote_ratio": ""
    },
    {
        "title": "Classes and/or Conferences for OSINT / NetSec Beginner (NYC)",
        "author": "heyron_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j9uwb/classes_andor_conferences_for_osint_netsec/",
        "text": "I'm a frontend dev with a bit of python experience, basic knowledge of networking, shell, etc.. who is looking to focus my efforts and growth in the NetSec and OSINT areas. I'm curious what resources you all might recommend in the way of classes/conferences/online resources (paid and unpaid are cool) to get increase my exposure and investigate getting started in these fields.\n\nIm very interested in press freedom, journalism and govt accountability and feel OSINT would be more of a professional line of work I’d  be interested in over becoming super focused in netsec",
        "created_utc": 1538023249,
        "upvote_ratio": ""
    },
    {
        "title": "AttackDefense is giving free online lab accounts this week",
        "author": "goluregolu",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j9f2n/attackdefense_is_giving_free_online_lab_accounts/",
        "text": "https://twitter.com/SecurityTube/status/1044808775994159104",
        "created_utc": 1538019038,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite Burp Suite extensions?",
        "author": "michael1026",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j8xkc/what_are_your_favorite_burp_suite_extensions/",
        "text": "I'm particularly looking for passive add-ons since I rarely use the active scanner, but I'm curious to here what extensions you guys like using. ",
        "created_utc": 1538014871,
        "upvote_ratio": ""
    },
    {
        "title": "What position is a “log monkey”?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j863i/what_position_is_a_log_monkey/",
        "text": "[deleted]",
        "created_utc": 1538008487,
        "upvote_ratio": ""
    },
    {
        "title": "New Apartment Public Wifi",
        "author": "1x3x8x0",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j764v/new_apartment_public_wifi/",
        "text": "I recently moved into an apartment complex with free complex-wide internet.\nThis includes Ethernet cables installed in each apartment.\n\nI was wondering what potential vulnerabilities this may have and in what ways people may use this maliciously.\n\nThe next obvious question is, how can I make my usage as secure as possible?\n\nThanks",
        "created_utc": 1538000440,
        "upvote_ratio": ""
    },
    {
        "title": "After how much time/experience did you get your first $500 or $1000 bounty reward on Hackerone?",
        "author": "OlivierDeCarglass",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j6i28/after_how_much_timeexperience_did_you_get_your/",
        "text": "Currently learning on my own with several ebooks and websites but it's all kind of overwhelming... so many things to look for and test, I feel like I'm never gonna make it :/",
        "created_utc": 1537995668,
        "upvote_ratio": ""
    },
    {
        "title": "Certifications &gt; High School Diploma for red teaming?",
        "author": "mefori",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j5t6t/certifications_high_school_diploma_for_red_teaming/",
        "text": "Im thinking about dropping out and getting my oscp, certified penetration tester, ceh, and a couple of business degrees before i turn 18. I am continuously seeing more and more reasons to drop out and get what i need. Personally i dont enjoy my life right now, feels like groundhog day. Before dropping out i wanted a second opinion from you guys. I know it may be a bit more difficult to get a job without it but I've been doing this since i was 10 and im pissed that i cant live and breath this. Please help OPs. \nThanks ahead of time. ~mef ",
        "created_utc": 1537990962,
        "upvote_ratio": ""
    },
    {
        "title": "Configuration Auditing Tools",
        "author": "moment84222",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j5nt7/configuration_auditing_tools/",
        "text": "I am evaluating tools for configuration management audits (user, group, and machine entitlements and security settings). Something along the lines of Symantec CCS Standards Manager. I believe Nessus can handle this type of scanning/reporting as well. Does anyone know of any good alternatives?",
        "created_utc": 1537989983,
        "upvote_ratio": ""
    },
    {
        "title": "How are phone number spoofed?",
        "author": "voxmeus",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j4qge/how_are_phone_number_spoofed/",
        "text": "Everyone I know is getting called by spoofed local numbers. How can I do this too? ",
        "created_utc": 1537983769,
        "upvote_ratio": ""
    },
    {
        "title": "Aspiring ethical hacker, a few questions...",
        "author": "zylophom",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9j2d06/aspiring_ethical_hacker_a_few_questions/",
        "text": "Hey, thank you for reading and I’m sorry but this post will be long..\n\nI’m 27, and have been a huge tech person my entire life. I started getting interesting in hacking very young, and two years ago I dived head first into udemy, took some classes and made my own lab!\n\nFast forward, I’m still learning but I’m wondering a few things...\n\nWould CEH be a good place to start for a certs followed by OSCP? I took a CEH practice test and scored a 72% based on what I’ve taught myself. (I know that’s not minimum but I feel it’s decent considering). \n\nHow does one get started in earning a position at a company or freelancing once a certificate is gained? \n\nWhy is it so hard to find a mentor in this field?! \n\nThank you for reading, I appreciate your time ",
        "created_utc": 1537967498,
        "upvote_ratio": ""
    },
    {
        "title": "Tails USB versus Tails VM?",
        "author": "exempt1993",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9iz5m0/tails_usb_versus_tails_vm/",
        "text": "Pros, cons, general comparison I guess\n\nCheers all",
        "created_utc": 1537934295,
        "upvote_ratio": ""
    },
    {
        "title": "Who made the new XXXTentacion and LilPeep track \"Falling Down\"?",
        "author": "JoseRubenV",
        "url": "https://www.reddit.com/user/JoseRubenV/comments/9ixr81/who_made_the_new_xxxtentacion_and_lilpeep_track/",
        "text": "",
        "created_utc": 1537926202,
        "upvote_ratio": ""
    },
    {
        "title": "Net sec programming job titles?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9ixr2j/net_sec_programming_job_titles/",
        "text": "[deleted]",
        "created_utc": 1537922440,
        "upvote_ratio": ""
    },
    {
        "title": "net sec programming jobs",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9ixg31/net_sec_programming_jobs/",
        "text": "[deleted]",
        "created_utc": 1537919931,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else think setting up virtual labs is a pain?",
        "author": "stillLearningNetsec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9ixdnk/anyone_else_think_setting_up_virtual_labs_is_a/",
        "text": "I know there are a lot of vagrant/docker setups that try to take care of most of the config. But sometimes I seem to go down a rabbit hole of upgrading/downgrading package versions, or debugging networking problems between virtual machines or other minor problems before getting to the technique or tool I want to try out. Basically just trying to test if my problem is common or not. Thank you!\n\n\nWould anyone be interested in spending 15 minutes trying out a little project I've been working on? Basically a 1-click to deploy webgoat/dvwa/metasploitable/whatever to your cloud provider, locks it down to your IP, then tear down when you're done.",
        "created_utc": 1537919354,
        "upvote_ratio": ""
    },
    {
        "title": "QUIC protocol",
        "author": "billdietrich1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9iwzij/quic_protocol/",
        "text": "I'm just a home user, a Linux n00b.  I'm trying to tighten down my system with firewall etc.  Ran Wireshark and I see a lot of QUIC traffic, Google's new UDP thing.\n\nIn the interests of keeping things simple, and having all the old networking tools work best, and probably having my VPN work properly, should I disable QUIC (with a couple of iptables rules) ?\n\nI guess I'm most concerned that the VPN probably isn't handling UDP at all, so QUIC traffic is going out with my real IP address on it.\n\nThanks.",
        "created_utc": 1537916184,
        "upvote_ratio": ""
    },
    {
        "title": "What to expect from penetration testing?",
        "author": "thejvexperience",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9iwios/what_to_expect_from_penetration_testing/",
        "text": "I am interviewing pen test providers and wondering if there are any things I should be looking for and anything I should make sure of? How do pen tests typically work? I've been asked by a client to have one conducted prior to them using my tech and would love to understand as much as possible about the process before getting started and selecting a vendor. TIA!",
        "created_utc": 1537912615,
        "upvote_ratio": ""
    },
    {
        "title": "IAM/Data Protection Analyst Interview questions",
        "author": "TastyUnderstanding",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9iwg03/iamdata_protection_analyst_interview_questions/",
        "text": "I am conducting interviews for an Analyst to function within the areas of Identity &amp; Access Management and Data Protection.  Would like to hear some suggestions regarding interview questions specific to these domains. \n\n&amp;#x200B;\n\np.s. when asked, why Cyber Security? EVERYONE answers with \"pen testing\". Every. Single. Time.  :p ",
        "created_utc": 1537912056,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Cloudflare's cipher orders",
        "author": "lnri",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9iwcq5/question_about_cloudflares_cipher_orders/",
        "text": "I was looking at SSL Server Test results (Qualys) for my personal blog and I noticed that Cloudflare's cipher orders (for TLS 1.3 - the test claims no preference) look like they could be improved upon, but maybe I'm not understanding the bigger picture so I'll ask to gain a deeper understanding and knowledge of the matter.\n\n**The available ciphers are as followed:**\n\n1. TLS_AES_128_GCM_SHA256 (0x1301)   ECDH x25519 (eq. 3072 bits RSA)   FS \t128\n\n2. TLS_AES_256_GCM_SHA384 (0x1302)   ECDH x25519 (eq. 3072 bits RSA)   FS \t256\n\n3. TLS_CHACHA20_POLY1305_SHA256 (0x1303)   ECDH x25519 (eq. 3072 bits RSA)   FS \t256P\n\nThe first thing I noticed was cipher 2 uses AES256 and SHA384 whereas cipher 1 uses only AES128 and SHA256, whileas both are sufficient wouldn't more bits of encryption leader to stronger security? Additionally I noticed cipher 3 is preferred for devices without AES-NI. What are the pros and cons of cipher 3? Why would you use cipher 1 over cipher two? Is less more in cryptography, what considerations should be made when choosing a cipher suite for your website?",
        "created_utc": 1537911394,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about using Content Security Policy to mitigate javascript problems",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9iw90l/questions_about_using_content_security_policy_to/",
        "text": "[deleted]",
        "created_utc": 1537910634,
        "upvote_ratio": ""
    },
    {
        "title": "Live logs for the 4120 NGFW",
        "author": "akairyuryu",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9ivzx3/live_logs_for_the_4120_ngfw/",
        "text": "Is there a way to see live logs like I could in the asdm for the 4120 next gen firewalls?",
        "created_utc": 1537908850,
        "upvote_ratio": ""
    },
    {
        "title": "Operationalize BitSight reports?",
        "author": "Kain__",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9ivowe/operationalize_bitsight_reports/",
        "text": "Anyone use BitSight?  Taking their report straight to our vendors doesn't seem like the best idea considering BitSights algorithm is a bit of a black box.  Has anyone successfully operationalized something like this with their vendors?",
        "created_utc": 1537906694,
        "upvote_ratio": ""
    },
    {
        "title": "Cyber security role",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9ivjc2/cyber_security_role/",
        "text": "[deleted]",
        "created_utc": 1537905645,
        "upvote_ratio": ""
    }
]