[
    {
        "title": "Is using variations of one password secure?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8vdv80/is_using_variations_of_one_password_secure/",
        "text": "[deleted]",
        "created_utc": 1530486185,
        "upvote_ratio": ""
    },
    {
        "title": "EC-Council's Bachelor",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8vdfi4/eccouncils_bachelor/",
        "text": "[deleted]",
        "created_utc": 1530482242,
        "upvote_ratio": ""
    },
    {
        "title": "How serious is the ROBOT attack?",
        "author": "n00py",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8vbjkm/how_serious_is_the_robot_attack/",
        "text": "I initially wrote off ROBOT as one of those SSL/TLS vulnerabilities that are largely theoretical and don't concern anyone other than those seeking PCI compliance.  \n\nI did notice that SSLlabs gives www.equifax.com an F rating, solely because of ROBOT.  \n\nhttps://www.ssllabs.com/ssltest/analyze.html?d=www.equifax.com\n\nI'm curious, how exploitable is this real world?  Of course first you must MITM a victim (or otherwise capture traffic) but how long exactly until you recover plaintext?  Do you need to keep the victim on the target site while performing the attack?  How long?\n\nAnd if not, how long will it take to decrypt a single packet?  Are you time limited or can you keep trying for months if necessary?  \n",
        "created_utc": 1530466542,
        "upvote_ratio": ""
    },
    {
        "title": "A Call for Participation in a Research Study",
        "author": "pbutler6163",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8vb4u5/a_call_for_participation_in_a_research_study/",
        "text": "**The research topic:**\n\nCybersecurity of Internet of Things devices within an industrial environment\n\n**The research problem:**\n\nThe systems that make up every level of the Internet of Things (IoT) have rapidly been assimilated into critical and essential roles in daily lives. As the entire ecosystem of the IoT evolves and expands, the wide range of functions and supporting components involved are resulting in significant security and ultimately privacy challenges that need to be addressed. The Industrial applications of IoT (IIoT) also referred as Industry 4.0 (Schwab, 2017) suffer from very similar security and privacy concerns as implementations that expand existing Operational Technologies (OT) networks through the interconnection of smart sensors and actuators with integrations into cloud computing platforms to create intelligent infrastructures create vital links within energy, transportation, manufacturing and automation.\n\n**The Research Purpose**\n\nThe purpose of the proposed qualitative study is to explore, within the Biochemical industry, the experiences of cyber-security professionals who have experience in implementing Industrial Internet of Things systems and devices and their perceptions of the security risks to these systems, giving rise to a better understanding of the security and privacy concerns that must be overcome.\n\n**The research question:**\n\n*Within the Biochemical industry, what are the experiences of cyber-security professionals who have implemented Industrial Internet of Things systems and their perceptions of the security risks to these systems?* This exploration may lead to a better understanding of the security implications of a technology that is rapidly growing but is overlooked within SCADA due to a false sense of security.\n\n**Research study participation:**\n\nFor data collection, this research study needs at least 10 participants for semi-structured interviews with an additional 2 for a pilot phase to fine tune the questions. The interviews will be conducted via Skype video conference calls in a nationwide scope. The primary focus of participants will be individuals who currently work within the chemical, biological, and pharmaceutical industries. Additionally, participants should be identifiable cybersecurity professionals. Each participant will answer about 10 interview questions. \n\n**Benefits of Participation**\n\nThere may or may not be a direct benefit to participants in the study, but we hope to further the knowledge required to implement IoT Devices into industrial settings that will help organizations to improve their security posture that could indirectly benefit everyone. Your contribution will be recognized and acknowledged in the dissertation.\n\n**Confidentiality**\n\nDuring the data collection and data analysis, every effort will be made to ensure that participants of the study will in no way be able to correlate their responses to their identity; the information will be coded to mask participants identities and ensure the confidentiality of the respondents. The data and records will be stored within an encrypted offline medium, and this will be stored within a locked container. Only the researcher will be allowed access to the data and the records, and once the study is complete, the data and records will be securely destroyed.\n\n**Contact information:**\n\nIf you would like to participate in this research study or functions as a pilot for the questions or have any other questions regarding this study, you may contact Patrick Butler at \n\n   \\- Cell phone number: 201-873-4938\n\n   \\- Email address: patrick.butler1@student.ctuonline.edu or patrick.butler@gmail.com\n\n   \\- Linkedin social media network: https://www.linkedin.com/in/patrickmbutler/\n\nFor questions regard the rights of research subjects, any complaints or comments regarding the manner in which the study is being conducted, you may contact Colorado Technical University – Doctoral Programs at 719-598-0200.\n\n# References\n\nSchwab, K. (2017). *The fourth industrial revolution.*   New York: Crown Business.",
        "created_utc": 1530463262,
        "upvote_ratio": ""
    },
    {
        "title": "A free vpn to watch netflix?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8vafyo/a_free_vpn_to_watch_netflix/",
        "text": "[deleted]",
        "created_utc": 1530457209,
        "upvote_ratio": ""
    },
    {
        "title": "Placement of Security Onion for Home Lab",
        "author": "uklipse",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v9xmr/placement_of_security_onion_for_home_lab/",
        "text": "I'm looking to learn and play around with Security Onion but was unsure of where to place the monitoring port. I have a firewall/IPS with wireless but it doesn't have a mirror port. I also have a small switch with a mirror port that I can place inline but not sure where is the best place for it. I've set it up in between my firewall and a wired desktop but don't see much. I was thinking of placing the mirrored switch outside my firewall and have the mirror port go to the monitoring port of SecOnion with the management inside but worried about it being exposed. \n\nSo is outside the firewall the best place and is there any risk to someone getting into my network by bypassing the firewall and going through the SecOnion monitoring port? ",
        "created_utc": 1530452177,
        "upvote_ratio": ""
    },
    {
        "title": "How can I create a private home network using public wifi?",
        "author": "crypto-anarchist86",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v94vx/how_can_i_create_a_private_home_network_using/",
        "text": "So I'm moving into an apt with free public wifi. So needless to say I don't have access to the router. I've got some of my devices connected to a VPN but not all my home devices. What can I do to secure and protect all the internet connected devices in my home? \n\nCan I buy a router of some kind that filters all incoming and outgoing traffic before it sends traffic through the public wifi? ",
        "created_utc": 1530442112,
        "upvote_ratio": ""
    },
    {
        "title": "Just a reminder that LastPass is sending the URL field to LastPass without encrypting with master password",
        "author": "kinoshitajona",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v7bcc/just_a_reminder_that_lastpass_is_sending_the_url/",
        "text": "Source: https://hackernoon.com/psa-lastpass-does-not-encrypt-everything-in-your-vault-8722d69b2032\n\nSo I checked with the most recent version whether it was still true.\n\nhttps://imgur.com/a/iiS1Trb\n\nYup it's still true... I was hoping their client would use regex to remove the basic auth stuff or path info... as they claim this is only to allow them to fetch the logo for the service...\n\nJust in case you care about the URL of something leaking out. (ie, we have some internal URLs that are supersecretproject.ourcompany.com that is mapped on our local DNS (so it's not public) as well as some sites we have internet facing and we place basic auth in addition to the webapp's auth in order to prevent certain attacks, so we save the basic auth info in the URL.)\n\nSure, these can all be avoided now that we are AWARE of this issue...\n\nSo just wanted to make sure you all are aware.",
        "created_utc": 1530416863,
        "upvote_ratio": ""
    },
    {
        "title": "Vps as proxy?",
        "author": "bloodfield6x3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v4zwg/vps_as_proxy/",
        "text": "would it be possible to use my vps as a proxy? if so how?",
        "created_utc": 1530393179,
        "upvote_ratio": ""
    },
    {
        "title": "Password Manager Recommendations? I can't use KeePass as all online/cloud file storage is blocked at work now.",
        "author": "DGPantherX",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v4dyc/password_manager_recommendations_i_cant_use/",
        "text": "Pretty unfortunate that this has to come to be. My company has blocked all access to all cloud storage. Google Drive, DropBox, OneDrive, OwnCloud, I can no longer reach. Does anyone have any recommendations for online-based password managers? There's so many options, and the two I'm primarily eye-balling right now are LastPass and BitWarden, but I'm curious to hear what you guys prefer. Which basket should I place all my eggs in?",
        "created_utc": 1530387724,
        "upvote_ratio": ""
    },
    {
        "title": "It is safe ti still use OS X 10.9.5 Maverick ?",
        "author": "vava_dumoac",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v2oz3/it_is_safe_ti_still_use_os_x_1095_maverick/",
        "text": "I still use my macbook air 6.2. The system is \"up to date\" as possible. Meaning there is no more updates, apple drop the support. I can't use google chrome anymore, google drop the compabilities withe maverick too. \nBut this is a good thing because now i'm on firefox again and i'm very pleased.\nI used my laptop a lot in public wifi for browsing and torrenting a lot of linux distribution of course.\nOn firefox i've got ublock, httpseverywhere and decentraleyes.\nI disable a lot of \"networking\" service such as file sharing. I ve got the os x firewall working and an apple script for disabling the mic and webcam.\nFinaly i use my cell as wifi hotspot.\n\nI known none computer is 100% but i'm too easy to hack ? How unsafe i am ? lol",
        "created_utc": 1530373721,
        "upvote_ratio": ""
    },
    {
        "title": "masters in computer science or cyber security",
        "author": "JonthanA",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v1crd/masters_in_computer_science_or_cyber_security/",
        "text": "Hi, bardon my english I'm little confused about which major would make me better in cyber security field if i study cyber security as master degree in computer science or i just take bachelor's degree in cyber security",
        "created_utc": 1530359695,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't DNS Sec widely used?",
        "author": "bkabbott",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v1bgj/why_isnt_dns_sec_widely_used/",
        "text": "I've noticed that DNS Sec is not used at all, even by companies with many resources.\n\nI manage some websites/servers for some companies. Would it be worthwhile to setup DNS Sec?",
        "created_utc": 1530359219,
        "upvote_ratio": ""
    },
    {
        "title": "How would you teach pentesting?",
        "author": "MantridDrones",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8v09mu/how_would_you_teach_pentesting/",
        "text": "OK so the story goes that I'd been unofficially the company pentester and now I'm the first (part-time) official one which caused quite a stir. When i invited a girl who was interested in netsec into an hour-long meeting to introduce her to it 2 other girls and a fella came with which I was very happy about since it would spread awareness and possibly in time expand the new department without the need for external hires (in the long term anyway)\n\nSo i had some of our old code and we stepped through the process where i shelled our own product (Which I thought would have more impact over a CTF). Afterwards the women were very enthused but the fella was saying that it felt more like I was doing everything and everyone else just copied (precisely what it was, but i did it slowly, explained what everything was, why i used it, made them do the same to see and asked them about the results, and explained why most of our time was spent scanning and googling rather than \"hacking\" so they could take notes and useful commands or variants of commands as i did), so i explained that when i first started out it was mostly vulnhub VMs with a walkthrough open beside me so it's not cheating, it's just learning that you'll tend to do the same things like i realised after a few VMs; nmap first, maybe a nikto and dirbuster to web or netcating to a strange port for a banner  etc. If i just gave him an IP address he'd be lost, he's a developer but he's never used nmap.\n\nso 3 out of 4 people ain't bad by my books but maybe I could be more engaging or something, he was excited about it at first but I've lost him somewhere even though i explained at the start that most of the hour will be enumeration. Given the real-world vulns I've found in our product and showing it to them that kept the excitement up for the other 3\n\nMaybe he just wasn't as enthused as he thought but since this is my first time, are there any tips people have for when i actually invite people from the company to something like this?",
        "created_utc": 1530343604,
        "upvote_ratio": ""
    },
    {
        "title": "modern ways to protect systems",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uzmpi/modern_ways_to_protect_systems/",
        "text": "our defense mechanisms are mostly detect and protect tools which are always after the fact. any tools and solutions to recommend that uses virtualisation to isolate every application in a protective enclave, so that even if malware does pose a threat, it is contained in a virtual environment? thanks",
        "created_utc": 1530335250,
        "upvote_ratio": ""
    },
    {
        "title": "Reverse engineering passwords in our vendor app...",
        "author": "thegovernmentlies2u",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uz0al/reverse_engineering_passwords_in_our_vendor_app/",
        "text": "I'm trying to figure out how a vendor product is storing passwords in our database so that I can automate user creation.  ...but I can't quite figure out how it's hashing these passwords.\n\nI created a few examples in the system to test, but I can't figure it out...  I do know that if I give two users the same password, it'll create the same DB entry, so it's not hashing or seeding with any other fields.\n\nPassword | What is in the DB\n---|---|----\nadildo | QW1qJuJrQwHLm/yPOZWxWg== \n1dildo | bWxT5sA7e3CUB5dx7FREJQ==\n123 | X5IOQOMbfQQdcsAs8IdYmQ==\n12312312312312312312312312312312 | ho+ZbE8PJc7MdaHkwoSyXZCZ/PypyOr1hRrda4r/24pm6UvU74osO4hM+lnKNCsu \n\nAny ideas?",
        "created_utc": 1530328323,
        "upvote_ratio": ""
    },
    {
        "title": "Is the OSCP worthwhile if you don't want to be a penetration tester?",
        "author": "Knight_of_the_Stars",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uxgr7/is_the_oscp_worthwhile_if_you_dont_want_to_be_a/",
        "text": "Basically, I'm considering the OSCP, but I am much more interested in the incident response and defense side of security than I am in penetration testing and red teaming. Would the OSCP be worth it? Are there better certifications for incident response, etc.?",
        "created_utc": 1530312973,
        "upvote_ratio": ""
    },
    {
        "title": "If I use admin:admin to log into an account, is that an exploit?",
        "author": "VulnSeeker0x1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uwdhl/if_i_use_adminadmin_to_log_into_an_account_is/",
        "text": "",
        "created_utc": 1530303931,
        "upvote_ratio": ""
    },
    {
        "title": "Can't change my spectrum router password",
        "author": "sp3ctrum2121",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uw8cd/cant_change_my_spectrum_router_password/",
        "text": "Does anyone with spectrum have issues with changing their default login password? I have been trying to change the default login about 3 times now but as soon I as change it I can't login with the new password nor the default and need to reset the box. Can anyone else with spectrum test this? ",
        "created_utc": 1530302845,
        "upvote_ratio": ""
    },
    {
        "title": "Is getting a network admin associates degree worth it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uw7uu/is_getting_a_network_admin_associates_degree/",
        "text": "[deleted]",
        "created_utc": 1530302739,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to confirm your connection to the internet when using apps? Reddit app for example how do I know I'm secured?",
        "author": "Phantom_7",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uvmaq/is_there_a_way_to_confirm_your_connection_to_the/",
        "text": "",
        "created_utc": 1530298177,
        "upvote_ratio": ""
    },
    {
        "title": "Best endpoint security?",
        "author": "Cesarius187",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uvjsz/best_endpoint_security/",
        "text": "Hello, I'm an intern for a small company and they are looking to invest in new endpoint protection. I have no clue what to recommend as I haven't worked in enterprise before, any advice form the pros? \n\nThanks in advance :)",
        "created_utc": 1530297664,
        "upvote_ratio": ""
    },
    {
        "title": "How do I know if my connection is secure while using apps like Reddit?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uvjcm/how_do_i_know_if_my_connection_is_secure_while/",
        "text": "[deleted]",
        "created_utc": 1530297559,
        "upvote_ratio": ""
    },
    {
        "title": "What is it like working for an MSSP vs Retail, Banking, Healthcare, etc",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uvi09/what_is_it_like_working_for_an_mssp_vs_retail/",
        "text": "[deleted]",
        "created_utc": 1530297252,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any conferences focused on / majority about appsec?",
        "author": "nationStateHate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uvbmu/are_there_any_conferences_focused_on_majority/",
        "text": "",
        "created_utc": 1530295901,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any appsec specific conferences?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uvber/are_there_any_appsec_specific_conferences/",
        "text": "[deleted]",
        "created_utc": 1530295853,
        "upvote_ratio": ""
    },
    {
        "title": "Cannot find the IP address",
        "author": "learNrun",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uuni5/cannot_find_the_ip_address/",
        "text": "While I tried to access youtube using Chrome, It kept saying that I cannot access because it could not find the IP address but other websites were still working. \n\nAny security problem can cause this?",
        "created_utc": 1530291034,
        "upvote_ratio": ""
    },
    {
        "title": "Dictionary Password Generator?",
        "author": "bigolswampdonkey",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uu0kk/dictionary_password_generator/",
        "text": "Background: I’m working on an audit of password strength for my internship. I have my active directory and process, etc. all down but I think I’m not getting accurate results because of my test password list. I created a list to test the process on but what I’ve found is the passwords are either too strong (very complex, random, unlikely people actually use) or too weak (don’t follow the complexity requirements). Does anyone know of a good website/method of generating AVERAGE passwords? Preferably in bulk? \n\nThings like “password1” or “*K3,bsi@2;p/idn” are too weak/too strong. I need a list that’s not super strong, but follows basic complexity requirements. I have a partial list of people/pet names with random numbers appended to the end of them (“Sydney72” for example), but I need more variation. Please help!",
        "created_utc": 1530286145,
        "upvote_ratio": ""
    },
    {
        "title": "Which IT security certificate should I opt for.",
        "author": "Eh_h",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ut8iv/which_it_security_certificate_should_i_opt_for/",
        "text": "I am 27yo guy, i have Engineer diploma (5yeras university studies) in Networking &amp; Telecommunications. I graduated 2years ago. Now I want to look for a job in IT security, and as you know, it's a very broad domain, so im bit confused.\n\nMy options are either networks security or cybersecurity (that if there isnt another subdivision of IT security that i dont know about lol).\n\nNormally im a networks guy, that's what the degree says. But I've been programming since i was 16, and started hacking when i turned 20yo. So i know a lot about cybersecurity as well (writing exploits, pentesting, very good with scripting languages,...), and it is kinda my thing.\n\nSo i'm confused whether I should go with what my diploma says I am or seek a cybersecurity job which is what i love.\n\nSo i have 3 questions:\n\n1. Maybe I have this confusion because i dont know much about networks engineer responsabilities. Is it as fun as pentesting!!\n\n2. There is a 'career hole' in my curicculum of 2years (  i've been working on a personal project), so im aware of the necessity to get a certificate if i want to land a job. I assume OSCP for cybersecurity (seems the only decent cert out there. I checked CEH, there is not very much to it, very easy). What do you think?\n\n3. If i went with networks security and considering my degree, do you think i need an entry level or jump directly to intermediate level certificate.\n\nThanks.",
        "created_utc": 1530279925,
        "upvote_ratio": ""
    },
    {
        "title": "What methods and softweare are you using to protect your devices, online&amp;offline activity, data and other leakable information?",
        "author": "lordofvain",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8urp94/what_methods_and_softweare_are_you_using_to/",
        "text": "I use ProtonMail and Signal for encrypted communication, NordVPN for proper encryption with network killswitch, DuckDuckGo search engine to avoid tracking. Also, I prefer using my own hotspot over any public or shared wifi. What are your used methods or programs? What can I do to increase the security of my data?",
        "created_utc": 1530263142,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on EPP/EDR vendors",
        "author": "abcool123",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uq510/thoughts_on_eppedr_vendors/",
        "text": "I am evaluating EPP/EDR solutions and need some help... What are your thoughts on the most effective solution in the market? Symantec, FireEye, CarbonBlack, Tanium? We are a primarily Windows shop, want a lot of automatic remediation, not compromise user experience, maintain &lt;10 second boot time, and not degrade COU performance. I have been looking at Windows Defender ATP and very impressed with how much we can do built-in and hunting capabilities are great. Any thoughts on that since it is new?",
        "created_utc": 1530244836,
        "upvote_ratio": ""
    },
    {
        "title": "Linux Distro (other than kali) for learning to custom script tools",
        "author": "Hollowpoint357",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uplxl/linux_distro_other_than_kali_for_learning_to/",
        "text": "Hello! I've played with Kali and primarily focused on wireless attacks, learning to crack wifi, reaper, generating dictionaries for brute force, etc. Just kinda fun simple stuff. I'd really like, though, to learn how to write custom scripts for attacks. I want to start simple - for example I want to write a python network scanner or even just script some nmap actions. Is kali still a good distro for this? Or would I be better off with a more vanilla distro and installing tools as I go? I have a desktop PC I sometimes run virtual machines off, but I've recently acquired a nice modified T420 that I'd like to turn into my mobile pen testing unit.\n\nAny thoughts on distros other than Kali for the purpose of learning to write custom tools?",
        "created_utc": 1530239503,
        "upvote_ratio": ""
    },
    {
        "title": "Great article on getting your Info Sec career started! (Found in comments in another info sec page)",
        "author": "iknoweverything22",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uo1pv/great_article_on_getting_your_info_sec_career/",
        "text": "[https://danielmiessler.com/blog/build-successful-infosec-career/#education](https://danielmiessler.com/blog/build-successful-infosec-career/#education)\n\nIt is ten years old, and loaded with amazing information! I wish there was a 2018 version of this article but one could assume that it would essentially be the same thing. If you have any information that article may have missed, please share! ",
        "created_utc": 1530225174,
        "upvote_ratio": ""
    },
    {
        "title": "File encryption on a Windows Network",
        "author": "the-eye-gouge",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8unl6d/file_encryption_on_a_windows_network/",
        "text": "[removed]",
        "created_utc": 1530221452,
        "upvote_ratio": ""
    },
    {
        "title": "What tools/software do you use for metrics?",
        "author": "t_hood",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8umiyp/what_toolssoftware_do_you_use_for_metrics/",
        "text": "As I'm sure we all know, it can be difficult to get funding and approval in network security because we are often seen as a \"business expense\" without any real \"return\" in value to the company. Right now, my employer is really trying to rework how we compile and report metrics to our supervisors in the hopes that we can get approved for several new projects. Right now, we are compiling reports, graphs, and charts in Excel - which is by no means *bad* \\- however, it because tedious and even sometimes difficult to get in-depth and specific statistics and results. Have you guys had any luck with software/tools that assist you with metrics? Currently we have Trend Micro deployed on our servers to detect breaches and suspicious/malicious traffic and our reports are typically generated from exported excel sheets. Like I said, this process isn't bad, but I'm looking to maybe add a little more. I'm preferably looking for open-source, but if its really worth it's price then paid is also an option.",
        "created_utc": 1530213534,
        "upvote_ratio": ""
    },
    {
        "title": "Twitter handles for keeping up to date with breaking news exploits/infosec/etc..?",
        "author": "Da_Mekanix",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8umeul/twitter_handles_for_keeping_up_to_date_with/",
        "text": "Just wondering if any of you had some useful twitter handles for keeping up to date with the latest news in infosec",
        "created_utc": 1530212717,
        "upvote_ratio": ""
    },
    {
        "title": "what happens when i get redirected to a ww(n) domain?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8um47z/what_happens_when_i_get_redirected_to_a_wwn_domain/",
        "text": "[deleted]",
        "created_utc": 1530210570,
        "upvote_ratio": ""
    },
    {
        "title": "Lookling for NTA Vendor Mnuals",
        "author": "HisHovercraft",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ulmpx/lookling_for_nta_vendor_mnuals/",
        "text": "I am evaluating NTA vendors (Network Threat Analysis) but none of them post usable docs. Does anyone have suggestions on how I can get user or admin manuals for DarkTrace, Vectra, BluVector, Lastline or ProtectWise? I really don't want to do a trial to get this info. I would like to do a technical eval first and then decide what vendor to do a 30 trial with.",
        "created_utc": 1530207232,
        "upvote_ratio": ""
    },
    {
        "title": "Monitoring multiple Servers - ELK Stack?",
        "author": "devinster",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ulh4k/monitoring_multiple_servers_elk_stack/",
        "text": "Hi there,  \n\n\nI finally have some time and currently learn more about monitoring or better said, monitoring multiple servers.  \n\n\nUntil now I SSH into the servers and check all the things by hand, now I am reading about ELK and Graylog.   \nSince I don't want to install either ELK or Graylog on every server I was thinking about ordering a separated server just for monitoring.  \n\n\nI manage servers with different distros on it (Monstly Ubuntu, Debian and CentOS) and would like to if its even possible to something like this.  \n\n\nFrom what I see [Filebeat](https://www.elastic.co/products/beats/filebeat) is able to do this. Which means, I need to install it on every server and then forward the logs to the separated server which is for monitoring, right?  \n\n\nWhat would be the \"best practice\" to monitor multiple servers at once without losing too much security.  \n\n\nThank you!  \n",
        "created_utc": 1530206287,
        "upvote_ratio": ""
    },
    {
        "title": "Why use vulnerability scanns like Qualys vs just using SCAP for free?",
        "author": "JoshinYouForKeys",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ul0p7/why_use_vulnerability_scanns_like_qualys_vs_just/",
        "text": "Not using passive monitoring, but just pure vulnerability scanner, agent based.\n\nWhy use say Qualys or Nessus (like Nessus Manager) agent based scanning instead of just using SCAP? Don't they both do the same thing? ",
        "created_utc": 1530203410,
        "upvote_ratio": ""
    },
    {
        "title": "Where should I start? How should I put checkpoints to my career? A Backend developer that wants to move to pentesting.",
        "author": "bleh10",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uko1b/where_should_i_start_how_should_i_put_checkpoints/",
        "text": "Hello, I know a lot of people ask on this subreddit on how to become a pentester or so. Anyway I just want to put checkpoints that I can clear to know that I am going in the right path to become what I want.\n\nSome context: I am a fresh CS grad with 1 year of experience in back-end, was always interested in pentesting and cybersecurity. I fiddle around sometimes on Kali and try some tools, I watch/read about a lot of informative videos/articles regarding attacks or so.\n\nWhat I'm looking for is to know how to proceed with this, I know there is ton shit of certifications that I can try and get online but I have a limited amount of resources (money and time) as I am a full time employee.\n\n\nAny tip can help and thanks a lot!",
        "created_utc": 1530201123,
        "upvote_ratio": ""
    },
    {
        "title": "Which has more credibility: SSCP or CSA+",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uka2m/which_has_more_credibility_sscp_or_csa/",
        "text": "[deleted]",
        "created_utc": 1530198523,
        "upvote_ratio": ""
    },
    {
        "title": "VMWare or Virtualbox?",
        "author": "snakethesniper0",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ujyi2/vmware_or_virtualbox/",
        "text": "In your experience and opinion, what's the best virtual machine to use for security purposes?\nNot considering the basic free version, since for example in that case VBox has snapshots and VMWare hasn't.\n",
        "created_utc": 1530196398,
        "upvote_ratio": ""
    },
    {
        "title": "Who's picking up all the security work that has been eschewed ala protesting employees @ Google, Amazon, Salesforce, &amp; Microsoft?",
        "author": "nationStateHate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uji32/whos_picking_up_all_the_security_work_that_has/",
        "text": "https://gizmodo.com/amazon-workers-demand-jeff-bezos-cancel-face-recognitio-1827037509\n\nhttps://www.nytimes.com/2018/06/19/technology/tech-companies-immigration-border.html\n\nhttps://www.zdnet.com/article/google-employee-protests-now-google-backs-off-pentagon-drone-ai-project/\n\nhttps://techcrunch.com/2018/06/28/salesforce-reportedly-wont-cancel-its-contract-with-border-agency-despite-employee-petition/\n\nYes I know in some articles work isn't necessarily cancelled yet, but does anyone know who is picking up all the work that's being thrown away by some of these tech companies? Are say Google et. al. creating shell companies to continue this work? \n\nThoughts? ",
        "created_utc": 1530193215,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for installing Python (Anaconda distribution) in a secure corporate environment",
        "author": "ShadEShadauX",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uizcd/recommendations_for_installing_python_anaconda/",
        "text": "Greetings!  Please do not hesitate to let me know if there is a better sub for this.\n\n**Background:**\n\nI am a n00b in working with [Python](https://www.python.org/).  I have developed a couple 'proof of concept' scripts at home that I believe would be valuable in my day job.  I have requested Admin access from I/S to load Python ([Anaconda](https://www.anaconda.com/what-is-anaconda/)) on my PC and some specific packages I would need ([Pandas](https://pandas.pydata.org/), [Plotly](https://plot.ly/)).  My IDE would be Spyder which comes with Anaconda.  I am also open to using other IDE or text editors and vanilla Python instead of Anaconda.\n\n**What I need:**\n\nThe concern is working with sensitive (protected by law) data and how to set this up as securely as possible.  Apparently there are not (m)any other people in my organization that use Python.\n\nI need recommendations or details to give my I/S contacts in order to get this up and running (my request is 1.5mo old at this point).\n\n**Details:**\n\nI believe there are two main concerns:\n\n1. My code doing something bad.  This is within my control and could be mitigated by some sort of code review or something.\n2. The programs/packages I install could contain malicious code.  I am not sure how to help them with this?  Is there a trustworthy list of 'vetted' Python packages somewhere?\n\nI have given them the results of my cursory Googling, but it is very light on what to actual do (i.e. details):\n\n\\--[Example of another company using it (very general)](https://www.paypal-engineering.com/2014/12/10/10-myths-of-enterprise-python/#python-is-not-secure)\n\n\\--[PEP551 (draft)](https://www.python.org/dev/peps/pep-0551/)  (draft)\n\n\\--[Sandbox](https://wiki.python.org/moin/SandboxedPython)\n\n\\--Virtual Machines\n\nAny help or tips would be greatly appreciated.\n\nThanks!\n\nEdit:  xposted to r/learnpython\n\nEdit2: Update for posterity.  The cybersecurity member (second I/S level of my request) cc'd the right guy in the email denying my request.  Python is, in fact, used within my organization (as an approved application) and the 'right guy' is setting me up with the enterprise architect to discuss what we can do.  I will update with any specifics on the setup in the future if it happens just in case it helps anyone in similar predicaments.",
        "created_utc": 1530189391,
        "upvote_ratio": ""
    },
    {
        "title": "Forensics and Incident Handling",
        "author": "1three",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uiyyf/forensics_and_incident_handling/",
        "text": "Hey Everyone! I really want to expand my skillset toward Digital Forensics, Malware Analysis, and Incident Handling. Do any of you have advice on the best route to take? I have seen several certifications out there on these topics, but I'm unsure which will bring the most value. Any advice? Thanks in advance.\n\nEdit: To clarify, I am looking for firsthand experiences from those that work in DFIR or have taken training courses/certifications and advice for what will bring the most value. Thanks!",
        "created_utc": 1530189309,
        "upvote_ratio": ""
    },
    {
        "title": "Certification to pursue next?",
        "author": "invisiblelair",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uijvn/certification_to_pursue_next/",
        "text": "throwaway account for various reasons... \n\nI'm relatively new into the purely infosec career and have often taught myself in the past through labs + experience + certifications for the conceptual stuff.  **I enjoy taking certifications as I feel it provides somewhat of a \"guideline\" as to what to study.**  My more recent company no longer offers reimbursement for certifications so I'm trying to get some advice on what certs may have value to me from the more seasoned netsec community. Any advice in regards to certifications/other things to potentially learn or career advice would be appreciated!\n\n  \n**Background**: have worked as helpdesk, network administrator, systems consultant, systems engineer, currently work as a info sec analyst\n\n  \n**Current Certifications** (these were all free and paid for by my previous companies...):\n\n* CompTIA A+, Net+, Sec+\n* MCSA: win 10, server 2016\n* MCSE: Cloud and platform infrastructure\n* CISSP\n* CCNA\n\nI have no interest in pen testing or red teaming. I hope to go into management, but this is probably a couple years away at a minimum- I want to get into the more nitty gritty technical portions so I am not just speaking out of my ass later on and maybe do some compliance just before moving into management.\n\n  \nA few things that have come to mind that I am willing to pay out of pocket for (lol not SANS/GIAC) and mainly because they will renew my other certs:\n\n* CCNA security\n* CISA (not sure about this one, I hear it has lots of overlap with CISSP but don't know how relevant it is)\n* CompTIA CYSA+ (I think this was formerly their CSA, not sure)\n* CISM(later, maybe next year or the year after)\n\nSome other things I plan on learning more on:\n\n* python (I suck at programming, at best I'm good with powershell...)",
        "created_utc": 1530186080,
        "upvote_ratio": ""
    },
    {
        "title": "The Best DLP Solution",
        "author": "aljagape",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uhy8s/the_best_dlp_solution/",
        "text": "Good Day Everyone!\n\nI did some research on who is the best DLP Solutions today and I came up with my own top 3, it's Symantec DLP, Checkpoint DLP, and Endpoint Protector. I based my decision on my limited knowledge about all kinds of DLP Solutions, and by reading their Data Sheets.\n\nNow I want to know the differences of the three and who is better in providing the best Solution for an enterprise level company, and of course the most affordable. Also, if there's a much better DLP solution than these three then please tell me.\n\nI'm really having a hard time in picking a good solution for a client, so any help is much appreciated.",
        "created_utc": 1530180880,
        "upvote_ratio": ""
    },
    {
        "title": "PenTesting Network Configuration",
        "author": "coava",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ugb4b/pentesting_network_configuration/",
        "text": "Hello everyone,\n\nI want to spend my summer break practicing penetration testing, and I want to do it the right way.\n\nMy current situation is that I have two VMs (Kali and Windows 7) installed in a VirtualBox and both of them are connected by NAT network.\n\nHowever, I'm not sure whether this network configuration is the best choice to make sure that both are completely isolated (each connected to each other, but no outside network).\n\nI think I'm just paranoid thinking that if I'm connected to any outside network, there is a slight chance the malware could infect my home WiFi network :\\\\\n\nCould anyone give me an advice regarding this?\n\nThank you.",
        "created_utc": 1530159818,
        "upvote_ratio": ""
    },
    {
        "title": "wifi - security, hacking and access",
        "author": "iwashere33",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ugadz/wifi_security_hacking_and_access/",
        "text": "i have 3 questions that have sprung up over the last month that are all regarding WLAN, and i think the sub would have the answers i am looking for\n\n(1) what type of security is considered best and/or the minimum standard. to be exact, what would be the least amount of security to be used for wifi. \n\ni had a client that was using no security (no password at all) because they simply could not remember \n\n(2) how would you set up a customer wifi for a cafe?  like mcdonalds has a seemingly good setup for their guest wifi but i would have to assume it is very segmented from their normal network.\n\nhad a client that was just giving people the password for their own store wifi which any computer could see had access to their whole network. i shut that down pretty quick.\n\n(3) how to hack a wifi password, this might sound strange but i had, and still have a situation where there is wireless access point in a box, the box is locked. the only thing going through is a network cable and a power cable (an extension cable). part of the job sheet is to change the password for the wifi so that they can use it outside/nearby the box. \n\nthe client fired a previous manager who changed the password, locked the box with his own lock, and kept all the keys. the device is powered down for the moment but short of getting an angle grinder and a crowbar this box is staying closed. (already offered that 'solution' and client declined)\n\nlast i heard there was some version of linux, and/or an program for linux that could run on a laptop and just brute force it for a few weeks. \n\n",
        "created_utc": 1530159575,
        "upvote_ratio": ""
    },
    {
        "title": "Someone got hold of a photo sent by a woman to me through Facebook Messenger. Where did the breach occur and how do we fix it?",
        "author": "Planetingalaxy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ufzj2/someone_got_hold_of_a_photo_sent_by_a_woman_to_me/",
        "text": "There is  woman I know. On 25th June we were chatting as usual. She took a photo on her mobile and sent it to me through Facebook messenger. She used her Samsung mobile (cant say what model) and I was on Facebook web on laptop running Win 10. At midnight I received the same photo of her in a message request from a fake account. She says her password was not that strong and she changed it after her friends sent screenshots of the same photo that was sent to them by the fake accounts on 26th. She refuses to speak about the subject and provide details.\n\nI did not download the photo on facebook to my laptop. We live in Bangladesh if thats relevant. \n\nMy question is: \n\n* Where did the security breach occur and how?\n\n* What can we do to recover? She is totally untech savvy so will not be able to implement technical security practices. \n\n* How do I capture evidence of it and who did it?",
        "created_utc": 1530156428,
        "upvote_ratio": ""
    },
    {
        "title": "CySa+\\PenTest+ or OSCP?",
        "author": "eyeless71",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ufslw/cysapentest_or_oscp/",
        "text": "I want to get into a job doing pen testing or security analysis. I have a degree from DeVry Online in computer information science with a specialization in info systems security, and currently work for a managed service provider doing tier 1/2 support and project management. It’s my first tech related job and I’ve been in it for about 7 months. I don’t think my current employer would pay to help with either of the carts, so I’m on my own there. Would I be better served taking one of the CompTIA certs or the OSCP? I did a CySA+ practice exam, and got 67/85 questions right, and I’m confident I could pass it, but money is tight so I need to save up, and I want to get the cert that’s going to make me look best. ",
        "created_utc": 1530154621,
        "upvote_ratio": ""
    },
    {
        "title": "What are some free/cheaper courses to learn the equivalent of the GCIA/SANS503 curriculum?",
        "author": "swagdaddy912",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uf72u/what_are_some_freecheaper_courses_to_learn_the/",
        "text": "I want to learn the same information without spending 6 grand? any guidance?",
        "created_utc": 1530149115,
        "upvote_ratio": ""
    },
    {
        "title": "Directory Traversal with OWASP ZAP",
        "author": "Linux512",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uezfu/directory_traversal_with_owasp_zap/",
        "text": "I'm trying to run a directory traversal against the EdgeOS web server. I'm trying to run a directory traversal attack by changing the parameter values for \"Cookie\" among other parameters. I've been trying to look for some information but nothings turned up.",
        "created_utc": 1530147226,
        "upvote_ratio": ""
    },
    {
        "title": "I can't seem to find a straight up, tried-and-true guide to becoming more knowledgable and eventually employable in Cybersecurity. Please assist.",
        "author": "violence_exe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uejn9/i_cant_seem_to_find_a_straight_up_triedandtrue/",
        "text": "I see the book recommendation page, but no timeline (i.e. read this before that). \n\nI see [this](https://old.reddit.com/r/AskNetsec/comments/4qb1yt/security_self_study_this_summer/) post but no comments at all addressed the post.\n\nI know bash/command line, assembly reading knowledge, C, some python, linux experience, other things like that (CS grad). ",
        "created_utc": 1530143176,
        "upvote_ratio": ""
    },
    {
        "title": "Top Notch hacking services",
        "author": "Jackfitzgerald13",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8udq9m/top_notch_hacking_services/",
        "text": "[removed]",
        "created_utc": 1530136325,
        "upvote_ratio": ""
    },
    {
        "title": "How safe is my anonymity in Twitter?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8udmhx/how_safe_is_my_anonymity_in_twitter/",
        "text": "[deleted]",
        "created_utc": 1530135529,
        "upvote_ratio": ""
    },
    {
        "title": "What could \"Login will keylog your info\" mean? Link to Reddit post in question inside.",
        "author": "csp2018",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8udbl3/what_could_login_will_keylog_your_info_mean_link/",
        "text": "I was reading the post below, and I was confused what they meant by \"Login will keylog your info\".\n\nhttps://www.reddit.com/r/Piracy/comments/88x7ny/stop_using_primewire_permanently/\n\nDoes that mean...\n\n- the website will see your password instead of hidden characters? Why would a website want their own users' password?\n\n- the website will see all your activities on their site after you log in?\n\n- the website will see your activities even outside the site?\n\n\nu/DollaHollaAtcha",
        "created_utc": 1530133230,
        "upvote_ratio": ""
    },
    {
        "title": "Kali as main OS question",
        "author": "zeroknowledgeproofs",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uclol/kali_as_main_os_question/",
        "text": " if I am running Kali as main OS is it ok to use non root account for pentesting if I use the \"sudo su \" command in terminal first? Or do I need to log out and swtich to root entirely?﻿ ",
        "created_utc": 1530127913,
        "upvote_ratio": ""
    },
    {
        "title": "Question(s) about Cybrary/Cybrary Pro",
        "author": "SgtGirthquake",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uchnm/questions_about_cybrarycybrary_pro/",
        "text": "Hello r/AskNetsec, i'm pretty new to Network Security as a whole. I just finished my Sec+ Course, and i've been working on studying my ass off to get myself up to speed in order to take the exam. Unfortunately, I've been having a bit of trouble trying to find worthy labs to follow along and set up/work with, so I can build my functional knowledge of how things work/implemented. I'll either find something that's dated as far as distro updates, and be SOL, or it'll be sitting behind a paywall in order to use it. Which leads me to my question(s) about [Cybrary.it](https://Cybrary.it):\n\nIs it worth my time grinding through Cybrary, and getting the micro-certs for whatever is free - do employers even care about them?\n\nSecondly, in that regard - Cybrary offers many labs that are guided based on their topic. Is it worth dropping the $99 and trying to grind out the labs to get my money's worth? I don't want to drop that cash right now while i'm still job-searching only for it to be a complete waste.\n\nIf anyone has any tips or pointers - like sites/guides I can follow to work on setting up networks &amp; scenarios, I'd seriously appreciate the guidance.",
        "created_utc": 1530127079,
        "upvote_ratio": ""
    },
    {
        "title": "Help on http response splitting",
        "author": "syfer11",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uavvm/help_on_http_response_splitting/",
        "text": "Hi guys! I've recently started tinkering with webgoat and one of the lessons was on http response splitting. I've read the lesson plan and watched videos on it but i don't really understand how it works. Can anyone explain how it works? ",
        "created_utc": 1530115892,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't hackers crack passwords created using Diceware if they try every word combination in the list?",
        "author": "powerofinformation",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8uavky/why_cant_hackers_crack_passwords_created_using/",
        "text": "Non-tech individual here. If a hacker kept on trying every word in the diceware list in combinations, why wouldn't they be able to crack the password within a few days? THis seems especially easy if the passphrase is of less than four words. ",
        "created_utc": 1530115836,
        "upvote_ratio": ""
    },
    {
        "title": "My Attacker stole source code from my air gapped PC.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u9sla/my_attacker_stole_source_code_from_my_air_gapped/",
        "text": "[deleted]",
        "created_utc": 1530107646,
        "upvote_ratio": ""
    },
    {
        "title": "Top pen test companies for a bespoke pen test?",
        "author": "LeatherBaseball",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u8q8s/top_pen_test_companies_for_a_bespoke_pen_test/",
        "text": "Used a few pen test companies before (NCC Group, MWR InfoSecurity), looking for some recommendations. The software is a Windows based security product in case that impacts who you would recommend.",
        "created_utc": 1530097829,
        "upvote_ratio": ""
    },
    {
        "title": "Risk Assessment Sample",
        "author": "CyberSecThrowaway",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u712v/risk_assessment_sample/",
        "text": "Hello r/asknetsec,\n\nI am somewhat new to the security industry, in fact I am corporate lawyer and have been seeing an uptick in client demands for security-related compliance, and I am trying to expand my ability to provide needed services. \n\nI know that risk assessments are the core of building a good security posture for a company, but I am having some difficulties actually pulling together a risk assessment template.\n\nI have read the applicable NIST Special Publications, as well as several articles (particularly in the HIPAA space), but they all provide an overview of the conceptual framework, rather than specific steps to take in conducting a risk assessment.\n\nI feel quite comfortable in what a risk assessment should do, and how risk should be conceptualized, but I am unclear on how the risks to an organization are comprehensively identified.\n\nI was wondering if anyone here has a sample or template risk assessment. I know that actually conducting a risk assessment is likely beyond my purview, but I do want to understand the in's and out's so that I can help clients work internally or with external security experts to conduct the risk assessment and fold it into the organization's approach to risk management.\n\nThank you!",
        "created_utc": 1530077423,
        "upvote_ratio": ""
    },
    {
        "title": "Who can point to these ‘industry stats’?",
        "author": "Jstreetm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u6ns1/who_can_point_to_these_industry_stats/",
        "text": "SANS has this as a part of a summary for an upcoming webcast. \n\n“SecOps teams often hire people who can hit the ground running because it costs too much to get them up to speed. Industry stats show it takes 90 days before the business starts seeing value from a new employee and roughly a year to recoup hiring costs”\n\nWondering if anyone has come across paper or article and wouldn’t mind sharing the source.\nThanks!",
        "created_utc": 1530073467,
        "upvote_ratio": ""
    },
    {
        "title": "Security Architect interview - advice needed pretty please!",
        "author": "Chemwarfare",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u4jih/security_architect_interview_advice_needed_pretty/",
        "text": "As the title mentions, I have an interview coming up for a Security Architect position. This would be my first security position and I was wondering if anyone could give me some pointers on what I should prep for.\n\nI have more of a systems architect / devops type background, and specialize more in automation, CI/CD, and process / workflow development, so I'm pretty familiar with Best Practices as I overhauled my last company with them, and got along with our SecOps team really well. My former manager always joked that he was gonna send me to their team, because I loved taking on new challenges and needs that they had. I also find hacking fascinating, and love researching new methods. I'm also familiar with the tools this company lists in the JD, having implemented/supported/fixed most of them at my last job. \n\nBut there are some compliance controls I'm not super used to, and I'm not from a security background so the lingo is somewhat foreign to me. I.e. frameworks and standards like SANS Institute Critical Security Controls, ISO/EIC 27001/2,  and COBIT 5 I'm not familiar with.\n\nAny chance one of you fine redditors might be able to give me a breakdown on these, and/or tips and pointers for where I can prepare myself for the interview?",
        "created_utc": 1530053841,
        "upvote_ratio": ""
    },
    {
        "title": "How to monitor servers for vulnerable software?",
        "author": "justrelaxnow",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u3sus/how_to_monitor_servers_for_vulnerable_software/",
        "text": "How can I monitor my servers for vulnerable software? \n\nIdeally I'd run an application on my Windows and Linux machines that are able to report CVEs for software like Apache, Nginx, Memcached, Redis, MySQL, etc. But also more obscure runtime dependencies like Tesseract OCR.",
        "created_utc": 1530047870,
        "upvote_ratio": ""
    },
    {
        "title": "How monitor servers for vulnerable software?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u3piz/how_monitor_servers_for_vulnerable_software/",
        "text": "[deleted]",
        "created_utc": 1530047175,
        "upvote_ratio": ""
    },
    {
        "title": "workflow for forensic request",
        "author": "trippin315",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u3deo/workflow_for_forensic_request/",
        "text": "What we are looking to do is create a work flow if there is a supervisor/manager request for us to do investigations. What I am wondering is who the requests get to any of you that are faced with having to do this on your co-workers. Do your requests come in from HR, Legal, the supervisor/manager of the person or team? Do they go directly to someone like the ITSec manger to allow them to determine the scope and nature of the request. ",
        "created_utc": 1530044677,
        "upvote_ratio": ""
    },
    {
        "title": "Currently a Security Software Engineer, where can I expand to?",
        "author": "Darnith",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u2z0c/currently_a_security_software_engineer_where_can/",
        "text": "Hello!\n\nI'm currently a year or so into a job that I very much enjoy. I'm primarily working on security specific aspects of our applications. However, while the job is extremely cozy, I'm interested in areas that I might be able to expand to in the future.\n\nI find my current job to be almost too comfortable, I'd like something that has a bit more excitement. I've seen jobs like Incident Responder but I'm looking for some suggestions as to where I could pivot to without sacrificing my existing experience.\n\nThanks\n\n",
        "created_utc": 1530041843,
        "upvote_ratio": ""
    },
    {
        "title": "Redline Alternatives?",
        "author": "zaaaaaa1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u2fvw/redline_alternatives/",
        "text": "Are there any redline alternatives with similar capabilities/features?",
        "created_utc": 1530037864,
        "upvote_ratio": ""
    },
    {
        "title": "What do you use for Microsoft o365 Exchange to reduce Spam and phishing?",
        "author": "RobsRemarks",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u2b7p/what_do_you_use_for_microsoft_o365_exchange_to/",
        "text": "Has anyone had success with reducing spam in their Microsoft environment? We use o365 hosted exchange.  I've messed with the \"protection\" and \"malware\",\"spam filter\" settings in the Exchange admin center, with minimal change to our actual spam/phishing.  I didn't expect much from these nobs but was wondering if anyone had success with them or some other additional plugin or product.",
        "created_utc": 1530036890,
        "upvote_ratio": ""
    },
    {
        "title": "how do I decrypt an SSL/TLS pcap file?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u24tx/how_do_i_decrypt_an_ssltls_pcap_file/",
        "text": "[deleted]",
        "created_utc": 1530035604,
        "upvote_ratio": ""
    },
    {
        "title": "What's the path to ISO certification?",
        "author": "jaitsme",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8u01er/whats_the_path_to_iso_certification/",
        "text": "I am wondering, what is the best way to become ISO certified? Can it be accomplished by one person? Difference between ISO 27002 vs 27001.\n\nIn general, I am interested in hearing your stories about becoming ISO certified. Lessons learned, things you wish you knew before etc.",
        "created_utc": 1530019985,
        "upvote_ratio": ""
    },
    {
        "title": "Automating Web Application Security",
        "author": "masterofnoneds",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tzqm7/automating_web_application_security/",
        "text": "I’m trying to automate Static Code Analysis (Fortify SSC and SCA) and Dynamic Web App Testing (WebInspect) with Jenkins and JIRA.\nI just wanted to get an idea if any one has done this in their environment before? \nIf done, how does it work in your environment? \nDoes it affect the build? \nWhat environments are the tools placed in Dev/SIT/UAT?\n\nThanks.",
        "created_utc": 1530017377,
        "upvote_ratio": ""
    },
    {
        "title": "Strange link",
        "author": "__z01db3rg",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tz17u/strange_link/",
        "text": "Hey guys! So I saw a post directing to [this link](https://pastebin.com/vgYmEq03). I checked it in a virtual machine and when you access the link nothing appears. Also, the link itself looks very strange. What do you think it’s the deal with it?\n\nPS: My link is to a Pastebin where I put the strange one because it was way too long to put it here.",
        "created_utc": 1530010087,
        "upvote_ratio": ""
    },
    {
        "title": "Pentesting a Docker image",
        "author": "Thiscou",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tyuov/pentesting_a_docker_image/",
        "text": "Hello everyone\n\nI'm currently trying to find all kinds of resources about docker specific security misconfigurations, vulnerabilities and the like. \n\nThe best thing I could come up with is this:\n\nhttps://www.notsosecure.com/webinars/august_22nd_webinar/\n\nThis is a little webinar with a vulnerable ova file to practice what you learned.\n\nIf anyone has stumbled over something similar, I would appreciate a link. \n\nThanks ",
        "created_utc": 1530007930,
        "upvote_ratio": ""
    },
    {
        "title": "Create and download PDF using iTextSharp in ASP.Net",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tykzj/create_and_download_pdf_using_itextsharp_in_aspnet/",
        "text": "[deleted]",
        "created_utc": 1530004488,
        "upvote_ratio": ""
    },
    {
        "title": "Cyber Security Financial Aid Org",
        "author": "CirclesWeRun4",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8twsbu/cyber_security_financial_aid_org/",
        "text": "***EDIT: It really doesn’t matter to me what people think of this idea I just want to know if there are people out there that would use this. I can figure out raising the money and getting the resources, but I don’t want to go through all the work if no one would need it or feel comfortable using it. \n\nHey everyone, like most of you I’m constantly looking at new ways to learn material related to cyber security. Someone recommends one source, I scour for a cheaper alternative, I wind up not getting anything cause I don’t want to waste money. Then I find the PERFECT resource.... it’s thousands of dollars. \n\nFrom the people I’ve met in this community it’s apparent that many people trying to breach into this industry are struggling financially. There are loads of help from govt Orgs like financial aid and grants but those are for university students only. We all know university isn’t exactly the fastest way to get into cyber security. \n\nWhat I want to know from you all is your opinion on creating an organization run off of donations and partnerships that can be sort of a library of learning materials for those who may not be able to afford it. I have loads of books just sitting around that others could really learn from. My biggest goal would be to work for deals with online programs as some of the online courses are truly amazing. \n\nThis was just a thought I had earlier and I’d like some opinions before I really dive into the planning process. \n\n***Im not looking to profit from this in any way shape or form. I would even be willing to front money to get things started if necessary. Would just be my way to give back to the community and help those work in a field they are passionate about. ",
        "created_utc": 1529983989,
        "upvote_ratio": ""
    },
    {
        "title": "Confused about LDAP &amp; Active Directory Server",
        "author": "SmarterTogether",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tvmau/confused_about_ldap_active_directory_server/",
        "text": "So, I did some searching online and read all the wiki info and somehow I am still confused.\n\nMy understanding is LDAP is a protocol for sending and receiving messages to a directory service over a network and is part of the Windows Active Directory Software (by default?). \n\n1. Does this mean when someone refers to the LDAP server, they are technically referring to the Windows Active Directory Server? In other words, it is the same thing, right?\n2. If applications are utilizing SSO they are pointing to an LDAP server that has the Active Directory software on it. This server acts as the domain controller, correct?\n3. I read there is such a thing called LDAPS that acts as a more secure form of LDAP, why would someone utilize LDAP then and not LDAPS for user authentication?",
        "created_utc": 1529973149,
        "upvote_ratio": ""
    },
    {
        "title": "Double User Password Reset, generally a good idea?",
        "author": "itswithinmyreach",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tuu25/double_user_password_reset_generally_a_good_idea/",
        "text": "I understand this is a good practice for the KRBTGT account, but would the same logic apply to a normal user account? From what I understand the KRBTGT can only remember two passwords, the old and the new. I assume windows does the same, but surprisingly I cannot find any good materials on the matter. Thanks!",
        "created_utc": 1529966057,
        "upvote_ratio": ""
    },
    {
        "title": "Secure boot vs Live mode",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tup7u/secure_boot_vs_live_mode/",
        "text": "[deleted]",
        "created_utc": 1529964922,
        "upvote_ratio": ""
    },
    {
        "title": "What's the difference between a hash, ciphertext, and message digest?",
        "author": "scinerio",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tu1a8/whats_the_difference_between_a_hash_ciphertext/",
        "text": "I'm studying for the security+ exam and keep seeing these terms thrown around. I have yet to find a clear answer as to what the difference is. Here is my educated guess:\n\n- Hash - the result of plaintext sent through a hash function (fixed length, cannot be reverted back to the original plaintext)\n- Message digest - Seems like the same as a hash to me\n- Ciphertext - The result of encrypted plaintext (variable length, can be reverted back to original text).\n\n\nThanks for any clarification!\n\n",
        "created_utc": 1529959783,
        "upvote_ratio": ""
    },
    {
        "title": "Clarification of Zones &amp; Conduits in relation to Purdue Reference Model for ICS",
        "author": "Goforhistory",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ttyvf/clarification_of_zones_conduits_in_relation_to/",
        "text": "Hi,\n\nI am looking for clarification of the relationship between zones &amp; conduits as seen in ISA99 / IEC 62443 and the Purdue Reference Model for ICS. Maybe I even need some more basic clarification altogether, but first let me try to formulate my goal and my basic assumptions.\n\n**Goal:** I want to improve the architecture and security of a small-ish ICS network by following the zones &amp; conduits (Z&amp;C) and Purdue Reference Model for ICS (PERA) concepts. In the end, I want to get a practical naming scheme for zones / network segments that I could use when applying firewall rules.\n\n**Concerning PERA:** I understand that PERA is used to assign certain systems/devices to levels and that a higher level is regarded as unsafe in realtion to a lower level. I assume that it would be good security practice to forbid any direct traffic from a higher level (e.g. enterprise IT) to a lower level (e.g. process control) by using firewalling. The other way round would be okay, although using strict PASS rules.\n\n**Concerning Z&amp;C:** I understand that I need to perform a risk analysis in order to identify security zones that need to be separated. I also assume that security zones might overlap (e.g. that a larger zone might contain multiple sub zones) and that they might range over multiple PERA levels (e.g. that in the security zone \"Plant Active Directory\", the AD server might be located in PERA level 3, but the clients may be located in level 2).\n\nI also want to enforce that resources that are shared between systems in different levels / security zones, are placed in a DMZ. Thus, no connection may be established from a unsafe to a safe zone (e.g. a file exchange server that is used for file transfer between enterprise network and plant network).\n\nI hope my assumptions are correct so far, if not, I am happy about further clarification.\n\nNow, my problem is that I want employees to \"see\" what might be a dangerous firewall rule by applying a naming scheme that shows you what is correct and what not.\n\nAt the moment I have something like this: (L -&gt; level, Z -&gt; zone, then follows a short network segment description)\n\n* SRC: L5\\_Z001\\_ERP,    DST: L3\\_Z005\\_MES  -&gt; Not okay, since connection is established from higher level to lower level\n* SRC: L5\\_Z001\\_ERP,    DST: L3\\_DMZ\\_ABC   -&gt; Okay, since connection ends in the plant DMZ\n* SRC: L3\\_Z001\\_WS,    DST: L4\\_Z001\\_XYZ    -&gt; Okay, since connection is established from a lower to a higher level\n* SRC: L3\\_Z001\\_WS,    DST: L3\\_Z002\\_HJK    -&gt; Should be suspicious \"Am I allowed to communicate from Z001 to Z002?\"\n\n(Sorry for the ABC, XYZ and HJK descriptions, they are supposed to be place holders.)\n\nHowever, I have a few problems with this:  \n**First**, on the lower levels L0,L1 + L2, you need direct access from a higher level to a lower level. E.g. a SCADA system (L2) needs direct access to PLCs on L1.  \n**Second**, what if a zone is spread over multiple levels and is not only settled on one level?\n\nI hope my explanations are clear enough! For me these are still difficult concepts and I can't seem to wrap my head around it properly. Any help is appreciated.",
        "created_utc": 1529959297,
        "upvote_ratio": ""
    },
    {
        "title": "XXE Help",
        "author": "sephstorm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ttud0/xxe_help/",
        "text": "Attempting XXE on an application. (I have authorization to test) The client submits to the server a base64 encoded SAML Response in a POST request. So I tried the standard payload by itself and the application responds: Not base 64 encoded. So I encode it, and it responds: invalid length in char array or string.\n\nSo I took the original base64 encoded data and decoded it. It contains a destination URL, an ID, and then some other variables followed by some other characters, I cant tell if its padding or a certificate or what. It doesn't look like a signature like i've seen anywhere. Anyway, long story short, I believe if I can get my payload to be the correct length then it might be accepted by the server and the XXE will execute. Any thoughts on whats going on or how to make this work?",
        "created_utc": 1529958365,
        "upvote_ratio": ""
    },
    {
        "title": "If I am getting spam email to an e-mail address that is only registered to one place, would it be correct to assume my data has been sold/compromised?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ttrx0/if_i_am_getting_spam_email_to_an_email_address/",
        "text": "[deleted]",
        "created_utc": 1529957871,
        "upvote_ratio": ""
    },
    {
        "title": "Suspicious after opening an an email, security risk?",
        "author": "Terrox",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tsjg1/suspicious_after_opening_an_an_email_security_risk/",
        "text": "I'm using Mozilla Thunderbird as a email client and Earlier this month I got a mail that I later confirmed was a bitcoin scam mail (but not marked by thunderbird). I had removed the mail to the trash folder and that's where the thing that got me suspicious happened. When i went to the removed folder and saw the mail there I noticed it had a \"this mail has an attachment\" symbol which I though was weird since I didn't see anything previously when viewing the email in the normal inbox. I clicked on it again while it was in the removed folder and the attached icon disappeared.\n\nNow this all happened rather quick and I didn't memorize the details before I was suspicious, so it could have been that i saw something wrong. But what I'm wondering is if I could have gotten infected or how big the chance is that something happened. I've already scanned my pc with avira and nothing came up.\n\nI am using Windows 7, Thunderbird 52.8.0, IMAP with Hotmail/outlook. I have already asked in thunderbirds forum, but did not get a response there.",
        "created_utc": 1529948754,
        "upvote_ratio": ""
    },
    {
        "title": "Tabletop Exercises",
        "author": "DeepOrdinary",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ts8jt/tabletop_exercises/",
        "text": "What are some of the best cyber incident senerios tabletop exercises you've done? Or what senerios do you think would be good for a tabletop? ",
        "created_utc": 1529946570,
        "upvote_ratio": ""
    },
    {
        "title": "College Website Generating Transcripts For Other Students",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8trq6u/college_website_generating_transcripts_for_other/",
        "text": "[deleted]",
        "created_utc": 1529942929,
        "upvote_ratio": ""
    },
    {
        "title": "Now what?",
        "author": "king_python",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tr6tm/now_what/",
        "text": "Hi guys! I recently got my degree in CS and cyber security specialization. I want to apply for jobs in the security field. However, I just don’t know where to begin... \n\nThe only job title I know would be something like security engineer or site reliability engineer or pen tester. \n\nIs there a list of jobs that would require security knowledge? Thank you so much! ",
        "created_utc": 1529938828,
        "upvote_ratio": ""
    },
    {
        "title": "Breaking into a router.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tqkxd/breaking_into_a_router/",
        "text": "[deleted]",
        "created_utc": 1529933920,
        "upvote_ratio": ""
    },
    {
        "title": "Cisco \"well-known\" loopback?",
        "author": "CatsAndIT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tqgnf/cisco_wellknown_loopback/",
        "text": "Hello r/AskNetsec!\n\nJust curious, as I know that VLAN1 is essentially a well-known \"no-no\", but does the same hold true for loopback interfaces?\n\nThanks!",
        "created_utc": 1529932895,
        "upvote_ratio": ""
    },
    {
        "title": "Need help finding IIS/ASP.NET web root",
        "author": "aphraz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tp9mm/need_help_finding_iisaspnet_web_root/",
        "text": "(Disclaimer: Newbie here)\nFound an interesting vulnerability in ASP.NET application during a blackbox pentest that allows arbitrary file upload (that could lead to RCE). But in order to achieve RCE the attacker needs to know the exact path to web root and that's where I am currently stuck. So just wanted to know if there's any way I can find web root? the vulnerability itself is quite serious but want to demonstrate the maximum possible impact. Need expert advice on this.\n\nThanks  ",
        "created_utc": 1529920490,
        "upvote_ratio": ""
    },
    {
        "title": "openvas \"full and fast\" is safe for scanning production servers?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tojfn/openvas_full_and_fast_is_safe_for_scanning/",
        "text": "[deleted]",
        "created_utc": 1529910794,
        "upvote_ratio": ""
    },
    {
        "title": "I just got PeerBlock and am seeing weird activity",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tn4te/i_just_got_peerblock_and_am_seeing_weird_activity/",
        "text": "[deleted]",
        "created_utc": 1529895021,
        "upvote_ratio": ""
    },
    {
        "title": "Help with China border background checks",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tlmdo/help_with_china_border_background_checks/",
        "text": "[deleted]",
        "created_utc": 1529880555,
        "upvote_ratio": ""
    },
    {
        "title": "[Need help] I'm lost in the jungle of security software.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tipyw/need_help_im_lost_in_the_jungle_of_security/",
        "text": "[deleted]",
        "created_utc": 1529856008,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any free online courses for enthusiasts without computer background that teaches how to detect and gather evidence of hacking and harden the system against such hacking?",
        "author": "powerofinformation",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tig20/are_there_any_free_online_courses_for_enthusiasts/",
        "text": "I am looking for a free online course like a MOOC (or a video series) that is aimed at enthusiasts without any technical/computer background and teaches them how to detect hacking attempts on their computers and mobiles (whether its a government hacker or a non-governmental hacker), gather evidence of the hacking and the identities of the people behind the hacking and harden and clean the system against such hacking. \n\nObviously totally ordinary lay people will not be able to grasp such a complex and vast topic. Therefore I am actually looking for a course that is geared towards enthusiasts who are willing to spend the time to learn even if it takes awhile. Although the course should be explained in the easiest way possible. \n\nPS: Sorry for the wordy sentences. English is not my native language. ",
        "created_utc": 1529853410,
        "upvote_ratio": ""
    },
    {
        "title": "GIAC GSEC Test",
        "author": "sg4rb0sss",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8tig1e/giac_gsec_test/",
        "text": "I am trying to find where I can just book the GSEC exam on the giac website.  However I only seem to find an option to register, which cost $1600 and looks like it's going to give me all the material and what not.  I am self-taught and just want to book the exam.  So what is the price, and how do I sign up?",
        "created_utc": 1529853406,
        "upvote_ratio": ""
    }
]