[
    {
        "title": "What now: network programming or Linux programming?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97wftb/what_now_network_programming_or_linux_programming/",
        "text": "[deleted]",
        "created_utc": 1534455511,
        "upvote_ratio": ""
    },
    {
        "title": "Considering a move from Security Engineer to Pentesting Consultant; advice?",
        "author": "aphaelion",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97w6t8/considering_a_move_from_security_engineer_to/",
        "text": "I came into InfoSec from a ten-year long developer background. I have always had security as a side hobby, but I did not work to make it into a career until recently. I applied to a few infosec jobs, but lacking any professional security experience, I found it was difficult to get my foot in the door.\n\nBecause of this difficulty, I studied for and received my OSCP certification last year (which was an INCREDIBLE experience - I learned a TON and HIGHLY RECOMMEND it!).\n\nWith that certification in-hand, I was able to obtain a job as a Security Engineer at a Fortune 500 company. I have just hit my year mark in that position, and although I really like it there, I am interested in utilizing/expanding on what I learned during my studying for the OSCP (in other words, moving over to pentesting/red-team).\n\nLast month I blasted out my resume to a bunch of companies to see what was available, and I have passed the first couple of levels of interviews at a few companies (and I think I have done decently on the accompanying \"mini-pentest\" tests which they have given to me).\n\nSo far I have no firm offers, but the latest one I have interviewed with seems genuinely interested in me, and I anticipate at least some offer from them in the near future.\n\nNow I'm getting a little nervous. Assuming I get an offer (which may be naive - but hey, I'm being optimistic!), I'm wondering if there are any \"gotchas\" about getting into the red-team side of things, that a newcomer like myself doesn't usually think of. I have zero experience in redteam/pentest operations beyond my OSCP experiences (and a few isolated times during my Security Engineer job where I got to run some redteam-type POC for some vulnerabilities), and even very little experience on the blue side as well (as mentioned above, I'm only just now past my 1-year mark at my current company).\n\nI'm just wondering if there are any \"gotchas\" to moving to a redteam/pentest role which I maybe have not considered. I like my current position, but the appeal of the pentesting side is that I suspect working in that realm for a few years would give me great experience/knowledge, *even if I decide later to come back to blue side!* I consider myself lucky to have gotten the job I currently have with such limited experience.\n\nSorry for the wall of text. I'm just anxious about making such a big change. I have a big family, and this opportunity would require me to move across the country. I'd hate to get there and be like, \"Man, this was really a mistake\" - especially since I may have a hard time getting back into another Security Engineer position if I decide I do not like it.",
        "created_utc": 1534453658,
        "upvote_ratio": ""
    },
    {
        "title": "Recent Drug Use",
        "author": "obviousthrowaway9912",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97vffg/recent_drug_use/",
        "text": "Marijuana usage 2-3 times around \\~ 12 months ago give or take a month.\n\nThe intern position is a fed agency with TS.\n\nThe general vibe I get from everyone is no drug usage of any kind after or within 12 months of X period, instant disqualifer.\n\nI'm  not sure if that period is the time you send your application for the  job? When you sign on your COE? or when you fill out your SF 86? I keep getting conflicting answers.\n\nI'm put into  this dilemma where my past experimentation is borderline  acceptable/unacceptable for mitigation time (according to the \\~12 month  'rule') depending on what qualifies the start date.\n\nI have no other drug usages what so ever, nothing devastating in foreign influences/finances/personal conduct, etc.\n\nI'm of course not gonna lie and will ask the FSO for advice, but just curious on your thoughts.",
        "created_utc": 1534448237,
        "upvote_ratio": ""
    },
    {
        "title": "IF I MAKE A voip CALL FROM A CAFE IP .. And they know the cafe ip .. COULD THEY KNOW THE IP I USE IT WHEN i INSTALLED THE VOIP APP ON MY PHONE or any other ip ( i MEAN OTHER IPs i USE IT WHILE THE APP WAS ON MY PHONE BUT i WASNT USE IT ?",
        "author": "mzn1990",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97uf17/if_i_make_a_voip_call_from_a_cafe_ip_and_they/",
        "text": "to make it easier .. I instaled voip app in my home with my real ip .. then I went to cafe .. and make a call from my voip app using the cafe wifi .. I know they can know the ip when I calling .. they will know the cafe ip .. but is there a way to know my home ip ?\n\nmaybe they can call the app company and tell them about the call I made so they ask for the ip I use it when I installed the app ?\n\nP.S : I mean by they .. people who have the goverment power . they have police and ISP  ",
        "created_utc": 1534441295,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any kind of standard format for making an inventory list of devices on your network?",
        "author": "hijinked",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97t6vo/is_there_any_kind_of_standard_format_for_making/",
        "text": "I am working on a software project that is going to involve device inventories, so I was wandering if there are any standard file types for this kind of information that I should support.",
        "created_utc": 1534432803,
        "upvote_ratio": ""
    },
    {
        "title": "Question regarding career to those who work in the security field.",
        "author": "QBab",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97sim0/question_regarding_career_to_those_who_work_in/",
        "text": "Hi! \n\nI am currently starting on my fourth out of a five year run at a MSc in Networks and Information Security at %some university. My ultimate goal is to become a penetration tester. However, I have been thrown a curve ball i could not foresee. Read on for full story, or check TL;DR. \n\n//Backstory:   \nI was a summer intern this year at a small (50 employees) but pretty amazing IT-consultancy office (ranked 7th best in Europe). They also focus a lot on creating their own startups, and invest a lot of money in these.  It was one of the most fun summers I've had and I got offered a contract with a start date of august 2020, very good starting salary and lots of perks. I feel very lucky to have gotten this offer. \n\n//The problem: \n\nThis job doesn't really involve any security work, instead they do full stack development for customers and the aforementioned startups. I kind of want to accept the offer, thinking that having solid programming skills can be useful for a potential security job later down the road. But again, I also don't want to accept without at least having tried a relevant job in the security field first. Also, I'm concerned it doesn't look that good to graduate with a security degree, then working a couple of years as a developer before finally applying for a security job.   \n\n\nTL;DR: Doing a MSc in information security, want to become a pentester, had a really fun summer as a not-security related developer, was offered the job. Wondering if professional programming experience would be beneficial in the security field?",
        "created_utc": 1534428034,
        "upvote_ratio": ""
    },
    {
        "title": "Intel Online Connect",
        "author": "Compliant_Bear",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97s1yk/intel_online_connect/",
        "text": "I use a Yoga 920 and I've gotten multiple prompts about \"Intel Online Connect\" that can be used as biometric two factor for sites such as Google and PayPal.  How secure is this? \n\nI'm imagining biometric data leaving the device, though I doubt that's how this works, is not a secure method at all.  Can anyone give me a primer on how this system works?",
        "created_utc": 1534424290,
        "upvote_ratio": ""
    },
    {
        "title": "Problem accessing HTTPS over SSH tunnel",
        "author": "Goforhistory",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97rurj/problem_accessing_https_over_ssh_tunnel/",
        "text": "I am trying to access a web server (HTTPS, self-signed certificate) behind a firewall over an SSH remote access solution. However, either my browsers (tried Firefox and Chromium) have issues with this or I am missing something different. Thus, I'm asking you guys for help.\n\nI have an SSH local forwarding to the target server that I use in the browser by accessing `https://127.0.0.1:6789`, which is forwarded to the target server to port 443. I am certain that the forwarding works, as I can see the incoming connection using `tcpdump` on the target host.\n\nLet's assume the (internal) FQDN of the target server is `target.server.com` which is also the name of the virtual host in the apache2 reverse proxy configuration on the same host. It is also the common name in the certificate.\n\nWhen I connect to `https://127.0.0.1:6789` for the first time (e.g. \"forget\" history entry and remove certificate exception in FF), the browser tells me the usual \"this is not safe\" story because of the self-signed certificate. I add an exception, since it is my own host and proceed to the website. The loaded website looks incomplete as some images are missing. In the FF debug console I can see that those images have the URL `https://target.server.com/some/path/to/image.png` while the rest of the elements get loaded like this: `https://127.0.0.1:6789/some/web/object`\n\nThen, when I try to access a sub page or even login, FF completely fails to load the page with the message:\n\n&gt;Secure Connection Failed  \n&gt;  \n&gt;The connection to `127.0.0.1:6789` was interrupted while the page was loading.  \n&gt;  \n&gt;The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.  \n&gt;  \n&gt;Please contact the website owners to inform them of this problem.  \n&gt;  \n&gt;\\[Try again\\]\n\nThe only choice I get is to try again, which then won't work. It won't even load the first web page that just recently worked. When I try to reload, I see using `tcpdump`, that my client sends a TCP RST to the target server.\n\nNow I don't fully understand what's going wrong here. I guess it might have something to do with the self-signed certificate not having the correct common name (`target.server.com` instead of `127.0.0.1`) or with the apache reverse proxy setup (wrong name of virtual host?).\n\nDoes anyone have an idea? I am bound to use the SSH local forwarding method. Thank you in advance, any help is appreciated.\n\n**Edit with solution:** I wasn't able to fix it by only using a local forwarding, even after I had imported the needed certificates into Firefox and Chromium. I'm afraid I don't exactly know that the problem might be, but my best guess would be that the browsers somehow refused the connection because the accessed URL `https://127.0.0.1:6789` didn't match the common name of the cert(s). Not even adding an entry to the `/etc/hosts` file fixed this. The only reaction I got from the browser was, that I wasn't even remotely able to access `https://target.server.com:6789` . I always got the error message \"Secure Connection Failed\".\n\nHowever, I finally was able to reach the server without a complaint by using a SSH socks proxy. The way I did this was to open an SSH connection to the server via\n\n    ssh -C -D 9888 user@server -p 6787\n\n\"server\" might be 'localhost', if you want to connect via existing SSH forwarding.\n\nThen go into the Firefox network settings, enable 'manual proxy configuration' and add\n\n    SOCKS Host: 127.0.0.1  Port: 9888\n\nMind: All your Firefox web traffic will then go over this socks proxy!\n\nI also had to enable socks remote DNS in firefox `about:config`\n\n    network.proxy.socks_remote_dns  -&gt; true\n\nThen call the desired URL in the browser:\n\n    https://target.server.com\n\nNote that this time, you don't need to provide your local forwarding port at the end.\n\nI hope this might help someone else.",
        "created_utc": 1534422591,
        "upvote_ratio": ""
    },
    {
        "title": "Looking to make a security application for fun.",
        "author": "the101pope",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97rcao/looking_to_make_a_security_application_for_fun/",
        "text": "I'm a beginner in this field, and I have a lot of free time through the summer and I'm wondering if you can suggest me some easy security solutions (applications) I can make for fun.  \nPS: I'm good with a few languages (Python, Java, and Assembly) as well as some basic networking.  \n",
        "created_utc": 1534417657,
        "upvote_ratio": ""
    },
    {
        "title": "Pen testing consulting for chrome apps &amp; extensions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97r7ft/pen_testing_consulting_for_chrome_apps_extensions/",
        "text": "[deleted]",
        "created_utc": 1534416232,
        "upvote_ratio": ""
    },
    {
        "title": "Can't bypass SSL restrictions on Android app",
        "author": "michael1026",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97r1g3/cant_bypass_ssl_restrictions_on_android_app/",
        "text": "Trying to intercept traffic on an Android app and I've gone through hell.  Other apps work fine.\n\n1. Tried simple Burp Suite setup - Connection error\n2. Learned to use Objection, reinstalled app using modified APK, ran the explorer with `android ssl pinning disable`\n\nI've tried on two different devices, one physical, one virtual. Burp is giving me an alert \"Client failed to negotiate SSL connection with ...\"\n\nDoes this mean it's doing its own SSL verification using a built in list of certificates? ",
        "created_utc": 1534414343,
        "upvote_ratio": ""
    },
    {
        "title": "sql injection detection machine learning",
        "author": "trapeye",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97qfoo/sql_injection_detection_machine_learning/",
        "text": "how to implement machine learning in modsecurity or mod security crs?",
        "created_utc": 1534407050,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best ways to secure home wifi",
        "author": "FVIC",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97pq9n/what_are_the_best_ways_to_secure_home_wifi/",
        "text": "So I’m looking at securing my home wifi and I was wondering what steps everyone takes to further the security of their home networks. I want to make a big list of things that can be done and figured that this would be a great place to ask",
        "created_utc": 1534398993,
        "upvote_ratio": ""
    },
    {
        "title": "Help! The company I work for was hacked - are my personal devices at risk?",
        "author": "Throwawaymycheese",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97p6o0/help_the_company_i_work_for_was_hacked_are_my/",
        "text": "Sorry in advance, I’m using a throwaway account and being vague to protect my identity and that of the company I work for, but I was hoping this community could let me know how at risk I am in what seems to be a relatively serious situation. \n\nI work remotely for a midsize company that was very recently attacked by ransomware. It’s effectively shut the company down and I received a somewhat concerning email suggesting that all of our systems have been affected. We’ve been asked to refrain from logging into any company systems, including those stored in cloud servers. \n\nSo I’m off from work for the time being, but a warning from my company suggested that personal devices connected to company systems may be affected. I work remotely so I’m not worried about having connected to their WiFi, but should I be concerned if I’ve logged into company Cloud services and email servers from my personal devices? I use gmail as a client to receive work emails on my personal phone - it’s apparently okay for us to log into gmail - should I play it safe and remove the inbox from my phone or is it fine? Are there any precautions I should take to ensure my personal devices are okay? While I have everything backed up, I do have pretty important data on my personal laptop that I’d like to keep safe. \n\nTypically, I’d ask my IT team for help on this, but they seem to have their hands full right now and I’m not sure if this is something I should act quickly on or not. Any help or pointers would be appreciated. Thanks!",
        "created_utc": 1534393297,
        "upvote_ratio": ""
    },
    {
        "title": "Social Engineering premises access in foreign country",
        "author": "Bcthrowaway198",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97ozux/social_engineering_premises_access_in_foreign/",
        "text": "Hey guys,\n\nHoping to pick your brains here. We've been hired to attempt to gain access (and probably plant a Kali box, swipe a key card or leave some flash drives laying around) to this Canadian companies' Norwegian daughter company. \n\n\nNow we've done several of these engagements on Canadian soil, and usually succeed, but now we're dealing with this huge language barrier that renders our normal strategies useless. Any ideas? Thanks! \n\n",
        "created_utc": 1534391529,
        "upvote_ratio": ""
    },
    {
        "title": "iOS app run-time instrumentation help (Swift)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97omwn/ios_app_runtime_instrumentation_help_swift/",
        "text": "[deleted]",
        "created_utc": 1534388234,
        "upvote_ratio": ""
    },
    {
        "title": "I've created a website that might be politically sensitive. What can I do to protect my website from DDoS attacks and also personal privacy attacks?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97mann/ive_created_a_website_that_might_be_politically/",
        "text": "[deleted]",
        "created_utc": 1534368972,
        "upvote_ratio": ""
    },
    {
        "title": "What do you use to keep your own documentation?",
        "author": "Sudneo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97le4s/what_do_you_use_to_keep_your_own_documentation/",
        "text": "Hello, I am struggling to pick a tool, so here I am asking you.\nI think that everyone sooner or later faces the challenge of having to write down procedures/commands/info encountered while learning/experimenting new stuff, and I wonder, what do you use to save these and maybe even have them synchronized across multiple devices?\nI have few options:\n\n* Keepnote, basic, maybe versioned in git/hg repo\n* Mediawiki hosted somewhere (NAS?) \n* Markdown repo?\n* Asciidoc?\n* Sphinx?\n \nI like a lot the interconnected structure of the wiki, but I find it cumbersome to write. What did it work best for you?\n\nEDIT:\n\nThank you everyone for your answers! It's incredible to see so many different tools and ways to keep your own note/documentation/info, it is actually quite an underestimated problem that for me lead often to do things without documenting them and forgetting them quite fast.\n\nI will have a look at all the stuff you mentioned :)",
        "created_utc": 1534362429,
        "upvote_ratio": ""
    },
    {
        "title": "The place I work at isn't even doing the basics",
        "author": "Netsecdud3r",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97kqla/the_place_i_work_at_isnt_even_doing_the_basics/",
        "text": "The place I am working at isn't doing the basics. Like not even SMBv1 is disabled. Patched for wannacry sure, but SMB1 is not disabled. Unpatched systems and applications everywhere. My concern is that there are a lot more of the basics not being done right.\n\nI'm at ground zero with literally no empowerment to make changes in production and those who are running the show are ignorant or absent or just don't care. \n\nI've tried my best to make change occur but it's not happening. What would you do in this scenario?",
        "created_utc": 1534357621,
        "upvote_ratio": ""
    },
    {
        "title": "Skype for Desktops",
        "author": "unm3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97kav7/skype_for_desktops/",
        "text": "Good day community,\n\nI have a question regarding ports that Microsoft Skype uses.\n\nOn their support page, it says that these following ports should be open.\n\n•443/TCP\n\n•3478-3481/UDP\n\n•49152-65535/UDP + TCP\n\nI have opened the following ports but it is still being blocked on random ports such has 16030, 32126, 20978...\n\nAlso, they are not providing destinations.\n\nAnyone made this working or has any idea? I am trying to not use any any...\n\nThanks!\n\nEdits: Latest version of Skype for Windows",
        "created_utc": 1534354610,
        "upvote_ratio": ""
    },
    {
        "title": "Burp Suite tutorials?",
        "author": "Br1ghtStar",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97jtqa/burp_suite_tutorials/",
        "text": "Anyone have a favorite set of youtube or other resource for getting up to speed with Burps Suite quick? Pro version if possible.  My job role/scope changed a bit and I'll need to be adding this tool to my kit over the next few weeks.",
        "created_utc": 1534351345,
        "upvote_ratio": ""
    },
    {
        "title": "What are risks in using a not-reputable browser?",
        "author": "SoftDevice3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97jflb/what_are_risks_in_using_a_notreputable_browser/",
        "text": "The only one i’m aware of is the browser provider can collect &amp; use your data. Are there other risks such as vpn or https encryption compromised etc.?",
        "created_utc": 1534348722,
        "upvote_ratio": ""
    },
    {
        "title": "Network Detective assessment software alternatives for MacOS",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97jaeq/network_detective_assessment_software/",
        "text": "[deleted]",
        "created_utc": 1534347681,
        "upvote_ratio": ""
    },
    {
        "title": "Starting PenTest as a Hobby",
        "author": "neoncomrade",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97iq54/starting_pentest_as_a_hobby/",
        "text": "Hello everybody, \nFirst of all, it is not an average “I want to hack the world” post. \nSecond I don’t want to do this for a living or as a job, I have a different source of income at the moment.\nThird and the most important I want to do this for myself.\n\nI want to learn the art of pentesting for me , to secure my home and my internet browsing on all devices. I consider this a very important thing in 2018 and a “must” . \n\nI have basic knowledge of linux and coding , but I need a guide, with so much resources available it’s hard to know where to start from. \nThere are a lot of advices like start learning python or start learning arch or unix but I want a guide for pentesting, not for displaying “hello world” . \n\nI know there aren’t any shortcuts, I don’t care if the path is long, I just want a guide something to lay on , to keep me motivated to work daily by offering me the satisfaction that I work for my goal .\n\nThanks in advice ! Don’t hate a beginner ! ",
        "created_utc": 1534343599,
        "upvote_ratio": ""
    },
    {
        "title": "How would you verify an electronic receipt if you were offline?",
        "author": "goppox",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97i4hk/how_would_you_verify_an_electronic_receipt_if_you/",
        "text": "Hi\n\nIt just struck me today if it's possible at all to verify a customer's electronic receipt if the merchant has no access to another device. A customer came into our shop today asking to pick up their order after showing us a PayPal receipt. Coincidentally our network was being upgraded, so we couldn't go online to check the transaction. We didn't want to annoy the customer and just took his word for it. Thankfully, it was indeed authentic.\n\nThis got me thinking: Is it possible to verify if an electronic receipt is authentic? Could a payment app (on the client's device) be extended to provide the function for proving receipt authenticity to the merchant when the merchant has no access to another device? Sure, the payment processor could give each merchant a long list of pairs of private values where one value is the input challenge and one the expected response. If the app correctly produces the expected output response for an input challenge, then the client's installation of the app is authentic and is not compromised. But I'm certain most merchants wouldn't bother storing the (physical) list.\n\nIs there \\*potentially\\* a way for payment apps to be extended such that it can be simple for the merchant to set the challenge and check the response using the client's (untrusted) device?",
        "created_utc": 1534338841,
        "upvote_ratio": ""
    },
    {
        "title": "I AM LOOKING FOR CHAT APP THAT Uncontrollable BY ISP OR GOVERNMENT ?",
        "author": "mzn1990",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97hna0/i_am_looking_for_chat_app_that_uncontrollable_by/",
        "text": "",
        "created_utc": 1534334445,
        "upvote_ratio": ""
    },
    {
        "title": "For microservices to call each other do we need a WAF solution ?",
        "author": "rifaterdemsahin",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97gua9/for_microservices_to_call_each_other_do_we_need_a/",
        "text": "Our microservices are going to call each other in the scenario below\n\nservice a wants use service b\n\n1)They go to internal dns ( as they are in internal load balanced environment secured from public networks )\n\n2)DNS resolves to WAF ( as WAF is used as an application gateway )\n\n3)WAF resolves to ILB location ( ILB needs to be pointed with IP plus domain to divert traffic to the right app as we are using ASE in Azure )\n\nASE : Application service environment\n\n[https://docs.microsoft.com/en-us/azure/app-service/environment/create-ilb-ase](https://docs.microsoft.com/en-us/azure/app-service/environment/create-ilb-ase)",
        "created_utc": 1534324904,
        "upvote_ratio": ""
    },
    {
        "title": "EndPoint-Finder: Finds the End-Points in JavaScript files",
        "author": "tarunkant",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97gj9a/endpointfinder_finds_the_endpoints_in_javascript/",
        "text": "During reconnaissance(recon) process it is very helpful to get idea of all end-points of JavaScript files. These days you have seen that the JavaScript files having unformatted code, This tool will extract all that links in those files.\n\nsource code can be found here: [https://github.com/tarunkant/EndPoint-Finder](https://github.com/tarunkant/EndPoint-Finder)\n\nBlog post on the same can be found here: [https://spyclub.tech/2018/blog-on-endpoint-finder/](https://spyclub.tech/2018/blog-on-endpoint-finder/)",
        "created_utc": 1534320772,
        "upvote_ratio": ""
    },
    {
        "title": "Endpoint Protection Reviews",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97f7u2/endpoint_protection_reviews/",
        "text": "For home use I usually check out AV Comparatives or AV Test to do my research.  The latest reviews don't evaluate Sopho's Home Premium edition.  Are there any other sites to get honest evaluations?  Sophos is the only one I've found that will let me properly exclude directories &amp; files for my PowerShell tools used for offensive testing.",
        "created_utc": 1534305677,
        "upvote_ratio": ""
    },
    {
        "title": "Unsure where to get started in security",
        "author": "railforte",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97ef98/unsure_where_to_get_started_in_security/",
        "text": "Good evening, everyone.\n\nAs the title says, I'm hoping to find some guidance regarding getting started in security. I have zero work experience, and am graduating in December with a degree in Information Technology, with my concentration in cybersecurity.  Am I going to have to go the help desk route? \n\nAnyway, I'm looking for guidance regarding certifications. Should I go the Cisco route? Maybe start with ground level Comptia Security+ type stuff?  I know a lot of the heavier security certifications require work experience, so I can't exactly obtain those just yet. Any advice is greatly appreciated !",
        "created_utc": 1534298551,
        "upvote_ratio": ""
    },
    {
        "title": "What are some NetSec-related projects to get started with using RaspberryPi?. Any good reads that i can check out?.",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97dnwx/what_are_some_netsecrelated_projects_to_get/",
        "text": "",
        "created_utc": 1534292226,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good books for using Python with RaspberryPi?. Any recommendations?.",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97dmy6/what_are_some_good_books_for_using_python_with/",
        "text": "I am starting to work with Raspberry Pi products and boards, mainly focusing on using Python. \n\nAre there difficulties working the two together?\n\nApologies if this isnt the right place to ask or if its unrelated.",
        "created_utc": 1534292022,
        "upvote_ratio": ""
    },
    {
        "title": "Next role to work in for career progression?",
        "author": "netseczthrowaway",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97d1k6/next_role_to_work_in_for_career_progression/",
        "text": "Hey asknetsec, I'm in a position where I have an opportunity to transfer teams at my organization. I work for a DoD agency and I wanted to get some opinions on the choices I have.\n\nThe first job would be for the identity and access management team. It sounds a lot like provisioning and deprovisioning resources for ISSMs at subordinate commands and organizations. The current person said the work closely aligns to the ITSM and ITIL process.\n\nThe second job would be for a blue team. It would consist of evaluating the architecture of our networks and hardening them for increased security. I would get to work with python for scripting and log analysis.\n\nI'm pretty new to infosec and have worked in information assurance for the last two years. My goal is to get my CISSP and move from the government to the private sector (finance, healthcare, etc..) in three years. I would like to progress my career more on the management side of security; I don't necessarily want to stay in technical roles. Both jobs actually sound pretty awesome to me and there may not be a bad choice here. Any thoughts on which option would align more closely to my future goals? Which option would open more doors for future jobs outside the DoD? ",
        "created_utc": 1534287225,
        "upvote_ratio": ""
    },
    {
        "title": "Problems identifying disassembly errors",
        "author": "quantum_researcher",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97cjku/problems_identifying_disassembly_errors/",
        "text": "I'm doing research on disassembly methods and their errors, and I'm having a very serious problem trying to more correctly identify where they may or may not be false negatives by different tools. Part of the most difficult issue is, the only ground truth information is the function entrances as reported by debugging symbols. Just getting that correct does not indicate that there are no false negatives. And using a best effort reaching search to try to find all descendants is not guaranteed to be complete - the reverse engineering community needs a patch of a compiler to provide much better quality ground truth.   \n\n\nSo far as I can tell with just that information, objdump (linear sweep) doesn't appear to get any false negatives (that is, an instruction intended by the compiler, but missed by the disassembler), but also is rather blind in that what it returns is a blob of text. This is after an exhaustive test over the /bin, /usr/bin and a binary corpora consisting of over 2k linux binaries. But, according to the literature disassembly is undecidable and linear sweep should have these critical errors. At the same time, there was a publication that reputed to show that linear sweep was the best out of years of research on benign binary disassembly - and I don't think the research community would perform research that isn't necessary. In fact, that same publication got flack from some researchers because it's ground truth mechanism was in fact linear sweep under the hood. Hopefully others can see the discrepancy between the publications, past research effort, and the potential of inadequate ground truth mechanisms as being a sufficient motivation to investigate this further.  \n\n\nDoes anybody know of a more robust ground truth method that might include an ability to acquire a complete list of all addresses of intended instructions? If not, does anybody have an example, from a real binary, of a false negative error made by linear sweep?",
        "created_utc": 1534283389,
        "upvote_ratio": ""
    },
    {
        "title": "iPhone Hacked Desperately Need Help",
        "author": "DoesItMatter358",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97bz1e/iphone_hacked_desperately_need_help/",
        "text": "Hi,\n\nI need help. My iPhone has clearly been hacked and rerouted at the root level. Even when I attempted to completely factory reset my phone it doesn’t fix the issues, I don’t have the ability to explore root files with any apps, my web traffic is being redirected etc. when I have gone to Apple in the past they look at me like I have 10 heads. Can anyone help me or tell me where I should go to get this issue resolved? I’m so sick of this.",
        "created_utc": 1534279259,
        "upvote_ratio": ""
    },
    {
        "title": "Announcing Gopherus: Generate Gopher payload for exploiting SSRF and lead to RCE, on SSRF vulnerable sites",
        "author": "tarunkant",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97bbue/announcing_gopherus_generate_gopher_payload_for/",
        "text": "Link to the source: [https://github.com/tarunkant/Gopherus](https://github.com/tarunkant/Gopherus)\n\nI also wrote a blog post on the same: [https://spyclub.tech/2018/blog-on-gopherus/](https://spyclub.tech/2018/blog-on-gopherus/)",
        "created_utc": 1534274683,
        "upvote_ratio": ""
    },
    {
        "title": "is web pentesting just looking for known vulnerabilities (searching for sql injenction ..etc *in general*)",
        "author": "shark_0",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97b6kd/is_web_pentesting_just_looking_for_known/",
        "text": "i know it involve more steps but im asking if the all process does involve finding new vulnerability besides the common vulnerabilities \n\nin other way where does the solving problem part came on it.\n\nthx.\n\nim new in this subject so dont get hard on me",
        "created_utc": 1534273654,
        "upvote_ratio": ""
    },
    {
        "title": "(Throwaway) help with social media",
        "author": "madmaners",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97aqvi/throwaway_help_with_social_media/",
        "text": "I am going off to college soon and want to make sure all my social media is clean.  I have a facebook account i created years ago with a bs email address.  I know the password, but cant remember the dam email address.  I do have the facebook profile though.  \n\nIs their any way of finding my email address linked to the account?  I suffer from general anxiety dissorder, and this situation is not helping me right now.\n\nAny advice welcome.",
        "created_utc": 1534270628,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions for Password Manager",
        "author": "Undwyn",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97aiqu/suggestions_for_password_manager/",
        "text": "I'm trying to help my parents out I won't even tell you about their current system, but they run a small business and I'm trying to get a password manager for them so that their business is more secure. What I'm looking for:\n\n\\-Easy for less computer savy people to use\n\n\\-Can be used across multiple devices\n\n\\-Can be accessed through the cloud for remote access for when they travel\n\n\\-Strong Encryption\n\nI'm doing my own research but I thought I'd throw a question out here see if I could get some advice from someone with more experience since I don't really have the background myself to tell if a review is bs or not.\n\nRight now I'm looking at this: [https://www.tomsguide.com/us/best-password-managers,review-3785.html](https://www.tomsguide.com/us/best-password-managers,review-3785.html)",
        "created_utc": 1534269053,
        "upvote_ratio": ""
    },
    {
        "title": "New Spectre like vulnerabilities found (L1TF)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/97a12i/new_spectre_like_vulnerabilities_found_l1tf/",
        "text": "[deleted]",
        "created_utc": 1534265603,
        "upvote_ratio": ""
    },
    {
        "title": "Scanning 3rd party vendor code",
        "author": "coolcalmfuzz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/979jv0/scanning_3rd_party_vendor_code/",
        "text": "Hi all, \n\nNot sure if this is the correct subreddit between netsec / appsec. I wanted to throw it out there to see what processes (if any) have been implemented for assessing an applications security risk. \n\nDo you :\n - Require the vendor to fill out a questionnaire, and review the potential findings to see if the applicable risks are acceptable?\n - Utilize any SAST, DAST, RASP tools to scan the source code, bin, exe files, or do you rely on an external vendor handling these requests?\n - If a vendor declines giving you the source code, do you have them take it to a third party to perform an assessment? That way if it comes back clean... an outsider can certify the results are good.\n - How many out there have processes in place that give vendors a timeline to mitigate known security vulnerabilities?\n\nThanks in advance!",
        "created_utc": 1534262229,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have or know where to get a comprehensive SOC Skills Matrix Template I can use to start indexing my employee's skill level. I desperately need one to identify training opportunities for both analysts (IR) and tools engineers (FW, Proxy, SIEM, etc)",
        "author": "nuubles",
        "url": "https://www.reddit.com/r/AskNetsec/comments/978vx1/anyone_have_or_know_where_to_get_a_comprehensive/",
        "text": "",
        "created_utc": 1534257442,
        "upvote_ratio": ""
    },
    {
        "title": "When hit was a true Brute Force Alarm",
        "author": "SOC_uintheface",
        "url": "https://www.reddit.com/r/AskNetsec/comments/978vvj/when_hit_was_a_true_brute_force_alarm/",
        "text": "Hey /r/AskNetsec-ians,\n\nI have been working in a SOC for the past 3 month and have been curious about Brute Force Alarms. We get them pretty often, and I was wondering what a TRUE brute force would look like? For the most part I just conduct a pivot of the users activity to see what that person has been doing since he/she has logged in and for the most part have never seen concerning activity.\n\nHowever, I was wondering if someone was actually trying to brute force a PW for an account, what would it look like in the SIEM? Would it be 100+ logs of \"User Logon Failue: Bad Password\" attemps in the span of literally 2 seconds? Would that concern the more experienced SOC Analyst vets? Or would it have to be in the 1000+ logs of bad password attempts? Additionally, when talking with some of the more experienced members on my team about these alarms, I was given the explanation that the reason why this alarm \"probably\" triggers so many times is because of a some misconfiguration between DC's or servers using old passwords. Is this a good explanation of what might be happening here if you get someone who fails to logon after 100+ attempts in 2 seconds and finally is able to successfully logon 2 minutes later?\n\nThanks in advance, you guys are the best!",
        "created_utc": 1534257434,
        "upvote_ratio": ""
    },
    {
        "title": "Bizarre URLs in SSL Handshake with Orbot",
        "author": "spread_awareness",
        "url": "https://www.reddit.com/r/AskNetsec/comments/978qgp/bizarre_urls_in_ssl_handshake_with_orbot/",
        "text": "Hello,\n\nI was having fun with TOR's android app \"Orbot\" and Wireshark when I noticed these bizarre URLs :\n\nURL | Parameter | Protocol\n\nwww.4mbwulxrucp.com | Server Name | TLS 1.2 Client Hello\n\nwww.fgntndwn53.com | DirectoryString: uTF8String | TLS 1.2 Server Hello\n\nwww.6bqdgh2nygcfwx6i4q7.net |  DirectoryString: uTF8String | TLS 1.2 Server Hello\n\n\nThese URLs come from  TCP payloads during SSL handshake (Client Hello, Server Hello)\n\nIP destination belongs to TOR Network\n\nAny ideas ?\n",
        "created_utc": 1534256295,
        "upvote_ratio": ""
    },
    {
        "title": "Is CISSP relevant to a person new to security domain",
        "author": "readdata",
        "url": "https://www.reddit.com/r/AskNetsec/comments/977g4m/is_cissp_relevant_to_a_person_new_to_security/",
        "text": "Hey Everyone, \n\nI am a product management professional with an MBA. Picked up a challenging opportunity to start a fresh in Cyber security domain (In the past was working on Insurance and Banking domains). Started my work just 2 months back. No exposure to networking aswell. But what i can say is, I can understand networks/ devices at a very high level, having a management perspective to think at process and risk ,  i am getting to know what is happening. \n\nI do not want to be over ambitious and don't want to get into certification asap. Since, there is no one to guide me to understand the domain in my new job, had started Sybex on day 1 to understand the domain (not to get certified) and went through the first 5 chapters in these 2 months and am turning out to be pretty confident that i can pull the exam off.  I am understanding stuff. I know i still did not enter into technicals, but will take my time to understand and learn them. Having confidence that i can do it.\n\nMy question CISSP relevant to some one so new to the domain. Will something else help me before i take the exam.\n\nI know i am in a unique situation, Sugessions would be helpful to people in my shoes !! \n\nThanks !!",
        "created_utc": 1534245087,
        "upvote_ratio": ""
    },
    {
        "title": "GPEN vs GXPN",
        "author": "VagueElf",
        "url": "https://www.reddit.com/r/AskNetsec/comments/976sjx/gpen_vs_gxpn/",
        "text": "I've recently started working in security, and my company is offering me to pay for a SANS pentest certification (I know, I'm lucky).\n\nSo far, the two that I am interested in are GPEN (SEC560) and GXPN (SEC660). Although I would have gone with GPEN, my boss suggested that maybe it would make more sense for me to directly do GXPN.\n\nMy background:\n\n\\- Master's in CS\n\n\\- Comfortable with programming / networking / linux sysadmin stuff\n\n\\- No previous pentest job experience\n\n\\- Passed [eCPPT](https://www.elearnsecurity.com/certification/ecppt/) recently (syllabus [here](https://www.elearnsecurity.com/collateral/Syllabus_PTPv5.pdf), very similar to the OSCP one although the exam and labs are easier)\n\n\\- Experience with a few Vulnhub VMs / CTFs\n\nThe GPEN syllabus ([here](https://www.sans.org/course/network-penetration-testing-ethical-hacking#course_contents_section)) looks rather similar to the eCPPT one, but the GXPN syllabus ([here](https://www.sans.org/course/advanced-penetration-testing-exploits-ethical-hacking#course_contents_section)) looks significantly more advanced and seems to focus more on exploit writing, which although interesting from a personal standpoint is not that much relevant to the work I'm doing.\n\nWhat do you think would be more beneficial in my case between GPEN and GXPN? Feel free to suggest if you know other similar certifications, but I'm not interested in OSCP currently.\n\nThanks!",
        "created_utc": 1534237405,
        "upvote_ratio": ""
    },
    {
        "title": "Certifications, which are good, is this decent, etc?",
        "author": "randomness196",
        "url": "https://www.reddit.com/r/AskNetsec/comments/976ptj/certifications_which_are_good_is_this_decent_etc/",
        "text": "Hi,\n\nSo, I've been reading as much as possible trying to determine a good route into breaking into the field.  \n\nThere's a college a few hours offering this combination:\n\n&amp;nbsp;\n\n**CompTIA:**\n\n&amp;nbsp;  1) A+\n\n&amp;nbsp;  2) Net+\n\n&amp;nbsp;  3) Security+\n\n&amp;nbsp;  4) CSA+ / CySA+\n\n&amp;nbsp;\n\n**Microsoft:**\n\n&amp;nbsp;  1) AdminCert\n\n&amp;nbsp;  2) Exchange and SQL Server Cert\n\n&amp;nbsp;\n\n**Linux Professional Institute**\n\n&amp;nbsp;  1) LPIC-1 Exam 1\n\n\n&amp;nbsp;\n\nI'm having a hard time justifying the cost of the program as it's approximately, 22k (they include a laptop, I don't need one...),+ moving costs, and rent (have a great rate where I am) ~ approximately 30k CAD .  Also, I've already completed the Security+ earlier this year, preparing for the A+ (been fixing / building computers for years), I have the Net+ book and most of that material is stuff I haven't seen before (packet breakdown, and network topologies, etc) but not difficult.\n\nI would love to do SANS certs (but I would prefer the employer to pay for it, ideally all of it but *shrug*), really keen on doing GSEC, CCNA, and OSCP... CISSP (eventually)\n\nLargely self-taught, when I was younger, I would learn and use user land exploits, but been working as operations analyst -- completely different field and looking for a change.\n\nShould I continue the self-taught route?  I feel I can mimic this program by myself and save some serious coin, though I won't have some industry experience that the program offers (unpaid, boo) and I'm not sure how to obtain the CySA+ (CompTIA's website isn't clear)...\n\nAfter the CompTIA exams, my goal would be the LPIC exams, and then GSEC or CCNA.\n\nCan the community offer some insight to this plan, I'm early / mid 30s.   ",
        "created_utc": 1534236462,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone tried the SANS SEC566 course?",
        "author": "ilikelxdefightme",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9758oy/has_anyone_tried_the_sans_sec566_course/",
        "text": "It purely revolves around the CIS Controls. I was wondering if anyone here has taken it and if it's worth the price of a SANS course. On the surface it doesn't look like it's worth it but when looking through the course syllabus, it seems to cover a lot of ground.",
        "created_utc": 1534219615,
        "upvote_ratio": ""
    },
    {
        "title": "Detect metasploit exploit deployed to macos via USB?",
        "author": "nationStateHate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9752a1/detect_metasploit_exploit_deployed_to_macos_via/",
        "text": "I don't know how to put this lightly, so I can only put this as it is.\n\nA coworker who's had a beef with me, told me today how he had a problem with another student back in college. How he took care of it with his buddy by picking a lock, and installing malware and backdoors on the other student's computer. Is it true? I don't know.\n\nSame coworker asks for data from me today. It's 2GB, so let's throw it on a USB thumbdrive. He gives me a thumbdrive to put it on.\n\nThumbdrive has almost nothing but a \".metasploit\" directory on it. I quip \"huh, playing around with metasploit lately?\" Him: \"Ya, &lt;long explanation here&gt;\". Me: \"OK sure.\"\n\nCopying 2GB goes slowly. The copy command freezes over a span of 30 minutes. I use one of my own USB thumbdrives, and it goes OK.\n\nI now have to wonder if a coworker gave me a USB loaded with an exploit. Which brings me to:\n\n**tl;dr: paranoid that coworker gave me a USB thumbdrive with metasploit exploit for macos, how to best detect?**",
        "created_utc": 1534217932,
        "upvote_ratio": ""
    },
    {
        "title": "Symantec DLP help",
        "author": "joshvilla36",
        "url": "https://www.reddit.com/r/AskNetsec/comments/974yqe/symantec_dlp_help/",
        "text": "First time posting here. I landed a Cyber Security Analyst job at a mid sized company that deals with PHI and PCI compliance. Im in my 2nd week and my boss wants me to take the helm on implementing and optimizing the Symantec DLP solution. I believe its on version 15 now. Does anyone know of any good resources to learn this? I've found some videos on Symantec connect but they are pretty dry. I learn best with video resources. Any help would be appreciated",
        "created_utc": 1534217008,
        "upvote_ratio": ""
    },
    {
        "title": "Modern equivalent of ringless voicemails?",
        "author": "sragan16",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9737bd/modern_equivalent_of_ringless_voicemails/",
        "text": "A friend of mine was telling me about how back in the day, he could do this thing called \"ringless voicemail,\" in which he could send voicemails to \\~10k phone numbers in 5 minutes, without any of the phones ringing. Would any of you say there is a modern equivalent? Perhaps geo fence activated push notifications, or something like that. Have any of you came across a similar 'hack' in modern tech? Thanks in advance!",
        "created_utc": 1534202128,
        "upvote_ratio": ""
    },
    {
        "title": "Study / career domains related to IAM/PAM?",
        "author": "X___III___X",
        "url": "https://www.reddit.com/r/AskNetsec/comments/972wq0/study_career_domains_related_to_iampam/",
        "text": "My school friend's younger brother contacted me yesterday. He's been working in DE+JP+EN language operations, and technical project management role for a few yrs. About an year or so back, he moved into a Privileged Access Management (PAM) role, mainly because of his language expertise (DE+JP+EN) &amp; project mgmt + team leading skills. He has since, picked up the PAM work fast, finished his hands-on training &amp; certification, and leading the team.\n\nHe is interested to know what study / certification options (IT or non-IT) may be most relevant / productive for him at this point. And what career paths he can/should pursue?\n\nI initially thought to suggest CCSK, Comptia Security+, &amp; MCSE. But not sure if these'd be of any utility? Though I prefer he goes the *security* route &amp; move into technical managerial role, I don't want to push my views on him. I am certain there are newer &amp; more relevant certification / growth paths that he can pursue and grow in.\n\nRecommendations please.!",
        "created_utc": 1534199810,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding the new PMKID attack on WPA",
        "author": "borosilicosis",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9720qd/regarding_the_new_pmkid_attack_on_wpa/",
        "text": "[Original Blogpost](https://hashcat.net/forum/thread-7717.html)\n\n[/r/NetSec thread](https://www.reddit.com/r/netsec/comments/94klae/new_attack_on_wpawpa_using_pmkid/)\n\nThe way that this is phrased makes it seem, to me, that instead of just generating PMKs from password candidates, you have to generate a PMK and *then* generate a PMKID from that PMK. With that in mind, I have a couple of questions:\n\n1) This attack will result in something that takes more cycles to crack compared to the 4-way handshake, right?\n\n2) BTC is double sha256 or something like that, if I recall, but if there are now TWO sha-1's used to derive PMK+PMKID for potential comparisons, does that make any mining hardware capable of being adapted to this process? I have previously read that no, this was not practical for the original handshake-based attack, but this is obviously \"newer\" territory.",
        "created_utc": 1534193239,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone interviewed with NCC group before or knows of anyone that has?",
        "author": "throwaway183693",
        "url": "https://www.reddit.com/r/AskNetsec/comments/971r5v/has_anyone_interviewed_with_ncc_group_before_or/",
        "text": "Dear Netsec,\n\nHas anyone here interviewed with NCC group here for their security consultant role specializing in pentesting or knows of anyone that has? What are their technical interviews like? ",
        "created_utc": 1534191396,
        "upvote_ratio": ""
    },
    {
        "title": "Microsoft edge keeps crashing",
        "author": "DUBAITERROR2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9713st/microsoft_edge_keeps_crashing/",
        "text": "how do i fix this",
        "created_utc": 1534186896,
        "upvote_ratio": ""
    },
    {
        "title": "Question on Checkpoint CCSA",
        "author": "NO-OXI",
        "url": "https://www.reddit.com/r/AskNetsec/comments/970vhq/question_on_checkpoint_ccsa/",
        "text": "I have the CBTnuggets r77 training videos and some material i recieved from a colleague, how different would these be to the CCSA R80 exam? thanks for any answers",
        "created_utc": 1534185321,
        "upvote_ratio": ""
    },
    {
        "title": "i need to max out my data usage and i don't know how",
        "author": "DUBAITERROR2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/970t2f/i_need_to_max_out_my_data_usage_and_i_dont_know/",
        "text": "do any of you guys have  advice?",
        "created_utc": 1534184833,
        "upvote_ratio": ""
    },
    {
        "title": "GCIH Practice Test",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/9701np/gcih_practice_test/",
        "text": "[removed]",
        "created_utc": 1534179688,
        "upvote_ratio": ""
    },
    {
        "title": "What am I doing wrong? I've been stuck for over a day now...",
        "author": "SOC_uintheface",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96zw23/what_am_i_doing_wrong_ive_been_stuck_for_over_a/",
        "text": "Okay, i'm sorry to ask such a newb questions but i've literallly been stuck on this for a day and a half now, but if someone can enlighten my from my stupidity it would be greatly appreciated!...\n\nI'm currently trying to run a reverse dns lookup using a for loop scan on a 10.x.x.x/24 network but get no resolved names. However, I KNOW the host is up because I can run a nmap scan on it for open ports. The command I have been trying to use is \n\n**\"for ip in $(seq 1 254); do host 10.x.x.$ip;done\"**\n\n but I get 0 hits. Why am I unable to resolve the DNS names for those hosts? I think it has something to do with the 10.x.x.x network being in a 24 subnet, but am unsure..\n\nalso, if it helps, the output I get for everyting reads, \"Host 1.x.x.10 in-addr.arpa. not found: 3(XXDOMAIN)\" Does that mean my for loop is running on the wrong domain? Maybe that's why I'm not getting hits on this reverse DNS lookup? \n\nIf anyone can enlighten from my stupidity it would be greatly appreciated... Thanks you!\n\nEDIT: Figured it out, thanks everyone!",
        "created_utc": 1534178625,
        "upvote_ratio": ""
    },
    {
        "title": "https://thisisdrum.com/",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96zuop/httpsthisisdrumcom/",
        "text": "[deleted]",
        "created_utc": 1534178357,
        "upvote_ratio": ""
    },
    {
        "title": "Question DOM XSS",
        "author": "sandiegoking",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96ze2n/question_dom_xss/",
        "text": "So we have a little debate here. If the Data source is trusted and not modifiable by user input. Would you lower the risk from a high or critical lets say to a median?\n\nAssume that the data is coming from a DB.",
        "created_utc": 1534175146,
        "upvote_ratio": ""
    },
    {
        "title": "Network+ Exam Tomorrow",
        "author": "z3r0_id",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96yxx0/network_exam_tomorrow/",
        "text": "I'm taking my Network+ exam tomorrow and I wanted to ask the community for any last minute pointers. I've already read a lot about reading the questions carefully, so I'm ready for that. But does anyone know of any items to study a little more in depth? Anything that was surprisingly complicated that I should cram into my brain today?\n\nAny pointers are greatly appreciated, thanks all!",
        "created_utc": 1534171959,
        "upvote_ratio": ""
    },
    {
        "title": "[UPDATE] Opinions on CCSP",
        "author": "heylooknewpillows",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96ylox/update_opinions_on_ccsp/",
        "text": "Original thread: https://old.reddit.com/r/AskNetsec/comments/8g2rg2/opinions_on_ccsp/\n\nI took the CCSP course from ISC2 in Mid-May and took the test early July.  \n\nIf you're new to cloud, I would very much recommend the course.  Much like the CISSP, the CCSP is not a nuts and bolts technical course and it is vendor neutral.  It is a high level technical management level course on Cloud methodology and they do spend a fair amount of time on migrating processes to the cloud and the various challenges up-front and behind.  \n\nNot sure if it was just because my course was right before the GDPR deadline, but we spent a fair mount of time talking on GDPR, too.\n\nThe test is computer based, which was new for me.  When I took the CISSP, it was still paper based.  I think it was 125 or 150 questions, I think you're allotted 4 hours.  I used a fraction of that time, but your mileage will obviously vary based on your test taking style.  \n\nYou do get notification directly after (except in rare circumstances, I understand) on pass/fail.  Certification process took nearly a month (though as a CISSP they acknowledge you have already been certified, so ISC2 will certify you themselves and you don't need to find another party to do so).\n\nOverall, I felt it was valuable, but if you are more in the engineer role, it may not be as worth it.  \n\n",
        "created_utc": 1534169383,
        "upvote_ratio": ""
    },
    {
        "title": "Do Wireless APs forward traffic straight to a client or back to a switch first?",
        "author": "MikeHunt99",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96y4oq/do_wireless_aps_forward_traffic_straight_to_a/",
        "text": "I'm trying to inspect wireless traffic via a TAP/SPAN Port but need some clarification first.\n\nIf Client A and Client B are both connected to Access Point C and A + B want to talk to each other, does C act as a switch between the two of these clients or does C have to send that traffic back to an Access Switch first to then forward the data back down to the AP?\n\nClient A &lt;--&gt; Access Point C &lt;--&gt; Client B \n\n**OR** \n\nClient A &lt;--&gt; Access Point C &lt;--&gt; Switch &lt;--&gt; Access Point C &lt;--&gt; Client B",
        "created_utc": 1534165506,
        "upvote_ratio": ""
    },
    {
        "title": "is there anyway to Tracking a call from \" Call Voice Changer - IntCall \" ?",
        "author": "mzn1990",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96y35l/is_there_anyway_to_tracking_a_call_from_call/",
        "text": "Can I pursue someone who used this program to call me (this program provides fake numbers to any country in the world). I have no idea how to start pursuing him. Could I identify the internet that he used to communicate? Or place? Or device  IME .. anything?\n\nI can get help from telecommunications companies, Internet and information police if you have any idea ",
        "created_utc": 1534165154,
        "upvote_ratio": ""
    },
    {
        "title": "What's the worst you could do with HTML and/or CSS injection?",
        "author": "getriggityrekd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96xqrg/whats_the_worst_you_could_do_with_html_andor_css/",
        "text": "Due to the prevalence of frameworks that are able to detect and filter out malicious javascript (ie Angular), it's becoming more and more common where you can get HTML (and possibly CSS) injection, but not javascript injection.\n\nWhat are some awesome ways to exploit this injection?",
        "created_utc": 1534161975,
        "upvote_ratio": ""
    },
    {
        "title": "Why use Nmap if you have Nessus?",
        "author": "webbic",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96wmbn/why_use_nmap_if_you_have_nessus/",
        "text": "Hi guys!\n\nWhy should you use Nmap when you have Nessus, which can also do ping scans AND automatically find vulnerabilities, so you don't have to Google Nmap scan results? \n\nThanks for your answers.\n\nBtw, I have been asking a lot of questions lately. Thank you for helping me out! I really appreciate it!",
        "created_utc": 1534149156,
        "upvote_ratio": ""
    },
    {
        "title": "How can Intelligence agencies access phones remotely?",
        "author": "cooldude711",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96wgav/how_can_intelligence_agencies_access_phones/",
        "text": "I heard this multiple times from multiple sources. In some middle eastern country, the intelligence agency there accesses phones remotely and take screenshots to monitor encrypted messaging apps such as Whatsapp and Facebook. What are the possibilities on how they do it?\n\n",
        "created_utc": 1534147025,
        "upvote_ratio": ""
    },
    {
        "title": "Chrome plugin intercept https",
        "author": "ProudScientist2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96vk3u/chrome_plugin_intercept_https/",
        "text": "I want to test a plugin intercept https traffic before it encrypt and extract data for a data loss prevention software. \n\ncan anyone explain if this is possible and if not what's the best way to analyse https traffic to detect sensitive content?",
        "created_utc": 1534136585,
        "upvote_ratio": ""
    },
    {
        "title": "How common are JavaScript 0days?",
        "author": "arranb1223",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96t67s/how_common_are_javascript_0days/",
        "text": "If I was to click on a an ad on a porn site or a torrenting site (which are usually considered to be quite sketchy), how likely is it that I would be infected just by clicking on it?\n\nIs there any way to tell that you have been affected by a silent drive-by javascript attack?\n\nHow common are JavaScript 0days?\n\nI was just quite curious and worried after I saw this video: https://www.youtube.com/watch?v=NDuWcGn5hTQ",
        "created_utc": 1534114723,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone give advice on transitioning from development to security research?",
        "author": "jlkasdjf98lkn",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96pmgd/can_someone_give_advice_on_transitioning_from/",
        "text": "I've been working for about 3 years as a software developer, most of which has been for a security product. My team rotates the \"application security engineer\" position so that each team member fills this role at one point or another.\n\nHowever, the more that I dig into security, the more I would like to get into security research. I have a little bit of experience in a lot of areas right now. I've dabbled a little bit into vulnerability analysis/pentesting, reverse engineering, and malware analysis. I know that I need to get skilled up more in these areas if I stand a chance at being a security researcher. I haven't yet tried to get any bug bounties yet - I think that this would be a good area to work in on the side.\n\nMy question is, is the path to security researcher as simple as skilling up, and then applying for jobs? Or is there a better way to go about this? I've looked into certifications, but most seem to be aimed for the typical corporate blue team person, which is what I really would like to avoid being.",
        "created_utc": 1534086163,
        "upvote_ratio": ""
    },
    {
        "title": "Microsoft Edge sends your URLs to Bing even when using a different search engine? [xpost r/privacy]",
        "author": "fasiuk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96nwgd/microsoft_edge_sends_your_urls_to_bing_even_when/",
        "text": "As long as \"Show search and site suggestions as I type\" is enabled (in advanced settings) Edge on Windows 10 appears to send all keystrokes in the address bar to Redmond (IP 13.107.21.200), even though I've changed the search engine to Google or Duckduckgo. That's according to my reading of Wireshark.\n\nPlease leave a comment if you can reproduce this.",
        "created_utc": 1534063713,
        "upvote_ratio": ""
    },
    {
        "title": "Am I understanding correctly? Most hackers don't use 0days, but rather publicly available vulnerabilities? Is it really that simple?",
        "author": "imnoobhelpplz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96nuxw/am_i_understanding_correctly_most_hackers_dont/",
        "text": "I'm under the assumption that 0days are rare and that the average hack doesn't use or require a 0day, is this a correct one? For example hacker finds out company is using X version of a product. All the hacker has to do is search on exploit-db for a vulnerability in the product and then create an exploit that takes advantage of the vulnerability?\n\nWith the exception of phishing/social engineering... doesn't this mean that most hacks could be prevented by simply keeping software updated? Is hacking really that \"simple\"? Just taking advantage of outdated products and that have known vulnerabilities? \n\nAlso, if that's the case, why do big companies that have dedicated IT departments still get hacked? Isn't it their job to ensure everything is up to date?",
        "created_utc": 1534063065,
        "upvote_ratio": ""
    },
    {
        "title": "USB in VB for security?",
        "author": "Sissytaylor94010",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96nk3l/usb_in_vb_for_security/",
        "text": "Does anyone use VMs to plug in untrusted flash drives? I had whonix configured to do this once  but idk. \n\nI'm wondering how secure the host is when doing this? In a general use case sense not a\n\n\n \"well a virus could theoretically go up the unsecure thread take control of the host and install a backdoor\"  scenario. \n\n\nIf so does anyone have any articles or more information on this? \n\n\n(calling this a netsec thread because the scenario is the VM is isolated from the host network sooo it's networking related sue me)",
        "created_utc": 1534058655,
        "upvote_ratio": ""
    },
    {
        "title": "Recent college grad, early 20s, didn't take a pentesting job when I had a chance. What should I do now to get where I want to be?",
        "author": "wonderingwhattodo567",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96ltu1/recent_college_grad_early_20s_didnt_take_a/",
        "text": "Hi all,  \n\nI recently graduated college and was given an offer for a normal development job at a major company. After accepting this, I got another offer from a pentesting company (what I want to do). However, because of already accepting an offer and a couple other reasons, I declined.  \n\nNow, I enjoy my job as it is kind of in security development, but it's not ethical hacking (which is what I enjoy the most). I want to get my skills as sharpened as possible in the pentesting field, but obviously I'm not getting real experience in it. My question is, has anyone been in this situation?  \n\nWhat is a good way to get my skills as sharp as possible while not actually being on the job? I do plan on being in the field a few years down the road.  \n\nSo far, I have obtained my OSCP as well as my OSCE. I've looked into CISSP as well as CEH but they definitely look just like HR fillers rather than real pentesting.  \n\nMy fear is that I will lose sight of my goals and my skills may become dull from not actually being in the field. If anyone has advice, it would be much appreciated. Thanks so much!",
        "created_utc": 1534039175,
        "upvote_ratio": ""
    },
    {
        "title": "How to make the jump to infosec?",
        "author": "WonkingSphonx",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96l6gq/how_to_make_the_jump_to_infosec/",
        "text": "Hello /r/AskNetSec! I’ve been wanting to get my foot into the infosec job scene for a while now and I was curious if there's any advice that can be given for someone in my position? Currently, I’m a Tier II engineer. I work on stuff like server support / deployment, and I have a history of sysadmin style work in a Windows Server environment. I’ve got at least one professional infosec cert (Security+) and other professional technology certs as well. I’m familiar computer forensics and know how to use those tools. I’m also acquainted with packet sniffers, analyzing traffic flow, and how to interpret security logs from servers and network security software. If I had to box myself into an area of infosec I’m interested in, I’d probably say server and network hardening are what I’d like to focus on. \n\n&amp;nbsp;\n\n\nHowever, In my spare time I’ve been trying to do some hands on learning with reverse engineering by deconstructing / analyzing a ROM dump of an obscure game system’s OS as a learning experience. Outside of that, I’m furthering my knowledge of Linux since I’ve worked a bit in bash before and enjoyed using it when I had the opportunity.\n\n&amp;nbsp;\n\n\nWith all that being said, what are some steps I could take to angle myself into a security position? Any advice is sincerely appreciated!",
        "created_utc": 1534033044,
        "upvote_ratio": ""
    },
    {
        "title": "Shift from learning to practical!?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96k6mc/shift_from_learning_to_practical/",
        "text": "[deleted]",
        "created_utc": 1534024225,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the proper way to manage social media business passwords?",
        "author": "Aewawa",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96jq1v/what_would_be_the_proper_way_to_manage_social/",
        "text": "My sister just got a job to manage the social media accounts from 4 business around here, they are the local branch of international chains. While I was helping her with IT stuff I looked to the passwords that they sent to her and I just cringed, they had 8 characters length and only had lowercase letters and numbers, and those are professional accounts.  \n\n\nI said to her \"tell your boss to pay for a password manager\". But I don't really know if it was the right choice, since those passwords will be used by multiple people. She works for a startup that does social media for business. \n",
        "created_utc": 1534020319,
        "upvote_ratio": ""
    },
    {
        "title": "Even though there's a bit of variation depending on what you're getting into, what kind of stuff is typically involved in a junior position in Netsec?",
        "author": "PUBG_INTENSIFIES",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96imkb/even_though_theres_a_bit_of_variation_depending/",
        "text": "Once I have finished some certs that were recommended (from this sub) and I'm applying for entry level jobs, what can I expect to see?  Anything that the OSCP/OSCE doesn't cover?  Also any red flags to look out for?",
        "created_utc": 1534011383,
        "upvote_ratio": ""
    },
    {
        "title": "To all security researchers, penetration testers, hackers or whatever you may call it, what is your setup?",
        "author": "itsmypc",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96i92w/to_all_security_researchers_penetration_testers/",
        "text": "Please share your entire setup.\n\nDevices.\n\nOperating Systems and purpose. How do you boot them? USB boot? External HDD boot? How many HDD and SSD and USB you carry along and for what purposes.\n\nTools.\n\nFor Eg. I have a latop with an internal SSD (180GB, Ubuntu + Kali) and an internal HDD (250GB, Random storage stuff). I have another 80GB HDD with Windows 10 and the SATA to USB connector in case I need windows, I connect this HDD to usb 3.0 port and boot it. Among all this, I do my pentest stuff on Kali and Burp suite and Metasploit are that major tools I use.",
        "created_utc": 1534008437,
        "upvote_ratio": ""
    },
    {
        "title": "Insulin Pumps, CGMs, and Security",
        "author": "lnri",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96hf30/insulin_pumps_cgms_and_security/",
        "text": "Reading articles such as [https://medium.com/neodotlife/dana-lewis-open-aps-hack-artificial-pancreas-af6ef23a997f](https://medium.com/neodotlife/dana-lewis-open-aps-hack-artificial-pancreas-af6ef23a997f) where someone \"hacked\" their insulin pump to extend it's functionality to improve their life are very interesting. At the same time it's quite horrifying. If someone can gain remote code execution on an Insulin Pump they could easily inject let's say 1,000 units of insulin into a diabetic while they're sleeping to kill them remotely (are there any publicly documented cases of murder that have happened this way?). Another risk is hacking a CGM loop to manipulate a diabetic into giving themself the wrong dose of insulin. What risks do people in the infosec community see with these devices and what can we do to protect such a vulnerable group of individuals?",
        "created_utc": 1534001925,
        "upvote_ratio": ""
    },
    {
        "title": "Are password managers secure enough for bank passwords and credit card details?",
        "author": "Much_Faction",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96gzjp/are_password_managers_secure_enough_for_bank/",
        "text": "I use 1password for the logins I don't care too much about, but I haven't used it for my banks, credit-cards and any other highly critical details. With age, my memory is making it difficult to remember all this stuff. It's esp difficult to remember everything as I rotate passwords and pin no at least couple of times a year. Are password managers, esp cloud based secure enough for these kinds of stuff?",
        "created_utc": 1533998240,
        "upvote_ratio": ""
    },
    {
        "title": "Sat down at desk to see unusual browser \"Gotcha !!!\" tab open",
        "author": "tell_no_lies",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96gpu1/sat_down_at_desk_to_see_unusual_browser_gotcha/",
        "text": "Hi, folks. This one has me kinda spooked.\nSat down at my computer last night to check on some downloads, and noticed a tab that certainly wasn't there earlier in the day. Here is a screenshot:\n  \n[https://imgur.com/a/xKxcLid](https://imgur.com/a/xKxcLid)\n  \nThe exact address the page was set to was:\n   https://www.google.com/search?q=made+you+look&amp;num=100&amp;rlz=1CAASUE_enUS788US788&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=0ahUKEwirz6Pd6-PcAhVSBjQIHQYdDLgQ_AUICigB&amp;biw=1366&amp;bih=627#imgrc=_rSU2b3o3mMI5M:\n  \nNobody else would have touched the computer at all. Throughout the day, I was connected to a VPN. The only other tabs I had open at the time were GMail, a couple of google results pages, and a webpage for a media player that did have ads plastered all over it. I was using IE 11. I'm on Win 10 x64 and am current on updates/patches. I don't use anything other than Windows Defender. AFAIK my router is properly configured, but is showing its age these days (RT-N66U). I checked my remote desktop settings and it looks like I did have \"Allow Remote Connections to this Computer\" checked, with the additional \"Allow connections only from computers running Remote Desktop with Network Level Authentication (recommended)\" also checked.\n  \nSo, I'm curious if anybody can help answer whether this was likely the result of a digital intruder of some sort, or was it more likely an auto-opened tab from that web-page covered in ads? Is there anything within a browser or Windows log that I could check? Is this something that is more likely to occur when using a VPN? Should I take any other actions (ie change passwords, change settings on computer, etc)?\n  \nThanks for any help you can provide! This really left me scratching my head last night -- really just want to make sure my computer isn't compromised in some way.",
        "created_utc": 1533995801,
        "upvote_ratio": ""
    },
    {
        "title": "Is Gmail’s remote content loading safe or not?",
        "author": "Funstill",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96g8jl/is_gmails_remote_content_loading_safe_or_not/",
        "text": "I’m seeing somewhat conflicting info. On reddit, I read that Gmail  preloads all remote content before you receive it, so a hacker only gets google server’s information and not yours, through such content. \n  \nBut here’s google’s explanation about images:  \nhttps://support.google.com/mail/answer/145919?co=GENIE.Platform%3DDesktop&amp;hl=en  \n  \n“How Gmail helps make images safe  \nGoogle scans images for signs of suspicious content before you receive them.  \n\nThese scans make images safer because:  \n\nSenders can’t use image loading to get information about your computer or location.  \nSenders can’t use the image to set or read cookies in your browser.  \nGmail checks the images for known harmful software.  \n**Sometimes, senders may know whether you've opened an email that has an image. Gmail scans every message for suspicious content. If Gmail thinks a sender or message is suspicious, images aren’t shown and you’ll be asked if you want to see the images.”**  \n  \n  \nThe last bolded part sounds contradictory to redditors’ “google preloads remote content so you don’t get hacked when you open it.”\n ",
        "created_utc": 1533990978,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think about BitMessage?",
        "author": "justajunior",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96frfo/what_do_you_think_about_bitmessage/",
        "text": "I haven't heard much about BitMessage from the security community and I was wondering what you people thought about it. It started in 2013 but for some reason it still didn't get an audit, which makes me somewhat suspicious. There was a vulnerability in a new version a couple of months ago which luckily got resolved pretty quickly, but apart from that I don't really know about its track record or design robustness in terms of its protocol or implementation.\n\nSo yeah, if anyone could shed some light on this matter it would be really appreciated.",
        "created_utc": 1533985209,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to exploit CORS if the requests using an authentication token in a header instead of a cookie?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96fp78/is_it_possible_to_exploit_cors_if_the_requests/",
        "text": "[deleted]",
        "created_utc": 1533984304,
        "upvote_ratio": ""
    },
    {
        "title": "Any idea to find out my attacker?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96fl20/any_idea_to_find_out_my_attacker/",
        "text": "[deleted]",
        "created_utc": 1533982668,
        "upvote_ratio": ""
    },
    {
        "title": "How much does which college you go to affect cyber security skills and ability?",
        "author": "Elias4918",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96fahm/how_much_does_which_college_you_go_to_affect/",
        "text": "I want to study cyber security in college and I want to know your opinions on how much the college or university you go to actually affects your knowledge or ability.\n\nI want to clarify that I’m not speaking about attractiveness to employers, I want to know strictly whether or not my abilities will be better or worse depending on the college.\n\n",
        "created_utc": 1533978503,
        "upvote_ratio": ""
    },
    {
        "title": "NMAP and Firewalls",
        "author": "webbic",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96f6wp/nmap_and_firewalls/",
        "text": "Hi Guys!\n\nBesides timing, what other techniques do you guys recommend while running NMAP scans regarding to avoid firewall detection? \n\nThank you for all replies! \n(and sorry for my bad English)",
        "created_utc": 1533977062,
        "upvote_ratio": ""
    },
    {
        "title": "How to do intrusion monitoring/detection for a VPS?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96bbjl/how_to_do_intrusion_monitoringdetection_for_a_vps/",
        "text": "[deleted]",
        "created_utc": 1533938695,
        "upvote_ratio": ""
    },
    {
        "title": "Alternatives to Controlled folder access? (For those of us who don't want to use Windows Defender as our main antivirus)",
        "author": "Longent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96a9dc/alternatives_to_controlled_folder_access_for/",
        "text": "Does the /r/AskNetSec community have any recommendations for alternatives to Controlled folder access in Windows 10? I was interested in utilizing this option to protect some folders on my desktop PC from malware (it's a shared computer and I use it mostly for periodically storing files), but then I discovered it only works if Windows Defender is your primary AV. I use Norton at the moment and don't want to give it up just yet.  ",
        "created_utc": 1533930899,
        "upvote_ratio": ""
    },
    {
        "title": "Request for opinion on log centralization for both cloud and physical using ELK",
        "author": "Abaddonpuff",
        "url": "https://www.reddit.com/r/AskNetsec/comments/969rm2/request_for_opinion_on_log_centralization_for/",
        "text": "Hello!\n\nHave you guys got any opinion or interesting resource regarding log centralization for both cloud and physical assets? How do you guys manage your logging?, for example have you got an AWS Elasticsearch service, physical ELK logging server, AWS Linux instance with ELK or a third party solution?\n\nI want to try centralizing every log I've got on a single ELK server and alerting through Elastalert, I've got both cloud instances and physical devices, my goal is to get cloud (AWS/AZURE) logs, cloud instance host logs for example using OSSEC, and to get the logs of my physical devices all in one place, and generate alerts from inusual activities.",
        "created_utc": 1533927430,
        "upvote_ratio": ""
    },
    {
        "title": "Investigating a potentially compromised macOS System",
        "author": "lnri",
        "url": "https://www.reddit.com/r/AskNetsec/comments/968ut8/investigating_a_potentially_compromised_macos/",
        "text": "Hi, I am investigating a report from TaskExplorer by Objective-See showing a few official looking binaries that are detected as malware by Virustotal. Some have valid signatures and others do not. It's quite possible Trendmicro is having false positives. Then again some of the reports also show an invalid signature. The possibility of an infected system is very concerning to me although I want to make sure this isn't just a false positive.\n\n**Reports:**\n\n* [https://www.virustotal.com/en/file/afb078a887f035c2401670f5f1e6959d96d9f5c7f171a11dfc6a287acf3cb385/analysis/](https://www.virustotal.com/en/file/afb078a887f035c2401670f5f1e6959d96d9f5c7f171a11dfc6a287acf3cb385/analysis/)\n* [https://www.virustotal.com/en/file/fc0ec63a59a4850b3c518a304e7d6cf49dca812428d40081641e6b10cf43d06d/analysis/](https://www.virustotal.com/en/file/fc0ec63a59a4850b3c518a304e7d6cf49dca812428d40081641e6b10cf43d06d/analysis/)\n* [https://www.virustotal.com/en/file/406d4ddaa7c04f696e0a90adad473d0da915c2ccae292933e5f87dfdb61b4579/analysis/](https://www.virustotal.com/en/file/406d4ddaa7c04f696e0a90adad473d0da915c2ccae292933e5f87dfdb61b4579/analysis/)\n* [https://www.virustotal.com/en/file/694d9d2c673e289d8d2c76e19972cd196e0ad45ed2b46ae7c9dd843bc11a2faa/analysis/](https://www.virustotal.com/en/file/694d9d2c673e289d8d2c76e19972cd196e0ad45ed2b46ae7c9dd843bc11a2faa/analysis/)\n* [https://www.virustotal.com/en/file/52f39a58f08f3f6b995c62b79b83372615be7df408f9cc934e33c663764e58b8/analysis/](https://www.virustotal.com/en/file/52f39a58f08f3f6b995c62b79b83372615be7df408f9cc934e33c663764e58b8/analysis/)\n* [https://www.virustotal.com/en/file/9ba5092b105f657851b9a421d921c41f454152a54afe5bedc431095b5a2ea3b5/analysis/](https://www.virustotal.com/en/file/9ba5092b105f657851b9a421d921c41f454152a54afe5bedc431095b5a2ea3b5/analysis/)\n* [https://www.virustotal.com/en/file/949f54fdf5b7a522608a0de6b7779eca6c9dee89a7efc9fc7152c75a6e47663a/analysis/](https://www.virustotal.com/en/file/949f54fdf5b7a522608a0de6b7779eca6c9dee89a7efc9fc7152c75a6e47663a/analysis/)\n\n**Update:**\n\nGoogle Chrome's software updater is also flagged [https://www.virustotal.com/en/file/7b09ee31e7935ea134b63e3b73b27add16054fe43d5ceee0c8140386b61a3409/analysis/](https://www.virustotal.com/en/file/7b09ee31e7935ea134b63e3b73b27add16054fe43d5ceee0c8140386b61a3409/analysis/)",
        "created_utc": 1533921236,
        "upvote_ratio": ""
    },
    {
        "title": "Should I be concerned?",
        "author": "whatisthat74757",
        "url": "https://www.reddit.com/r/AskNetsec/comments/967dmb/should_i_be_concerned/",
        "text": "Received this emai not so long ago. Should I be concerned?  [**https://i.imgur.com/ZIe2M4V.png**](https://i.imgur.com/ZIe2M4V.png) ",
        "created_utc": 1533911161,
        "upvote_ratio": ""
    },
    {
        "title": "Database security planning - help a noob out. Pls",
        "author": "Sloth_loves_Chunks",
        "url": "https://www.reddit.com/r/DatabaseHelp/comments/95iuf5/db_security_planning/",
        "text": "",
        "created_utc": 1533902746,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of malware is this?",
        "author": "lot484",
        "url": "https://www.reddit.com/r/AskNetsec/comments/965us8/what_kind_of_malware_is_this/",
        "text": "I did a Malwarebytes scan and a malware was found located in C:\\\\\\\\WINDOWS\\\\TEMP\\\\JAJIOW.EXE. What does this thing do?",
        "created_utc": 1533897815,
        "upvote_ratio": ""
    },
    {
        "title": "After reading a recent post saying that the OSCP is just the beginning, I am wondering what other pentesting certifications should be obtained afterwards. Besides getting a job in netsec, how would somebody further their education?",
        "author": "PUBG_INTENSIFIES",
        "url": "https://www.reddit.com/r/AskNetsec/comments/965834/after_reading_a_recent_post_saying_that_the_oscp/",
        "text": "",
        "created_utc": 1533890679,
        "upvote_ratio": ""
    },
    {
        "title": "GPEN Questions?",
        "author": "Hamblurgler",
        "url": "https://www.reddit.com/r/AskNetsec/comments/96574c/gpen_questions/",
        "text": "I'm taking the [GPEN cert](https://www.giac.org/certification/penetration-tester-gpen) in a few weeks. Is anyone aware of any sets of practice questions? Was able to find plenty of those for the other certs I've taken, but haven't really found any for GPEN.\n\nTo be clear I'm *not* looking for dumps or actual test questions. Not interested in cheating. Looking for GPEN practice question sets similar to [Prof Messer's for A+/Net+](https://www.professormesser.com/popquiz/).",
        "created_utc": 1533890285,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there dots (.) in this shadow file's hash?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/963s7o/why_are_there_dots_in_this_shadow_files_hash/",
        "text": "[deleted]",
        "created_utc": 1533875101,
        "upvote_ratio": ""
    },
    {
        "title": "Food for Thought: Have Nation States Completely Fuzzed Most Linux and Windows Apps and OSes?",
        "author": "devops333",
        "url": "https://www.reddit.com/r/AskNetsec/comments/963km4/food_for_thought_have_nation_states_completely/",
        "text": "Title says it all.\n\n\nDo you think nation states have spend a ton of $ on compute to fuzz the hell out of almost every app and OSes to get zero days?  Fuzzing is simple and automated, set it up and let it go.\n\nSeems like it could be worth it...",
        "created_utc": 1533873242,
        "upvote_ratio": ""
    }
]