[
    {
        "title": "what's the process for intrusions?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nzc8r/whats_the_process_for_intrusions/",
        "text": "[deleted]",
        "created_utc": 1515027960,
        "upvote_ratio": ""
    },
    {
        "title": "What is the delineation between the open source Metasploit found in Kali vs Rapid7’s corporate offering?",
        "author": "forEDUCATIONALstuff",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ny2ul/what_is_the_delineation_between_the_open_source/",
        "text": "",
        "created_utc": 1515016653,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any respectable IPS devices recommended for connected IoT homes?",
        "author": "lovelynipper",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nxn74/are_there_any_respectable_ips_devices_recommended/",
        "text": "Products like https://www.kickstarter.com/projects/akita/akita-instant-privacy-for-smart-homes and https://www.f-secure.com/en_US/web/home_us/sense claim to fill this role but they seem shaky.\n\nIs there a best in class for this purpose?",
        "created_utc": 1515013091,
        "upvote_ratio": ""
    },
    {
        "title": "HTTPS Everywhere; what does it do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nxmdm/https_everywhere_what_does_it_do/",
        "text": "[deleted]",
        "created_utc": 1515012893,
        "upvote_ratio": ""
    },
    {
        "title": "Information Security Event Monitoring Procedure",
        "author": "orion3999",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nx5lr/information_security_event_monitoring_procedure/",
        "text": "I have been tasked with developing an Information Security Event monitoring procedure document to cover PCI requirement 10.6.\n\n\"Are logs and security events for all system components reviewed to identify anomalies or suspicious activity as follows?\n**Note:** Log harvesting, parsing, and alerting tools may be used to achieve compliance with Requirement 10.6.\"\n\n \n\"Are written policies and procedures defined for reviewing the following at least daily, either manually or via log tools?\n• All security events\n\n• Logs of all system components that store, process, or transmit CHD and/or SAD, or that could impact the security of CHD and/or SAD\n\n• Logs of all critical system components\n\n• Logs of all servers and system components that perform security functions (for example, firewalls, intrusion-detection systems/intrusion- prevention systems (IDS/IPS), authentication servers, e-commerce redirection servers, etc.)\"\n\n\nAre written policies and procedures defined for reviewing logs of all other system components periodically—either manually or via log tools— based on the organization’s policies and risk management strategy?\n\n\nAre written policies and procedures defined for following up on exceptions and anomalies identified during the review process?\n\n\nDoes anyone have any experience, advice or resources to do this?\n",
        "created_utc": 1515009046,
        "upvote_ratio": ""
    },
    {
        "title": "Out or under the firewall? Your advice",
        "author": "besmile4ever",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nwmdm/out_or_under_the_firewall_your_advice/",
        "text": "Hello\n\nHope you are doing well. We have a device that will be used for public services..Now shall I put it under firewall or no need for firewall?\nFor such cases how You can decide and under which cobditions.\nThe service do not want FW but my policy firce to use FW??\nSo how you can decide for such situations.\n\nCheers.",
        "created_utc": 1515004608,
        "upvote_ratio": ""
    },
    {
        "title": "How to write Windows Hardening Tool with Powershell &amp; Python script",
        "author": "damuzxc",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nwkck/how_to_write_windows_hardening_tool_with/",
        "text": "Anyone good materials &amp; resource link ? ",
        "created_utc": 1515004154,
        "upvote_ratio": ""
    },
    {
        "title": "Network / Activity Logs where breaches has occurred?",
        "author": "Kimput",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nwbth/network_activity_logs_where_breaches_has_occurred/",
        "text": "Where can I find logs with threats, risks and breaches? Are there any such sources?\n\nIe. a network log where a breach has been prevented, or where a breach has been successful? ",
        "created_utc": 1515002171,
        "upvote_ratio": ""
    },
    {
        "title": "Containerization Security Recommendations",
        "author": "clayjk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nw26c/containerization_security_recommendations/",
        "text": "We’re starting to stand up a new environment to support containerization and I’m looking for input on things that should be considered.\n\nOur environment will be hosted on RHELv7 hosts using Docker enterprise. \n\nHere is what I have on my list to sort out but what am I missing?\n\n- hardening host OS and Docker configurations (we follow CIS)\n\n- vulnerability scanning for containers (looking into Docker scanning solution)\n\n- approval of containers, i.e., how do we certify images we build and images provided by vendors\n\n- Container provision and management, i.e., looking at using Rancher\n\n- Credential and Access Management, i.e., how do we provision and manage service accounts \n\n- Logging and Alerting, i.e., hookup hosts and containers to our SIEM\n\nWhat else should I be thinking of? Any setup/configuration resources relevant to review?\n",
        "created_utc": 1514999870,
        "upvote_ratio": ""
    },
    {
        "title": "Help finding a relevant Thesis subject.",
        "author": "Kimput",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ntyim/help_finding_a_relevant_thesis_subject/",
        "text": "Hi everyone,\n\nI need some help finding a relevant research subject for my thesis (BSc in Informatics - the realm in between CS and HCI/Psychology).\n\nCould anyone give me any suggestions on what could be relevant from a info/cyber sec perspective? I'm hoping to get a job in info/cyber sec, with security engineering or DevSecOps, so I'm hoping that the thesis might help me to get there.\n\nCheers,\n\nJoakim ",
        "created_utc": 1514977224,
        "upvote_ratio": ""
    },
    {
        "title": "How well do chip + signature cards protect card number during card present transactions?",
        "author": "harlows_monkeys",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nsf1r/how_well_do_chip_signature_cards_protect_card/",
        "text": "Suppose a chip + signature card has only been used in chip mode when used for card present transactions. It has not been used via the stripe reader on older terminals.\n\nSuppose it has also been used for online purchases.\n\nFinally, suppose that fraudulent online transactions are now showing up on that card. These fraudulent charges are all from new merchants, rather than additional unauthorized charges from merchants that the card had been legitimately used with.\n\nQuestion: is chip + signature sufficiently secure during card present transactions that one may conclude with reasonable certainty that it was one of the online merchants that has been breached?\n\nI'm curious because fraudulent charges have started appearing on one of my cards. It has been used mostly for card present transactions, with just a few online transactions (and only one within a few weeks of the fraud starting, and only two in the last year). I'm curious how strongly my suspicion should be directed to those two online merchants (both of whom for which I declined their offer to keep my card on file...).\n\nThanks.",
        "created_utc": 1514955721,
        "upvote_ratio": ""
    },
    {
        "title": "Why is TCP port 3826 (Wormux) open?",
        "author": "Relheub",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nrnoj/why_is_tcp_port_3826_wormux_open/",
        "text": "I recently did an nmap scan of my mac and found that tcp port 3826 was open. Under service, nmap identifies it as wormux. From what I've found, wormux appears to be a game, but I never intentionally downloaded it and I've never noticed this port open before. Obviously I'd like to find out 1) why it's open and 2) if it could be something malicious. When I search for wormux using Spotlight in MacOS, no results turn up. Any and all insights appreciated.",
        "created_utc": 1514947662,
        "upvote_ratio": ""
    },
    {
        "title": "Security tools you've created or modified using Python?",
        "author": "SudoPatriot",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nojpa/security_tools_youve_created_or_modified_using/",
        "text": "Have any of you created security tools in Python? If so how did you go about it? I ask because I am novice in Python and want to be able to get my foot in the door applying it to security but am having trouble being able to go about this process. ",
        "created_utc": 1514920112,
        "upvote_ratio": ""
    },
    {
        "title": "Interview for a SOC analyst",
        "author": "originalroadman",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nnqig/interview_for_a_soc_analyst/",
        "text": "So I have a job interview for a Junior SOC analyst for a large international company. I already had a phone interview so now they are wanting face to face one. I am here as I am not sure what the job would involve. In my phone interview I was asked about cross site scripting, do i know any scripting and synchronous/asynchronous attacks. Can you guys help me shed some light on the role.\nOH, and some tips on what questions to ask and any study material that could help me excel at the interview.\nI have been in IT for a few years now and have just passed my CCNA R&amp;S so not new to IT field.\nEDIT: This is for a junior role so previous knowledge isn't necessary just desirable\nThanks",
        "created_utc": 1514913055,
        "upvote_ratio": ""
    },
    {
        "title": "Nessus Scanner",
        "author": "tcritch05",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nnaqd/nessus_scanner/",
        "text": "Does anyone know how to correlate a scan UUID (found in the reports directory) to a scan name in the GUI? I'm trying to remove/review some of the larger reports but I can't figure out exactly how to determine which is which...\n\n\nExample:\n\n# du -hsx * | sort -rh | head -5\n\n3.7G   xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxxxxxxxxxxxxxxxxx\n3.3G   yyyyyyy-yyyy-yyyy-yyyy-yyyyyyyyyyyyyyyyyyyyyyyyyyy\n3.2G   zzzzzzz-zzzz-zzzz-zzzz-zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz\n3.2G   aaaaaaaa-aaaa-aaaa-aaa-aaaaaaaaaaaaaaaaaaaaaa\n2.7G   bbbbbb-bbbb-bbbb-bbbb-bbbbbbbbbbbbbbbbbbbbbbbbb",
        "created_utc": 1514909176,
        "upvote_ratio": ""
    },
    {
        "title": "Virus Removal Question",
        "author": "hajimenogio92",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nn1k2/virus_removal_question/",
        "text": "Hey guys, hope everyone had a nice new year. I have a question, one of the in laws asked me to take a look at their Windows 7 PC which they thought was infected with viruses/malware. I went through and noticed that something had manually deleted the security software they had in there before I had a chance to look at it. I restarted the PC in safe mode, added malwarebytes, avast, zonealarm firewall and updated all the drivers also. So my question is, would the best option to ensure the malware was removed would be to have a clean re-install of the OS? I'm trying to convince them buy a new PC considering it's a pretty old laptop or have them install an easy to use Linux Distro like Mint. Any other suggestions? Thanks!",
        "created_utc": 1514906718,
        "upvote_ratio": ""
    },
    {
        "title": "How do I get started in NetSec?",
        "author": "rlcaust",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nlrxs/how_do_i_get_started_in_netsec/",
        "text": "18 Year old student with very very basic knowledge of python and C# but pretty good knowledge of networking, and overall the guy everyone asks to fix their computer. \n\nI’ve tried to get started in NetSec and have watched tutorials (specially about pen testing) and tried to follow along and most of the time to success but I reach a point where I feel like I’m using Metasploit and just being a script kiddy following along certain tutorials. I’ve tried CTF but I always hit barriers where I’m unsure what to do. \n\nWould you guys and girls be able to suggest any books, materials or starting point to get into Network Security or any ideas about where to start? \n\nFYI: in Australia. ",
        "created_utc": 1514890651,
        "upvote_ratio": ""
    },
    {
        "title": "Same old question for 2018 (Password building )",
        "author": "xterz1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nkmno/same_old_question_for_2018_password_building/",
        "text": "I recently were hit by a nasty malware , and since then i decided to change my habits when it comes to password managing and creation.\n\nBut i keep hitting that same wall despite going through several reddit posts:\n\n\n- Its better to have an long and complex password compose with alot of numbers and symbolic characters , or something extensive not fairly complex but can be memorized ( in terms of security)?\n\n- I know its kinda stupid question but if taken the hashcat capabilities,  shouldn't be more dangerous having a password compose of words that can be part of a wordlist ( when taking the passphrase build approach) ? versus a random string ? \n\n- What about mixing ? (random string) + *actual memorable stuff* \n\nIf the long and random approach is the safest, what i can do to make my life easier ( managing 30+ different accounts , probably 15 of those are important ,  I do know about managers but really cant seem to like them )\n\n- I'm no Server owner or anything so getting the most accounts with 2FA and at least write down the most tedious complex passwords outside my pc , like in a notebook shouldn't be a problem right ? as long i keep it safe ?\n\n- What about storing them in my phone ? How can i do it safely ? I do own a windows phone , so the number of apps gets limited *[ Worse purchase made ]*\n\nI wanna apologize if this is the 930193n time someone made this questions but any guidance would be very hopeful.\n\n\n",
        "created_utc": 1514873389,
        "upvote_ratio": ""
    },
    {
        "title": "College kid looking to Skype call a few cyber/SOC analysts for ~20 mins this week for an open source security orchestration project. I'll compensate you for your time.",
        "author": "yaraz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7njwxi/college_kid_looking_to_skype_call_a_few_cybersoc/",
        "text": "I'm a UC Berkeley undergrad who's been working on this open source security orchestration project: www.getorchestrator.com\n\nI want to improve my project, so I'd like to talk to a few cyber analysts for around 20 minutes on Skype. \n\n**Any day this week, 10 AM - 10 PM PST. I'll pay you $10 for your time (PayPal/Venmo) at the end of our call.**\n\n**What I want to learn from you**  \n- how the project can be improved  \n- what you thought was the most useful part of the project  \n- what are your specific needs as a cyber analyst  \n\n**If you're interested**  \n- email vpatel98@gmail.com OR  \n- post your email address below; i'll follow up\n\nEDIT: Phone call or conversation on slack/IRC is fine too.\n\nThanks everyone!\n",
        "created_utc": 1514864765,
        "upvote_ratio": ""
    },
    {
        "title": "Home network getting scanned repeatedly by some specific IP addresses",
        "author": "netsecq_throwaway",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nglzv/home_network_getting_scanned_repeatedly_by_some/",
        "text": "My home network infrastructure has three components:\n\nGeneric ISP-provided modem/router ---&gt; reasonably-high-performance Ethernet switch --&gt; WiFi router serving as DHCP server\n\nI think my network security is okay:\n\n* The modem/router has a firewall set to typical security: unsolicited inbound traffic should be categorically blocked.\n\n* Remote administration is turned off for the modem/router. All three infrastructure components have unique, complex passwords for the administrative interface.\n\n* No ports are forwarded, and nothing is placed in the DMZ.\n\n* I've scanned my IP address using the Gibson Research ShieldUP scanner, and it tells me that all of the first 1,056 ports are \"stealth,\" i.e., no responses from any packets.\n\nMy WiFi router sends me daily logs of activity, most of which is ordinary DHCP requests. However, the logs often contain notices of ACK scans and RST scans. I've searched for info about this, but most comments seem to be: \"It's normal, disregard it.\"\n\nRecently, those scans have picked up a lot - and I'm noticing a lot of scans from a few specific IP addresses. Today's log shows 36 ACK scans or RST scans in the last 24 hours, with 25 of them coming from one particular IP address.\n\nSo I've got two questions:\n\n1) I've been concerned that I am receiving these notifications from my WiFi router, which means that the traffic is passing through the firewall on the modem/router (as well as the switch). I really do not want anything behind the firewall to be reachable by unsolicited inbound traffic, yet that does seem to be happening, so I am questioning the effectiveness of the firewall. Am I correct to be concerned, or am I not understanding something about this traffic?\n\n2) I'd really like to blacklist those IP addresses so that my modem/router literally drops all traffic from them. The modem/router has a lot of tools, including routing configuration stuff, but nothing jumps out as the best and easiest way to accomplish this result. What should I be looking for?\n",
        "created_utc": 1514830983,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find a good exploit development forum where I can ask related questions?",
        "author": "xxByte",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nfo3x/where_can_i_find_a_good_exploit_development_forum/",
        "text": "even better if it's a sub reddit.",
        "created_utc": 1514821006,
        "upvote_ratio": ""
    },
    {
        "title": "Setting up a honeypot",
        "author": "Hackers-are-bad",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7neunh/setting_up_a_honeypot/",
        "text": "What I want is a way to record which ports are “scanned”, every time someone attempts a TCP connection on port x. I want it recorded so I can view a list of the most scanned ports on my honeypot. I know SSH, telnet, samba and HTTP are going to be significant as lots of crawlers exist however I’m looking to identify which other ports are checked frequently by automated crawlers.\n\nI can’t really think of a way of doing this. My only idea is setup a python script that listens on every port and connects to a database, logging the connections. This doesn’t sound very efficient and screams bad idea. Wireshark/tcpdump on the other hand does this the right way and captures connections on all ports. \n\nDid think about piping wireshark to a regex filter real time and recording the ports but I’m not sure how to filter out “on going” connections, e.g 100 packets send over SSH != 100 connection attempts.\n\nDid quite a bit of research with google and I can’t find any public code to do this, happy to write it myself, just want advice on the best approach to take.",
        "created_utc": 1514808491,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with network logs",
        "author": "theposhlad",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nesgq/need_help_with_network_logs/",
        "text": "I have a Link dir 505 router that comes with a USB port for making a media server. Is it possible to monitor network traffic, databases and network usage and log it all to the thumb drive connected to my router? Please point me in the right direction.\nWhat should I learn to be able to play around with surveillance and monitoring?",
        "created_utc": 1514807350,
        "upvote_ratio": ""
    },
    {
        "title": "Exhaustive List of Netsec/Cybersec Specializations.",
        "author": "vinnishi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nblye/exhaustive_list_of_netseccybersec_specializations/",
        "text": "Hi everyone,\n\nI'm quite new to security but have a strong interest in diving into the different career paths and education opportunities within the entire realm of cyber security.\n\nI've seen many of the security specializations spread out throughout different websites and posts here on the different netsec subreddits, but I was wondering if there was a (mostly) exhaustive list of all security specializations available.\n\nSo far I've seen specializations such as: Network Security, Application Security, Web Security, Reverse Engineering, Malware Analysis, Computer Forensics, Database Security, Internet of Things, etc.\n\nIf you know of any websites/documents that would outline a good deal of these mentioned specializations and more, I would greatly appreciate it.\n\nThank you,\n\nvinnishi.",
        "created_utc": 1514761032,
        "upvote_ratio": ""
    },
    {
        "title": "Firewalking, still relevant today?",
        "author": "HDKramer",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7nb7if/firewalking_still_relevant_today/",
        "text": "Hello everyone, I wanted to hear netsec's opinions about firewalking.\n\nI read the stuff of blackhat.com, David Goldsmith &amp; Michael Schiffman and other stuff I found on the web but it seems to be quite old...?\n\nIs this stuff still relevant today? Can you still firewalk like that with traceroute, firewalk or nmap? Aren't the new systems 'secured' &amp; able to counter those techniques?\n\nCheers",
        "created_utc": 1514756565,
        "upvote_ratio": ""
    },
    {
        "title": "Small business cybersecurity consulting",
        "author": "cyberquestions",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n9twa/small_business_cybersecurity_consulting/",
        "text": "I've been asked to help out an acquaintance who owns a small business. Unfortunately, I know pretty much nothing about enterprise security.  I am hoping someone can point me in the direction of a larger / national firm that I can refer them to.  \n\nI looked through security services offered by IBM, Sophos, and some random other companies, but at first glance they mostly seem to be interested in peddling their software solutions.  \n\nI'm looking for a company that can come in and assess what this business needs. Do they just need to ditch their terrible outsourced IT service? Do they need training for staff members? Do they actually need some fancy software solution?  \n\nThanks for your time\n\n",
        "created_utc": 1514742462,
        "upvote_ratio": ""
    },
    {
        "title": "What do you HATE about security orchestration today?",
        "author": "yaraz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n71t3/what_do_you_hate_about_security_orchestration/",
        "text": "I was reading about security orchestration and automation (SOC) lately. Seems really useful, but for some reason it hasn't caught on.\n\n* What do you think about the current SOC vendors?\n* What features do you want in a SOC product?  \n\nI appreciate everyone who take out their time to reply. Thanks!!\n\nEDIT: This is not a homework question. I was just wondering.\n",
        "created_utc": 1514701722,
        "upvote_ratio": ""
    },
    {
        "title": "I’m starting uni in 9 days how can I build my cybersecurity career while getting my degree?",
        "author": "danisnowman",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n6l0m/im_starting_uni_in_9_days_how_can_i_build_my/",
        "text": "Title says almost everything. Starting a Computer Science degree and I have some questions in what things should I focus more in order to be able to work on cybersecurity? \n\nHow do I build up my career before actually getting my degree? What’s the best way to get me started on cybersecurity? I know almost nothing of code, I’ve just played around Arduinos but I’m starting to learn Python. Also I am learning how to use Linux and feel comfortable with a terminal.",
        "created_utc": 1514695472,
        "upvote_ratio": ""
    },
    {
        "title": "Given the fact that I’m university in 9 days, on what things should I focus to be able to work in cybersecurity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n6iqh/given_the_fact_that_im_university_in_9_days_on/",
        "text": "[deleted]",
        "created_utc": 1514694675,
        "upvote_ratio": ""
    },
    {
        "title": "Opportunity to do intern thesis at a port on information/cyber security. Need help with topic",
        "author": "Bert-en-Ernie",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n5frn/opportunity_to_do_intern_thesis_at_a_port_on/",
        "text": "Hi /r/AskNetsec! \nAfter finishing all my courses of my Masters in Business Information Management I have gotten an opportunity to do my thesis internship at a large port in Europe. While not having deep technical knowledge, I am asked, and am really enthousiastic about, to research a information/cyber security related topic. As this is a field I have become really interested in I also started to learn some programming and am learning as much as possible on the topic. Meanwhile, I do have understanding of IT-business related topics and could therefore 'tackle' this topic search by looking at it from this angle. For example risk; digitalization influence on cyber risk, and; awareness of cybersecurity across the port are topics that come to mind. These topics are however still quite broad and vague and this is why I am asking you guys for tips and thoughts what things would be interesting to have a look at. I have briefly summed up some possible research topics that I have come up with and would be very glad with suggestions that might narrow these topics down!\n\nI read your topics daily and love you guys as a community, many thanks to all the help you give to everyone! \n\n\n* **Topics:**\n* Digitalization of Ports and its relation to risks and threats to security.\n* Awareness as a driver for a more cyber resilient environment in ports.\n* How regulation and guidelines can help steer ports toward a more cyber resilient environment.\n* Research into port systems evolution to drive a secure port\n* Threats of organized crime and how to go forward on this growing problem. (I think this is a really interesting topic, however im not sure whether this is researchable. (think of interviews with people involved etc.)\n* How can the port translate the 'technical' talk to be more understandable for business, i.e. make cybersecurity accessable for management and employees.\n* Implementing a (long term) cyber security strategy. (what would this look like and what are the implications)\n* Risk assessment of vulnerability across the various parts of the port, e.g. storage, boat-to-shore systems, oil.\n* Managing issues that come from the many different private owners in the port, and how to unite the port as one cybersecurity stronghold.\n\n\n\n\n\n\n",
        "created_utc": 1514681998,
        "upvote_ratio": ""
    },
    {
        "title": "Best way to transfer screenshots/notes from an infected analysis box?",
        "author": "T0nk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n1e7b/best_way_to_transfer_screenshotsnotes_from_an/",
        "text": "",
        "created_utc": 1514638092,
        "upvote_ratio": ""
    },
    {
        "title": "Home network firewall, should I prefer a linux PC or a dedicated device?",
        "author": "JavierTheNormal",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7n0k7f/home_network_firewall_should_i_prefer_a_linux_pc/",
        "text": "",
        "created_utc": 1514622927,
        "upvote_ratio": ""
    },
    {
        "title": "Webapp security code review standards/guidelines/cheatsheet?",
        "author": "h41zum",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mxz3p/webapp_security_code_review/",
        "text": "I'm a Sr web dev about to start doing security code reviews in my current job after noticing the low quality security-wise of the products we shipped.\nI'm certainly not a master on this matter so I'm trying to get my hands on anything I find about this topic.\n\nI've been reading stuff from OWASP (Top10, ASVS, code review guide, proactive controls, SKF and about to start reading the testing guide too)\n\nSince I'm so OWASP-biased now I was wondering if there are some other resources to be taken in consideration too, maybe to compare them and find a balance or a wider area of knowledge. \nAlso, any personal advices are welcome\nThanks!",
        "created_utc": 1514590739,
        "upvote_ratio": ""
    },
    {
        "title": "IoT Hacking: TCP / UDP transparent proxies?",
        "author": "drstarskymrhutch",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mvify/iot_hacking_tcp_udp_transparent_proxies/",
        "text": "Been a couple years since I stepped away from the consulting game. A couple years back, I used to use Mallory to intercept and manipulate proprietary TCP/UDP streams for IoT communications with backend servers.  Was going to get back into doing some IoT bug bounties and went to install but Mallory doesn't appear to still be supported. The git repo is still available (https://github.com/intrepidusgroup/mallory) but no updates for a while, and the support site has been taken down (http://intrepidusgroup.com/insight/mallory).  Are there any other good solutions that have emerged (as mallory was always a bit of a PITA to setup anyways)...or is Mallory still the standard?",
        "created_utc": 1514567182,
        "upvote_ratio": ""
    },
    {
        "title": "Generating an invite code for Hackthebox.eu",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mv5ul/generating_an_invite_code_for_hacktheboxeu/",
        "text": "[deleted]",
        "created_utc": 1514563796,
        "upvote_ratio": ""
    },
    {
        "title": "Howto digitally watermark powerpoint files in hidden way ?",
        "author": "joker197cinque",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mtffh/howto_digitally_watermark_powerpoint_files_in/",
        "text": "Hi guys,\nis it possible (and how) to include a hidden digital watermark into powerpoint files ?\nThanks",
        "created_utc": 1514540901,
        "upvote_ratio": ""
    },
    {
        "title": "Should an application security engineer have development experience?",
        "author": "notpciguru",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mrxkd/should_an_application_security_engineer_have/",
        "text": "I am stuck in a position of not really knowing where I want to take my career. I have a few years of security related experience, which I started in right out of college. My experience has been in compliance/general infosec, infrastructure security engineering (AWS security, HIDS, etc), some web/mobile app pen testing, etc. \n\nI don’t have a ton of programming experience...most of my experience is from self learning, automation of various tasks, and just for fun. I really like programming and would love to be able to transition to application security. To be honest, I’m of the school of thought that app sec engineers should really have some development experience in order to truly understand software and the security concerns around that. I would almost be willing to take a step back and do development for a few years, but I think it would be hard for me to get a comparable job that I have now due to the fact that I’d be pretty new to the field.\n\nDoes anyone have any experience with this? Can you be an effective app sec engineer without some development experience to supplement it?",
        "created_utc": 1514520437,
        "upvote_ratio": ""
    },
    {
        "title": "What path should a software developer take towards learning how to design robust software",
        "author": "jollybobbyroger",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mqbxf/what_path_should_a_software_developer_take/",
        "text": "For me, the most exciting thing about software development is elegant, robust and functional design.\n\nMany of my school peers were amazing at reversing, exploiting and devising beautiful hacks, but I was more interested elegant design and what makes a piece of software nice to use and work with. \n\nNow that I am starting to get a handle on software design, I see a glaring necessity to improve on my security skills to improve the robustness of the software I design.\n\nWhat courses or certifications should I take if I want to not only understand security, but also implement the best security practices for web services? To me, learning pentesting seems fun and important, but if a course stops there without guiding the user about best practices and good patterns for creating secure software and services, I would not be very interested in paying money for such a course.\n\nI have experience with network, systems and web programming along with low level Linux knowledge, so I don't need much education covering the fundamentals.",
        "created_utc": 1514503619,
        "upvote_ratio": ""
    },
    {
        "title": "is it possible wipe MBR/bootsector only using the command prompt via windows installation disk?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mpyo0/is_it_possible_wipe_mbrbootsector_only_using_the/",
        "text": "[deleted]",
        "created_utc": 1514500072,
        "upvote_ratio": ""
    },
    {
        "title": "What technologies are you researching for 2018?",
        "author": "trippin315",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mo6uk/what_technologies_are_you_researching_for_2018/",
        "text": "I am just curious what the rest of you are looking at for the upcoming year as far as new technologies or services. What are you, as an infosec analyst/engineer/manager thinking is going to be the next big threat and how are you planning on mitigating that?\nI'll start. We are moving ahead with MFA and IDaaS. We are also planning on doubling down on Awareness. We are also going to be looking into a solid app whitelisting solution. ",
        "created_utc": 1514484113,
        "upvote_ratio": ""
    },
    {
        "title": "Web \"Hack\" books -- not sure if this is completely relevant here",
        "author": "Some_ITguy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mo038/web_hack_books_not_sure_if_this_is_completely/",
        "text": "Sorry if this is the wrong place, but I was wondering if anyone could recommend any of the tons of \"web hacking\" books on amazon. Not sure if they are all crap that only sells cause of hacker marketing or if they actually have useful content where a beginner could learn something and know how to protect their website.\n\nAny recommendations?",
        "created_utc": 1514482397,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not rich, so OSCP is out. I already have programming and Linux experience, are there alternatives to oscp or intermediate tutorials?",
        "author": "jokoon",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mmtel/im_not_rich_so_oscp_is_out_i_already_have/",
        "text": "I have experience in C, C++, python, PHP, SQL, Linux and so on, and never tried anything related to computer security. Are there places and computers I can try to hijack?\n\nI'm also interested in learning how to exploit a buffer overflow.\n\nI also use IRC quite often.",
        "created_utc": 1514470573,
        "upvote_ratio": ""
    },
    {
        "title": "Does it matter if I have email encryption or not?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mmsvp/does_it_matter_if_i_have_email_encryption_or_not/",
        "text": "[deleted]",
        "created_utc": 1514470387,
        "upvote_ratio": ""
    },
    {
        "title": "Trouble setting up Kioptrix on Virtualbox",
        "author": "Sn4k3008",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mkpmh/trouble_setting_up_kioptrix_on_virtualbox/",
        "text": "I am currently trying to set up Kioptrix 1 in virtualbox, but kali can't find it on the network. I've tried bridging, internal network, host-only, and NATing, but it seems that no matter what, Kioptrix isn't getting assigned an IP address. Does anyone have any ideas what's happening? thanks!",
        "created_utc": 1514439534,
        "upvote_ratio": ""
    },
    {
        "title": "Learning some basic pentesting and and script kiddie goodyness, at what point am I breaking the law?",
        "author": "Scumhum",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mj9gj/learning_some_basic_pentesting_and_and_script/",
        "text": "Title probably makes no sense. \n\nMy question was how far can I go on someone else's website before It's illegal? Nmap? Recon-ng? Maltego? Is vulnerability assessment illegal? \n\nthanks!",
        "created_utc": 1514423202,
        "upvote_ratio": ""
    },
    {
        "title": "I got an email from StubHub (service@paypal.com) and I didn't sell anything?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mj662/i_got_an_email_from_stubhub_servicepaypalcom_and/",
        "text": "[deleted]",
        "created_utc": 1514422256,
        "upvote_ratio": ""
    },
    {
        "title": "VPN Question",
        "author": "kiedi5",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7miwhu/vpn_question/",
        "text": "I understand how using a VPN protects you from sniffing attacks, etc. on your LAN but a does a VPN necessarily guarantee security from their servers to the open Internet? Couldn’t you be vulnerable to traffic sniffing (or some other similar attack) between the VPN provider and the other host since the encrypted tunnel is only set up between you and the VPN server? ",
        "created_utc": 1514419528,
        "upvote_ratio": ""
    },
    {
        "title": "When I run nmap on my Uni's wirleless network, why do only see AP and my device?",
        "author": "backupbettyl47",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mii4b/when_i_run_nmap_on_my_unis_wirleless_network_why/",
        "text": "Why don't I see no others, even though my roommates are associated with the same AP as well? \n\nEdit: [SOVLED] TIL about 'AP Isolation'.  Thank you to those that have brought this to my attention. ",
        "created_utc": 1514415550,
        "upvote_ratio": ""
    },
    {
        "title": "Pointers for analyzing packet data",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7midt2/pointers_for_analyzing_packet_data/",
        "text": "[deleted]",
        "created_utc": 1514414439,
        "upvote_ratio": ""
    },
    {
        "title": "How to Configure DotNet Security Guard Roslyn Security Guard to visual studio 2005",
        "author": "damuzxc",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mia9a/how_to_configure_dotnet_security_guard_roslyn/",
        "text": "\n\nThe Roslyn analyzers can be run from Visual Studio by lauching a new build with this extension enabled. More : https://marketplace.visualstudio.com/items?itemName=PhilippeArteau.RoslynSecurityGuard\n\nHow to Configure this extension enabled to visual studio 2005\n\nAnyone Good resource link please share and any other tool DotNet Source Code Review Open Source Tools\n",
        "created_utc": 1514413458,
        "upvote_ratio": ""
    },
    {
        "title": "Security/Pen Testing from software engineer?",
        "author": "echo_Sail",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mfohz/securitypen_testing_from_software_engineer/",
        "text": "Some background: My education is in mechanical engineering and I worked for about 2 years as a process/chemical engineer in manufacturing. I got into Java and then Python for statistical analysis and automating things. Over the next 2 years transitioned from my chemical engineering role to a software engineer, picking up JavaScript + frameworks and doing API + web development. About a year ago I took a new job as a dedicated software engineer in a different industry doing full stack web development. So ~5 years out of school. I'd say I am confident with bash, SQL of multiple flavors, python, Java, JavaScript and have hosted/managed both Windows &amp; Ubuntu servers (but certainly wouldn't call myself a sysadmin).\n\nMy first experience with security was sort of by accident, troubleshooting and implementing DCOM with industrial POC computers and servers. Over time I've ran into the expected amount of security issues through web development. In both cases I found I really enjoyed working through those problems and always found them rewarding but never really considered it as a possible career. \n\nAt work a separate team ran into a big security issue on their project and I got to help out. Without going into details I found the method the attacker used to be pretty fascinating (and luckily it caused little to no lasting damage), but it has made me very interested in security. I find right now I have an exclusively defensive mindset about security and don't know how to approach the offense so pen testing in particular seems really interesting. I was wondering how well the skills of a software engineer transition to this field, and if anyone here has done it before and could share their experience. Any particular path to take, courses/certifications, or even the best way to just dive in.\n\nAppreciate your time for reading this and thanks in advance for any help you can provide.",
        "created_utc": 1514388974,
        "upvote_ratio": ""
    },
    {
        "title": "I keep getting breached, need advice",
        "author": "NitecoreSUNVITO",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7melpa/i_keep_getting_breached_need_advice/",
        "text": "Hi, so while I am a security enthusiast I'm having some issues here. My accounts keep getting breached and I suspect someone have access to something and I can't confirm what. Some background info:\n\n- I lost my desktop in the mail (non-encrypted harddrives, only protected by Windows 10 login so I'm certain whoever has the PC now has bypassed that ages ago. \n- It makes me somewhat paranoid, even though I reset lots of my passwords when I recieve emails and SMS regarding 2FA which is all enabled on the most important services (FB, Steam, Email, Banking etc)\n- My passwords werent bad so they have not been brute forced and I also used Lastpass for 95% of my services. Unfortunately I cannot access my LP account anymore because I believe someone changed the password (I had it written down in my locked notes on my iphone so I know I haven't forgot it)\n- Over the past months my Spotify has been breached multiple times even after changing passwords, and even after i reformatted my PC. Disconnected it from my FB now. \n- When I thought it was all over today, I got a message that someone from South Africa is trying to log into my steam account (No I'm not running a VPN there) \n\nI really need to do a full wipe, taking any suggestions. Currently need a new password manager, I m also running Win10 as desktop OS due to gaming, would like to dual boot though with Linux Mint. Maybe create myself a new email? And I'm fairly technical and I know how to set up things. Also I live remotely so no one has sniffed my network either. Knowing a lot about security makes this even worse, however I think it all is related to the loss of my PC where my lastpass was probably logged in.\n\nAny advice appreciated. \n\n",
        "created_utc": 1514375575,
        "upvote_ratio": ""
    },
    {
        "title": "Best password safe for family?",
        "author": "verchalent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mc78d/best_password_safe_for_family/",
        "text": "Historically, I've taken a hard-line approach to my password security. That has led me to steer clear of online password managers. Unfortunately, this approach is I've that is beyond what my family is willing to use. So, in an effort to raise the total security posture, I've decided to sign up for a family plan somewhere. The question is where? \nMulti platform (win, Mac, nix, chromeos), as is ease of use.",
        "created_utc": 1514341901,
        "upvote_ratio": ""
    },
    {
        "title": "How to transition into a security engineering role?",
        "author": "ultraNushi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mc0b6/how_to_transition_into_a_security_engineering_role/",
        "text": "Hi there!\n\nFirst of all, thank you for stopping by to check out my very first reddit post.\nMy goal is to move my career into the cybersecurity field and your advice will be much appreciated. \nSome of the positions I have been looking into are Security Engineer, and Privacy Engineer. To be more specific , I am interested in product security - from driving security requirements, to secure coding, and even penetration testing. As far as the privacy aspect, I would definitely be interested into venturing into differential privacy, and working on a team which builds privacy geared tools.\nSome of the most common responses I have received from the hiring teams are  \"You have a great attitude but lack the necessary experience.\"\nTo shed some light on what my current experience is:\nI have a BS in Computer Engineering, and a MS in Cybersecurity (obtained this year) degrees. I have been a full time engineer for the last 5 years during which I have held positions as a test engineer; I am a SDET currently working for a large corporation. My strongest coding language is java but I have contributed to work projects in other languages as well. \nAs far as the technical interviews go, I tend to think I do okay on the coding portion but I do worry that having \"test\" in my title gives interviewers less confidence in my skills.\nSome of the options I have considered are:\n- pursuing entry level roles\n- going back to school for a PhD\n\nEverywhere I look, it seems that there is an abundance of senior level positions but very few entry level roles.\n \nI am curious to hear what the reddit community thinks.\n ",
        "created_utc": 1514339716,
        "upvote_ratio": ""
    },
    {
        "title": "Security Topic for Independent College Course",
        "author": "DecafDicaprio",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mbz97/security_topic_for_independent_college_course/",
        "text": "Hello \n\nI signed up for a course where I come up with my own subject to learn in security and make assignments for myself. I am having trouble coming up with a good topic. Whenever I think of one, I end up crossing it out because it seems too obvious and unchallenging. I feel like I can't come with a good one because I simply don't know enough. What is a security topic that will give valuable knowledge or experience for future security job? \nMy knowledge level right now is CCNA and Security+ with medium RE knowledge. I spend my free time reading CTF solutions.\nI really hope to learn a lot from this opportunity. Thanks!",
        "created_utc": 1514339384,
        "upvote_ratio": ""
    },
    {
        "title": "Have you read Gray Hat C# or Wicked Cool Shell Scripts ?",
        "author": "TichuMaster",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7mavxx/have_you_read_gray_hat_c_or_wicked_cool_shell/",
        "text": "Hello guys.  \nHave you read any of these books? Are any good? There are on [this](https://www.humblebundle.com/books/be-a-coder-books) bundle and I am thinking buying it just for these 2.",
        "created_utc": 1514327820,
        "upvote_ratio": ""
    },
    {
        "title": "A quick question about tracing a downloaded PDF.",
        "author": "noeggfoyoufatboy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7malz4/a_quick_question_about_tracing_a_downloaded_pdf/",
        "text": "I have some documents that I would like to download (and later distribute) from my login on the private network of the cult (Jehovah's Witnesses) that I am leaving.  I am not leaving just yet though, so I would like to know if they can track back to the user that downloaded the PDFs if I post them online.  Thanks for your help!",
        "created_utc": 1514325102,
        "upvote_ratio": ""
    },
    {
        "title": "What's your opinion/experience with elearnsecurity.com",
        "author": "PapachongoMr1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ma43m/whats_your_opinionexperience_with/",
        "text": "Seems to be a good option. I welcome your inputs",
        "created_utc": 1514320203,
        "upvote_ratio": ""
    },
    {
        "title": "How are the new password guidelines not easy prey for dictionary attacks?",
        "author": "Technificent989",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m9rxh/how_are_the_new_password_guidelines_not_easy_prey/",
        "text": "A few months ago, [Wall Street Journal](https://www.wsj.com/articles/the-man-who-wrote-those-password-rules-has-a-new-tip-n3v-r-m1-d-1502124118) broke the story about the \"letters, numbers and symbols\" method we've been preaching for over a decade wasn't at all effective in making a good password. (Most of it is behind a paywall. [Gizmodo](https://gizmodo.com/the-guy-who-invented-those-annoying-password-rules-now-1797643987) references the key points) The current guidelines (from NIST) are to focus on creating a password that's long above all else, as XKCD humorously points out.\n\nHow does this method end up not being exploited by a dictionary attack?",
        "created_utc": 1514316888,
        "upvote_ratio": ""
    },
    {
        "title": "Cloud Security pivot question",
        "author": "jscimeca715",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m9m1p/cloud_security_pivot_question/",
        "text": "I'm currently a cybersecurity engineer for an Air Force program that is currently designing a new version that is going to utilize cloud-based technologies such as AWS.  I currently have 6 - 7 years securing all types of machines in a traditional on-premise, locally managed network to include Windows (server/client), Linux, etc. I'm looking for advice on how to pivot into cloud-based security from those who have done it or are doing it. What education did you pursue? What programming languages did you learn, if any? My first thought was to start with AWS specific training along with some programming classes.  Any advice would be appreciated.",
        "created_utc": 1514315300,
        "upvote_ratio": ""
    },
    {
        "title": "Help me decide between offers",
        "author": "codfection",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m9bmm/help_me_decide_between_offers/",
        "text": "I received 2 junior position offers in CyberSecurity. One is SOC Analyst (Security Operations Centre) at a regional large bank. Other offer is Consultant in TRACS (Technology Risk Advisory and CyberSecurity) at one of the big 4 consulting firms (Deloitte, EY, PwC, KPMG)\n\nKindly guide me which offer would enhance my career growth in CyberSecurity.\n\nIf you were given these two job offers, Which offer would you go for and why?\n\nNote: pay is same for both\n\nThanks!",
        "created_utc": 1514312408,
        "upvote_ratio": ""
    },
    {
        "title": "I believe to be hit by a SSLstrip attack on my network. iOS only devices.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m73m0/i_believe_to_be_hit_by_a_sslstrip_attack_on_my/",
        "text": "[deleted]",
        "created_utc": 1514284196,
        "upvote_ratio": ""
    },
    {
        "title": "If I had a malicious keylogger back in 2009ish, is it likely those key log files are still out there?",
        "author": "Kurt2121",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m4ys1/if_i_had_a_malicious_keylogger_back_in_2009ish_is/",
        "text": "A bit of a paranoia question, but I was just thinking, where would that stolen data end up? The important credentials could be sold, but as far as the raw input, where would that end up with keyloggers you can catch in the wild?\n\nFor example..\n\nA keylogger being run from an IRC room. Does that data get relayed back to the chat room in most cases? Can it remain there for a long time? I don't know if IRC chats are indexed or searchable, but I feel like they probably aren't. Possible they are still in some chat?\n\nPublic site dumps is another one I heard. I really would like to see some samples of different keylogger dumps, just to get an idea what kind of system information they usually collect and etc. Can somebody show me some dumps? I looked around on pastebin but couldn't find any.\n\nI know sometimes there are dropzones, like weird domain names (e.g usenergy.us) and random numbers etc. Are these publicly accessible? I read that these dropzones usually have a life. Do they typically not stay up long? How long would keyloggers dumping to a server retain data?\n\nWhen a server is compromised by law or computer security folk(?) what happens to the data? Is it recorded as evidence or is it nuked? There must be some laws or procedures regarding that?\n\nAny help regarding these 4 topics, or any others I'm missing would be greatly appreciated!",
        "created_utc": 1514252954,
        "upvote_ratio": ""
    },
    {
        "title": "Do you need to hack to understand it?",
        "author": "37277",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m2wnr/do_you_need_to_hack_to_understand_it/",
        "text": "I have online course, do I need to follow along or can I soak it in? I’m not planning on becoming a master hacker. Just know what how it works. Thanks",
        "created_utc": 1514228139,
        "upvote_ratio": ""
    },
    {
        "title": "All those PC-Fears.",
        "author": "Swoboswaggins",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m2kta/all_those_pcfears/",
        "text": "I'll not hide the fact that I suffer from actual, clincally diagnosed paranoia which increases my chances of being hypersensitive significantly. So, please, bare with me, if you have the patience.\n\nQuite a few months ago, about 6, to be specific, I followed, like an idiot, a malicious link on my android phone, which was (at the time) connected to my home-network. It was done quite smart as well. It first directed me to a tumblr-page, and from there, to the actual malicious site, where it started to download something. \n\nI cut the Wi-Fi, scanned multiple times with Malwarebytes for android, which found nothing, and after that - i reset the phone completely.\n\nHere is where it get's a bit nutty, perhaps. On the same day, a few hours later, I logged into an E-Mail on my PC and got kicked, saying that I was logged in at another location. I was never connected to that E-Mail via my mobile, so my first thought was: I_am_fucked. \n\nWhatever my phone tried to download travelled through Wi-Fi right onto my PC, I thought. I scanned it multiple times with multiple types of Anti-Virus/Malware/Rootkit software. Nothing came up. \n\nSo I tried to shrug it of. An odd coincidence. Nothing more... And nothing more happened. There was no attempt made to change the E-Mails Information, no spam send, no foreign IP logged.\n\nBut ever since then, I've been terribly paranoid about any oddity at all on my pc - which is increased by the fact that I feel completely powerless to stop my imagined attacker. I've created all sorts of scenarios in my head, of somebody constantly listening to me, judging me, trying to hurt me in some way - lurking and waiting, just to drive me insane.\n\nThe latest thing to cause me to investigate way more than I probably should is the following:\n\nI run Win7, and today, an unnamed process prevented Windows from shutting down (the message was up for a second, at best) and, normally, I am able to find out WHAT program that is via the eventmanager (or Ereignisprotokoll in german).\n\nHowever, today, nothing was there. No process was recorded that prevented the shutdown. But THERE WAS a process preventing the shutdown, even if it was just for a second.\n\nSo, something like I've just described... Could that be a sign of something terribly wrong?\n\n\n",
        "created_utc": 1514224311,
        "upvote_ratio": ""
    },
    {
        "title": "What is the possibility of a rootkit such as darkcomet spreading through wifi and infecting devices with different operating systems?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m2jzk/what_is_the_possibility_of_a_rootkit_such_as/",
        "text": "[deleted]",
        "created_utc": 1514224041,
        "upvote_ratio": ""
    },
    {
        "title": "Can't capture 802.11 management frames - Wireshark",
        "author": "sephstorm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m0lix/cant_capture_80211_management_frames_wireshark/",
        "text": "Trying to see the authentication process through wireshark, but it seems this info isnt presented. Anyone know a quick and dirty way to turn on display of these frames?",
        "created_utc": 1514193852,
        "upvote_ratio": ""
    },
    {
        "title": "Several times in recent months: My android phone 'updated' suddenly (once while I was asleep &amp; once awake) &amp; did this despite settings (rebooted unexpectedly forcing me to type my login instead of fingerprint) ... but no recent 'updates' found in history?!?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7m06t4/several_times_in_recent_months_my_android_phone/",
        "text": "[deleted]",
        "created_utc": 1514185985,
        "upvote_ratio": ""
    },
    {
        "title": "Rogue pop-up impersonating Wal-Mart, plagues mobile devices",
        "author": "H4cKtiCal",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lzf6g/rogue_popup_impersonating_walmart_plagues_mobile/",
        "text": "A pop-up with raw ip in the URI here: 107.151.169.36/show.php?c=walmart&amp;p=6d39a65afaed4dd9f59cece898acdf5f&amp;subid=AB125059452515141736071801000&amp;t=1514173607&amp;sid=e3bec123aff2d5b2847832957f0901bd\n\nUnfortunately it appears that c parameter is sanitized ...just a random guess.\n\nled to here: www.consumerproductsusa.com/?0748--9eb5-0ccdd7eceb37&amp;isPrePop=true&amp;reward=walgc1000&amp;o=205047&amp;subaff1=61551151&amp;subaff2=203205&amp;subaff3=81693&amp;subaff4=Walmart1000&amp;DVID=\n\nThis server appears to have 8443, 443, 8080, and 80 TCP open simply providing a myriad of ports in case their victim is behind a firewall I assume. \n\nThese are all probably spun up by a script from Ansible and just sniping random expired domains, but I want their infrastructure to burn and to piss on the still hot ashes. \n\nDo any of you experience these random “redirects” to a bullshit pop up on a random amazon or Walmart themed cloud server subdomain? ",
        "created_utc": 1514174471,
        "upvote_ratio": ""
    },
    {
        "title": "Amazon Account Hacked",
        "author": "bob12345swn",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lyi6d/amazon_account_hacked/",
        "text": "Hey guys I'm not sure if I'm in the right place so feel free to redirect me if I have the wrong subreddit. Recently, my Amazon account had been hacked and the hacker placed multiple orders on my card. As a result, I called my bank and Amazon, got it all refunded, changed all my passwords, the email associated with my Amazon account, and added 2-Step verification. This morning, the same hack happened and the hacker tried to place an order on my card. How can I prevent this and how did he even get into my account without the verification code on my phone?",
        "created_utc": 1514161661,
        "upvote_ratio": ""
    },
    {
        "title": "SSL verification error",
        "author": "Shayan__",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lwl2l/ssl_verification_error/",
        "text": "I was surfing the web on my iPad using Safari and I came across saatvesaat.com.tr. On my iPad, it gave a security notification about the SSL and it requested me to trust the certificate. However, the domain was shady and I didn't. So I went back to my computer and tried to open the website on Chrome but I didn't receive the error and it shows that the SSL is verified. I tried other iOS and Android devices and none of them flagged this error. \n\nHere are the screenshots for more info:\nhttps://ibb.co/d9Ba5R\nhttps://ibb.co/dG7F5R\nhttps://ibb.co/h99jzm\n\nCan you help me to understand what's going on? Should I be concerned if I am being attacked by a middleman? why I only see this message on my iPad?\n\nUPDATE: The iOS version is 11.3.3. The time is set to automatic. Other SSL websites are fine. \nUPDATE 2: I have reset the network settings and Safari history but I still get this error on this particular website. \n\n",
        "created_utc": 1514139505,
        "upvote_ratio": ""
    },
    {
        "title": "Email spoofing explanation",
        "author": "pm_me_your_findings",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lvrl9/email_spoofing_explanation/",
        "text": "Hi \n\nThis week I took up on the issues of email spoofing. For red teaming purposes we generally use email spoofing so that we can let them know that the email came from that. \n\nIs there any guide, article or any conference talk which explains more about how the do email spoofing?\n\nI currently know only about the open Smtp servers and that ~ trick. \n\nThe problem with ~ trick is that the email ends up in the spam folder. So if you guys know any other tricks them please tell me about it. ",
        "created_utc": 1514130622,
        "upvote_ratio": ""
    },
    {
        "title": "CLOUDFLARE ISSUE",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lv13q/cloudflare_issue/",
        "text": "[deleted]",
        "created_utc": 1514120499,
        "upvote_ratio": ""
    },
    {
        "title": "Encrypt+Format vs Nuke for data removal",
        "author": "welkoom49999",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ltn37/encryptformat_vs_nuke_for_data_removal/",
        "text": "I've been interested in some of the topics around data recovery methods and encryption.\n\nI have one question. If i encrypt my whole drive partition (mechanical drive) and format that partition in an encrypted format (offline), this would mean the only recoverable data will be gibberish? even if i've used the drive for years and only decided to encrypt the disk that day. Is this the same for a virtual machine on my PC? i can fully encrypt its disk partition and delete it, the only recoverable data on that segment of the drive will be gibberish until it's over written?\n\nOfcourse nuking is better and you could do both for 100% paranoia..but i only ask as it seems like a better option for disposing of VMs rather than risking nuking the wrong drive partition.",
        "created_utc": 1514095150,
        "upvote_ratio": ""
    },
    {
        "title": "Reverse shell question. No spoilers please.",
        "author": "freelander83",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lrw5q/reverse_shell_question_no_spoilers_please/",
        "text": "I am currently enrolled in the OSCP course and I have popped a box and currently have a shell. However, I have been flummoxed with how to get the prize back to my attacking computer. I've tried netcat, SSH and I do get some sort of file back but im convinced its rubbish. The file is simple a read out of the established connection, not the hashes that make up the proof.txt. Any ideas would be appreciate but please just a nudge. Not a spoiler. I've tried hard on this.\n\nI should note that the reverse shell was setup with netcat and that is the environment im in now. I can navigate to /root directories and other locations but im just having trouble sending a file back to my machine.",
        "created_utc": 1514072625,
        "upvote_ratio": ""
    },
    {
        "title": "Tip of my tongue: RE livestream? Alternatively, other challenge/CTF streams?",
        "author": "eggy_breads",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lrtk8/tip_of_my_tongue_re_livestream_alternatively/",
        "text": "I'm not sure if I imagined/dreamed it all but I think I heard about this in a Slack group somewhere - guy streams himself doing various RE challenges. Not sure if it was on Twitch somewhere but haven't been able to find anything like this, any ideas?\n\nAny other suggestions (RE/general challenge or CTF streams, etc) would be welcome too - am rather inexperienced and tend to get stuck on some types of problems, thought watching others/seeing how they do it would be helpful.",
        "created_utc": 1514071785,
        "upvote_ratio": ""
    },
    {
        "title": "Exploit.In email/password",
        "author": "Entramos",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lr8n8/exploitin_emailpassword/",
        "text": "I also wanted to.",
        "created_utc": 1514065269,
        "upvote_ratio": ""
    },
    {
        "title": "Probably a stupid question: I know next to nothing about computers, is it possible to learn NetSec without college?",
        "author": "WaterwornDay",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lqbdi/probably_a_stupid_question_i_know_next_to_nothing/",
        "text": "I'm in a job at the moment that I really, really hate. I've been looking around for a field that interests me but I've been having a hard time. I recently did a tiny bit of programming (and I really mean tiny) and found it quite enjoyable, which lead me into reading about programming, which lead into reading about security which I found really interesting. Part of the problem stopping me from pursuing it anymore is that I know next to nothing about computers, let alone computer science.\n\nIs it possible to go from 0 to 100 on your own in this field? How would one go about doing it?",
        "created_utc": 1514055432,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good and bad Enterprise level antivirus programs?",
        "author": "alcon835",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7loky5/what_are_some_good_and_bad_enterprise_level/",
        "text": "Considering replacing an Enterprise's AV and looking for recommendations. Something that does well on workstations s and servers (windows and Linux).\n\nMostly looking for recommendations and thoughts on the various vendors. How does Cylance, Crowd Strike, Carbon Black, and the other new AV vendors do in the space? Anything you've had specifically do really well without meaningfully impacting the business?",
        "created_utc": 1514035145,
        "upvote_ratio": ""
    },
    {
        "title": "Could i monetize these spammers?",
        "author": "wow0wer5ty",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lmmk8/could_i_monetize_these_spammers/",
        "text": "I was reading about forcing users to mine monero (crytpo that mines well with CPU) by visiting your page using javascript and their CPU. I have a site that has been inactive for a while and it appears the SEO has caused [a lot of daily bots](https://i.imgur.com/yt1wmR4.png)\n\nWould it be possible to use their CPU to mine crypto? if not why?",
        "created_utc": 1514003097,
        "upvote_ratio": ""
    },
    {
        "title": "Aircrack-ng question",
        "author": "sephstorm",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ljbfe/aircrackng_question/",
        "text": "I'm attempting the WEP cracking, and when I start Airmon-ng in Channel 1 (same as the AP) and confirm va iwlist, when I attempt to use aireplay suddenly the channel changes and I get the message that the interface is in a different channel. Any idea wtf is going on and how to resolve it?",
        "created_utc": 1513967744,
        "upvote_ratio": ""
    },
    {
        "title": "Need code vulnerable to specific exploits [research]",
        "author": "razeal113",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lgp2g/need_code_vulnerable_to_specific_exploits_research/",
        "text": "working on binary analysis and would like to find a resource (if one exists) , [like cve database](https://cve.mitre.org/cve/cve.html) for patches, but for code that is exploitable to specific things outlined within the cve.\n\nFor example, if i want production code that is exploitable to a specific thing, my current method is to find a cve outlining a patch for such things, then go and look for an outdated version of the code pre patch.  \n\nBut is there a searchable database for exploitable code rather than patches for said code?\n\n\n",
        "created_utc": 1513939194,
        "upvote_ratio": ""
    },
    {
        "title": "DDE in Word to exploit ASPX/IIS",
        "author": "tryingmebestguv",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lgclg/dde_in_word_to_exploit_aspxiis/",
        "text": "Hi,\n\nWorking on a challenge at work. So far, I've discovered it's a \"DDE in Word\" exploit - the recipient has ASPX/IIS.\n\nI've tried to use Empire and Metasploit but no luck (working locally and on my own test machines). \n\nLooking into it further, there is heavy emphasis on there being IIS (only slight towards the use of ASPX) installed on the recipients machine.\n\nAny advice/pointers on where to do from here?",
        "created_utc": 1513933979,
        "upvote_ratio": ""
    },
    {
        "title": "Career Change Opinion",
        "author": "net-sec-throw-away",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lftka/career_change_opinion/",
        "text": "Using a throw away since my boss, and potential new boss know my username.\n\n &amp;nbsp;\n\nPrior to working in specifically security, I was a sys admin for about fifteen years.\n\n &amp;nbsp;\n\nI've worked for the past year as a security analyst at a large, multinational, fortune 1000 member, mainly focusing on identifying vulnerabilities and managing them with different departments, user education and awareness training, and making changes to and monitoring perimeter devices.  There is no room for upward movement.\n\n &amp;nbsp;\n\nI have also recently received an offer to work for a much smaller company (not a fortune 1000, fewer employees, etc).  I would be a senior network admin with a couple guys underneath me.  It would be a step away from security, as the only security work I'd be doing at first would be mostly system hardening, firewalls, and AD related.  However, over the next couple years the plan is to convert the position into a more security specific role as I would build out their entire security program (including title change).\n\n &amp;nbsp;\n\nThere would be a pay increase, less stress, and some other perks (as well as downsides, like doubling to tripling my commute that's normally about 30 minutes, much higher transit costs, etc), but my main concern is career impact.\n\n &amp;nbsp;\n\nSo, with all the background out of the way, which would you all say would better assist my career path of getting to a more security manager styled position down the line?\nWorking at the larger company in security, same position, no movement in the company for the next few years, then trying to jump to a more senior position somewhere else.\n\n &amp;nbsp;\n\nOR\n\n &amp;nbsp;\n\nStepping back from security to more generalized IT for about a year, and then in the following couple years being able to have the claim of having built a company's security program from the ground up.\n\n &amp;nbsp;\n\nThanks.",
        "created_utc": 1513926077,
        "upvote_ratio": ""
    },
    {
        "title": "Reusing the SSH keys across multiple servers",
        "author": "BrettEmmettSec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lejc3/reusing_the_ssh_keys_across_multiple_servers/",
        "text": "Hi.\n\nIs it bad practice to use the same SSH key pair for all servers that you need to access? If so, what about if you are storing the key on something like a YubiKey?\n\nCheers.",
        "created_utc": 1513910851,
        "upvote_ratio": ""
    },
    {
        "title": "Happened to notice the following email in sent items. Was NOT sent by user. Please advise.",
        "author": "TexasBullets",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ldzwx/happened_to_notice_the_following_email_in_sent/",
        "text": "User found this email in their sent items. They did NOT send it and it includes their email address and password. I'm concerned that I don't know how it was generated. User uses Outlook 2016 with G Suite (gmail) account.\n\nFrom: [user's email address] \nBCC: infobig@theglobalink.info \nSent: Wednesday, December 20, 2017 2:39 PM\nSubject: invoice for NL214788\n[user's email address]:[user's email address]:[user's password]:smtp.gmail.\ncom:587\n\nNote that the message content is the user's email address and password.\n\nI searched their email and can find no other messages with any reference to \"NL214788\".\n\nWe have now changed the password but we are obviously very interested to learn how this happened.",
        "created_utc": 1513905160,
        "upvote_ratio": ""
    },
    {
        "title": "Looking to get into Network/Cyber Security",
        "author": "hi4741",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lduqo/looking_to_get_into_networkcyber_security/",
        "text": "Hello all, I'm currently half-way through getting my associates in networking and I have a Network+ certification as well as 3 months experience from a basic IT job (wiping computers, reinstalling Windows manually, basic troubleshooting etc). I'm currently working a 3 month contract for a big company helping one of the network administrators with his daily responsibilities(labeling network connections in server rooms, watching/helping the net admin with basic/intermediate LAN tickets, and other small things). So my question is, what do you think I should pursue next if I want to get into Network/Cyber Security? Should I go for the Security+? What else do I need to consider? Thanks! :)",
        "created_utc": 1513903627,
        "upvote_ratio": ""
    },
    {
        "title": "Found a forwarding rule in CEO's account. Need advice.",
        "author": "grnerd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lc9f1/found_a_forwarding_rule_in_ceos_account_need/",
        "text": "I was doing a message trace today in Office365, and saw that every email sent to our CEO also had a redirect to an external gmail address. Checked with him to see if he knew who or what it was, and it was not something he recognized. Opened a case with Microsoft Support, to see if they could tell me how long the rule had been there, and they were no help. I know that this is a huge problem, and a breach that will ~~probably cost me my job~~ cause a huge headache, so I was hoping this community might have some suggestions for forensics that might help me get as much information as possible on what happened.\n\nedit: removed panic induced overreaction\n\nUpdate: Thank you all for the feedback and great advice. Here is an update. I am sure that it was initiated by a phishing attempt. I have been training the staff with KnowB4 for almost a year, but some people just can't be taught vigilance. Using powershell, I have determined that there are no other forwardings in place, and I have disabled forwarding email outside of the company. Message trace showed the emails started going out on the 1st of December, so about 3 weeks. All told there were 2000+﻿ emails. Azure does show logins using his credentials from Nigeria on the 1st, but no other subsequent logins. We are acting under the assumption that the entire mailbox and archive have been downloaded. We use Cybereason Endpoint Protection, and do not see any malops on any of our endpoints at this time. I contacted legal council, who has connected us with a forensics specialist. They will be doing a deep dive to see what information was compromised. We will then need to alert any customers who were effected. I have also told the CEO that he needs to treat this like an identity theft situation and begin monitoring his credit etc. A call to local law enforcement on Friday, left a voicemail and have not heard back. ",
        "created_utc": 1513888771,
        "upvote_ratio": ""
    },
    {
        "title": "Certs for Web Application pentesting?",
        "author": "MantridDrones",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lbrwz/certs_for_web_application_pentesting/",
        "text": "I've got my OSCP but since I mostly work with web apps I'm wondering which the best training/certs for this would be (I was keen on the offsec one but it's in-person only and rare as hen's teeth). \n\nI'm based in the UK, but I'd rather avoid anything where I have to be working in the industry for x years or have to renew every year, (though the latter's not necessarily a dealbreaker). A cert at the end of it is preferred since I'll already be looking at the likes of cybrary and udemy for all their courses.\n\nAlthough OSCP was fun there's just the question of how much of it is relevant to what I currently do\n\nAny suggestions? cheers!",
        "created_utc": 1513884528,
        "upvote_ratio": ""
    },
    {
        "title": "Live Malware Samples for Testing",
        "author": "Fuylo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lbawo/live_malware_samples_for_testing/",
        "text": "So I've seen a lot of folks struggling to find legitimate Samples of malware for testing, and I just wanted to share the GitHub URL for \"MalwareDB - The Zoo\". \n \nIt has wanacry, NotPetya, and a lot of other baddies on here, and they are the REAL DEAL, SO BE CAREFUL AND DO NOT TEST THESE IN A PRODUCTION ENVIRONMENT.\n\nNobody but you are responsible for using these in a way that causes problems so be careful, and enjoy testing your virtual environments for vulnerabilities!\n\nhttps://github.com/ytisf/theZoo/tree/master/malwares/Binaries\n",
        "created_utc": 1513880454,
        "upvote_ratio": ""
    },
    {
        "title": "Enable X11 \"Disabled\" Menu Items",
        "author": "double-xor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lasun/enable_x11_disabled_menu_items/",
        "text": "Hello,\n\nIs there a trick to enabling disabled menu items?  If I can control the Xdisplay, can I get into the app and modify the GUI so that the disabled (greyed-out) menu items are accessible / clickable?\n\nRight now, I'm looking for hidden .Xdefaults -ish files that might have these set somewhere, but if they're set programmatically, I'd love to be able to have a way to enable the hidden functionality.",
        "created_utc": 1513876144,
        "upvote_ratio": ""
    },
    {
        "title": "I want to make a license to my web app for security.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lapys/i_want_to_make_a_license_to_my_web_app_for/",
        "text": "[deleted]",
        "created_utc": 1513875452,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't all malware metamporphic to avoid signature based detection?",
        "author": "thehoodedidiot",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lapt6/why_isnt_all_malware_metamporphic_to_avoid/",
        "text": "It seems too easy to add some simple lines of code that randomly add unneeded numbers or something to the malware, which would completely change the hash that signature based detectors rely on. Why doesn't every malware have those randomizing pieces of code then?\n\nedit: sorry for typo in the title.....wish I could edit that....",
        "created_utc": 1513875416,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone able to ID this ransomeware?",
        "author": "sharps8201",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7lab3t/anyone_able_to_id_this_ransomeware/",
        "text": "Main contact email is workup@india.com\n\n[Screenshot](https://imgur.com/gallery/rjsC4)\n\nSeems normal run of the mill, user of course doesn’t have any clue where it came from.  This machine has never been connected to my corporate network so I’m thinking they got it from a vendors connection.\n\nI have found some generic write ups with it mentioned but no names given to it.",
        "created_utc": 1513871779,
        "upvote_ratio": ""
    },
    {
        "title": "Why is /r/appsec a locked community?",
        "author": "Ask-Netsec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7l9hzi/why_is_rappsec_a_locked_community/",
        "text": "...wouldn't it be just like here, but more of a focus on security around web &amp; mobile apps?",
        "created_utc": 1513863510,
        "upvote_ratio": ""
    },
    {
        "title": "Career Options / Areas / Designations",
        "author": "TerraKorruption",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7l9hm4/career_options_areas_designations/",
        "text": "Sup y'all - I'm not entirely sure how to phrase the question to get the answers I'm looking for - So I'll write this out as best I can.\n\nI'm updating my CV for an internal position with my current employer. The job isn't directly security related, but I've been advised that me CV needs more of \"What I want to do\" and I'm trying to state my interest in netsec. This is what I have so far:\n(Bear in mind this is a snippit so it will just jump straight in -I do have a pre-amble)\n\"....\nComputer and network security is my ultimate goal and something I plan to continue working towards, whether that be as part of my job role or independently. I am aiming for a career in Penetration Testing as I hold a strong interest in many aspects of computer security such as malware reversal, cryptography &amp; computer forensics.\"\n\nwhat I'm looking for I guess, is a better and more specific way to say that I'm interested in all aspects of things. for example, what specifically does Computer forensics entail? what are the technicalities to \"examining digital media in a forensically sound manner\"? I feel like I'm missing certain terminology, like I know there are words to consolidate what I'm referring to, but I can't find them.\n\nWhat area is Malware reversal? is it antivirus? - I feel theres a different word to refere to this specific domain of work. \"Im interested in malware reversal and antivirus\" just doesn't sound right and makes me question myself. Anti-virus - What aspect of anti-virus do I mean? Using anti-virus? making anti virus?\n\nwhen I google this stuff I just get job listings, certifications and salary info and despite checking links, none of the information is providing any further insight. Maybe I'm just being stupid here and if so I apologise - maybe it is worth adding that I haven't done any kinda of college or university course within this area - As much as I'd love to, I missed my chance at this and doing this now would cost me a FORTUNE that I cannot afford - so I'm looking more to on the job training, more hands on experience and self study.\n\nIf any one could help provide some answer to my ramblings, I would really appreciate it.",
        "created_utc": 1513863398,
        "upvote_ratio": ""
    },
    {
        "title": "Another Cybersecurity certification post",
        "author": "Nacao",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7l8i86/another_cybersecurity_certification_post/",
        "text": "I have been working as software engineer for almost 6 years (embedded systems). The last three I have been implementing Cybersecurity related stuff which I really liked and motivated me to make a career in this direction.\n\nThe path I would like to follow is:\nSW Developer -&gt; Security Engineer/Analyst -&gt; Security Architect/Manager\n\nI would like to have an entry-level certification but I am not quite sure which one would fit my needs the best. I have seen a lot of them but the ones I found most interesting for me were:\n\n- GIAC Security Essentials (GSEC)\n- CompTia Security+ \n\n\nDo you have any other suggestions?\n\nI really appreciate your help",
        "created_utc": 1513850040,
        "upvote_ratio": ""
    },
    {
        "title": "Developers having access to production. Is this okay?",
        "author": "SmarterTogether",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7l7d7q/developers_having_access_to_production_is_this/",
        "text": "Looking at my company we currently use different deployment environments. Currently developers have access to the Dev, test, and stage servers and that is it. They do not have access to the production server, HOWEVER, they do have access via Active Directory to the Application on the prod server with access beyond read only.\n\nEven though they cannot make changes to the code or migrate code on the production server. Is there any risks with the users having accounts on the application?\n\nMy thought is they really have no need to be there and should be removed. Right? Or is it okay to keep their accounts there? ",
        "created_utc": 1513833985,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about malware/botnets in the wild that did packet capturing on Windows.",
        "author": "Thrones33",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7l6zdv/questions_about_malwarebotnets_in_the_wild_that/",
        "text": "I'm trying to learn a bit about how malware and botnets used packet capturing throughout the years, but can't find much.\n\nSo, first question. When malware did packet capturing, did they collect ALL the packets? Or all the POST data? Or were they specific to usernames and passwords? I'd like to see some examples of malware that collected a large volume of packets like all the POST, but can't find anything.\n\nI was reading about Agobot, in which every source claims it did packet capturing by installing libpcap and PCRE to \"sniff and sort traffic\". What does that mean? They collect it all, or just passwords? I find most everything I read on the subject is somewhat vague, and I don't know exactly what is being collected by the captures.\n\nThanks ",
        "created_utc": 1513829450,
        "upvote_ratio": ""
    },
    {
        "title": "How can I protect my NAS when connecting it to a VPN on my VPS?",
        "author": "forgetfulcoder",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7l594q/how_can_i_protect_my_nas_when_connecting_it_to_a/",
        "text": "I have a NAS running unRAID. For a while I had an OpenVPN server plugin running on it and I'd have my tablet connect to it to access my files and to bypass firefalls. It worked fine but browsing the web was pretty slow. So I moved the VPN server to a VPS I own and browsing speeds are a lot faster. I haven't done anything about connecting my NAS to the VPN as well because I'm not sure how to protect my NAS and my LAN in case my VPS gets hacked or something. Is there an alternate option that I don't know about?\n\nI used [this script](https://github.com/Nyr/openvpn-install) to set up the OpenVPN server on my VPS.\n\nMy VPS runs Debian 8, my tablet runs Android 7 and my NAS runs unRAID 6.4.0 rc13.",
        "created_utc": 1513811498,
        "upvote_ratio": ""
    }
]