[
    {
        "title": "Computer Security in 2017",
        "author": "Mild_Freddy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7cc2u7/computer_security_in_2017/",
        "text": "Hi all,\n\nIt may seem like a fundamental question but what constitutes a decent security suite now in 2017?\n\nI always operated from the old AVG free paired with a Malware scanner but given the evolution of threats this may be woefully inadequate.\n\nI also don't trust any one 'premium/paid' product to protect my computer as I've found they can be obtrusive and unstable themselves in many cases.\n\nAnyone got a good handle on this and can cut through the crap?",
        "created_utc": 1510445637,
        "upvote_ratio": ""
    },
    {
        "title": "Nuisance hacker at the office - What are your recommendations?",
        "author": "rubricked",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7cab4b/nuisance_hacker_at_the_office_what_are_your/",
        "text": "Hi all,\n\nMy brother-in-law's office has someone doing some irritating things, at ~3 different levels, from stupid to actually illegal:\n\n* ordering pizzas (and similar crap)\n* kicking people off WiFi\n* sending threatening texts &amp; faxes\n\nThe police have been involved, but are unwilling (unable) to do anything about it.  Ever since the threats started, the FBI has been involved, but they don't seem to be doing anything either.  (The threats are like \"I'm going to take your kids into the alley and they're going to get it\" kinds of things, not like bomb/shooting threats.)  Because the threats are basically just empty bullshit, no \"harm\" is going to come from them, so it's probably not high on the FBI's todo list.  \n\nI know a lot more about computers than my brother in law, but I'm just a dabbler when it comes to security.\n\nA few notes: He estimates that his office is losing 20-30% productivity to this, but he works for a very cash-strapped nonprofit (after school programs for inner city kids), so even if they are willing to hire professionals, they wouldn't have much money to put toward it.  My brother-in-law says he and other management think they know who it is - the attacks always seem isolated to when one IT guy is on site.  There have been no \"demands.\"  The attacks die down sometimes, and then pick back up again after a few weeks.  The suspected employee is in the IT department, and the head of IT doesn't believe it's him, and hasn't been helpful.  Oh, and the pizza orders apparently came from Romania.\n\nSo - here are my questions: \n\n1. What would *you* do, if this was happening at your office?\n2. Is there any way to amass even a small amount of evidence to give to either the police or just to HR?\n3. It seems to me that the 3rd thing, kicking people off wifi, would be the one most likely to leave a trace - wouldn't there be logs of who was kicked by whom?\n4. If the organization chose to hire someone to help, what would the price tag look like, and where would one start looking for the right kind of professional?\n\nThanks.  Please let me know if there are better subreddits for this kind of question!",
        "created_utc": 1510427318,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to remove wifi/bluetooth from smartphone?",
        "author": "metalsockspapa",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c8dl7/what_is_the_best_way_to_remove_wifibluetooth_from/",
        "text": "I wanna make perfect password memo device. but there is no such thing in the market.  \nI'm considering physically removing wifi chips from smartphone if possible. but is it easy job?  \nProgramatically disables it from user land is useless since there is many malwre can obtain root priviledge. or even outside of the world.   \nAnother option is custom ROM. but it's not easy. might be harder than physical way.",
        "created_utc": 1510406884,
        "upvote_ratio": ""
    },
    {
        "title": "What tools should I use for incident response on Windows 10 Home/Pro?",
        "author": "terrenGee",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c871k/what_tools_should_i_use_for_incident_response_on/",
        "text": "If I know someone has been hacked/compromised, what utilities are available within and without the OS for detecting and remedying the issue?\n\nHow can I harden the system to further prevent post-exploitation?",
        "created_utc": 1510404182,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain “dns hijacking to vpn”...?",
        "author": "fatfig",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c7zlx/can_someone_explain_dns_hijacking_to_vpn/",
        "text": "A few basic questions...  \n  \n- If a vpn user gets “dns hijacked”, does it mean every subscriber of the vpn gets hijacked, no matter what country they are in or which ISP they use? Or is this something that’s more targeted at only those using rogue ISPs or something?    \n  \n- who is the hijacker? The ISP? Some random site admins wanting to give virus? Or others?\n",
        "created_utc": 1510400868,
        "upvote_ratio": ""
    },
    {
        "title": "Security perspective on exposing a domain vs VPN into private network.",
        "author": "tovo_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c7fz8/security_perspective_on_exposing_a_domain_vs_vpn/",
        "text": " Is it a better idea to setup a webserver to only accept vpn connections from clients and firewall off the webserver to only accept vpn traffic if I want to deliver webcontent but not truely expose the webservices to the public internet?  Or just listen 443 and obscure the domain?",
        "created_utc": 1510390688,
        "upvote_ratio": ""
    },
    {
        "title": "[X-POST from r/websecurity] - Breaking into Web Application Penetration Testing.",
        "author": "atram010",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c79k2/xpost_from_rwebsecurity_breaking_into_web/",
        "text": "Hi Everyone. How does one become a Web Application Penetration tester from scratch? What would be the career path? I've recently got into using Django and Flask - which led me to OWASP. But after reading WAHH v2 my interests have started to shift towards security. I am currently considering SANS GWAPT cert, but I'm not sure if this will be enough to get my foot in the door. Any help would be greatly appreciated, Thanks!\n\n\nEdit:  You guys are awesome! Thanks for the feedback!",
        "created_utc": 1510387397,
        "upvote_ratio": ""
    },
    {
        "title": "How secure is it to tether your phone's internet to devices with bluetooth?",
        "author": "ForrestTrump",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c6rkk/how_secure_is_it_to_tether_your_phones_internet/",
        "text": "How about if the phone itself is picking up on Wifi to begin with.  \nCould tethering the USB way be as secure as using ethernet?",
        "created_utc": 1510379452,
        "upvote_ratio": ""
    },
    {
        "title": "If you use a youtube downloader software does Youtube know that you are downloading?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c65x4/if_you_use_a_youtube_downloader_software_does/",
        "text": "[deleted]",
        "created_utc": 1510371356,
        "upvote_ratio": ""
    },
    {
        "title": "Can non-storage related hardware store be designed to store data about Tails (or any other operating system's) activity?",
        "author": "Danney43",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c4u7b/can_nonstorage_related_hardware_store_be_designed/",
        "text": " Hi, I'm a dedicated Tails user who works in a conflicted region.\n\nBecause of my circumstances I've had a concern in regards to the hardware that is used in computers that are used for Tor//Tails activity.\nTails it's self may be open source, but Tails must be run on a computer that probably contains proprietary hardware.\n\nHas anyone ever heard of hardware (any type other than is designed to store data) like this being designed with the capability to store data.\n\n Has anyone ever heard of  non-storage related hardware such as Mouse/Keyboard, Screen/Monitor, Graphics Card, Ram/Memory, Processor, Power Supply, Cd Drive, Cooling Fan, Wireless Card...or any other non-storage related hardware (basically anything other then a hard drive, flash drive, motherboard, or other hardware designed to store data) in a computer ever storing data about Tails (or any other os really) sessions?\n\nBasically, if I use Tails (or any other operating system) on a computer...do I have to worry about any of these other hardware components collecting data from the sessions?\n\nThanks in advance to anyone who cares to comment.",
        "created_utc": 1510356472,
        "upvote_ratio": ""
    },
    {
        "title": "Microsoft certificate enrollment: How does a CA recognize its RA?",
        "author": "kWV0XhdO",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c49fd/microsoft_certificate_enrollment_how_does_a_ca/",
        "text": "In the SCEP universe, a CA can delegate validation of certificate requests to an RA.\n\nThese RA-validated requests are signed by the RA and submitted to the CA for signing.\n\nWhen the RA and CA are Cisco routers, the only thing \"special\" about the RA is that it's got `OU=ioscs RA` in its certificate.\n\nIf a certificate bearing that OU string signs and submits a CSR via SCEP, a Cisco CA will accept it (and optionally auto-grant it).\n\nHow does a Microsoft CA speaking SCEP recognize its RA?",
        "created_utc": 1510350581,
        "upvote_ratio": ""
    },
    {
        "title": "Credit/debit card for online purchases that requires transaction approval through provider's website?",
        "author": "user2409734",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c43wr/creditdebit_card_for_online_purchases_that/",
        "text": "Online payment security seems ridiculous to me - giving all the required authorization to the vendor when making a purchase, and having to trust them not to abuse or lose it. It would make much more sense to give the vendor an account/card number which they request the payment from, and then have the customer go to the payment provider's website and approve that transaction. That way, the account/card number is useless for theft - since every transaction has to be approved anyway.\n\nI'm looking for a service that lets me do this, so that I can use it to buy stuff online. I'm aware of Paypal, but that just moves the trust problem to Paypal; plus, not every website supports it, and I'd rather not have to jump through hoops [like this](http://www.makeuseof.com/tag/pay-paypal-balance-sites-dont-accept/).",
        "created_utc": 1510349067,
        "upvote_ratio": ""
    },
    {
        "title": "Best place to start learning?",
        "author": "Aarongolf",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c3omb/best_place_to_start_learning/",
        "text": "I’m a sophomore in college and I really want to learn network security. I don’t want to be “hackerman” or anything like that. I just want to understand what the hell is going on behind the scenes. Security classes are 4000/5000 level classes at my university and I’d like to start learning now.\n\nLong story short, Does anyone know of a good set of videos or a free online class to get started?",
        "created_utc": 1510345077,
        "upvote_ratio": ""
    },
    {
        "title": "irc channels",
        "author": "fabiothebest",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c2715/irc_channels/",
        "text": "[removed]",
        "created_utc": 1510331767,
        "upvote_ratio": ""
    },
    {
        "title": "Any hint on this https://hack.me/101522/sql-injection-medium.html",
        "author": "r3d-c0d3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c1hpv/any_hint_on_this/",
        "text": "",
        "created_utc": 1510325102,
        "upvote_ratio": ""
    },
    {
        "title": "Wikileaks vault 8 - Hive",
        "author": "stud_ent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c0nku/wikileaks_vault_8_hive/",
        "text": "Just got the file an am going over the documentation. Anyone succefully installed it on a VM? I'm hesitant to host the file on git hub but when I tried to extract the zip file it's empty except on my windows machine. When I transfer the extracted file from windows, the folder is empty.\n\nAside from the massive Blot net they create seems like most of these tools are available through Lscript (Lazy Script).\n\nAnyone had some fun with this repo yet?\n\nhttps://wikileaks.org/vault8/\n\n*Got the files on my Kali VM my VM tools was messed up and needed to be reinstalled.\n\nReading the user documentation.\n\nWhy is the CIA so happy about mikrotek Powe pc routers?\n\n",
        "created_utc": 1510314966,
        "upvote_ratio": ""
    },
    {
        "title": "When you buy a used Mac, how do you make sure nothing bad is on it?",
        "author": "vppr",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7c0mak/when_you_buy_a_used_mac_how_do_you_make_sure/",
        "text": "By bad I mean malware and stuff like that which any of the previous owners could have installed on it",
        "created_utc": 1510314436,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to stay 100% anonymous?",
        "author": "nothingsnake",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bz8b4/what_is_the_best_way_to_stay_100_anonymous/",
        "text": "I see in the news that people will hack someone, and they can’t find the person that executed the hack. How do they become untraceable? I have proxychains with tor service on kali, and I’m not trying to hack anything I just hate being tracked and the idea that even with proxychains I can still be found. Any good tips? My proxychains are set to the default socks5 tor ip. Any help would be greatly, greatly appreciated. Thank you! ",
        "created_utc": 1510292635,
        "upvote_ratio": ""
    },
    {
        "title": "Please... too much suffering here..",
        "author": "EntropicSpin",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bz0lr/please_too_much_suffering_here/",
        "text": "for 5 years an outside group has done bizarre entry into my unjailbroken iphone and PC, very serious situation and I have never known if I have done enough to kick them off --- everybody I describe the iphone behavior / hack too says \"thats impossible\" --- But it is MOST DEFINITELY real.  Not schizophrenia, not paranoia, I'm just out of my depth with expertise..... can anyone out there shoot me an email to bozappleicloud@gmail.com to discuss?   If karma is real, you would be gaining some, I think.....",
        "created_utc": 1510289937,
        "upvote_ratio": ""
    },
    {
        "title": "machine in environment looks like it has been dns tunneling for past 30 days, but I can't really decipher the packet.",
        "author": "THE__USURPER",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byy4g/machine_in_environment_looks_like_it_has_been_dns/",
        "text": "I wrote a rule in our siem a few months ago to look for outrageously long/strange DNS queries. The machine in question hits my rule every few days, though no clear patter exists. It seems like tunneling because of how strange the query is, but I don't understand what I am looking at.\n\nI placed the packet below. I replaced my companies domain name with mycompaniesdomain.com in the packet. Also, the dns server IP is 10.10.10.10. The client is the 10.192. Can anyone shed some light on what these queries are. The numbers are always different in the subdoman. The actual domain is always my companies domain, which is strange but I assume it simply can't resolve the request.\n\n30&gt;Nov 7 00:06:09 10.10.10.10 named[6188]: client 10.192.4.163#50586 (\\227\\131\\135\\227\\130\\163\\227\\130\\186\\227\\131\\139\\227\\131\\188\\227\\131\\169\\227\\131\\179\\227\\131\\137\\230\\160\\188\\229\\174\\137\\227\\131\\129\\227\\130\\177\\227\\131\\131\\227\\131\\136.MYCOMPANYDOMAIN.com): query: \\227\\131\\135\\227\\130\\163\\227\\130\\186\\227\\131\\139\\227\\131\\188\\227\\131\\169\\227\\131\\179\\227\\131\\137\\230\\160\\188\\229\\174\\137\\227\\131\\129\\227\\130\\177\\227\\131\\131\\227\\131\\136.MYCOMPANYDOMAIN.com IN A + (10.10.10.10) ",
        "created_utc": 1510289038,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to use my VPN ip as source ip when performing a port scan?",
        "author": "savagetinker",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byv5q/is_it_possible_to_use_my_vpn_ip_as_source_ip_when/",
        "text": "",
        "created_utc": 1510287976,
        "upvote_ratio": ""
    },
    {
        "title": "Why do I need tcp port 3870 open on a wifi lightbulb?",
        "author": "el_heffe80",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byuz2/why_do_i_need_tcp_port_3870_open_on_a_wifi/",
        "text": "So, I got one of those really cheap-o wifi lightbulbs from tikteck[1] and immediately scanned it. \n\n\n    PORT     | STATE|    SERVICE\n---|---|---\n    2679/tcp  |filtered| unknown\n    3870/tcp  |filtered |ovsam-d-agent\n    6941/tcp  |filtered| unknown\n    9919/tcp  |filtered |unknown\n    12012/tcp |filtered |unknown\n    12416/tcp |open    | unknown\n    12739/tcp |filtered |unknown\n    12939/tcp |filtered |unknown\n    16820/tcp |filtered |unknown\n    18200/tcp |filtered |unknown\n    24279/tcp |filtered |unknown\n    27344/tcp |filtered |unknown\n    29203/tcp |filtered |unknown\n    43459/tcp |filtered |unknown\n    43900/tcp |filtered |unknown\n    45192/tcp |filtered |unknown\n    46678/tcp |filtered |unknown\n    51920/tcp |filtered |unknown\n    63849/tcp |filtered| unknown\n\nOk... but... why?   Being that I don't have an Android phone running anything recent enough to run their software I used my Alfa USB to create a wifi hotspot and connect my iPhone to that so I could sniff the traffic and see what their (really craptastic) app does.  Why this convoluted way? Simple- they actually didn't use a simple http method so burpsuite didn't want to play nice.  What did I find out? They use MQTT!  \n   \nCool, but not really, because why do you need all these damn ports?  I had to seriously look up wtf ovsam was and when I realized it was a service level agent[2] for storage I noped the hell outta dodge.  I mean, I knew I was going to reflash this thing (it is just a simple ESP8266), but damn.  \n  \nSo, the question I raise is this- any recommendations on what I should scan, do, or attempt to do on one of these bulbs before I flash it?\n  \nTl;dr- got a chinese wifi bulb that likes to dial home, what would you do with it if you could?\n\n1- https://www.tikteck.com/wifi-light-bulb  \n2- https://en.wikipedia.org/wiki/HP_OpenView_Storage_Area_Manager",
        "created_utc": 1510287912,
        "upvote_ratio": ""
    },
    {
        "title": "My attacker wan't one person.",
        "author": "feminaziextremist",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byrib/my_attacker_want_one_person/",
        "text": "Hi. I'm here. My originally thought attacker wasn't current attacker. first attacker stole my programs at 2013. but they can't see my Tails.  \nBut it seems like there is another group attacking me. first one is really agressive. so I thought they still are attacking me. but no. they are different group.and can see Tails too.  \nThe second one is tottally different. they are using ISP IP as their proxy/VPN. knew every single trap I made to them beforehand.  \nOne of their early site from 2014 was written in Chinese .  \n",
        "created_utc": 1510286749,
        "upvote_ratio": ""
    },
    {
        "title": "eSentire SOC analyst interview, Thoughts / Interview questions?",
        "author": "sarrsb",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byei3/esentire_soc_analyst_interview_thoughts_interview/",
        "text": "Hello Netsec, \nI have an interview for SOC role, any interview questions based on your experience would be appreciated.\n\nAlso seems like a decent company to me, anyone worked there? What is your take on the company?\n\nThanks.",
        "created_utc": 1510282469,
        "upvote_ratio": ""
    },
    {
        "title": "Are smartphone payment systems (Apple Pay, Android Pay, etc.) more secure than using a credit card with a chip?",
        "author": "perusedthat",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byeb1/are_smartphone_payment_systems_apple_pay_android/",
        "text": "I haven't found a clear, concise answer to this question anywhere.\n\nWe all know paying with a smartphone is more secure than swiping a credit card. Is it also more secure than using a chip?",
        "created_utc": 1510282420,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5 KnowBe4.com or similar \"Weak Password Audit\" tool audits 1,000s of users in minutes?",
        "author": "reallybigabe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7byajq/eli5_knowbe4com_or_similar_weak_password_audit/",
        "text": "Hey all, \n\nJust as the subject says.  I realize its mostly checking hashes, with a decently written lookup against a goodsize list of known shite hashes, but .... how?  Are there *legitimate* .Net / C / PoSH tools that can pull **every** hash with a domain admin account?\n\nThanks in advance.  Love you, reddit. ",
        "created_utc": 1510281251,
        "upvote_ratio": ""
    },
    {
        "title": "resume job title different from actual title..sp85",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bwkrt/resume_job_title_different_from_actual_titlesp85/",
        "text": "[deleted]",
        "created_utc": 1510263784,
        "upvote_ratio": ""
    },
    {
        "title": "Microsoft Windows Defender Advanced Threat Protection (APT) - a legit contender?",
        "author": "gimmieurtots",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bw1oz/microsoft_windows_defender_advanced_threat/",
        "text": "I have a customer where the security team owns policy and IR but the IT team owns infrastructure, systems, and operations and selects security products mostly based on cost and convenience.  Currently they have had issues with breaches and the amount of systems requiring rebuild due to infections is spiraling.   They currently use MS A/V and the IT teams solution is to add MS APT.   \n\nI am aware that MS APT is cloud only with no offline coverage, does not use behavioral correlations, is Win 10 only (they are mostly Win 10), and does not have central management with other MS \"sec\" tools.  Does anyone have other information I could use to convince these non-sec folks that cheap and easy to deploy are not good reasons to select MS APT?\n\n",
        "created_utc": 1510259027,
        "upvote_ratio": ""
    },
    {
        "title": "OSCP And Privilege Escalation",
        "author": "pma2691",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bvx28/oscp_and_privilege_escalation/",
        "text": "I've failed my 3rd attempt at the OSCP, which is extremely disheartening because I did good in the labs. During my OSCP exams attempts, I've always been able to get the buffer overflow box and the 10 point box as root/admin, but I've only been able to escalate 1 out of the 6 20 point boxes I've faced. On all of the 20 point boxes I've gotten a shell, but only one root. Windows boxes in particular have given me a lot of trouble because I've done everything that every OSCP blog/writeup/advice article has given.\n\n1. I've read the fuzzysecurity tutorial\n\n2. I check the installed programs for outdated software. \n\n3. I check services for weak permissions\n\n4. I've done everything in this [guide here](https://github.com/frizb/OSCP-Survival-Guide#windows-privilege-escalation)\n\n5. I've tried windows-exploit-suggester.py as well as every exploit it suggests\n\nI feel like I've exhausted my options for outside research and it's just something I'm missing but I can't figure it out. As I said before, I did well in the labs which included compromised all machines except gh0st and pain, but it seems that the solution is not a common one or else I would've found it. ",
        "created_utc": 1510257922,
        "upvote_ratio": ""
    },
    {
        "title": "Writing a Standard Operating Procedure for Pen tests?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bvuop/writing_a_standard_operating_procedure_for_pen/",
        "text": "[deleted]",
        "created_utc": 1510257359,
        "upvote_ratio": ""
    },
    {
        "title": "I NEED HELP! *screams* I think someone is trying to buy things under my name.",
        "author": "stop_kenny_killing",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bv9sl/i_need_help_screams_i_think_someone_is_trying_to/",
        "text": "I think someone is trying to impersonate me to buy things under my name.\n\nSince last month, someone have been trying to enter my account of a website like eBay (but from my country). My account was deleted long ago, the person cannot logon without my email verification, so I didn't bothered much. \n\nBut today I received a phone call from a phone company, saying they were returning a call because I had registered in their website asking about their phone plans (is that right?). I didn't. I can't receive telemarketing calls because I blocked my number to that (is a thing in my country). I asked for the protocol number because the calls are recorded and I can use as evidence at some point.\n\n\nThe thing is: it seems so nothing, but it could evolve to something way way worse if this person can get my bank account info or anything related (or even hire services under my name).\n\nAlso, everything happens online, so I'm pretty sure it's someone with no cracker abilities, but intentions. \n\nWhat can I do to prevent something to happen? What measures can I take to protect my computer and my info in it? \nThanks in advance!",
        "created_utc": 1510252446,
        "upvote_ratio": ""
    },
    {
        "title": "Setting up a WiFi lab",
        "author": "goodfearless",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bv9h3/setting_up_a_wifi_lab/",
        "text": "Maybe a dumb question., \n\nHow/what do I need and what should I consider in order to set a WIFI  pen - testing lab at  work?",
        "created_utc": 1510252377,
        "upvote_ratio": ""
    },
    {
        "title": "ELK and basic monitoring - what to look for. Resource recommendation",
        "author": "utkraken",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7buuzh/elk_and_basic_monitoring_what_to_look_for/",
        "text": "Hey all. I am setting up an ELK server for my organization to replace our Solarwinds LEM. I'm at the point where I need to start configuring it to filter out noise and send email alerts. I could use some advice:\n\nWe are a small org. When all feeds are up, ELK will be ingesting logs from two syslog devices (Cisco ASA firewall and Tripwire) and ~15 Windows boxes (6 Domain Controllers). I need to create some baseline rules for filtering out noise and firing off email alerts to my network admin and director of tech. Right now, the only filtering I'm doing is dropping messages from the firewall where severity = \"Info\". Obviously, I'm a bit lost here. \n\nSo I'm looking for any recommendations on where I can start to educate myself on how to make the best use of this thing - what events I'm supposed to be looking for, what I can safely filter out, etc. I'd also be opened to any courses that might be a good jump-off point. \n\nThanks!\n",
        "created_utc": 1510248976,
        "upvote_ratio": ""
    },
    {
        "title": "Nano not working well on reverse shell",
        "author": "AndSimpson",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bulv6/nano_not_working_well_on_reverse_shell/",
        "text": "I have a quick question. I am working on boot2root VM, and got a reverse shell.\nAnd on the shell I need to edit a file with Nano editor. Strange thing is, on the shell Nano does not work well. It works only with backspace, but all other ctrl+ command (ctrl+O, ctrl+X) and arrow keys do not work. When I type Ctrl+O (then it shows ^O on the shell) and enter, then it gives me prompt saying \"writing to .../(file name)temp. Then if I type ctrl+C, then the reverse shell disconnects.\nIs there any way that I can solve this? Your help would be greatly appreciated. Than you,\n\nSimpson",
        "created_utc": 1510246811,
        "upvote_ratio": ""
    },
    {
        "title": "What a home user can do with wireshark?",
        "author": "begooboi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bulfv/what_a_home_user_can_do_with_wireshark/",
        "text": "I have installed wireshark in my home computer for monitoring my home network. This is what I currently do with wireshark , open it  for few minutes and see the packets send and recived by my computer. I know I have this powerful tool in my computer and dont know how to use it to its full potential? Is there any intersting things a home user can do or monitor with wireshark?",
        "created_utc": 1510246705,
        "upvote_ratio": ""
    },
    {
        "title": "Bitcoin mining at work?",
        "author": "KewlKevin",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7buckt/bitcoin_mining_at_work/",
        "text": "This is my first post on reddit so take it easy on me if this topic has already been brought up.  I did a quick search and didnt see anything.\n\nI'm a Security Administrator at my workplace and our IDS detecting a person (not an employee) on our public wifi that could be potentially mining bitcoins.  It detecting a few logins to monero crypto pool in another country.\n\nFrom a security standpoint, what concerns should I be aware of?  Also should that machine be blacklisted from our wifi?  I know it could be potentially infected with malware or part of a botnet to be part of a global mining operation.  I dont really any other proof in the log of the IDS other than the login that I mentioned earlier.\n\nAny feedback is appreciated.\n\nThanks",
        "created_utc": 1510244513,
        "upvote_ratio": ""
    },
    {
        "title": "Question about a suspicious URL (don't have proper tools to research)",
        "author": "omricode",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bthh9/question_about_a_suspicious_url_dont_have_proper/",
        "text": "I tried to search facebook for \"steamed bun\" then got a list of results. Then I clicked the first link (link had a pic and title), the recipe flashed for a second then I was redirected to Aliexpress.com.\nI went again to the list of search results and hovered above the link on the result and see:\nhttp://buy-china.xyz/chinese-steamed-bun-recipe-rice-flour.htm .\nI would like to understand if this is a phishing site or maybe my PC is now effected by virus or such.\nAny expert advice is appreciated.",
        "created_utc": 1510236356,
        "upvote_ratio": ""
    },
    {
        "title": "Network devices up to date security alerts",
        "author": "besmile4ever",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bs3qj/network_devices_up_to_date_security_alerts/",
        "text": "Hi\n\nI hope this is the right place to ask, if not, please let me know. as I heard that the network engineer should always check daily security news, alerts, alarms and updates regarding his own device working on the network. I need to know if there any reference to get such news, alarms and alerts about specific devices like Cisco, brocade..etc.\n\nAny help would be greatly appreciated.\n",
        "created_utc": 1510216479,
        "upvote_ratio": ""
    },
    {
        "title": "Network devices sup to date security",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7brzy0/network_devices_sup_to_date_security/",
        "text": "[deleted]",
        "created_utc": 1510214778,
        "upvote_ratio": ""
    },
    {
        "title": "Getting a job in cyber security without a degree?",
        "author": "AnthraxPrime6",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7brm2o/getting_a_job_in_cyber_security_without_a_degree/",
        "text": "Alright I don't know if this is the right place to ask this question but here it goes- Can you get a job in Cyber Security with only certifications (Sec+, CASP, etc.) and no degrees from schooling? Is it possible to start small and then instead of a degree- like most places, they value the years of experience plus certs too? Or is is difficult as in, next to impossible to get a job without a degree in cyber security?\n\nIf it is hard or next to impossible to get a job in the field without a degree- are there any (Affordable!) schools you recommend I and others like me check out to get our degree?",
        "created_utc": 1510208967,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of jobs in the industry exist for packet analysis?",
        "author": "Hollowpoint357",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7br95b/what_kind_of_jobs_in_the_industry_exist_for/",
        "text": "I'm interested in doing some type of deep packet analysis, and figured SOC Analyst work would be the way to go for this. I have about 9 months left for my Business - Information Systems degree and am looking to transition out of my job. Many employers seem to have different naming conventions and responsibilities associated with \"soc\" or \"security analyst.\" Is there a particular avenue or naming convention I should be pursuing in my career search? I'm of course looking for something entry level and just need some recommendations to help broaden my horizon I guess.",
        "created_utc": 1510204240,
        "upvote_ratio": ""
    },
    {
        "title": "How, besides checking the MAC Address of the device, can you limit wifi access to one device of a customer with a unique web-prompt password?",
        "author": "Hornet1145",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7br6g3/how_besides_checking_the_mac_address_of_the/",
        "text": "",
        "created_utc": 1510203325,
        "upvote_ratio": ""
    },
    {
        "title": "How to build a good profile in the netsec industry?",
        "author": "getyourownwifi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7br35z/how_to_build_a_good_profile_in_the_netsec_industry/",
        "text": "Any tips on how to build a \"good\" profile for an average joe pentester with mediocre knowledge. I am always keen to learn but this isn't good enough to earn recognition in this industry. Besides giving talks at security conferences, what should we do to build a good profile to help us nail our next job interview?",
        "created_utc": 1510202208,
        "upvote_ratio": ""
    },
    {
        "title": "Should I take this SOC analyst role? Current network admin",
        "author": "zukolfe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bqbqt/should_i_take_this_soc_analyst_role_current/",
        "text": "Background info: \n\nUnrelated B.S degree in 2016\n\nIn school for a MS in cyber security. \n\n\n2 years doing T1 work part time while I was taking my undergrad.\n9months systems support/helpdesk(basic ad, exchange admin, image maintenance, stuff like that)\n\nAbout 2 months into a network admin role at a MSP but got an offer letter from a company I applied to before for a soc analyst 2 role.\n\n\nI want to go in more torwards the security field, I do some at my current role but it's also a lot of bullshit helpdesk work with dated technology (50% at least). The extent of what I do in regards to security is malware response, general incident respond, maybe setting up MFA for clients, running security assessments with port scanners, and managing BCDR systems like azure backups/onsite backups, I feel like they will having me do more infrastructure work in the future but idk.\n\n\nNew role is a minor pay cut of maybe 5k (I say that because my current is 63.5k but it will be 65k after I get a cert my current employer wants me to get). Offer is at 60k but I imagine they will also sponsor me for a security clearance (work in a location where a clearance is mandatory for many jobs). Both jobs are small startups (less than 50), the new one is a MSSP.\n\n\nI think I can live with the paycut but I don't know if it is worth it. Tbh I feel shitty leaving a company after only two months but I'm really not learning anything here and the workload is a dumb amount because they are understaffed and still developing their business plan (very unorganized and no clear indicator of who should be doing what job).\n\n\nWhat would you do in my situation? I am looking to get into security engineering in the late game but I am also a quick learner and get bored easily if it stops being challenging (the good kind of challenging not the bullshit here's 80hrs of work on a 40hr schedule, aka how I feel in my current role). Also, not sure if it matters but the new company literally has a 1/5 star rating on indeed, although it's only out of 3 employee ratings (all from analysts as well)",
        "created_utc": 1510193754,
        "upvote_ratio": ""
    },
    {
        "title": "Question about grabbing handle",
        "author": "IdiotOfThings",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bpou0/question_about_grabbing_handle/",
        "text": "Howdy!  \n\nI have a question on why I can't grab a handle to a driver. My CreateFile snippet is this:  \n\n    Avast_Driver = CreateFile(\n\t\tDriver_Name,\n\t\tGENERIC_READ | GENERIC_WRITE, // &lt;-- Issue right here\n\t\tFILE_SHARE_READ | FILE_SHARE_WRITE,\n\t\tnullptr,\n\t\tOPEN_EXISTING,\n\t\tFILE_ATTRIBUTE_NORMAL,\n\t\tnullptr\n\t);    \n\nWhen ran, I am unable to grab a handle. Getlasterror says its 5, which is \"Access is Denied\". Out of curiousity, i ran it with admin rights and it still gave me an error.   \n\nWhen I change the desiredaccess to only GENERIC_READ, I am able to grab a handle to the driver and I have no idea why that is. Would you guys happen to know? I asked in r/cpp a while back and a couple peeps mentioned that it might be driver security? but when I bring it up to some people and ask, they either dont know or say something like 'driver security??????'. I am not really sure whats going on or why that is.   \n\nThank you in advance!",
        "created_utc": 1510187273,
        "upvote_ratio": ""
    },
    {
        "title": "Associate SOC Analyst Preparation/books to read",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bm9ah/associate_soc_analyst_preparationbooks_to_read/",
        "text": "[deleted]",
        "created_utc": 1510157123,
        "upvote_ratio": ""
    },
    {
        "title": "Where to find emerging and new tech?",
        "author": "BatteryPWR",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bm936/where_to_find_emerging_and_new_tech/",
        "text": "I’m in a new role that requires me to discover new and emerging tech in cyber (an industry I am new to) - whether that’s from a tiny start up in Israel, or just a new product released by Symantec. Big trade shows is one way I've been learning, but smaller companies that can't afford booths must be out there somewhere.\n\nWhat are the aggregate sources that publishes news specifically on products in the network security field?",
        "created_utc": 1510157077,
        "upvote_ratio": ""
    },
    {
        "title": "Cisco Security training suggestions",
        "author": "CatsAndIT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bm6ht/cisco_security_training_suggestions/",
        "text": "Hello r/AskNetsec!\n\nI recently moved into a different role at work, and am finding myself doing more and more Cisco-related security work (higher up saw that on my resume, I had CCNA... which expired about a month after I transferred positions). However, the last time I did anything networking or Cisco was about 3+ years ago when I got the aforementioned CCNA (which expired in September).\n\nI'm thinking about trying to petition my manager to provide me with some sort of training or a certification path that would benefit the company by improving my networking knowledge. I have previously been through a bootcamp for CCNA - Security, but from what I remember... it really wasn't useful at all, because it was mostly GUI-focused, and we don't use the GUI at all.\n\nSo what are some suggestions for Cisco-specific security training/certifications? Why?\n\nThanks!",
        "created_utc": 1510156461,
        "upvote_ratio": ""
    },
    {
        "title": "BCP Guidance?",
        "author": "CounterInsurgent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7blvik/bcp_guidance/",
        "text": "This might be slightly outside of \"netsec\" but I thought you folks would be a good resource.\n\nI have been tasked with creating the BCP for a small organization. I've been following the ready.gov site and I have the BIA completed. However, I still feel a bit lost on the whole process (seems like every how-to I find explains it differently) so I'm looking for a really good resource that walks a small org through creating a BCP. Any suggestions?",
        "created_utc": 1510153624,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for bloodhound sample data (on csv format)",
        "author": "utku1337",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bkn0m/im_looking_for_bloodhound_sample_data_on_csv/",
        "text": "hello there. i'm testing bloodhound tool these days. however my test lab is limited, so i can't produce different variations on active directory domain. is there anyone who have bigger lab and can share \"Invoke-Bloodhound\" output with me?",
        "created_utc": 1510139023,
        "upvote_ratio": ""
    },
    {
        "title": "Sqli advice",
        "author": "fabiothebest",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bklj2/sqli_advice/",
        "text": "[removed]",
        "created_utc": 1510138395,
        "upvote_ratio": ""
    },
    {
        "title": "Security researchers to follow on GitHub.",
        "author": "rootb3r",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bjj35/security_researchers_to_follow_on_github/",
        "text": "I'm looking for a good list of security researchers to follow on Github who have a good contribution to the infosec industry and I can learn a lot from their projects hosted on Github. Any suggestions are welcome. Thanks for reading.",
        "created_utc": 1510121954,
        "upvote_ratio": ""
    },
    {
        "title": "Enterprise is trying to roll out a project to two factor auth logons not related to interactive/rdp logons. Is this even possible?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7biwwx/enterprise_is_trying_to_roll_out_a_project_to_two/",
        "text": "[deleted]",
        "created_utc": 1510114508,
        "upvote_ratio": ""
    },
    {
        "title": "Question about 7-Zip and encryption",
        "author": "supaTROopa3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7biue4/question_about_7zip_and_encryption/",
        "text": "When I encrypt a file, is it safe to delete the original? By safe I mean to keep it the safest, not in the sense that I might myself never be able to access it if I lost the password.\n\nOnce encrypted, is there some kind of read only view or will I have to unzip it all the time to view the contents?",
        "created_utc": 1510113733,
        "upvote_ratio": ""
    },
    {
        "title": "QB Password Reset Tool",
        "author": "Apersonofinterest666",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bhy99/qb_password_reset_tool/",
        "text": "I have a client that needs to get into their Quickbooks 2012 company file. It is a husband/wife business and they are going through a separation and the husband has locked the wife out of the company file and she needs information for her attorney.\nIs there any way to either access the company file or reset the password without going through Intuit?\nI've looked at a few products such as http://passwordtools.com/quickbooks/default.asp but I'm not sure if they are legit.\n\nApologies if I am in the wrong sub.",
        "created_utc": 1510104648,
        "upvote_ratio": ""
    },
    {
        "title": "Reputation of PayPal's Security Team",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bhoig/reputation_of_paypals_security_team/",
        "text": "[deleted]",
        "created_utc": 1510101998,
        "upvote_ratio": ""
    },
    {
        "title": "Suspicious installation on ios",
        "author": "npa1234",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bh46e/suspicious_installation_on_ios/",
        "text": "This morning when i looked at my iphone i saw evernote had been installed. although i did install evernote previously, i had already uninstalled . the only thing i did before this was installed some app from the store which looks to be legitimate. could these apps install evernote for me ? should i be worried ? what is a good app for ios to check for suspicious behaviour? thanks",
        "created_utc": 1510096514,
        "upvote_ratio": ""
    },
    {
        "title": "Will an internship in the Intelligence Community be a good resume builder?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bgz9n/will_an_internship_in_the_intelligence_community/",
        "text": "[deleted]",
        "created_utc": 1510095207,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for article with slider showing differences between trad-AV and NGAV",
        "author": "ProfessorLag",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bgyv3/looking_for_article_with_slider_showing/",
        "text": "I found an article earlier today but lost it. It had a graphic on it showing all the things on the left that a traditional AV would find and then as it went more right, what a NextGen AV would find.\n\nAnyone have any idea where this is? Really want that graphic.",
        "created_utc": 1510095089,
        "upvote_ratio": ""
    },
    {
        "title": "How to view IPs assigned during the past 6 months // macOS",
        "author": "numb3r8",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bflel/how_to_view_ips_assigned_during_the_past_6_months/",
        "text": "I thought I’d ask here. So, I need to view all IP addresses assigned to the client machine during the past 6 months. The computer is using macOS, and the few things I tried didn’t work. So I decided to ask here. \nIf I’m missing some info, let me know, and will update my post. \n\nThanks guys",
        "created_utc": 1510083181,
        "upvote_ratio": ""
    },
    {
        "title": "Time limit wifi usage per user.",
        "author": "rootb3r",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bf8cm/time_limit_wifi_usage_per_user/",
        "text": "I'm looking for an application which would enable me to prohibit the user to use wifi for a specific period of time-based on their user id.\nFor ex. if a user has user id as user1 then I could just set a specific time duration when user1 can use wifi and for how much time(in hours).Will Cyberoam or pfsense do this for me? Thanks for reading. Any help is appreciated.\n\n\nEDIT: A captive portal will do but should allow access only for few hour's that too at specific time period.",
        "created_utc": 1510080146,
        "upvote_ratio": ""
    },
    {
        "title": "System Hardening standards",
        "author": "orion3999",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bf018/system_hardening_standards/",
        "text": "We have recently had a QSA verify that we were adhering to PCI. As part of remediation process, I need to develop a system configuration standard. The more research I have done, the more I believe I need to develop System Hardening standards. I have been searching for templates or resources, but have been having trouble getting good information from NIST or SANS. Does anyone have any resources for templates or have any ideas on how to get started?",
        "created_utc": 1510078222,
        "upvote_ratio": ""
    },
    {
        "title": "About the IEEE P1735 standard",
        "author": "oXisahk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7begbu/about_the_ieee_p1735_standard/",
        "text": "I've just read this article from The hacker news [(article)](https://thehackernews.com/2017/11/ieee-p1735-ip-encryption.html).    \nI understand the figure showing how P1735 works but I'm wondering, when you ship your IP to a client, the code needs to be readable in order to be executed. But to do so, you need the vendor Private Key. If the piece of hardware is somehow connected to the internet you can request the key to the vendor at each boot (for example) but what happens when the hardware is not designed to be online. Is the key simply stored inside the chip with some kind of obfuscation? How?    \n\nIf the key is stored inside the hardware that means that with enough effort one could recover the private key and maybe also the Symmetric Key. Or maybe I totally missed the point...",
        "created_utc": 1510073558,
        "upvote_ratio": ""
    },
    {
        "title": "This keyboard [the keyboard driver] contains a keylogger. How can I check if mine has one?",
        "author": "gnuforlyfe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bddhk/this_keyboard_the_keyboard_driver_contains_a/",
        "text": "http://www.tomshardware.com/news/mantistek-gk2-collects-typed-keys,35850.html",
        "created_utc": 1510063688,
        "upvote_ratio": ""
    },
    {
        "title": "How to transition to security?",
        "author": "0neMinute",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bd7ui/how_to_transition_to_security/",
        "text": "Currently serving in a position of network engineer for a telecom company attempting to move into security. What positions are best suited for this transitionmm \nI currently have CCNA ccnp CISSP and the more basic certs a+ net+ security+, looking into studying python soon. ",
        "created_utc": 1510062021,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for opinions on Threat Intelligence Gateways",
        "author": "cybershepherd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bcqzy/looking_for_opinions_on_threat_intelligence/",
        "text": "I’ve seen a few Gartner articles that got me curious and the tech sounds vital. The reason why I’m asking about TIG's is we obviously know firewalls and SIEMs are under siege, there isn’t enough time in a day to look at all alerts regardless how tweaked your SIEM is, signatures are always chasing threats, and AI is a crying baby at this stage of development.",
        "created_utc": 1510056459,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a canonical way of measuring SSH (and other server) response latency?",
        "author": "Tim0x01",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7bc05f/is_there_a_canonical_way_of_measuring_ssh_and/",
        "text": "A common mechanism for information leaks is difference in response times from a server between valid and invalid credentials. For example https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2013-4434. Is there a typical way of measuring the response latency of servers?",
        "created_utc": 1510045046,
        "upvote_ratio": ""
    },
    {
        "title": "What's the 80/20 of RE/malware analysis?",
        "author": "anandis",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b8tbe/whats_the_8020_of_remalware_analysis/",
        "text": "Hi y'all,\n\nSo first things first. I'm working on a SOC because I wanted to get at least a little bit in infosec after having worked for 4 years as a unix/linux sysadmin. I can develop and I'm very technical in general. I know my Python/Bash very well, can read C/C++ and not really comfortable with ASM.\n\nI want to get into malware analysis in the near/mid future, but haven't had any advice from an experienced malware analyst yet. To get into that field as soon as possible, I was wondering what's the [80/20](https://en.wikipedia.org/wiki/Pareto_principle) in this field. That is, what is it that I can do that will give me the most results.\n\nThanks in advance!",
        "created_utc": 1510008139,
        "upvote_ratio": ""
    },
    {
        "title": "Any tools for detecting possible DOM XSS vulnerabilities?",
        "author": "michael1026",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b8q5v/any_tools_for_detecting_possible_dom_xss/",
        "text": "Maybe I just don't know good techniques, but looking through tons of javascript to see if a value is used in a sink unsanitized is a bit too much work to do on every page. I loved how DOMinator worked, but it ran off an old version of Firefox that barely worked, plus it was a free trial. I want to use Burp Suite, but I don't know I want to renew my licence for another $350.",
        "created_utc": 1510007303,
        "upvote_ratio": ""
    },
    {
        "title": "Protect myself from ARP poisoning?",
        "author": "gottaquestion42",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b86or/protect_myself_from_arp_poisoning/",
        "text": "Hello. I am concerned about MITM attacks on my network. \n\n\nFirst off I would like to say that I know very little about how netsec works, and pretty much nothing of how networks are built. \n\n\nThe network that my apartment is connected to, seems to be like a large LAN. If there's no router between my computer and the network then my computer will discover computers on the network, even from separate apartment buildings that are adjacent and around the area. I assume this is some security flaw in the network around here but I can't really say since I don't know much about this stuff. \n\n\nMe and a friend who lives in an adjacent apartment block tested this, I could sniff his traffic from my computer even though it's not even the same building. \n\n\nSo I have a few questions about this and hope I can receive some answers. \n\n\n1. Is this a flaw on the network infrastructure?\n\n\n1.1 If so, is there anything I should do to get the landlord/ISP to fix this?\n\n\n2. What can I do to protect myself from any neighbor/person on the network that could sniff my traffic?\n\n\n3. How much of a threat is ARP spoofing? Can any attackers decrypt SSL/VPN/encrypted traffic?\n\n\n4. Are there any routers that can prevent this from happening?\n\n\nThank you for reading and I'm sorry if I sound like a noob",
        "created_utc": 1510002544,
        "upvote_ratio": ""
    },
    {
        "title": "Can't proxy Android apps using latest okhttp libraries (3.9.0)?",
        "author": "Ask-Netsec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b72my/cant_proxy_android_apps_using_latest_okhttp/",
        "text": "More android apps are using the latest version of okhttp\n\nAs they've updated, apps that were previously able to be proxied using burpsuite and the standard proxy / certificate setup can no longer be proxy\n\nMaybe the fact that burp's certificate is self signed / unsigned? \n\nThoughts?",
        "created_utc": 1509992945,
        "upvote_ratio": ""
    },
    {
        "title": "Techniques and heuristics things like Carbon Black and Cylance use?",
        "author": "Smallmammal",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b60bc/techniques_and_heuristics_things_like_carbon/",
        "text": "Obviously a lot of this is trade secret, but from a researcher;s perspective what is the most common set of techniques at work here? I imagine they're analyzing every piece of malware they can find and writing rules based on learning/statistics and constantly tweaking them on top of basic hand-written rules for common malware tricks. Curious to know what some of these rules would look like and the feasibility of writing a foss equivalent of these applications.",
        "created_utc": 1509983784,
        "upvote_ratio": ""
    },
    {
        "title": "What encryption algorithm should I use for this?",
        "author": "StuntHacks",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b4ioz/what_encryption_algorithm_should_i_use_for_this/",
        "text": "Hi,\n\nI am currently trying to create a protocol for local multiplayer over the local wifi and I am currently struggling with the encryption part of it. More specifically, I have two questions:\n\n1. What algorithm should I be using? Would AES256 be enough?\n2. When generating a key for it, would it be sufficient to just generate a 256 byte long (for example) random string and use that?\n\nI'm not able to use SSL/TLS as I can't access the system's installed certificates and the encyrption and decryption should be as fast as possible.",
        "created_utc": 1509967045,
        "upvote_ratio": ""
    },
    {
        "title": "My Windows 10 sending data to OneDrive",
        "author": "feminaziextremist",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b3x7u/my_windows_10_sending_data_to_onedrive/",
        "text": "My pfsense Isolated laptop is trying to send datat to OneDrive. I bought this laptop 1 month ago for pfsense management. so. it doesn't have any internet access.  \nRe-installed Windows 10. exact same copy of my another laptop.but only this one does this action.  \nI see access biolation error prompt for a second. then try to connect OneDrive.  \nOfcouse it deosnt have any Internet access with pfsense. but it is obviously not right.  \n",
        "created_utc": 1509957410,
        "upvote_ratio": ""
    },
    {
        "title": "Where to start",
        "author": "mackey88",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b3ecb/where_to_start/",
        "text": "I know this type of question comes up a lot but hopefully this will be a little more specific. What are some of the sub fields and which seems to be in most demand. I have seen pen-testing, blue force, red force, incident response, security researcher(I assume malware) to name a few.\n\nIn my CS course work I took a basic intro to security class, doing some malware analysis, basic exploits(javascript), discussions on network rules for security(what protocols to allow between who...) and even looking for spam emails.\n\nI was looking for some good guided curriculum as free time is not a regular vistor for me and have become an addict to purchasing udemy courses. Most of them appear to focus on pen-testing and breaking Wi-Fi passwords. From my inexperienced point of view they look more like tricks to show off then real cyber security. How often do pen testers first have to access Wi-Fi as the first step?\n\nSo to elaboratre on my initial questions about what is in demand, anyone have a good link that describes more info on the sub fields and good guided courses to learn them?\n\nThank to everyone in advance for taking  the time to provide some insight.",
        "created_utc": 1509949373,
        "upvote_ratio": ""
    },
    {
        "title": "How to recover files on 2012 iMac after Apple resets it",
        "author": "AndrewLindburg",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b11ls/how_to_recover_files_on_2012_imac_after_apple/",
        "text": "I am looking to recover files on a 2012 iMac after Apple resets it. Any ideas on how to do this without buying expensive software? My internet research has not lead to any substantive information on this kind of thing thus far.",
        "created_utc": 1509922933,
        "upvote_ratio": ""
    },
    {
        "title": "Used wifi at work on iphone",
        "author": "manimal-impact",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7b0yfs/used_wifi_at_work_on_iphone/",
        "text": "Was scrolling through Reddit (on the app) and accidentally clicked on a RoomPorn thread. Will that cause attention to IT because of the subreddit's name?",
        "created_utc": 1509922063,
        "upvote_ratio": ""
    },
    {
        "title": "A starter to InfoSec",
        "author": "kmkhant7767",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7azrxy/a_starter_to_infosec/",
        "text": "Hello Everyone , I am a Computer Science student interested in information security. But I don't know where to start . Can someone explain how I should study and which to study . I've learned html and C(Just Basics) .And ... How to become an effective penetration testor or security expert ? I'm deeply interested in networking &amp; network security.",
        "created_utc": 1509910941,
        "upvote_ratio": ""
    },
    {
        "title": "where can i find fresh traffic capture data",
        "author": "romanalder",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7azo2q/where_can_i_find_fresh_traffic_capture_data/",
        "text": "I'm looking for some fresh traffic capture data (doesn't need to be free) to work on them. all publicly available data are very old as I see. do you guys know any paid&amp;free source?",
        "created_utc": 1509909918,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone tell me if this is trying to steal my login?",
        "author": "sargontheforgotten",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ax6ly/can_someone_tell_me_if_this_is_trying_to_steal_my/",
        "text": "I was about to login into an exchange and I noticed that the address had a /# after the regular site name. I pulled up the site again in another tab, being more careful how I typed it in and this time it didn't have the /# on the same login page. Does this mean anything?",
        "created_utc": 1509883247,
        "upvote_ratio": ""
    },
    {
        "title": "From dev to pentester",
        "author": "secorno",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ax4ld/from_dev_to_pentester/",
        "text": "I am a dev and I want to become a pentester.\n\nI have 6+ years experience working on cutting edge sec testing tools as a developer. I am quite good at web pentesting, I found bugs in pretty much every web bug bounty, However, I lack the experience and my knowledge is more focused on web stuff.\n\nI'd like a salary of £60-80K + medium term remote, that probably means a seniorish position, is that possible? I am very hard worker and my cv reflects it.\nWhat other area I should consider studying? I understand the main areas I lack are infrastructure and mobile, and I am doing OSCP to get some experience on infrastructure.\nI read a couple of books on mobile security, maybe I should get some hands on?\n\nThanks\n",
        "created_utc": 1509882293,
        "upvote_ratio": ""
    },
    {
        "title": "[Hackathon] What are some infosec projects or tools you'd like to see?",
        "author": "thorn42",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ax2bq/hackathon_what_are_some_infosec_projects_or_tools/",
        "text": "I'll be taking part to a 48h hackathon next week, and I'd like to use this time to work on something related to infosec. \n\nI have a few very rough ideas around:\n\n- data visualization\n    - turning a nmap scan file into a shareable graph that can be annotated, or into a mindmap easy to visualize\n    - using Internet-wide scanning data from Censys to visualize some interesting things (TBD)\n- \"mass scanning as a service\", where you could submit some custom scripts that would then be run against all IPv4 hosts on the Internet (e.g. if you're interested to know \"how many hosts in the US are hosted on AWS and have an outdated version of Apache\"), although it seems a bit redundant with Shodan / Censys.\n- something around Docker security, such as taking an image as an input (e.g. `ubuntu:latest`) and finding all the public exploits corresponding to known vulnerabilities in the image\n\n\n\nWhat are some tools or projects you'd like to see? Looking forward to your ideas!",
        "created_utc": 1509881138,
        "upvote_ratio": ""
    },
    {
        "title": "If you dislike the idea of running realtime antivirus/antimalware programs, what security methods should be in place to make this viable.",
        "author": "OgdruJahad",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7aweay/if_you_dislike_the_idea_of_running_realtime/",
        "text": "I have heard of folks hating the notion of running a realtime antivirus/antimalware on a system. They often complain of the resource drain and possible security implications where it might be increase the chances of being compromised because you are running these programs. \n\nSo what then, do such people do to protect themselves from being infected/compromised?\n\nHeck even Steve Gibson (of Security Now podcast) tells folks its not necessary, which I feel is very wrong. \n ",
        "created_utc": 1509868346,
        "upvote_ratio": ""
    },
    {
        "title": "Need experienced opinion in regards to Discord",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7av596/need_experienced_opinion_in_regards_to_discord/",
        "text": "[deleted]",
        "created_utc": 1509849903,
        "upvote_ratio": ""
    },
    {
        "title": "Ensuring privacy protection",
        "author": "mllnnl",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7au3vh/ensuring_privacy_protection/",
        "text": "Hi, \n\nI have subscribed today to a vpn service, mainly to be safe when surfing in public wifi. At the moment, I am very satisfied by the service.\n\nHowever, few doubts still remain:\n\n* How can I be sure that all my traffic goes through the vpn? I am on Mac, and when I look on Activity Monitor, part of the traffic goes through openvpn while other goes through Safari and/or Chrome. Does this mean that the navigation through Safari/Chrome is not safe?\n* Is a firewall still required in this configuration? At the moment I have the standard OSX firewall, but I am demoing Little Snitch, which seems far too complex for my usage.\n* Can I consider myself \"safe\" if the security features of OSX are turned on (followed quite some guides) and I am under VPN on a Mac with encrypted hard drive? Are there any key steps to significantly increase privacy level on OSX?\n* What does make a vpn service more secure than an open wifi, if the vpn provider lies about the advertised specs?\n\nThanks for the replies :)",
        "created_utc": 1509838151,
        "upvote_ratio": ""
    },
    {
        "title": "How Do I Responsibly Disclose a Security Vulnerability? [cross-post from /r/hacking]",
        "author": "nmgreddit",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7atqcu/how_do_i_responsibly_disclose_a_security/",
        "text": "I was told I would have better luck here, so here we go:\n\n*Note: I'm being purposely vague in this post as to not expose the location of vulnerabilities*\n\nI have found a website that works with a US state government (on a county by county basis) to handle the exchange of some personal information of citizens. The website has security vulnerabilities that can expose this personal data. I tried calling the company that runs the website, and they assured me there were no security vulnerabilities, even though there are. I tried emailing the state government but they did not reply. I could possibly call them, but I don't know how to tell them that citizens' personal data is at risk of exposure without scaring them or making it seem like I'm the bad guy. To note, I do not live in the state and do not have the ability to visit in person. How would I properly and responsibly disclose this security vulnerability?",
        "created_utc": 1509834044,
        "upvote_ratio": ""
    },
    {
        "title": "Windows Sandbox tool and restricted user account for prevention of system damaging and spying. Shade Sandbox, Sandboxie, what to prefer and why? How to create a restricted user account?",
        "author": "wallofbytes",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7arr83/windows_sandbox_tool_and_restricted_user_account/",
        "text": "I want to use a `windows sandbox tool` to prevent any `unwanted system changes` and `personal data leaks` by `internet-using applications`. So, I can't use firewall (if i want to isolate web browser, for example), I want to create strongly restricted user account, that only have access (for reading) to allowed folders - `Windows folder`, `program files` folder, maybe (If the reverse is not allowed) `program data`. **NOT** for `AppData` or `Documents` folders of my main user, not for s`ubfolders of my main user/Desktop` (**but allow** for the my main `user/desktop` folder itself)  I want to prevent even reading by the restricted user for other folders. So I want to try to prevent leaks of my personal data. \n\n\nI do not expect to get absolute protection, for apparently malicious applications I'm using a virtual machine, I also encrypt my most important data. I would like to get some extra level of protection for everyday applications, which I want to allow saving files to my desktop, but not to other areas.\n\n\nHow to do that? Which product to prefer (I don't want to use Comodo Sandbox, so, I choose between [shade sandbox](http://www.shadesandbox.com/) and [sandboxie](https://www.sandboxie.com/)) and why?\n\nHow to create such user account? \n\nI know about SetACL, but that tool is quite difficult for me. NTFS Permission tool has a somewhat confusing interface, it's easy enough to mess up anything. What about them and any alternatives? What about SetACL studio or other SetACL GUI frontends?",
        "created_utc": 1509814257,
        "upvote_ratio": ""
    },
    {
        "title": "I'm using KeePass locked with a MasterKey that I have to type almost everytime I use it. How am I keeping my passwords safe from, let's say, a keylogger?",
        "author": "Rodrigorazor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7arn0r/im_using_keepass_locked_with_a_masterkey_that_i/",
        "text": "Title.\n\nThanks in advance for any answers!",
        "created_utc": 1509813042,
        "upvote_ratio": ""
    },
    {
        "title": "Any course or study guide/help for cellular pentesting ?",
        "author": "r3d-c0d3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ar9pc/any_course_or_study_guidehelp_for_cellular/",
        "text": "",
        "created_utc": 1509809264,
        "upvote_ratio": ""
    },
    {
        "title": "[Cross post] Any tips for interviews totally bombed yesterday.",
        "author": "stud_ent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7aqmo6/cross_post_any_tips_for_interviews_totally_bombed/",
        "text": "Had an interview for an Associate cyber security consultant.\n\nI completely bombed the interview despite my best efforts at preparing.\n\nA big part of my problem is that I get stupid nervous during interviews, I actually have an anxiety disorder, I'm not trying to make excuses but this process in hiring is always the most difficult for me.\n\nYou can literally hear my voice shaking, and my mind simply goes blank and shuts down.\n\nThe interview questions mostly consisted of how to code xyz on the spot over the phone. While I got some I was totally embarassed as programming isn't something I've done on a regular basis.\n\nHow do you do xyz in javascript/html5/css/sql etc. I am no where near goof enough to do the more advanced stuff over the phone on the spot.\n\nI'm pretty bummed out as I really wanted the job. But I understand I'm a weak canidate. Should I just stop studying netsec until I get more programming experience under my belt?\n\nI've just been compromising VM'S on my laptop.",
        "created_utc": 1509802190,
        "upvote_ratio": ""
    },
    {
        "title": "Good Password Complexity Metric?",
        "author": "sstewartgallus",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ane1x/good_password_complexity_metric/",
        "text": "I want to reject passwords that are bad. However, most sites have very stupid password complexity checkers. They are extremely arbitrary and reject valid passwords. So, I want to use something based on solid mathematics.\n\nMathematically one can find the Shannon entropy of something by breaking it into chunks and adding the negative probabilities of the chunks times their logarithms. However, this approach seems to have some flaws to me.\n\nI think what I want to model something like a second-order Markov source:\n\nhttps://en.wikipedia.org/wiki/Entropy_(information_theory)#Data_as_a_Markov_process",
        "created_utc": 1509753787,
        "upvote_ratio": ""
    },
    {
        "title": "Need help understanding CVE-2017-3548 PeopleSoft XXE vulnerability.",
        "author": "MarkThatDMARC",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7aml1n/need_help_understanding_cve20173548_peoplesoft/",
        "text": "Hey everyone, \n\nCan someone tell me how this XXE exploit found at https://erpscan.com/advisories/erpscan-17-020-xxe-via-doctype-peoplesoft/ is supposed to work? I cannot find an example of it working anywhere.\n\nFurthermore, when I try using the exploit at the end of the article, nothing really happens. The response I get from the server states \"PeopleSoftServiceListeningConnector:HTTPRequest : SAXException occured while parsing the SOAP Document. SAXExceptionMessage : The markup declarations contained or pointed to by the document type declaration must be well-formed.\"\n\nAm I missing something? Does this exploit actually work? \n",
        "created_utc": 1509745548,
        "upvote_ratio": ""
    },
    {
        "title": "Cracking a MD5(Unix)/Md5Crypt hash",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7am72j/cracking_a_md5unixmd5crypt_hash/",
        "text": "[deleted]",
        "created_utc": 1509741758,
        "upvote_ratio": ""
    },
    {
        "title": "What is ddosing? can it knock out a electrical fuse?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7am6wc/what_is_ddosing_can_it_knock_out_a_electrical_fuse/",
        "text": "[deleted]",
        "created_utc": 1509741712,
        "upvote_ratio": ""
    },
    {
        "title": "what is the proper way to store one-time-use password tokens server-side?",
        "author": "johnnagro",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7am2qy/what_is_the_proper_way_to_store_onetimeuse/",
        "text": "if an app developer is implementing a Google Authenticator compatible 2fa, they'd be storing the starting token somewhere. where should that be?\n\ni suppose the point of 2fa is to protect against gaining access to an app with the password alone. assuming the password leaked in some other way than losing your app database to a hacker (with the hashes) because losing the hashes means access to the front-end of the app is probably a moot point... if that is the case, storing the 2fa token with the hash is probably fine?\n\nthoughts and feelings? any good reading out there?",
        "created_utc": 1509740593,
        "upvote_ratio": ""
    },
    {
        "title": "Speaking about security, is there a difference between external public IP and external private IP?",
        "author": "TheMoltenJack",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7altxs/speaking_about_security_is_there_a_difference/",
        "text": "My ISP provides by default an external private IP but if I wanted I could ask for a free static public IP, but my question is: is one of them more secure than the other or there is no big difference? At the moment I don't need a public IP address but in the future I probably will as I'm thinking about messing around with servers and things like those.",
        "created_utc": 1509738321,
        "upvote_ratio": ""
    },
    {
        "title": "Cracking a zip file but with some specifics",
        "author": "modeus",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7aiauw/cracking_a_zip_file_but_with_some_specifics/",
        "text": "I'm looking for a tool that can crack a zip file, using a dictionary of words I provide, but I need the tool to try all sequence combinations of those words (not very concerned about case variations yet).\nIt would be ideal if I could specify the maximum number of words to combo per attempt. So, for example, I have a dictionary of 20 words, but I know the password isn't using more than 3 of them.\nIs there any tool that can do this? I was trying to use this: http://www.daossoft.com/products/zip-password-rescuer.html\nWhich does run from a custom dictionary and tries to use word combinations but it has a bug in it's combo algorithm which makes it useless.\nAny ideas? Appreciate any advice.",
        "created_utc": 1509701365,
        "upvote_ratio": ""
    },
    {
        "title": "I would like to hear opinions on, using additional mail security services such as proofpoint or mimecast for GMAIL suite.",
        "author": "SecFelix",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ai8e4/i_would_like_to_hear_opinions_on_using_additional/",
        "text": "",
        "created_utc": 1509700180,
        "upvote_ratio": ""
    },
    {
        "title": "How would I hunt down someone who was trying to bait me on a site?",
        "author": "autifa",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ahvbk/how_would_i_hunt_down_someone_who_was_trying_to/",
        "text": "they tried getting me to click a link! https://kiwi.qa/autifa/what-are-some-mysteries-youre-trying-to-solve &lt;-- that Q and A site has an anonymous feature! Since it sounds like they are out to get me I want to find out! Best way to do it if site owners won't say?",
        "created_utc": 1509693815,
        "upvote_ratio": ""
    },
    {
        "title": "Does converting a video file gets rid of viruses and tracers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ahhck/does_converting_a_video_file_gets_rid_of_viruses/",
        "text": "[deleted]",
        "created_utc": 1509687700,
        "upvote_ratio": ""
    }
]