[
    {
        "title": "Information Security Engineer...?",
        "author": "geekyasiangirl",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ag1n8/information_security_engineer/",
        "text": "Hi everyone! First time posting here, I'm a student majoring in computer science and I'm very interested in security. I'm looking to becoming a information security engineer, can someone (preferably someone with related background) enlighten me on what this position is about and the top tech companies for this kind of position? How about salary wise? Is it comparable to a generic software engineer? What is the current and future demand for this position? Thanks everyone!\n",
        "created_utc": 1509670629,
        "upvote_ratio": ""
    },
    {
        "title": "How do I change the email address associated with my Reddit user account (I've been hacked, I think) ?",
        "author": "TheSimpsonsContext",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7afv4d/how_do_i_change_the_email_address_associated_with/",
        "text": "Using my other reddit account, recently I saw a warning at the top of every page on reddit: \"Uh oh! We have suspended your account due to suspicious activity. Not to worry. You can continue using Reddit by resetting your password.\"\n\nWhen I click the link to reset my password, it asks me to send a Password Reset email... but the email address that is pre-set (and not changeable in its text box) is not mine.  It's a gmail account in the format of first.last@gmail.com with a Turkish man's name.\n\nI'm assuming my account was hacked and someone changed my email address but not my password.\n\nMy username and password combo work just fine.  I would just like to change my password without sending an email to a fraudulent email address I've never heard of, and I would not be able to answer anyway.",
        "created_utc": 1509668741,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking advice for how much to charge.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7af17u/seeking_advice_for_how_much_to_charge/",
        "text": "[deleted]",
        "created_utc": 1509660767,
        "upvote_ratio": ""
    },
    {
        "title": "Imperva SecureSphere WAF anyone?",
        "author": "noreasterner",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ae00s/imperva_securesphere_waf_anyone/",
        "text": "Looking for someone who has experience working with their SecureSphere WAF. Do you like the product? Is it easy to manage? What is their false positive rate? How is their Dynamic Application Profiling feature? How is their support in general? ",
        "created_utc": 1509651645,
        "upvote_ratio": ""
    },
    {
        "title": "Safe gmail alternatives?",
        "author": "zangerinus",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7adt9f/safe_gmail_alternatives/",
        "text": "So today I tried creating a new gmail account (has been years!), and discovered that it requires a phone verification. I looked up workarounds, but they were either outdated or some scam virus.\n\nSure I could look up a list of free mail providers, but odds are most of them are poorly secured and will probably get breached some time. I need a mail address permanently, not some throwaway stuff.\n\nIs there a workaround, are there any safe mail services?\n\nThanks!\n\nedit:\n\nhttps://www.mysms.com/apps\n\nThis is the least shady program I found, that might fix the SMS confirmation thing. \nStill paranoid about security though.",
        "created_utc": 1509650044,
        "upvote_ratio": ""
    },
    {
        "title": "Storing credit card numbers as a customer",
        "author": "squasmoas",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7adrw2/storing_credit_card_numbers_as_a_customer/",
        "text": "I've always rejected Chrome's offer to save credit card numbers. It appears insecure. Does this violate PCI DSS? Is typing credit card numbers (with expiration months and CVVs) into a KeePass database a good or bad idea?\n\nIs letting autofill save my address(es) a good or bad idea?",
        "created_utc": 1509649710,
        "upvote_ratio": ""
    },
    {
        "title": "Carbon Black vs. Cylance vs. CrowdStrike vs. Windows Defender ATP",
        "author": "ProfessorLag",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7acbec/carbon_black_vs_cylance_vs_crowdstrike_vs_windows/",
        "text": "Can anyone attest to any of these? The latest posts are 6+ months old and little about CrowdStrike and ATP (new product). The posts also talk about lack of a lot of features that have since been integrated into these products\n\nMainly we want to know about overhead. Which of these products is the best at low overhead (small security team) but still is a good product? If it takes a small project to setup, that is fine. But overall day-to-day management, what is it like for those that do it? Is it 10% of an engineer's day, 25%? Need 1 FTE just to own the tool?\n\nWe're an enterprise of 5,000 endpoints that are highly mobile and international. We're going to come down to 2 of them and do PoC's, but are wanting to get real life opinions on which ones we should actually move forward with testing.\n\nPlease disclose the type of environment you're working in as well if you feel comfortable doing so.\n",
        "created_utc": 1509637065,
        "upvote_ratio": ""
    },
    {
        "title": "Hi /r/AskNetsec I'm going to pour my savings into developing a product which I think will change the way some companies manufacture some goods. How do I store files/designs safely? How do I work safely using cloud computing? How do I cover my tracks security wise? Is OK to use Google Drive/Dropbox?",
        "author": "StarWarsStarTrek",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ac5u5/hi_rasknetsec_im_going_to_pour_my_savings_into/",
        "text": "I realise these are generic questions - but as my personal money is involved I’m a lot more paranoid than ever.\n\nSo far I have designs, calculations and large simulation files (many gigabytes) stored on my laptop.\n\nI need access to these files where ever I am - cue cloud computing.\n\nThe last thing I want is an Equifax style break-in where credentials are easy to get to.\n\nBasically how do I protect myself?\n\nSorry if this is the wrong sub.",
        "created_utc": 1509635692,
        "upvote_ratio": ""
    },
    {
        "title": "Mysterious Programm “G”",
        "author": "prime_2501",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7abev8/mysterious_programm_g/",
        "text": "I just recently shut down a partition of my pc which runs windows and it appeared that it couldn’t shut down due to a program with name “G” after it i shut down and unfortunately I could take a screenshot. Then I turned the computer on and checked the running processes but couldn’t find it. After this I did a complete scan of the system with the antivirus Comodo but couldn’t find anything again. Can anyone point me out what this program is or another antivirus?",
        "created_utc": 1509628547,
        "upvote_ratio": ""
    },
    {
        "title": "Nessus credential scan setup question.",
        "author": "shoanimal",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7ab9xm/nessus_credential_scan_setup_question/",
        "text": "So i am new to Nessus, and NetSec in general, and had some questions about setting things up.  So my company has a Nessus server and we want to start doing a credentialed scan, and i'm not sure where to start. Does anyone have some advice to get me started? Is the cookie cutter Audits adequate or should i be looking to customize things? Also any sources for some learning material would be very welcome.  Thanks in advance for your responses.",
        "created_utc": 1509627075,
        "upvote_ratio": ""
    },
    {
        "title": "scan web site with appscan, the report misleading, please advice",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7aatil/scan_web_site_with_appscan_the_report_misleading/",
        "text": "[deleted]",
        "created_utc": 1509621507,
        "upvote_ratio": ""
    },
    {
        "title": "I have a server I need to run some EICAR stuff on against other software, if I remove Carbon Black and reinstall will it flag and piss off my SOC?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a98f2/i_have_a_server_i_need_to_run_some_eicar_stuff_on/",
        "text": "[deleted]",
        "created_utc": 1509596620,
        "upvote_ratio": ""
    },
    {
        "title": "Hacker keeps gaining access, don't know how",
        "author": "AuYsI",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a8g1n/hacker_keeps_gaining_access_dont_know_how/",
        "text": "so a hacker seems to keep gaining access to my MS account, despite me changing my password, does anyone know how he could be doing this?\n\n\nAlright, clarifying, I have reset my pc and scanned my network. Nothing. I know who the hacker is, I don't know them irl.\n\n\nMy question is could they have added some auth or info into my ms account to allow them constant access",
        "created_utc": 1509587914,
        "upvote_ratio": ""
    },
    {
        "title": "A hacking group hacked someone else's website and is using it to launch attacks at other people (like a place I do work for.) What should I do?",
        "author": "sstewartgallus",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a7pzi/a_hacking_group_hacked_someone_elses_website_and/",
        "text": "I'm in a difficult situation at the moment due to illness and other junk and don't want to go through the effort of the conversation. Also, the site is a Ukrainian site and they might not speak English.",
        "created_utc": 1509580862,
        "upvote_ratio": ""
    },
    {
        "title": "My memory is failing, perhaps one of you remembers? Site that posts random form data to known credential harvesters.",
        "author": "Primal_Thrak",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a63vn/my_memory_is_failing_perhaps_one_of_you_remembers/",
        "text": "As the title states, there is (or was) a site that you would copy/paste a link from a phishing email (like a bank cred harvester) and it would hammer that site wit fake logins to create enough noise that it renders the database unusable. Can anyone remember what it was called? It has been at least a decade since I have even thought about it.\n\nThanks!",
        "created_utc": 1509566062,
        "upvote_ratio": ""
    },
    {
        "title": "Need an opinion",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a58d4/need_an_opinion/",
        "text": "[deleted]",
        "created_utc": 1509558358,
        "upvote_ratio": ""
    },
    {
        "title": "Jeez, anyone get a Shmoocon ticket?",
        "author": "mspaint_exe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a4jd0/jeez_anyone_get_a_shmoocon_ticket/",
        "text": "I was refreshing for a while and clicked through the challenge question as fast as possible, still didn't get through. Did it sell out in &lt;3 seconds?",
        "created_utc": 1509552297,
        "upvote_ratio": ""
    },
    {
        "title": "Is it reasonable to host your own cloud?",
        "author": "Physics-is-Phun",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a3srb/is_it_reasonable_to_host_your_own_cloud/",
        "text": "So, I've been thinking about hosting my own cloud on something like a Raspberry Pi (which I know I'd have to take a bunch of steps to secure) or a cheap laptop that doesn't use much power (which I'd likely have to take fewer steps to secure, but would still be a project). Basically, it'd be nice (though not ultimately necessary, if I decide against this project) to host the project files I work on in one place, plug that machine into my modem/router, and then be able to ssh in whenever I wanted to work on those projects.\n\nTo give some more background/threat model:\n\n- My files are largely just text files and spreadsheets that I convert to pdf with LaTeX;\n\n- I suspect that I am not likely a person of interest in targeted surveillance/etc, but wouldn't host any files that I'd want to \"get out\" on this device, anyway- it's literally just notes and spreadsheets of lab data that I'd want to host on this machine;\n\n- While generally aware of the need to secure devices, I am still somewhat new to Linux, wholly new to this kind of project, and have a fairly basic understanding of how to secure such devices from what I've found just googling around (think Wired or LifeHacker-type articles, as far as depth of understanding goes), so it's possible I'd need to do a bunch of reading (which I'm willing to do) on making sure that my machine is safe(ish) from, say, random hackers just sniffing for open ports/etc.\n\n- I'd likely use something like OwnCloud to set it up, though am open to suggestions. Open-source would be nice!\n\nHas anyone done a project like this? What pitfalls should I look out for? Also, for my use case, do you think it's worth the hassle/trouble to do it? Mostly, it's just for convenience, but then, so are DropBox/Google Docs, I'm just trying to get out of those services just because a) I'm trying to de-Google myself, and b) I don't like the idea that those cloud services currently can look through any files I put on those services. I'm not someone with something to hide, but I value my privacy, and don't want to go through the trouble of encrypting before I upload if I don't have to.\n\nThanks for any advice you can offer!",
        "created_utc": 1509545460,
        "upvote_ratio": ""
    },
    {
        "title": "My first SE vulnerability. Please advise me.",
        "author": "georgionic",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a3j3a/my_first_se_vulnerability_please_advise_me/",
        "text": "I have discovered a social engineering vulnerability in the password reset system of a big US company where they can give me a new password if I just give  them some simple information over the phone. Is there any way I can make a benefit from that legally? I would love some extra money but I don’t know how that works.",
        "created_utc": 1509542648,
        "upvote_ratio": ""
    },
    {
        "title": "Good JWT Encoder / Decoder For Command Line?",
        "author": "Ask-Netsec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a3fxk/good_jwt_encoder_decoder_for_command_line/",
        "text": "Tons of JWT encoders &amp; decoders on the internet like https://jwt.io/, but I am NOT interested in entering secrets on random websites ",
        "created_utc": 1509541698,
        "upvote_ratio": ""
    },
    {
        "title": "Statute of limitations on debt for security clearance?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a39sp/statute_of_limitations_on_debt_for_security/",
        "text": "[deleted]",
        "created_utc": 1509539729,
        "upvote_ratio": ""
    },
    {
        "title": "x-post from /r/QRadar: How to monitor Windows Defender log in QRadar?",
        "author": "splunk_n00b",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a2mrl/xpost_from_rqradar_how_to_monitor_windows/",
        "text": "Hi,\nI have managed to install Wincollect and forward Windows Event Collection to my QRadar console. From there, what i would like to achieve is to monitor Windows Defender logs and alert if there are any anomalies detected, may i know what are the steps i could take to implement it?\nAppreciate any guidance i could get!",
        "created_utc": 1509530788,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding Security Now podcast, how useful is it to the general public and what problems have you noticed with it, and this includes SQRL.",
        "author": "OgdruJahad",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a2adt/regarding_security_now_podcast_how_useful_is_it/",
        "text": "I am a long time listener to the Security Now podcast on the TWIT channel, and while I consider it very helpful in learning some of the issues related to 'security current affairs' I also know that in the past Steve Gibson was frowned upon on his account of him jumping to conclusions on why things were as they are like the raw sockets situation as well as other issues. \n\nMy main question stems from the fact that many of those issues that people have had with him are now rather old and IMHO his podcast is valuable to the general public, but I'm worried about what I'm missing regarding this podcast, what is he leaving out, what confusion he may be creating.  \n\nPS: I am well aware that he is not a security researcher per se, and has not published any security related papers.\n\nEDIT:Also please give your view on his SQRL project, while he is confident that it will fix the password issue am I not, he continues to compliment his solution as bullet proof and I'm not sure it is. ",
        "created_utc": 1509524582,
        "upvote_ratio": ""
    },
    {
        "title": "Is a 'logout token' always issued when a session dies?",
        "author": "hughjones485",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7a1glz/is_a_logout_token_always_issued_when_a_session/",
        "text": "I am working on a web application. Once the user presses a button to trigger the logout process, a 'logout token' is issued via a GET based parameter which is then viewable in the user's Internet history.\n\nHowever, from my understanding, it is evident that a session can terminate under particular circumstances (e.g once the user wipes their Internet history). In these circumstances, is a 'logout token' issued?\n\nI have also seen sessions expire with a set timeout period without being able to see a 'logout token' anywhere.\n\nI have searched extensively and I have been unable to find any resources which answer my question. ",
        "created_utc": 1509511243,
        "upvote_ratio": ""
    },
    {
        "title": "spreadsheet of malicious hash values?",
        "author": "Ipadiphoneicoffee",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79zdzn/spreadsheet_of_malicious_hash_values/",
        "text": "If you are using tools like Carbon Black, and Cylance they allow you to ban objects in your environment by SHA-256 hash value. Is there a repository of malicious values? I know that I can go to a place like Virus Total and get a hash value or type the word \"flash\" and get malware hashes, but you only get like 10 at a time and it is tedious.  \n\nI'd like to get a spreadsheet maybe of some of the latest malware hash values of this year and plug them into Cylance or Carbon Black. Technically they are both \"AI\" yet they need a good bit of fine tuning and attention. Any ideas? ",
        "created_utc": 1509488721,
        "upvote_ratio": ""
    },
    {
        "title": "Why hasn’t anyone made a perfect vpn?",
        "author": "fatfig",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79z8fd/why_hasnt_anyone_made_a_perfect_vpn/",
        "text": "I mean why are these still an issue?  \n  \n- DNS leaks  \n- getting disconnected suddenly    \n  \nOr is there a vpn that has patched these problems completely?",
        "created_utc": 1509487273,
        "upvote_ratio": ""
    },
    {
        "title": "How to clean or use files without tracers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79y52j/how_to_clean_or_use_files_without_tracers/",
        "text": "[deleted]",
        "created_utc": 1509477765,
        "upvote_ratio": ""
    },
    {
        "title": "How to check or clean files for tracers",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79y2ct/how_to_check_or_clean_files_for_tracers/",
        "text": "[deleted]",
        "created_utc": 1509477140,
        "upvote_ratio": ""
    },
    {
        "title": "CTP/OSCE What do you think?",
        "author": "TwistedLove_BDO",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79wzr3/ctposce_what_do_you_think/",
        "text": "Hello,\n\nWhat do you think about CTP/OSCE now days? It seems that they have no update their course, they are still on version 1 compared to OSCP, the PWK course is at version 3. G0tmilk has a blog on it and talks about people saying it is out dated. G0tmilk posted that 2013 which was 4 years ago. How about now (The answer is probably still the same)? I am planning on taking it for fun... like I did with oscp. Please shared your recent experiences if you have any! My career plan is to become a pentester (So maybe it is worth!). I was thinking about taking the WIFU but I decided I may just take CTP first. Thoughts ^^",
        "created_utc": 1509468108,
        "upvote_ratio": ""
    },
    {
        "title": "How about this software ? Is it safe ?",
        "author": "joker197cinque",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79wluc/how_about_this_software_is_it_safe/",
        "text": "Hi guys,\n\ndo you know Loki tool (IOC scanner) ? Is it safe to use or it contains spyware/adaware/malware ecc ?\n\nThanks",
        "created_utc": 1509464788,
        "upvote_ratio": ""
    },
    {
        "title": "Stacked URL attack?",
        "author": "garthvader77",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79wl43/stacked_url_attack/",
        "text": "Hello! I've had quite a few queries to my website of the form http://example.com:80http://example.com:80/X, where sometimes example.com is my websites domain, its IP address, or another website's address entirely.  X is usually a phpMyAdmin login URL (I'm running Wordpress, but not actually using phpMyAdmin so it's not too big of a deal).  Sometimes the port is 443 instead of 80 (I force ssl so they should all be 443 technically).  I'm curious what they're trying to accomplish with the stacked URLs since when I try to visit them they do not yield any results.  \n\nI'm sure these aren't called stacked URLs actually haha, but I've been unable to construct a google query to describe them and was hoping someone here could help me figure out how I can find out more info about them!  Thank you for reading this and for any possible help!",
        "created_utc": 1509464609,
        "upvote_ratio": ""
    },
    {
        "title": "Question From a Civilian - Smart Thermostat",
        "author": "EverybodyIsBitches",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79vukn/question_from_a_civilian_smart_thermostat/",
        "text": "Does this sub take civilian questions, and if so:  Any recommendations for getting a smart thermostat for my house?  Should I just say \"no\" to web-connected devices, or are there some thoughtful manufacturers with  \"pretty good security\"?",
        "created_utc": 1509457817,
        "upvote_ratio": ""
    },
    {
        "title": "Honeypot, its value and implementation",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79v9tp/honeypot_its_value_and_implementation/",
        "text": "It's said that honeypot is valuable tool to understand attacker behaviours. do you find in useful setting up in an enterprise environment? if you were to recommend then where should i set it up ? in a DMZ with a isolated  network segment ? thanks",
        "created_utc": 1509451527,
        "upvote_ratio": ""
    },
    {
        "title": "Cyber security government jobs",
        "author": "MacStation",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79tj2s/cyber_security_government_jobs/",
        "text": "I posted this in cscareerquestions, but it works here too so I copy pasted it. Not sure if this question is appropriate for this sub though. \n\n\nHey everyone, I was recently given the opportunity to take a scholarship with my university that would provide me with full tuition through my masters, and a sizable living stipend. In exchange, I'd have to work for the government for three years (the equal amount of time I'd be receiving the scholarship). If I graduate and decline to work for the government, I owe the scholarship the same amount they gave me (rough estimate of 120k).\nCurrently I'm conducting paid research with a professor at my university, and by accepting this scholarship, I'd have to stop getting paid for it as the scholarship would cover it, but should I decline the government job in the future, I'd be out of the scholarship money they gave me, and have lost the potential income I'd have with the paid research.\nI was wondering what everyone's thoughts on this opportunity are? The scholarship is called Cybercorps for those interested in more information. How is government work? Is this scholarship a good idea?\nThere's also the point that I'd have some government agency (NSA, FBI, CIA, DoD, DHS, etc.) on my resume as my first job out of college, is that alone enough to make this worth it?\n",
        "created_utc": 1509424718,
        "upvote_ratio": ""
    },
    {
        "title": "Brother needs help passing his sec+ exam and looking for ways to study and make sure he passes the next one",
        "author": "Bokuchibinawa",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79sfvq/brother_needs_help_passing_his_sec_exam_and/",
        "text": "Howdy folks! Everyone here was super helpful when I asked for some books to send my brother when he was deployed, and now he's home (safely :D ) and he's having trouble passing his Sec+ exam.\n\nHe's getting anywhere from 660-730 on his exams (he said he needs 750 and it's CompTIA if that's needed to know), and he's getting pretty down and frustrated.\n\nSo, I told him I'd try to help out, and you folks are the ones I know to try and help me help him, ya know? If anyone could send some study guides, questions &amp; answers, videos, or anything that'd help him get over that hurdle I'd be incredibly grateful. Also, if it's something you'd feel uncomfortable posting for whatever reason but still think it'd help, please don't hesitate to PM me.\n\nThank you again! You were all an awesome bunch last time I reached out for help! Here's to hoping I can give an update post with him passing :)",
        "created_utc": 1509413513,
        "upvote_ratio": ""
    },
    {
        "title": "About VPNs (stupid question)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79rg8p/about_vpns_stupid_question/",
        "text": "[deleted]",
        "created_utc": 1509404154,
        "upvote_ratio": ""
    },
    {
        "title": "How do Dropbox clients and other web-connected desktop programs store credentials and session tokens?",
        "author": "tornato7",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79q5bs/how_do_dropbox_clients_and_other_webconnected/",
        "text": "When I download and log into Dropbox on Windows or Mac (not the website but the actual application), it keeps me logged in indefinitely. That means, somewhere, it needs to store a token / session / credentials that allow it to access the Dropbox servers and doesn't disappear when I restart (so it's not in memory).\n\nWhere / how are these credentials stored securely? It doesn't seem to use the Keychain. In general, how can I store a sensitive token on a computer without it simply being a vulnerable plaintext / obfuscated plaintext file?",
        "created_utc": 1509392333,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone using a device like Packet Viper?",
        "author": "baconisgooder",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79pylt/is_anyone_using_a_device_like_packet_viper/",
        "text": "I just had a demo on a product called Packet Viper.  The device sits in line in front of your firewall to reduce the traffic hitting your firewall.  The big takeaways I had:\n\n1)  It has active deception where the appliance will open random ports and protocols just to it and monitor what hits it and add those address to a block list\n\n2)  It has a bunch of global block lists you can apply to traffic coming into your network\n\n\nThe idea is to limit what's hitting your firewall and SEIM to reduce alerts and such.\n\n\n\nIs anyone using something like this?  It feels like a hard sell to me but I've now had 4 different vendors locally try to push this on me as something everyone is doing.  We have new next gen firewalls everywhere so adding another appliance to filter traffic just seems odd to me.  I feel like I'm missing the bigger picture.  Is this something companies are implementing and I need to seriously consider it?  \n\n",
        "created_utc": 1509390718,
        "upvote_ratio": ""
    },
    {
        "title": "How would you prove or disprove this theory",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79pv4m/how_would_you_prove_or_disprove_this_theory/",
        "text": "[deleted]",
        "created_utc": 1509389872,
        "upvote_ratio": ""
    },
    {
        "title": "Preparing as Red Team before defense competition. What persistantance, backdoors to do?",
        "author": "SecurityBoons",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79pjd0/preparing_as_red_team_before_defense_competition/",
        "text": "Hello all,\n\nI will be participating in my first cyber defense competition as Red Team. I have access to the blue teams environment before the competition starts. I was hoping to get ideas for backdoors and persistent hacks to challenge these ladies and gents.\n\nFor example, a few things come to mind. Running unneeded services, netcat, user accounts and SSH keys.\n\nIf any come to mind, please share your ideas for this situation. Thank you.",
        "created_utc": 1509387025,
        "upvote_ratio": ""
    },
    {
        "title": "Helping a friend with a DDOS attack",
        "author": "ChillStoopid",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79p269/helping_a_friend_with_a_ddos_attack/",
        "text": "A friend of mine has a hosted web site that's been under DDOS for a couple weeks and I'm trying to help him out. Since he has limited access, the best solution I could think of is to write a script that loos for duplicate ip addresses within a certain time frame and adds them as blocks in .htaccess. Finding IPs and appending the file aren't the problem. I can't for the life of me figure out how to do the timing logic in bash. I think I can do this in python pretty easily, but I don't have access to logs to check and I'm quicker in bash. Anyone got any ideas?",
        "created_utc": 1509382876,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Rabbit question",
        "author": "phatezero",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79on5f/bad_rabbit_question/",
        "text": "What happens to a machine that is up to date on the Microsoft security patches but they download the fake Flash Player?\n\nDoes that specific machine still get encrypted?\nDoes it still reach out to the domain to download the 2 files that hijack the machine?\nDoes anything happen at all?",
        "created_utc": 1509379211,
        "upvote_ratio": ""
    },
    {
        "title": "Windows Defender. Is it Worth?",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79nqw7/windows_defender_is_it_worth/",
        "text": "Can Windows Defender be used as the only good native AV and that there is no need to substitute for other third party AV ? thanks.",
        "created_utc": 1509370607,
        "upvote_ratio": ""
    },
    {
        "title": "Ad Blocker with security features: what do you think about it?",
        "author": "Krikrikris",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79nnzs/ad_blocker_with_security_features_what_do_you/",
        "text": "Hi, guys! Here is StopAd adblocker with security features: antiphishing, [anti-tracking](https://stopad.io) and [anti-cryptomining](https://blog.stopad.io/2017/09/26/stopad-protects-your-system-from-abuse-by-website-cryptocurrency-miners/). \nWould you use such app? ",
        "created_utc": 1509369751,
        "upvote_ratio": ""
    },
    {
        "title": "Assets registration and evaluation",
        "author": "besmile4ever",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79n70s/assets_registration_and_evaluation/",
        "text": "Hi all\n\nlooking for standard if you have to deal with assets and categories them based on its criticallity..is there any standard to follow?",
        "created_utc": 1509364328,
        "upvote_ratio": ""
    },
    {
        "title": "Nexpose on kali with 4GB ram on hosted kali",
        "author": "Tha_Format",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79mti3/nexpose_on_kali_with_4gb_ram_on_hosted_kali/",
        "text": "Hi, can anyone help me? Nexpose refuses to start as there is only 4GB of Ram.\nIt exits with :\n# There is insufficient memory for the Java Runtime Environment to continue.\n# Native memory allocation (mmap) failed to map 283656192 bytes for committing reserved memory.\n# An error report file with more information is saved as:\n# /opt/rapid7/nexpose/nsc/hs_err_pid21996.log\nThe Java virtual machine has aborted.\nNeXpose security console exited with code 3\n\n\n",
        "created_utc": 1509358930,
        "upvote_ratio": ""
    },
    {
        "title": "GCIH - using braindump questions to test my knowledge. Good or bad?",
        "author": "Callmeacc10",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79lw9m/gcih_using_braindump_questions_to_test_my/",
        "text": "I'm preparing to take my GCIH next month and I am thinking of using braindump as a way to make sure I didn't overlook something. Sans only includes 2 practice exams and I want to have more opportunities to test my knowledge and make sure my index is ready for the real exam.  I don't want to use braindumps to memorize the answers and pass because I will be hurting myself at the end of the road. What do you guys think? Is this a good or bad idea? ",
        "created_utc": 1509343111,
        "upvote_ratio": ""
    },
    {
        "title": "Help me with / recommend me a proper MITM setup.",
        "author": "Snowlav",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79kfvy/help_me_with_recommend_me_a_proper_mitm_setup/",
        "text": "Hey /r/AskNetsec.\n\nWas told to ask here, not sure if this is the right place but I wanted to try anyway.\n\n\nMy hobby / work requires me to do a lot of traffic analysis on mobile apps, usually through MITM attacks (hence the title).\nNormally I will setup MITMProxy on my desktop (or an equivalent) and explicitly set a proxy on the client.\n\nHowever, this has 2 issues:\n\n- When setting a proxy through the client OS, it's up to the app to adhere to that.\n\n- When setting a proxy on the networking level (iptables), requires root access.\n\nAs you can guess, not all apps adhere to proxy settings through the OS, and not all apps like a phone that's rooted.\n\nTo combat this, I had the idea to setup a transparent proxy. Conveniently I have a spare laptop and an old router I can set to \"bridge-mode.\n\nHowever my limited networking (and linux) skills leave me a bit overwhelmed and I am not sure how to tackle this.\n\nI wasted a lot of hours over the weekend reading years old guides and tutorials on setting up access points and all that, you name it. And all I found out is that the WiFi adapter I had intended and bought specifically for this project, does not work on kernels above 3.9 :(\n\nSo I thought I'd reach out before purchasing anything new, and see if I could get it to work with a spare Linksys EA6200 AC900 as access point, and using my built in WiFi adapter to connect to the internet.\nWith my laptop in between as acting as a router / capture box.\n\nIf anyone has recommendations or tips, guides, anything, I would appreciate it.\n\nOh.. and no harm is being done. :)",
        "created_utc": 1509324714,
        "upvote_ratio": ""
    },
    {
        "title": "Execute shellcode on Linux with Python?",
        "author": "n00py",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79k9wr/execute_shellcode_on_linux_with_python/",
        "text": "I was curious of anyone knows how to execute shellcode on Linux with python.  \n\nThere is a lot of information on how to do it with windows, but not much with Linux.\n\nI know how to do it with C, but I was curious if there was a way to do it within python, or any other interpreted language that comes on typical Linux systems.",
        "created_utc": 1509322849,
        "upvote_ratio": ""
    },
    {
        "title": "Keeping passwords in a txt file on a VeraCrypted Drive. Good idea?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79k2na/keeping_passwords_in_a_txt_file_on_a_veracrypted/",
        "text": "[deleted]",
        "created_utc": 1509320740,
        "upvote_ratio": ""
    },
    {
        "title": "I’m in a pickle - can you help? Volunteering jobs?",
        "author": "FunctioningUrals",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79jznw/im_in_a_pickle_can_you_help_volunteering_jobs/",
        "text": "I’m working on my cyber security skills, and so far I’ve done most of the pen test labs, and over the wire without fail (some issues that took a while but I resolved them and completed). I’m happily full time employed in full stack development but want to pick up a volunteering only job to gain some practical experience - the issue is no companies out here have volunteer opportunities- does anyone know where I can volunteer remotely? I’m willing to take test to prove I know fundamentals and practical security - my ultimate goal is CEH with CISSP, but I need the experience to reach and get that. \n\nTL;dr: any place I can volunteer to do cyber security with and gain knowledge?  \n\nDM me if you don’t want to post! :) thanks in advance ",
        "created_utc": 1509319845,
        "upvote_ratio": ""
    },
    {
        "title": "Cent Browser safety. Or other non-spying alternative to them (chromium-based) with a good font-rendering engine",
        "author": "wallofbytes",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79jf6s/cent_browser_safety_or_other_nonspying/",
        "text": "Hi! Some time ago, I posted [this question (/r/privacyiotools)](https://www.reddit.com/r/privacytoolsIO/comments/6og661/is_it_safe_to_use_cent_browser_instead_of_pure/) about CentBrowser safety. Users said no, but now, maybe, it's time to change the opinion or think about alternatives (chromium-based *only*). I don't like pure Chromium or Chrome because Google is constantly doing something bad with them (Material Design, broken font rendering engine, bubble animations, etc).\n\nCentBrowser isn't OSS, but recently it received very good reviews on major software platforms: \n[Softpedia](http://www.softpedia.com/get/Internet/Browsers/Cent-Browser.shtml) for installable and [portable](http://www.softpedia.com/get/Internet/Browsers/Portable-Cent-Browser.shtml) versions,\n[Software Informer](http://cent-browser.software.informer.com/),\n[Major Geeks](http://www.majorgeeks.com/files/details/cent_browser.html).\nAll of them declare full safety of CentBrowser (no viruses, spyware, malware...) and highly appreciate the product. Can you refute this opinion in any way (except of abstract and controversial proposition, \"open source software is always safer than a closed one\")?\n\nDo you know any reasonable alternatives? I know only \"Ungoogled Chromium\", but I don't sure, that this product has a portable version, auto-updater, patched font-rendering engine and some other features of CentBrowser.\n\nI already tried\n\n * Iridium - very unstable user interface, visually slower than pure chromium/chrome, totally no portable, even it said that it is.\n * Brave - I think, this browser willn't be an alternative to Chrome/FF for a few more years. It is not sufficiently stable, insufficiently developed, insufficiently trusted.\n * SrWare Iron - as I can understood, this is just another scam fork of pure chromium.\n\n&gt;I'd want to repeat: this thread is not for holywars, this thread is for discussion about CentBrowser/Ungoogled Chromium/any chromium-based alternatives.\n\nAnd please, lets speak about CentBrowser/Ungoogled Chromium/other alternatives. Not about FF.\n\nP.S. I don't search for absolutely don't spying browser, I admit the presence of telemetry, if it does not create problems, such as a significant load on the network, computer resources and has no serious vulnerabilities. For operations, requiring an additional level of confidentiality, I can use Tor or Brave, in this thread I meant safety for banking operations, entering and saving passwords, administration of web pages, other typical uses.",
        "created_utc": 1509313851,
        "upvote_ratio": ""
    },
    {
        "title": "Desperately seeking help following home network hack",
        "author": "ropetro",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79ipuh/desperately_seeking_help_following_home_network/",
        "text": "My Home network/ multiple computers were compromised in August and the sophistication of the attack is way over my head. I’ve been lurking on reddit and gathering info from posts, but I still can’t fix the problem without assuming my Router/ Computers are compromised. Sorry for the lengthy post, but I’ve literally been trying to resolve this for a couple months without knowing that I’m good.  \n\nIn the beginning of August, I noticed that a config file on my desktop had been modifying after my computer crashed randomly. I wasn’t using proper NetSec protocols and I’m pretty sure that someone had gained remote access to my computer, which eventually spread to the rest of my network. My PC was the first culprit, but then my MacBook, along with a few other connected devices seemed to have been infected with root kits and were redistributing files via Bluetooth and WiFi for at least 2 weeks after. \n\nI plan on downloading a few Linux distorts (for security, raspberry pi systems, etc) on my MacBook Air after I can verify that I’ve removed the infection. The logs show that a about a kernel related issue is causing something that invokes xpc command to fail / constantly try to relaunch as long as the computer is on. Instead, uses a “legacy interface” to perform its task. I think that there’s a modification to the boot partition that’s changing the OS behavior even though I had updated to High Sierra which was supposed to install an updated boot rom.  \n\nI had a raspberry pi running PiHole with poor security config and no firewall or ip rules redirecting DNS traffic at the time of the attack. My PC’s security was also poorly configured and a spyware had embedded itself into Little Snitch on my MacBook. My girlfriend hadn’t updated her MacBook, or iPad at the time. Macbook is infected with malware and her iPad was running iOS 9.3 (when 10.3.3 was the latest iteration) and i confirmed from system logs that it was accessed remotely from a custom ROM. \n\nAll of my bootable images have been corrupted, and I’ve spent at least 100 hours reading about netsec and CLI practices. With this knowledge, I’ve become more and more paranoid to the point where I took my network offline. I would really appreciate anyone who takes the time to help me resolve this for its been an exhausting, frustrating and crippling experience for me as I was/am in the process of migrating my work to be entirely digital.  \n\nThanks again for anyone who takes time to read this and give me some advice. ",
        "created_utc": 1509307067,
        "upvote_ratio": ""
    },
    {
        "title": "Recon-ng Guide",
        "author": "TheAethereal",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79in4v/reconng_guide/",
        "text": "I've just started learning recon ng and it seems like a great tool, but the documentation is horrific, or I'm just not able to find it. I can't even find information on what the various database fields are meant to be used for. To pick one example out of one hundred of a question I have, but can't find the answer to: What is a \"resource\" of a \"profile\"? I can't find that documented anywhere, even in the code.\n\nDoes anyone know of a guide that covers what recon-ng is doing behind the scenes, what each of the db tables is, and how it's meant to be used? Even the official developer guide doesn't seem to cover this. Of the many books I own that cover recon-ng, and the many websites I've found, no source has gone in to much more depth than \"type use module\", \"type run\", \"see results\".\n\nIf nobody knows of such a guide, I might devote significant time to learning this tool and writing a guide, because it seems like it would be a huge help for anyone that wants to actually understand and extend recon-ng.\n",
        "created_utc": 1509306348,
        "upvote_ratio": ""
    },
    {
        "title": "What damage can a browser script do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79imnf/what_damage_can_a_browser_script_do/",
        "text": "[deleted]",
        "created_utc": 1509306222,
        "upvote_ratio": ""
    },
    {
        "title": "What can a script actually do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79ik0q/what_can_a_script_actually_do/",
        "text": "[deleted]",
        "created_utc": 1509305493,
        "upvote_ratio": ""
    },
    {
        "title": "Is it a risk to allow scripts from \"file://\" on websites?",
        "author": "grenadesong",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79hzc0/is_it_a_risk_to_allow_scripts_from_file_on/",
        "text": "One website I want to use requires me to allow scripts form \"file://\" if I want to be logged in to the website. I just wonder if that's safe? Is it any difference running scripts from file:// rather than any other such as thing.domain.com as a random example?",
        "created_utc": 1509299977,
        "upvote_ratio": ""
    },
    {
        "title": "Firing an IT Ops Manager",
        "author": "Glokta_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79hxee/firing_an_it_ops_manager/",
        "text": "Hi guys,\n\nWe need to let go an IT Ops Manager with system-wide access by minimizing the risk of \"disgruntled retaliation\" against the company. I could use some crowd-wisdom here to spot check actions taken so far and advise if I should include anything else.\n\n* Disabled his domain admin account\n* Disabled his regular domain account\n* Changed default domain administrator admininistrator pass\n* Changed default domain enterprise admininistrator pass\n* Reviewed groups: Remote Desktop Users, VPN users, Account Operators, Backup Operators\n* Changed password on all network devices and firewalls\n* Disabled all local VPN accounts (guest, etc.)\n* Removed his account from all other appliances (load balancers, storage, etc.)\n* Changed local admin password on servers\n* Changed ESXi and vCenter passwords and removed his account\n* Blocked outgoing Teamviewer on firewalls\n* Checked scheduled tasks\n\nSee anything obvious missing?\n\nThanks a bunch you lot!\n",
        "created_utc": 1509299448,
        "upvote_ratio": ""
    },
    {
        "title": "Does a vpn with webrtc leak protect against Krack?",
        "author": "fatfig",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79hlwz/does_a_vpn_with_webrtc_leak_protect_against_krack/",
        "text": "I don’t know if Krack is still considered a problem... but I thought it might be, so I downloaded a free vpn for my android, and I went to ipleak.net and it shows my real IP under webrtc. I guess it means websites see my real IP, which is not a problem because I just want the vpn to protect me against KRACK. So, is this still good enough against KRACK?",
        "created_utc": 1509296351,
        "upvote_ratio": ""
    },
    {
        "title": "Telecom Security.",
        "author": "rootb3r",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79f1tb/telecom_security/",
        "text": "I'm looking for conference talks, research papers &amp; training videos on wireless,base-band, GSM, LTE security and other communication protocols. Any help would be appreciated. Thanks.",
        "created_utc": 1509257572,
        "upvote_ratio": ""
    },
    {
        "title": "For a top secret clearance, will they need to know about documented warnings from police and would this count as criminal activity?",
        "author": "throwaway_secrettop",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79eakj/for_a_top_secret_clearance_will_they_need_to_know/",
        "text": "I received an offer from a position that requires a secret clearance, and if I continue in that position I'd eventually need a top secret clearance.\n\nBasically there was an incident a few months ago where I was making out with my girlfriend in my car and someone in the neighborhood called the police on us. They came and made us step out of the car and took down our ID's and info. They explained that they now had us on record but that this was a warning for us and let us go. We didn't get a citation or anything written issued though. Would this count as me having a criminal record and would I need to report this to the investigator or on the clearance application at any point during the process? What if later on I needed a top secret clearance?\n",
        "created_utc": 1509245639,
        "upvote_ratio": ""
    },
    {
        "title": "Mapping outbound firewall rules without access to the configuration",
        "author": "fdg32",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79cooa/mapping_outbound_firewall_rules_without_access_to/",
        "text": "I've been asked to verify the open ports on a client's firewall (in this case what ports are allowed for -outbound- access). For various political reasons they're unable to provide the configuration.\n\nHas anyone come across any tools for doing this? Ideally one that supports both TCP and UDP, the latter in particular, is important.\n\nI imagine there'll need to be at minimum two components: a client (e.g., on the internal network) and an external host (e.g., on an AWS box). Then just sending packets and see what gets received on the other end.\n\nI'm considering scripting it, but although the concept seems simple, I'm sure the implementation is a little bit more complex, and would prefer a tried and tested tool if one exists.",
        "created_utc": 1509225732,
        "upvote_ratio": ""
    },
    {
        "title": "Security for a gnu/linux box",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79by4y/security_for_a_gnulinux_box/",
        "text": "[deleted]",
        "created_utc": 1509217756,
        "upvote_ratio": ""
    },
    {
        "title": "UN jobs- information security specialists",
        "author": "Matungi_k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79bpvh/un_jobs_information_security_specialists/",
        "text": "https://www.unicc.org/Pages/WorkingWithUs/Vacancies/Vacancy.aspx?vnn=185",
        "created_utc": 1509215380,
        "upvote_ratio": ""
    },
    {
        "title": "Russian conversation over RedBull TV program on Apple TV",
        "author": "charlie_monster",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79bbnb/russian_conversation_over_redbull_tv_program_on/",
        "text": "A few moments ago I was watching RedBull TV on my Apple TV and the normal audio was interrupted by a couple dudes having a conversation in what sounded like Russian.  It lasted for about a minute before returning to the normal audio. I'm looking for suggestions about what I can do to protect myself. ",
        "created_utc": 1509211271,
        "upvote_ratio": ""
    },
    {
        "title": "Wtf seriously, phone interview any tips?",
        "author": "stud_ent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79b6gv/wtf_seriously_phone_interview_any_tips/",
        "text": "I've been dabbling in EH for about a year at most maybe. Everything I've learned/known I have just taught myself via online courses. I am only A+ certified with an A.A. in WebDesign.\n\nI fully expect to be turned down but would still like to try.\n\nMy resume is straightforward and I make no attempt to overstate my experience I'm a script kiddie at best and a fucking noob at worst. I've mostly focused on random attacks like double pulsar//eternal blue//evil twin ap's.\n\nWell a small security company is looking for someone to pentest web apps using burpsuite//ibm app scan.\n\nI only have the free version and lack the $400 to drop on the pro version atm.\n\nI've been working through the Damn Vulnerable Web App the last week, teaching myself as much as I can so I don't look like a total schmuck.\n\nI've gone over:\nSql injection\nXss\nCsrf (need to do again)\nBrute Forcing\n\nTo do:\nFile upload exploit for shell access.\n\nIn addition to burpsuite free I have also used ZAP and sqlmapper, what are some other tools to brush upon?",
        "created_utc": 1509209763,
        "upvote_ratio": ""
    },
    {
        "title": "Replacement for Tamer Data plugin?",
        "author": "stud_ent",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79b27p/replacement_for_tamer_data_plugin/",
        "text": "Getting an error that Firefox esr version on my Kali vm is too new for the tamper data add-on.\n\nIs there anyway to get another tool like this? I know I could use burpsuite but it's not as convient.\n\nWorking on learning file upload exploitation\n\nhttp://www.hackingarticles.in/hack-file-upload-vulnerability-dvwa-bypass-security/",
        "created_utc": 1509208481,
        "upvote_ratio": ""
    },
    {
        "title": "Am i infected?",
        "author": "Grumpy_Pantz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/79arcv/am_i_infected/",
        "text": "Im such an idiot... My friend told me bout a link (dont click this)riothalloween.net(dont click this). And i dont think bout it and used it and might have shared it with others as well. IVe Sophos home anti-virus and Glasswire to check for outgoin connections and both didnt notice anything. Am i infected with something or does it fish for credentials when you press on a link on the site?\nanyone can elnight me?\natm i feel guilty af xD",
        "created_utc": 1509205266,
        "upvote_ratio": ""
    },
    {
        "title": "where can i find metasploitable2 like vms",
        "author": "romanalder",
        "url": "https://www.reddit.com/r/AskNetsec/comments/799rrd/where_can_i_find_metasploitable2_like_vms/",
        "text": "hello. I'm working on an automatic exploitation framework which uses metasploit. in order to test that further, i need vms like metasploitable2 in which ports are open and waits for exploitation. I checked vulnhub but they are more like capture the flag, not ready to exploit. ",
        "created_utc": 1509192571,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for someone to pentest a simple login/SQL website.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/799lfu/looking_for_someone_to_pentest_a_simple_loginsql/",
        "text": "[deleted]",
        "created_utc": 1509189562,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to detect if a webpage is using webrtc or not?",
        "author": "MicheleXT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7981ey/is_there_a_way_to_detect_if_a_webpage_is_using/",
        "text": "How can you tell if a webpage is using webrtc by taking a look at its source code?",
        "created_utc": 1509161880,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for info on EDR products: SentinelOne vs. Cybereason Detect&amp;Respond",
        "author": "zxLFx2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7961fc/looking_for_info_on_edr_products_sentinelone_vs/",
        "text": "If you've used/investigated one or both of these products at your organization:\n\n1. Obvious question: how does it do detecting threats? How many false negatives/positives?\n2. How well behaved is the endpoint agent, on windows or mac?\n3. Can you create custom IOCs?\n4. Does it integrate with SIEM software like SumoLogic?\n5. Can you use it to get a shell on a suspect endpoint or does it give you other methods to investigate further?\n6. Does it integrate with ticketing software?\n\nThank you. I want to get a general sense for if these products are contenders before I potentially waste time with sales meetings.",
        "created_utc": 1509138174,
        "upvote_ratio": ""
    },
    {
        "title": "Google's Advanced Protection and your threat model [x-post from /r/security]",
        "author": "astrobase_go",
        "url": "https://www.reddit.com/r/AskNetsec/comments/795du9/googles_advanced_protection_and_your_threat_model/",
        "text": "Google released its [Advanced Protection program](https://landing.google.com/advancedprotection/) for public sign-up a few weeks ago. Some questions:\n\n* Do you plan to make use of it?\n* Do you have a threat model that necessitates it, or do you think it's just generally something most security professionals should take advantage of?\n\nI'm considering it myself, so I'm wondering what others are doing, or if they're even paying attention to it.",
        "created_utc": 1509131838,
        "upvote_ratio": ""
    },
    {
        "title": "What version of Java are we up to?",
        "author": "GetBroccoli",
        "url": "https://www.reddit.com/r/AskNetsec/comments/794pjd/what_version_of_java_are_we_up_to/",
        "text": "I just downloaded 8.x from Oracle, but I've had 9.0 installed for weeks.",
        "created_utc": 1509125516,
        "upvote_ratio": ""
    },
    {
        "title": "Stupid Cisco console question",
        "author": "CatsAndIT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/794pdq/stupid_cisco_console_question/",
        "text": "Google is proving fruitless, so hopefully ANS can help me!\n\nI'm trying to figure out what the configuration for a Cisco switch should look like in order to force console access to authenticate with a username and password from the local table.\n\nRight now, I have a switch that has the following commands (please note that TACACS+/RADIUS is not set up, and is not an option in this situation):\naaa new-model\naaa authentication login default local\naaa authentication enable default enable\naaa authentication exec default local\n\nOn the console itself, all it has is:\nexec-timeout 10 0\n\nI can't independently verify that this switch's console port requires a login. Based on the setup here, would it be safe to assume that the port does NOT require authentication, because \"login authentication default\" is not configured on the port?\n\nThanks!",
        "created_utc": 1509125473,
        "upvote_ratio": ""
    },
    {
        "title": "What security sites / feeds do you follow daily?",
        "author": "the_caller",
        "url": "https://www.reddit.com/r/AskNetsec/comments/794i2g/what_security_sites_feeds_do_you_follow_daily/",
        "text": "",
        "created_utc": 1509123627,
        "upvote_ratio": ""
    },
    {
        "title": "I noticed that Tor isn't safe",
        "author": "feminaziextremist",
        "url": "https://www.reddit.com/r/AskNetsec/comments/793arv/i_noticed_that_tor_isnt_safe/",
        "text": "I'm using Tor and Tails. because my attacker is obviously using tracking method to steal my browsing history.  \nFor ex. I made wordpress site. I had enogh knowledge of it. but never used it online. one of them mimicked what I did exactly step by step. some random people can't find  plugins I used without knowledge even if they remain some of pattern in output html.  \nThis attacker is a guy I was talking in past thread. he noticed I'm hacking him. his wordpress site is havily protected after I tricked him.  \nAnyway. main reason of why I'm suspecting tracking method is Facebook. because they know every access of Facebook. laptop, iphone, android and Tor Tails.Tor deosn't have that much of exit node if you are using it constantly. if user was distinctable person from browing history, it's not much diffucult to track him down.  \nBtw. My Trils's persistent area is corrupted. reboot didn't helpt it. like zero freespace without file. I hope it is not bad sign.  \n\n\n\n",
        "created_utc": 1509111666,
        "upvote_ratio": ""
    },
    {
        "title": "I've been asked to submit a project plan for part of an internship selection process, what suggestions would you have for projects given I'll have company level resources to use?",
        "author": "AsexyFootballFan",
        "url": "https://www.reddit.com/r/AskNetsec/comments/792vdi/ive_been_asked_to_submit_a_project_plan_for_part/",
        "text": "I've been asked to submit a project plan for an internship as the title says. I have some ideas for small projects, but given the internship is 3 months long I'm struggling to think of something to do in a much longer timeframe. I'm very much interested in reverse engineering and malware, but I worry that project might be out of my abilities at the moment. \n\nAny suggestions on projects and places to look for inspiration?",
        "created_utc": 1509106822,
        "upvote_ratio": ""
    },
    {
        "title": "Security Risk with Wiegand Systems (Made in China)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/791mi2/security_risk_with_wiegand_systems_made_in_china/",
        "text": "[deleted]",
        "created_utc": 1509087315,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with OSSEC Local setup!",
        "author": "splunk_n00b",
        "url": "https://www.reddit.com/r/AskNetsec/comments/791cyf/i_need_help_with_ossec_local_setup/",
        "text": "Hi /r/NetSec!\n\nFirstly, I have downloaded OSSEC hids 2.9.2 on my webserver by running the ./install.sh script and what i would like to do is to have the hids monitor my webserver. And i plan to set up test cases to send the log data to Splunk and set up alerts and correlation stuffs from there. \n\nI have read through a tons of guides on OSSEC and have trouble finding proper guide for local setup/configurations. So I have a few questions i would like to ask that i am confused about and i hope someone could help me understand how i should go about doing it!\n\n* I have installed a local one, but do i still need to install any agent on the webserver itself to monitor? \n\n* What should i be configuring in the ossec.conf if i just want to monitor very basic things like failed sshd logins, file directory changes? are all those already pre-configured in the ossec.conf file?\n\n* If i set up real time monitoring and alerts, would i need to set up a db for it to store those alerts? and I have read through that there were a lot of trouble setting up a email notification in ossec. Would it be possible if i just Splunk do the email alert instead? How should i configure it if i am required to do any of these? Are any of these steps mentioned unnecessary?\n\n* I want to forward all these data/monitoring collected/done to my Splunk on another server. I have installed a UniversalForwarder as well on the same web server and should be downloading the OSSEC add-on on the web server or the Splunk server?\n\n* How should i configure the forwarder to forward the syslog to my Splunk Server?\n\n\n\nI would greatly appreciate any help or guidance, thank you!:)\n\nEDIT: [i have found these guide with some relevant info, but the guide is too brief](\nhttps://blog.savoirfairelinux.com/wp-content/uploads/2014/03/SFL-ED01-OSSec-the-quick-and-dirty-way-140326-01.pdf)\n\nEDIT2: [another guide on configuring the ossec.conf for syslog output](http://ossec-docs.readthedocs.io/en/latest/manual/output/syslog-output.html)",
        "created_utc": 1509083213,
        "upvote_ratio": ""
    },
    {
        "title": "I have a technical phone interview for a network security job next week, with an emphasis on, \"attack cycle\" and networking, etc. I am going to spend the weekend making cheat sheet posters for my office. What would you recommend I make sure and make sheets of?",
        "author": "the_caller",
        "url": "https://www.reddit.com/r/AskNetsec/comments/7912r3/i_have_a_technical_phone_interview_for_a_network/",
        "text": "Looking for resources on acronyms, OSI models, protocols, concepts, work flows, governing entities, software, hardware ... attack cycle?\n\nThanks much.",
        "created_utc": 1509079135,
        "upvote_ratio": ""
    },
    {
        "title": "Can I get a job in security?",
        "author": "MicheleXT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78zxzs/can_i_get_a_job_in_security/",
        "text": "I am 28, and I have an Italian literature major, I have always been a computer security enthusiast, and I know python programming language, I have even made a few applications like clipboard manager, file converter, image converter (bmp to jpg and reverse), file hash sum calculator, and I am familiar with the basics of networking and TCP IP, and I know what 'exploits' 'vulnerabilities' 'payload' and such are. \n\nNow I need you to be totally honest with me, do I have a chance to get a job in security, or in a company like google, so that I could at least pay rent and not live in my parents basement? or do I have to start all over again and get CS major? Or it doesn't matter and I only need to take a security exam and certificate and that would be enough?\n\nPS be as honest as possible, do not try to make me feel good, please give me the facts. I really need help. What options do I really have to find a job in security or CS/IT?",
        "created_utc": 1509065436,
        "upvote_ratio": ""
    },
    {
        "title": "Secret Security Clearance with Issues",
        "author": "compengineer292325",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78zli6/secret_security_clearance_with_issues/",
        "text": "Hey guys,\n\nThis is a throwaway account for obvious reasons. \n\nI know you guys might be tired of people asking these questions but I’m concerned. Long story short, I’m currently enrolled in college for computer with a networking background. I just turned 20 years old and am in the running for my dream job. The job has been my dream since I’ve been a child and it requires a security clearance. I can’t really say much more about it.  But I really want this job and would be absolutely crushed if I was offered it and was denied my security clearance.  I know you guys probably aren’t investigators and it will be a case by case basis, but I’d really appreciate a little predicting. \n\nNow for my issues...\n\nI have smoked weed two times when I was 17, almost exactly 3 years ago. That is the only drug incident and will never do any of that again. \n\nI have torrented TV Shows and movies in the past, but have now deleted everything pirated. No piracy in the last year. Never any software though. \n\nI have two past foreign contacts. I met them via online gaming and formed a little gaming community with them. Contact started in late 2013 and ended in early 2015 estimate. One is from Wales and one from Sweden. I am friends with them on Facebook, so I think I need to disclose that. No other foreign contacts. \n\nBut other than that, absolutely no criminal record. Only been pulled over one time but not cited. \nLived in America all of my life with the same address. I have a lot of law enforcement in my family. \nFinancials are as good as they’ll get for a college student, credit score about 700-750.\n\nSo please give me the honest answer. Do you see any reason why I wouldn’t be accepted? Or should I wait another 4 years so the foreign contacts and drug use falls off and try to find a job similar to this? \n\nI’d rather not even get the offer if I’m doomed to denial.  \nThank you all very much. \n\nEDIT: also would like to add I have a very good employment record without any write ups or any disciplinary action. As well as a clean school record. \n\nEDIT 2: I will fully disclose everything on the SF-86 and answer every question the investigator asks. I consider myself to have good integrity and would never intentionally be misleading on something like this. ",
        "created_utc": 1509061762,
        "upvote_ratio": ""
    },
    {
        "title": "Cracking a router for beginners",
        "author": "hajimenogio92",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78z5oq/cracking_a_router_for_beginners/",
        "text": "Hey guys, I'm a new reader of this subreddit, currently studying CIS in college. I'm doing an assignment for a class, the professor has given us the public IP address for the router and we have to come up with the methods to crack. I was wondering if any of you had suggestions. My plan was to scan with nmap and metasploit. For the experienced veterans here, what do you suggest on Kali Linux? Thanks!",
        "created_utc": 1509057229,
        "upvote_ratio": ""
    },
    {
        "title": "How to break into open source intelligence careers? DOD/IC a must? What's the recommended way?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78ywgz/how_to_break_into_open_source_intelligence/",
        "text": "[deleted]",
        "created_utc": 1509054792,
        "upvote_ratio": ""
    },
    {
        "title": "is it really a good thing to prevent users from re-using passwords?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78yrql/is_it_really_a_good_thing_to_prevent_users_from/",
        "text": "[deleted]",
        "created_utc": 1509053541,
        "upvote_ratio": ""
    },
    {
        "title": "How much do you think it is possible for highly sensitive military or security sectors to use publicly available security technology?",
        "author": "MicheleXT",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78yrbb/how_much_do_you_think_it_is_possible_for_highly/",
        "text": "Well, generally speaking, I think everyone already knows that military uses and has technology that is at least ten years ahead of what is available in public. like all the radio tech, the microwave and such stuff, even the internet. But we also know that nowadays most soldiers bring their own laptop or security product to work, but that is only in the major sectors. Now my real question is, do you think NSA, CIA, or at least some very sensitive sectors or departments within these organisations use algorithms like SHA-3 in their daily work? Do you think they probably have contracted a very skilled cryptographer to design special algorithms for specific cases within some sensitive sectors of these organisations? Again \"WHAT I REALLY WANT TO KNOW\" is, do you think the algorithms that are provided by NIST for example, are only for the general public and public organizations, and they probably have huge dangerous bugs, even after standardization? like what happened recently with wifi? If that is the case what defences does the general public have against these exploits and dangers? because if these holes exist, some shady governments, organizations, or even hacker groups can be secretly taking advantage of these bugs, the same way the government is hoping only they would. A backdoor is a backdoor after all.\n\nThank you all the wonderful redditors, and sorry if it is a long question. ;)",
        "created_utc": 1509053430,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with real hacker. then",
        "author": "feminaziextremist",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78xfyi/how_do_you_deal_with_real_hacker_then/",
        "text": "Sorry. I'm telling you a truth that most of hackers in this world don't hack your computer.  \nBecause what they do is 99% physical. for ex Group stole money from world wide ATM was employee of system developer. Hacking Team intalled firmware BIOS at manifacturing.  \nIn this age. movie like hacking is nearly impossible.   \nHow do you call youselves security specialist when you can't expect physical hacking?  \n",
        "created_utc": 1509041704,
        "upvote_ratio": ""
    },
    {
        "title": "Question about AES S-Box",
        "author": "holydduck",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78x0r5/question_about_aes_sbox/",
        "text": "Hello /r/AskNetsec.\n\nI am trying to implement AES (yes, I know I am re-re-inventing the wheel, but I do that as a challenge) and I have a small problem with S-BOX.\n\nThis is the NIST document of AES. [FIPS-197](https://csrc.nist.gov/csrc/media/publications/fips/197/final/documents/fips-197.pdf)\n\nIn figure 5-2 on page 16, it shows the affine transformation of S-BOX in form of matrix\nI tried to follow and implement that matrix. However, I can't even get 0x63 for 0x00 by following that matrix.\n\nI try byte of all 0s (after the multiplications, it is still all 0s), and the matrix before the last addition is like:\n&gt;\n* The 0s and matrix in figure 5-2\n* 0　　1\n* 0　　1\n* 0　　0\n* 0　　0\n* 0＋ 0\n* 0　　1\n* 0　　1\n* 0　　0\n\nwhich gives me 0xC6, while the correct result should be 0x63\n\nI know the normal implementation for the last addition in GF(2) should just be a simple XOR 0x63.\n\nSo my question is ...\n1) Do I implement the matrix addition incorrectly? Or I just misunderstand the matrix addition or its notation? My Maths is not that good.\n\n2) Or is that figure 5-2 incorrect? Should it be matrix of (0 1 1 0 0 0 1 1) instead of (1 1 0 0 0 1 1 0)?\n\nEDIT: formating",
        "created_utc": 1509037995,
        "upvote_ratio": ""
    },
    {
        "title": "Security clearance parents used my SS for a job",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78x088/security_clearance_parents_used_my_ss_for_a_job/",
        "text": "[deleted]",
        "created_utc": 1509037856,
        "upvote_ratio": ""
    },
    {
        "title": "Launching a site written in PHP for a client who's services are constantly being targeted by government sponsored hackers. Apache or NGINX? PHP7 or HHVM?",
        "author": "questoning",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78wrel/launching_a_site_written_in_php_for_a_client_whos/",
        "text": "MySQL or MariaDB?  I'm leaning toward HHVM for other reasons and I haven't had any luck getting Postgres to talk to HHVM.\n\nI'm specifically asking with an eye toward preventing breaches.\n\nGovernment in question is Saudi Arabia, not that it matters, just for the curious.  But the adversaries budget, patience and determination are all in the high to very high range.",
        "created_utc": 1509035738,
        "upvote_ratio": ""
    },
    {
        "title": "Password Manager SMS Reset Weakness",
        "author": "MongoloidMormon",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78w2d8/password_manager_sms_reset_weakness/",
        "text": "Does anyone know of a password manager that supports U2F that doesn't allow bypass via SMS code? Both Dashlane and Keeper allow you to simply receive an SMS code in order to access your account without your U2F device. IMO, this defeats the purpose. I've seen several cases of a hacker using human engineering on cell phone providers in order to gain access.",
        "created_utc": 1509029601,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to run wifi-fisher on rasp pi zero?",
        "author": "-kuraidesu",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78vrn5/is_it_possible_to_run_wififisher_on_rasp_pi_zero/",
        "text": "I want to use wifi-fisher on raspberry pi zero w. But i don't know if it is possible because of system spec. \n\n",
        "created_utc": 1509026772,
        "upvote_ratio": ""
    },
    {
        "title": "Efficient way to scan a subnet for vulnerabilites in terminal",
        "author": "verumnosliberat",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78vlrd/efficient_way_to_scan_a_subnet_for_vulnerabilites/",
        "text": "I am looking on how to improve some OSCP mistakes I did last time (next month giving it for a 2nd time). \n\nI fell into rabbit holes, but that's not the root of the problem. The problem is \"bad enumeration\". I began feeling like I could own them all in 5 hours and ended being cut off by some points (5!). \n\nSo I am sharpening my axe and improving my methods. First thing I am trying to improve is information gathering &amp; enumeration. The first thing I usually do is: `netdiscover -i eth0` or `arp-scan` If they are available. I find `nmap` too slow to let it scan for targets, but when necessary I use `nmap -sP 10.0.0.0/24 -T5`. \n\nNext step (and most important) is port scanning and service enumeration. On my first attempt, I didn't see an \"overall\" layout of the network but decided to go \"one target each time\" until I own it. The result was to fell into a rabbit hole (after owning the easy buffer overflow one) and spend too many hours and energy on a machine that finally proved to get me the less points for the most time spend. \n\nI decided to look for low hanging fruits. So I am working on a script to get as much valuable information as possible. One way is to do an `nmap 10.0.0.0/24 --top-ports 10 -sV` which usually works very fast. Then I want to get more information for a target and I run `nmap 10.0.0.5 -sV -A --script vuln` that usually gets me good information about the machine, often discloses vulnerabilities out of the box. Unfortunately on my first OSCP attempt, I finally opened several terminal windows after some hours and it seemed that some of them were running for several minutes (one of them took over 40 minutes to complete with no valueable information). \n\nI am looking for any smart ideas here, I really appreaciate any comments to improve my enumeration techniques. ",
        "created_utc": 1509025137,
        "upvote_ratio": ""
    },
    {
        "title": "If you had an unlimited budget, what would your ideal SOC consist of??",
        "author": "janitroll",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78v3s8/if_you_had_an_unlimited_budget_what_would_your/",
        "text": "Outside of the labor and individual skills, I’m talking hardware and software. This is for a corp environment with full authority to do this the right way. Starting with a team of 6 with all the right skills! ",
        "created_utc": 1509019657,
        "upvote_ratio": ""
    },
    {
        "title": "A random URL shortcut file appeared today on my clean install of Windows 7 Enterprise.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78twui/a_random_url_shortcut_file_appeared_today_on_my/",
        "text": "[deleted]",
        "created_utc": 1509001400,
        "upvote_ratio": ""
    },
    {
        "title": "Seeing SPAM not addressed to me",
        "author": "npa1234",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78srlj/seeing_spam_not_addressed_to_me/",
        "text": "I can see SPAM mail that is addressed to ABC@domain1.com  but my email is ABC@mydomain.com. How is this possible? Is it because of bcc ?",
        "created_utc": 1508985846,
        "upvote_ratio": ""
    },
    {
        "title": "Degree in IT with a specialization in network and information security or computer science?",
        "author": "MarkBell123",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78rp9z/degree_in_it_with_a_specialization_in_network_and/",
        "text": "I am currently a sophomore in computer engineering and am looking to change my major to either IT or cs. I am switching because I just don't enjoy a lot of the circuit and logic stuff anymore and always wanted to get into security. Would it be better to major in IT with the specialization in network and information security or computer science to get into cyber security?\n\nEdit: a little bit of background. I understand there are a lot of cs classes in cs (obviously) and a decent amount in IT but haven't had the best experience with cs. I took a intro to cs class that used C++ and had one of the worst professors I've ever had. Got a B in the course yet don't know anything. Programming has always been something I've been interested in but just havent had the best introduction.",
        "created_utc": 1508974632,
        "upvote_ratio": ""
    },
    {
        "title": "Burpsuite not going to websites with intercept on :/",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78qy8l/burpsuite_not_going_to_websites_with_intercept_on/",
        "text": "[deleted]",
        "created_utc": 1508967283,
        "upvote_ratio": ""
    },
    {
        "title": "Career Path Questions... Overwhelmed",
        "author": "x86ripper",
        "url": "https://www.reddit.com/r/AskNetsec/comments/78q9pz/career_path_questions_overwhelmed/",
        "text": "Hey all. \n\nI recently started applying to jobs again after my current job for over 2 years. Along the way, I got my OSCP and GIAC GREM, and currently work in post-incident analysis/threat intelligence with malware analysis and that sort of work.\n\nLong story short, I started applying. And I started getting calls. Lots of calls. And I wanted to draw on the experience of /r/AskNetsec to see what would be an overall good choice.\n\nChoice 1: Enter the SOC. It's an MSSP type SOC, around L2 where I'll get to threat hunt, triage, investigate, and learn from a really sharp crew and team. The interviewers have all been extremely talented blue team guys with impressive githubs and skillsets. I've never been in a SOC and for some reason this sounds fun. \n\nPay: $$\n\nChoice 2: Continue down threat intelligence. The work seems boring, maybe it's because I'm so used to it, but continuing in this field lets me eventually \"specialize\". Here, I find that you don't necessarily need to be really good at anything, but do require a certain level of \"enough\" in everything. These are both big name companies, which I'm not necessarily a fan of the corporate culture.\n\nPay: $$$\n\nChoice 3: Malware analyst. I'm not the best RE or malware analyst, but I am good at the sample types I have experience with and given the right folks to sit next too, I could get good at it. I don't really consider it \"fun\", but it seems to pay the most and the company recognition is nice. \n\nPay: $$$\n\nI dunno what to do /r/AskNetsec? None of these paths really interest me. I'd like to get into DFIR, and I can see how each of these options point to that, but the last thing I'd like to do is get \"stuck\". Also, I don't trust any of what the companies say about job roles. \"Cool stuff this\". \"Cool stuff that\". It makes me think I'll be just another monkey doing boring work. It also seems like having SOC experience is a big +.",
        "created_utc": 1508961285,
        "upvote_ratio": ""
    }
]