[
    {
        "title": "Could some social engineer recommend me some good social skills books?",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lyanr/could_some_social_engineer_recommend_me_some_good/",
        "text": "I want to:\n\nmake friends\n\nkeep friends\n\ndate\n\nget my way in life because no one ever wants to do what I want\n\nwork on my introversion problem\n\ngain well rounded social skills\n\netc.\n\nCould you give me five or more good books on social skills, NOT ON SOCIAL ENGINEERING!!!??! Meaning, I think I need to learn basic social skills first right?",
        "created_utc": 1527214947,
        "upvote_ratio": ""
    },
    {
        "title": "can SWATTERS be social engineered and would this be a good safety precaution?",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ly84z/can_swatters_be_social_engineered_and_would_this/",
        "text": "I'm thinking of getting into online gaming.\n\nSo let's say your playing COD. Let's say you run into a SWATTER. They say anyone can be taken advantage of. So by that logic it will always be possible to be taken advantage of by a SWATTER and it is not possible to social engineer a SWATTER into giving you info that could be used on them.\n\nAlso, since SWATTERS are generally also DOXERS, and not very skilled at hacking, would giving them a burned phone number help?\n\nI feel like there's not much of a good potential system to deal with SWATTERS.\n\nI am not going to do anything illegal but, four questions:\n\n1. is it possible to social engineer a SWATTER into giving away anything that could be given to the police in an investigation?\n2. what is the social dynamic behind a SWATTING?\n3. if it is not possible are there any safety precautions one can take other than not give away any info online?\n4. what is the best safety precaution to do to avoid a SWATTER situation because they are everywhere?\n5. how good is the burnable phone number idea? If I give them the encrypted, fake, phone number, then they text or call me and I ignore but then do a reverse lookup. Since SWATTERS don't tend to be that bright, maybe I could give info to the police through a reverse phone lookup unless they are smart enough to see through that, which sounds like the only possible flaw.\n\nSWATTERS call themselves hackers, but most of them are really dumb but well practiced and my theory on their success is they have some sort of hidden social dynamic behind their success. But the thing is they are stupid. And they don't seem like the best social engineers. Are they? If there is a hidden social dynamic then they don't have to have that to have success right?\n\nHow do you recommend dealing with SWATTERS?\n\nI mainly love shooters so on COD and other games that are shooters online, cuz just single player bores me, I would want to play with other people. I want to make friends and work on social skills. I also don't want to be continually SWATTED.\n\nWhat do I do?\n\nThanks.\n\nBest,\n\nQMark",
        "created_utc": 1527214233,
        "upvote_ratio": ""
    },
    {
        "title": "couldn't compiler this module , showed me ' cc1: some warnings being treated as errors'",
        "author": "0x006",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ly3vv/couldnt_compiler_this_module_showed_me_cc1_some/",
        "text": "Hi there ,  I want to compile the vulnerable module in Linux but doesn't work \n\nhere is the original file \n\n[https://jon.oberheide.org/files/csaw.c](https://jon.oberheide.org/files/csaw.c)  \n\n\noutput   \n\n\nju@a:\\~/test/2$ make\n\nmake \\-C /lib/modules/3.13.0\\-32\\-generic/build M=/home/ju/test/2 modules\n\nmake\\[1\\]: Entering directory \\`/usr/src/linux\\-headers\\-3.13.0\\-32\\-generic'\n\n  CC \\[M\\]  /home/ju/test/2/csaw.o\n\n/home/ju/test/2/csaw.c: In function ‘csaw\\_init’:\n\n/home/ju/test/2/csaw.c:73:2: error: implicit declaration of function ‘create\\_proc\\_entry’ \\[\\-Werror=implicit\\-function\\-declaration\\]\n\n/home/ju/test/2/csaw.c:73:12: warning: assignment makes pointer from integer without a cast \\[enabled by default\\]\n\n/home/ju/test/2/csaw.c:74:11: error: dereferencing pointer to incomplete type\n\n/home/ju/test/2/csaw.c:75:11: error: dereferencing pointer to incomplete type\n\ncc1: some warnings being treated as errors\n\nmake\\[2\\]: \\*\\*\\* \\[/home/ju/test/2/csaw.o\\] Error 1\n\nmake\\[1\\]: \\*\\*\\* \\[\\_module\\_/home/ju/test/2\\] Error 2\n\nmake\\[1\\]: Leaving directory \\`/usr/src/linux\\-headers\\-3.13.0\\-32\\-generic'\n\nmake: \\*\\*\\* \\[all\\] Error 2\n\nju@a:\\~/test/2$ cat Makefile \n\nobj\\-m := csaw.o\n\nall:\n\n\tmake \\-C /lib/modules/$\\(shell uname \\-r\\)/build M=$\\(PWD\\) modules\n\nclean:\n\n\tmake \\-C /lib/modules/$\\(shell uname \\-r\\)/build M=$\\(PWD\\) clean  \n",
        "created_utc": 1527213061,
        "upvote_ratio": ""
    },
    {
        "title": "Have you tried the work of joe. He upgrades school grade, hack cheating spouse phone and email account and erase criminal records and all sorts of hacking services . He can do any possible hacking job and he is to be trusted and strictly professional. Contact joe via joegrandzzzzz@gmail.com",
        "author": "fitzroland",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lxx2v/have_you_tried_the_work_of_joe_he_upgrades_school/",
        "text": "[removed]",
        "created_utc": 1527211188,
        "upvote_ratio": ""
    },
    {
        "title": "Other than running an .exe or .reg file, can any other type of file harm your computer?",
        "author": "smallbritishboy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lxwl9/other_than_running_an_exe_or_reg_file_can_any/",
        "text": "Running known .exe files are the main source of malware/viruses, and I suppose you could also get a malicious .reg file that messes up your registry. Other than those two things, is there anything you could do/run that could mess up your computer? ",
        "created_utc": 1527211061,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on Job Offer",
        "author": "ceskrowten",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lxpnn/thoughts_on_job_offer/",
        "text": "So I've received a job offer from a *very* small pentesting firm (~50 people) for a pentesting internship. The company has an equally small online footprint with little to go on.\n\nThe offer is an internship lasting 8 months with the possibility to become full-time at the end. I've been offered $40,000(~$21/hr) for the first 4 months increasing to $50,000(~$26/hr) for the remainder of the contract and reaching $60,000 for full-time after. No benefits, or vacation time during this 8 month period. fwiw I'm in Canada. Taking the job will also require relocation.\n\nA bit about myself: I have no experience in pentesting but I do have an OSCP and some other experience. So in general I feel kinda \"imposter syndrome\" and I am curious if it's a puppy mill type situation.\n\nFrom what I've read here, smaller companies tend to cause burnout pretty fast and from the sounds of the job they'll want you to wear many hats. Without posting the 1:1 job listing it's seems like a standard pentesting job. Testing clients internal systems, reporting, interacting with clients, and so on.\n\nThey are pushing the offer on my quickly and aren't giving me a lot of time to consider it - and as I have very little experience I was hoping someone might have some advice!\n\nShould I consider taking a more sysadmin type job closer to home before becoming a pentester? Increase my skills in administering networks and round out my experience? I obviously want to become a pentester as I've already got the OSCP but I want to be a competent team member.\n\nI know this post is vague but I am wondering if there is any red flags I should be on the lookout for, and just general thoughts and opinions.\n\nThanks for reading the wall of text!",
        "created_utc": 1527209233,
        "upvote_ratio": ""
    },
    {
        "title": "Single sign on",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lwys5/single_sign_on/",
        "text": "is single sign on a security feature or a convenience ?",
        "created_utc": 1527202553,
        "upvote_ratio": ""
    },
    {
        "title": "Need advice on wireless adapters for packet injection",
        "author": "SuperSaiyanTrunks",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lwryi/need_advice_on_wireless_adapters_for_packet/",
        "text": "Hey all,\nI'm looking for a wireless adapter to purchase so I can play around with some of Kalis wireless cracking tools.\nI've been looking at some of the ALFA AWUS models. I would be using it for a Kali VM running inside of a windows 10 box. My old one isn't compatible with windows 10 and only supports n.\nDoes anyone have any recommendations, about wireless adapters that they've personally used in the past?",
        "created_utc": 1527200957,
        "upvote_ratio": ""
    },
    {
        "title": "Malformed SIP Request, mainly dealing with URI Scheme",
        "author": "SOC_uintheface",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lwcxt/malformed_sip_request_mainly_dealing_with_uri/",
        "text": "Hey AskNetSec\\-ians,\n\nI just had a quick question, and if anyone knowledgeable enough that could provide some inside would be awesome.\n\nWhat exactly can be accomplished a Malformed SIP Request, mainly dealing with the URI Schemes in the header? \n\nI tried looking it up in google, but really couldn't find much on exactly what you could do with it. I mean you can find 100's of things on BOF, XSS, CSRF, and other stuff, but this is my first time coming across something like this.",
        "created_utc": 1527197437,
        "upvote_ratio": ""
    },
    {
        "title": "Email tracking",
        "author": "MastrM",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lvsyv/email_tracking/",
        "text": "Hoping I can get some clarity here...\n\nTrying to figure out how to best/most efficiently block Email tracking software from notifying or running inside our enterprise environment.\n\nie: GetNotify, Yesware etc...\n\nWhere is the best spot and what would I need?\n\nExchange 2016?, Email Security appliance? Firewall?\n\nThanks!",
        "created_utc": 1527193064,
        "upvote_ratio": ""
    },
    {
        "title": "eLearnSecurity - PTPv5",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lvgvy/elearnsecurity_ptpv5/",
        "text": "What do people think of eLearnSecurity's new PTPv5 offering? They've added Powershell.  I use to use powershell quite a bit during my sysadmin days, but after a few years of dealing with compliance, I got a bit rusty.  I would like to brush up on my Powershell and dig deeper into the security focus side of it as well.  Below is a link to the full syllabus for the course.\n\nhttps://www.elearnsecurity.com/collateral/Syllabus\\_PTPv5.pdf",
        "created_utc": 1527190516,
        "upvote_ratio": ""
    },
    {
        "title": "How do you (or IT) manage Windows compliance and patching? MS Intune?",
        "author": "RobsRemarks",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lv5fy/how_do_you_or_it_manage_windows_compliance_and/",
        "text": "My company makes use of Microsoft products including o365, Azure AD, etc.  I was going to make use of Intune for end user laptop compliance; things like enforcing encryption, forcing windows updates, and possibly making changes to other settings moving forward.  Intune seems like the natural choice for windows laptops since we use MS products.  Does anyone use Intune that can provide any insight if this is the right tool? Does anyone use a third party tool that would accomplish these things instead? \n",
        "created_utc": 1527188098,
        "upvote_ratio": ""
    },
    {
        "title": "How to setup metasploitable in virtualbox",
        "author": "hzftw",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lunee/how_to_setup_metasploitable_in_virtualbox/",
        "text": "Hello,\nI am trying to setup metasploitable2 as a VM in virtualbox but i cannot ping it from kali as \"destination host unreachable\".\nI configured both to use dhcp and activated  it in virtualbox.I used host only ethernet adapter.I dont know what step i am missing...",
        "created_utc": 1527184264,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a list of tools that are forbidden on the OSCP exam?",
        "author": "Knight_of_the_Stars",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ltnk8/is_there_a_list_of_tools_that_are_forbidden_on/",
        "text": "I know you're not allowed to use Metasploit, and I know there are others \\- but is there a list somewhere of which tools you're not allowed to use while you take the OSCP?",
        "created_utc": 1527176741,
        "upvote_ratio": ""
    },
    {
        "title": "Newbie looking for advice!",
        "author": "hotstyle575",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ltlyx/newbie_looking_for_advice/",
        "text": "Hi guys! Currently only 18 years old ( assuming that matters).  So far I've been experimenting with Kali linux at my school's cyber security club, been working on certifications (CEH, CCTA, CEL (non-related i believe)).  I currently know Java, Python, CSS, HTML, PHP (still getting there), may or may not have a possible internship too.  After some research here I know that certifications are usually the best route to add stuff on a resume/cover letter, what would you guys recommend? I'm open to any route thats cyber security related, and is there anything else I should keep an eye on?\nThanks ahead of time!\n",
        "created_utc": 1527176382,
        "upvote_ratio": ""
    },
    {
        "title": "Moving from Pentesting to Internal Security Analyst. Things to consider?",
        "author": "NotworkSecurity",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ltg74/moving_from_pentesting_to_internal_security/",
        "text": "Anyone moved from a pentesting position as a consultant to working internally as a security analyst? And if so, how was your experience and do you have anything you wish you knew beforehand?\n\nSo a bit of background, I’ve been a pentester for a few years now and I’ve worked for a few of the consultancies out there. \n\nI’ve recently been told about an internal security analyst position which pays quite a bit more than what I’m on right now.\n\nI understand the roles don’t have massive amounts of overlap, given I’d be potentially looking at project managing external pentests for the company and other blue-team-esqe roles.\n\nBut I’m considering it purely as an opportunity to expand my security knowledge and to get an understanding of how ‘the other half lives’.\n\nSo as the first part says, anyone done this? And if so, how did it go?",
        "created_utc": 1527175129,
        "upvote_ratio": ""
    },
    {
        "title": "Those of you who do programming in C#, what books out there would you recommend?. Beginner to more in-depth type books.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lrxm2/those_of_you_who_do_programming_in_c_what_books/",
        "text": "[deleted]",
        "created_utc": 1527161754,
        "upvote_ratio": ""
    },
    {
        "title": "Those of you who do programming in C, what books out there would you recommend?. Beginner to more in-depth type books.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lrw5s/those_of_you_who_do_programming_in_c_what_books/",
        "text": "[deleted]",
        "created_utc": 1527161333,
        "upvote_ratio": ""
    },
    {
        "title": "Currently looking for books on Computer/Digital Forensics, i need some suggestions. What would you recommend based on the ones you've read and know are good (\"Must Read\")?. Starting to get into this area and i am hungry to learn.",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lreqo/currently_looking_for_books_on_computerdigital/",
        "text": "Both early and up to date books. Its always good to learn the roots and how things are done as things change and evolve.\n\nThere are so many options and i feel overwhelmed on which ones to start with.",
        "created_utc": 1527155531,
        "upvote_ratio": ""
    },
    {
        "title": "What programs or tools do you use to check if a particular storage device (USB, CD) contain malicious code?. How would you go about analyzing that device, where do you start looking?. Before someone dives into that .. what should they start learning first?.",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lraui/what_programs_or_tools_do_you_use_to_check_if_a/",
        "text": "",
        "created_utc": 1527153976,
        "upvote_ratio": ""
    },
    {
        "title": "home security questions",
        "author": "deightonlee",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lqhhv/home_security_questions/",
        "text": "I've recently left the public sector to start my own thing. I've mostly relied on the built in levels of security at my job to keep my data secure. But I'll now often be working on the road or from home, so need to adopt better security protocols. \n\nWhat are some things I can do to make sure I keep my data and work product secure?\n\nBest practices etc. Links to places with good info I can read up on would be appreciated as well, I don't want to take up someones time. \n\nThanks in advance.",
        "created_utc": 1527142742,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best free book on how to harden privacy and security Ubuntu for first time Linux users?",
        "author": "Toocuriousspeed",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lqe3l/what_is_the_best_free_book_on_how_to_harden/",
        "text": "Never used linux before. I am looking for a free and easy to understand book on how to harden Ubuntu for privacy and security from state and non state hackers (like Tails, Qubes) after  dual clean install with Win10. \n\nAny suggestions?",
        "created_utc": 1527141527,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think every netsec professional should know like the back of their hand?",
        "author": "7heJoker",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lq5pm/what_do_you_think_every_netsec_professional/",
        "text": "",
        "created_utc": 1527138699,
        "upvote_ratio": ""
    },
    {
        "title": "IoT devices and Agreement or Authentication Pages",
        "author": "nonewjobs",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lpftm/iot_devices_and_agreement_or_authentication_pages/",
        "text": "Hello,\nI was just curious...if one had a headless device that was 802.11 enabled, but was not a laptop, tablet, smartphone or PC, had no OS and therefore no Browser, and one took it to a place where the public wifi requires an Agreement Page, or perhaps a code or passphrase, unique or not, how could one get this device online?\n\nI'm thinking of a Road Warrior who Hotel hops most of the time. Airports and Hotels, even Restaurants commonly have these types of redirects. \n\nWhat do? How do?",
        "created_utc": 1527131148,
        "upvote_ratio": ""
    },
    {
        "title": "What's with everyone updating their privacy policies and terms lately?",
        "author": "yudun",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lor2e/whats_with_everyone_updating_their_privacy/",
        "text": "I must have gotten several dozen emails in the past week of \"we updated our privacy policy\"",
        "created_utc": 1527125081,
        "upvote_ratio": ""
    },
    {
        "title": "Intelligent/best tool for web path scanning?",
        "author": "grchelp2018",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8llo8s/intelligentbest_tool_for_web_path_scanning/",
        "text": "I'm new to the scene and am wondering if there is any tool that tries to be clever when it tries to find directories and files. I've mostly been using dirsearch but this and the other tools I've tried basically just have a blind, dumb approach of trying all the keywords. If not, what's the best tool for this?",
        "created_utc": 1527099907,
        "upvote_ratio": ""
    },
    {
        "title": "When I recieve an email from a company, why are they using email adresses that easily could be fake?",
        "author": "Kittelsen",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8llic1/when_i_recieve_an_email_from_a_company_why_are/",
        "text": "I just recieved an email from security@facebookmail.com telling me it looked like I had troubles logging onto facebook, and telling me to click a button to log in. My biological phising sensor went haywire. After some googling, it turns out it was a legit email, but the question still stands.\n\nWhy are they using @facebookmail.com and not @facebook.com? It just looks waaay more shady.",
        "created_utc": 1527098700,
        "upvote_ratio": ""
    },
    {
        "title": "Preparing for OSCP, how much is enough?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ll589/preparing_for_oscp_how_much_is_enough/",
        "text": "[deleted]",
        "created_utc": 1527095990,
        "upvote_ratio": ""
    },
    {
        "title": "attack vectors for optical media?",
        "author": "fffol",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lk2qk/attack_vectors_for_optical_media/",
        "text": "Are there any known attack vectors for optical media akin to usb flash drives? Are factory pressed cds/dvds safe from being overwritten or data being added to them?",
        "created_utc": 1527087920,
        "upvote_ratio": ""
    },
    {
        "title": "Pentest scenario - what would be your first steps?",
        "author": "5150-5150",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ljd17/pentest_scenario_what_would_be_your_first_steps/",
        "text": "As someone who is just starting to get into pentesting, I'm having a hard time getting my head around a situation like this - \n\nA company has an external VPN portal. As the pentester, you somehow acquire an employee credential that is valid for authenticating to the VPN service. Now you can connect to the VPN with your own computer. You are dropped into a totally unknown network - what steps would you take towards pivoting and acquiring control of another machine?",
        "created_utc": 1527082185,
        "upvote_ratio": ""
    },
    {
        "title": "What are some project/lab ideas to do at home?. Preferably involving VMs and virtual environments (setting up a network on there with multiple users to test out things). I dont have alot of hardware and need your advice (more details below).",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lio6m/what_are_some_projectlab_ideas_to_do_at_home/",
        "text": "Setting up a virtual environment that i can work in and mess around with to enhance my skills and learn some new things. \nThe environment itself will have multiple workstations (fake ofcourse) to mimic users who are connected to the network (All whithin the virtual space). \nI have a few computers that i can use but im looking to completely seperate the workspace from my actual home network as to avoid any problems when poking around.\n\nShould i configure all of the actual computers and set up an enclosed environment where each computer represents a user (Each PC/User having a variety of things stored on there, such as applications, personal data, connected devices and etc), including mobile devices. \nConnections for the computers will be wired except for the mobile devices using the AP.\nThen me being the outsider trying to find my way through things.\n\nMe--&gt;Router/Switch--&gt;Computers/Devices",
        "created_utc": 1527075749,
        "upvote_ratio": ""
    },
    {
        "title": "Trashy tablet",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8life0/trashy_tablet/",
        "text": "[deleted]",
        "created_utc": 1527073052,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone applied to Crowdstrike?",
        "author": "7heJoker",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lf563/has_anyone_applied_to_crowdstrike/",
        "text": "If so, what was your experience? I’ve applied like 5 times and my application never gets anywhere it just immediately gets closed after a couple days. Maybe I’m just not qualified but I feel like I’ve met and exceeded all the qualifications (2 of the job postings were for a technical support position). Where I work we are currently a customer of theirs so I’m wondering if that has something to do with it. ",
        "created_utc": 1527036102,
        "upvote_ratio": ""
    },
    {
        "title": "Question about NTLM hash storage",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8leajf/question_about_ntlm_hash_storage/",
        "text": "[deleted]",
        "created_utc": 1527028542,
        "upvote_ratio": ""
    },
    {
        "title": "Alternatives to NoDistribute/VirusTotal",
        "author": "5150-5150",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8leaf4/alternatives_to_nodistributevirustotal/",
        "text": "Seeing as it is a deathwish to upload files to VirusTotal during a pentest, I'm always looking for alternatives. I'd been using NoDistribute for quite a while, but it looks like they are down and probably not coming back online.\n\nDoes anyone have recommendations for other mass virus scanner sites that are known not to distribute results to vendors? I'm willing to pay a bit, doesn't have to be free.",
        "created_utc": 1527028512,
        "upvote_ratio": ""
    },
    {
        "title": "Loopback interface of my laptop sends TCP SYNs from incrementally growing ports to itself, to port 443 and responds from 443 with RST, ACK. What is going on?",
        "author": "cr_wdc_ntr_l",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8le18r/loopback_interface_of_my_laptop_sends_tcp_syns/",
        "text": "Today while firing wireshark up I noticed something unusual for me: traffic on loopback interface! Naturally I sniffed it only to see something looking suspiciously like port scan. As in title; Traffic consisted only of TCP SYNs and RST,ACK responses. SYNs were sent from incrementally growing ports (in 50+ k range when I begun sniffing) to 127.0.0.1:443, and RST,ACKS responded from 443 to port which sent SYN. SYNs were sent at rate of about 2 per second and linux ss utility tells me that connections were commenced by my webbrowser! After I did 'ip link set lo down' ss reported connections in syn-sent state and for first time ever while loading sites my browser printed 'Waiting for available sockets' in usual for similar status updates lower left corner. What to think of it? Is it some malicious but relatively harmless script my browser picked up in darker corner of internet? Or maybe some builtin chrome(ium) 'feature'? Should I be afraid and monitor my loopback for further occurences? ",
        "created_utc": 1527026471,
        "upvote_ratio": ""
    },
    {
        "title": "Pentester, what do you do when there's nothing to find?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ld87z/pentester_what_do_you_do_when_theres_nothing_to/",
        "text": "[deleted]",
        "created_utc": 1527020259,
        "upvote_ratio": ""
    },
    {
        "title": "Do you disclose your security controls?",
        "author": "NSH_IT_Nerd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ld5bc/do_you_disclose_your_security_controls/",
        "text": "When dealing with third parties, (in this case, a potential customer, for example) how much do you disclose to them about your security program? \n\nI'm currently on my third round of questions from a company that hasn't yet paid for a dime of my company's time, and they're getting deeper - asking about packet inspection, timelines for implementation (disclosed in a previous question that we're implementing a new security control this year), and asking us to provide guidance/description about our internal network architecture and diagrams. I'm starting to push back on some of these things, but I wanted to see what others' experience has been and where have you drawn the line?",
        "created_utc": 1527019660,
        "upvote_ratio": ""
    },
    {
        "title": "HIPAA \"Certification\"?",
        "author": "AlwaysFallingUpwards",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ld4u1/hipaa_certification/",
        "text": "Let me start off by saying that I acknowledge that an individual getting a \"HIPAA certification\" is a bit of a joke as there is no official governing body. That being said, I'm still interested because I'm trying to break into netsec and more than half of the relevant jobs in my area state that \"HIPAA Certification is a plus.\" I'm looking for anything that could give me an edge so I'm willing to drop $30-50 if it means a boosting my chances. The problem is that none of these companies define what they mean by \"HIPAA Certification.\" I'm trying to figure out if there is a major body that most companies would likely accept or if it's very individualized and I would be wasting my time.\n\nAny useful advice is appreciated, I'm just trying to determine if this would be a good path to go down.",
        "created_utc": 1527019565,
        "upvote_ratio": ""
    },
    {
        "title": "Doubts about graduating from Penn State with a 'Security and Risk Analysis' degree",
        "author": "gnullify",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ld1v5/doubts_about_graduating_from_penn_state_with_a/",
        "text": "Apologies in advance if this sounds completely apathetic. Imposter syndrome is in full effect right now.\n\nI recently wrapped up my junior year at Penn State pursuing a 'Security and Risk Analysis' BS and I'm feeling pretty down about it. With just a year left, it's becoming apparent that I'm not going to have the technical knowledge needed to get an entry level job (or at least that's my perception). I've always had this doubt but figured I'd get there once I get there. Penn State recently announced they're going to begin replacing my major with a new one (Cybersecurity Analytics and Operations) which has far more technical coursework. This has raised my self-doubt to new heights and I'm feeling pretty dejected about it. I have no real career focus. Pentesting is what initially intrigued me but I haven't learned much in my studying that would prepare me for that.\n\nI've even thought of switching to computer science, but it'd take me an additional year to graduate. Am I overreacting and in my own head? How can I supplement to give myself the best possible career prospects? In terms of certs, I could probably get my Network+ cert, maybe a CCNA with some studying. I'm pretty lost and can't envision what my life looks like after graduating. What kind of entry-level job can I realistically look for after college?",
        "created_utc": 1527018939,
        "upvote_ratio": ""
    },
    {
        "title": "Roast my resume please.",
        "author": "jankate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lcx0u/roast_my_resume_please/",
        "text": "I'm trying to land my first internship. Just need some criticism to help make my resume better. Thank you.\n\nhttps://imgur.com/a/8wtRHS7",
        "created_utc": 1527017981,
        "upvote_ratio": ""
    },
    {
        "title": "Software for security reviews?",
        "author": "jamera3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lcoh3/software_for_security_reviews/",
        "text": "Is there any software you're using to capture questions your team/organization asks vendors prior to purchasing their product? I'm not looking for vulnerability scanning tools or whatever, but more something that would capture responses from vendor regarding questions we ask about the security of their product. (right now we use a survey tool, but making changes to the workflow or questions is pretty difficult)",
        "created_utc": 1527016243,
        "upvote_ratio": ""
    },
    {
        "title": "Totally Uneducated In This Area and Tasked With Finding Email Security",
        "author": "RedScoutThirteen",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8lc1lu/totally_uneducated_in_this_area_and_tasked_with/",
        "text": "Hi everyone. I work for a small (7 employees) law firm and due to a recent security issue at a neighboring firm, my boss is freaking out and wants to set up secure e-mail. He's tasked me with finding the best service to suit our needs and I have next to no knowledge in this arena. I was hoping I could give you his needs and you could point me in the right direction.\n\nWe all have our work email addresses through Gmail; they read firstname@nameoflawfirm.com. My boss would like to find a service that integrates and still allows us to use our email addresses. We've tried a few Chrome plugins, like SecureGmail, but the fact that you have to create a password for each email is less than idea, considering 2 of us would need security on every email that we send. Plus, it required the person receiving it to also have and/or download the plugin, which many of our clients wouldn't be willing or able to download. \n\nCost also plays a factor. I looked into Zix and it would cost over $2,500 a year for each of us to use it. I'd say our budget, at the very most, would be about $100 a month.\n\nNow, I've heard that Gmail will be rolling out their own integrated security/encryption soon, and if true, we would just need to use whatever service we decide on temporarily. \n\nI hope my boss' expectations aren't too high, but if anyone could at least get me close I would greatly appreciate it.\n\nEDIT: The instance that prompted this need for security was a neighboring firm somehow had upwards of $100k end up in Algeria. Both of our firms handle a lot of real estate matters so there’s a lot of financial info being sent back and forth via email. I don’t know if this clarifies anything.",
        "created_utc": 1527011700,
        "upvote_ratio": ""
    },
    {
        "title": "I am new to requesting CVEs and have a question...",
        "author": "-Thane-",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8la22l/i_am_new_to_requesting_cves_and_have_a_question/",
        "text": "So I was conducting an internal pentest and discovered an RCE vulnerability on an application that was forked from github. I checked the master branch and found that the vulnerable code was patched earlier this year on the whim of a developer. There were no CVE details or anything to be found on the internet about how easily this issue could be exploited.\n\nThat being said, because the patch wasn't backported to earlier versions, is it viable to request a CVE? I have already created a fairly robust python script to automate the attack and am ready to post to exploit-db. However, since this is my first time requesting a CVE, I am trying to determine if a CNA will take me seriously or if I should just press forward.",
        "created_utc": 1526996445,
        "upvote_ratio": ""
    },
    {
        "title": "Best resources to learn about Active Directory?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l9rdr/best_resources_to_learn_about_active_directory/",
        "text": "[deleted]",
        "created_utc": 1526993729,
        "upvote_ratio": ""
    },
    {
        "title": "Threat Intelligence",
        "author": "sanext15",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l8inl/threat_intelligence/",
        "text": "Hello folk, might anyone have a threat notification template I could use for awareness and education purpose. Something I can integrate into my email and send to colleagues?",
        "created_utc": 1526978961,
        "upvote_ratio": ""
    },
    {
        "title": "Human Expert Analysis",
        "author": "jecobjoel",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l8f7j/human_expert_analysis/",
        "text": "[removed]",
        "created_utc": 1526977537,
        "upvote_ratio": ""
    },
    {
        "title": "Please forgive my utter noobiness...",
        "author": "Paretio",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l6m1t/please_forgive_my_utter_noobiness/",
        "text": "Working on getting a stable and safe copy of Kali.  Unfortunately, I have no truly secure Internet access except through my cell.\nThe only access points I have are libraries (Not only public, but they kill big downloads) and restaurants.  Neither sounds wise or appealing.  It doesn't help I'm po.  I'm so poor I can't afford the O and the R.\n\nMy question is this; how can I maximize my security during the download of the OS, considering I'm using public networks?\n\nMy main machine runs dual Windows 7/Ubuntu.  She's an old girl, but she's what I have.",
        "created_utc": 1526957164,
        "upvote_ratio": ""
    },
    {
        "title": "Just getting started with my home lab...",
        "author": "Paretio",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l6ilx/just_getting_started_with_my_home_lab/",
        "text": "I am really interested in IoT security.  Got my lab set up (mostly), got two copies of Kali 17.04 (goofed on the download the first time) and noticed something odd.\n\nEach copy is a different size.  Significantly.\n\nChasums check out.  But the properties listed notes MAJOR size difference.  Almost 56 MB difference.\n\nIt doesn't help that my main machine is Windows 7/Ubuntu, and the download was Windows 7.\n\nShould I just delete and redownload, or what?\nI don't have access to a truly secure network, except my cell.  Where I live is so far in the boonies there isn't cell reception at all.  We have land lines and satellite.\n\n",
        "created_utc": 1526956307,
        "upvote_ratio": ""
    },
    {
        "title": "What do you use/how to test links inside PDFs?",
        "author": "wadeapalooza",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l6gvj/what_do_you_usehow_to_test_links_inside_pdfs/",
        "text": "I am currently using cuckoo for a sandbox environment. I run suspicious PDFs to verify if they are malicious. Every now and then I get one that has a link. My automated sandbox only opens the pdf and not the link in it. So whats the best way to check that link without clicking on it? ",
        "created_utc": 1526955879,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone here work in compliance?",
        "author": "danny069",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l4l29/anyone_here_work_in_compliance/",
        "text": "Hey everyone, I have an interview coming up for a compliance role for a startup, PCI-DSS mostly.  I was wondering if anyone here have any compliance roles now and what you've done when you first started in compliance, such as writing policies, etc.  Thanks in advance!",
        "created_utc": 1526939234,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good sites/newsletters/email subscriptions for keeping up with InfoSec trends, vulnerabilities, threats, news, etc.?",
        "author": "Behind8Proxies",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l3vbs/what_are_some_good_sitesnewslettersemail/",
        "text": "I was asked recently on a job interview where I get my InfoSec news.  I get alerts from US-Cert, I'm a member of Infragard, I get Bruce Schneier's newsletter, I check out Krebs on Security.  But what are some other good sites or newsletters or subscriptions that are a necessity for staying on top of things? \n\nEdit: rather than trying to reply to everyone, I just figured I’d edit my original post. Thank you to everyone for the information apparently there were a lot of sources that I was missing out on. I really appreciate the input. It looks like I have some reading and subscribing to do. ",
        "created_utc": 1526933457,
        "upvote_ratio": ""
    },
    {
        "title": "Virtual lab setups",
        "author": "TrustmeIreddit",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l2r4q/virtual_lab_setups/",
        "text": "For the security\\+ exam would it be a good idea to use packet tracer/routersim to set up secured systems or does that only apply for the network\\+/CCNA exams?",
        "created_utc": 1526924912,
        "upvote_ratio": ""
    },
    {
        "title": "Connecting PC directly to wall ethernet",
        "author": "niobidum",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l1ijr/connecting_pc_directly_to_wall_ethernet/",
        "text": "Hi everyone, I have been getting crap reception to my home wireless router in the basement, but there is an ethernet port in the wall here that my use to have their old router in. So I tossed a ethernet cable from the wall to my pc and saw nice speed boosts. My concern though is that there is no firewall or hardening protecting my machine (Ubuntu 18.04). What can I do to harden my system? Would putting an old router between be sufficient? Is there a software solution that I can implement? And most importantly, what risks am I taking by doing this? I am currently running my vpn as my only safeguard for the time being, but since that lengthens the ping response times I would like to find a simple solution. Thanks in advance!",
        "created_utc": 1526915352,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone use my IP to spoof his requests",
        "author": "sarojininaidu",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l0vp0/can_someone_use_my_ip_to_spoof_his_requests/",
        "text": "I recently started programming. And I can see the logs where I can see which IP is making this request. I am wondering if this is the IP that is stored in their system? Or is there anywhere the IP information is carried in the request?",
        "created_utc": 1526909982,
        "upvote_ratio": ""
    },
    {
        "title": "Any input on nginx WAF ?",
        "author": "3AGLE_OF_SURVEILLANC",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l06au/any_input_on_nginx_waf/",
        "text": "I am by no means a web server expert , but I still wanted to install a Web application firewall infront of my nginx server which runs Seafile . I don't know if I even have to worry about wab attacks on a well testes application like Seafile , but better safe than sorry . I tried shadowd , but well it is not really what I wanted . NAXSI and Modsecurity look pretty good , but I really dont want to recompile nginx from source . I really like the convenience of installing form repository . I mean I would have to manually make a systemd config for it and could not update it without recompiling . So is there an easy , non frustrating way to deploy a WAF on nginx ?",
        "created_utc": 1526903008,
        "upvote_ratio": ""
    },
    {
        "title": "PHP FPM FastCGI cgi.fix_pathinfo=1",
        "author": "xxByte",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8l00ns/php_fpm_fastcgi_cgifix_pathinfo1/",
        "text": "Can someone explain to me what are the consequences of having this missconfiguration?\n\nQuoted from [here](https://www.linode.com/docs/web-servers/nginx/serve-php-php-fpm-and-nginx/):\n\n    When pairing NGINX with PHP-FPM, it’s possible to return to NGINX a .php URI that does not actually exist in the site’s directory structure. The PHP processor will process the URI, and execute the .php file, because its job is to process anything handed to it by NGINX. This of course presents a security problem.\n    It’s important limit what NGINX passes to PHP-FPM so malicious scripts can’t be injected into return streams to the server. Instead, the request is stopped, possibly then resulting in a 404. There are multiple ways to do this (see the NGINX wiki) but here we chose to specify the setting in PHP-FPM rather than in NGINX’s configuration.\n\n\ncan I retrieve `/etc/passwd` for instance?",
        "created_utc": 1526901233,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good books or resources on Powershell?.",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kzi83/what_are_some_good_books_or_resources_on/",
        "text": "",
        "created_utc": 1526894431,
        "upvote_ratio": ""
    },
    {
        "title": "Best cert for penetration testing?",
        "author": "Wicked_gr3y",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kx21t/best_cert_for_penetration_testing/",
        "text": "I’m finishing up my CISSP and am looking to learn some pen testing. I learn better when I’m working towards something, so... which cert would you recommend? (And why!)\nThanks all!",
        "created_utc": 1526864777,
        "upvote_ratio": ""
    },
    {
        "title": "Could someone please help me evaluate this company?",
        "author": "ObjectiveKitty",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kvruq/could_someone_please_help_me_evaluate_this_company/",
        "text": "It was formed in 2011 and they offer a managed security service built entirely in\\-house.\n\nThey manage end\\-devices in the tens of thousands with only a handful of developers.\n\nThey haven’t been featured in any blogs or “hot startup” lists or won any awards but heard of them through word of mouth.\n\nAny input would be great.\n\n🙏🏾\n\n[https://www.threatspike.com](https://www.threatspike.com/)",
        "created_utc": 1526852350,
        "upvote_ratio": ""
    },
    {
        "title": "My Current Steps towards securing my WordPress site: Any Suggestions?",
        "author": "Lewisecurity",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kveza/my_current_steps_towards_securing_my_wordpress/",
        "text": "Hello Everyone, \n\nI have made a new blog post on my website here: [https://www.lewisecurity.com/my\\-steps\\-towards\\-securing\\-my\\-wordpress\\-website/](https://www.lewisecurity.com/my-steps-towards-securing-my-wordpress-website/)\n\nThrough this post I detail all of the steps I have currently taken to secure my wordpress website, and I would absolutely love some input and more ideas on how to achieve an even better security posture. Feel free to leave a comment here or on my website with any suggestions. \n\nThanks!",
        "created_utc": 1526849145,
        "upvote_ratio": ""
    },
    {
        "title": "Buy The Hacker Playbook 3 with paypal",
        "author": "fightnerd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kuxvh/buy_the_hacker_playbook_3_with_paypal/",
        "text": "Does anyone know of anywhere I can obtain a copy using paypal, that also still supports the author? I already have my copy, but I am going to buy several more for a group I co\\-organize and it would be easier to do with paypal for reasons. ",
        "created_utc": 1526844975,
        "upvote_ratio": ""
    },
    {
        "title": "Help Please!",
        "author": "yousif2109",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kusf4/help_please/",
        "text": "Somebody is spying on my texts and calls and sending texts from my phone to other people, how can i trace this person and find out who he is?",
        "created_utc": 1526843639,
        "upvote_ratio": ""
    },
    {
        "title": "Taking the CCSP this Friday, any sage advice?",
        "author": "Xauric",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kukr9/taking_the_ccsp_this_friday_any_sage_advice/",
        "text": "Title. I've gone through the CBK, and am reading the CSA V4. Does anyone have any sage advice to pass on?\n\nAs a note, I do not currently possess the CISSP, this test is required for school. \n\nThanks in advance.",
        "created_utc": 1526841776,
        "upvote_ratio": ""
    },
    {
        "title": "Linux wildcard abuse",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ku7aj/linux_wildcard_abuse/",
        "text": "[deleted]",
        "created_utc": 1526838468,
        "upvote_ratio": ""
    },
    {
        "title": "Linux wildcard abuse",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ku6s3/linux_wildcard_abuse/",
        "text": "[deleted]",
        "created_utc": 1526838345,
        "upvote_ratio": ""
    },
    {
        "title": "Master's cyber security program",
        "author": "mpskierbg",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kpjx7/masters_cyber_security_program/",
        "text": "\nHello, \n\nI need some advice on cybersecurity master's programs. I am a lawyer that loves network security and coding and wants to make cyber security law his career. Would you recommend Online programs over in person? And with whatever your choice is what programs are tops?",
        "created_utc": 1526778980,
        "upvote_ratio": ""
    },
    {
        "title": "Prepping for security+",
        "author": "TrustmeIreddit",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kosmd/prepping_for_security/",
        "text": "I was able to get a hold of a couple study guides: Comptia security\\+, Comptia Secutity\\+ cert guide and one by Darril Gibson. All three are recent\\( SY0\\-501\\). The concepts themselves I can understand, it's just all the acronyms. I don't have the money to do the bootcamp, so it's all self\\-taught. For those of you who have taken the security\\+ exam, do you have any pointers or guidelines I should be focusing on?",
        "created_utc": 1526770770,
        "upvote_ratio": ""
    },
    {
        "title": "QSA Exam",
        "author": "infosecaphorism",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8knjk6/qsa_exam/",
        "text": "Next week I'm going to take the PCI QSA course and exam. Has anyone here taken it? Any one have any tips for the exam? Seems like they will cram a bunch of information into two days and make the exam challenging. ",
        "created_utc": 1526758583,
        "upvote_ratio": ""
    },
    {
        "title": "Received a mail: My Spotify email has been changed. But...",
        "author": "mattiasso",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kmwfl/received_a_mail_my_spotify_email_has_been_changed/",
        "text": " Just to begin  with, I didn't have an account on Spotify. So, for sure, nobody could  have interest in a free account with no payment details.Two days ago I  received a mail to confirm the email change of my account. Not requested  by me, and being this email account protected by strong password, 2FA  \\(gmail\\) and being used only on few devices only very close to me, I just  ignore it. But yesterday, I've received the mail which confirms the  email change, from \\[myaccount\\]@gmail.com to \\[someaccount\\]@hotmail.co.uk.  So the first thing I've done I checked where the mail was from. And it  actually was from Spotify. So I immediately checked for intrusions in  the main mail account, the mail I was forwarding to and any social  account that could be connected with Spotify \\(all protected with 2FA\\).  Nothing, all the connections were mine, the account was not linked and  the email on the backup box not even opened.\n\nThen  my question is... How? Or maybe better, what's happening? Has Spotify  made mistakes? What interest could the attacker have in \"my\" Spotify?  How could he confirm the email change without access to this mail with  relative confirmation link?\n\n**Addendum**:  The systems who have access to this mail are fairly safe. Confirmation  has happened when all those systems were shutdown, aside the non  jailbroken iPhone, which was not in use and on my desk. No other people  were around and the network is safe \\(not that they could intercept the  https session with gmail anyway\\). No accidental click.",
        "created_utc": 1526752724,
        "upvote_ratio": ""
    },
    {
        "title": "What is best anti-virus software?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8klbzf/what_is_best_antivirus_software/",
        "text": "[deleted]",
        "created_utc": 1526737353,
        "upvote_ratio": ""
    },
    {
        "title": "havent forgot about the ethereum",
        "author": "Japanorium",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kkgkc/havent_forgot_about_the_ethereum/",
        "text": "just been lil busy",
        "created_utc": 1526725977,
        "upvote_ratio": ""
    },
    {
        "title": "I need advice on one of my job tasks (Web service, SIEM-Qradar)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kjpve/i_need_advice_on_one_of_my_job_tasks_web_service/",
        "text": "[deleted]",
        "created_utc": 1526713625,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a remote work from home position in cyber security. What companies would you suggest looking into?",
        "author": "7heJoker",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kj1pv/looking_for_a_remote_work_from_home_position_in/",
        "text": "",
        "created_utc": 1526704560,
        "upvote_ratio": ""
    },
    {
        "title": "Microsoft RDP Logs - Base64(SHA256(UserName)) ?",
        "author": "BeanBagKing",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kid7k/microsoft_rdp_logs_base64sha256username/",
        "text": "I'm trying to figure this one out, as it might make some logs I'm looking at much more useful. There's a Terminal Services RDP Client log (Event ID 1029) that contains the following description: **Base64(SHA256(UserName)) is = s8v7wS1UMkc0myytGIXeX2MWh9ojpi4aKwRwbOwFS5U=-** \n\nUsername for this lab should be \"ServerUser01\" or just \"User\". However, nothing I do to try to try to match this seems to work. SHA256 hashing that username and then base64 encoding it doesn't match at all. Length is obviously way off for a SHA256 hash. Base64 decoding that string just seems to give me binary gibberish.\n\nI'm kind of assuming that, because it's Microsoft, they did something weird (like used UTF-16LE the way they did for NTLM hashes). I'm coming up empty though and I haven't found anything on Google describing how this format works. \n\nAny help, even guesses, would be appreciated at this point. Thanks\n\nAddendum: I'm not sure where to put this, it isn't exactly network security, forensics, or hacking (among the major reddit's I follow). So sorry if this is the wrong place, but I felt like this was my best shot of getting an answer.\n\nEdit: See the comments below for how everything worked out. I also created this (still a work in progress) https://github.com/BeanBagKing/1029_crack.py",
        "created_utc": 1526696459,
        "upvote_ratio": ""
    },
    {
        "title": "Sandbox Solutions",
        "author": "LittleElk4",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8khwha/sandbox_solutions/",
        "text": "Hey all,\n\nWhat are your thoughts on sandbox solutions for an average retail enterprise network? We have a small team but have occasional use for sandboxing during investigations. I would like to keep it off public tools like hybrid analysis and VT. Really usually interested in network artifact extraction at this point. Thanks!",
        "created_utc": 1526691270,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations on books like \"how linux works\" but approaching the Windows operating system.",
        "author": "sygma__",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kgs61/recommendations_on_books_like_how_linux_works_but/",
        "text": "Well, I think the title says it all.\n\nI need books which approach windows the same HLW did with Linux. Any recommendations?\n\n",
        "created_utc": 1526680014,
        "upvote_ratio": ""
    },
    {
        "title": "Blackhole vlan mode",
        "author": "CatsAndIT",
        "url": "https://www.reddit.com/r/Cisco/comments/8kgjtz/blackhole_vlan_mode/",
        "text": "",
        "created_utc": 1526677986,
        "upvote_ratio": ""
    },
    {
        "title": "(Side Project) An nmap results visual presenter",
        "author": "cvicpp",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kghen/side_project_an_nmap_results_visual_presenter/",
        "text": "Hey guys and ladies, I'd like your opinion about a side project of mine:\n\nI've created a very basic nmap XML parser who displays information from the scans in an organized and visual enhanced page. I am working to make it more featured and I am planning to apply some AI/ML on the results in order to predict correct attack vectors. \n\nI am also working to add user accounts and the ability to import nikto/dirb/gobuster etc. export files for better enumeration.\n\nThe url is https://reconya.com\n\nThanks !\n\nEDIT: Examples from retired HTB boxes:\n\n- https://reconya.com/importer/results?fid=8154a242c5acb5e5cab8af29\n- https://reconya.com/importer/results?fid=8ffec9aed6b78d94213dea78\n- https://reconya.com/importer/results?fid=5c05ac50d9ec78d30299f3ec\n- https://reconya.com/importer/results?fid=0620a7c4227f23bdd9cbdf51",
        "created_utc": 1526677312,
        "upvote_ratio": ""
    },
    {
        "title": "Best tool(s) for intercepting WebSocket communication + making WebSocket requests?",
        "author": "nationStateHate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kfirb/best_tools_for_intercepting_websocket/",
        "text": "https://en.wikipedia.org/wiki/WebSocket\n\n1. I'd like to make websocket requests / have a dialog with a websocket server\n2. Would like to intercept websocket communications\n\nWhat do you think are the best tool(s) for #1 &amp; #2?",
        "created_utc": 1526669200,
        "upvote_ratio": ""
    },
    {
        "title": "What network configuration do I have and how do I harden my WiFi router?",
        "author": "powerofinformation",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kddfc/what_network_configuration_do_i_have_and_how_do_i/",
        "text": "I live in Bangladesh and I am totally new to the world of computers and especially computer security. Can someone tell me in an ELI5 fashion how to secure my WiFi router that I have in my home and I connect my laptop, mobile and other people of the household connects their phones and devices as well? \n\nI get a wire from the local internet provider that I connect to my WiFi router. When I first bought the router years ago from them they configured the router name and other details. They are a very small business with a maximum of five employees. They get the connection from elsewhere I guess. I have a Netgear N300 router. \n\nIn such a situation can someone tell me: \n\n* What type of network or configuration I am in? \n\n* How do I harden my router? \n\nPS: I know the information might be long. So if anyone can provide a link to hardening WiFi router for total newbies it would be great. I Googled extensively and some articles leave out things that others add and some are too highly hardened while others are too softly. ",
        "created_utc": 1526651944,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a free OneNote substitute for Android that works offline and is secure and private. Any suggestions?",
        "author": "powerofinformation",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kd881/looking_for_a_free_onenote_substitute_for_android/",
        "text": "Can't find a way to cross-post this to this sub for better visibility. So writing the text again: \n\nI am basically looking for a substitute for MS OneNote. I went through the privacytools website and searched Google thoroghly but I can't seem to find a good, lightweight note-taking app for Android that will be a substitute for MS OneNote while at the same time being secure and private from hackers and offline as well.\n\nI tried Turtl but it logs out frequently and on my Lava Flair S1 mobile (which is really old) it is slow and takes a lot of time to write. The app is also too simple and organizing information is a chore.\n\nStandard Notes does not install on my android and Laverna does not support Android.\n\nAny suggestions?",
        "created_utc": 1526650691,
        "upvote_ratio": ""
    },
    {
        "title": "CompTIA Triple vs OSCP, after college",
        "author": "rjt_gakusei",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kcul9/comptia_triple_vs_oscp_after_college/",
        "text": "I'm graduating college with a software engineering degree. Unfortunately don't have any internship experience and grades were average at best, so I'm considering spending the summer working towards certs to be more marketable. \n\nWould it be more beneficial, from a job search standpoint, to get my A+, Network+, and Security + in the next few months, or to practice on CTFs and vulnhubs to gain experience towards eventually getting OSCP? Having taken networking and security courses, I am familiar with a lot of the material in network+ and security+, but I am wondering if they will have an impact in terms of what jobs will become accessible.\n\nDoes having a few CTFs under my built and maybe a personal project look better to employers in IT/security than having the three CompTIA certs?\n",
        "created_utc": 1526647233,
        "upvote_ratio": ""
    },
    {
        "title": "Privilege access management (pam)",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kc4zo/privilege_access_management_pam/",
        "text": "is there a community edition or open source pam which you can recommend?",
        "created_utc": 1526639306,
        "upvote_ratio": ""
    },
    {
        "title": "How do I test a application over a local area network ?",
        "author": "3into9is3",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kbv9t/how_do_i_test_a_application_over_a_local_area/",
        "text": "I have only one laptop. I am making an application where I can sniff a file transfer over a local area network but I don't know how to test it since I have only one laptop. What can I do to setup a client and server on same machine, transfer a file between them and then sniff the transferred file by an application running on the same machine ?",
        "created_utc": 1526635825,
        "upvote_ratio": ""
    },
    {
        "title": "Stubborn Malware",
        "author": "CircumscribedIamb",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8kb7mt/stubborn_malware/",
        "text": "Not sure if this is the right place to ask for help but i’m in desperate need of it. Let my friend use my computer and when i came back to it , it was behaving weirdly. \n\nChrome was randomly opening to Ad pages (chrome isnt used by me and it isnt the default browser) \n\nUnnamed process on task manager was taking up cpu resources, file location was from sysWOW64 svchost.\n\ncertain webpages cause the browser to close suddenly \n\nAvast didnt detect anything \n\nAny advice is much appreciated ! ",
        "created_utc": 1526626504,
        "upvote_ratio": ""
    },
    {
        "title": "So I found out about ngrok.. How secure is it?",
        "author": "hackitfast",
        "url": "https://www.reddit.com/r/sysadmin/comments/8k8xey/so_i_found_out_about_ngrok_how_secure_is_it/",
        "text": "",
        "created_utc": 1526619558,
        "upvote_ratio": ""
    },
    {
        "title": "Question about security of IP cameras",
        "author": "networking_question",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ka1gz/question_about_security_of_ip_cameras/",
        "text": "Sorry if this comes off as a bit paranoid or silly, but I have some questions about the cheap Chinese IP cameras my parents bought off of amazon. I helped them set them up a while back, and didn't think much of it at the time, but after reading some things about these types of cameras being easily compromised/open for any weirdo on the internet to access I feel a bit concerned about the security of the setup. I'm not very knowledgeable in general about this stuff, which is why I'd like some expert input on the topic. With the current way the cameras are set-up, they are able to be accessed even when away from their home network. When setting them up I changed the admin password from its default, and whenever I try to access the cameras through typing their IP into the address bar I need to input it to continue. Does this mean they are secure completely with no chance of being compromised outside of some exploit? The cameras seem to work through P2P, and doesn't involve port forwarding, UPnP, etc. (?) Also, if it's relevant, when I do a port scan on the cameras using nmap, the only open ports that are shown are used for http, rtsp, rtmp, and http-proxy services (if I'm leaving out any important information here feel free to tell me). Any help would be appreciated, thanks.\n",
        "created_utc": 1526612630,
        "upvote_ratio": ""
    },
    {
        "title": "mobile app authentication and authorisation",
        "author": "s802645",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k987e/mobile_app_authentication_and_authorisation/",
        "text": "what is a good and secure way to authenticate a mobile app designed to connect back to corporate backend from the internet , to access intranet applications? our original thought is to simply code the app to authenticate through our internal windows active directory but there could be dangerous consequences.. thanks",
        "created_utc": 1526604378,
        "upvote_ratio": ""
    },
    {
        "title": "is it possibly to privilege from ring3 to ring0 ?",
        "author": "0x006",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k87bc/is_it_possibly_to_privilege_from_ring3_to_ring0/",
        "text": "Hi there , I have a bug that will allow me to arbitrary code execution in a machine , but the software running as \" \\-rwxr\\-xr\\-x 1 root root \" ? so my question is  , do I have ability to get privilege ?",
        "created_utc": 1526594848,
        "upvote_ratio": ""
    },
    {
        "title": "Curious about ISSO/Security Consultant roles?",
        "author": "zukolfe",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k7h8g/curious_about_issosecurity_consultant_roles/",
        "text": "Future planning at the moment and wanted to ask netsec for some guidance/information!\n\nI'm under the understanding that compliance/POAMs/SSP/etc work is very non\\-technical in most cases and typically involves lots of paperwork and reports. What other titles might revolve around this type of work besides isso/security consultant?\n\nFrom personal experience would you say the payscale is relatively similar to working security analyst/engineer roles? I ask this as relying on payscale and glassdoor has been extremely hit or miss in regards to security positions compared to other IT roles.\n\nI kind of want to step away from the technical side of things eventually and do more compliance work \\(blasphemy, I know\\) but am curious if it might be a big paycut. I do know that technical skills are highly valued when it comes to compliance work but the last offer I got \\(for compliance work\\) was significantly less than the offer I took\\(technical\\) like 20&amp;#37;. This might have just been the company's budget but I'm still a little curious.\n\nAnother question I have is when looking for management and upper management roles is compliance work valued more so? \n\nVery open ended questions I know, just looking for some info from more seasoned security professionals who may have worked a wide spectrum of roles.",
        "created_utc": 1526588997,
        "upvote_ratio": ""
    },
    {
        "title": "So is this goal realistic?",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k6k46/so_is_this_goal_realistic/",
        "text": "So I would like to be a well rounded hacker in IT areas and programming with extra emphasis in web hacking, OSINT, social engineering, etc.\n\nI would like to know the basics of other IT related areas of hacking. I also would like to know a lot of cryptography long term.\n\nOtherwise basic well rounded hacking is good.\n\nIs this goal achievable, maintainable, and realistic, and how long should it take considering I am studying for a CCENT, which I started over several times but am not doing anymore.\n\nThanks.\n\nBest,\n\nQMark",
        "created_utc": 1526581865,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to earn and maintain knowledge and skill of all offensive security certs? How long should it take from a beginner level?",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k6fso/is_it_possible_to_earn_and_maintain_knowledge_and/",
        "text": "So I am still working on CCENT but starting now if I work insanely hard, is it possible, how long minimum should it take, can it be maintained, and is it realistic? Thanks.\n\nBest,\n\nQMark",
        "created_utc": 1526580940,
        "upvote_ratio": ""
    },
    {
        "title": "Bad Opsec? Publishing 1000 attendees names from a 2 day conference",
        "author": "Infinite_Reading",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k5yfm/bad_opsec_publishing_1000_attendees_names_from_a/",
        "text": "https://agileandbeyond2018.sched.com/directory/attendees/2\n\nI've never seen a conference do this: publish every attendees' name.\n\n2 day conference.\n\nI believe there was no way to opt out of this.\n\nI feel like this is horrible opsec. At a minimum because of things like http://pleaserobme.com/\n\nWhat are you thoughts? Ever seen a conference public publish every attendee with no opt out?",
        "created_utc": 1526577346,
        "upvote_ratio": ""
    },
    {
        "title": "Enterprise Endpoint Protection",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k4wth/enterprise_endpoint_protection/",
        "text": "I am in the process of researching endpoint protection for our enterprise.  I am purposely trying to avoid interaction with sales people so thought I'd get some input from other security professionals.  We are looking for something that doesn't have a lot of overhead requiring an FTE.  Ideally we'd like great reporting and visability.  Eventually we'd like to forward logs to a SIEM.  What solutions have people felt worthwhile? ",
        "created_utc": 1526569320,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best road to get a job at big compaanies like symantec,kaspersky...",
        "author": "nikolax99",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k408q/what_is_the_best_road_to_get_a_job_at_big/",
        "text": "Hi best community.\n\ncan anyone here works at a big company AV like symantec... or someone has an experience on a such job light us the road to work  as malware analysis at these companies.\n\nThanks in advanced",
        "created_utc": 1526561511,
        "upvote_ratio": ""
    },
    {
        "title": "Devil’s Advocate against password managers?",
        "author": "kinoshitajona",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k1cj9/devils_advocate_against_password_managers/",
        "text": "Anyone have any good arguments against password manager use?\n\nAlso, if you know a good argument, but also know the rebuttal that negates it I would live to hear it.\n\nI figured you could help me crowdsource any and all arguments so I can sort of prepare myself for any possible pushback.\n\nAny rebuttals you can provide will save me time in trying to piece together rebuttals on my own and are greatly appreciated.\n\nThanks in advanced.",
        "created_utc": 1526530605,
        "upvote_ratio": ""
    },
    {
        "title": "I think I found my pathway of python networking books",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8k020e/i_think_i_found_my_pathway_of_python_networking/",
        "text": "Step 1: CCENT and JCINT\n\nStep 2: review python programming\n\nStep3: practical network automation- https://www.amazon.com/gp/aw/d/1788299469/ref=pd_aw_fbt_14_3?ie=UTF8&amp;psc=1&amp;refRID=MVD1D84WJ7VES7KJQWSY\n\nStep 4: network programmability and automation- https://www.amazon.com/gp/aw/d/1491931256/ref=pd_aw_fbt_14_img_2?ie=UTF8&amp;psc=1&amp;refRID=MVD1D84WJ7VES7KJQWSY\n\nStep 5: Mastering Python networking\n\nAnd by then I can start learning web exploitation right? Obviously I have to learn computer security and Linux basics too right?\n\n But just just in terms of networking, good start right?",
        "created_utc": 1526518121,
        "upvote_ratio": ""
    },
    {
        "title": "USB drop test software?",
        "author": "networkedquokka",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8jz5u9/usb_drop_test_software/",
        "text": "Core Impact looks like an amazing package, but pricey. What are some other USB drop test packages that are less expensive ($200) that will perform simple reporting such as machine name/ip/time device was plugged into a computer?",
        "created_utc": 1526510088,
        "upvote_ratio": ""
    },
    {
        "title": "SOC2: Exactly who does the SOC2 audits?",
        "author": "LapTing2351",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8jz4be/soc2_exactly_who_does_the_soc2_audits/",
        "text": "I was reading online about how SOC2 audit requirements are flexible depending on the company. Does that mean that if I'm a company, I can have different SOC2 reports from different customers who might want to use me?",
        "created_utc": 1526509715,
        "upvote_ratio": ""
    }
]