[
    {
        "title": "Can you get in trouble with the law for publishing exploits or other \"hacking tools\"?",
        "author": "Knight_of_the_Stars",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88jkzx/can_you_get_in_trouble_with_the_law_for/",
        "text": "Occasionally for the penetration testing portions of my job/hobbies I develop custom exploit code or tools to help out. I know there are a lot of ways to share them online, but I've been hesitant because I know nothing about legality. Can you get in trouble with the law for publishing stuff like that?\n\nI'm in the US btw.",
        "created_utc": 1522512163,
        "upvote_ratio": ""
    },
    {
        "title": "Advanced WiFi Pentesting Webinar - Registrations Open",
        "author": "i_rsX",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88ik9l/advanced_wifi_pentesting_webinar_registrations/",
        "text": "3 days ago I asked you guys about a webinar on Advanced WiFi Pentesting techniques [here](https://www.reddit.com/r/AskNetsec/comments/87r25y/anyone_interested_in_advanced_wifi_pentesting/) \nThe thread quickly climbed to the top-2 of all-time. Needless to say people were highly interested. \n\nWebinar is now open for registrations. Here is a quick reminder of the topics to be covered during this 4-part Webinar series.\n\n[Advanced WiFi Pentesting Webinar](https://rootsh3ll.com/advanced-wifi-pentesting-webinar/) - Topics:\n\n1. Creating custom Captive Portals/Splash Pages (a webpage popup when you connect to WiFi, like starbucks)\n2. Using a Simple Rogue AP to fetch Cleartext WPA2 Passphrases on a scale (i.e from a single victim)\n3. Fixing \"No Internet Access\" error on victim device, so that mobile clients never gets disconnected automatically.\n4. Using a single NIC as Client + Access Point simultaneously. Imagine Connectify.\n\nPart 1 is scheduled on **April 4th, 10:00 PM IST**\n\n[Sign up for the free webinar series here](https://rootsh3ll.com/advanced-wifi-pentesting-webinar/)\n\n&gt; **NOTE**: Recordings and notes will be provided to the registrants via email to download.\n\n\n-Harry",
        "created_utc": 1522502300,
        "upvote_ratio": ""
    },
    {
        "title": "Make Samba Honeypot look legit",
        "author": "Teilchen",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88hhxa/make_samba_honeypot_look_legit/",
        "text": "Currently trying to build an internal Samba honeypot, but the [Permissions](https://imgur.com/4kMXm0y) are giving it away. Any way to add the regular users, e.g. SYSTEM, PC-NAME\\ADMINISTRATOR etc?  \nBesides that and matching the OS strings, is there anything else I have to watch out for?",
        "created_utc": 1522486845,
        "upvote_ratio": ""
    },
    {
        "title": "what are the best CTF challenges?",
        "author": "shiranaize",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88guzq/what_are_the_best_ctf_challenges/",
        "text": "What are some good and up to date ctf challenges? ",
        "created_utc": 1522476903,
        "upvote_ratio": ""
    },
    {
        "title": "How does OPSEC relate to security culture and vice versa?",
        "author": "Irkutsk2745",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88gupw/how_does_opsec_relate_to_security_culture_and/",
        "text": "",
        "created_utc": 1522476780,
        "upvote_ratio": ""
    },
    {
        "title": "What programming/coding tools and platforms do you think are best and would recommend to others?.",
        "author": "StealthyRemington",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88fulb/what_programmingcoding_tools_and_platforms_do_you/",
        "text": "What is your go-to program/tool to use as a platform to input your code, develop, work on projects and etc?.",
        "created_utc": 1522464442,
        "upvote_ratio": ""
    },
    {
        "title": "What Device Do UK (or any nation's) Police Use To Download Data From Your Phone?",
        "author": "Ask-Netsec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88bzrx/what_device_do_uk_or_any_nations_police_use_to/",
        "text": "http://www.dailymail.co.uk/sciencetech/article-5558511/Police-download-phones-data-minutes-NO-warrant.html",
        "created_utc": 1522430139,
        "upvote_ratio": ""
    },
    {
        "title": "First steps made - where to go from here",
        "author": "darksergeant",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88aetk/first_steps_made_where_to_go_from_here/",
        "text": "Hi. First of all, this is not at all my forte. I'm employed at a small agency that does websites and 'apps' (nothing sophisticated really, mostly just wrapped up HTML/JavaScript) and haven't ventured very far into pentesting etc. We've started a little side-track recently of tightening our sites' security and getting more knowledgeable about infosec, so we've been toying around a bit. There's heaps of tools around, and using them is not the issue, I think, it's more like we're lacking the 'big picture' that organizes the entire process of recon, information gathering etc.\n\nWe're trying to put on the hacker's hat and pentest our own sites. So far this is what we've done. (For clarification, the site in question resolves to an IP on which a couple other sites are hosted.)\n\n* NMAP scan the machine on which the websites are hosted\n* dirb scan a website, which yields some existing URLs\n* collect some email addresses that are visible on the public website\n* see that the site uses TYPO3\n\nNow, what would a hacker or professional pentester do next? Cross-reference open services revealed by NMAP with a vulnerability database? Try to detect which version TYPO3 is used and see if there are any vulnerabilities? Or rather attempt a phishing or social engineering campaign on the e-mail addresses gathered? It seems like any of these routes could lead to something, but it's hard to gauge which one is most promising.",
        "created_utc": 1522417309,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on MSSP work?",
        "author": "ANAL_BUM_COVER_4_800",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8878kd/thoughts_on_mssp_work/",
        "text": "What are your thoughts on working in a tier II/III role in a managed security service environment? I am considering accepting a role offered to me that promises threat hunting and IR experience, but I have heard mixed things about MSSP work in general. Thoughts?",
        "created_utc": 1522378200,
        "upvote_ratio": ""
    },
    {
        "title": "Privacy Conscious Employee Inquiring About Security Clearances",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8863hl/privacy_conscious_employee_inquiring_about/",
        "text": "[deleted]",
        "created_utc": 1522367395,
        "upvote_ratio": ""
    },
    {
        "title": "Facebook Login for other sites hit by data breach",
        "author": "AudioBoss",
        "url": "https://www.reddit.com/r/AskNetsec/comments/885qch/facebook_login_for_other_sites_hit_by_data_breach/",
        "text": "Myfitnesspal was recently (February, they just now noticed) hit by a databreach. Hackers got passwords, emails, etc. If I signed up for an account with their facebook option, do I have to worry about anything?",
        "created_utc": 1522364193,
        "upvote_ratio": ""
    },
    {
        "title": "Question About PWK/OSCP",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/884oia/question_about_pwkoscp/",
        "text": "[deleted]",
        "created_utc": 1522355521,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for PenTesting Help",
        "author": "MrHoosFoos",
        "url": "https://www.reddit.com/r/AskNetsec/comments/884bfm/looking_for_pentesting_help/",
        "text": "All,\nLooking for help with pen testing services in the Chicago area....\nWe are a small shop, and have engaged with testing partners for standard external pen test stuff... even a little social engineering tests. \nWe are now looking for some help, and have someone do some testing inside our network; checking for vulnerable servers, infrastructure, WiFi, etc. and then provide a report with remediation guidance...\nWe don’t really know too many people to ask for stuff like this, and figured I would ask here aside from just asking Google;\n\nThanks!",
        "created_utc": 1522352843,
        "upvote_ratio": ""
    },
    {
        "title": "Unauthorized Wireless Access Points",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8834sd/unauthorized_wireless_access_points/",
        "text": "What tools are people using to scan for unauthorized wireless access points connected to their physical network? ",
        "created_utc": 1522344186,
        "upvote_ratio": ""
    },
    {
        "title": "Basic question - Password Managers? Really?",
        "author": "3xAmazing",
        "url": "https://www.reddit.com/r/AskNetsec/comments/882rc7/basic_question_password_managers_really/",
        "text": "I'm not at all a security professional, but the recent Facebook story along with various hacks of people I know have raised my interest in strengthening my online security.  I visited haveibeenpwned.com, then went to Troy Hunt's personal blog where I found a 2014 post advocating the use of a password manager.  I started digging around in more recent content and saw several password managers that redditors recommend.\n\nCan you help me, someone without expertise in the field, understand how having 1 password linking to ALL of my critical passwords is safe?  What is to prevent someone from brute-forcing my password to get access to everything?  Or hacking into the underlying app itself to get access to everything?  How can I trust my security to one company, when so many companies consistently fail to protect user data?\n\nI really want to make the leap as otherwise password managers seem sensible.  I just haven't been able to swallow the final pill.  Any thoughts, or resources, would be much appreciated.",
        "created_utc": 1522341542,
        "upvote_ratio": ""
    },
    {
        "title": "How to use Invoke-Kerberoast?",
        "author": "Komcor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/882nlx/how_to_use_invokekerberoast/",
        "text": "Maybe I'm doing something wrong, but I don't see it in powersploit anymore, so I downloaded the .ps1 file [here](https://gist.github.com/interference-security/e18ffa52f1f8199873b751f0ad14917a) but it doesn't seem to be working when I run it with any of the switches. ",
        "created_utc": 1522340820,
        "upvote_ratio": ""
    },
    {
        "title": "How to handle out of date OS deployments?",
        "author": "SecEmpMinion",
        "url": "https://www.reddit.com/r/AskNetsec/comments/881vfc/how_to_handle_out_of_date_os_deployments/",
        "text": "So for example, you get brought into some compamy that's been operating the same way for 30 years. They have a bunch of Linux deployments that are out of date in multiple levels (kernel, applications, etc.). They don't want to upgrade because it will break things. They can reach the internet (but are not internet facing), unmonitord, and many of the users (developers, test engineers) have root access or elevated priveleges. \n\nHow would you handle this? Would it be different from Windows?\n\nMy personal viewpoint is network segmentation and removing root/elevated privileges on vulnerable machines.\n\nI would like to completely remove internet access. Especially on machines where users are full root. But im not sure if that is considered an overkill.\n\nIs that a good strategy? ",
        "created_utc": 1522335017,
        "upvote_ratio": ""
    },
    {
        "title": "Authentication over multiple web pages. Is it secure?",
        "author": "Curky08",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88190d/authentication_over_multiple_web_pages_is_it/",
        "text": "Is there any security advantages with a quick authentication process on a website? So is it more secure with only one query to a database compared to multiple queries to a database?\n\nI.e. username and password on one page of a website. Which would have only one query to the database to check credentials.\n\nCompared to an authentication process over multiple pages such as username on one page- query, second page for the password- query, third page with an answer of a security question-query? \n\nI know it’s a bit of an inconvenience to the end user having to waste time over multiple pages but I just wasn’t sure if this would cause a security weakness. \n\nI noticed when you sign into google, it has something similar. You first enter your email address, it then checks if there’s an account first before having to enter your password. \n",
        "created_utc": 1522330097,
        "upvote_ratio": ""
    },
    {
        "title": "Nmap: is there a --open, but for scripts?",
        "author": "bleufoxx22",
        "url": "https://www.reddit.com/r/AskNetsec/comments/880z5g/nmap_is_there_a_open_but_for_scripts/",
        "text": "Whenever I run an Nmap script it will always output the 'Nmap scan report for $IP' even if that IP failed the script. This makes it hard to parse through the results for positive hits on the script. Is there an way to have results not show up if they failed the script or a better way of removing them from my results?",
        "created_utc": 1522327675,
        "upvote_ratio": ""
    },
    {
        "title": "How do you POC a FIM solution?",
        "author": "alcon835",
        "url": "https://www.reddit.com/r/AskNetsec/comments/88093k/how_do_you_poc_a_fim_solution/",
        "text": "Going to look at FIM solutions later this year, but I'm not really sure how to meaningfully POC them. How do I reasonably POC a FIM tool - especially the security it provides?",
        "created_utc": 1522320001,
        "upvote_ratio": ""
    },
    {
        "title": "I keep having issues with network interfaces for my target VMs when I boot them up in VMware Workstation 14 Pro.",
        "author": "WadeEffingWilson",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87zbgl/i_keep_having_issues_with_network_interfaces_for/",
        "text": "I apologize if this doesn't sound like a security question but it is somewhat security related as it is in regards to target VMs I download from VulnHubs.\n\nI load the VMs into VMware and boot them up but during the bootup process, I'll get [ FAILED ] when it tries to bring up the network interface(s). I make sure that it is configured for Host connectivity on the interface. I have tried turning the VM off, removing the adapter, adding it back again with the same settings, and booting the VM but I get no change.\n\nIs there something that I am doing wrong? I know that setting up the environment is an important part of pentesting but there is a growing number of VMs that I can't use since I can't get network connectivity.\n\nBefore anyone asks, I make sure that it isn't working by running an nmap scan on the subnet. I rounded the corners as best as I could before coming here to ask.\n\nIf it matters any, I am running Windows 10, I am 6' tall, and I am a Taurus. I also have a vat of virgin's blood and a chicken born under a new moon, if that's needed. I've tried everything else.\n\nWhat might I be doing wrong?",
        "created_utc": 1522307751,
        "upvote_ratio": ""
    },
    {
        "title": "Which specialization at Uni would be best for cybersecurity (pentesting)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87z9xs/which_specialization_at_uni_would_be_best_for/",
        "text": "[deleted]",
        "created_utc": 1522307176,
        "upvote_ratio": ""
    },
    {
        "title": "JSON in AES ECB Padding Oracle",
        "author": "dejormo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87wt0x/json_in_aes_ecb_padding_oracle/",
        "text": "Hi guys, I am working on a padding oracle issue where I have an ability to inject random strings into the oracle through a POST request body and then compare the output to the hex string to figure out which are present. \n\nFor example, if the original encoded payload is *{\"id\":12345678910}* I can inject into oracle *34567891* and then by comparing the hash identify that *34567891* is present in the encoded string. However, when I try in inject *\"id\":12* it comes back with a different hash. What is going on with special characters in this scenario?\n\nI am using Python's Requests library to interact with the server.",
        "created_utc": 1522281475,
        "upvote_ratio": ""
    },
    {
        "title": "How many Nessus scanners do you have vs IP addresses?",
        "author": "cissphopeful",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87w8ta/how_many_nessus_scanners_do_you_have_vs_ip/",
        "text": "We just bought Nessus/Security Center. Their proserv people are telling my security team that they need one scanner per 1,000 IP addresses. Seems a bit excessive to me, we have 40,000 IP addresses and they said 38 VMs would be ideal. I've come from Rapid7 Nexpose shops where we've run 72,000 IP addresses on 6-10 distributed scanners.",
        "created_utc": 1522276613,
        "upvote_ratio": ""
    },
    {
        "title": "Password spraying",
        "author": "poppopretn",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87vys3/password_spraying/",
        "text": "Is there a way in Server 2016/2012 to prevent using certain words in a users password on Windows domains? For example, Winter, Summer, Spring, Autumn company name, users first name, etc? Also, any generic tips for defending against password spraying aside from having a low lockout count, 10 chars, special chars, etc?",
        "created_utc": 1522274285,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have an infosec blog? Do you have any tips on starting one?",
        "author": "beatnikbeet",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87vurw/do_you_have_an_infosec_blog_do_you_have_any_tips/",
        "text": "",
        "created_utc": 1522273410,
        "upvote_ratio": ""
    },
    {
        "title": "Global Network Monitoring",
        "author": "__decrypt__",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87vnyh/global_network_monitoring/",
        "text": "Is there any way to monitor what's going on in the entire network? Bandwidth consumption, communication on ports between nodes, connectivity test between nodes, ...?  \n\nFoun sFlow which looks somewhat promising, but I was hoping for something free. I'm asking as I got tasked with helping debug a client's network and I'm somewhat baffled on how to gain some actual insight on what could be causing trouble.  \n\nIs there even a software out there that I can run from a node or will I somehow have to connect something in between the router and switches? If so what hardware + software would be used &amp; how would I coordinate the multiple hardware endpoints to gain insight?  \nAny pointers welcome! (pls no wireshark tho)",
        "created_utc": 1522271885,
        "upvote_ratio": ""
    },
    {
        "title": "Security issue--help!",
        "author": "manonfire1001",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87v0xp/security_issuehelp/",
        "text": "It will be clear that I am not a sys admin or have any technical knowledge but am looking for advice.\n\nI work in education. I work offsite from the main building and use a private internet connection. While logged in to active directory using my login, another employee logged into their  own gmail/google chrome account. He remained logged into chrome and was able to access my work email from a different computer because google chrome (under his account) had saved my passwords. My question is, could network security at head office tell that this person was logged into his own chrome and gmail account under my login, or would the personal account info be hidden and they would just know that someone signed into chrome/gmail&gt;",
        "created_utc": 1522267175,
        "upvote_ratio": ""
    },
    {
        "title": "Settle a theoretical bet: Running AV in docker",
        "author": "Allthingsworkrelated",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87uxma/settle_a_theoretical_bet_running_av_in_docker/",
        "text": "Got into a discussion with a buddy about running AV inside of a Docker container to support protecting the underlying OS for systems that have controls in place that will not allow the AV system to run. This is a stupid situation, but we are hitting a political wall and decided to have fun with it.\n   \n\nMy thought is that the Docker image/container won't have the access to the underlying OS since Docker utilizes system calls (which are limited) instead of running directly on the kernel.\n\nIf I put a known malicious PE on the system, it may be able to detect it via filesystem passthrough, but would it detect the execution of the program?\n\nThis is on a private Linux distro that is very similar to RHEL.\n\nThanks!",
        "created_utc": 1522266463,
        "upvote_ratio": ""
    },
    {
        "title": "What is the current state-of-the-art SOP for phishing operations?",
        "author": "lonejeeper",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87uu63/what_is_the_current_stateoftheart_sop_for/",
        "text": "This sort of thing is just outside my wheelhouse, but I'm trying to think through their process a bit.\n\nSo Phishers mass email from a list, whether that's scraped or bought doesn't really matter to me right now.\n\nYokels click their link and enter their creds.\n\nPhishers now have those creds. Here's where I start to guess. \n\nI assume they've got automation of some kind, based on how quickly they go from Yokel clicking login and Phisher shipping email.  Any idea what that looks like?  How susceptible would they be to honeypotting to help us discern which Yokel gave away his creds?  \n\n",
        "created_utc": 1522265742,
        "upvote_ratio": ""
    },
    {
        "title": "Linux Distro for Honeypot",
        "author": "Teilchen",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87umnr/linux_distro_for_honeypot/",
        "text": "Been looking at [Canary](https://canary.tools) lately and wondering what kind of Linux distro they use or if there are any recommendations regarding a Linux distro that is slimmed down aka secure innatively. Kinda feel unwell with just using Debian for a task like this.",
        "created_utc": 1522264162,
        "upvote_ratio": ""
    },
    {
        "title": "What makes duckduckgo a secure search engine?",
        "author": "begooboi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87tnj9/what_makes_duckduckgo_a_secure_search_engine/",
        "text": "As the question reads what makes duckduckgo a secure search engine. In my knowledge they didn't carry out any third party auditing of their software and infrastructure. Then how duckduckgo became equalent to a secure, non tracking and privacy oriented search engine.\nSee TOR, it is funded mostly by US navy and other US goverment agencies. I also read somewhere that some TOR developers has knowingly added codes so that these agencies can monitor the users. Why cant duckduckgo be a similar kind of system?",
        "created_utc": 1522257101,
        "upvote_ratio": ""
    },
    {
        "title": "SMB Windows Share Honeypot",
        "author": "Teilchen",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87td7d/smb_windows_share_honeypot/",
        "text": "Been looking a lot into setting up internal honeypots lately to evaluate if the network's being tampered with. Found some great tools so far, how ever nothing that can build a SMB network share honeypot and document who's trying to access / copies the files. Any pointers?  \nedit: Or will I need to setup a Docs document [with tracking](https://youtu.be/FTlvWLd-M2c?t=1990)?",
        "created_utc": 1522255060,
        "upvote_ratio": ""
    },
    {
        "title": "Book on SIEM Deployment",
        "author": "basara",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87su8m/book_on_siem_deployment/",
        "text": "Hey everybody,\n\nI was wondering if anybody has a recommendation for a good book about SIEM Deployment ? \n\nI'm looking into deploying a SIEM and i'd like a generalist book not tied to a specific solution.\n\nThanks !",
        "created_utc": 1522251192,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts about Veracrypt vs. LUKS",
        "author": "3AGLE_OF_SURVEILLANC",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87ssil/thoughts_about_veracrypt_vs_luks/",
        "text": "I am interested what you guys prefer as virtual partition encrypton tool . I have been using VC since it came out . But when I informed myself about LUKS I got some conflicting information on this topic . Mainly on the security aspect . Since I know that VC is a fork of Truecrypt and built upon a Truecrypt build that was audited , I do not think that it is insecure in any way . \nBut I wanted some of your thoughts on the topic . What do you think is more secure / private ( and why ) .  What are your main pros and cons ? Besides the obvious ones like VC being cross platform . ",
        "created_utc": 1522250819,
        "upvote_ratio": ""
    },
    {
        "title": "EMET Retirement from Windows 10",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87smog/emet_retirement_from_windows_10/",
        "text": "Many people weren't happy of the retirement of EMET from Windows 10.  What I've heard as that many but not all of the features would be built into Windows 10.  Does anyone know of a good write-up where this is discussed in detail? I'd like to learn more about the changes.  Thanks!",
        "created_utc": 1522249534,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone interested in Advanced WiFi Pentesting Webinar?",
        "author": "i_rsX",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87r25y/anyone_interested_in_advanced_wifi_pentesting/",
        "text": "A rough list of topics I have in mind:\n\n1. Creating custom Captive Portals/Splash Pages (a webpage popup when you connect to WiFi, like starbucks)\n2. Using a Simple Rogue AP to fetch Cleartext WPA2 Passphrases on a scale (i.e from a single victim)\n3. Fixing \"No Internet Access\" error on victim device, so that mobile clients never gets disconnected automatically.\n4. Using a single NIC as Client + Access Point simultaneously, imagine Connectify.\n\nedit: Please be precise in **What topic(s) are you interested in?** \n\nSuggestions are also welcome!\n\n-Harry",
        "created_utc": 1522235594,
        "upvote_ratio": ""
    },
    {
        "title": "Any good YouTube channels about Cybersecurity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87p93l/any_good_youtube_channels_about_cybersecurity/",
        "text": "[deleted]",
        "created_utc": 1522212842,
        "upvote_ratio": ""
    },
    {
        "title": "Sharing Bookmarks",
        "author": "ragecrits",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87o3dh/sharing_bookmarks/",
        "text": "Hello all,\n\nWas wondering if anyone fancied sharing some of their bookmark collection? Would love to get an insight into what other NetSecs have found through the years and hopefully use that extra knowledge.\n\nThanks all! ",
        "created_utc": 1522201194,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to allow ssh connection from an ssh connection to a Security Onion box.",
        "author": "JohnnyWallstreet",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87o28b/trying_to_allow_ssh_connection_from_an_ssh/",
        "text": "So this is very unique situation I'm in. I need to ssh into a Security Onion box from an ipv6 address. The only way to allow ssh connections to a Security Onion box, that I'm aware of, is the so-allow script. However, as far as I can tell this only green lights ssh connections based off of ipv4 address. Any idea what I can do here?",
        "created_utc": 1522200894,
        "upvote_ratio": ""
    },
    {
        "title": "Detection of BadUSB ?",
        "author": "alewis888",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87n6o4/detection_of_badusb/",
        "text": "Hi, is there a way on linux to detect badusb devices ?",
        "created_utc": 1522193085,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice - career path",
        "author": "ThrowAwayCyberSec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87mz7h/looking_for_advice_career_path/",
        "text": "Hi everyone. I am currently stuck between two great opportunities. I am a recent college grad with my major in information security, with a concentration in network security. I have obtained my CEH last fall and currently finishing up my CCNA studies. \n\nI am currently working at a medium sized software company as a network administrator. I have voiced my opinion into moving into a security focused role, and my employer has offered an opportunity.  Although the pay is not much, I would gain a lot of experience here building up the security department. They have offered to pay for my training courses, certifications, and guide me through my career.\n\nOn the other hand, I have another job offer from a Forbes top 10 company. The pay will be significantly higher and I'll be able to learn some really cool things. \n\nI'm torn between these two opportunities. To those who work at smaller companies, how do you like it? Vice versa for those who work at large corporations. Will I learn more in a small environment? All answers are welcomed! ",
        "created_utc": 1522191305,
        "upvote_ratio": ""
    },
    {
        "title": "How to check logs for Ncrack attempt?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87mn92/how_to_check_logs_for_ncrack_attempt/",
        "text": "[deleted]",
        "created_utc": 1522188515,
        "upvote_ratio": ""
    },
    {
        "title": "Does vulnerable code wrapped in secure code protect against exploits?",
        "author": "SecEmpMinion",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87m7ek/does_vulnerable_code_wrapped_in_secure_code/",
        "text": "I got into this debate with a friend online. He is suggesting that if you have vulnerable C code that has exploits (like buffer overflows) and wrap it in java code that is secure (so that the user only interfaces with the java), the vulnerabilities can't be exploited. \n\nI feel like this is wrong, but I want a outside opinion. If there is a terminology for this i can do research on too, that would be great. ",
        "created_utc": 1522185000,
        "upvote_ratio": ""
    },
    {
        "title": "I open ports and im worried",
        "author": "guardsbank",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87lsnk/i_open_ports_and_im_worried/",
        "text": "Hello after some years of hard work i started hosting a game, i have a dedicated pc at home so i host it there\nMy Games erver have around 15 players at peak times.\n\nThere are some dudes on my discord saying that the will steal my data and all that.\n\nIm kinda worried to be honest and this is what ive done, \n\nI setup w10 firewall to block inbound and outbound  EVERYTHING  (some kind of whitelist i guess) then i add a rule for the server application. I think this is called brick the computer\n\nWhenever i launch the server and go to cantypuseeme.org  it says port is open\n\nIf i close the server and check it again it says it cant see the port. \n\nSo what are the actuall risks of open a port and host a server? \n\nWill the computer be safer if i just block everything but the server? \n\n\nIm being paranoid? :(\n\n\n\n\nThanks! ",
        "created_utc": 1522182059,
        "upvote_ratio": ""
    },
    {
        "title": "What to do next? OSCP, OSCE?",
        "author": "trailingslashes",
        "url": "https://www.reddit.com/r/netsecstudents/comments/87jnm9/what_to_do_next_oscp_osce/",
        "text": "",
        "created_utc": 1522176389,
        "upvote_ratio": ""
    },
    {
        "title": "Home network subjected to LDAP DDoS attack this morning",
        "author": "_scott",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87ko78/home_network_subjected_to_ldap_ddos_attack_this/",
        "text": "As stated in the title it seems that my home network was either subjected to or acted as an amplifier in an LDAP DDoS attack.  \n\nRoughly around 04:00 my wifi connection on my phone reported that it could no longer access the internet.  I checked my connection from a hardwired PC and found that it was also unable to connect.  I power cycled my modem and regained my connection for a few seconds before it went down again.  Finally, I logged into my pfSense (v2.4.2) router and found that the inbound bandwidth on my WAN was pegged so I started checking logs.  SNORT reported a non-stop flow of \"(spp_frag3) Fragmentation overlap\" detections.  Following is a snippet of the almost 84 page log that was generated...\n\n&gt; 03/27/18-05:41:28.438056 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13853,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:28.452319 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13854,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:28.453023 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13854,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:28.910383 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,181.57.138.27,389,myPublicIP,16999,27532,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:29.362435 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.145.52.52,389,myPublicIP,5283,9030,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:29.951973 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13862,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:30.963686 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,58402,13872,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:30.965443 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,58402,13872,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:33.940708 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30660,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:33.941332 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30660,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:33.941457 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30660,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:33.941770 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30660,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:33.943103 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30660,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:35.562359 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,181.57.138.27,389,myPublicIP,58402,27540,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:35.566277 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,181.57.138.27,389,myPublicIP,58402,27540,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:35.566780 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,181.57.138.27,389,myPublicIP,58402,27540,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:35.569241 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,181.57.138.27,389,myPublicIP,58402,27540,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:36.508348 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,181.57.138.27,389,myPublicIP,16999,27541,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:36.849140 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13907,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:36.851142 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13907,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:36.851391 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13907,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:37.712077 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,47613,30686,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:37.712201 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,47613,30686,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:40.355014 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,47613,30700,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:40.355584 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,47613,30700,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:40.357802 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,47613,30700,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:40.378691 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30701,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:40.381107 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.85.147.93,389,myPublicIP,58402,30701,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:41.409739 ,123,8,1,\"(spp_frag3) Fragmentation overlap\",UDP,190.144.74.62,389,myPublicIP,5283,13944,Generic Protocol Command Decode,3\n&gt; \n&gt; 03/27/18-05:41:43.408512 ,123,4,1,\"(spp_frag3) Fragment packet ends after defragmented packet\",UDP,45.249.10.118,0,myPublicIP,0,21746,Attempted Denial of Service,2\n\nThe only firewall rule I have defined on my router is to allow a single OpenVPN connection to my network for when I am not at home.  My network consists of numerous Windows 10 PCs, a few RPi3s running LibreElec, a few common IoT devices (Nest, Wemo, Blink, Dot, etc) and finally a file server running Windows Server 2012 r2  (legitimate DreamSpark license).\n\n\nWould one of my devices have to be compromised to become a victim or amplifier for this sort of attack or is it possible that this was just a random occurrence of protocol abuse?  Also, does it appear that my router absorbed the attack or is it possible that it was able to forward the packets to the various destination ports?\n\nAny insight is really appreciated!  Thanks!\n\nEdit:  Readability of log snippet",
        "created_utc": 1522174214,
        "upvote_ratio": ""
    },
    {
        "title": "Reverse shells/Metasploit and arrow keys question",
        "author": "broadsheetvstabloid",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87kfdr/reverse_shellsmetasploit_and_arrow_keys_question/",
        "text": "So I have been playing around with some of the VulnHub vm's as a learning experience. I noticed when I get reverse shells that the arrow keys don't really work. For example if I open a file in vi and try to use the arrow keys, well...forget it. I get some weird characters printed on the screen instead of moving the cursor around. Or if I hit the up arrow to rerun the command I just did, same thing. \n\nIt doesn't matter if I in a \"jailed\" shell, or if I am in a shell that is unjailed, i.e. python -c \"import pty; pty.spawn('/bin/bash')\"\n\nWhat is going on here? Is there a way around this so that the arrow keys work?",
        "created_utc": 1522172487,
        "upvote_ratio": ""
    },
    {
        "title": "Java vs Python security holes",
        "author": "AlanPleasure",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87jgbo/java_vs_python_security_holes/",
        "text": "I was speaking to a colleague of mine about our company basically refusing to support python for enterprise applications. She thought maybe it was due to security holes but I would think  that using java would be just as much if not more so of a security hole than python considering how much larger of a market uses java as their primary dev environment. Are there any sources that I could look up this kind of info on? ",
        "created_utc": 1522165627,
        "upvote_ratio": ""
    },
    {
        "title": "Nessus and hydra on windows host",
        "author": "rom3ocrash",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87iwbr/nessus_and_hydra_on_windows_host/",
        "text": "nessus work with hydra on windows host ?\nFrom the official tenable post hydra must be installed on the same machine of the nessus and the hydra option will apear un nessus but for windows there is not an installation of hydra, just an exe and other dependecies. i tried to ad da dir of thi exe to the env path and restart nessus but i can see the hydra option on nessus\n\nis this not compatible with nessus installed on windows host or is not more supported by nessus ?\nthx",
        "created_utc": 1522161353,
        "upvote_ratio": ""
    },
    {
        "title": "Opinions on the value of an infosec degree in the future",
        "author": "MarvoloPip",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87ipt5/opinions_on_the_value_of_an_infosec_degree_in_the/",
        "text": "Hi! I wanted to know your opinions on the value of an infosec degree (bachelors) in the future. Would a masters in security become the norm or would a bachelors be enough? Will people require a specific security degree for a security job? Will certificates still hold their value? \nAny comments are appreciated! ",
        "created_utc": 1522159939,
        "upvote_ratio": ""
    },
    {
        "title": "Pentesters - do you usually go depth-first or breadth-first?",
        "author": "noreasterner",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87ihl8/pentesters_do_you_usually_go_depthfirst_or/",
        "text": "Curious to hear about your habits - when scanning/enumerating/exploiting - do you jump on the first opportunity likely to yield the desirable result and jump to the next stage? Or try to exhaust all the options for the current stage (e.g with nmap, dir, sqlmap), building a solid base before moving forward? \n\nAlso as a side note, do you have a specific list of steps you follow which you can share with us noobs?",
        "created_utc": 1522158029,
        "upvote_ratio": ""
    },
    {
        "title": "problems changing router public ip",
        "author": "Redstoner7",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87h017/problems_changing_router_public_ip/",
        "text": "i have a netgrear devg2020 router, when i change my public ip I get an error where it cant connect to my isp, help?\nthe [error](https://imgur.com/a/3qa5P)",
        "created_utc": 1522142267,
        "upvote_ratio": ""
    },
    {
        "title": "I think I found a security flaw",
        "author": "mcommander",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87gke5/i_think_i_found_a_security_flaw/",
        "text": "I think I found a security flaw in one of the web services.\nI can use \"reset my password\" option and receive an email with reset link, then i open it and can navigate through website menu to my account without changing my password.\nBasically this link opens my account with personal data without giving or changing my password.\nLink is single-use only but can be used from another computer (tried even via tor/vpn and can always reach my account and personal data)\n\nHow serious is that?",
        "created_utc": 1522136352,
        "upvote_ratio": ""
    },
    {
        "title": "Fake imgur link? Help?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87fyax/fake_imgur_link_help/",
        "text": "[deleted]",
        "created_utc": 1522128568,
        "upvote_ratio": ""
    },
    {
        "title": "How would a process get root after it knows the root password in Linux desktop",
        "author": "httpsboy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87fy3o/how_would_a_process_get_root_after_it_knows_the/",
        "text": "Linux devs seem to know that Linux desktop is terribly insecure, but the Linux community at large is spreading lies that Linux is more secure than Windows.\n\nI have found many theoretical ways Linux could be exploited just by using Linux, though I'm not a good programmer and confirmed most of them work.\n\nFirst I found is non-root programs were able to key log and worse yet inject key storkes. I found this after using ScreenKey which displays your typed keys on the screen.\n\nI want to know about tools that mitigate this later.\n\n### But first I would like to know how a Linux non-root program that finds out my root password would get root by knowing the passowrd. If there are multiple ways I would like to know as many as I can.\n\nI'm not talking about root escalation in general. I only want to know something I can understand like `Log the sudo password using X protocols. Then run the subcommnad sudo ~/self.py and in the enter the password`.\n\nI'm familiar with a bit of Python.\n\nAll my suspicions have been confirmed by this video https://www.youtube.com/watch?v=-T1LoHTZDvs\n\nFound another great resource on previlige escalation in Linux https://superuser.com/questions/793240/preventing-malware-from-sniffing-the-sudo-password",
        "created_utc": 1522128497,
        "upvote_ratio": ""
    },
    {
        "title": "Question about EC-Councils Storm Mobile Pentest kit",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87ftdc/question_about_eccouncils_storm_mobile_pentest_kit/",
        "text": "[deleted]",
        "created_utc": 1522126908,
        "upvote_ratio": ""
    },
    {
        "title": "Network Security Help!!",
        "author": "Tough_Shower",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87faxg/network_security_help/",
        "text": "Hi  \n  We have a router and internet at work. It seems that someone hacked into the wifi (which we now turned off).  The problem now is that they are able to monitor/see our internet activities in real time.  Eg: What websites we go to, what we type, our passwords to internet sites.  We tried changing computers to see if monitoring software was installed on a particular pc but they can still see what's going on on the new one.  (its basically like they have a mirrored screen of what we're doing on win10).  They have a link that they can give out to give others access to spy on our network.  Can anybody tell what is going on and how to stop it??  Help please.",
        "created_utc": 1522121277,
        "upvote_ratio": ""
    },
    {
        "title": "Secret Clearance with issues, hoping for an interim...thoughts?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87e66e/secret_clearance_with_issues_hoping_for_an/",
        "text": "[deleted]",
        "created_utc": 1522110659,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good resources on writing rootkits for windows 10 or other newer operating systems?",
        "author": "Elias4918",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87dmob/what_are_some_good_resources_on_writing_rootkits/",
        "text": "",
        "created_utc": 1522105871,
        "upvote_ratio": ""
    },
    {
        "title": "Online Training Suggestions",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87clce/online_training_suggestions/",
        "text": "What resources have people found out there that provide a wide range of online training?  I've used Udemy, Linda, and Cybrary. in the past.  Training focused on security is important but also other technologies such as AWS &amp; Scripting would be very helpful to keep up to date with new technology.",
        "created_utc": 1522097424,
        "upvote_ratio": ""
    },
    {
        "title": "Building IDS/IPS",
        "author": "rd_kldp",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87cjk8/building_idsips/",
        "text": "How can we build IDS/IPS other than using snort?",
        "created_utc": 1522097062,
        "upvote_ratio": ""
    },
    {
        "title": "Responder.py mitigation?",
        "author": "sanjurjo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87cfh0/responderpy_mitigation/",
        "text": "Recently I tested the Responder tool (LLMNR, NBT-NS and MDNS poisoner) and it is amazing how can you get user/hashes  from a windows network almost magically. However I can not find reliable information on how to prevent or mitigate this type of tools. If i do disable LLMNR or NBT-NS will break things? Does activating SMB sign improve anything? What else can I do to protect myself from this type of attack?\n\nhttps://github.com/SpiderLabs/Responder",
        "created_utc": 1522096251,
        "upvote_ratio": ""
    },
    {
        "title": "Dll Hijacking - Winmm.dll",
        "author": "secme",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87c9fy/dll_hijacking_winmmdll/",
        "text": "I was writing my own DLL for a vulnerability I found, then while searching one of the errors I found the below... that looks almost identical to my DLL. \n\nhttps://packetstormsecurity.com/files/93108/PuTTY-0.60-DLL-Hijacking-Exploit.html\n\nI can't get that one to compile with MingGW, my one has the \"int hax ()\"  below the declaration. But I still get an error on the load of the EXE that it can't find the entrypoint timeGetTime. Anyone have any ideas?\n",
        "created_utc": 1522095069,
        "upvote_ratio": ""
    },
    {
        "title": "Svchost.Exe 25% cpu usage",
        "author": "guardsbank",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87b2o1/svchostexe_25_cpu_usage/",
        "text": "Ive tried everything that is out there,i stop windows update bla bla, killed the process and it just came back again, then i installed process manager from windows i think thats the name, and one of the multiple svchost.exe the one using 25% had a strange TCP connection established  to a remote ip like\n\n19X.X.Xx.X.static.krypto.com\n\n\nAny clue?\n\n\nI tried to format and still have the same issue\n\nAlso malwarebytes throw an alert and block wanna.crypt mssce.exe process or something like that, how come i dont use that computer its a home server ",
        "created_utc": 1522086324,
        "upvote_ratio": ""
    },
    {
        "title": "Extremely strange network activity after downloading torrents",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87ah9w/extremely_strange_network_activity_after/",
        "text": "[deleted]",
        "created_utc": 1522081896,
        "upvote_ratio": ""
    },
    {
        "title": "Heading to Kuwait for an infosec job.",
        "author": "chown-root",
        "url": "https://www.reddit.com/r/AskNetsec/comments/879qls/heading_to_kuwait_for_an_infosec_job/",
        "text": "So I got my job offer to head that way for a year.   I am interested in recommendations for securing my personal internet access while over there. Any provider/vpns that you guys woulda suggest?  ",
        "created_utc": 1522076256,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find wordlist for most common username and passwords?",
        "author": "grchelp2018",
        "url": "https://www.reddit.com/r/AskNetsec/comments/878lf5/where_can_i_find_wordlist_for_most_common/",
        "text": "I'm hoping there is a somewhat definitive list somewhere that I can use rather than taking it from some random site.",
        "created_utc": 1522066227,
        "upvote_ratio": ""
    },
    {
        "title": "Real World Network Diagram",
        "author": "Fluxay23",
        "url": "https://www.reddit.com/r/AskNetsec/comments/877rba/real_world_network_diagram/",
        "text": "I recently completed setting up a home-lab network from 'Building Virtual Machine Labs: A Hands-On Guide' (https://www.amazon.com/Building-Virtual-Machine-Labs-Hands-ebook/dp/B071G4SCB4) and learnt a lot about the function of IPS, SIEM, firewalls and how they interact to create a secure environment.\n\nI would like to continue to build out a network that would mimic a real-world small-size organization with security and defense-in-depth in mind. I was hoping those with more real-world experience than me could provide some realistic network diagrams for me to model off. I have no idea of the actual architecture a real organization would actually look like, and how accurate examples provided throughout the internet are.\n\nHere is a link to a network diagram that is similar to what I am looking for:\nhttp://d2vlcm61l7u1fs.cloudfront.net/media%2F010%2F010b4021-5244-4c51-82c0-8e723b13a87b%2FphpL48pLC.png\n",
        "created_utc": 1522055779,
        "upvote_ratio": ""
    },
    {
        "title": "Orchestrator: Respond to security alerts completely within one web UI [x-post from /r/netsec]",
        "author": "yaraz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/876kb6/orchestrator_respond_to_security_alerts/",
        "text": "LINK: https://www.getorchestrator.com\n\nI've been working on this product for the last few months. It hasn't been released yet. Is this something you all find useful?\n\nMy goal is to let you respond to security alerts completely without leaving the web interface. You can script common incident response tasks, like \"shut down machine\" or \"disable account\", combine them into workflows like \"contain ransomware\", and run them on your security alerts.\n\nOrchestrator has no learning curve. You write tasks in Powershell and Bash to run on endpoints, in any language to run from the Orchestrator server, and workflows in YAML. It can integrate with any product with a REST API.\n\nI know other security orchestration tools, like Phantom and Demisto, exist. But they force you to build workflows using their visual editors, which slows down experienced security staff. Writing tasks and workflows is a pain, too: see this [this Demisto playbook](https://github.com/demisto/content/blob/master/TestPlaybooks/playbook-Autofocus_test.yml) or [this Phantom task](https://github.com/phantomcyber/playbooks/blob/3.5/customer_firewall_request_handle_artifact.py).=.\n\ntl;dr - check out this website. What feedback do you have for me?\n\nLINK: https://www.getorchestrator.com",
        "created_utc": 1522039998,
        "upvote_ratio": ""
    },
    {
        "title": "Ready for OSCP?",
        "author": "cameronfrittz",
        "url": "https://www.reddit.com/r/AskNetsec/comments/876k45/ready_for_oscp/",
        "text": "Sorry for the unsolicited query for advice, just don't really have anyone to talk to about this. \n\nIm a somewhat technical guy, have worked in TV as a sound engineer for 8 years and am making about 100k a year. I am getting really burnt out with the hours and physicality of the job though. Surprisingly I manage a lot of networks (albeit lans) on the job and really enjoy that type of work. I have been really interested in getting into net sec. When I was in high school I got my net +, and my a+ certs. I also know a fair amount of Java, c and c+. \n\nRecently I have been really interested in getting into net sec. I got the comp Tia internet security textbook written by Mike Myers (which is pretty basic) as a starting point and have been doing some ctfs and familiarizing myself with kali and it's tools. My question for the room is do you think I should continue self studying or should I sign up for a program like OSCP. I have the money and time to do the course but don't know if I need to get myself to a higher level of competence before I plung into the OSCP course? I'm all ears for any advice both academically and career wise! Thanks guys and gals  :)",
        "created_utc": 1522039936,
        "upvote_ratio": ""
    },
    {
        "title": "Why does my LG WebOS TV have a port/security scanning daemon running?",
        "author": "dachsj",
        "url": "https://www.reddit.com/r/AskNetsec/comments/875tqk/why_does_my_lg_webos_tv_have_a_portsecurity/",
        "text": "I did a port scan of my LG smart TV and it has all sorts of things running. One thing of note is a nessus service. My quick googling id'd this as a pen testing tool. I'm trying to understand why my TV would need this. Any ideas? I've unplugged it for now until I can really dig into it tomorrow after work.",
        "created_utc": 1522031883,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly do they ask your references on the SF-86?",
        "author": "dsfjdsfnksdfn",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87590n/what_exactly_do_they_ask_your_references_on_the/",
        "text": "What does the investigator ask your references on the SF-86? Do they ask your references if the person has ever done any drugs? Do they ask your references for other references?",
        "created_utc": 1522026088,
        "upvote_ratio": ""
    },
    {
        "title": "Security Clearance Drug Use",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/874k6q/security_clearance_drug_use/",
        "text": "[deleted]",
        "created_utc": 1522019488,
        "upvote_ratio": ""
    },
    {
        "title": "Secret security clearance for government company...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87433t/secret_security_clearance_for_government_company/",
        "text": "[deleted]",
        "created_utc": 1522015114,
        "upvote_ratio": ""
    },
    {
        "title": "A potentially dangerous Request.Path value was detected from the client (&amp;)",
        "author": "makavelit",
        "url": "https://www.reddit.com/r/AskNetsec/comments/873ye2/a_potentially_dangerous_requestpath_value_was/",
        "text": "I was browsing the web and entered a \"&amp;\" to visit a page, when the following error showed up:\n\n&gt; A potentially dangerous Request.Path value was detected from the client (&amp;) \n\nI researched the error and read that it's associated with cross-site scripting, then I got worried, because I also read that this could be interpreted as someone trying to hack into a website??\n\nI had no intent or knowledge of any of this; I didn't think it was an issue entering an ampersand into a URL since I see them present all of the time. \n\nWhat does this mean for me?",
        "created_utc": 1522013945,
        "upvote_ratio": ""
    },
    {
        "title": "How to go about learning to force a location by zip code in a virtual machine.",
        "author": "Hollowpoint357",
        "url": "https://www.reddit.com/r/AskNetsec/comments/873fdd/how_to_go_about_learning_to_force_a_location_by/",
        "text": "I'd like to run some google searches to see targeted results for particular locations, preferably by zip codes. I don't really know where to begin as far as forcing a virtual machine to report its physical location as what I request. Could someone point me in the right direction or to resources where maybe I can learn to do this?",
        "created_utc": 1522009404,
        "upvote_ratio": ""
    },
    {
        "title": "Patching Read-Only Thin Clients",
        "author": "clayjk",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8713pe/patching_readonly_thin_clients/",
        "text": "What are other people doing to patch thin clients that are setup as read only, i.e., reset to original state after reboot? \n\nWe are getting ready to deploy some new thin clients running win10 and our normal process is to patch workstations monthly but wondering if that is the norm on devices that are R/O and require a full new image to get pushed to update. \n",
        "created_utc": 1521989185,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone interested in learning Web app hacking with me",
        "author": "neglektd",
        "url": "https://www.reddit.com/r/AskNetsec/comments/87120y/anyone_interested_in_learning_web_app_hacking/",
        "text": "I'm starting out to learn web app hacking already signed up on different bug bounty platforms like hackerone, been working on some programs but I can't seem to move forward in my researches so Im thinking it would be great to share such information with others and help each others out, #togetherwehitharder. If you guys are interested hit me up. ",
        "created_utc": 1521988734,
        "upvote_ratio": ""
    },
    {
        "title": "Priviledge Escalation Wordpress",
        "author": "abagi",
        "url": "https://www.reddit.com/r/AskNetsec/comments/870t0h/priviledge_escalation_wordpress/",
        "text": "Hi guys,\n\nI have access to a Wordpress blog and want to read the server's /root directory that belongs to the user \"root\" and not \"www-data\". I also know his password, but I can't open an interactive shell to be even asked about that bit of information..\n\nWell, I have downloaded the plugin WPTerm, with which I can call python scripts or write php files to be executed in the front end, but I run into trouble due to the following issues:\n\n* sudo is not available: sh: 1: sudo: not found\n\n* su does not work: su: must be run from a terminal\n\n* ssh and nc are also not available\n\nIt seems that this webserver runs in a docker environment and the Loginizer plugin tells me, that the server has the private IP Address: \nServer's IP Address \t172.18.0.6\n\nHow the hell do I spawn an interactive shell where I can bypass the \"su: must be run from a terminal\" error message? I seriously have no idea what to do next, maybe some kind of shellcode for php or python would work.\n\nmany thanks in advance!!",
        "created_utc": 1521986144,
        "upvote_ratio": ""
    },
    {
        "title": "Burp Suite Fails To Work With Chrome &amp; Firefox",
        "author": "ShadowGnu76",
        "url": "https://www.reddit.com/r/AskNetsec/comments/870chw/burp_suite_fails_to_work_with_chrome_firefox/",
        "text": "I have Burp Suite setup as a proxy (127.0.0.1:8080)\n\nWhenever I try to go on any page, the page continously tries to load forever and connections close: https://i.imgur.com/4fiHlnb.png - https://i.imgur.com/QKufDyc.png\n\nProxy settings setup like this: https://i.imgur.com/OHjFI0R.png\n\nI have the SSL installed: https://i.imgur.com/UucQBnO.png\n\nWhat am I doing wrong?\n\n",
        "created_utc": 1521980369,
        "upvote_ratio": ""
    },
    {
        "title": "Certification for securely handling private data and intellectual property?",
        "author": "NoFaTe-",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8707vv/certification_for_securely_handling_private_data/",
        "text": "I'm not sure if this is the right place to ask, but here goes:\n\nIf I build a product or service that processes in some way or form private information or intellectual property of my users (with their explicit consent) remotely (on my servers for example), is there any certification or review process that I can get for the entity that operates this product / service (be it myself or a company) that would give confidence to my users by proving I'm following standard practices in regards data security, storage, transmission, removal, etc.? I've been looking at ISO/IEC 27001, but that's a fairly extensive standard covering a lot of areas, so I'm not sure if it's what I need.\n\nI know that Privacy Policies are supposed in most cases to cover those scenarios, but in my eyes they are nothing but words if the methods being employed internally are not somehow reviewed or certified to be secure and privacy-preserving by an authorized and (inter)nationally trusted body (especially in light of the recent revelations about Facebook).\n\nAny thoughts and suggestions would be greatly appreciated!",
        "created_utc": 1521978471,
        "upvote_ratio": ""
    },
    {
        "title": "Modsecurity rule creation.",
        "author": "TomilloDanup",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86zy52/modsecurity_rule_creation/",
        "text": "Hello,\n\nAnyone here using modsecurity and writing rules for virtual patching? I need to learn and go from zero to hero and have gotten a few books on modsecurity. \n\nRight now I'm good at dealing with false positives by adding what I need to the CRS ruleset. But I need to be able to create my own rules more complex and no idea where to start. \n\nSeems the info about there on creating rules is limited and the modsecurity annual is sometimes ambiguous. \n\nAny ideas?",
        "created_utc": 1521974005,
        "upvote_ratio": ""
    },
    {
        "title": "Is there *any* valid reason Wells Fargo limits passwords to 12 characters?",
        "author": "qwerqwerqwerasdf",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86z993/is_there_any_valid_reason_wells_fargo_limits/",
        "text": "This is really true for anyone limiting password length, but I've noticed that Wells Fargo limits passwords to 12 characters. As far as I know hashes will all be the same size so it can't be for storage reasons, right?",
        "created_utc": 1521961559,
        "upvote_ratio": ""
    },
    {
        "title": "Where's a good place to start learning? And what course should I lean towards?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86x6ta/wheres_a_good_place_to_start_learning_and_what/",
        "text": "[deleted]",
        "created_utc": 1521936868,
        "upvote_ratio": ""
    },
    {
        "title": "Dissertation idea",
        "author": "HyperNova786",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86vocu/dissertation_idea/",
        "text": "Hello, Need to come up with some sort of product for my final year dissertation, was thinking of doing something with Social engineering but not sure on what product I could make. Any ideas would be really appreciated. Thankyou",
        "created_utc": 1521922712,
        "upvote_ratio": ""
    },
    {
        "title": "Web app vs. Mobile vs. cloud",
        "author": "xxkasperrrxx",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86v968/web_app_vs_mobile_vs_cloud/",
        "text": "I have a background in Web development, and have been pursuing more education in it, as i find it interesting. My dream job is penetration tester, and  i know that will require some time to achieve. I currently have a raspberry pi 3, and a few virtual boxes running for my lab. Would it be more worth my time to pursue web app, mobile, or cloud for penetration testing? or is it more worth my time to generalize and not specialize? ",
        "created_utc": 1521918909,
        "upvote_ratio": ""
    },
    {
        "title": "How did my info save?",
        "author": "ama3030",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86uvzi/how_did_my_info_save/",
        "text": "So I reset my galaxy s8 and sold it to a friend. However, when he signed into Facebook, facebook suggested my email and number. How did my phone number and email still appear after the phone was reset? ",
        "created_utc": 1521915787,
        "upvote_ratio": ""
    },
    {
        "title": "Bachelor's thesis help",
        "author": "TheNait",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86uv5d/bachelors_thesis_help/",
        "text": "I'm supposed to do my bachelor's thesis this year and I'm interested in centering it around security. I have a decent background in networks, system architecture and administration and right now I'm taking courses on cryptography and software security. \n\nI've been researching on possible projects that are interesting enough and realistic with my knowledge and time (it's supposed to be around 450h of work). I'm curious about penetration testing and I've been thinking about ways to center my thesis around it.\nSo far my idea is trying to build an automated penetration testing tool (with no commercial purpose) as kind of an excuse to get hands on with it and detail the process.\nI wonder though if this is a realistic project for me. Some of the issues that come to mind are the fact that I don't have much practical pentesting experience (although I'd have around 6 months to do the whole project), how I'd perform the testing (would I have to build my own vulnerable environment?) or if I would be able to build a tool that is at least decent starting from scratch.\n\nAny opinions/advice on this? Is it worth looking more into it or should I try to go with something else?",
        "created_utc": 1521915586,
        "upvote_ratio": ""
    },
    {
        "title": "Linux hardening",
        "author": "backwardsthong",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86uq11/linux_hardening/",
        "text": "HI! My experience is from the era where building a new Linux server meant spending hours getting grsecurity/PAX working perfectly with our hardware, tweaking the kernel to remove all unnecessary modules and disabling module loading. We'd chroot each service whenever possible. Etc.\n\nWhat do most of you do these days? I'm thinking selinux+grsecurity. I see AppArmor referenced but haven't used it personally. Are there preferred distros from a hardening perspective?\n\nI'd like to build a public facing server and want to spend time doing it right. ",
        "created_utc": 1521914346,
        "upvote_ratio": ""
    },
    {
        "title": "Investigation theory by Chris Sanders",
        "author": "tayluh21",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86umwd/investigation_theory_by_chris_sanders/",
        "text": "Just wanted to see if any of you analysts out there have taken this course and if you think it's worth the $650? I'm currently considering it due to the recommendation of my current boss.",
        "created_utc": 1521913586,
        "upvote_ratio": ""
    },
    {
        "title": "SOC analyst vs Software dev?? Career guidance needed, please help!",
        "author": "Disgruntled_Tatti",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86tjg6/soc_analyst_vs_software_dev_career_guidance/",
        "text": "Hi, I've been working as a junior SOC analyst using RSA NW for a year (right out of college) and I have an offer from elsewhere for a software dev job. I used to write code in college and even landed a few offers, one of which I did not go through with (coz i didn't like the company) and a couple others were rescinded at the last moment for some reason. So I couldn't find a job for a few months (fresh out of college) and I decided to take this job where I was thrown into SOC. I know it's a growing field with a lot of potential but I have largely just been involved in making excel sheets and preparing reports rather than working with the actual SIEM. I've only so far developed a conceptual overview of what SIEM is (like decoders, concentrators, etc) and I don't even know how to identify XSS or what steps to take to mitigate vulnerabilities coz i'm too busy making the excel sheets and reports that are thrown at me. \n\n\nSo I was doing some coding in my spare time and through a friend I got an interview and eventually an offer as a software dev, where I will mostly be working in javascript. I'm not particularly passionate about software (like I once was) and my algorithm/analytical/coding skills are average at best, but I feel that I will learn more things and actually engage my mind with somthing instead of spending another year next to nothing. Some people are telling me I should stick to SOC as there's going to be a lot of money and opportunity in the future but I'm seeing all my buddies already making twice as much as me in software (and they're the guys I used to help out with their projects in college)\n\n\nI'm at a real crossroads here and my next decision could make/break my life. Please help!",
        "created_utc": 1521903622,
        "upvote_ratio": ""
    },
    {
        "title": "Does Linux+ Have Any Value to Security Jobs?",
        "author": "jigarkhor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86t42r/does_linux_have_any_value_to_security_jobs/",
        "text": "Someone has offered to pass me their Linux+ voucher, and I have permission from Pearson to reschedule the test to have adequate time to study. But I'm sitting here wondering if this certificate would even net me anything in the security world. I currently have Sec+ and have been studying for Pentest+. My linux skills are pretty basic (command line BASH, etc) but I could study up for this if it would benefit me at all.\n\nIn terms of a security position, does Linux+ hold any value? ",
        "created_utc": 1521899383,
        "upvote_ratio": ""
    },
    {
        "title": "Draytek equipment - experiences?",
        "author": "Hellochristmas",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86sxpb/draytek_equipment_experiences/",
        "text": "Have been looking at some networking gear to give to a family member, and it occurred to me that Draytek make some supposedly good devices. I haven’t heard too much about vulns in their software or hacking much recently. This makes me wonder if any of the community have experiences with Draytek routers and whether or not they seem fairly secure? Have you ever done a penetest against them? ",
        "created_utc": 1521897276,
        "upvote_ratio": ""
    },
    {
        "title": "How do banks store passwords?",
        "author": "Hackers-are-bad",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86spg1/how_do_banks_store_passwords/",
        "text": "I have always been told that the best option is hashing the entire password with a salt and then discard the plain-text. This falls apart when I see bank websites, most banks in the U.K. will ask you to enter for example the 3rd,6th,9th and 10th character of your password. The indexes that you are required to supply are randomized every time. I can’t understand how this is possible, I don’t believe that they are storing passwords in plain-text but I don’t know what the alternative is where they can verify individual characters.\n\nCan anyone explain this?",
        "created_utc": 1521894395,
        "upvote_ratio": ""
    },
    {
        "title": "Need help please!",
        "author": "Pixolium",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86ryoo/need_help_please/",
        "text": "I'm trying to make my computer more secure, And i really don't know where to begin, And help would be greatly appreciated ",
        "created_utc": 1521882623,
        "upvote_ratio": ""
    },
    {
        "title": "Would CompTIA courses be worth it for me?",
        "author": "ThePixelCoder",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86rlld/would_comptia_courses_be_worth_it_for_me/",
        "text": "I found a discount on stacksocial for the complete CompTIA pack thing. I'm especially interested in the networking and security courses. I'm just not really sure if it's actually worth it for me, as I'm still in high school. Do you have to be in college to follow these courses or doesn't it matter?",
        "created_utc": 1521876303,
        "upvote_ratio": ""
    },
    {
        "title": "proxychains problem",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86r103/proxychains_problem/",
        "text": "[deleted]",
        "created_utc": 1521867892,
        "upvote_ratio": ""
    },
    {
        "title": "Which network my Kali and vulnhub machine should be connected to ? NAT/ NAT network/ Bridged adapter/ Internal Network",
        "author": "should_be_read_it",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86qx7h/which_network_my_kali_and_vulnhub_machine_should/",
        "text": "",
        "created_utc": 1521866513,
        "upvote_ratio": ""
    },
    {
        "title": "NMAP or better?",
        "author": "phillysliq",
        "url": "https://www.reddit.com/r/AskNetsec/comments/86qmwk/nmap_or_better/",
        "text": "So I was just curious, is NMAP the best enumeration tool, or is there a better tool out there? (silimar to how VIM is much more useful that nano, if you know how to use it?)\n\nOr all they all pretty much situational? In some situations NMAP is better, in others enum4linux is better?\n\nThanks in advance!",
        "created_utc": 1521862982,
        "upvote_ratio": ""
    }
]