[
    {
        "title": "How vulnerable is this industry to automation?",
        "author": "Throwaway_asknet12",
        "url": "https://www.reddit.com/r/AskNetsec/comments/900lhz/how_vulnerable_is_this_industry_to_automation/",
        "text": "Computers have been getting more secure for decades. If we’re being honest with ourselves, 2018 is a much different landscape than 2008 was, and 2008 was a much different landscape than 1998. Is there going to be a limit to how much security can get better or are penetration testing companies and Infosec analysts going to see layoffs in the next twenty/thirty years?",
        "created_utc": 1531956835,
        "upvote_ratio": ""
    },
    {
        "title": "Show to a job interview with vulnerabilities?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/900l3p/show_to_a_job_interview_with_vulnerabilities/",
        "text": "[deleted]",
        "created_utc": 1531956749,
        "upvote_ratio": ""
    },
    {
        "title": "Can you get hacked just by logging into outlook.com (OWA)?",
        "author": "FunSun8",
        "url": "https://www.reddit.com/r/AskNetsec/comments/900kev/can_you_get_hacked_just_by_logging_into/",
        "text": "Assume I have a clean system and am running an up to date browser. If someone sent a malicious email to my outlook email and I log into outlook.com, is it possible for me to get hacked? Even if I don't open the malicious email or interact with it in any way?\n\nAlso, if there are malicious emails in my inbox, should I delete them or could deleting them trigger an exploit?",
        "created_utc": 1531956599,
        "upvote_ratio": ""
    },
    {
        "title": "Best practices on disclosing a vulnerability?",
        "author": "pseudosavant",
        "url": "https://www.reddit.com/r/AskNetsec/comments/900imd/best_practices_on_disclosing_a_vulnerability/",
        "text": "Hey all,\nI’m curious if anyone is aware of any sort of collected best practices/do’s and don’ts etc related to disclosing vulnerabilities to vendors and the public? I think I’m specifically interested in timeline, the structure of a good report, what to do with non-responsive vendors, etc.\n\nI recently discovered a vulnerability allowing an attacker to remotely crash a desktop client in a particular product. I’ve contacted the vendor through their bug reporting program but have received no response or confirmation of receipt.\n\nCurious how others handle the ethics involved here?\n",
        "created_utc": 1531956186,
        "upvote_ratio": ""
    },
    {
        "title": "Need help understanding this intrusive popup.",
        "author": "throwaway20180402834",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zzjah/need_help_understanding_this_intrusive_popup/",
        "text": "Good evening ladies and gents.\n\nI have been having some \"trouble\" with this intrusive popup window for firefox.\nIt is very annoying (go figure) and it blocks firefox from closing the window.\n\nI have tried blocking the address on my router but I can still open it.\n\nI have to use the task manager to kill firefox.\n\nHere's the link to the bloody thing, don't open it unless you know what you're doing I guess.\n\natibits26.club\n\nI have also pinged it and it returned this IP: 107.180.57.160\n\nNot sure what if it's gonna help though, but that is all I could gather.\n\n#\n\nI am very curious about it. How does it work, why/how does it block firefox.\nAnd how do I efficiently stop it?\n\nFurthermore, do I have my computer infected with something? Is this my ISP not giving a shit about me (again)?\n\nEDIT: Also, I wasn't sure where to post this. So if this is not the right place I apologize and could you please point me in the right direction?\n\nEDIT2: Removed the direct link. It does look shady, specially with a throwaway account. Not trying to troll anyone, sorry.",
        "created_utc": 1531948719,
        "upvote_ratio": ""
    },
    {
        "title": "Help with +Ma Reversing",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zypia/help_with_ma_reversing/",
        "text": "[deleted]",
        "created_utc": 1531942865,
        "upvote_ratio": ""
    },
    {
        "title": "HOWTO replay pcapngs on a network?",
        "author": "nationStateHate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zyef9/howto_replay_pcapngs_on_a_network/",
        "text": "tcpreplay? bettercap? \n\nWhat's a good way to do so?",
        "created_utc": 1531940769,
        "upvote_ratio": ""
    },
    {
        "title": "Getting into the infosec field after graduation with SRA degree",
        "author": "SRAGrad13",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zxq2p/getting_into_the_infosec_field_after_graduation/",
        "text": "I will be graduating with a Security and Risk Analysis degree this fall. While it covered basic programming and networking, I don't feel it covered anything in depth enough to prepare me for a job in infosec. What steps can I  take to learn the skills that I need to succeed career-wise? People seem relatively split on entry level certs until you get to the more difficult ones, but are there any recommended websites, books, youtube channels, etc that I can use to practice to better prepare myself",
        "created_utc": 1531936199,
        "upvote_ratio": ""
    },
    {
        "title": "Getting started with honeypots",
        "author": "UCFIT",
        "url": "https://www.reddit.com/r/netsecstudents/comments/8zwiz5/getting_started_with_honeypots/",
        "text": "",
        "created_utc": 1531928117,
        "upvote_ratio": ""
    },
    {
        "title": "Do people write white hat malware?",
        "author": "FallingToFly",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zwg7e/do_people_write_white_hat_malware/",
        "text": "It's a bit oxymoronic with malware by definition being malicious but I was wondering if people ever write software that performs like malware but for more benevolent means.\n\nFor example, and this may show my ignorance, I hear about programs scanning the internet for vulnerable IoT devices and openings onto machines. Could someone not do the same thing and write a program that once it infects those machines in a certain way it makes changes to mitigate that vulnerability?\n\nIt just seems like there's this low hanging fruit for malicious actors that needs to be resolved and we can't rely on the people who have this vulnerable machines to do it whether that's due to not wanting to spend the resources on it or just plain not being aware of it.",
        "created_utc": 1531927551,
        "upvote_ratio": ""
    },
    {
        "title": "CVE Subscription matching vendor/product",
        "author": "OverHippo",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zvl1c/cve_subscription_matching_vendorproduct/",
        "text": "Want to know a vulnerability in any of my products and vendors (f.e. HP gen 10).\n\nDo you know any bulletin mail or service that allow select the subscription to CVE matching the selected product/vendor? Dont want to know all the public CVE, only the ones that affects my infraestructure.Greetings",
        "created_utc": 1531921222,
        "upvote_ratio": ""
    },
    {
        "title": "Weird account password changes",
        "author": "anxtravaille",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ztzdr/weird_account_password_changes/",
        "text": "Is it possible for a hacker to gain access to every computer across an IP address? Recently in my house we’ve had a few unrequested password change emails that we’ve ignored, and also as of yesterday someone has gained access to our Netflix account.\n\nIn the past I have also had a PS4 account hacked, and my Google account which showed in Chrome as being signed in from somewhere across the globe.\n\nAlso, I recently made a secondary account on a popular cam site, and when I went to log back in to the first account, the password had been changed to that of the second account.\n\nIs there any way to diagnose what’s going on and potentially ward off anyone trying to gain access to our accounts?",
        "created_utc": 1531906392,
        "upvote_ratio": ""
    },
    {
        "title": "Why does Kerberos use a ticket-granting ticket when it already uses a session key?",
        "author": "howdygents",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zroo7/why_does_kerberos_use_a_ticketgranting_ticket/",
        "text": "",
        "created_utc": 1531882207,
        "upvote_ratio": ""
    },
    {
        "title": "Conducting a Proper Review of HIPS in a work environment",
        "author": "STM119",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zo3q1/conducting_a_proper_review_of_hips_in_a_work/",
        "text": "Hi All,\n\nWanted to see if anyone has any recommendations as to what to look for when conducting a review of an organizations implementation of HIPS?\n\nSo far I have the following:\n\n1.  Access Enforcement:\n\n· Login banner\n\n· Admin Login credentials\n\n· Account lockout policy\n\n· Timeout policy\n\n2.  Signature Definitions\n\n· Auto updates enabled\n\n3.  Settings\n\n· Time Zone settings\n\n· Alerts\n\n· Server Authentication\n\n4.  Log Management\n\n· Detect/Prevent Unauthorized Access \n\n· Monitor Use activity\n\n· Track Suspicious activity\n\n· Proper reporting",
        "created_utc": 1531854705,
        "upvote_ratio": ""
    },
    {
        "title": "Should I use this USB drive?",
        "author": "nSeagull",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8znn06/should_i_use_this_usb_drive/",
        "text": "A university group I am part of got as a gift from the professors some USB flash drives.\n\nGiven the \"history\" of some of those professors on sniffing on some students conversations and such, I was worried if I should ever use this \"gift\".\n\nTo be honest it is a very nice USB flash drive, super cool looking. But I wouldn't want anyone to have a peek on what I'm doing.\n\nI've been considering doing a low level format and repartitioning. Also, hardware keyloggers write to their own memory, so no use of one here. Is there something I'm not having in mind?",
        "created_utc": 1531851691,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any way for a normal citizen to participate in protecting our country from cyber threats?",
        "author": "4fxsake",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zngny/is_there_any_way_for_a_normal_citizen_to/",
        "text": "I'm angry because our national infrastructure is so exposed and vulnerable to attack like we've seen in the news.  Is there any way a private citizen with skills can contribute to national security efforts without being in the military, government employee, etc?\n\n\n\n\n\nedit: There is a lot of great information shared by users and its much appreciated.  I don't think I clarified my post well enough initially, I was mad and wrote it on my phone.  All the security measures listed here are of the utmost importance for security in general.  I was looking for ways to become more offensive instead of just taking a defensive stance.  ",
        "created_utc": 1531850554,
        "upvote_ratio": ""
    },
    {
        "title": "Pentest interview questions - what to expect",
        "author": "phi10s",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zn0al/pentest_interview_questions_what_to_expect/",
        "text": "I have a few phone interviews coming up for some pentesting positions, mostly web centric, and I'm wondering what kind of questions I should expect. I've been reviewing OWASP's top 10 guide, and my eLearnSecurity study materials for web app enum and exploitation. Don't want to get caught on something silly that I should've thought about beforehand. If anyone has experience, whether as interviewee or interviewer, your advice would be greatly appreciated!",
        "created_utc": 1531847574,
        "upvote_ratio": ""
    },
    {
        "title": "Reposting: A Call for Participation in a Research Study",
        "author": "pbutler6163",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zmetj/reposting_a_call_for_participation_in_a_research/",
        "text": "## A Call for Participation in a Research Study\n\n**The research topic:**\n\nCybersecurity of Internet of Things devices within an industrial environment\n\n**The research problem:**\n\nThe   systems that make up every level of the Internet of Things (IoT) have   rapidly been assimilated into critical and essential roles in daily   lives. As the entire ecosystem of the IoT evolves and expands, the wide   range of functions and supporting components involved are resulting in   significant security and ultimately privacy challenges that need to be   addressed. The Industrial applications of IoT (IIoT) also referred as   Industry 4.0 (Schwab, 2017) suffer from very similar security and   privacy concerns as implementations that expand existing Operational   Technologies (OT) networks through the interconnection of smart sensors   and actuators with integrations into cloud computing platforms to  create  intelligent infrastructures create vital links within energy,   transportation, manufacturing and automation.\n\n**The Research Purpose**\n\nThe   purpose of the proposed qualitative study is to explore, within the   Biochemical industry, the experiences of cyber-security professionals   who have experience in implementing Industrial Internet of Things   systems and devices and their perceptions of the security risks to these   systems, giving rise to a better understanding of the security and   privacy concerns that must be overcome.\n\n**The research question:**\n\n*Within   the Biochemical industry, what are the experiences of cyber-security   professionals who have implemented Industrial Internet of Things systems   and their perceptions of the security risks to these systems?*  This  exploration may lead to a better understanding of the security   implications of a technology that is rapidly growing but is overlooked   within SCADA due to a false sense of security.\n\n**Research study participation:**\n\nFor   data collection, this research study needs at least 10 participants  for  semi-structured interviews with an additional 2 for a pilot phase  to  fine tune the questions. The interviews will be conducted via Skype   video conference calls in a nationwide scope. The primary focus of   participants will be individuals who currently work within the chemical,   biological, and pharmaceutical industries. Additionally, participants   should be identifiable cybersecurity professionals. Each participant   will answer about 10 interview questions.\n\n**Benefits of Participation**\n\nThere   may or may not be a direct benefit to participants in the study, but  we  hope to further the knowledge required to implement IoT Devices into   industrial settings that will help organizations to improve their   security posture that could indirectly benefit everyone. Your   contribution will be recognized and acknowledged in the dissertation.\n\n**Confidentiality**\n\nDuring   the data collection and data analysis, every effort will be made to   ensure that participants of the study will in no way be able to   correlate their responses to their identity; the information will be   coded to mask participants identities and ensure the confidentiality of   the respondents. The data and records will be stored within an  encrypted  offline medium, and this will be stored within a locked  container. Only  the researcher will be allowed access to the data and  the records, and  once the study is complete, the data and records will  be securely  destroyed.\n\n**Payments**\n\nYou  will receive the following payment/reimbursement: $25 Amazon Gift Card  for participation, presentable upon completion of the interview.\n\n**Contact information:**\n\nIf   you would like to participate in this research study or functions as a   pilot for the questions or have any other questions regarding this   study, you may contact Patrick Butler at\n\n\\- Cell phone number: 201-873-4938\n\n\\- Email address: [patrick.butler1@student.ctuonline.edu](mailto:patrick.butler1@student.ctuonline.edu) or [patrick.butler@gmail.com](mailto:patrick.butler@gmail.com)\n\n\\- Linkedin social media network: [https://www.linkedin.com/in/patrickmbutler/](https://www.linkedin.com/in/patrickmbutler/)\n\nFor   questions regard the rights of research subjects, any complaints or  comments regarding the manner in which the study is being conducted, you   may contact Colorado Technical University – Doctoral Programs at   719-598-0200.",
        "created_utc": 1531843520,
        "upvote_ratio": ""
    },
    {
        "title": "Dissertation research help",
        "author": "HyperNova786",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zm8uo/dissertation_research_help/",
        "text": "Are there any particular aspects of security that are linked with social engineering ? And also where does social engineering and security overlap at a commercial level ? \nWould appreciate any help. Thanks",
        "created_utc": 1531842402,
        "upvote_ratio": ""
    },
    {
        "title": "Brute force login attempts to a DC",
        "author": "BruceleeroyNukka",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zm89z/brute_force_login_attempts_to_a_dc/",
        "text": "My company is getting a bunch of brute force login attempts to a DC via Kerberos. We have checked the logs and a packet capture but haven’t found anything. The attempts are coming from an internal workstation. \n\nIn the packet capture is there any filter I can sort by that might show me something I have missed?  \n\nAny help or advice would be appreciated. \n\nThanks. ",
        "created_utc": 1531842294,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think the best web research of 2017 was?",
        "author": "albinowax",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zm55p/what_do_you_think_the_best_web_research_of_2017/",
        "text": "I'm trying to revive the \"Top 10 Web Hacking Techniques of 20XX\". It consists of the security community nominating quality web research from the previous year, followed by a community vote to build a shortlist, followed by a selection panel to pick the top 10. It was originally started in 2006 by Jeremiah Grossman but stopped in 2016. You can find further background at https://portswigger.net/blog/top-web-hacking-techniques-of-2017-nominations-open\n\nAs of today, we're collecting nominations for great research - just post the link in a comment. Feel free to make multiple nominations, nominate your own research, ask me if this is a ploy to select my own research, etc",
        "created_utc": 1531841671,
        "upvote_ratio": ""
    },
    {
        "title": "Selling windows 0days",
        "author": "SandboxEscaper",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zkxoj/selling_windows_0days/",
        "text": "[removed]",
        "created_utc": 1531832583,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best way to audio and video call someone securely from a computer to a phone?",
        "author": "Toocuriousspeed",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zki4a/what_is_the_best_way_to_audio_and_video_call/",
        "text": "Non native English speaker here. \n\nSuppose you want to audio and video call with someone and want to ensure the highest possible security given the situation. That person is totally not tech savvy and the only way to communicate with him is by phone and due to untech savviness can at best install an app (like Signal?). Assuming a worst case threat model (for eg nation state hackers) what would be the best way to securely and privately communicate with that person on his Android phone while using a computer from your end?\n\nPlease state the setup one should use from her end like what OS to run on computer and what else to do?",
        "created_utc": 1531828789,
        "upvote_ratio": ""
    },
    {
        "title": "Wireshark showing all traffic going to multicast ip",
        "author": "Vawahao",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zjpfx/wireshark_showing_all_traffic_going_to_multicast/",
        "text": "[https://imgur.com/a/5LNV9E0](https://imgur.com/a/5LNV9E0)\n\nAll my traffic goes to a multicast ip - is this something to be worried about? The data always seems to be the same but with one letter changed.",
        "created_utc": 1531820091,
        "upvote_ratio": ""
    },
    {
        "title": "Do dual BIOS chips on a desktop motherboard make disabling Intel ME very difficult/impossible?",
        "author": "sakuba",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zjizk/do_dual_bios_chips_on_a_desktop_motherboard_make/",
        "text": "Do dual BIOS chips on a desktop motherboard - like on some Gigabyte models - make disabling Intel ME very difficult/impossible? By disabling, I'm aware Intel Management Engine cannot be completely shut off; I mean mitigating the major known vulnerabilities with me\\_cleaner or tools like it.\n\nFurther, any other risks re: dual BIOS motherboards as compared to standard single BIOS models?",
        "created_utc": 1531817917,
        "upvote_ratio": ""
    },
    {
        "title": "Modifying public exploit code",
        "author": "BlankBalance",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zjg4i/modifying_public_exploit_code/",
        "text": "I really struggle comprehending code just in general.\n\nI try not to use metasploit when working through labs on hack the box, but I struggle with reading code and struggle to understand \"easy\" exploits sometimes, like when something on exploit-db is only written as a metasploit module I don't know what to do. I'm pretty insistent on manual testing for myself just to stay sharp enough and use MSF for other things (like MSFvenom for encoding). When I do try to modify public exploit code it takes forever, and I get bored. Other than practice, I think I'm missing gaps in my knowledge and need to learn some more to move through these faster, anybody have any resources and advice on this topic?\n\n\nTLDR; I struggle with reading and understanding exploit code, but can do it, sometimes? Help?",
        "created_utc": 1531816884,
        "upvote_ratio": ""
    },
    {
        "title": "Best Option for Users Forwarding \"phishing\" emails",
        "author": "InquisitiveHivemind",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zhxgg/best_option_for_users_forwarding_phishing_emails/",
        "text": "Hello everyone!\n\nWe are using Office 365 behind Proofpoint (also utilizing Proofpoint Tap). We are about to install an Outlook plugin that users can use to forward emails to a distribution group within our organization. We are aware of the potential dangers in users forwarding emails in Outlook ([https://wildfire.blazeinfosec.com/love-letters-from-the-red-team-from-e-mail-to-ntlm-hashes-with-microsoft-outlook/](https://wildfire.blazeinfosec.com/love-letters-from-the-red-team-from-e-mail-to-ntlm-hashes-with-microsoft-outlook/)), but leadership is wanting to utilize this method. Has anyone been in a similar situation? We are looking for some guidance on what other groups do. Thanks in advance!",
        "created_utc": 1531800056,
        "upvote_ratio": ""
    },
    {
        "title": "Why is there such a lack of talent in InfoSec? And what can be done to solve it?",
        "author": "jordanpoulton1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zhu9h/why_is_there_such_a_lack_of_talent_in_infosec_and/",
        "text": "I've recently read some pretty crazy stats that imply that the InfoSec industry is \\*desperate\\* for talent:\n\n1. The demand for cybersecurity professionals will increase to approximately [6 million globally by 2019](https://researchcenter.paloaltonetworks.com/2016/06/cybersecurity-more-threats-but-also-more-opportunities/), according to some industry experts cited by the Palo Alto Networks Research Center.\n\nOr, if you think those numbers are too high:\n\n 2.  Cybersecurity Ventures [predicts](https://cybersecurityventures.com/jobs/) there will 3.5 million unfilled cybersecurity jobs by 2021, up from 1 million openings in 2014.\n\nAnd another:\n\n 3.  “The most dangerous looming crisis in information security is a severe cyber security labour shortage, expected to reach 1.5m job openings by 2019” - [John Reed Stark, Founder and Chief of the SEC’s Office of Internet Enforcement](https://www.complianceweek.com/blogs/john-reed-stark/there-simply-are-not-enough-cyber-security-specialists)\n\nThese are just a few of the stats. The research seems unanimous.\n\nSo **my question is** \\- why is there such an issue with the supply of talent? There are great universities out there, and \\*lots\\* of companies offering \\*lots\\* of certs (Security+, CEH, GPEN, OSCP, CISSP to name a few) - so why the looming crisis?\n\nAnd **my second question is** \\- what can be done to address this issue of a lack of talent coming into the industry?\n\nThanks for sharing thoughts y'all :)",
        "created_utc": 1531799193,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to use and retain the knowledge of all of hackers handbook and hacking exposed series latest edition? Just wondering. Thanks.",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zh74e/is_it_possible_to_use_and_retain_the_knowledge_of/",
        "text": "I don’t just mean use and retain but applying and abstracting and building upon the nowledgr in the areas in these books for clarification. I’m not just planning on going by the book but being well rounded in these areas. I am wondering because I am considering doing this. I think maybe general web app hacking, phone app hacking, and OS hacking could be primary areas with well rounded everything else including basic network hacking.\n\nThe series also help me learn programming applied to hacking to start off.\n\nObviously I need to expand by doing and retain.\n\nWhat do you think?",
        "created_utc": 1531793627,
        "upvote_ratio": ""
    },
    {
        "title": "Can I make my own password manager?",
        "author": "Mathspy",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zh6wp/can_i_make_my_own_password_manager/",
        "text": "If you think this question isn't exactly fit for this subreddit, would it be possible to direct me to another subreddit where you think it's more likely to find an answer? Thank you!\n\nTo start, I am a relatively young developer with very little knowledge about Cryptography and probably less knowledge about Security as a whole, but came to me an idea and I wanna know how \"flawed\" it is.\n\nCan I make my own password manager?\nHere's my idea, I think this is as dead simple as it can be:\nFirst time start, user is asked to write a masterpassword. A random \"salt\" is appended to the masterpassword and then it's instantly encrypted using SHA and that encrypted version is stored on device next to whatever the value of the salt was.\nWhenever user is registering into a new site or service they click an \"Add\" button, password manager asks for masterpassword which is then checked against the encrypted salted version and if it's correct, it generates a random password encrypts it using AES using the masterpassword as the key and stores that encrypted version next to a text the user can input like \"reddit.com\" or so\nWhenever the user needs their passwords they'd of course need to input the masterpassword which is checked against the SHA-salted-encryption and then used with AES to decrypt\nA question I asked myself and that someone might ask (probably not really, it's probably me just being bad at this) is why the whole SHA salt thing, why not just simply AES encrypt the generated passwords and call it a day? Well without the SHA half of the story there will always be an \"output\" and it might even look remarkably like the random strings that are generated for passwords, so it'd be frustrating to have the user not realise they misclicked a single letter and that's why their \"not-really-password\" is not work lol\n\nOkay so... Like I mentioned I just thought of this and found it remarkably simple, googling a little everything I found that represents an Open-source Password Manager seems to have a lot more complications than this which makes me wonder, what have I missed out in my \"theory\"? I am asking here what flaw could there be in this system from an abstract point of view, ignoring all implementation details that could cause the masterpassword to be left in RAM and things like that\n\nNext question is the opposite of the previous; if this theory is completely solid as steel, what things do I look out for? Clipboard sniffers I know about, better have it as a Chrome extension etc so it never touched clipboard or even keyboard (keyloggers yada yada) I have no experience with \"ensuring things are removed from RAM\" in the dynamic languages I use. I mean it's \"easy\" I guess if done in Rust? But I have no idea how to make sure masterpassword is never stored in RAM for even a second in JS, guess that's another thing I have to look into. What else though? I know I must have missed something\n\nFinally let's say I save the SHA-salted-encrypted Masterpassword and the salt and all the passwords into file(s)... Can't I in theory upload throw that file anywhere publicly? Upload it to GitHub or post it somewhere where everyone can see? They would have to basically crack SHA or AES themselves to get a hold of my passwords, right? (Of course I won't do that anyway I am just wondering, again, if I somehow missed something major)\n\nThank you so much for reading and bothering with my long winded question &lt;3 I do realise I most likely missed some major flaws in everything and I'd rather actually learn them and be directed to resources where I could learn more than be told it's all wrong without explainations\nI also do realise there's probably more battle-tested implementions of similar/better things that are Open-source but I'd still like to see how flawed was my logic and if not, I'd still like to implement it out even if for a password or two that I don't care much about &lt;3",
        "created_utc": 1531793574,
        "upvote_ratio": ""
    },
    {
        "title": "[Stupid Question]Can anyone connected to the same router as I on a secured home network see any of my activities / files?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zf03y/stupid_questioncan_anyone_connected_to_the_same/",
        "text": "[deleted]",
        "created_utc": 1531776153,
        "upvote_ratio": ""
    },
    {
        "title": "Knowledge Management tool for a Cyber SOC",
        "author": "l0rd_raiden",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zdnn6/knowledge_management_tool_for_a_cyber_soc/",
        "text": "What tools do you use? Preferably open source tools",
        "created_utc": 1531767300,
        "upvote_ratio": ""
    },
    {
        "title": "Need help gauging whether or not my phone has been exploited.",
        "author": "Ocelot-",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zdlfw/need_help_gauging_whether_or_not_my_phone_has/",
        "text": "Hi, so this morning a received a phishing email purporting to be a fraudulent amazon purchase, pretty standard stuff.\nThe problem is when I first opened the email my email client crashed. Only when I reopened the app was I able to see the email.\nI have had a look at the email source and I can't see anything obvious but I am really not used to what raw emails should look like.\nI am worried my new phone may have just been pwned.  \n\nHere is all the pertinent information I can think of.  \n* Model: Oneplus6  \n* Oxygen OS version 5.1.8  \n* Android OS version 8.1.0  \n* Android security patch level: 1st may 2018  \n* I am using the official google Gmail client, version: 8.6.17.201756049.release  \n\nThe raw email is here(I replaced my email address with REDACTED twice): https://pastebin.com/ALGAUVdA  \n\nI would very much appreciate if somebody could take a quick look at the email source and let me know if it is benign. Also if any light can be shed on why my client crashed I would be very appreciative.  \n\nIf this is posted on the wrong subreddit my apologies, please point me in the right direction.  \n",
        "created_utc": 1531766887,
        "upvote_ratio": ""
    },
    {
        "title": "Boot2Root",
        "author": "UCFIT",
        "url": "https://www.reddit.com/r/netsecstudents/comments/8zd8yr/boot2root/",
        "text": "",
        "created_utc": 1531764619,
        "upvote_ratio": ""
    },
    {
        "title": "Should I learn C if i know C++?",
        "author": "azidified",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zcorg/should_i_learn_c_if_i_know_c/",
        "text": "A lot of articles about Sec say that C is very imp to learn. I have already learnt C++. Should I spend my time to learn C?",
        "created_utc": 1531760897,
        "upvote_ratio": ""
    },
    {
        "title": "Best SIEM training right now?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zce7l/best_siem_training_right_now/",
        "text": "[deleted]",
        "created_utc": 1531758913,
        "upvote_ratio": ""
    },
    {
        "title": "What are these 3 cipher suites?",
        "author": "G_fucking_G",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zcaho/what_are_these_3_cipher_suites/",
        "text": "If you go to this website it shows you all cipher suites your browser accepts and ranks them by preference.\nhttps://cc.dcsec.uni-hannover.de/\n(the website is from a german university).\n\n\nThe most preferred cipher suites of my browser (firefox)\nare unknown --&gt; see screenshot\n\nhttps://imgur.com/a/V8sNLaZ\n\nSo what are these cipher suites 1301, 1302, 1303 ?",
        "created_utc": 1531758217,
        "upvote_ratio": ""
    },
    {
        "title": "Can't Do It All At Once",
        "author": "DiscombobulatedBee0",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zb40i/cant_do_it_all_at_once/",
        "text": "I'm a regular subscriber to this sub, but created a throw away account for this question...\n\nA few months ago, I was laid off from a company I'd been with for eight years. I took a promising (I thought) position with a company that was small, but growing and sounded like an opportunity to get in, stretch, grow, and improve the company. They'd never had a dedicated security role, but recognized the need and wanted to bring someone in that could help.\n\nFlash forward a few months. \n\n\\- Policies are inconsistent, some don't exist, and those that do exist are not reviewed or enforced. \n\n\\- The network is flat, some offices have wireless, some don't. Wireless might or might not be secure... VLAN? What's a VLAN? Why can't we just plug things in or try a different port when something doesn't work?\n\n\\- There are integrity issues - audits and inquiries with customers might or might not be truthful, dependent on your point of view. (there's a hint of sarcasm there - hopefully you take my meaning)\n\n\\- Security controls seem to be reactive, instead of being part of a cohesive strategy and framework. I'm the only one that seems to have heard of NIST, ISO 27001, or anything along those lines. \n\n\\- I wrote a security assessment right after I got here. It wasn't a complete assessment. It was simply a quick review of systems and common controls one might expect to see. Do we have antivirus? (that answer might be shocking), Do we have effective password policies?, How are file permissions set, reviewed and/or adjusted? What does the network look like? What policies do we have, are they adequate, how are they enforced, etc. The IT director didn't review it or discuss it for weeks, and there still hasn't been a commitment to action on any of my findings/suggested mitigations.\n\n\\- There have been approximately 5 related incidents since I started. I'm including significant outages in this, as availability is an important one to me, personally. I didn't know this at the time, but they didn't have a network engineer, and I'm happy to fill that role, because it and security are my background. Two incidents have resulted in a loss of data, $$$ and/or identity theft. There was also one other attempt, but it was caught due to some of the procedures put in place after I heard about the first incident.\n\nSo, my question to the group - where do you start? Surely someone else has been in this situation where everything is on fire, you know what needs to be done, you know you can't do it all at once, and you're trying to establish a strategy and procedures, but everything seems to be reactive. \n\nI'm leaving out other details because this is already long enough, but surely someone has had to pick up pieces from a mess like this. How did you do it?",
        "created_utc": 1531749446,
        "upvote_ratio": ""
    },
    {
        "title": "Tails' time does not match with the real time. Should I be concerned?",
        "author": "powerofinformation",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zb2xh/tails_time_does_not_match_with_the_real_time/",
        "text": "When I started Tails on DVD it showed 15:40 but it was 9:40pm at that time. Should I be concerned?",
        "created_utc": 1531749174,
        "upvote_ratio": ""
    },
    {
        "title": "How do you implement TLS encryption for email communication?",
        "author": "DoDo12341234",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zb1ll/how_do_you_implement_tls_encryption_for_email/",
        "text": "Good afternoon everyone,\n\n\nI think im going in loops now. Everything I google about TLS encryption I don't understand. As this is my first time doing anything regarding this issue, I'm in desperate urgency.\n\n\nMy boss wants from me to get all the possible info for implementing TLS encryption for our communication between our suppliers in email communication. What we will have to do, and what will our supplier need to do? What are certified authenticators? Sadly I'm not networking guy, so what are best practises, how to do it, etc.? Please, any advise is so much appreciated",
        "created_utc": 1531748865,
        "upvote_ratio": ""
    },
    {
        "title": "SEC 504 or SEC 560?",
        "author": "Mortarbro",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zaqsp/sec_504_or_sec_560/",
        "text": "Hey all, this would be my first SANS course. From what I understand, I probably can't go wrong either way -- but I'd like to hear some opinions.\n\nMy background: Current IT student in college about to get my Bachelors in the Fall. Working in a very non hands-on role in a cybersecurity position for the government and want to transition after graduating to something more active.  I have some very basic netsec experience being on my colleges CCDC team and have completed the elearnsecurity eJPT. \n\nI think I've seen someone post on a sub saying just skip 504 and do 560, but I can't remember. Seems 504 is designed for someone with blue team aspirations whereas 560 is for someone with red team aspirations? \n\nedit: Should note I'm not paying for this at all. ",
        "created_utc": 1531746321,
        "upvote_ratio": ""
    },
    {
        "title": "Wifi not showing up help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zah8u/wifi_not_showing_up_help/",
        "text": "[deleted]",
        "created_utc": 1531743924,
        "upvote_ratio": ""
    },
    {
        "title": "What is alternative to ESET?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8zaen7/what_is_alternative_to_eset/",
        "text": "[deleted]",
        "created_utc": 1531743265,
        "upvote_ratio": ""
    },
    {
        "title": "What are methods of kernel/firmware Rootkit detection ?",
        "author": "ThinkPrimary",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z9orj/what_are_methods_of_kernelfirmware_rootkit/",
        "text": "I'm new to the subject of rootkits and have been reading on it for a while.\n\nI havent found much resources that address detection of Kernel or firmware detection.\n",
        "created_utc": 1531735627,
        "upvote_ratio": ""
    },
    {
        "title": "Help restoring files encrypted by Mr. Dec ransomware",
        "author": "showmehowtodraw",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z9ipa/help_restoring_files_encrypted_by_mr_dec/",
        "text": "One of my friend's network got infected by Mr. Dec ransomware (the text is identical to Mr. Dec ransomware but the email are different). I've been searching around for a solution to getting the files back but I couldn't find a proper way to restore the files. I understand that it might be be impossible to get the files back without the encryption key but if there is any possible solution, can someone point me to it.",
        "created_utc": 1531733618,
        "upvote_ratio": ""
    },
    {
        "title": "Do system admins ever take part in penetration tests?",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z82ld/do_system_admins_ever_take_part_in_penetration/",
        "text": "Do system admins ever take part in pen tests? It’s a prerequisite job right?",
        "created_utc": 1531716378,
        "upvote_ratio": ""
    },
    {
        "title": "So starting from no where what is the pathway to OSCP since it’s not a beginner cert?",
        "author": "ghostheadx9",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z80xf/so_starting_from_no_where_what_is_the_pathway_to/",
        "text": "I’m gonna start learning on my own when I can finally get a real diagnosis that can be treated which will be soon, maybe even this week. I’m hoping by the end of this week but that’s irrelevant info as far as this Reddit goes.\n\nI’m thinking of starting off by doing the crappy certs my school actually requires me to do.\n\nFor beginners, how worth it is the hackers handbook and hacking exposed series?\n\nIf not which series would you recommend to start?",
        "created_utc": 1531715887,
        "upvote_ratio": ""
    },
    {
        "title": "AWS for Security Engineers?",
        "author": "coava",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z6u9d/aws_for_security_engineers/",
        "text": "As someone who wants to be a security engineer in the future (after graduation from grad school), is taking the basic (associate level) three AWS certifications (Developer, SysOps, Solution Architecture) necessary?\n\nThank you.",
        "created_utc": 1531704698,
        "upvote_ratio": ""
    },
    {
        "title": "Can corporate networks see the contents of an ssh/sftp session?",
        "author": "erliluda",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z5dwa/can_corporate_networks_see_the_contents_of_an/",
        "text": "I got into a debate with a coworker about this wanted to see. He claims they can but I don't really think so.",
        "created_utc": 1531691741,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, are there good tutorials for Snort, Suricata or Bro ?",
        "author": "Sidxzx",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z4opi/hello_are_there_good_tutorials_for_snort_suricata/",
        "text": "",
        "created_utc": 1531685998,
        "upvote_ratio": ""
    },
    {
        "title": "What is the solution for securing without compromising on performance?",
        "author": "bigbinfosec",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8z0jpd/what_is_the_solution_for_securing_without/",
        "text": "I was asked an interview question:\n\nexplain the how to get world class security in a performance sensitive system that includes an internet facing front end, data center(or cloud, terms can be used interchangeably) based back end. \n\nMy answer was :\n\nInternet &lt;---&gt; Firewall &lt;---&gt; Reverse Proxy &lt;---&gt; (Optional) WAF  &lt;---&gt; App Server &lt;---&gt; DB Server (with encryption)\n\nIt was a very basic and generalized solution.  \n\nWould like to hear other people views.",
        "created_utc": 1531646629,
        "upvote_ratio": ""
    },
    {
        "title": "n00b to God",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yzhe1/n00b_to_god/",
        "text": "[deleted]",
        "created_utc": 1531631940,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know that nation states cannot hack an individual running Tails?",
        "author": "Toocuriousspeed",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yyr5e/how_do_we_know_that_nation_states_cannot_hack_an/",
        "text": "[removed]",
        "created_utc": 1531624008,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know that nation states cannot hack an individual running Tails?",
        "author": "Toocuriousspeed",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yyr4h/how_do_we_know_that_nation_states_cannot_hack_an/",
        "text": "Non native English speaker here. I am a total newbie so I do not know much about cybersecurity. \n\nSince nation states are almost omnipotent and have huge resources and work secretly, how do we know that they cant hack an individual target running tails?",
        "created_utc": 1531623999,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know that nation states cannot hack an individual running Tails?",
        "author": "Toocuriousspeed",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yyr0b/how_do_we_know_that_nation_states_cannot_hack_an/",
        "text": "[removed]",
        "created_utc": 1531623966,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know that nation states cannot hack an individual running Tails?",
        "author": "Toocuriousspeed",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yyqya/how_do_we_know_that_nation_states_cannot_hack_an/",
        "text": "Non native English speaker here. I am a total newbie so I do not know much about cybersecurity. \n\nSince nation states are almost omnipotent and have huge resources and work secretly, how do we know that they cant hack an individual target running tails?",
        "created_utc": 1531623950,
        "upvote_ratio": ""
    },
    {
        "title": "IP addresses, spoofing and what can be done using an address?",
        "author": "quinzxl",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yybja/ip_addresses_spoofing_and_what_can_be_done_using/",
        "text": "Not sure if this is the right subreddit, if not I'm so sorry and could someone point me in the right direction. 😊 Someone I know has been asking me about how much I know about IP addresses, I'm not sure if this is an empty threat or if he's planning on doing something with it as we aren't on good terms. I haven't personally given him the address and haven't made any video calls. All communication has been using snapchat and facebook. I've been curious in regards to IP spoofing, is it possible when spoofing an IP address to choose the address you use, i.e if he knows mine can he set his device to spoof it, and if he chooses to use my IP address for anything what's the extent he can go to?",
        "created_utc": 1531619488,
        "upvote_ratio": ""
    },
    {
        "title": "Salary for Security Engineer Lakeland, Fl",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yxg6c/salary_for_security_engineer_lakeland_fl/",
        "text": "[deleted]",
        "created_utc": 1531611233,
        "upvote_ratio": ""
    },
    {
        "title": "A couple technical questions on 'passing the hash'",
        "author": "spinfip",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ywyro/a_couple_technical_questions_on_passing_the_hash/",
        "text": "Firstly, why did it ever work? It seems like it's reliant on there being a line of code in the authentication saying something like:\n\n    if HashFunction(PasswordInput) == user.HashedPassword *or* PasswordInput == user.HashedPassword:\n\nSo why did devs even allow it to be an option to not send the password input through the hashing function before checking it against the hashed password?\n\nSecondly, what benefit does this method confer upon the attacker over just guessing the password? It seems like if you already have a table of passwords to check, hashing them all to create a table of hashed passwords simply adds a step between you and carrying out an attack, without increasing your odds of success?  \nIs it based on being able to somehow obtain the hashed password and using that in lieu of the actual password?",
        "created_utc": 1531606774,
        "upvote_ratio": ""
    },
    {
        "title": "Soon to graduate from a security bachelor, looking for recommendations/advice.",
        "author": "Ambardel",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yvbpr/soon_to_graduate_from_a_security_bachelor_looking/",
        "text": "Hi, I'm finishing my security bachelor next year and I would like to know what entry level certifications, courses, jobs, etc. would you recommend I get.\n\nMy goal is to be a CISO so IT governance or management are the main things I should focus on, right?\n\nNOTE: I'm from Mexico and it's difficult to find good education/jobs regarding security so I'd appreciate if you could recommend me online material. I have some money saved up too so I can study abroad if necessary and as such I'd really appreciate if you could recommend me some school to apply to.\n\nYour comments are greatly appreciated.",
        "created_utc": 1531592818,
        "upvote_ratio": ""
    },
    {
        "title": "Am I being spied on? WTF packets in Wireshark.",
        "author": "OkPapaya8",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yvb0b/am_i_being_spied_on_wtf_packets_in_wireshark/",
        "text": "Hey guys, I know very little about TCP/IP and net security, but I just started getting in to it after reading some scary articles on r/privacy. I downloaded wireshark to test my VPN and I noticed some very strange stuff. Without my VPN on, my Macbook Air running macOS periodically receives \"TCP retransmissions\" from various servers owned by various datacenters/corporations: including: Apple, Amazon (!), MCI Communications Inc. d/b/a Verizon (My ISP isn't Verizon though). These are the ones that I was connecting to on idle (no apps running) I think.\n\nNow the scary part is, even WITH my VPN on, when most of the other packets say \"OpenVPN\" as their protocol and point to the public-facing IP I'm supposed to get from the VPN, these packets persist and point to the IPs associated it with the aforementioned corporations/data centers. What the fuck is going on? Are these packets leaking through my VPN? And what's causing them in the first place? I'm quite shaken up by this. Please help me understand what's going on.",
        "created_utc": 1531592649,
        "upvote_ratio": ""
    },
    {
        "title": "Best computer forensics certifications.",
        "author": "benkelly18",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yv1vd/best_computer_forensics_certifications/",
        "text": "Hi all\n\nI’m UK based.\n\nMy background is as an infrastructure engineer. I’ve got MCSE: cloud platform and infrastructure as well as CCNA, and I’m currently completing CCNA Security.\n\nMy company wants me to complete some training and certification for computer forensics.\n\nI’m after recommendations.\nI’ve pretty much ruled out GHFI as ec-council Certs seem to hold little weight.\nGIAC looks perfect but cost is an issue.\n\nI’m aware of CEE, however training for this doesn’t seem available outside the US. \nAlso CFCE\n\nThoughts are appreciated.\n\n\n\n\n ",
        "created_utc": 1531590566,
        "upvote_ratio": ""
    },
    {
        "title": "LFI Local File Inclusion question",
        "author": "PoZiTrOn13",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ytb1n/lfi_local_file_inclusion_question/",
        "text": "why the ../../../../../../ ?!..why not the path of the dir is simply /etc/passwd for example ?!..\n\n../../../../../../thank/you/in/advance !! ;)",
        "created_utc": 1531575419,
        "upvote_ratio": ""
    },
    {
        "title": "I found a website that has over 2K \"nodes\" to other websites (and got through u block origin and chrome) how do I report?",
        "author": "amangosmoothie",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yqanr/i_found_a_website_that_has_over_2k_nodes_to_other/",
        "text": "As you may have guessed this was one of those \"MICROSOFT VIRUS ALERT!\" websites. I was redirected there after clicking a google result to a website I wanted to go to. I peaked at the elements section and saw that it had \"nodes\" to thousands of over sites that I'm guessing are also compromised. I was using google chrome and u block origin but it didn't seem to notice the ad blocker at all. How do I go about reporting this website? It's a .tk website ",
        "created_utc": 1531538315,
        "upvote_ratio": ""
    },
    {
        "title": "I have no Idea why they can see everything.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yq5g2/i_have_no_idea_why_they_can_see_everything/",
        "text": "[removed]",
        "created_utc": 1531536869,
        "upvote_ratio": ""
    },
    {
        "title": "Degree of Education",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ypqbt/degree_of_education/",
        "text": "[deleted]",
        "created_utc": 1531532685,
        "upvote_ratio": ""
    },
    {
        "title": "what do security wizards say about how safe this code is? (everything included)",
        "author": "understandthings100",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yp26i/what_do_security_wizards_say_about_how_safe_this/",
        "text": "- someone made this\n- screenshot: http://nog5.com/files/request69.hotkey.tracker.png\n- here's teh files http://nog5.com/files/request03.v4.zip\n- written in c#\n- they dont know how to use github\n\n**where is this software on the entire web?**\n\n- nobody seems to know of a software app that does this, im assuming it exist in 2018 tho\n\n- macos, win10\n\n\n**timeframe to make**\n\n- i also wanted to know what's the expereince/knoweldge-equivalent to academic classes/semesters to make something liek this\n\n- they were self-taught so pretty hard to guesstimate/approximate \n\n\n\n**comptuer secrutiy**\n\n- while anyone could just put links on their site to download (and i never check if the things i download are safe)\n\n- and since that is not that diff from reddit, why even check if it's safe?\n\n- (any sites that auto-checks btw?)\n\nverification of the safeness is still from a reddit user so it kinda doesnt make sense to ask this.. but this is mitigated &amp; hedged cos it's typically very easy to tell the quality of a user\n\n",
        "created_utc": 1531526454,
        "upvote_ratio": ""
    },
    {
        "title": "I have Security+ and am thinking about my next certificate step. What are your thoughts?",
        "author": "jigarkhor",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yorsb/i_have_security_and_am_thinking_about_my_next/",
        "text": "I have been looking at CEH, but it doesn't seem like a \"next level\" certification so much as a Security+ cert from a different company. I'm really leaning on the offensive side here.\n\nI'm interested in the OSCP but not confident that I'm ready for that yet.\n\nIs GPEN an appropriate modground alternative? Or am I missing something?",
        "created_utc": 1531523900,
        "upvote_ratio": ""
    },
    {
        "title": "Why youtube.com redirects me to another site?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yok0x/why_youtubecom_redirects_me_to_another_site/",
        "text": "[deleted]",
        "created_utc": 1531522081,
        "upvote_ratio": ""
    },
    {
        "title": "Why youtube.com directs me to another site?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yogy7/why_youtubecom_directs_me_to_another_site/",
        "text": "[deleted]",
        "created_utc": 1531521377,
        "upvote_ratio": ""
    },
    {
        "title": "Computer Security Dissertation Topic",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ynfmx/computer_security_dissertation_topic/",
        "text": "[deleted]",
        "created_utc": 1531513333,
        "upvote_ratio": ""
    },
    {
        "title": "How do I check if all my outgoing traffic is being routed through my VPN? (macOS)",
        "author": "OkPapaya8",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ynbwv/how_do_i_check_if_all_my_outgoing_traffic_is/",
        "text": "",
        "created_utc": 1531512587,
        "upvote_ratio": ""
    },
    {
        "title": "I plan on moving from public to private sector. Getting tripped up when companies ask for my compensation range",
        "author": "snort_rules",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yn5hs/i_plan_on_moving_from_public_to_private_sector/",
        "text": "I've been working for the past 3 years as part of a small CIRT. My jobs duties focus mostly on the network side, and to be truthful, it's more of a tier 1 analyst role even though I do network forensics and traffic analysis as well. I'm pretty well covered cert wise; i have an OSCP, GCIH, SEC+ and a CCNA. CISSP shouldn't be a problem except I'm burnt out from cert  \nexhaustion.\n\nRecently I've been looking for other positions that will allow me to grow more on the host-based forensics side and also do some more active threat hunting. My biggest problem is that I really don't know how much to ask. I've always had relatively strict pay scale and it just feels foreign to throw out numbers. At a few of my first interviews in high CoL areas, I just said \"$100k\" and it didn't seem to be a problem.\n\nAside from the obvious things such as looking at salary websites, what are some other resources that you've used to really ascertain your worth? I would really hate to sell my self short. ",
        "created_utc": 1531511332,
        "upvote_ratio": ""
    },
    {
        "title": "SADD.IO",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yn0j6/saddio/",
        "text": "Thoughts - [https://hackersonlineclub.com/better-than-a-vpn-introducing-a-new-way-to-become-anonymous/](https://hackersonlineclub.com/better-than-a-vpn-introducing-a-new-way-to-become-anonymous/)",
        "created_utc": 1531510316,
        "upvote_ratio": ""
    },
    {
        "title": "how do i get into cyber security?",
        "author": "pappoosh",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ylm4m/how_do_i_get_into_cyber_security/",
        "text": "i want to learn more, i have a degree in comm. eng. and i know the basics of network security and cryptography, where do i go now in your opinion?",
        "created_utc": 1531500637,
        "upvote_ratio": ""
    },
    {
        "title": "How common are windows applications that actively look for procmon, shut down if procmon starts running, and refuse to start if procmon is running?",
        "author": "nationStateHate",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ykmbn/how_common_are_windows_applications_that_actively/",
        "text": "",
        "created_utc": 1531493600,
        "upvote_ratio": ""
    },
    {
        "title": "Certified Computer Examiner (CCE) UK",
        "author": "benkelly18",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ykheq/certified_computer_examiner_cce_uk/",
        "text": "Has anyone on here who is based in the UK completed this? If so what training resources did you use and how did you find it?\n\nThey’re website is absolutely awful. looking for training, the problem is it’s all in the US, which means the laws and procedures you learn aren’t going to be applicable. \n\nAre the assessments like that also? I.e. focusing on US law and evidence rather than UK. If they are then it’s pointless for me, I’d just be doing the cert for the sake of the piece of paper.",
        "created_utc": 1531492553,
        "upvote_ratio": ""
    },
    {
        "title": "able to download dump.rdb file some website",
        "author": "damuzxc",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yk7yg/able_to_download_dumprdb_file_some_website/",
        "text": "it is security issue? ",
        "created_utc": 1531490527,
        "upvote_ratio": ""
    },
    {
        "title": "I have three years before I graduate. Is this a good roadmap to ensure that I get a quality full-time job out of college? Thank you so much to any help/advice. Repost from netsecstudents",
        "author": "bloggingdirty",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yfxb9/i_have_three_years_before_i_graduate_is_this_a/",
        "text": "First, a little bit about me\n\nSchool: California Polytechnic State University-Pomona\n\nMajor: Computer Information Systems-Concentration in Cyber Security (Information Assurance)\n\nGPA: 3.2\n\nI'm a very tech savvy person, but I have no foundational knowledge in IT. Here is my plan\n\n1. Studying for my **CompTIA A+ Certification right now. Should be done within a month**\n\n2. Going to get very involved with Cyber Security club at school. Also planning on trying to find a job as a helpdesk position to get experience while attending school in my third year of college (graduating in 5 years).\n\n3. I already bought the Todd Lammle book for the CCENT/CCNA and started studying quite a bit before I realized that I'd be better off with getting the A+ first. I made the mistake of trying to go for the CCENT with no experience. **I am planning on studying and passing the CCENT after I pass the A+**\n\nAll this should take about six months. And although I can't plan on what's going to happen in the far future, here's my general guideline.\n\n4. **Try and get an internship** over the summer going into my second-to-last year of college. If I can't get a cyber security position, I'll do my best to at least find an IT internship.\n\n5. **Study and Pass the CCNA, then Security+.** Not sure which one I should do first. But either way, I want to have the CCNA and Security+ before graduating.\n\n6. **Find a Cyber Security internship** in my last Summer before going into my 5th year of college.\n\nSo in summary, I am going into my third year of college and I realized that I haven't done shit except for maintain a decent GPA throughout school so far. In my \"plan,\" I want to earn the CompTIA A+, CCNA, CompTIA Security+ certifications in three years. Will/Should this be enough to have a solid resume going out of college?",
        "created_utc": 1531447204,
        "upvote_ratio": ""
    },
    {
        "title": "As a noob, how can I improve my netsec?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yex78/as_a_noob_how_can_i_improve_my_netsec/",
        "text": "[deleted]",
        "created_utc": 1531438808,
        "upvote_ratio": ""
    },
    {
        "title": "SQLi question (bWAPP)",
        "author": "lilsamuel1",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ye9y4/sqli_question_bwapp/",
        "text": "I am doing a bWAPP challenge (#15) and I would like to sleep if login from the table users = 'bee' and the first char of the pass is '6'.\n\nSo far my code is\n\niron man' AND IF((select (login) from users)='bee' AND (select MID(password,1,1) from users limit 1,1)='6', SLEEP(5),0)#\n\nAny help is appreciated, thanks guys.",
        "created_utc": 1531433632,
        "upvote_ratio": ""
    },
    {
        "title": "My system is compromised, I quarantined it. What is the MOST secure way of completely wiping it to eliminate anything that can possibly have been installed onto my system?",
        "author": "RiBc_",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yd72v/my_system_is_compromised_i_quarantined_it_what_is/",
        "text": "I have been phished by TP-LINK's own website and my computer is compromised. A threat assesment by norton: [https://safeweb.norton.com/report/show?url=tplinkextender.net](https://safeweb.norton.com/report/show?url=tplinkextender.net) It says all the threats all coinminers, so my data should not be in immediate danger. Nevertheless, I have IMMIDIATELY quarantined it (shut-down and also disabled my home network) Now I have contacted symantec and they are telling me that I should turn my pc on and run norton power eraser (basically a much more aggresive pc scan) and that I do not need to worry about my data which is just bullshit. \n\nI was thinking about something bootable from an usb, so that I do not le the malware manipulate with my files. Everything is backed up, so no worries about anything getting deleted, but rather sent to an attacker's server. Any reccomendations about software I can use for this? Any help highly appreciated.",
        "created_utc": 1531425865,
        "upvote_ratio": ""
    },
    {
        "title": "Possible phishing scam. Has my email been compromised?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8ycyq8/possible_phishing_scam_has_my_email_been/",
        "text": "[deleted]",
        "created_utc": 1531424292,
        "upvote_ratio": ""
    },
    {
        "title": "Is it safe to view PDFs in-browser?",
        "author": "fixox",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yayrk/is_it_safe_to_view_pdfs_inbrowser/",
        "text": "I'm currently running Firefox and have recently gotten into the habit of using the preview PDF in-browser feature. It's very convenient, but I'm curious if this poses any additional security risk? Usually when I want to read a PDF or save it to my machine, I'll download it first and then scan it without actually opening the PDF in my PDF reader. I've read that this is the safest way to view PDFs, as malware can only be executed if the PDF is opened in some sort of reader. Does this mean viewing a PDF in-browser is likely safe, or does it still count as opening the PDF, and any malware is therefore able to be executed? \n\nThanks!\n\nEDIT: thanks for all the help you guys! I learned quite a few things.",
        "created_utc": 1531410830,
        "upvote_ratio": ""
    },
    {
        "title": "Windows 10 Security Suite Suggestions",
        "author": "seag33k",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8yad5f/windows_10_security_suite_suggestions/",
        "text": "I've been using Bitdefender Total Security for the last few years without complaints.  Recently it was causing my new Dell XPS running Windows 10 to crash after resuming from sleep.  I switched to a different security solution and the issue is now gone.  I know AV/Malware software is not a silver bullet since it can be easily bypassed, but would like to get suggestions and feedback on what others are liking.",
        "created_utc": 1531406605,
        "upvote_ratio": ""
    },
    {
        "title": "Is CCNA still a good certification when cloud computing seems to be the future?",
        "author": "evenstar2",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y9ulf/is_ccna_still_a_good_certification_when_cloud/",
        "text": "Hi, \n\nSorry if this is a silly question, I'm about halfway through studying for my CCENT, looking to get my CCNA afterwards. I was listening to Packet Pushers latest podcast: The Future of Networking. \n\nThey mentioned that cloud computing will overtake the networking industry and that old-school networking will become more and more rare. \n\nI'm wondering if I am wasting my time studying for the CCNA, and if I would be better off getting another certification?\n\nThank you.",
        "created_utc": 1531402756,
        "upvote_ratio": ""
    },
    {
        "title": "Spend training budget on certification",
        "author": "stonefish5",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y8gk2/spend_training_budget_on_certification/",
        "text": "I currently work as a QA Automation Engineer for a cloud based startup. I am interested in completing some training/certification in security and am willing to spend my training budget on doing so. At the moment we don't have an any security specific folk working at the company.\n\nMy question is what would be best certification path to take? Eventually I would like to get into Application security but I am open to suggestions. Would I be better off starting with something like Security+ then moving to CEH and so on? Or is there some application security certs that are worth considering?",
        "created_utc": 1531390403,
        "upvote_ratio": ""
    },
    {
        "title": "CPISI certification from SISA Information Security",
        "author": "Radmoxtron",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y7ymy/cpisi_certification_from_sisa_information_security/",
        "text": "I'm planning to do CPISI certification from SISA\n\n[https://www.sisainfosec.com/](https://www.sisainfosec.com/)\n\nhas anyone does this certification and is it worth doing it ?",
        "created_utc": 1531384466,
        "upvote_ratio": ""
    },
    {
        "title": "If CISSP is my main goal, what should I do for network fundamentals?",
        "author": "azidified",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y7uav/if_cissp_is_my_main_goal_what_should_i_do_for/",
        "text": "Lot of people are giving different opinions. Some say net+ is enough for the basics, and some say that CCNA is better. If getting into InfoSec and CISSP is my main goal, what should I be doing for network fundamentals?\n\nEDIT: I'm 17 and just going to college for a degree in Information Science.\n",
        "created_utc": 1531382918,
        "upvote_ratio": ""
    },
    {
        "title": "A degree in computer networks and systems?",
        "author": "chickenpeppers",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y73pt/a_degree_in_computer_networks_and_systems/",
        "text": "I will be starting college next fall and I'm not sure what major to choose. A school near me has a Computer Networks and Systems major (CNS) and right now it's my #1 choice. [Here is a page of the major requirements.](https://wwws.ferris.edu/checksheets/checksheets/TE/CNS/BS/CNS_BS_TE_2018-2019.pdf)\n\nIt seems a lot more fitting for me than a computer science major since I want to work with networks and infrastructure and this major prepares for CCNA certification. And all the information tech majors in my state are 50% business classes.  This program also has programming classes(A quick look says C/C++ and Java) and electives in security, Linux, computer organization and simulation to name a few. \n\nI would like opinions on this please. Would this prepare me for a career in the Net Sec field? Would I be competitive with this major even if it's not regular comp sci? I'm interested in any careers related to network/cloud engineering or information security. ",
        "created_utc": 1531374477,
        "upvote_ratio": ""
    },
    {
        "title": "Maybe a silly question, but do you guys have smishing/vishing response playbook?",
        "author": "phyberports",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y4b4w/maybe_a_silly_question_but_do_you_guys_have/",
        "text": "How do you guys handle reports of these?\n\nMaybe to add more context, we do have our users report these to a phishing mailbox, but so far, we just use that report to warn the rest of our staff. I’m a little more concerned as we’ve recently been getting more reports from a particular executive at our company and I’m sure at some point, I am going to get asked what we are actually going to do to prevent these from reoccurring. ",
        "created_utc": 1531349601,
        "upvote_ratio": ""
    },
    {
        "title": "Books VS Online courses",
        "author": "AdiXop",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y476p/books_vs_online_courses/",
        "text": "What you think is better for someone who want to become a bug bounty hunter?",
        "created_utc": 1531348745,
        "upvote_ratio": ""
    },
    {
        "title": "A Call for Participation in a Research Study",
        "author": "pbutler6163",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y2bqd/a_call_for_participation_in_a_research_study/",
        "text": "## A Call for Participation in a Research Study\n\n**The research topic:**\n\nCybersecurity of Internet of Things devices within an industrial environment\n\n**The research problem:**\n\nThe  systems that make up every level of the Internet of Things (IoT) have  rapidly been assimilated into critical and essential roles in daily  lives. As the entire ecosystem of the IoT evolves and expands, the wide  range of functions and supporting components involved are resulting in  significant security and ultimately privacy challenges that need to be  addressed. The Industrial applications of IoT (IIoT) also referred as  Industry 4.0 (Schwab, 2017) suffer from very similar security and  privacy concerns as implementations that expand existing Operational  Technologies (OT) networks through the interconnection of smart sensors  and actuators with integrations into cloud computing platforms to create  intelligent infrastructures create vital links within energy,  transportation, manufacturing and automation.\n\n**The Research Purpose**\n\nThe  purpose of the proposed qualitative study is to explore, within the  Biochemical industry, the experiences of cyber-security professionals  who have experience in implementing Industrial Internet of Things  systems and devices and their perceptions of the security risks to these  systems, giving rise to a better understanding of the security and  privacy concerns that must be overcome.\n\n**The research question:**\n\n*Within  the Biochemical industry, what are the experiences of cyber-security  professionals who have implemented Industrial Internet of Things systems  and their perceptions of the security risks to these systems?* This  exploration may lead to a better understanding of the security  implications of a technology that is rapidly growing but is overlooked  within SCADA due to a false sense of security.\n\n**Research study participation:**\n\nFor  data collection, this research study needs at least 10 participants for  semi-structured interviews with an additional 2 for a pilot phase to  fine tune the questions. The interviews will be conducted via Skype  video conference calls in a nationwide scope. The primary focus of  participants will be individuals who currently work within the chemical,  biological, and pharmaceutical industries. Additionally, participants  should be identifiable cybersecurity professionals. Each participant  will answer about 10 interview questions.\n\n**Benefits of Participation**\n\nThere  may or may not be a direct benefit to participants in the study, but we  hope to further the knowledge required to implement IoT Devices into  industrial settings that will help organizations to improve their  security posture that could indirectly benefit everyone. Your  contribution will be recognized and acknowledged in the dissertation.\n\n**Confidentiality**\n\nDuring  the data collection and data analysis, every effort will be made to  ensure that participants of the study will in no way be able to  correlate their responses to their identity; the information will be  coded to mask participants identities and ensure the confidentiality of  the respondents. The data and records will be stored within an encrypted  offline medium, and this will be stored within a locked container. Only  the researcher will be allowed access to the data and the records, and  once the study is complete, the data and records will be securely  destroyed.\n\n**Payments**\n\nYou will receive the following payment/reimbursement: $25 Amazon Gift Card for participation, presentable upon completion of the interview.\n\n**Contact information:**\n\nIf  you would like to participate in this research study or functions as a  pilot for the questions or have any other questions regarding this  study, you may contact Patrick Butler at\n\n\\- Cell phone number: 201-873-4938\n\n\\- Email address: [patrick.butler1@student.ctuonline.edu](mailto:patrick.butler1@student.ctuonline.edu) or [patrick.butler@gmail.com](mailto:patrick.butler@gmail.com)\n\n\\- Linkedin social media network: [https://www.linkedin.com/in/patrickmbutler/](https://www.linkedin.com/in/patrickmbutler/)\n\nFor  questions regard the rights of research subjects, any complaints or comments regarding the manner in which the study is being conducted, you  may contact Colorado Technical University – Doctoral Programs at  719-598-0200.\n\n# References\n\nSchwab, K. (2017). *The fourth industrial   revolution.* New York: Crown Business.",
        "created_utc": 1531335256,
        "upvote_ratio": ""
    },
    {
        "title": "If you could go back in time what would you tell yourself in terms of what to learn (technology, tools, papers to read, projects to engage, anything) to be successful in your career now? What problems did you face recently that could be solved easier with previous knowledge of something?",
        "author": "pesofr",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y1ucf/if_you_could_go_back_in_time_what_would_you_tell/",
        "text": "I'm facing a new challenge in my life and I'm trying to compile useful information so I can prepare myself for it. It's a Security position in another country (out of my comfort zone per se) that involves Penetration Testing, Reverse Engineering, Malware Analysis and so on. *[I know it isn't possible to be prepared for every possible case though]*.  \n\nThat said:  \n* If you could go back in time what would you tell yourself in terms of what to learn (technology, tools, papers to read, anything to be honest) to be successful in your career?  \n* What you know now that you would like to know back in the beginning?  \n   \nMods: I hope this question is within the topics.",
        "created_utc": 1531331804,
        "upvote_ratio": ""
    },
    {
        "title": "Anatomy of Rakhni Ransomware Explained !",
        "author": "aka_hacks",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y0uqs/anatomy_of_rakhni_ransomware_explained/",
        "text": "Rakhni Ransomware which was first discovered in 2013, is now getting more and more advanced. Over the five years, ransomware has built with latest exploits and can now infect the victim machine with cryptocurrency miner too. Let’s see the full timeline of Rakhni. [Read More...](https://akahacks.com/2018/07/anatomy-rakhni-ransomware-explained/)",
        "created_utc": 1531325115,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some career advice",
        "author": "rootstein",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8y0sxn/looking_for_some_career_advice/",
        "text": "Hey there, so I'm looking to see if there's anything more I could be doing/doing different to further myself along to my goal. My goal right now is to get into security consulting i.e. pen testing and such.\n\n I'm a year away from graduating with a degree in software engineering and a minor in cyber security. I've worked as an IT field technician at my University for the past 2.5 years and I have a fairly strong programming background from coursework and my own little projects. Besides from concentrating on my final year of school, is there something I could be doing as of now to put myself in a more desirable position to get hired into that line of work? Also, are there things I could be looking into right now to help me get better at pen testing and ethical hacking? Thanks",
        "created_utc": 1531324765,
        "upvote_ratio": ""
    },
    {
        "title": "PCI compliance Question about transmission of card holder data",
        "author": "dday0002",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8xzroi/pci_compliance_question_about_transmission_of/",
        "text": "I'm working on a PCI Compliance project and my question revolves around around the transmission of card holder data. Is it still considered transmitting card holder data when the card holder data is encrypted via a p2pe device? Maybe this is a dumb question but i could see it going either way. If it weren't for the \"transmission of card holder data\" wording for SAQ A we would fall into that category, otherwise the rest of the categories don't really fit our situation. ",
        "created_utc": 1531317289,
        "upvote_ratio": ""
    },
    {
        "title": "Former consultants: What do you do now?",
        "author": "Uscuba2_18",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8xzqnl/former_consultants_what_do_you_do_now/",
        "text": "I have been doing the consulting thing for  2 and half years. I have been doing a mix of pen testing/vuln and compliance work. I am  thinking I am  burning out  so I have been looking for a change. So my question is what type of role/title  did you  seek when  you left consultanting?",
        "created_utc": 1531317051,
        "upvote_ratio": ""
    },
    {
        "title": "What are the interview processes like for Security Engineer's at Facebook and Google?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8xxcre/what_are_the_interview_processes_like_for/",
        "text": "[deleted]",
        "created_utc": 1531291740,
        "upvote_ratio": ""
    },
    {
        "title": "What to do with past incident?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskNetsec/comments/8xxace/what_to_do_with_past_incident/",
        "text": "[removed]",
        "created_utc": 1531290996,
        "upvote_ratio": ""
    }
]