[
    {
        "title": "Zone of Truth Unethical?",
        "author": "sincerequest",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11evvzl/zone_of_truth_unethical/",
        "text": "[removed]",
        "created_utc": 1677650348,
        "upvote_ratio": 1.0
    },
    {
        "title": "After ~10 years of passively, slowly, casually self \"studying\" Philosophy, I'm not sure what, if anything, I've learned.",
        "author": "wxcore",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11evnbd/after_10_years_of_passively_slowly_casually_self/",
        "text": "Apologies for this *very* long post:\n\nOver a decade ago, my journey into exploring ways to approach life and thinking and value started when I read an autobiography by a ex-juvenile delinquent/criminal turned Buddhist. It got me thinking more about how to experience the world in a positive light despite everything feeling like shit all the time.\n\nThen I started listening to Philosophize This on my long commutes to work. I know this sub and the more serious-minded philosophy enthusiasts/graduates/etc don’t take that podcast seriously. Maybe it was a mistake. I don’t know.\n\nThen I would watch things like Crash Course Philosophy. Then School of Life videos about various Philosophers. A few Philosophy Tube videos, a few Then &amp; Now videos. Then I watched Shelly Kagan’s Yale course on death. I watched Michael Sugrue lectures. I read Ryan Holiday pitch Stoicism like it was a get rich quick scheme.\n\nI read Siddhartha. It was nice, but I already knew the main bullet points.\nI read a tiny bit of Thus Spake Zarathustra. It was hard to understand.\nI read a tinier bit of The Myth of Sisyphus. It was even harder to understand.\nI read a tiny bit of Meditations. It didn’t really grab me.\n\nI read some of The Philosophy Book: Big Ideas Simply Explained and some of another pint-sized “crash course” of Philosophy book that I keep next to the toilet.\n\nAll of the above over the past 10ish years and all I think I really know is the following:\n\n* Plato thought all trees and the way each of us see a tree relates to some form of a “tree.” And the thing about the cave, which anyone who spends 5 minutes hearing a synopsis can understand and carry with them forever.\n\n* Socrates might have been real or made up by Plato, but he died proud of questioning authority and the status quo. Basically Jesus of Philosophy.\n\n* Descarte was skeptical about everything and came up with the “I think therefore I am” thing.\n\n* Hobbes believed a monarch was the best way to run a government. Maybe for the time he was alive that was true, but I imagine most people disagree with it today and it might not be useful anymore?\n\n* Kant married two ideas that you couldn’t know anything unless you observed it and that you could only know things by deducing them logically in your mind. He, or the people who talk about him, are obsessed with unmarried bachelors, the four sides of a house, and the position of a boat out at sea. Apparently we all wear spectacles we can’t take off and only perceive existence through them and can’t actually know real reality because of them.\n\n* Camus doesn’t think you should kill yourself even though it’s an enticing idea since the world has no meaning.\n\n* Baudrillard thinks we don’t value things because of their usefulness or even perceived value anymore and only worship signs (which are a form of made up value? Idk.)\n\nAnd that’s about it. On one hand I feel like I need to take notes and learn all the little details about various Philosophers throughout history and how they compare to each other, but then I wonder what usefulness that has in terms of taking the ideas away and applying value to my own life. I’m not about to read The Critique of Pure Reason when I can barely grasp what Kant is talking about from the various filters through which I’ve experienced the main ideas.\n\nI’m not sure where to go from here. Just buckle down and actually read The Republic? Something else? Give it all up entirely? I can’t help but feel drawn and fascinated by the practice of Philosophy, but after all this time and my half-hearted effort, I’m wondering what I should even expect to take away from it all.\n\nSorry for the long post. Thank you to anyone who reads it.",
        "created_utc": 1677649546,
        "upvote_ratio": 0.76
    },
    {
        "title": "Negative numbers?",
        "author": "Acanthophis_metalis",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11evhgv/negative_numbers/",
        "text": "Conceptually, it seems like numbers refer to amounts of things. I can't think of another definition or a case where this isn't true. In that case though, what do negative numbers refer to? How could there exist fewer than 0 things?",
        "created_utc": 1677649014,
        "upvote_ratio": 0.8
    },
    {
        "title": "If we think of a thought (some kind of information) as a set by using the set theory, what would count as a single element in this set?",
        "author": "CompisPaDum",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11evgbh/if_we_think_of_a_thought_some_kind_of_information/",
        "text": "",
        "created_utc": 1677648909,
        "upvote_ratio": 0.5
    },
    {
        "title": "is my understanding about descriptive ethics right?",
        "author": "Agitated-Ebb1198",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ev8ly/is_my_understanding_about_descriptive_ethics_right/",
        "text": "- what do people think is right\n\n- it describe how people behave and what moral standards they claim to follow\n\n- beliefs can neither be right or wrong\n\n- reasons of their decisions \n\n- the study of peoples beliefs about morality\n\n- good example is when a person facing a moral dilemma",
        "created_utc": 1677648219,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would Baudrillard think of Replika?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677644517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Descartes' demon prove that all valid arguments are instead invalid?",
        "author": "tragiclight",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11etlo9/can_descartes_demon_prove_that_all_valid/",
        "text": "If such a deceiving evil demon is possible, could it act as an invalidating counterexample to every valid argument?",
        "created_utc": 1677643219,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a world where everyone has eternal life, does murder become more or less immoral?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677641758,
        "upvote_ratio": 0.4
    },
    {
        "title": "ELI5: (1) 🠆 Material Implication vs. (2.) ⇒ Logical Implication vs. (3) ⊢ Turnstile vs. (4) ⊨ Double Turnstile.",
        "author": "3cana",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11esynq/eli5_1_material_implication_vs_2_logical/",
        "text": "[removed]",
        "created_utc": 1677641366,
        "upvote_ratio": 0.5
    },
    {
        "title": "Within existentialism, what is \"meaning?\"",
        "author": "vaguelystem",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11esy2t/within_existentialism_what_is_meaning/",
        "text": "For use by specific, major existential philosophers, let's say Sartre and Heidegger. I'm also interested in more colloquial, philosophy-adjacent uses by people like Viktor Frankl and Jordan Peterson (I tried reading one of Peterson's papers on meaning, but found it incomprehensibly circular. Amusingly, he also did a lot of self-citation.) and the phrase \"the 'meaning' of life.\" Why do people say that?\n\nThanks!",
        "created_utc": 1677641323,
        "upvote_ratio": 0.84
    },
    {
        "title": "Which sentence did Wittgenstein write that lead Bertrand Russell believe that he was a genius?",
        "author": "MAndrew502",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11esvi5/which_sentence_did_wittgenstein_write_that_lead/",
        "text": "I'm listening to an interview where Bertrand Russell asks Wittgenstein to write an essay to see if he should become a philosopher. After reading the first sentence, he knew Wittgenstein was a genius. I was wondering where I could find this essay. I'm pretty intrigued.",
        "created_utc": 1677641111,
        "upvote_ratio": 0.93
    },
    {
        "title": "What philosophers made the best use of visual aids and diagrams?",
        "author": "fatty2cent",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11esc0w/what_philosophers_made_the_best_use_of_visual/",
        "text": "As someone who likes graphic design and an appreciation for esoteric artwork, I was wondering what philosophers made the best use of visual media to explain or expound on their philosophy?",
        "created_utc": 1677639626,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good books for beginners to get a broad overview of philosophical topics and ideas?",
        "author": "BruhestMoment12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11er4c6/what_are_some_good_books_for_beginners_to_get_a/",
        "text": "",
        "created_utc": 1677636266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there consciousness during the very initial* phase of death and if so, would that mean that consciousness is separate from our brains and bodies?",
        "author": "MayWeMeetAgain2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eqv5p/is_there_consciousness_during_the_very_initial/",
        "text": "I'm not from a philosophical background, so please explain things to me as if I'm a child. \n\nI was looking into near-death experiences (NDEs) the other day which piqued my interest in this topic. Because, typically, I assume that once there's no activity in the brain, and the body has shut down, that would mean that consciousness too is annihilated. But with NDEs, so many people who've been resuscitated claim that they were aware of what was happening to them despite them technically being dead. So, does that mean that consciousness is retained even though there seems to be no detectable brain activity? Are there any readings or philosophers you could point out to me that suggest something similar? \n\n\\*And by initial phase of death, I mean like the first couple of hours after an individual is deemed clinically dead.",
        "created_utc": 1677635572,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we are completely unaware/non existent for eternity after we die, shouldn’t life feel like eternity? And because it doesn’t, wouldn’t that point to some form of consciousness after?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677635098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does ability depend in any way on the state of the external world?",
        "author": "pistolpierre",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11epqf1/does_ability_depend_in_any_way_on_the_state_of/",
        "text": "For example, does a professional piano player have the ability to play piano if all pianos in the world are destroyed?",
        "created_utc": 1677632529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about general reference works",
        "author": "That_Efficiency_3122",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11epozu/question_about_general_reference_works/",
        "text": "Hi everyone. I've been interested in philosophy on-and-off for about ten years, and I've been working on trying to get a more focused and detailed grasp of it all. One thing I'd like to have at my disposal is a general or encyclopedia-/dictionary-adjacent reference to all the important jargon and people (for whatever that may be worth).\n\nI am and have been aware of the Stanford Encyclopedia for at least half this time, but I recently became aware of the Oxford Companion to Philosophy. Thumbed through it recently and I was impressed especially by its inclusion of non-Western figures and terminology. Thing is, it's coming up on 2 decades old, and I worry that things may be outdated.\n\nMy question is what would be the best source or sources to go with as far as a general reference for philosophy that would give me a good amount of detail and accuracy? Is Stanford the end-all? Oxford Companion? Some mix of the two and/or some other resource I've overlooked?\n\nI would really appreciate it to hear what others here with more knowledge and experience think of these and other reference sources, both strengths and shortcomings.",
        "created_utc": 1677632443,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would a utilitarian say about abortion?",
        "author": "Seahawks1991",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eojt7/what_would_a_utilitarian_say_about_abortion/",
        "text": "",
        "created_utc": 1677629425,
        "upvote_ratio": 0.25
    },
    {
        "title": "What are the best arguments against David Lewis’ Humean Supervenience? (Metaphysics)",
        "author": "CosmicFaust11",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11en0pm/what_are_the_best_arguments_against_david_lewis/",
        "text": "David Lewis in the late twentieth century defended a position he called Human Supervenience. It is part of the neo-Humean metaphysics which is a popular paradigm today in contemporary metaphysics and philosophy of science. It is a form of atomism and ontological reductionism. Atomism is the metaphysical framework which holds that the world is not an indivisible whole, but rather, is made up of and reducible to its parts — that the world is an aggregate of parts. This is contrasted with metaphysical holism which is a metaphysical framework which holds that the world is a single, indivisible whole, not reducible to the sum of its parts.\nLewis described his metaphysical vision of reality by saying “It is the doctrine that all there is to the world is a vast mosaic of local matters of particular fact, just one little thing and then another.” It is the theory that theory that said that there was nothing to reality except the spatio-temporal distribution of local natural properties. According to him, there are identifiable fundamental physical objects at points in spacetime. He did this by showing in detail how laws, chances, counterfactual dependence, causation, dispositions and colours could be located within this Humean mosaic. \n\nHumean Supervenience can thus be seen as the conjunction of three theses.\n1. Truth supervenes on being (Bigelow, 1988). That is, all the facts about a world supervene on facts about which individuals instantiate which fundamen- tal properties and relations.\n2. Anti-haeccaetism. All the facts about a world supervene on the distribution of qualitative properties and relations; rearranging which properties hang on which ‘hooks’ doesn’t change any facts.\n3. Spatio-temporalism. The only fundamental relations that are actually instantiated are spatio-temporal, and all fundamental properties are properties of points or point-sized occupants of points.\n\nWith Humean Supervenience explained, I was therefore wondering what are some of the best arguments that can be utilised against it? These can be arguments which are more philosophically motivated (a priori) or even scientifically motivated (a posteriori). Further links or readings for me to do further research into is fine too. I really appreciate any help on this. Thanks everyone 👍🏻.",
        "created_utc": 1677625608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can dasein be the object of politics?",
        "author": "RegretingRejoining",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11emw63/can_dasein_be_the_object_of_politics/",
        "text": "Alexander Dugin tries to argue this in his Fourth Political Theory. I thought it made no sense when I read it, but maybe I either don't understand Heidegger well enough or I'm too admittedly biased against Dugin.",
        "created_utc": 1677625310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memory and identity",
        "author": "anonymouslindatown",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11emd3x/memory_and_identity/",
        "text": "there's a lot of personal background here but I'll spare you the details and just ask the question. \n\nIf memory is faulty, easily manipulatable and often just flat out wrong and we can't know which memory is true and which is false, can we have identities? Who are we?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nthis is my first time posting here so please let me know if i did something wrong.",
        "created_utc": 1677624053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is democratic politics better than totalitarian politics?",
        "author": "Tabbycatties",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11em4i2/why_is_democratic_politics_better_than/",
        "text": "If there’s no neutral criteria to appeal to, how do we justify democratic politics (or liberal practices) to unconvinced populations? \n\nMy initial thought is to say ‘when we allowed more people to have a say on how things should work, we found that more people are happier’.",
        "created_utc": 1677623477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is worse, a person who does evil and knows it is wrong, or a person who does evil and thinks it is right ?",
        "author": "agent007653",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eikwt/which_is_worse_a_person_who_does_evil_and_knows/",
        "text": "This question has been bothering me for a while",
        "created_utc": 1677615155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a consensus of philosophers on solipsism?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ei4n9/is_there_a_consensus_of_philosophers_on_solipsism/",
        "text": "What does professional philosophy say about solipsism? \n\nDo professional philosophers consider solipsism true? \n\nChatGPT said that solipsism is true. \nWhat does it mean? Is there evidence of solipsism?",
        "created_utc": 1677614131,
        "upvote_ratio": 1.0
    },
    {
        "title": "indirect derivation logic",
        "author": "Sure-Ad-9016",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ehsxi/indirect_derivation_logic/",
        "text": "hello! for the philosophy subject logic i am struggling and have a question \n\nwhen you’re proving something using indirect derivation and u need to show a contradiction is it only for individual sentence letters \n\ne.g., would having -|(P-&gt;Q) and (P-&gt;Q) count as indirect derivation \nor would it have to be -|P and P\n\nthank u!!!!!!",
        "created_utc": 1677613346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timmons Third Edition/ Virtue Ethics and Care Ethics - I don't understand the Theory of Right Conduct?",
        "author": "bygonesbebygones2021",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ehkb8/timmons_third_edition_virtue_ethics_and_care/",
        "text": "Totally stressed rn.\n\n&amp;#x200B;\n\nI have an essay due on a review of Virtue Ethics and Care Ethics.\n\nCould someone please please explain the Theory of Right Conduct?",
        "created_utc": 1677612770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about an example in Simulacra and Simulation by Jean Baudrillard",
        "author": "duudewaht",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11egohh/question_about_an_example_in_simulacra_and/",
        "text": "Hey askphilosophy,\n\nI'm reading Simulacra and Simulation and so far its a good read but I found this example that either is simply poorly conceived or is going straight over my head. \n\nOn pg 20 Baudrillard talks about a simulated hold in order to talk about how \"Simulation is infinitely more dangerous because it always leaves open to supposition that, above and beyond its object, law and order themselves might be nothing by simulation\"\n\nHe goes onto the example which says \n\n\"Organize a fake holdup. Verify that your weapons are harmless, and take the most trustworthy hostage, so that no human life will be in danger (or one lapses into the criminal). Demand a ransom, and make it so that the operation creates as much commotion as possible - in short, remain close to the \"truth,\" in order to test the reaction of the apparatus to a perfect simulacrum. You won't be able to do it: the network of artificial signs will become inextricably mixed up with real elements (a policeman will really fire on sight; a client of the bank will faint and die of a heart attack; one will actually pay you the phony ransom), in short, you will immediately find yourself once again, without wishing it, in the real, one of whose functions is precisely to devour any attempt at simulation, to reduce everything to the real - that is, to the established order itself, well before institutions and justice come into play.\"\n\nMy question is then; how is this any different than a simple misunderstanding? is that what simulation is then? Just an acute immutable misunderstanding? Any input is welcome, directly answering or just guesses.",
        "created_utc": 1677610718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a list of books that could sufficiently replace a bachelor's degree in philosophy? I understand that college gives you the experience of speaking to others - but I wonder if there is a list of books that could sufficiently be degree equivalent?",
        "author": "Isatis_tinctoria",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11egc4c/is_there_a_list_of_books_that_could_sufficiently/",
        "text": "Is there a list of books that could sufficiently replace a bachelor's degree in some subjects such as philosophy? I understand that college gives you the experience of speaking to others - but I wonder if there is a list of books that could sufficiently be degree equivalent?\n\nWhich books would qualify as 50-100 books for a philosophy degree?",
        "created_utc": 1677609892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who does this thought belong to? Quote that I have heard from someone in the past",
        "author": "Ohandbytheway12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eg1x5/who_does_this_thought_belong_to_quote_that_i_have/",
        "text": "Many years ago in a conversation, one person told me that this philosopher (maybe socrates, but I am not sure) - was describing democracy. And one of his students asked him, but what about the slaves? to what he replied: that slaves will remain slaves. \n\nThis is a very rough recalling, of already not precise recalling of the quotte.\n\nCould anyone tell me, what is the exact quote and who it belongs to?",
        "created_utc": 1677609214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are actions black and white?",
        "author": "peer_review333",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ef027/are_actions_black_and_white/",
        "text": "As a deontologist I see a failure to be a good husband or father as black or white. As it’s my duty. But some times my mistakes are due to reasons out of my control.  Where does grey start? Some acts are evil and that’s black or white. If the offense is minor is it grey? \n\nWhat ethical acts warrant black and white thinking? What ethical acts warrant grey explanations? This may be a question for psychology but i thought id throw it out there",
        "created_utc": 1677606648,
        "upvote_ratio": 1.0
    },
    {
        "title": "If something is going to happen infinitely far in the future, will it eventually happen or never?",
        "author": "eMDeKaeS",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eeom5/if_something_is_going_to_happen_infinitely_far_in/",
        "text": "For example. Some being lose consciousness. And it is said that it will regain it for an infinitely long period of time. And we have another being that will observe that first being until it regain consciousness.    \n\nAnd my thought is. From the perspective of the first being that infinitely long period of time will pass in an instant but the second being will never see the first being regaining consciousness.    \n\nThe paradox there would be that when the first being will regain its consciousness it would meet the second one.    \n\nWhat do you think about this?",
        "created_utc": 1677605869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone recommend literature about \"the state as a moral agent.\"",
        "author": "charlie_lack",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eehog/can_anyone_recommend_literature_about_the_state/",
        "text": "Specifically in terms of what is owed to citizens, on behalf of the state...perhaps as a moral agent.",
        "created_utc": 1677605418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the root of sperate legal entity came into existence due to puppet kings during ancient period?",
        "author": "shepherd_scholar",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eecnm/is_the_root_of_sperate_legal_entity_came_into/",
        "text": "",
        "created_utc": 1677605073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are ethics useful when they do not work in practice?",
        "author": "ReverendBarosa",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ee5v4/why_are_ethics_useful_when_they_do_not_work_in/",
        "text": "I was thinking about ethics, but they don't always work in practice.\n\nFor example, a nurse that has an aggressive patient in a nursing home. The nurse has the responsibility to take care of the patient. The patient is ethically wrong, if he's aggressive because he's frustrated with the situation and taking it out on the nurse.\n\nHowever, there is nothing that protects the nurse. The patient is always in the right and cannot be cut loose because his right to healthcare weighs heavier than a safe environment for the nurse. \n\nI find this a huge problem, and it makes me wonder if ethics even work. Healthcare workers keep facing more and more aggression, and it's not like anyone is doing anything about it.\n\nOf course, you could just sedate aggressive patients, but that goes against the autonomy of said patients and while I do agree that it's wrong to just sedate people left and right. I also feel it's wrong to let health care workers face aggressive or violent patients. \n\nSo I feel like ethics fail because you can in this situation make up no ethical or good solution. Other than that the healthcare workers just have to 'deal' with it. All types of deescalation are always the responsibility of the patient. The patient has 0 responsibilities til they become so aggressive they are send to a special ward where they can be sedated against their will...\n\nIt might be I don't have a good understanding of ethics, forgive me if this is the case. I have tried to read some philosophies though and I cannot really find an answer. I don't see the point of ethics, when it cannot solve issues like this. But maybe it can and I'm just inept.",
        "created_utc": 1677604625,
        "upvote_ratio": 1.0
    },
    {
        "title": "nihilism and socrates",
        "author": "2_look_again",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11eblqi/nihilism_and_socrates/",
        "text": "\nin apology it's famously quoted \"i know that i don't know\"\nand it embarks socrates on his quest to find out.  if he does not know and can't know, is socrates a nihilist?  or does he think you can indeed know, and at least he knows that he doesn't know.",
        "created_utc": 1677598794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book recommendation on materialism and consciousness for a layperson?",
        "author": "Bellgard",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ebh8l/book_recommendation_on_materialism_and/",
        "text": "My book club has recently been having some solid philosophical discussions around materialism, the hard problem of consciousness / mind-body problem, and related ideas. I'm curious to know if there are any well regarded books that give really clear and interesting discussions of these topics. However, none of us are philosophers it'd be great if the book is very readable by a layperson (e.g. &lt; \\~500 pages, not extremely dense prose, not filled with philosophy jargon that it doesn't define, etc.). The group does contain several career physicists, so strong preference for non-woo books, and it doesn't need to shy away from hardcore physics. Thanks!",
        "created_utc": 1677598583,
        "upvote_ratio": 1.0
    },
    {
        "title": "is socrates a nihilist?",
        "author": "2_look_again",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ebh0w/is_socrates_a_nihilist/",
        "text": "if he says he doesn't know anything, isn't he a nihilist?",
        "created_utc": 1677598573,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the arguments against Transcendental Idealism?",
        "author": "throwawayphaccount",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e9qmr/what_are_the_arguments_against_transcendental/",
        "text": "Most contemporary philosophers are realist. This means that they reject all forms of idealism like Kant's. Kant says that our perceptions are filtered through our cognitive capacities. This implies that all we have our appearances. How do current philosophers argue that we have direct access to the objects of our perceptions?",
        "created_utc": 1677596382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any valid ways of refuting Zagzebski and the 'Inescapability of Gettier Problems'?",
        "author": "LemonSheep35",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e7xl2/are_there_any_valid_ways_of_refuting_zagzebski/",
        "text": "I read the paper recently and have been trying to think of a way to refute it but haven't had much success. Does anyone know of any criticisms levelled against it, or have any of their own?",
        "created_utc": 1677594194,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does Hegel mean by",
        "author": "T-rexTess",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e6xdu/what_does_hegel_mean_by/",
        "text": "Essence, notion, being. \n\nI'm reading Hegel and i still don't really get what these 3 terms are representing.\n\nThanks in advance",
        "created_utc": 1677593030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with Derrida",
        "author": "satanstolemybiscuit",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e6jh7/help_with_derrida/",
        "text": "I've been getting into a bit of derrida recently, however, I feel like I don't know where to go next with his work. \n\nI've read Of Grammatology, and Specters of Marx, but outside of the shorter essays, I found Writing and Difference a bit dense. So I was wondering what else of his is an \"easy read,\" or has overtly political themes like Specters.\n\nAlternatively, any other texts that would help me understand Derrida better would be appreciated as well.",
        "created_utc": 1677592290,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about 'Hegelian cybernetics'",
        "author": "Rentokill_boy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e6ipp/question_about_hegelian_cybernetics/",
        "text": "My hobbyist's understanding of Hegel is that he views the process of history as a dialectical unfolding of knowledge towards the Absolute. How do we integrate this process of knowing into a world-system of supersensory, suprahuman awareness, where an increasing proportion of knowing is realised and and interpreted entirely by minimally-human cybernetic systems? What about the output of these systems, which is necessarily integrated into our own systems of knowledge, changing the axis of their development?\n\nIs the origin of knowledge important to the movement of history towards absolute knowing? Has anyone written about this?",
        "created_utc": 1677592231,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is descriptive ethics? and give example",
        "author": "Agitated-Ebb1198",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e5f7u/what_is_descriptive_ethics_and_give_example/",
        "text": "",
        "created_utc": 1677589071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any good arguments for the existance of god?",
        "author": "Fafnir26",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e50mc/are_there_any_good_arguments_for_the_existance_of/",
        "text": "I am currently an atheist, but I wonder if there are good philosophical arguments for theism. You see a lot of debunking of religious ideas, but mostly done by people without a good philosophical training. Most professional philosophers still seem to have moved away from the idea of a god, or am I wrong? Are theistic ideas just really easy to debunk?",
        "created_utc": 1677587828,
        "upvote_ratio": 1.0
    },
    {
        "title": "William James said that he could only understand Hegel when he was on nitrous oxide. What are modern philosophy’s thoughts on epistemology and drug use?",
        "author": "cockratesandgayto",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e1rg5/william_james_said_that_he_could_only_understand/",
        "text": "",
        "created_utc": 1677576237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heidegger and metaphysics",
        "author": "Competitive_Big7710",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e1o4d/heidegger_and_metaphysics/",
        "text": "Hi, \nI've been studying Heidegger quite a lot during the last few months. I am, however, really perplexed about something and I would like to hear some of your opinions on it. Hopefully, you will help me understand more.\n\nThe thing is: Heidegger wants to 'destroy' and 'transcend' metaphysics while doing metaphysics. I understand he wants to undermine the whole traditional approach and way of doing metaphysics, but it does not seem that he actually transcends or abandon metaphysics as such (he even had the famous beef with Carnap). Correct me if I am wrong, but what he does is clearly metaphysics. I would say that he just does metaphysics differently, in a new way, that he just shifts the paradigm of metaphysics or something like that. \n\nAm I misunderstanding something? Where is the problem?",
        "created_utc": 1677575882,
        "upvote_ratio": 1.0
    },
    {
        "title": "The open mindset conundrum",
        "author": "Lookupandbeyond",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e1hg1/the_open_mindset_conundrum/",
        "text": "",
        "created_utc": 1677575165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it morally wrong to sexualize someone?",
        "author": "ponysniper2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11e0akw/is_it_morally_wrong_to_sexualize_someone/",
        "text": "Is it morally wrong to sexualize someone? Is sexualizing someone natural? Are there different levels of sexualizing that can be viewed as tolerable while others are not? Is sexualizing purely a mental thing not driven by biological measures?\n\nHave been having this conversation with a friend a couple of times now. She states men sexualize women more than women sexualize men. I would agree with this statement. She also states that men should not sexualize women. I can see her sentiment behind this statement and want to agree, but it seems to me that sexualizing is something biological. Something we as people can't control initially but can stop once it has started. As in, you can find someone attractive but not think about having sex with them. Or something happening that ruins the initial attraction to them for you. To act on one's attraction and continue to entertain that idea is where I can see someone coming up with an argument against sexualization.\n\nShe states one should not be sexualized unless you give other's consent to do so. I'm stumped on this statement. On one hand I don't see how you can justify trying to control someone's thoughts as moral, even if you have the best intentions in mind. On the other hand, I understand people's discomfort with having relatively unwanted unsolicited thoughts about them. What are your thoughts on this?",
        "created_utc": 1677570519,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does “Garbage time is running out. Can what is playing you make it to Level 2?” mean from Nick Land?",
        "author": "EnesKanterFan1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dzpo5/what_does_garbage_time_is_running_out_can_what_is/",
        "text": "This is a relatively famous quote from Nick Land. The full quote is “Level 1, or world-space, is an anthropomorphically scaled, predominantly vision-configured, massively multi-slotted reality system that is obsolescing very rapidly. Garbage time is running out. Can what is playing you make it to Level 2?”. This quote is on the back of the “Fanged Noumena” book, and I’ve seen it quoted more than once. The quote is ripped from one of his works titled *Meltdown*, and to be honest is mostly an incomprehensible science-fiction dystopian nightmare. I’m just wondering if anyone familiar with Land can explain the significance of this quote if there is any to be found, as I have seen it more than once. Thanks.",
        "created_utc": 1677568301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should a layman read philosophy books?",
        "author": "MonzaDZD",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dz8y2/should_a_layman_read_philosophy_books/",
        "text": "For context I’ve been out of college for a few years, I work full time and have no plans to go back. I have 0 experience in philosophy.\n\nIs it worth my time to read philosophy books  if I have no one to guide me or talk to?\n\nIt will be a hobby for me. My goals are to read more and practice my critical thinking skills.\n\nThank you",
        "created_utc": 1677566587,
        "upvote_ratio": 1.0
    },
    {
        "title": "What constitutes philosophy?",
        "author": "SteveSonOfJobs",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dyo9c/what_constitutes_philosophy/",
        "text": "As far as I could tell, you can have any type of claim and any type of argument. And that just seems more or less what all humans do on a daily basis. \n\nIs there a definition that really draws the line between casual arguments and what is considered rigorous philosophy?",
        "created_utc": 1677564582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which female ancient figures did women read from to study selfhood/self-actualization?",
        "author": "polskachao",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dxk74/which_female_ancient_figures_did_women_read_from/",
        "text": "[removed]",
        "created_utc": 1677560907,
        "upvote_ratio": 1.0
    },
    {
        "title": "To change or not to change the future",
        "author": "DruidPaw",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dwzeg/to_change_or_not_to_change_the_future/",
        "text": "I am not sure if someone has asked this before but I wish to ask this now. We have all imagined ourselves if we could live out our fantasy and be a character in our favorite fantasy universe or historically wise sent to the past. We have the foreknowledge of how future outcomes are going to play out. Having said knowledge we have the possibly changing the outcome of the future. My question is it ethically correct or wrong to change the future. Putting aside the argument if said party or parties believe, do we have an obligation to inform of said outcomes or should we do our best to remove ourselves from the equation and let things play out as they should? If we were to change the future would it lead to a better future or would we lose something important for example knowledge or wisdom from experience? (I remember as a saying, “Don't throw the baby out with the bathwater”)",
        "created_utc": 1677559059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Secondary reading suggestions for heidegger?",
        "author": "Mudtxwn",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dvk9d/secondary_reading_suggestions_for_heidegger/",
        "text": "Hi all I’m struggling with Heidegger at the minute (pray for me) and have been told secondary reading is the way. I’m looking for recommendations of secondary reading on his critiques of Cartesianism",
        "created_utc": 1677554700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any deep philosophical book on social media and smartphone usage?",
        "author": "WKant",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11du4wt/any_deep_philosophical_book_on_social_media_and/",
        "text": "Hi. I've been wondering if there is a good and deep philosophical book on the subject of social media and more broadly on the age of smartphones.\n\nI know Zygmunt Bauman and Zizek both touches on the subject, but I know no work more lenghty focusing specific in this recent fact of our society.",
        "created_utc": 1677550638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why philosophy can't decide?",
        "author": "ButterySmoothBrane",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11du1ai/why_philosophy_cant_decide/",
        "text": "You have your Pragmatism, Deontology, compatibilism, libertarianism, or no free will, and many more. Why it can't decide and say this is complete wrong, and this is completely right? Why it has to be fence sitting all the time?",
        "created_utc": 1677550352,
        "upvote_ratio": 1.0
    },
    {
        "title": "second order logic help (!!)",
        "author": "Sad-Tutor-6089",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dtvxs/second_order_logic_help/",
        "text": "I'm trying to learn more about logic and according to the book I'm reading this: ∃z∃u∀X((Xz &amp; ∀x(Xx → Xu(x)))→ ∀xXx) is true in an interpretation if and only if the domain is enumerable and this: ∃z∃u(∀x z =/= u(x) &amp; ∀x∀y(u(x) = u(y)→ x = y)) is iff the domain is infinite. I don't understand why?? If anyone could explain I'd be forever grateful.",
        "created_utc": 1677549924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is erotic literature unethical?",
        "author": "reape7r",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dtiro/is_erotic_literature_unethical/",
        "text": "Assuming the literature is about consenting adults. I think the porn industry is exploitive and unethical. Maybe home made couple videos may be ok, but for most porn that makes big bucks don’t care about the well-being of their actresses. And that’s just about consenting adult porn. Thankfully I’m not into the more evil stuff. So erotic literature or drawings seem to be a no harm alternative to live acting porn. No one is hurt. Is there harm to erotic literature?",
        "created_utc": 1677548917,
        "upvote_ratio": 1.0
    },
    {
        "title": "supererogatory vs. obligatory in utilitarianism / Consequentialism",
        "author": "Philience",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dsrl4/supererogatory_vs_obligatory_in_utilitarianism/",
        "text": "Hello,   \na common criticism of utilitarianism is that it is overly demanding and often it is said -or implicitly assumed- that there is no distinction between supererogatory action (actions that are nice to do, but not obligatory) and obligatory actions.   \nsurely there are philosophers that do not accept that. Do you know any who argue for supererogatory actions in utilitarianism or consequentialism?  \nAlso if you know arguments in favor of any of the two positions, I'd like to hear them.",
        "created_utc": 1677546836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help remembering the name of a concept",
        "author": "_escapevelocity",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dsf98/help_remembering_the_name_of_a_concept/",
        "text": "Can’t remember what this is called. It’s the idea that a thing is bad if the outcome of everyone doing it is bad. Like me taking a leaf off a tree has almost no impact on the tree, but I shouldn’t do it because if everyone did it it would kill the tree.",
        "created_utc": 1677545933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there such a thing as a paragon of ethics and/or morality?",
        "author": "Archi_violencia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dsegs/is_there_such_a_thing_as_a_paragon_of_ethics/",
        "text": "Something that we're absolutely 100% certain it's right. Something objective. Not something that we believe in.",
        "created_utc": 1677545871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critique to Religion Essay",
        "author": "Alice_Arisuin",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ds76t/critique_to_religion_essay/",
        "text": "I'm a college freshman and I just got introduced to my first full fledged essay which is an argumentative research paper.  \n I've chosen the prompt on my opinion of the flaw in humanity's use of religion. The basic idea being that religion as an idea is perfect, however in practice it can cause acts we would never think of. Having religion as one of if not the only thing we believe in without proof, some people inherit the ideas of \"words of god\", and this can be extremely dangerous. If not only for the fact of using religion as an excuse for evil.   \nExamples being The Crusades (war stemmed from religion), or the KKK's \"religious calling\"  \n\n\nI came to here because I was wanting to get feedback on my prompt  \n\n\nand especially could really use some ideas for sources and material I could use to research it. Anything helps! Thank you so much!",
        "created_utc": 1677545313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong to say that Capitalism was invented/born when human began to trade or that the job “merchant” was created?",
        "author": "Spare_Menu8688",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dr9hf/is_it_wrong_to_say_that_capitalism_was/",
        "text": "I know that Adam Smith first coined the term in 1854 but isn’t capitalism just trading and accumulating wealth? Best, thanks!",
        "created_utc": 1677542803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it wrong to say that capitalism was born/invented when human began to trade? I know Adam Smith defined first the term in 1854.",
        "author": "Spare_Menu8688",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dr6j1/is_it_wrong_to_say_that_capitalism_was/",
        "text": "As title. thanks!",
        "created_utc": 1677542587,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be a good reading list for a neophyte interested in accelerationism?",
        "author": "Small-Manner6878",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11do1si/what_would_be_a_good_reading_list_for_a_neophyte/",
        "text": "Also is there a good reading list in general?",
        "created_utc": 1677534788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Papers to use as arguments against David Lewis's appeal to transitivity?",
        "author": "Eyk13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dnpun/papers_to_use_as_arguments_against_david_lewiss/",
        "text": "What are the strongest objections/ alternatives to Lewis's argument for transitivity (about causation)",
        "created_utc": 1677533975,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you debunk last thursdayism completely?",
        "author": "LankyTrouble1101",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dnec0/how_can_you_debunk_last_thursdayism_completely/",
        "text": "[removed]",
        "created_utc": 1677533203,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you determine the \"validity\" of an ethics system? If I made an ethics system right now called \"Ice cream hoarding-ism\" where you should own as much ice cream as possible and its always morally correct to take ice cream from other people, would that be valid?",
        "author": "xe36x",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dnbj3/how_do_you_determine_the_validity_of_an_ethics/",
        "text": "",
        "created_utc": 1677533012,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the relationship between real patterns and mereological nihilism?",
        "author": "LordBritannicus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dn9iy/what_is_the_relationship_between_real_patterns/",
        "text": "I’ve recently been thinking about Real Patterns and I believe an almost unacknowledged strength is that they seem to work with anything. After delving into quantum monism, I’ve found proposals that unify various monisms (including existence and Priority) with real patterns used to recapture higher ontology in place of mereological composition. \n\nRarely are mereology and real patterns ever explicitly linked except by those who reject one or the other for inter-level metaphysics, like David Wallace and Alyssa Ney. The two ontologies relationship is fairly unclear. It seems to me if real patterns are compatible with radical Ontic Structural Realism as well as various monisms, it must therefore be compatible with all forms of mereology, including nihilism. Although I have seen being Real Patterns proposed as an to the SCQ as well.",
        "created_utc": 1677532878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are Real Patterns and Mereological Nihilism are compatible? What is there relationship?",
        "author": "LordBritannicus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dn6jc/are_real_patterns_and_mereological_nihilism_are/",
        "text": "I’ve recently been thinking about Real Patterns and I believe an almost unacknowledged strength is that they seem to work with anything. After delving into quantum monism, I’ve found proposals that unify various monisms (including existence and Priority) with real patterns used to recapture higher ontology in place of mereological composition. \n\nRarely are mereology and real patterns ever explicitly linked except by those who reject one or the other for inter-level metaphysics, like David Wallace and Alyssa Ney. The two ontologies relationship is fairly unclear. It seems to me if real patterns are compatible with radical Ontic Structural Realism as well as various monisms, it must therefore be compatible with all forms of mereology, including nihilism.",
        "created_utc": 1677532688,
        "upvote_ratio": 1.0
    },
    {
        "title": "An explanation on how many unfavorable events are unavoidable?",
        "author": "Numerous_Ad310",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dm1io/an_explanation_on_how_many_unfavorable_events_are/",
        "text": "I am not good with words and I would like to be able to explain how many unfavorable events are unavoidable because as everything happens haphazardly, one person or thing can take a direction or make an action that can however interfere with or be not favorable for another one's direction/action (or many), and there is no system that can make everything go as wished.  \nFor example:  \n\\- Earth simply rotates around the sun, and a meteorite just flies through space and who knows what it could encounter, it could eventually happen upon Earth when it could have been at another point of its rotation and collide with it.  \n\\- An unexpected thunderstorm occurs and a bolt of lightning hits a tree and causes a forest fire.  \n\\- Someone wants to talk with someone about something, but that person is not in the mood or is too busy.  \n\\- Someone turns a corner to another street and unexpectedly bumps into someone, who also wasn't expecting to meet this person.\n\nAre there any books which might give more insight into this? Or maybe videos preferably?",
        "created_utc": 1677529988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cioran to Descartes",
        "author": "Significant_Product8",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dlwsy/cioran_to_descartes/",
        "text": "I read some of Plato's Socratic dialogues (including Euthypro) and almost finishing \"In the heights of despair. Do you think that I'll understand \"Meditations on first philosophy?\n\nEdit: I understood easily Plato and Cioran until this point and I'm extremely curious about this french dude proving the existence of God",
        "created_utc": 1677529679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absolute Exactness and Plank Units?",
        "author": "Complete-Ad5058",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dl5pl/absolute_exactness_and_plank_units/",
        "text": "Can we be exact about anything? Particularly measurements? \n\nAfter reading §88 in PI by Wittgenstein and thinking hard about Plank Units (the supposed smallest units in the universe) I feel I must conclude with him, at this stage (§88), that there is no absolute ‘Exactness’. \nOnly an infinite scale of anything and you can point as far along it as you want but never be totally exact or reach an end. \n\nI can’t seem to crosspost to this sub so [here](https://www.reddit.com/r/AskPhysics/comments/11dkola/plank_units_absolute_exactness/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) is a link to the main body of the question I have in mind (I apologise if this contravenes some rule that gives rise to the lack of crossposting too, let me know and I’ll take it down) \n\nThe meta question which Wittgenstein follows up with is how then can we call logic ‘sublime’ if it seemingly is meant to be exact when talking of things but no such exactness is possible. What do you think? \n\nMy answer is that perhaps because we created logic within limits of the concepts of understanding and cognition (our own thinking limits), it only operates at these limits. \nSo it is sublime only to the perception of man - he is limited. Sublime to him in that it works with some degree of exactness regarding all the notions man has produced (not discovered). This assumes the Transcendental Ideal position I think; that all that man can deal with is of his own comprehension or ‘representations’. \nErgo, logic is not sublime or perfect when considered mind-independently in the real of things as they are in themselves, which is infinitely unlimited perhaps? Just as infinite as the measure of units in the universe? \n\nThank you for taking the time to read this and the original post which is more in-depth regarding physics (but still philosophical) and providing your answers.",
        "created_utc": 1677527885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do most philosophers accept Descartes' \"cogito ergo sum\" statement?",
        "author": "SportSportManMan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11djz5n/why_do_most_philosophers_accept_descartes_cogito/",
        "text": "Why do people accept that \"I am thinking\" entails \"I am\"? Even if the relationship holds, what makes people believe \"I think\"?\n\nI'm asking how this ended up as the consensus for most philosophers, not merely how to justify this position. Even very pessimistic epistemological positions like solipsism accept this without any fuss, which I personally find odd.",
        "created_utc": 1677525010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do humans exist",
        "author": "Cooldownblue",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dji7e/why_do_humans_exist/",
        "text": "Apologies if this question has already been asked. Also, apologies if posted in incorrect subreddit. \n\nThe question of why humans exist and why it matters has been bothering me for a while. I don't understand the value of human life, what are we alive for? What purpose does the human race have? What is the goal of all humanity? \n\nAny help is warmly welcomed ❤️",
        "created_utc": 1677523890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is slavery or subservience a biological human thing? Part of me thinks humans can’t imagine life without exploiting others for their own interests",
        "author": "The_BrainFreight",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dj020/is_slavery_or_subservience_a_biological_human/",
        "text": "Slavery has been a thing for almost all of humanity. With the colonialism of the new world there came genocide and more slave trade (First Nations and African Americans) which got a spotlight in the western new world countries. \n\nI understand we have policies and committees that hold people accountable and we got unions that help the labourer but it still seems an uphill battle that won’t ever end.\n\nI’m not sure if I’m using the right words as certain synonyms fit better during different times, but I hope this is a coherent question\n\nAlso I’ve been confused as to why the world is the way it is with all of its shittyness, and to make it make sense I jot it down to our evolved human nature",
        "created_utc": 1677522669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should retarded people reproduce?",
        "author": "SimulaGargonchuatron",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dhqqg/should_retarded_people_reproduce/",
        "text": "",
        "created_utc": 1677519651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Neoplatonic Cosmos, Henads and Forms",
        "author": "Cachucamaru_Priest",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dhcw5/question_about_neoplatonic_cosmos_henads_and_forms/",
        "text": "So, i'm starting studying Plotinus, Proclus, Plato and the rest, but there are some things i haven't been able to yet understand. More specifically, it's about three sets of things whose information of particulars is very scarce.\n\n1-Forms: Is there a logical way of reasoning a \"complete\" (Or at least expansive) set of fundamental platonic forms from which one can derive other forms?\n\n2-Henads: Similar to the previous question; is there a way of reasoning the generations of the Henads from the One? Also, what exactly are Henads? Their explanation to me was very \"ethereal\" and hard to grasp.\n\n3-Cosmos: What does the Cosmos look like in Neoplatonic thought? I know about the One, the Nous and the Psyche, as well as the Intelligible, Psychical and Sensible worlds, but i also know Hades is there somewhere, as well as the seven planets and probably a bunch more. Is there any \"map\" of the Neoplatonic cosmos somewhere?\n\n4-Creatures: Similar to the previous question; is there any way to know all the creatures in Neoplatonic cosmology (Daimons, Elementals, Gods and etc...)?",
        "created_utc": 1677518720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zizek vs \"wokeness\", Does the Theory make sense?",
        "author": "PermaAporia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dha5a/zizek_vs_wokeness_does_the_theory_make_sense/",
        "text": "This article, supposedly written by Zizek has been making the rounds: [https://compactmag.com/article/wokeness-is-here-to-stay](https://compactmag.com/article/wokeness-is-here-to-stay)  \n\n\nThere's a lot of problems with this article but I wanted to ask about the theory side of things. So full disclaimer: I am very very new to understanding psychoanalytic theory. So I found myself a bit confused by Zizek's argument here. \n\nIf we maintain that these \"woke\" students or activists are acting under the injunctions of the big other by means of the superego, can we also at the same time say that they are being cynical and just want to be moral authorities? Does it make sense to make the superego a **disingenuous** driving force? Isn't the supergo the repository of positive identifications with parental goals and values that the individual **genuinely** admires and wishes to emulate?\n\n  \nHoping to clear up any misconceptions I might have, thanks!",
        "created_utc": 1677518530,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s a good unifying theory between pro-relativism in anthropological circles and anti-relativism in philosophical ones?",
        "author": "Lordkeravrium",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dgyzp/whats_a_good_unifying_theory_between/",
        "text": "So, I took a philosophy class and an anthropology class last semester. The classes were very at odds with eachother when it came to the idea of relativism. It even got to the point where my philosophy teacher even talked specifically about anthropologists disagreeing with philosophers when it came to anti-relativism.\n\nAnd the thing is, I understand both sides but I don’t know who I agree with more or how to unify these two opposing ideas.\n\nBecause on the one hand, I would argue it’s wrong to police other culture or say their ideas are immoral because of those cultures thrive off of that. But at the same time, it’d be very easy to fall into nihilism it you are moral relativist which could mean the end of our society.\n\nCan cultural relativism and anti moral relativism co exist? If so, how?",
        "created_utc": 1677517777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Behaviorism - is Behaviorism and Philosophical Behaviorism popular among philosophers?",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dgxv1/behaviorism_is_behaviorism_and_philosophical/",
        "text": "The reason I am asking is because behaviorism (*Weak, Methodological, Psychological, Philosophical*) seems to impose a **limit to our knowledge**. \n\n~**Weak behaviorism**: any psychological theory must be confirmed in terms of the way individuals act or behave.\n\nWhat if this isn't possible and some mental state doesn't make humans behave, react a certain way? \n\n~**Methodological behaviorism**: the object of study of psychology is not in the mind, or any internal states, but behavior. Since mental states are inherently private, they cannot be the study of empirical science. Psychology should instead focus on the observable actions, not the unknowable beliefs or desires of the subjects. \n\nWhy not both the mind and the behaviors? There is neuroscience which studies the mind as a whole, including the behaviors in connection with the neural network. Psychology can study both, why commit to one? Is the assumption that study of the mind is not possible reversed nowadays among behaviorists?\n\n~**Psychological behaviorism**: everything that someone does can be explained without reference to some internal mental state, but only through the use of external or environmental evidence.\n\nAn individual could be angry with a poker face in any environmental setting: how can you tell he is angry by looking at the environment.? \n\n~**Philosophical behaviorism**: any psychological theory which references mental terms or concepts can and should translate those terms and concepts into behavioral terms and concepts.\n\nWhy 'should' ? I assume that it means that we abandon the terms and concepts that aren't behavioral so, if so then why 'should' ? Why not do both?\n\n**Behaviorism seems to focus only on behavior: doesn't this limit our *epistemology*, our knowledge?**",
        "created_utc": 1677517698,
        "upvote_ratio": 0.99
    },
    {
        "title": "I have Gilbert Ryle on my report on class. I need help.",
        "author": "BBByulLouiseee",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11de7y2/i_have_gilbert_ryle_on_my_report_on_class_i_need/",
        "text": "I don't know where I'm gonna start and what's the content of my report on Gilbert Ryle. But I have biography and his saying that \"I act, therefore, I am\"\n\nAnd I have a question is Ryle Understanding the Self are not convince/refuted of Descartes \"I think, therefore, I am\"?",
        "created_utc": 1677510883,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the workload difference for philosophy between y12 and uni?",
        "author": "Important-Event-4898",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ddpt9/what_is_the_workload_difference_for_philosophy/",
        "text": "I’m thinking of doing a Bachelor of Arts majoring in philosophy but I’m curious as to what is expected from a uni level course typically that might be different to that of a year 12 level. Also I’m not sure if this is the right subreddit but I’m at a loss and very curious.",
        "created_utc": 1677509602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone suggest a quirky philosophical topic to write a paper on? Also, if there's anyone interested in writing a paper with a high-schooler, PM me.",
        "author": "Mysterious-Course410",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ddc5a/could_someone_suggest_a_quirky_philosophical/",
        "text": "Title.",
        "created_utc": 1677508596,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with philosophy HW. Class is called argumentation in philosophy",
        "author": "MiserableSleep34",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dcnqp/i_need_help_with_philosophy_hw_class_is_called/",
        "text": "Hello, I am relatively new to philosophy and I am having a slight problem. I need to find a philosophy text with thesis that is not hard. But in that text, there has to be a counterargument to that thesis. Can you please recommend me some text where I could find them? Or show me with example.",
        "created_utc": 1677506765,
        "upvote_ratio": 1.0
    },
    {
        "title": "lit. recommendations on the ontological foundations of lived experience as evidence",
        "author": "xb_xa",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11db7mb/lit_recommendations_on_the_ontological/",
        "text": "hi guys :-)  \n\n\nOver the past few years I have noticed a trend in how political believes are justified where the weight of justification has shifted towards our 'lived experience'. I mean by this that we increasingly justifies our political views by how we see the world and what emotional response are elicited by the things we encounter, granting a kind of ontological reality to our experience.\n\nI recently read an essay by the historian Joan Scott ('the evidence of experience', 1990) who argues that the concept of experience as evidence ignores how historical and societal forces shapes our experience and charges it politically. However, her essay has a clear historical aim and I would like to interrogate the question more philosophically. \n\nSo - do you know of any literature on the subject of lived experience that could be of interest?",
        "created_utc": 1677502577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is not all that matters is the outcome of wellbeing and/or not violating anothers rights? If it matters, then it has implications on that, and if it does not, then it does not matter?",
        "author": "Powerful_Falcon_4006",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dawj5/is_not_all_that_matters_is_the_outcome_of/",
        "text": "",
        "created_utc": 1677501602,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your top takeaways from Žižek's The Sublime Object of Ideology?",
        "author": "dg_713",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11dapzk/what_are_your_top_takeaways_from_žižeks_the/",
        "text": "I'm still back at reading Sublime, but I also wanted to know what the more learned readers of this sub took away out of reading it.\n\nI'd really appreciate it if you could elaborate as much as you can, although I honestly cannot give back anything in return, so I'm just hoping you will be generous with your time and knowledge to a curious stranger on the internet.\n\nThank you.",
        "created_utc": 1677501029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Identifying as Agnostic Entail Believing in God/s?",
        "author": "One-Age9528",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d8lhw/does_identifying_as_agnostic_entail_believing_in/",
        "text": "Claiming to be agnostic and acknowledging the existence of God/s appears contradictory since agnosticism entails the belief that the existence of God, the divine, or the supernatural is unknown or unknowable. Is it possible to acknowledge the absence of evidence for something while also recognizing its existence? In my view, identifying as agnostic implies recognizing the possibility of the existence of God/s while acknowledging that it may not be provable. In essence, does identifying as agnostic mean believing in God/s without evidence?",
        "created_utc": 1677493610,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Nozick's Experience Machine relate to his politics?",
        "author": "sporadischechaoot",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d8fkn/how_does_nozicks_experience_machine_relate_to_his/",
        "text": "Hello! I'm studying philosophy and I have a social &amp; political exam coming up and I'm wondering how Nozick's Experience machine is relevant to his ideas about politics. What I gathered from the Experience Machine is that it concludes that people value authenticity and that pleasure is not the only important thing for a human being, and that it was meant to be a counterargument to hedonism. But I don’t see how this is is linked to or relevant for his politics? I’ve mailed my professor but his reply was very vague and I’m a bit doubtful since he’s made other statements that were questionable (like Marx favouring equality of outcome).\n\nFor context we had to read chapter 7 of Anarchy, State and Utopia.",
        "created_utc": 1677492994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a little wrapped in a project - looking for resources on Heraclitus, specifics in description.",
        "author": "hanpotpi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d8e3k/getting_a_little_wrapped_in_a_project_looking_for/",
        "text": "I’m doing a little thought experiment I don’t 100% feel comfortable sharing a ton of details on. More or less, it’s taking me trawling through the ancient philosophers and I find myself stuck on Heraclitus. \nWhen this happens to me I like to read as much “first-hand” as I can. I am not a student any longer, and don’t have access to my old textbooks to find some translated works by him. \nSo I am looking for the following resources: \n1. Complete translated (trusted) works by Heraclitus available through a local library or for purchase\n2. Companions to Heraclitus’ works to help understand them. \n3. Writings that oppose or contradict him. \n4. Voices from outside Greek (and Western) thought that either affirm or refute Heraclitus. \n\nThanks in advance for any recommendations and help!",
        "created_utc": 1677492848,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the introduction to his “Critique of Pure Reason”, Kant speaks of the axiom “Every cause has an effect.” as being pure *a priori*, however, is not the very concept of ‘cause’ apprehended first and foremost *a posteriori*?",
        "author": "Noodle_The_Doodle",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d8dsh/in_the_introduction_to_his_critique_of_pure/",
        "text": "I don’t mean to sound Lockean, but it’s confusing me, and I would greatly appreciate any input. \n\nI tend to always think of these things nowadays from the logocentric point of view, and while Kant does mention “…without seeking for such examples of principles existing a priori in cognition, we might easily show that such principles are the indispensable basis for the possibility of experience itself…” (p. 6), I can’t see how we would be capable of cognizing this without the use of the word ‘cause’ - acquired via language - to conceptualize this process, if that makes sense?",
        "created_utc": 1677492814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it unique that Immanuel Kant speculated about the existence of other planets beyond those known at the time in his work 'Universal Natural History and Theory of the Heavens?",
        "author": "Killuminati696",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d6hzx/is_it_unique_that_immanuel_kant_speculated_about/",
        "text": "\nIs there something unique in Kant's Universal Natural History and Theory of the Heavens?",
        "created_utc": 1677485645,
        "upvote_ratio": 0.99
    },
    {
        "title": "Where can I find this philosophy paper from 2016?",
        "author": "_user_account_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d4w74/where_can_i_find_this_philosophy_paper_from_2016/",
        "text": "This is the only mention I could find on the internet about it where someone left a summery review: https://www.goodreads.com/book/show/37558430-probably-problematic Internet searches are failing me, any tricks for finding it?\n\nAlso would be interested in any other content discussing/critiquing [the paper](https://www.cambridge.org/core/journals/social-philosophy-and-policy/article/abs/an-ontological-proof-of-moral-realism/8D2E2B9D45901C5E6AED29B888747A45) it's based on directly or indirectly if anyone happens to know any",
        "created_utc": 1677479636,
        "upvote_ratio": 1.0
    },
    {
        "title": "how broadly should criminal statutes be interpreted ?",
        "author": "abolishhumancages",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d3a68/how_broadly_should_criminal_statutes_be/",
        "text": "many judges in America and UK interpret criminal statutes broadly. is this ethical on the basis of public interest ?",
        "created_utc": 1677474095,
        "upvote_ratio": 1.0
    },
    {
        "title": "QUESTION HELP?!?!?!?!?!",
        "author": "Wonderland102",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d2c20/question_help/",
        "text": "Critically discuss how the Advaitins explains the origin of the plurality of the world from a non-dual Braham. What aspects of their theory of “levels of Reality” do you find appealing and what aspects do you find problematic? Discuss\n\n&amp;#x200B;\n\nIndian Philosophy",
        "created_utc": 1677471082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question Help!!!!!?????",
        "author": "Wonderland102",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d2bin/question_help/",
        "text": "Critically explain the metaphysics ( the nature of Ultimate Reality ) of the Upanisads as expressed in the metaphor of the “chariot” and the “two birds”. Clearly bring out their differences. What aspects of this theory do you find appealing and what aspects do you find problematic? Discuss",
        "created_utc": 1677471034,
        "upvote_ratio": 0.99
    },
    {
        "title": "Are there any academic philosophy podcasts that are not highly \"introductory\"?",
        "author": "oryxmath",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d1s1s/are_there_any_academic_philosophy_podcasts_that/",
        "text": "It seems like many philosophy podcasts are very educational and geared towards an audience that doesn't know much philosophy.  So they might be introductions to some famous historical philosopher, or some major subfield of philosophy, etc.  If it is an interview with a contemporary philosopher, they usually take many pains to gently introduce topics and not get too into the weeds.  They almost feel too NPRish, if that makes any sense.  Suspiciously high production quality, etc.  \n\nAre there any philosophy podcasts that just dive into it?  The closest I can think of is Mindscapes by Sean Carroll, but those aren't usually philosophical. Conversations with Tyler is another great one but very rarely Philosophy related.  Very little mind numbing introductions, the host just has the conversation they want to have rather than assuming the audience is ignorant of philosophy and/or dumb and needs to be hand held through everything.\n\n Philosophy Bites and Philosophy Talk are precisely the sort of style I want to avoid.\n\nWhen I say philosophy I mean in the mainstream anglophone tradition.. what gets called \"analytic philosophy\"",
        "created_utc": 1677469383,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of the best arguments against epistemological infinitism?",
        "author": "FunkyDetective",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11d0w17/what_are_some_of_the_best_arguments_against/",
        "text": "I’ve been reading some of Klein’s work and quite frankly it sounds so convincing it’s almost too good to be true. What are some strong counter arguments to his or similar ideas about the infinite regress?",
        "created_utc": 1677466749,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some texts whose primary application has been in contexts other than that which the author seems to have intended?",
        "author": "Linguistics3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11czzys/what_are_some_texts_whose_primary_application_has/",
        "text": "I’m looking for philosophical texts which appear to have been written to demonstrate a particular thesis (with the consensus being that the author has failed) but that are still taught and read because they have applications elsewhere.",
        "created_utc": 1677464074,
        "upvote_ratio": 1.0
    }
]