[
    {
        "title": "Literature providing concrete evidence of a patriarchy &amp; sexist culture?",
        "author": "vhsikcfnodowsjxnc",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhq7wt/literature_providing_concrete_evidence_of_a/",
        "text": "I’m pro-equality and think men and women are equal in every meaningful sense. However, i’m not really sure I would call myself a feminist. This isn’t because I disagree with feminist ideals but rather because I’m unaware of what the issue is. I don’t see this patriarchy where women are oppressed, perhaps due to being uninformed as I’ve never sought out information on this topic. I’m asking for evidence of the patriarchy through any medium such as articles/studies/books/documentaries etc…\n\nTo be clear, when I say patriarchy I’m referring to a system which oppresses women. I’m not asking for ideas but instead concrete things I can look. Sorry if wrong subreddit",
        "created_utc": 1670671470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should we read predecessors?",
        "author": "beachgoatt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhq448/should_we_read_predecessors/",
        "text": "How we all know, Kant united rationalism and empiricism in his critiques. And here is a question, if Kant combine two of them, created a reliable theory, should we even look on his predecessors, like Spinoza, Decart, Leibniz etc.",
        "created_utc": 1670671162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy or Psychology as a second degree?",
        "author": "Livid_Bottle3364",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhotre/philosophy_or_psychology_as_a_second_degree/",
        "text": "Hi,\nI’m currently getting my bachelors degree in economics at university, and planning on getting a masters degree in economics as well. I have two questions: \n\n(1)\nI want to get another degree simultaneously, but can’t decide if I should do a double bachelors and 1 master or 1 bachelors and a double master. \n\n(2)\nFurthermore, I can’t decide between philosophy and psychology. I love both fields, but don’t plan on pursuing a career in either one. So what kind of jobs you can get into after the degree isn’t of significance. This would mainly be for self development and out of interest. Although, it would be nice if some of the things I learn transfer over to my career in business.\n\nAnyone who has experience or advice?\nWould love to hear.\n\nThanks!",
        "created_utc": 1670667068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we morally responsible to help people when given a chance ?",
        "author": "walgreens567",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zho6mr/are_we_morally_responsible_to_help_people_when/",
        "text": "Obviously there is a lot of context behind this, but let’s just say you look out for yourself and do your own thing. Am I wrong for opting out instead of giving my time to other people.",
        "created_utc": 1670665019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a text that gives a serious analysis of solipsism?",
        "author": "Active_Pride",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhn1b2/is_there_a_text_that_gives_a_serious_analysis_of/",
        "text": "With the impressive progress of AI it might be imaginable that at some point you might only encounter AI agents within your personal surroundings. How do you deal with that? If you were born and grow up with only AI contact, would it be reasonable to take a solipsistic position?",
        "created_utc": 1670660909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we truly ever live for ourselves? Or for others perceptions of ourselves?",
        "author": "God_of_none_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhlvq4/do_we_truly_ever_live_for_ourselves_or_for_others/",
        "text": "This is an internal conflict I feel many may ponder at times. Why is it that we seek to appease others before ourselves? (*Within reason mind you*) We work so incredibly hard to maintain a good public image that perhaps we ignore things that are integral to our wellbeing, why is that?",
        "created_utc": 1670656683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Nihilism a tenable position forever or does one always strive to create meaning? Is Absurdism an acceptable compromise?",
        "author": "BloodbathShadow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhjkhe/is_nihilism_a_tenable_position_forever_or_does/",
        "text": "",
        "created_utc": 1670648845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do the rules in the universe imply a rule maker ?",
        "author": "invictavinci",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhj5st/do_the_rules_in_the_universe_imply_a_rule_maker/",
        "text": "\n\nBefore life existed on earth this planet was very hostile to life and unrecognisable to the earth as it is today. Yet we have fauna and flora and so much diversity of life (plant, animal etc)\n\nUltimately one must ask, in earths earliest history before even water existed that there was basic chemical interactions that take place to of course eventually create H2O which is one of the prerequisites of life as we know it.\n\nMy question is this and has more to do with physical/chemical interaction such as those of two hydrogen atoms with one oxygen leading to the formation of water.\n\nWhy is there laws or rules in nature or universe that dictate that upon these elements combing it results in water. Why such rules in the first place, why no rules (or laws) at all. After all it is easier for inanimate mater to have no rules to follow or obey. Especially when it comes to interacting with other molecules or matter.\n\nCan we say that there was a rule maker I.e a god which imbued these particles with such properties, laws rules ?",
        "created_utc": 1670647545,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to consent to a non consensual interactions ?",
        "author": "nukedplanets",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhj0ob/is_it_possible_to_consent_to_a_non_consensual/",
        "text": "[removed]",
        "created_utc": 1670647099,
        "upvote_ratio": 1.0
    },
    {
        "title": "this is kindness and benelovent to turn everyone in to souless and mindless object?",
        "author": "Only_Feedback_6049",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhihn1/this_is_kindness_and_benelovent_to_turn_everyone/",
        "text": " \n\nmy think about stone, stone cannot rape, stone cannot commit murder. stone cannot steal.\n\nwood also cannot commit any crime .\n\nthose object cannot cry and suffer too .\n\nif you has powerful weapon after shoot and turn everyone to wood and stone or other mindless object,\n\nthat moral duty to shoot weapon or not and why?\n\ni cannot thing why shoot that weapon wrong. it fic all suffering foever",
        "created_utc": 1670645461,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was Nietzsche's position on kindness?",
        "author": "OrdinaryCow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhhc4x/what_was_nietzsches_position_on_kindness/",
        "text": "His dislike of pity/compassion is pretty well known but I was wondering if hes against all forms of kindness?\n\nHe does endorse manners but is that the limit to which he approves of kindness?",
        "created_utc": 1670642046,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the merits of Aristotle's claim that the highest human good is rational activity?",
        "author": "a_single_soul",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhg3gq/what_are_the_merits_of_aristotles_claim_that_the/",
        "text": "In *Nicomachean Ethics*, Aristotle claims that happiness (or Eudaimonia) is achieved practically speaking by a human performing their characteristic function (or ergon) well. Aristotle concluded that the human characteristic function was rational activity in accordance with virtue. He arrived at this conclusion inductively using analogies.   \n\n\nWhat are the merits of a) His conclusion that rational activity is the highest human good, and b) His method of determining this via his *function argument*?",
        "created_utc": 1670638471,
        "upvote_ratio": 1.0
    },
    {
        "title": "does consent have to be revocable to be considered consent ?",
        "author": "ththeoryofeverything",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhfxzt/does_consent_have_to_be_revocable_to_be/",
        "text": "Title",
        "created_utc": 1670638056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are philosophers hypocrites? Probably most of the time.",
        "author": "WattsianLives",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhe376/are_philosophers_hypocrites_probably_most_of_the/",
        "text": "It's funny, you see some philosophies and religions arguing, hey, put down your ego, don't be wedded to your sense of grandiose self and certainly not others' esteem of you. And yet, we find many of the gurus marching around telling us this spend their time, in fact, seemingly trying to increase our esteem of them.\n\nPerhaps, we can say, they are just publicizing their wisdom for the betterment of others and, oh no, they don't want to be considered great, but their ideas must be out!\n\nConsider [Plutarch writing to Epicurus](https://onlinelibrary.wiley.com/doi/10.1002/9781118316450.ch7#:~:text=After%20Socrates%2C%20Plato%2C%20and%20Aristotle%2C%20Epicurus%20is%20the,through%20anti-Epicurean%20arguments%20embedded%20in%20his%20other%20works%3F), a philosopher and teacher, many centuries ago, and you'll see the calling out of this hypocrisy is nothing new:\n\n&gt;Moreover, if you advise good men to be inconspicuous and to be unknown ... give yourself \\[Epicurus\\] the same advice first. Don't write to your friends in Asia, don't address the visitors from Egypt, don't keep watch over the youths in [Lampsacus](https://www.britannica.com/place/Lampsacus), don't send books to all, male and female alike, showing off your wisdom, and don't give written instructions for your burial.\n\nWell, weren't we feeling saucy, Plutarch?",
        "created_utc": 1670632960,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI art - is it moral or not?",
        "author": "Poepaeah",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhcy4u/ai_art_is_it_moral_or_not/",
        "text": "I was using AI art to do some things for personal projects because I can't draw and don't want to spend money on something I don't really 'need', however, an artist friend of mine brought to my attention the potential moral pitfalls related to it.\n\n1. AI art doesn't source the art used in the training algorithm.\n- To me, this is the strongest point against AI art. AI extrapolates information from existing pieces and uses that to 'train' on, but is it moral to use training pieces that artists don't consent to? Greg Rutkowski ( A famous artist known for detailed epic/medieval scenes) has his art used for certain AI algorithms without his consent and now the AI can mimic his style. https://www.google.com/amp/s/www.businessinsider.com/ai-image-generators-artists-copying-style-thousands-images-2022-10%3famp\n- This did make me take a second look at the issue. I don't know if I feel morally OK using art that's trained off of artists that don't consent. However, if any AI art systems use open-source art or art that is willingly offered up to the ai, I wouldn't have qualms with that, I don't know any that do tho.\n\n2. AI takes artist jobs\n- To me, this is a weaker argument and I don't agree with it, but I do understand where people are coming from: Why should someone hire an artist when they can get free art in a quarter of the time? It can be discouraging for artists to have to compete against a robot.\n- While that is the case I just think that technology is the future for most things in general, I mean this most respectfully:  No one is immune from automation, not even artists. Instead of hoping that automation stops for us we have to accept that it's just a part of society now and adapt to it. Computers and technology are taking over a lot of jobs, it doesn't mean that the jobs become obsolete, it just means you have to distinguish yourself and be innovative. A lot of the time AI can give you a general idea of a photo but it won't always be able to pose the characters in certain ways that you'd like, give you a full character sheet, or even draw existing characters from media in a way that you'd like to see. So maybe concept design artists will have a difficult time with AI but more niche artists (think Vtuber artists, Fandom artists, live 2d/3d artist) should be fine. \n\nThose are the main 2 gripes I've seen with it if you have any to add I'd be happy to listen.",
        "created_utc": 1670629997,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you think philosophers would have felt towards school being moved from in person to primarily online?",
        "author": "1asagnamama",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhcwen/how_do_you_think_philosophers_would_have_felt/",
        "text": "",
        "created_utc": 1670629874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Philosophers talked about working hard and living a hard life to improve yourself?",
        "author": "nashuhh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhcphw/which_philosophers_talked_about_working_hard_and/",
        "text": "I feel like absolute shit and I'm desperate for philosophers to help me. This year, I decided not to go to college yet and instead take a gap year to improve myself: look better and be smarter so that I can start plans to become a cardiologist, my dream job. \n\nBut 4 months into my gap year and I didn't do a single damn thing to improve myself. I scrolled through social media a lot, never worked out, played a lot of video games, masturbated 6 times a day, and never studied. Today I got fired from my job as a receptionist at a doctor's office for making a huge mistake, and I hate myself so much and I'm doubting if I can ever be a doctor.\n\nI need to read philosophers that talk about people needing to work hard to improve themselves or those that talked about living a hard life now to have a enjoyful life in the future. This is so that I can benefit from their texts and actually put in the effort to become better than I currently am. Can anyone recommend me some philosophers or books to read and learn? I will make a list of all the books/philosophers I receive from you folks and will start reading today. Sorry for venting and making this really long, thank you people.",
        "created_utc": 1670629418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy in Primary Education",
        "author": "HeliasDominus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhcohw/philosophy_in_primary_education/",
        "text": "It seems to me that philosophy is the root of basically all knowledge and from which all fields of study we rely on today were formulated. I am confused and cannot figure why philosophy isn't one of the first disciplines taught in public education. Would it make sense to teach from a philosophical foundation before delving straight into specific subjects such as mathematics or literature? Or why would that not be practical?",
        "created_utc": 1670629345,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did Hegel Believe was the Relation between Recognition and Freedom? How were Freedom and Recognition Connected for Hegel?",
        "author": "kgbking",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhci5g/what_did_hegel_believe_was_the_relation_between/",
        "text": "",
        "created_utc": 1670628906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the Buddha considered a spiritual figure and not a philosopher? A matter of analytical philosophy or continental?",
        "author": "MediumAssist",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhc5r8/why_is_the_buddha_considered_a_spiritual_figure/",
        "text": "",
        "created_utc": 1670628091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why should i keep living ?",
        "author": "Dramatic-Play-4289",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhb0l8/why_should_i_keep_living/",
        "text": "I'm not sad,i just don't see any value in life.",
        "created_utc": 1670625456,
        "upvote_ratio": 1.0
    },
    {
        "title": "What could \" “A good will is not good because of what it effects or accomplishes, because of its fitness to attain some proposed end, but only because of its volition\" mean?",
        "author": "frogetable",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zhaj0y/what_could_a_good_will_is_not_good_because_of/",
        "text": "https://en.wikipedia.org/wiki/Groundwork_of_the_Metaphysics_of_Morals#The_Good_Will",
        "created_utc": 1670624338,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does De Beauvoir describe anxiety (anguish) and what it reveals about the human’s life?",
        "author": "Mexicancucumber",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zha2cz/how_does_de_beauvoir_describe_anxiety_anguish_and/",
        "text": "My girlfriend is taking an existentialism course that I took in the past and I can usually help her understand the material as I majored in philosophy, however De Beauvoir is someone I don’t recall learning about. We’ve been looking through her class materials and online and can’t seem to find much. Anyone have any knowledge of her on this subject?",
        "created_utc": 1670623245,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the implications of “live” VR simulations of live sports games for the philosophy of capitalism?",
        "author": "SufficientAdagio914",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh9yeh/what_are_the_implications_of_live_vr_simulations/",
        "text": "For example, [this game today](https://imgur.com/gallery/VXPqHBS) on YouTube of a quarterfinal of the football World Cup?",
        "created_utc": 1670622962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it ethical to participate in a behavior currently deemed socially acceptable, even though you expect society’s view to shift to consider it differently in the future?",
        "author": "Furimbus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh6d6u/is_it_ethical_to_participate_in_a_behavior/",
        "text": "I’m thinking specifically about Artificial Intelligence, whether used for amusement or to accomplish menial tasks. ChatGPT isn’t sentient, but since its release at the beginning of the month I’ve realized we’re much closer to seeing a sentient AI than I’d thought and I’m less comfortable playing with it than I’d be with something like Siri. Assuming in the future society decides that using AI for entertainment is unethical, is my doing so now, while it is still acceptable, wrong? Or do I get a pass because it was okay at the time I was doing it?\n\n(A mod at /r/ethics suggested that this might be a place to ask)",
        "created_utc": 1670614335,
        "upvote_ratio": 1.0
    },
    {
        "title": "object analysis aside from Harman/OOO",
        "author": "gmnmpp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh5tm0/object_analysis_aside_from_harmanooo/",
        "text": "Are there other contemporary philosophers not belonging to OOO who look at object object relations as opposed to idealist subject object relations?",
        "created_utc": 1670613029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the problem of induction not self refuting? Also, can we be certain of our experience?",
        "author": "eth_trader_12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh5rnp/is_the_problem_of_induction_not_self_refuting/",
        "text": "The problem of induction is considered a problem because of the argument that ultimately the past does not necessarily predict the future. It **could** be true that the sun won't rise tomorrow, but it has always done so in the past. We make this assumption that the future will match the past.\n\nIt is claimed that this assumption is unjustifiable. But isn't this also an assumption? It's assuming that justification should only depend on certainty. Why should it? Why should a belief be justified only if you're certain of it?\n\nBesides, what does it mean to be certain of something? It is often argued that you can't know anything for certain except experience. I'm not even sure you can be \"certain\" of experience. Almost all experiences technically happen in the past once you reflect upon it. Once you experience a painful event, at any time you even consider whether or not the painful event happened, it's already in the past. But that is assuming that your memory is not defunct.\n\nSo even for conscious experiences, we're ultimately making assumptions, aren't we? What's wrong with making assumptions in the first place?",
        "created_utc": 1670612897,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to get bored of life?",
        "author": "some-random-dudeee",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh5ml5/is_it_possible_to_get_bored_of_life/",
        "text": "i meant to say someone who was done everything they could, and now life is just the same and predictable, not depression, but like, if there was nothing new to do",
        "created_utc": 1670612565,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a love relationship, is the responsibility of adultery shared or is it individual?",
        "author": "cm2_0",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh4p6a/in_a_love_relationship_is_the_responsibility_of/",
        "text": "If a person has sex with another engaged individual, knowing that the individual is engaged/married to another person, is the engaged individual fully responsible for the betrayal or is the responsibility shared?",
        "created_utc": 1670610377,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what ways are the methods of inquiry of history, science (specifically the branches like Physics, Chemistry etc) and philosophy similar and/or different? What forms of inquiry have been developed and used for these subjects, and what is their history? Good academic sources on this?",
        "author": "Ani1618_IN",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh2l40/in_what_ways_are_the_methods_of_inquiry_of/",
        "text": "",
        "created_utc": 1670605573,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you define \"reality\"? What is reality?",
        "author": "Ani1618_IN",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh2f8n/how_do_you_define_reality_what_is_reality/",
        "text": "What are the various theories and views on what reality is? how has reality been defined by various thinkers? Would it be accurate to say that reality is what is directly experienced through the senses?",
        "created_utc": 1670605209,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I start reading and studying Existentialist philosophy?",
        "author": "Ani1618_IN",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh1m3e/how_do_i_start_reading_and_studying/",
        "text": "I'm still in high school, I've wanted to understand Existentialism more, how do I go about doing that, which philosophers and their works, and any secondary sources should I read to understand both Existentialism itself and it's history over time?   \n\n\nAlso how do I start reading Kierkegaard, Nietzsche and Sartre? What works of theirs should I start reading with, and in what order? Any secondary sources on them that might add on to the subject? And what about earlier and contemporary (to them) schools of philosophy and philosophers that influenced these thinkers, I think reading them would help me understand things a bit better.  \nI'd also like suggestions on thinkers and works that criticize Existentialism and Existentialist thinkers.",
        "created_utc": 1670603202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is the best/most smooth translation of Plato’s ‘Republic’?",
        "author": "DrawnAddendum",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh1149/which_is_the_bestmost_smooth_translation_of/",
        "text": "I’ve been wanting to read this for a long time and finally grabbed a copy of Jowett’s translation. it was a hard decision between this one and Alan blooms translation but I still cant decide. What do you guys think?",
        "created_utc": 1670601776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is empiricism an appropriate description of my beliefs? If not, what is?",
        "author": "itreallyisntthough",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh0y0a/is_empiricism_an_appropriate_description_of_my/",
        "text": "My \"ideal\" justification for something would be a combination of logic and sensory experiences, but I think people have such significant innate psychologies/tendencies that I'm uncomfortable treating it as possible that people are ever drawing perfectly rational conclusions from the evidence. Another way of putting it: Someone's entire mental state could be idealized as a model being updated according to Bayes' theorem, but the mind does so in a way that's inexact, biased towards certain conclusions, and difficult to self-interrogate.\n\nIs there a philosophy that's close to this way of thinking so I can read up on refinements/counterarguments to my view? Thanks in advance.",
        "created_utc": 1670601593,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a beggar gives away his last 20 bucks, and a billionaire gives away a million, who is the most generous, and why?",
        "author": "machinaro",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zh0dy7/if_a_beggar_gives_away_his_last_20_bucks_and_a/",
        "text": "",
        "created_utc": 1670600193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to say that Buddhism is anti-theist?",
        "author": "anonoman925",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgzytz/is_it_okay_to_say_that_buddhism_is_antitheist/",
        "text": "I’m not necessarily speaking to Mahayana Buddhism, but OG Buddhism never articulated there is any sort of divine piece to the universe. Does this technically make it anti-theist?",
        "created_utc": 1670599158,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can one resolve the paradox of Self Doubt?",
        "author": "eth_trader_12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgzui6/how_can_one_resolve_the_paradox_of_self_doubt/",
        "text": "How can one resolve this paradox of self doubt. Allow me to illustrate what I mean by this. \n\nSuppose there is some condition or some habitual way of thinking or some quality that makes a person doubt anything, and to remain in a feeling of uncertainty no matter what. \n\nHow can one know if he has this condition? If he has the thought of “maybe I have that condition”, he can simply further doubt that. How can one know if he is suffering from a condition that leads to needless self doubt? Any time he thinks that, he can very much doubt he has the condition itself. \n\nPerhaps one can argue: “well if you have rational reasons to doubt things, sure. If you can’t find any, you’re probably needlessly doubting anything.” But the problem is you can doubt anything (except first person experience). So you can doubt those very reasons and lack of reasons as well. \n\nIs this paradox resolvable?",
        "created_utc": 1670598851,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do ordinary people and scientists support their belief that other people also have minds?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgz705/how_do_ordinary_people_and_scientists_support/",
        "text": "How do ordinary people and scientists support their belief that other people also have minds?\n\nhttps://philosophy.stackexchange.com/questions/93684/does-science-have-any-separate-arguments-for-the-existence-of-other-minds/93741#93741\n\nHere people talk about empiricism. But I don't understand how it works. Please explain.",
        "created_utc": 1670597243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which concept do you find more agreeable, Nominalist Revolution or Teleological Framework? Why?",
        "author": "Exciting-Olive-1217",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgz24m/which_concept_do_you_find_more_agreeable/",
        "text": "",
        "created_utc": 1670596898,
        "upvote_ratio": 1.0
    },
    {
        "title": "What moral intuitions should be used to conduct normative ethic reasoning",
        "author": "Da_baby_central",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgyx2a/what_moral_intuitions_should_be_used_to_conduct/",
        "text": "As the title says, this is a question on what moral intuitions we should be drawing on to do normative ethical reasoning. I am asking this because of the fact that we as people tend to have ethical intuitions on all manner of things, that are 1.Very contentious as to the ethical status of the act in question (such a abortion). And 2. Even more importantly, a lot of our ethical intuitions in general are dependent on how we are raised, our cultural environment, our social circles, ect. (For example, in my country, women's rights is something that is seen as something that is obviously wrong to degrade, but this intuition wouldn't hold in a place like Qatar or Saudi Arabia).\n\nIn this light, I would think that we should then move to basing our normative ethical reasoning on \"the most obvious\" moral intuitions, however, even these can fall victim to being more based on how you're raised, your culture, ect. (For example, to the vast majority in the first world, slavery seems like a very obvious moral wrong, however, this intuition is rather recent in human history, Civs all across history have practiced slavery and has seen it as just another part of life).\n\nSo with that said, should the moral intuitions that we draw from be only the most obvious ones that are cross-cultural and prevelant in most of human history? Or is what I've said somehow not an issue for moral intuitions in general?",
        "created_utc": 1670596543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy Essay",
        "author": "Billybobo435",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgxk6f/philosophy_essay/",
        "text": "I don’t know if this is the right place to post this. But I have to write an essay in response to the question “does perspectivism fit well with scientific realism”. Any idea of what direction I should take it/resources?",
        "created_utc": 1670593018,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the similarities and differences between mythological narration and Ancient Greek philosophy?",
        "author": "whloonylovegood",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgxex0/what_are_the_similarities_and_differences_between/",
        "text": "Psychology student here, I have a homework about this subject and I've been researching for a while. I'm in the stage of writing, so I've been wondering if there are points I've missed. I wrote about Thales and the arkhe problem and I made a connection between him and Homeros, but I think it lacks something more important and I don't know what it is. I would've liked to attach my writings in the post so that you have a better idea what I'm talking about, but it's in my main language and I'm bad at translating stuff. Any kind of ideas and points are appreciated, thanks in advance. You can also suggest me where to research if you don't have time to explain.",
        "created_utc": 1670592625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do academics ever rate the most influential/well respected contemporary philosophers?",
        "author": "Sleeping_Shepherd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zguyq8/do_academics_ever_rate_the_most_influentialwell/",
        "text": "For someone who isn't in the university system is there any way to find out which contemporary academic philosophers are most well regarded or influential beyond word of mouth? Like is there any sort of list or poll conducted amongst academics?",
        "created_utc": 1670585840,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do people mean when they say/ask about the \"meaning of life\"?",
        "author": "Psychr_upr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgu072/what_do_people_mean_when_they_sayask_about_the/",
        "text": "I've been reading about Absurdism and Existensialism lately and what do these philosophies mean when they talk about \"meaning'? Sorry if this question is misguided.",
        "created_utc": 1670583016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contemporary academics who have written about/researched theosophy",
        "author": "jaydosdeflector",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgtuho/contemporary_academics_who_have_written/",
        "text": "I find theosophy interesting and was wondering whether there is anyone out there in the academic realm taking it seriously.\n\nIm not raising the compelling or not nature of theosophy here, just genuinely curious whether there is anything serious being written about it.",
        "created_utc": 1670582520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help: I love many world philosophy traditions, Should I specialize in one?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgsk07/help_i_love_many_world_philosophy_traditions/",
        "text": "\n\nThe question of specialization was always a problematic one for me personally. The love for change is embeded in my persona. \n\nI love russian philosophy, western philosophy, islamic philosophy, indian philosophy, and Chinese philosophy. I love Metaphysics &amp; Epistemology, but perhaps more I love political philosophy, cultural criticism, and political science. \n\nI like fo follow trends in different philosophies, how western philosophy &amp; colonialism effected other philosophical traditions, and critically comparing various Worldviews, this includes: M&amp;E, Ethics, Political philo., the concept of Inter-Human, Human-Natural and Human-Extra Natural relations.\n\nI never seen myself a niche \"Kant-specialist\", or \"Mulla Sadra-specialist\". Actually I even wanted to have a Chomsky-style encyclopedian writing in hand.\n\nChomsky himself was an influence for me. I liked how he's largely interested &amp; educated about non-Western world (compared to other Western intellectuals), his concept of cross-culture bridging. \n\nHowever, I'm always confronted with the reality of hyperspecialization in today's academic environment. I don't recall a philosopher who writes on 2+ philosophical traditions. Actually, it seems IIRC rare to see e.g. scholars of Ethics, Metaphysics, Political Philosophy, and Language, simultaneously.\n\nWith that said; what my realistic expectations of my philosophical potential should be if I went down the road of \"Comparative scholar\"?\n\nI'm open to your thoughts and ideas, looking for a fruitful discussion",
        "created_utc": 1670578489,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between process reliabilism and virtue reliabilism?",
        "author": "pistolpierre",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgro9n/what_is_the_difference_between_process/",
        "text": "",
        "created_utc": 1670575726,
        "upvote_ratio": 1.0
    },
    {
        "title": "The supernatural seems logical?",
        "author": "The_Wise_Sultan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgqmvn/the_supernatural_seems_logical/",
        "text": "If causality is true, then existence was caused by something that is in itself uncaused, and thus god makes sense.  \nIf causality is not true, then there was never a need for a \"why,\" and thus god makes sense.\n\nAm I missing something, or does the existence of the supernatural is always the logical conclusion?",
        "created_utc": 1670572235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can all of philosophy be simplified as \"An attempt to understand reality or truth\"?",
        "author": "TruthIfy38",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgpsjw/can_all_of_philosophy_be_simplified_as_an_attempt/",
        "text": "",
        "created_utc": 1670569497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any philosophical writings on liminal spaces?",
        "author": "ICareAboutThat",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgp4zr/are_there_any_philosophical_writings_on_liminal/",
        "text": "\"Liminal space\" is a term describing places that are in-between different locations, being often abandoned and described as \"eerie\" or \"disquieting\". Though the term has recently become popular, similar concepts have been around in media for longer (ex. \"House of Leaves\", \"The Twilight Zone\"). I am wondering if any philosophers have gone in-depth on the subject of liminal spaces, given that the experiences surrounding them seem very particular to our current society.",
        "created_utc": 1670567351,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to i understand Nietzsche",
        "author": "Winter-Rip7364",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgntte/how_to_i_understand_nietzsche/",
        "text": "I just started reading beyong good and evil i can't understand a thing",
        "created_utc": 1670563171,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you lost all of your possessions but one, what would you want it to be?",
        "author": "Simple_Ghost",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgmtuu/if_you_lost_all_of_your_possessions_but_one_what/",
        "text": "",
        "created_utc": 1670560168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading about constructivism/ethics/metaethics from a layman's perspective?",
        "author": "Animore",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgmd6v/reading_about_constructivismethicsmetaethics_from/",
        "text": "Hi all. First off, just for some background, I'm a freshman in college who is possibly (probably?) Going to major in philosophy. I absolutely love philosophy, I think it's fantastic, and i think my fav branch of Phil is ethics, mostly metaethics with its discussions on the meaning and origin of normativity.\n\nObviously, without any kind of formal training in Phil, my readings are kind of scattered. I've read the \"basic\" texts in ethics (stuff like Bentham, Mill, Kant's groundwork, a bit of the Nicomachean ethics, with some online lectures for background so I have a little bit of assurance that I'm not confusing myself on what they're saying) but I have no idea if my conception of concepts like realism, objectivity, mind-independent moral facts, practical reason, etc. are well-founded and that I have a good mental picture that gets at what these concepts are talking about.  \n\nI've been recommended a dozen times Shafer-Landau's and Cuneo's books on moral realism, and I've been planning to grab copies of those when I can. But currently I've been absolutely fascinated with the doctrine(s) of metaethical constructivism. I'm really attracted to the idea that (from my understanding of what they're saying) moral truths don't have to come some independent abstract moral properties, but can arise from how we construct, view, organize and think about the world. But my biggest worry is that I jump into some papers and books that are filled with jargon that have hyper-speciic meanings, and without formal training in philosophy, I get confused as to what they're saying and my perspectives on the matter are warped because of it.\n\nSo (incredibly long-winded) background aside, *TL:DR:* without any training in philosophy, would it be okay for me to jump into some books/papers on constructivism (e.g. I heard Carol Street's stuff is very good on the matter), or should I take a step back and read something like Shafer-Landau and Cuneo? Should I wait to read any of this, and actually go through some formal classes in ethics beforehand?\n\nThanks so much, and sorry for the long-winded question.",
        "created_utc": 1670558858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anything in what we observe to be our world actually objective?",
        "author": "Ill-Ambassador-1480",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgmc7q/is_anything_in_what_we_observe_to_be_our_world/",
        "text": "I’ve never quite been convinced anything is truly objective. at least not when it’s definition is truly followed which I believe important when used in philosophical arguments. \nI think objective to mean from no perspective. All people have experiences, those experiences form how we view the world. thus our perspective is born. \nAs humans are individuals, in that they only have access to their mind and no one else’s. so the only perspective we have access to is our own.\nThus how can anything we ever think, do or believe be objective. \nI am aware of cogito ergo sum and technically I believe at least one thing to be objective. \nbut is anything else actually objective?",
        "created_utc": 1670558785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a branch of Philosophy that studies religions as cultural products, similar to artistic mediums?",
        "author": "FatherFestivus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgk7o4/is_there_a_branch_of_philosophy_that_studies/",
        "text": "&gt; * Philosophy of Religion is the philosophical examination of the central themes and concepts involved in religious traditions. \n\n&gt;* The History of Religion refers to the written record of human religious feelings, thoughts, and ideas.\n\nWhat I'm interested in is a field of study or specific philosopher that looks at religions as we would look at a medium of art. \n\nThe \"art form\" of crafting religions evolved as human societies evolved. Religions weren't always the same. The earliest tribal religions were very different to the religions we have today. We moved from tribal religions, to national religions, to global religions. The art form adopted certain concepts like anthropomorphised Gods, demons, heaven and hell, monotheism, proselytization etc... which allowed religions to compete with other religions. And successful concepts would get later adopted by new religions.\n\nA parallel can be seen with mediums of art, like literature for example. The earliest texts are very different from a modern novel, despite being works within the same medium. Because the medium of literature slowly evolved to adapt concepts like punctuation, paragraphs, chapters, genre tropes etc... \n\nDoes such a field exist? Thanks in advance",
        "created_utc": 1670552805,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Mill Utilitarianism view on Genetic enchantment of abilities and eradication of genetic diseases",
        "author": "Smooth-Beginning-365",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgjnk1/what_is_mill_utilitarianism_view_on_genetic/",
        "text": "I am having a hard time fully comprehending Mill. I recently just started reading his works and since I major in biology this question random appeared in my head. From my understanding Mill will find genetic Alterations immoral due to the discrimination it will impose and will find the eradication of genetic diseases moral due to the end result improving happiness by allowing others to live longer.",
        "created_utc": 1670551319,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will Mill Utilitarianism say about genetic alterations and eradications of genetic diseases ?",
        "author": "Smooth-Beginning-365",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgjita/what_will_mill_utilitarianism_say_about_genetic/",
        "text": "I am having a hard time fully comprehending Mill. I recently just started reading his works and since I major in biology this question random appeared in my head. From my understanding Mill will find genetic Alterations immoral due to the discrimination it will impose and will find the eradication of genetic diseases moral due to the end result improving happiness by allowing others to live longer",
        "created_utc": 1670550992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Modern Trolley Problem",
        "author": "FlatHalf",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgih4e/modern_trolley_problem/",
        "text": "Imagine you had the choice to free a largely innocent person who committed a minor crime and is being held in jail but only on the condition of also freeing an arms trade dealer.\n\nWhat would you do?",
        "created_utc": 1670548421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats the difference between Nihilism and Zen Buddhism?",
        "author": "MilchMensch",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgifsw/whats_the_difference_between_nihilism_and_zen/",
        "text": "Zen ideology and rituals as i understand them are supposed to be positive and empowering, achieving a state of „Zen“ means a person has learned to be at peace with the realization that no emotion *- positive or negative-* will ever be a permanent state of mind. \n\nNihilists live with the exact same realization. They also acknowledge the fact that they cant hold on to any feeling, and that long-term happiness is an unachievable state of mind.\n\nSo why is Zen Buddhism seen as a positive and enriching school of thought, when Nihilism offers essentially the same conclusion and are perceived to be a detrimental, gloomy and negative character trait? \n\nBoth Zen and Nihilism seem to overlap in this conclusion that life has no intrinsic meaning at all.\n\nIm sorry if i sound ignorant, but i dont have much knowledge of Zen and would like to learn from others.",
        "created_utc": 1670548331,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an example of a morally good action whose moral goodness does not reduce to its (good) consequences?",
        "author": "pistolpierre",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zghktf/what_is_an_example_of_a_morally_good_action_whose/",
        "text": "",
        "created_utc": 1670546266,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can Kant make free will axiomatic when the concept of being able to do otherwise is empty?",
        "author": "MoviesOnTheMoon",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zggmea/how_can_kant_make_free_will_axiomatic_when_the/",
        "text": "",
        "created_utc": 1670544105,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some philosophical stances on separating an artist from their art? Is it moral or immoral?",
        "author": "ftfrftfr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgg0s6/what_are_some_philosophical_stances_on_separating/",
        "text": "Artists/writers/inventors whom I learn have less than ideal backgrounds increases by the day. This very much disheartens me as I enjoyed their work but wish I still could without feeling guilty.\n\nLet me give you some examples:\n\nAlan Watts, with all his glorious and enlightening lectures, who would expect him to be an adulterous alcoholic who then actually died from alcohol poisoning?\n\nJohn Yates, an author of arguably one of the best meditation books, The Mind Illuminated, recently discovered to be adulterous also.\n\nExurb1a, popular youtuber who makes highly entertaining philosophical/psychological/fantasy videos, busted as a sex offender who raped his autistic girlfriend.\n\nDr. Seuss, the famous children's author, married his mistress shortly after his wife's suicide, who did so because of her husband's rightfully suspected cheating.\n\nFor Alan Watts and John Yates, one can argue that what they preached goes directly against their actions, thus making their work worthless if not unattainable. For the last two examples, this might not be the case, but still one may feel guilty for enjoying their work.\n\nAnother example is when you enjoy a song in a foreign language but discover it has heinous, derogatory lyrics.\n\nI mean, we all have flaws, but sometimes the degree of that just seems to nullify all our goodness. Am I being unreasonable and immoral? If yes, how does one get over it? Give me some philosophy, yo.",
        "created_utc": 1670542800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Natural selection of consciousness?",
        "author": "makmeyours",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgfxfc/natural_selection_of_consciousness/",
        "text": "We have seen recently that advances in artificial intelligence allow us to construct language models which closely mimic real human behaviour. It is therefore conceivable that robots may eventually become essentially indistinguishable from self-aware lifeforms. In the same way, it is plausible that biological entities could have evolved with little or no \"real\" consciousness.\n\nAssuming the above is true, if robots can function as well as self-aware lifeforms, self awareness (in the sense of the \"hard problem of consciousness\") in itself appears to lack a positive selective pressure (in the sense of evolutionary biology).\n\nAnother assumption I am making, and believe to hold, is that biology, the actual physical design of the organism, must possess specific characteristics in order for it to act as a \"vessel\" for real consciousness.\n\nMy question is: is it possible that conscious lifeforms in some vague sense detect \"real\" consciousness in other individuals and select for it? And, what would the benefit/motivation of that selection be, if it does not serve a practical function?\n\nIf someone has the answer to this I would very much like to hear it, and references to the literature will also be well-received.",
        "created_utc": 1670542588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Facts about Facts?",
        "author": "legaladvcethrowsaway",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgejqc/facts_about_facts/",
        "text": "Suppose we assume a view where facts are just true propositions, it seems like one could have facts of facts, true propositions about true propositions, \"All propositions of the form 'All x are mortal\", are explained by biological facts\" Do the lower level facts determine the truth value of the higher levels one, or are they mutually implied? Are we just doing logic at this point? What about n-order level facts?  If you know of any writing on these topics it would be much appreciated.",
        "created_utc": 1670539682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Camus nihilism? Advice?",
        "author": "Conscious-Juice",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgeg5b/camus_nihilism_advice/",
        "text": "Hello!\n\nI'm researching for an essay but also myself the concept of nihilism, or more specifically a combination of \"if nothing matters why not kill myself\" and capitalist/social schizophrenia/pressure which can also bring these type of thoughts on.\n\nI've just read Camus' (the stranger) for the first time which is exactly the type of thoughts I want to dive feeling into. Incredible.\n\nDoes anyone know any other literature by him that could relate to my question? Or other writers.\n\n(Google is offering me Satre and Kafka??)",
        "created_utc": 1670539474,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT on Nietzsche",
        "author": "bigyellowtaxi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgbkkm/chatgpt_on_nietzsche/",
        "text": "I’ve been chatting a bit with the latest [ChatGPT model by OpenAI](https://chat.openai.com/chat) and asked its opinion on what Nietzsche would have thought about the balance between taking care of oneself and being considerate of others. \n\nI won’t post the whole conversation as it is not really relevant, the relevant part is this answer from the model:\n\n&gt;\tIt's difficult to say exactly what Friedrich Nietzsche would think about the topic of finding a balance between taking care of oneself and being considerate of others. However, based on his philosophy, he may argue that individuals should focus on self-improvement and pursuing their own goals and desires, rather than being overly concerned with the needs of others. In his book \"Thus Spoke Zarathustra,\" he writes, \"Love of one's own virtue is a small virtue. But a great and infinite virtue is to love one's own virtues in others.\" This suggests that Nietzsche may believe that individuals should focus on their own virtues and personal growth, rather than worrying too much about others.\n\nI never studied Nietzsche professionally, only casually, and it’s been a long time I did that. Hence my question, is this quote and opinion correct? I’m not sure I agree with the interpretation of the quote (not sure if it’s even a correct quote) and I’m not sure either if this interpretation is indeed in the spirit of Nietzsches work. Any hints greatly appreciated.",
        "created_utc": 1670533455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moral Progress and J.L Schellenberg",
        "author": "therealredding",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgaxwa/moral_progress_and_jl_schellenberg/",
        "text": "Im in the middle of reading Progressive Atheism by J.L Schellenburg and I’m wondering if I could get some opinions on something. \n\nIn the book, JLS put forth that, on the macro level, humans have made moral progress. That over all, for ideas like …\n\n&gt; “callous and rude insensitivity toward other people’s feelings, of unthinking prejudice and undiscriminating retributivism, of tolerated class distinctions and unquestioning obedience to physically powerful authority, of patronizing attitudes toward women and the feminine, and of an accepted relational “distance” on the part of fathers and other men.”\n\n…humans have improved. \n\nPersonally I endorse this idea. However, I regularly get push back from others when I present this idea of the moral progress mentioned here. The most common is that the views JLS on moral progress are overly western influenced. His ideas of what counts as moral progress and even the fact that progress has happened is based on the view of a westerner. \n\nI can maybe see the logic of this critique, however I’m interest in other responses to this critique.",
        "created_utc": 1670532155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethical/Moral arguments against Medical Aid in Dying (MAiD) for those with mental illness? What does MAiD for those with mental illness say about how we view death and dying?",
        "author": "theultimatenihilistt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zgauav/ethicalmoral_arguments_against_medical_aid_in/",
        "text": "Hi all! I'm taking an End of Life Communication class and our final paper is to pick a law or policy about death (enacted or proposed) critique it, and discuss what it communicates about death and dying. I have decided to go with Canada's proposed law to extend MAiD to those who suffer from mental illness as the sole condition (to be enacted in March of 2023). I'm from the U.S., and the law doesn't allow that here and I don't even know if it's on the books. Personally, I am morally and ethically against MAiD for those who are mentally ill. I have struggled with depression, suicidality, and PTSD for almost a decade, and I am still against it. HOWEVER, I'm doing my literature review and I'm finding it SO difficult to find scholars who are opposed. The arguments for extending MAiD to those with mental illness definitely make logical sense (it's even making me rethink my ability to write this paper), and I definitely see where they are coming from. But it definitely doesn't help with the stance of my paper. I'm definitely feeling challenged writing a solid paper that clearly defines the problems and challenges of MAiD for the mentally ill, and also trying to figure out what this law says about how we view and perceive death and dying.\n\nIf anyone has any advice, opinions, and guidance, I'm very curious to hear! Thanks!",
        "created_utc": 1670531948,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it called when you believe existence is Mind?",
        "author": "Greg20980962",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg8226/what_is_it_called_when_you_believe_existence_is/",
        "text": "I'm Not talking about solipsism, I just believe everything is mind and I'm wondering if there is a philosophical term for that.",
        "created_utc": 1670526236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting my foot in the door. Need book recommendations",
        "author": "PlatinumParmenides",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg7v11/getting_my_foot_in_the_door_need_book/",
        "text": "Hi, I have been interested in Greek philosophy for some time. Im still getting my foot in the door. Are there any books you wonderful people can recommend to get me started on this journey? An overview of the philosophers and their teachings? Or someone easy to start off with? Thank you",
        "created_utc": 1670525842,
        "upvote_ratio": 1.0
    },
    {
        "title": "are we as humans, just living a chemical reaction, just reacting to our surroundings like everything else ?",
        "author": "Objective_Shake_4864",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg79xc/are_we_as_humans_just_living_a_chemical_reaction/",
        "text": "We are aware of the changes and we are doing things that we feel is our will, but our will is based on what's happening to us and around us. The way we see, we're living a world together but in the end we're just reciprocating to our situations. And chances are, that every other things, organic or inorganic feels the same way but they way of reacting is different.",
        "created_utc": 1670524629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Utilitarians vs Kantians",
        "author": "Reasonable_Error5332",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg73hr/utilitarians_vs_kantians/",
        "text": "I’m taking an intro course to philosophy right now and I’m really enjoying it but I’m having some trouble wrapping my head around the key differences between Kantian ethics and Utilitarianism. Are there any examples or scenarios where the two would disagree over the right thing to do? \n\nThank you!!",
        "created_utc": 1670524266,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most popular arguments for the existence of other minds?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg6uki/what_are_the_most_popular_arguments_for_the/",
        "text": "What are the most popular arguments for the existence of other minds?\n\nI know of only one most popular argument for the existence of other minds, and that is the best explanation argument. \n\nAre there any other popular arguments for believing that other people also have minds?\n\nhttps://plato.stanford.edu/entries/other-minds/\n\nThere are many arguments here, but I don't know which of them are popular and convincing. \n\nWhat about perceptual arguments?",
        "created_utc": 1670523758,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am doing a research - a social experiment called 'People Of 8 Billion'.",
        "author": "8billionbook",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg6cw1/i_am_doing_a_research_a_social_experiment_called/",
        "text": "Experiment concerning Human relations and technologies. In two words - The goal is to generate a text from Your answers to a philosophical question: 'If you could stand in front of 8 billion people, what would you say?'. When database will be full, the text then will be used to make a book 'People Of 8 Billion'.  More info you can find on 8billion webpage [https://8000000000.org](https://8000000000.org) Thank You for your messages!",
        "created_utc": 1670522670,
        "upvote_ratio": 1.0
    },
    {
        "title": "What gives humanity the exclusive rights of Habeas Corpus &amp; what even makes us human?",
        "author": "Routine-Education",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg6525/what_gives_humanity_the_exclusive_rights_of/",
        "text": "I recently concluded my first introduction to ethics class and found the topic of normative ethics very interesting in terms of justifying the “why” things are considered to be ethically permissible or impermissible. I recently had a debate on the topic on should we give animals the rights of habeas corpus in the case for Happy the elephant. I understand this is a legal question, however it can be based on moral principles. \n\nFor my argument, I took Kant’s deontological approach with his second categorical imperative. Kant states that we should not treat people as things whether that is through manipulation, exploitation, or deception because they are autonomous, ration beings that have their own goals and aspirations in life just like you or I do. Therefore, we should not treat other humans nearly as a means to an end, but an end in themselves. With this argument, and given the time frame Kant made these statements, it can be argued that he was a species-ist and didn’t consider that there could be other levels of consciousness and rationalization amongst other  species.\n\nFurthermore, my argument is that to receive habeas corpus, a creature must have a conscientiousness, rational thought, and be able to articulate their thoughts if they believe they are being morally or legally mistreated. If an alien species came to Earth and were able to demonstrate all three of these things, I believe that we should give them personhood and the right of habeas corpus. \n\nUnderstandably, I recognize that there are species here on Earth that have consciousness, or even the ability of rational thought to a degree, but no other animal truly has all of those boxes checked off. Something else to mention is that I believe that just because these creatures do not have personhood under the law does not mean that they are incapable of suffering and that can treat other creatures however we like. I believe that we should treat all creatures with respect because we have a duty to use our rational thoughts to protect other creatures that are not fortunate enough to have the intellect that we have as a species. I believe Kant would also argue in favor of this that we should not treat animals however we want because we would lose our own humanity in the process and that how we treat other beings is a reflection of our moral character.\n\nNow this begs the question, why what makes us human at all? And consider the implications of what that means for people who are in a vegetated state or someone in a coma who are brain dead. I am not saying that anybody with a disability is excluded from personhood or what it means to be a human being, but that right or habeas corpus would be revoked if they’re missing all three because they cannot truly consent to any medical or even in the bounds of any legal frameworks. In that instance would they not lose what it means to be a human? Surely we can recognize that they too are Homo sapiens and we should treat all humans with respect and dignity. In the state of a coma where there is no brain activity, would they not lose what it means to truly be human? \n\nWhat makes us any different from our common ancestors of Chimpanzees that can use tools, communicate with us, and suffer like we can? And would that be comparable to that or any other creature outside of what we define as personhood where we cannot treat anything however we want, but should respect all creatures and have a duty to prevent unnecessary suffering and potentially even nurture said creatures who are suffering. In other words, would that person not just be a shell of a human being at that point? In the instance of someone in a coma, that person cannot even consent to any medical decisions so it is left to the next of kin to decide. Another instance would be a power of attorney on who can make legal decisions on their behalf. Someone in that hospital bed should still be treated with dignity and respect and even take the time to appreciate the humanity they previously had with the shared memories and experiences that shaped our perception of the world. We treated them as an end in themselves while they were conscious, rational, and autonomous beings, but no longer have that “soul” or intellect any longer. \n\nSo my final questions are the following. Are my justifications for what should include personhood and the right of habeas corpus make sense and are they morally justified? Does my philosophy surrounding what it mean to be a human being also make sense as well that we have morally superiority because we are autonomous, rational being that can articulate our goals and aspirations in life. Lastly, what are your thoughts around the controversial idea that people can lose personhood and the idea of what it means to be human is when they lose their intellectual ability to be able to distinguish, recognize, and article themselves and others in the world around them.",
        "created_utc": 1670522184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Camus and Kierkegaard on freedom essay help",
        "author": "orbmad1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg63l7/camus_and_kierkegaard_on_freedom_essay_help/",
        "text": "This is a request for help with school work, I'm not asking for people's opinions (as per the rules) but for pointers as I process all this in my mind - I'm writing an essay on Kierkegaard and Camus on 'freedom' and critically evaluating them. Can people please point me in the direction of philosophy that can help answer the question of whether we can attain more freedom in the self (Camus) or in something larger than ourselves (Kierkegaard)? I am an atheist and so C is more attractive to me - I noticed that I felt freer after deconstructing from a religious worldview, with more room for genuine growth beyond a priori beliefs I need to defend; I like the whole existentialist 'existence proceeds essence'. It makes sense to me. \n\nBut, I also notice that I have yet failed to develop a sustainable ethical system since giving up the label of Christian. I create my meaning by choosing to help others, but I don't know how I would respond if another existentialist lived life radically differently, such as creating meaning by serving their own selfish desires in a malicious way. I do understand that desire for there to be a larger something that we can serve, a Higher Power. Augustine, who I still find beautiful, argued that true freedom existed in the love of God, who has made us for Himself and thus, there is greater freedom in serving Him because He knows what we 'actually' want. I still get that. \n\n I see the pros and cons of both, but still side with Camus - I think that if there were a meaning, it would be more obvious. Could God have given us that radical freedom to discover the unobvious meaning, though? I don't think so - Not if He is personal - Surely, if I'm going to have a relationship with somebody, and that relationship is open to all people (universalism) it would be obvious and not leave us ever in the dark? \n\nAre there any journal articles, books etc people can recommend to help me as I evaluate this for my essay? I feel so on the fence.",
        "created_utc": 1670522088,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the chances that the end goal of evolution would be immortality?",
        "author": "Objective_Shake_4864",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg5u6h/what_are_the_chances_that_the_end_goal_of/",
        "text": "",
        "created_utc": 1670521490,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Meta-Ethical School Does Atheism Fall Into?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg5nnp/what_metaethical_school_does_atheism_fall_into/",
        "text": "1.does it fall into ethical naturalism, moral relativism or moral nihilism?\n\n2.also does moral objectivism and moral subjectivism exist?",
        "created_utc": 1670521067,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT: how ethical is it to use a machine for creative purposes?",
        "author": "atom-bit",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg49lw/chatgpt_how_ethical_is_it_to_use_a_machine_for/",
        "text": "So, as you may know already, ChatGPT is a large language model that provides human-like responses to almost any question. It can write dialogue between random people or things, write a story based any prompts, write a whole movie script including dialogue, shots etc. and even write a code all in under a minute. My question: with this much access to creative knowledge, how ethical is it for people to use it in their work? For example, I can see people using it to create youtube video scripts, programming websites, or even school/college papers in an instant. How will the world become in a few years with this technology?",
        "created_utc": 1670517886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is topic of Human Nature Metaphysical or Ethical?",
        "author": "martialarts4ever",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg46wt/is_topic_of_human_nature_metaphysical_or_ethical/",
        "text": "I'm trying to research in the topic of Human Nature (i.g., within philosophy, not other disciplines)\n\nI was wondering whether the topic of Human Nature is usually addressed in Ethics or in Metaphysics?\n\nAlso, is there a difference between the philosophy of Human Nature, versus the philosophy of Human?",
        "created_utc": 1670517729,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best \"apologetic\" thought experiment that you have come across?",
        "author": "thro_away64",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg2osv/what_is_the_best_apologetic_thought_experiment/",
        "text": "I'm looking to find a strong thought experiment that acts *in support of* a philosophical claim (instead of acting as a counterexample / made to refute an existing claim) \n\nI like Gettier problems, but they are made to refute the idea that knowledge = justified true belief, and so I don't really consider them to be \"apologetic\" (term from Popper 1934) \n\nI was wondering if any of you could bring one to my attention which is strong and appeals to intuition to support a philosophical claim\n\nMany thanks in advance",
        "created_utc": 1670514562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why contribute to society?",
        "author": "ammar_727",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zg21g9/why_contribute_to_society/",
        "text": "I don’t understand that why should I contribute to society and help other... I mean why is selfish wrong and selfless right? If I die after a life of selfishness, i.e living for my family and close ones only, after living a life of comfort and pleasure. No one remembers me after I’ve lost consciousness. Why does it matter that I contribute to society, as I will have to compromise my life for it? \n\nWhy compromise pleasure from my life so someone else could have the pleasure in theirs?\n\nEvery other person I’ve asked this question who wants to help the society and contribute to the society never have a definite answer for it which is rationally understandable. They all say that it’s innate nature that they possess.\n\nI do not possess this nature innately. Is that wrong or right? Or there’s no wrong or right in it?\n\nI do have an answer in support of contributing to the society, that I’m still processing. I would like to hear your guys perspective on this and then I’ll share mine.",
        "created_utc": 1670513144,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the philosophical differences between Hume and Kant?",
        "author": "jacky986",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfzoq7/what_are_the_philosophical_differences_between/",
        "text": "Basically, as the title says I want to know what the philosophical differences are between Hume and Kant. I tried doing internet searches but the articles I found on them so far have wording that is so pretentious that I can’t make heads or tails about what they are saying. All I could get out of it was Kant’s philosophy was influenced by Hume and Rousseau.\n\nNote: This is not for homework or a project I’m just curious about the subject.",
        "created_utc": 1670507906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a phylosophy?",
        "author": "dangel441",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfydlg/is_this_a_phylosophy/",
        "text": "Is there a phylosophy about importance of sharing moments with someone. So when you achieve a success you need to share it with someone so it gets a real value. I mean like why all the effort for something if you don't have anyone to share that with.",
        "created_utc": 1670504763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social media/microblogging moderation: what type of moderation do you prefer and why?",
        "author": "AlbertoAru",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfy6jq/social_mediamicroblogging_moderation_what_type_of/",
        "text": "This is kind of the eternal discussion of how a society must be ruled, but about the internet (where people act differently).\n\nI found 3 types of moderation on the internet:\n\n1. Centralized services like Twitter, where one directive board takes all the decisions on the company and have a dedicated moderation team (which may vary from owner to owner as we recently have seen).\n2. Decentralized services like Mastodon, where the owners of the multiple small servers decide what do they allow and what they don't, although as far as I know, none of them get paid for moderating and might be inconsistent. Servers have the option not to communicate with other they don't agree with their ideology (eg: pro-LGBT+ server might block all connection with anti-LGBT+ servers).\n3. Reddit like moderation: there's two levels of moderation: subreddit level and also reddit level as a company. Not sure if there's a way to implement it into twitter-like systems.\n\nCentralized services are more difficult to change but also they are supposed to be more consistent and transparent, they also depend on less people. With decentralized services happens quite the opposite. \n\nPlease, share all kind of related articles, videos, studies, etc.",
        "created_utc": 1670504302,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the parallels and differences between the philosophies of Bataille and Hegel?",
        "author": "obtusix",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfy332/what_are_the_parallels_and_differences_between/",
        "text": "I have learned that Bataille wrote a lot about Hegel, but I assume he was reading a French interpretation of him. Are there any recent writings that (fairly) judge the two philosophies and demonstrate how similar or divergent their thinking was?",
        "created_utc": 1670504058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any name for the metaphor of mountain-climbers climbing a mountain in the fog and reaching a top without knowing if it is the real top or just one in between?",
        "author": "Jaraskur01",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfwpl4/any_name_for_the_metaphor_of_mountainclimbers/",
        "text": "I am preparing a presentation about critical rationalism and want to talk about the mentioned metaphor and would really like some sort of graphic, but can't find anything on the internet (I guess because I don't use the right name for it). It is a metaphor for humans being unable to achieve true knowledge or truth in general, because they never know whether their knowledge is complete, because they never know how much they don't know? Does anybody have an idea under what keywords I could find some sort of image? Thanks in advance!  \n(Disclaimer: not a native-speaker)",
        "created_utc": 1670500303,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is The Biggest objection to Kalam cosmological Argument?",
        "author": "comoestas969696",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfvtps/what_is_the_biggest_objection_to_kalam/",
        "text": "premise one :everything begin to exist has a cause\n\nfor example you and me and every object on the planet and every thing around us has a cause of its existence \n\nsomething cant come from nothing\n\npremise two :\n\nuniverse began to exist we know that it began to exist cause everything is changing around us from state to another  and so on \n\nwe noticed that everything that keeps changing has a beginning which can't be eternal\n\nbut eternal is something that is the beginning has no beginning\n\nso the universe has a cause which is eternal non physical timeless cant be changed.",
        "created_utc": 1670497332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Hume have any influence on Marxism?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfvrmn/does_hume_have_any_influence_on_marxism/",
        "text": "Direct or indirect, and how substantial is his influence on Marxism/Dialectical Materialism?",
        "created_utc": 1670497162,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your biggest objection to the Kalam cosmological Argument?",
        "author": "comoestas969696",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfvpts/what_is_your_biggest_objection_to_the_kalam/",
        "text": "premise one :everything begin to exist has a cause\n\nfor example you and me and every object on the planet and every thing around us has a cause of its existence \n\nsomething cant come from nothing\n\npremise two :\n\nuniverse began to exist we know that it began to exist cause everything is changing around us from state to another  and so on \n\nwe noticed that everything that keeps changing has a beginning which can't be eternal\n\nbut eternal is something that is the beginning has no beginning\n\nso the universe has a cause which is eternal non physical timeless cant be changed.",
        "created_utc": 1670496980,
        "upvote_ratio": 1.0
    },
    {
        "title": "suggestions on the philosophy of poetry?",
        "author": "mslvvvv",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfvhgl/suggestions_on_the_philosophy_of_poetry/",
        "text": "",
        "created_utc": 1670496130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats the most interesting topic when it comes to philosophy?",
        "author": "FwE2u",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfv6pn/whats_the_most_interesting_topic_when_it_comes_to/",
        "text": "I have to do a presentation about a philosophical topic, but im not sure what to go with \nIt has to be interesting and away from religions and politics",
        "created_utc": 1670495062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Desire: Is it possible for a person to want to do something, to be able to do it, and not to do it? Are our desires determined by our perception of them, or what our actions reveal them to be?",
        "author": "machinaro",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfv2u4/question_about_desire_is_it_possible_for_a_person/",
        "text": "",
        "created_utc": 1670494666,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of logical argument is this response? Or it a rhetorical technique?",
        "author": "QuittingSideways",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfsbmj/what_kind_of_logical_argument_is_this_response_or/",
        "text": "",
        "created_utc": 1670484600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kantian approach to immigration",
        "author": "bvbftw09",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfqokp/kantian_approach_to_immigration/",
        "text": "Is immigration, with the primary motive of wanting to improve conditions for your children, a perfect or imperfect duty? I ask this because Kant seems to argue that categorical imperatives will automatically become perfect duties- and in this situation I view that wanting to improve the lives of your offspring is something that must be done regardless of desire. All thoughts are appreciated.",
        "created_utc": 1670479024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would Parminides be seen as a giant if the Greeks lost to Elea?",
        "author": "shade_of_freud",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfq4he/would_parminides_be_seen_as_a_giant_if_the_greeks/",
        "text": "I'm reading a book about the life and political context if Sophocles, and couldn't help but notice all of the pre-socratic philosophers. In particular, since Greece had a series of victories in 5th century BCE, especially over surrounding islands, then how do we know if Socrates, Plato and Aristotle were the most superior? I know nobody has literally made this claim compared to the wider world of ancient philosophy (well they probably have) but how much influence does Greek dominance have over our perception and salience of their bodies of thought?",
        "created_utc": 1670477268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Open university course work?",
        "author": "XGhb1177",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfq2bg/open_university_course_work/",
        "text": "Is there a university having their literature lists and tasks public/online? Basically everything that gets done during a whole degree?",
        "created_utc": 1670477077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does our sense of self preservation limit what we’re capable of knowing/achieving?",
        "author": "StTheo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfq1x7/does_our_sense_of_self_preservation_limit_what/",
        "text": "In genetic algorithms (and possibly evolution as a whole), there’s a concept of a local maxima, a solution that has the highest fitness relative to other solutions. This is like finding the highest elevation on an island, not knowing there are mountains far higher across the sea.\n\nEventually people will find them; we know this because people understood enough of the Earth’s curvature to establish that sailing across an ocean was safe (assuming at least that part of the Columbus story was accurate). But those voyages were only made when it was deemed safe to make them. (Also pretend in this analogy that Mount Everest is in the Americas)\n\nWhat if there’s knowledge that is impossible for us to obtain, because we’re hard-wired to think in terms of self-preservation and continuing of our species? Also is there a term for this line of thinking? I can’t imagine I’d be the first to have it.",
        "created_utc": 1670477040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for articles on Nietzsche style in relation to \"masks\"",
        "author": "Big-StrictOp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfpxvv/looking_for_articles_on_nietzsche_style_in/",
        "text": "does anyone have/know of some interesting articles on Nietzsche's style that can be related to his idea of masks/his aesthetics///esoteric and exoteric philosophy - ive checked through my schools data base and found some stuff but was wondering if anyone knew of more. Im reading stuff by Lampert, Parkes, William, Fisher, Babich, Janaway, Pearson, Merrow, Lang, and Douglas. My interpretation of style is mainly centred around Douglas' chapter on Nietzsche and style. to note, I am an undergrad cramming right now, hence this chaotic text.",
        "created_utc": 1670476704,
        "upvote_ratio": 0.99
    },
    {
        "title": "Where to start with Robert Brandom?",
        "author": "Theo-Logical_Debris",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfppsv/where_to_start_with_robert_brandom/",
        "text": "I know next to nothing about Neo-Pragmatism but I have some study of Peirce (father of Pragmatism) under my belt. Any recommendations? I'm interested mainly in epistemology and how Brandom's thought bears on philosophy of religion.",
        "created_utc": 1670476026,
        "upvote_ratio": 1.0
    }
]