[
    {
        "title": "how similar can something be before its identical?",
        "author": "Pink_Luck",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zpap5p/how_similar_can_something_be_before_its_identical/",
        "text": "we had this discussion with a friend:  \n\n\nA demon asks you to bring him the closest thing possible to, lets say , an ashtray, if you fail his task he kills you.  \n\n\nif you bring him an actual  ashtray, will he kill you?",
        "created_utc": 1671403620,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would Kierkegaard's Knight of faith deal with religious doubt?",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zpaoah/how_would_kierkegaards_knight_of_faith_deal_with/",
        "text": "How?",
        "created_utc": 1671403552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vegetarianism and veganism",
        "author": "defenestrator2000",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zpanis/vegetarianism_and_veganism/",
        "text": "If a *moral* vegetarian refrains from eating meat because it kills animals and perpetuates a cycle of animal exploitation, how do they justify eating animal products, especially eggs? Wouldn't it be more rationally consistent to be vegan? (note that I'm neither vegetarian nor vegan, I'm just curious about the logic of animal rights regarding eating aminals and animal products)",
        "created_utc": 1671403499,
        "upvote_ratio": 1.0
    },
    {
        "title": "how does God has infinite intellect in spinoza's metaphysics if it isn't even conscious?",
        "author": "probably_gonnaregret",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp9vsc/how_does_god_has_infinite_intellect_in_spinozas/",
        "text": "",
        "created_utc": 1671401409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help pleek",
        "author": "arthropods-",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp92n0/help_pleek/",
        "text": " Can someone tell me who is a person according to Kant and what are the criticism of his definition of a person. Or even a utilitarian definition of who is a person and its criticism.  I have a paper due tonight.",
        "created_utc": 1671399300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any solid arguments against moral relativism?",
        "author": "TheSmallestSteve",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp8eyo/are_there_any_solid_arguments_against_moral/",
        "text": "Seeing as how morality varies wildly across cultures, individuals, and even species, I believe it to be purely subjective. It is something we feel in the soul, rationalize with the mind, and then project onto the world.\n\nAre there any solid arguments against this?",
        "created_utc": 1671397589,
        "upvote_ratio": 1.0
    },
    {
        "title": "getting into philosophy",
        "author": "mxbrn",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp8902/getting_into_philosophy/",
        "text": "hi there,\n\ni´m a 16 year old german student and i´m already interested in politics, sociology (social sciences in general). i´m also interested in philosophy, already read some books. here some of the books i read: nietzsche´s antichrist, platon´s politeia, the apology of socrates, some marx-engels stuff and some critical theory stuff from adorno and horkheimer (know them because i´m german and i´m a bit into leftist theory).\n\nso i´m more interested into political and social philosophy, but i´m also open for any other subgenre (except philosophy of logic). already read some excerpts from descartes, schopenhauer and hume. i know that they are different genres, just wanted to mention some philosophers i read about. \n\ni also very like nihilism and anything that goes in the direction of schopenhauer and nietzsche.\n\nin the end i want to excuse me for my bad english haha.\n\nthanks.",
        "created_utc": 1671397190,
        "upvote_ratio": 0.99
    },
    {
        "title": "I never rise nor do I fall. Do i lay down, or do I stand tall?",
        "author": "thinqker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp780g/i_never_rise_nor_do_i_fall_do_i_lay_down_or_do_i/",
        "text": "",
        "created_utc": 1671394487,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you call the view that specific parts of philosophy are tautology?",
        "author": "pygmalioncirculares",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp6s0p/what_would_you_call_the_view_that_specific_parts/",
        "text": "What would you call someone who has these type of beliefs?\n\nFor example if someone asks them “Is this action just?”, their answer would just be “Define just for me, and I can tell you, otherwise I don’t know if we mean the same thing by just.”\n\nThis is because justice is a term recognised widely, but people have different understanding of what the word means, and there’s no guarantee that one’s conception of justice is the same as another’s.\n\nAnother more topical example today is in defining what a “woman” is. Some people define woman to include trans-women, some do not, and people variously assign edge cases either in, or out, of the group of “women”. But ultimately this just means they’re talking about different groups, because “woman” is just a made up word which everyone has a different baseline mental understanding of. \n\nThis would mean that “debates” about what a woman is are completely meaningless, because a woman is just whatever you define it to be, and if you don’t know whether your interlocutor is including particular groups, just ask them to clarify.",
        "created_utc": 1671393339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between disciplinary power and normalising disciplinary power?(Foucault)",
        "author": "TouchMyBush69",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp62o3/difference_between_disciplinary_power_and/",
        "text": "Hi guys. I am reading Crime and Punishment, with a little help from Stanfords Foucault lexicon. As far I understand Foucault opperates with the concepts sovereign power, disciplinary power and normalising disciplinary power. I have a hard time distinguishing between the latter two. To me they just seem to similar:-).",
        "created_utc": 1671391460,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent do Kantian moral philosophy and utilitarian moral philosophy align with right and left on the political spectrum, respectively?",
        "author": "SufficientAdagio914",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp5r4s/to_what_extent_do_kantian_moral_philosophy_and/",
        "text": "I wondered about this because Kant seems to have been a religious apologist who thought that morality could be separated from reason.  I might be wrong.  Ayn Rand wrote some vitriolic criticism of Kant, although I guess any side of the political spectrum doesn’t have to agree with itself.  Utilitarianism seems to agree with a lot of liberalism and left libertarianism.  Do these currents of thought have any such connections from 18th century to present?",
        "created_utc": 1671390604,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m having an existential crisis. Is it possible to exist in modern life without substance use?",
        "author": "scorpiochik",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp4ir8/im_having_an_existential_crisis_is_it_possible_to/",
        "text": "Do you think modern life is possible without the use of some form of stimulants like alcohol, Xanax, Adderral, marijuana, etc? \n\nDay to day life has become soul crushing for me in some ways and when I look around and wonder how everyone else is doing it it just looks like it’s mostly just substance use?",
        "created_utc": 1671387259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is materialism dying? Is illusionism correct? Does consciousness exist?",
        "author": "The_Obsidian_Dragon",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp4i2t/is_materialism_dying_is_illusionism_correct_does/",
        "text": "",
        "created_utc": 1671387205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophers of Chance",
        "author": "findthetangent",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp4fin/philosophers_of_chance/",
        "text": "I'm reading a book about contingency in literature and the author mentions philosophers of chance like Slavoj Žižek and Gilles Deleuze. Does anyone have any suggestions of other philosophers that cover the subject of causation, probability and chance?",
        "created_utc": 1671387008,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should a speech on the topic 'The Realm of Hope has Forsaken Us' go?",
        "author": "muhammad-dawood-",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp441s/how_should_a_speech_on_the_topic_the_realm_of/",
        "text": "Please help me understand this topic for an upcoming speech, and suggest some places where I could get relevant information.",
        "created_utc": 1671386108,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the best possible way to begin studying philosophy?",
        "author": "CardTechnical6417",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp3bh0/what_would_be_the_best_possible_way_to_begin/",
        "text": "[removed]",
        "created_utc": 1671383668,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dread dying due to all of the lost experience, how to deal with it?",
        "author": "newaccount1000000",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp1mc1/i_dread_dying_due_to_all_of_the_lost_experience/",
        "text": "I'll lose all I experienced, all the knowledge, all the memories. So even if I started this life being lost and was so lucky to go through experiences that lead me to leading a good life, I will return to being lost once I die. This scares the bejebus out of me when I start thinking about it.\n\nSo how does one deal with this? There's solution currently, I will age and my brain WILL die, it WILL be lost. I could wish to have been born a human in the future where humanity had worked out technological progress to stop aging process and fix diseases... to me this sounds like ultimate goals of humanity, but they seem very far away, certainly beyond my lifetime.\n\nSee the problem is my brain keeps seeking for truth, knowledge, solutions and answers, and I cant fundamentally change how my brain works, these thoughts do occupy my mind and plop in from time to time. The best solution I think is to distract myself from thoughts of this discomforting fate, as I cant do anything about it anyway. It's not that distracting myself is a solution to the problem itself, but it's far better than wallowing in self pity and depression without purpose or point. Religious people will probably claim that my spirit and soul will retain the memories  (such a comforting though it, and that I believe is their distraction they use), but as I see it knowledge and memories of experience is store in the brain, and can be lost if the brain suffers damage ( not so comforting a thought :/ ).\n\nSo how to distract myself? Reading about this subject I learned about meditation and staying completely in the now, making note of just my senses as I experience them here and now. This works wonderfully to combat those dark sneaky panicy thoughts about reality, simply because you stop thinking about the future and just experience what happens here and now.\n\nAnother way to distract is to spend time acquiring skills and experiences that I value and enjoy, learning skills, working on projects that I find interesting and fulfilling, taking joy in my family and my (few) good friends, my, (so far) good health and stable peaceful environment that I am lucky to have.\n\nSo in the absence of a solution distract myself to a good life and postpone concerns about the actual problem to when it actually becomes relevant.\n\nI would like to hear thoughts on this matter, at this point I feel like there may not really be anymore else to do about it, but maybe I missed something. Maybe there IS something else I can do also?",
        "created_utc": 1671378913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which are Kripke's criteria for rigid designators and transworld identity?",
        "author": "N-T-KYS",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp0snl/which_are_kripkes_criteria_for_rigid_designators/",
        "text": "I am a postgraduate student and at the beginning of the semester, we were required to choose some optional courses and I chose one on \"Naming and Necessity\" . My background is that of a historian so I struggle with philosophy a bit. We are required to write a paper , approximately 5,000-6,000 words and I have to submit the topic within the next week and a draft by the beginning of 2023 and there is something that has been baffling me . \n\nKripke states that a rigid designator refers to the same thing across all possible worlds .\n\nThe \"same thing\" part is the one that confuses me . To my understanding, for something to be the same across all possible worlds , it has to fit some criteria for transworld identity . Those criteria ought to be necessary truths . For example , we can recognise gold by its atomic number , despite the fact that it might not be yellow in another possible world , since this would be a contingent property. \n\n\nLet's assume I  have a gold bracelet, which I will refer to as F . How can F be a rigid designator for my gold bracelet ? All its properties that I can think of (for example , it's shape , color , the fact that it belongs to me) , are contingent truths . The only necessary truth is that it is gold and its creator . But it is possible that there are more than one gold bracelets. Even if there is only one , we can't be sure it is the same . So , how does  F rigidly refers to the bracelet ?\n\nIt baffles me even more when we are talking about living things . For example Aristotle refers to the man named Aristotle across all possible worlds . All things about Aristotle are contingent truths , apart from his parents . Does this mean that if Aristotle's parents had a boy named Aristotle would it be the same one? \n\nThe fact that words like \"gold\" , \"pain\" , \"cat\" , groups of things in general are rigid designators makes sense to me . However , the fact that Aristotle rigidly refers, does not . \n\nIt makes sense to me , if I assume that Kripke has a metaphysical view of the world and assumes that everything has some kind of a \"soul\" which is an essential property and a necessary truth , but since Kripke's philosophy is analytic , this wouldn't make any sense . \n\nAm I reading Kripke wrong ? Does my background as a historian confuse me , since my brain needs a bunch of factual data ?",
        "created_utc": 1671376483,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s new in philosophy of technology and AI?",
        "author": "anonzsko",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zp0838/whats_new_in_philosophy_of_technology_and_ai/",
        "text": "[removed]",
        "created_utc": 1671374831,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I get into philosophy?",
        "author": "Substantial_Two38",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zozvpl/how_should_i_get_into_philosophy/",
        "text": "I’m 16 years old and want to learn about philosophy. Are there any books I should read first, videos I should watch, or other things to do?",
        "created_utc": 1671373817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book reccomendations",
        "author": "Rafferty_Bentley",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoy8v9/book_reccomendations/",
        "text": "Hi, im buying a christmas gift for somebody but im not entirely sure what a good book to start with for somebody whos really into jordan peterson is??",
        "created_utc": 1671368884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do philosophers feel that \"time\" needs to be either cyclical or linear?",
        "author": "sully9088",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zowuc5/why_do_philosophers_feel_that_time_needs_to_be/",
        "text": "Our brains are built in such a way that we can only understand a limited amount of concepts. In our effort to understand existence and everything around us, we simplify everything. We break uncomprehensible concepts into simplified versions that we can understand, but we ultimately miss out on the truth. Our limited understanding becomes the measuring stick against all else. When subatomic and atomic particles move, we view a change. There is evidence that some particles can move \"the opposite direction\" than what we would expect. This blows our minds because we think, \"Wow, that particle is basically going back in time.\" Is there a theory out there that builds on the idea that time doesn't really exist in a linear or cyclical way? Time just seems to be a messy illusion and I feel we are missing the bigger picture here.",
        "created_utc": 1671364058,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is luck?",
        "author": "artnewbie1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zovwwz/what_is_luck/",
        "text": "some cultural beliefs lead people to believe that doing a certain thing will lead to years of bad luck, others don’t believe in it. i’ve never found anything to read up about it so i’ll ask, what actually is luck? is it a made up concept?",
        "created_utc": 1671360418,
        "upvote_ratio": 1.0
    },
    {
        "title": "thoughts on object-oriented ontology?",
        "author": "ecstasyandeuphoria",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zouiz6/thoughts_on_objectoriented_ontology/",
        "text": "and speculative realism in general",
        "created_utc": 1671354842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conflating positions - what fallacy is this?",
        "author": "Dr_Matoi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zou5hq/conflating_positions_what_fallacy_is_this/",
        "text": "I'm looking for a handy term for the following line of \"reasoning\" that I often notice in internet discussions:\n\n*First people complain about X, now they complain about Y - people just don't know what they want, they are stupid and this discussion is pointless.*\n\n...where X and Y are more or less opposed to each other.\n\nExample: \"In the past people always wanted phones to be larger, now they complain that there are no small phones. Make up your mind and stop whining.\" \n\nA variant on this is:\n\n*People complain about A, yet people do not mind B - people are inconsistent and stupid and this discussion is pointless.*\n\n...where A and B are similar.\n\nExample: \"People are whining about fish dying in this poisoned river, but they don't care about farms slaughtering thousands of chickens every day. Just shut up everyone.\" \n\nIn both cases there may very well be sizable groups holding each position (e.g. some people hate X, other people hate Y), but these groups do not necessarily intersect. The arguer conflates them to make a discussion appear irrational - maybe in order to maintain the status quo, or just to get out of a discussion in a way that makes them feel superior.\n\nI have searched some lists of fallacies, but I cannot find a good fit. I may very well have missed something. Does anyone know?",
        "created_utc": 1671353386,
        "upvote_ratio": 1.0
    },
    {
        "title": "if you know \"things in themselves\", will Phenomenology be irrelevant?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zosys2/if_you_know_things_in_themselves_will/",
        "text": "In case one believes in the ability of \"knowing things in themselves\", will Phenomenology still be useful for them?",
        "created_utc": 1671348719,
        "upvote_ratio": 1.0
    },
    {
        "title": "What philosopher said that rabid dogs had to be killed without hatred or rancor?",
        "author": "geraraag",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zosr97/what_philosopher_said_that_rabid_dogs_had_to_be/",
        "text": " I remember that I read a quote that said that mad dogs did not choose to be like that, so they had to be killed without bad feelings \n\n Would someone give me the actual quote?",
        "created_utc": 1671347897,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if I believe in Something that isn't true (factually) but beneficial for me ?",
        "author": "Weird_Lengthiness723",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zosoos/what_if_i_believe_in_something_that_isnt_true/",
        "text": "Suppose,one believes in a thing that is not true ( I am using the correspondence definition of truth here) but benefits oneself and maybe others..",
        "created_utc": 1671347616,
        "upvote_ratio": 1.0
    },
    {
        "title": "status of motivational internalism",
        "author": "ththeoryofeverything",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zortt1/status_of_motivational_internalism/",
        "text": "How well accepted is motivational internalism ? And what are the implications of it ? Are moral reasons inherently motivating  Compared to say direct incentives",
        "created_utc": 1671344310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Modern western psychology posits that individuation is a neurosis, fully or wholesomely developed it is a helpful neurosis. Wrongfully developed, it is a destructive neurosis, and that exposure to the “real” is psyocpathy. Is there any reconciliation with this?",
        "author": "LittleFoot_Path",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zordgx/modern_western_psychology_posits_that/",
        "text": "My position is that both are ultimately delusional. And it’s unhelpful to consider “healthy” neurosis as some attainment because if it is attained, it’ll lead to nihilism, which is a false presumption of the self and it’s place in the world. Which it won’t ever “really” get cause it doesn’t have a place in the world. It’s just a thought. \n\nWhen the Awnser seems simple, the self depends on its role in the world. Without the self there is no free will and a without the world there is no self. They depend on each other as linguistic and pragmatic experiences and should be treated equally. The world is an intrinsic part of why I am “me” that would suffice, except is doesn’t. There is not an individual there and no free will, it seems like there is, but there really isn’t. Thinking there is in the first place is a delusion, it’s not how things really are.\n\nThis seems like a matter of investigation to settle this argument, the self, as a fixed position, simply doesn’t exist, and it’s just ignorance that causes the “selfing” to happen, but this continues as a predominant thought in modern philosophy. Why? Why is ignorance so overlooked as a plausible response to the self? \nI don’t think we have any reasonable excuse to believe in it other than “we want to” which is valid but also telling of delusion. \n\nIf you can, Explain what an individual is without using metaphysical terms and you’ll see what I’m asking here, I never was this body, never had a thought that was my own, what is this self the western mind says is me? My therapist says over and over that I’m not my thoughts, I agree, but isn’t me having a body just a thought? So why do I have a social security number, a birth certificate? A name? Those are thoughts about my condition, not what it means to be a subject. So are we really that oppressed? That since birth were being conditioned to believe in the individual? What’s going on there?\n\nIt’s like we’re playing at something we just don’t really believe in, but we “want to” so we just keep messing everything up to prove a point? That’s clearly not how it is, but when I speak like it is the truth “something is wrong with “me” and not the conditioning that lead to where I’m at?",
        "created_utc": 1671342662,
        "upvote_ratio": 1.0
    },
    {
        "title": "The self in Buddhism",
        "author": "moderatelyprosperous",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zor38e/the_self_in_buddhism/",
        "text": "Apologies if this is not the right forum for this question, but could anyone explain how in Buddhism there is a belief of no-self, yet also a belief in reincarnation? What is being reincarnated if there is no self?",
        "created_utc": 1671341635,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Heraclitus mean when he states \"He who hears not me but the logos will say: all is one\"?",
        "author": "Karn_Evil_9_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoqyvk/what_does_heraclitus_mean_when_he_states_he_who/",
        "text": "I believe my understanding of it is wrong. I interpreted the quote \"He who hears not me but the logos will say: all is one\" as referring to everything being in a constant state of flux and change. I also interpreted it as referring to a unity of opposites.  \n\nWhat does it actually mean?",
        "created_utc": 1671341224,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is rudeness? Is it subjective?",
        "author": "2000wfridge",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoqs3g/what_is_rudeness_is_it_subjective/",
        "text": "I recently had a discussion with a friend who believes that rudeness is entirely subjective. We were both able to define it as the breaking of social etiquette in a manner inconsiderate of others. He  believes it is subjective as it is always context dependant, and that the very nature of social etiquette is subjective, varying between cultures etc.\n\nI was puzzled by this, as there are many behaviours within certain social contexts that would be universally deemed \"rude\". \n\nThis led to a discussion on how one would deal with people we deem as \"rude\", and what level of response is appropriate, both with our emotions and actions. I initially believed that I was compelled to act, telling the person I thought their behaviour is rude, and was justified in feeling a certain amount of offence at rude actions directed towards me or taking place in my presence. My friend, however, said that we should accept these rude behaviours/actions/words from others as the concept is entirely based upon individual opinion and experiences of those experiencing it and acting it out, and that the perpetrator may not consider the action rude.\n\nI suppose a follow up question would be, can rudeness be objective within a particular context? Would be able to look at a particular cultures social etiquettes, and determine which actions are in extreme violation of those, and identify them? \n\nSorry if this is poorly articulated",
        "created_utc": 1671340588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on Emil Cioran?",
        "author": "yuji99",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoql54/thoughts_on_emil_cioran/",
        "text": "",
        "created_utc": 1671339934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the concept of free will a mere illusion?\"",
        "author": "Low-Stand5799",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zopz4k/is_the_concept_of_free_will_a_mere_illusion/",
        "text": " The concept of free will has long been a topic of philosophical contemplation. Some espouse the belief that we have complete autonomy over our actions and decisions, while others posit that our choices are predetermined by a confluence of genetics, environment, and other extrinsic factors.\n\nHowever, what if the doctrine of free will itself is an illusion, a fallacious belief without basis in reality? What if our brains are simply following a predetermined set of neural pathways, and we delude ourselves into thinking that we are making choices when in fact we are merely reacting to stimuli in a predetermined manner?\n\nThis notion has been explored by philosophers and scientists alike, including the famous determinism of Baruch Spinoza, who argued that everything that occurs is the necessary outcome of prior causes and that human beings have no control over their actions.\n\nIf the doctrine of free will is indeed an illusion, it raises a number of philosophical conundrums. For one, it calls into question the concept of moral responsibility. If our actions are predetermined, how can we be held accountable for them? Similarly, it challenges the notion of personal agency and the belief that we have the ability to shape our own lives and destinies.\n\nOn the other hand, some argue that the concept of free will is essential to our sense of self and our ability to function as rational beings. Without the belief that we have control over our actions, it could be argued that we would be reduced to mere puppets, unable to make meaningful choices or decisions.\n\nThere are also those who posit that the concept of free will is ultimately incompatible with a deterministic universe. If everything is predetermined, then it would seem that there is no room for free will. However, others argue that determinism and free will can coexist, and that our perception of free will is simply an emergent property of complex systems.\n\nWhat do you believe? Is the doctrine of free will an illusion, or is it a fundamental aspect of being human?",
        "created_utc": 1671337927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will to Belief",
        "author": "GoldSpinach5",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zop80z/will_to_belief/",
        "text": "I have been fascinated with the idea of belief lately. It seems to me that a belief is what guides all of our actions. It seems that changing our beliefs will change our actions. But what are the best ways to go about changing beliefs? Through action? Just thinking? Not sure. What beliefs are necessary for existence? Can belief be replicated by artificial intelligence?   \n\n\nAnyways, I think that humans fundamentally have the will to believe things. I was recently thinking of the possibility of a human operating with no beliefs, but this is impossible because we have to have subconscious beliefs that there is a floor underneath us, air to breathe, and other things we believe are necessary for us to operate in the world; otherwise we would be labeled as psychologically ill.   \n\n\nI have a lot more questions about belief and wonder if anyone here shares the same interest and recommends philosophers in this particular domain that attempt to answer some of these inquiries about belief. Thanks.",
        "created_utc": 1671335504,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some historical trends/events that historical materialism cannot explain or do not make sense from a marxist lense?",
        "author": "HealthMotor8651",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zong4g/what_are_some_historical_trendsevents_that/",
        "text": "",
        "created_utc": 1671329976,
        "upvote_ratio": 1.0
    },
    {
        "title": "beginner looking for recommendations",
        "author": "porcelainskull",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zomqru/beginner_looking_for_recommendations/",
        "text": "at a point in my life rn where i’m confused and i’m thinking of maybe looking into philosophy to help a bit. maybe material regarding stuff like these:\n\n-nihilism (more on the positive side so i don’t go crazy) and stoicism because those are two ideas i’ve heard a lot and that sound interesting\n\n-something about self improvement and giving everything up to grow or how to grow?\n\n-something related to disappointing everyone\n\n-change, specifically within yourself \n\n-caring less about peoples perspective on you\n\ni know it’s a lot sorry",
        "created_utc": 1671327888,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any widely accepted way in the field of Philosophy of Gender to understand the term \"woman\" such that it includes all trans women?",
        "author": "QsAccnt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zomavb/is_there_any_widely_accepted_way_in_the_field_of/",
        "text": "Or is this still an open question?",
        "created_utc": 1671326560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can God be substituted with Meaning in Pascal's wager?",
        "author": "samwaytla",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zolzr6/can_god_be_substituted_with_meaning_in_pascals/",
        "text": "",
        "created_utc": 1671325664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does there exist a view in philosophy or a view of a philosopher that supports the following claims ?",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zolq2p/does_there_exist_a_view_in_philosophy_or_a_view/",
        "text": "**I.** Everything of nature - including the whole universe - is physical, made of matter.  \n**II.** Humans are apart of nature and thus physical, made of matter.  \n**III.** Human brain and consciousness is physical.  \n**IV.** Matter has qualities; there are colors in the 'things' and are only accessible through the combination of light, human (those animals who can see colors) eyes and brain; matter has textures that are accessible with human skin (animals understand textures as well), nerve system and brain; sounds with ears etc. Forms of matter understands other forms of matter.  \n**V.** Humans experience both qualities and quantities (you kick a rock, you experience the strongness and texture of the rock and pain and at the same time you experience the specific quantity of molecules the rock has).  \n**VI.** The world and universe is external to humans and humans' brains/minds and from it they take information that is stored internal as well.  \n**VII.** Consciousness, qualia and generally the workings of the brain can be understandable with quantifiable descriptions - descriptions that are accurate and correspond with empirical data.\n\n*Is there a view that encapsulates all these claims together ?* I am aware that some fit together under physicalism and naturalism; however I would like to know if any of the specific claims I wrote go together with them as well in some form they (physicalism/naturalism) have perhaps.",
        "created_utc": 1671325011,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some books that deal with posthumanism, transhumanism, and the overall enhancement of the human?Also books on technological impact on the human in a philosophical way?",
        "author": "Alternative_Sail_906",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zolgwo/what_are_some_books_that_deal_with_posthumanism/",
        "text": "Title",
        "created_utc": 1671324392,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Hawaiian philosophy? Is there a conversation between Hawaiian/Pacific Island philosophy and Western or Eastern philosophy?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zolags/what_is_hawaiian_philosophy_is_there_a/",
        "text": "I was looking at UH Hilo's philosophy curriculum and remember it being focused on authors from Asia, mostly. A lot of Buddhist philosophy classes, although I didn't look very closely at every class taught.\n\nThen I got to thinking, Hawaii is a place with deep cultural and ecological roots for natives as well as a rich cultural history that includes people from many corners of the globe.\n\nI once found in a library on the Big Island a work attempting to compare the Kingdom of Hawaii to Marxism, in so many words. But I'm wondering now, what about scholastics or academia? Where does Hawaii fit into the world, philosophically speaking?\n\nThank you!",
        "created_utc": 1671323918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it more ethical for white women or women in general to date men of color rather than white men? Or is there no ethical difference?",
        "author": "Specialist_Berry_683",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zol2ag/is_it_more_ethical_for_white_women_or_women_in/",
        "text": " \n\nI was out on a double date with my girlfriend, who is white, and her friend's boyfriend poked fun at my girlfriend for dating a white guy like me. My girlfriend is very liberal, and I am liberal myself, but I felt a little sad at the suggestion that dating me was wrong. She is still dating me, but sometimes I wonder about the ethics of dating with respect to race.\n\nIs it okay to put down dating white men considering the privilege they hold?\n\nPersonally, I do not want anyone to feel like they should not be dated because of their race, no matter the race. However, I have been reading that it is different for white people, based on punching up versus punching down. In this case, I was wondering if punching up as in saying it is bad to date a man that is white is okay. Now, I also think it is wrong to want to date a white man because he is white, just like it would be wrong to date anyone because of their race. I just want to know what you all think about choosing not to be with a man that is white solely because it is promoting white privilege.\n\nThank you for your time. I am open to whatever you have to say.",
        "created_utc": 1671323393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is conciousness a mistake",
        "author": "Delicious-World-977",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoi907/is_conciousness_a_mistake/",
        "text": "I've have. In reading on Ligotti and zapffe for a while now. And there ideas of conciusnes are interesting. \nI wanted to know if there are more philosophers ho bring up the idea of conciusnes that disagree whit there statement that conciusnes is a mistake.",
        "created_utc": 1671316309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is open individualism just a form of solipsism?",
        "author": "Trekapalooza",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zogad9/is_open_individualism_just_a_form_of_solipsism/",
        "text": "If open individualism is true, then I am the only subject that exist. However, since I am not experiencing being anyone else right now other than what this body can experience, wouldn't that mean that all other people or bodies are just zombies, or empty shells for me to occupy at different times? That seems like a form of solipsism. How can I be everyone if I can only experience being one person, or one body, at a time?",
        "created_utc": 1671311314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Actual philosophical examples of arguments and fallacies?",
        "author": "BrbSoaking",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zofwqw/actual_philosophical_examples_of_arguments_and/",
        "text": "I'm working on logic learning materials aimed at novice philosophy students. The goal is a working understanding of TFL and FOL as it pertains to philosophical arguments.\n\nFor this, I am trying to keep away from absurd or trivial examples because these examples ultimately do not provide any link between formal logic and philosophical arguments, and muddy its importance and application.\n\n**If you know any philosophical texts in which arguments are stated with a reasonably low amount of premises and a workable logical structure, or also (likely historical) texts that contain fallacies, I would be very grateful if you mentioned them below.**\n\nExamples of arguments I am already aware of (I don't mind redundancies, though) would be Descartes' dream argument or ontological proofs of god.",
        "created_utc": 1671310327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heidegger and Sartre on Cartesianism",
        "author": "paige564",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zofn3v/heidegger_and_sartre_on_cartesianism/",
        "text": "please help my final exam is on Monday and my brain is so fried trying to understand this\n\nThe question is \"In what way(s) is Heidegger critical of the Cartesian idea that associates the subject with the \"I\" of consciousness. How does this criticism separate Heidegger from Sartre?\"\n\nI missed this entire unit of lectures and I'm paying the price for it now",
        "created_utc": 1671309629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pythagoras and Christianity",
        "author": "isuchm",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zofmke/pythagoras_and_christianity/",
        "text": "Can anybody comment on the relationship between this two? Regards and thanks in advance.",
        "created_utc": 1671309596,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the best explanation argument sound like in favor of other conditions without using one's own case?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zofeeb/what_does_the_best_explanation_argument_sound/",
        "text": "https://plato.stanford.edu/entries/other-minds/#BestExpl\n\nThe argument of the best explanation in favor of the existence of other minds with reference to one's own case sounds like this:\n\nOther people behave in ways like me.\n\nI have mental states which explain why I behave the way I do.\n\nOf the possible explanations for why others behave like I do, the best explanation is that they have mental states.\n\nFor example, when I watch a sad movie, I feel sad emotions and cry. \n\nOther people who are also watching a sad movie are also crying. \n\nThe best explanation for other people's behavior is that they also feel sad emotions and are sad too.\n\nThe argument of the best explanation in favor of the existence of other minds that uses its own case is a hybrid argument that uses elements of argument and analogy as a complement to the argument of the best explanation. \n\nCorrect me if I'm wrong.\n\n1) What does the argument for the best explanation sound like in favor of the existence of other minds without using your own case? \n\n2) How then to explain for example why other people laugh or cry, if we do not use our own case?",
        "created_utc": 1671309005,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important are translations",
        "author": "GamamJ44",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoear2/how_important_are_translations/",
        "text": "Hi,\n\nI am getting into reading philosophy from the peimary source, and was wondering how much it matters which translation I use. I generally like to get the best ones according to the internet, but I have some really cheap copies of lots of Philosophy texts by a publisher called «Woodsworth» who seem to have translators I can’t find anything about online.\n\nFor example I’m wanting to read Spinoza’s ethics, and the translators for their copy are William White and Amelia Stirling. However, it seems Edwin Curley is the go-to guy. Should I try to find a copy translated by Curley or just go for the Woodsworth one?",
        "created_utc": 1671306159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is consciousness emergent?",
        "author": "TheInfiniteVoid01100",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zocmjw/is_consciousness_emergent/",
        "text": "Intuitively, it seems like consciousness should be emergent because what we define as “consciousness” only arises in complex neural systems but not in individual neurons. However I discovered some discourse on this subject where people said that consciousness is overwhelmingly considered *not* to be emergent. I couldn’t really understand much of the dense theory and research, so could someone explain whether or not consciousness is emergent, and why or why not?",
        "created_utc": 1671301720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations: Essays written by prominent philosophers",
        "author": "rooknerd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoc9np/recommendations_essays_written_by_prominent/",
        "text": "My background is from medicine, so I'm familiar with Freud and basic psychology. Over last few years I've come across theories of many philosophers that are relevant in psychiatry and medicine eg- Kant's noumena and phenomena, Jasper's psychopathology, Butler's gender performativity, Schopenhauer's influence on Freud, Kuhn's theory of scientific paradigm, Baconian method, etc.\n\nI have been watching YouTube videos by philosophy professors and reading 'Very Short Introduction' series until now, but I want to actually primary texts written by the prominent philosophers in Western tradition. Books would be time consuming, so I thought starting with essays could be good entry point. When I'll have more free time in future I would certainly like to read books instead of essays.\n\nTopics of interest include (but not limited to) Logic,  philosophy of science/medicine, mind-body problem, epistemology, rationalism-empericism, phenomenology, pessimism.\n\nI would be really grateful if any of you can give me some recommendations.",
        "created_utc": 1671300744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mathematical Questions about Consequentialism",
        "author": "ConjectureProof",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zoc4bj/mathematical_questions_about_consequentialism/",
        "text": "Under Consequentialism, whether or not you should perform some action (morally speaking) is determined based on a utility function. My questions all concern how the inputs and outputs of this utility function are treated. If the answer to any of these questions turns out to be the nobody really knows, I'd be interested in if there are philosophers who've run into these questions before and had opinions on them\n\nQuestions:\n\n1. Do Consequentialists have any preference between outcomes of equal utility or would serving either end be equally good?\n2. If the determination of the outcome is fundamentally probabilistic, what is that actions utility?\n3. What if the consequences of performing an action are time dependent? In other words, when we say \"consequences\", where are we stopping the clock to say that the consequences end here and why are we stopping it there? If the answer is that the clock never stops then how do we handle divergences? There are some straight forward hypotheticals where the time-dependent utility function is pretty clearly a wave like sin(t). What is the utility then if it is allowed to diverge with time?\n4. What if the consequences of an action are unknowable prior? To give an example, when the scientists on the Manhattan Project tested the first atomic bomb, the estimates for how powerful the blast of it will be varied wildly among scientists. In order to set aside the morality of the atomic bombs ultimate use, consider a science experiment where the outcome is fundamentally unknown. Nobody has any clue what it will do. It could create a massive energy supply that brings boundless utility to the world; it also could destroy the world. Nobody is sure and in fact nobody can even place a probability on it. What's the utility in doing the experiment?\n\nThe last 2 questions seem particularly troubling to me because it seems like they encompass a lot more moral questions then we might initially think. Perfect information about all the possible outcomes of our actions is something we are rarely afforded in this world and actions where what we call the consequences depend on where we stop the clock are also plentiful. It seems like almost any answer to the last two questions seem to run into problems.",
        "created_utc": 1671300335,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think that the winner in a single game is always the better player in that specific game",
        "author": "youngneggus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo93s3/i_think_that_the_winner_in_a_single_game_is/",
        "text": "That does not make him the best, but still in that game if he won he was the better player.\nEven if you repeated the game 10 times and he wins 1 he was still “better” in that single game but not overall defined the best by the overall amount of wins.\n\nI’ve heard many people say during the current world cup that the team that played better didn’t win, but I don’t get this. Bow can you not win if you do not objectively play better that would entail, believing that soccer is a game of luck/randomness, that if replicated infinitely the majority of games would then be won by the objectively better team. The example with infinity shows in my opinion that it’s just a facore of scale. Instead of looking at infinity you see the 90 minutes as a finite time, essentialy making time the factor of “randomness”. As a hipotetical game with infinite stamina would determine the objectively better team every single time.\n\nPeople think my view and definition are odd. Winning as the definer of better in soccer. In that single game or if all their wins are against teams that are always considered “better” performing against them making them the best overall.\n\nI accept the logic of seeing the winning team as the one that played more beautifully but not better in the objective sense. If asked what is better in their definition they fail to define it, and if they say a combination of any factors defining the game of football that statisticly cannot be “worse” in the winning team.\n\nIs my logic flawed here or is this a logically valid definition?",
        "created_utc": 1671292203,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point does “interpretation” or different “readings” of philosophers just become erroneous?",
        "author": "EmoAverage",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo8uaj/at_what_point_does_interpretation_or_different/",
        "text": "There seems to be an inclination in philosophy where people have different “readings” of philosophers. I’ve seen it for Wittgenstein, Hegel, and Nietzsche. It seems like the latter has fallen in recent times, where people generally accept the Kaufmann’s “Existentialist” reading for Nietzsche. But how can we deduce which “reading” is actually correct? Does a “reading” tell us more about the author, let’s say Kojeve, rather than actually Hegel? When does a “reading” just become falsehood?",
        "created_utc": 1671291462,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean to be a human being?",
        "author": "agidandelion",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo8lsm/what_does_it_mean_to_be_a_human_being/",
        "text": "More info about the question: When do we start being human? How are we different than animals? Is it our ability to think, to feel compassion or maybe just that we can build society to this extent? Is it more of a physiological things? Do we need to have 2 arms and 2 legs, brain that weights a certain number? \n\nHi, I'm a total outsider and your community is fascinating! I hope I don't break any unwritten rules :\") I study social sciences so I know a bit about social philosophy (and i also know that i can easily throw away every thesis i put in my question). \n\nI'm writing a book that tries to answer this rather philosophical question (i know that there are no definitive answers). So I'm wondering, what does philosophy say about this? Could you recommend me any books about this? Or maybe there are philosophers who specialize in this? I'm willing to look at every take on this topic. \n\nAnd it is not a science book, it's purely entertainment. I'm writing about someone who is kind of pretending to be human, but doesn't really understand what that means, so they're never FULLY human. Until one day this SOMETHING happens and they start to understand. I'm looking for any ideas for this \"something\". For now I have this romenticized take: the ability to be happy, to feel hurt, to feel guilt and love. But there's not enough of a distinction from animals in that. \n\nSidenote: yes, i know that individuality doesn't exist (until someone loves you), that not everything communicates (or everything does), society exists (or not), everything is a discourse etc. I don't want to be seen as an idiot, but still... please talk to me like i'm one :D",
        "created_utc": 1671290791,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does spinoza mean by an infinite intellect or intellect of God? i don't think he believes that God is conscious and can perceive infinite attributes",
        "author": "probably_gonnaregret",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo8l69/what_does_spinoza_mean_by_an_infinite_intellect/",
        "text": "",
        "created_utc": 1671290738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ask what philosophy mods can suck my cock",
        "author": "SquareBusiness6951",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo7ldl/ask_what_philosophy_mods_can_suck_my_cock/",
        "text": "That’s my philosophy",
        "created_utc": 1671287859,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do different theories of value account for diamonds in the 21st Century?",
        "author": "sachaspymaster",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo7kvw/how_do_different_theories_of_value_account_for/",
        "text": "With modern technology, a batch of diamonds can be synthesized relatively cheaply, with relatively little labour (compared to mining for diamonds in the ground). They also have little utility outside of certain certain specific items such as drills or lasers. But people are still willing to pay a fortune nonetheless. \n\nHow would some of the most popular theories of value account for this? I thought of this while reading about the diamond-water paradox, a lot of arguments around which mention scarcity and labour involved with getting diamonds out of the ground, but diamonds are no longer very scarce or labour intensive.",
        "created_utc": 1671287817,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your pet could search the internet, what would their search history be?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1671284252,
        "upvote_ratio": 1.0
    },
    {
        "title": "History of philosophy",
        "author": "BlahBlahBlackSheep_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo63l1/history_of_philosophy/",
        "text": "Which history of philosophy do you guys most often turn to? I know Copleston is pretty popular, Russel is not really academic, but what about the other ones? Thoughts on Grayling? \nAnd the question which inspired this post, what are your thoughts on Wilhelm Windelband? I know it was written in the 19th century but I often find myself reaching for his book(s) because of the unique way he presents it. He doesn't just list philosophers and briefly go through their ideas but lists specific problems and how each philosopher through history contributed to the problem. I really like this because it helps me connect things better. But is he acclaimed academically, would it be okay to use him as a reference in an article for instance? I really can't find much about him online so I figured I'd ask here\n\nThanks for reading, and have a nice day",
        "created_utc": 1671283021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fake News",
        "author": "tookeewlfourskeewl",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo5ah6/fake_news/",
        "text": "Hello. I am looking for some guidance regarding fake news that is often or sometimes dished out by different media outlets. I have no clue how to jump into this topic but to also take it further as well. I hope someone can point out a few areas I can look at or some philosophers who have directly tackled this aspect of reporting the truth and its importance.",
        "created_utc": 1671280074,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is math?",
        "author": "RemarkableArticle422",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo3hdn/what_is_math/",
        "text": "[removed]",
        "created_utc": 1671272723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Hume want educators to be more considerate of emotions in the course of teaching, or does Hume think that educators need to spend more time teaching how emotions work?",
        "author": "TellEvery1191",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo34a6/does_hume_want_educators_to_be_more_considerate/",
        "text": "",
        "created_utc": 1671271235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are human rights really universal?",
        "author": "bobnotahacker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo2025/are_human_rights_really_universal/",
        "text": "Were there any major philosophers who disagreed? I can't think of any who would clearly disagree with any of the first nine UN declarations",
        "created_utc": 1671266491,
        "upvote_ratio": 1.0
    },
    {
        "title": "any philosopers who genuinely hate school ?",
        "author": "hai_fay",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo1at7/any_philosopers_who_genuinely_hate_school/",
        "text": "",
        "created_utc": 1671263562,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can we know there can be infinite, or, more than 2 attributes in spinoza's metaphysics if we only know two of them and cannot comprehend anything outside of it, ie thought and extension",
        "author": "probably_gonnaregret",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo0sda/how_can_we_know_there_can_be_infinite_or_more/",
        "text": "",
        "created_utc": 1671261479,
        "upvote_ratio": 1.0
    },
    {
        "title": "What impact did Charles Darwin do on theology?",
        "author": "your_friend_dingus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zo07a1/what_impact_did_charles_darwin_do_on_theology/",
        "text": "Is it true that theist people still ignore the fact of Darwinism or Natural Selection because it somehow contradict their rules...",
        "created_utc": 1671259204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any subreddits to post philosophical/creative writings",
        "author": "Yogurt-Evening",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znxq3v/any_subreddits_to_post_philosophicalcreative/",
        "text": "i’ve been wanting an outlet for my ramblings in my notes app and thought to ask here for advice, my writings usually consist of an idea which i expand into short paragraphs.\nHere’s an example:\n\n“Occasionally we are forced to make decisions for the sake of our own health, decisions which we do not want to make, decisions that can only be made when the heart cannot continue without them, that in their very being causes pain unlike the soul has ever had to endure, but without these decisions we would only continue to wither, slow enough to go unnoticed yet vast enough to erode the very essence of our being.”",
        "created_utc": 1671250166,
        "upvote_ratio": 1.0
    },
    {
        "title": "philosophy jokes needed! thanks x",
        "author": "HugeZookeepergame773",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znxkb6/philosophy_jokes_needed_thanks_x/",
        "text": "hello hope you're well! my brother has just finished his philosophy degree and also loves his first nephew a lot so for Christmas im making him a calendar with each months picture being a funny fake deep picture of his nephew Miguel in black in white with a silly fake philosophy quote (something like 'I think therefore... I want poop' or something hopefully a lot better then that) I've hit a bit of a dead end and was hoping actual philosophers like yourself might be able to help with funny philosophy fake quotes said by a baby, many thanks and happy seasons! x",
        "created_utc": 1671249617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clarification on Nietzsche's argument against Descartes's \"I think, therefore I am\"",
        "author": "jinwusan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znxisy/clarification_on_nietzsches_argument_against/",
        "text": "Nietzsche argues against the wording of Descartes's \"I think, therefore I am,\" focusing on the argument being circular and the first \"I\" being overly presumptive. Descartes's argument presupposes the existence of an \"I\", or that there is even something conducting the thinking.\n\nI also read that Descartes's argument is faulty for not proving that there is only a singular \"I.\" What does it mean and why does it require proving?\n\nI understand that the quote was meant to be understood intuitively and not in a syllogistic format that Nietzsche argued with. I'd still like to understand Nietzsche's point fully though.",
        "created_utc": 1671249495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Passively Listening to Philosophy Podcasts",
        "author": "Comprehensive-Leg441",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znwwa0/passively_listening_to_philosophy_podcasts/",
        "text": "Was recently listening to Philosophize This podcast and suddenly realized how much content I forget. The podcaster brings up St. Thomas Equinas or Voltaire and I can't remember their life philosophies. I usually listen to this Podcast when I'm driving but should I listen to it with a pen and paper in hand to truly engage with the philosophical questions posed?",
        "created_utc": 1671247309,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an idea, whats its name?",
        "author": "ThiesH",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znvpcg/i_have_an_idea_whats_its_name/",
        "text": "\"Im i a genius ... probably not.\"  \nSo i have this simple theory of a multiverse:  \n\n\nA single Universe is something constant, nothing outside of it has influence on it.   \nUniverses do only exists for themself.   \n(So our universe fits in this defintion, because everthing we \"see\" does influence us)  \nA Universe is constant, what i mean by that is that everthing that could describe it wont change.   \nThey are so to say predetermined, fixed. But that doesnt mean there can not be wha we would call random, there could be random events, my theory would allow quantum mechanics! (Even though i dont know exactly what that field includes.)   \nThere are also many other of those Universes, different from each other.     \nA Universe could be everything, something physical or something abstract.   \nThey could also be the exact same as ours but with a minor  detail that is different. A Universe could also have Suvuniverses, because why not.   \nBut by definition one universe can not be the same as another and they can not interact.  \nThey dont exist in a space, they are just there and not there at the same \"time\" (Well there is no time just a concept, we are living in a concept!).  \n(Because in nothing and everything is the same.)  \nThere is logic behind that theory, i questioned myself why everything is the way it is?  \nIt doesnt matter how our universe is, how it works, because it will be in some way. We can describe it, that is the problem!   \nWhy is it that way, there has to be a reason. I could only think of one answear that is it being nothing special, so there has to be many others!\n\nSo there has to be an infinite amount of other universes, that are in everyway way different than ours.  \nSome (well not some but infinite) are quite similar to ours, but maybe with differents masses for their particles, or they have different physical laws, or maybe its just a position of a atom thats differs, there is a universe where there is an ape writing this down (not to say im not one).   \nBut there are also those we cant quite grasp, so abstract and bizarre, the concept entirely different than everything we can image, or maybe its just a 42, idk.  \nThere could be subuniverses in a universe.  \nBy definition they couldnt be interferring, because then we would describe it as one.   \nBut for that to work they have to be constant, so that one is different than the other.   \n(Ok, now it fells like im making circles in my argumentation)   \nIf anything in them would change, they would be the same as another universe!  \nThat is because there is already that universe with that change.  \n\n\nNow there are two universes that are the same, why? I dont want questions, i want answears!  ! !  \nThat is why change cannot be allowed by definition (dont know if i used the term definition correctly here, anyway). \n\nSo they are predetermined, that also means everthing we understand as random or unpredictabel is also fixed. Something doesnt has a cause but it still coudnt be any different in its universe!   \n\n\n(Maybe a bit of topic:) Now some people say that determinism would allow our minds be free, i think thats weird to say or point out. Because in generall, if our minds woulndt be bound by causality they would be random instead. Or they would work deterministic spiced with a bit randomness.  \nBut neither alone sounds free, so a combination wouldnt make it any better!  Therefore with that logic our minds arent free, well but they are free enough to self-proclaim they are!  \n\n\nAs i came up with the idea five or so years ago i asked myself, why does anything exist at all?  \nThe answear or idea was, that nothing (not a single universe) and everthing is the same.  \nIf there would be nothing, there would also be nothing to stop something from just existing.   \nSo nothing and everthing are the same, some time ago i heard it was called: \"Dualism\" Is that right?   \nI only now came up with the term concept for it, i think it fits quite well (im proud of myself!).  \n\n\nSo those are the ideas or concept i have. Now im kinda wish that im a genius and nobody else came up with that specific concept, but im probably wrong! So please tell me what its called and if there are any errors i did.   \nAlso guys im new to this sub, so if there are any rules or like customs i overlooked, let me know.  \nWell yeah thats it i guess, if you have red up to this, thank you very much!",
        "created_utc": 1671243349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critique of the pure reason",
        "author": "Del_666",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znve66/critique_of_the_pure_reason/",
        "text": "[removed]",
        "created_utc": 1671242404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Differentiating fact, opinion, and position",
        "author": "Canadianacorn",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znu7qn/differentiating_fact_opinion_and_position/",
        "text": "Hello all,\n\nI'm working on a passion project for a leadership group that I am a member of, and I need some philosophical help. I am trying to help people distinguish between the concepts I've cited in the title: fact, opinion, and position.  I don't know that those are the correct words for what I am trying to describe, but I will offer my personal definitions below to further the question:\n\nFact - A truthful statement of observation of a phenomena or object.\nOpinion - A casual interpretation of facts with limited formal analysis or research\nPosition - A formal interpretation of facts with analysis and research\n\nBasically, I am trying to help people (in the context of leadership decisions) distinguish between their hasty beliefs on any given topic, and the result of detailed research and analysis.  It has always seemed to me that people race to the belief that they have an position, when all they have is a casual opinion.\n\nI concede that it will be very difficult in the particular to distinguish if a statement warrants being a position vs an opinion.  There is likely a continuum that exists from VERY casual thoughts to VERY concrete positions.  I don't intend to deal in that level of precision nor that level of specificity.  Rather, I am trying to help people understand a framework for self-reflection on whether what they believe can be thought of as a position, or just an opinion.  With that framework, I'm hopeful I can help our leaders be better at not anchoring on weak opinions, and to recognize strong positions that offer more robust insight.\n\nCan anyone point me to any good language or definitions around these concepts?  I've been able to find ample literature distinguishing fact from opinion, but distinguishing opinion from position seems to be harder to find (perhaps because opinion and position are the wrong words to address this from the philosophical domain.  \n\nVery happy to elaborate or discuss if helpful.  Thanks in advance!",
        "created_utc": 1671238759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a book on social epistemology/sociology of knowledge",
        "author": "Fun-Carpet2526",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zntwja/looking_for_a_book_on_social/",
        "text": "I'm looking for a book on social epistemology or sociology of knowledge. What are possible books to start with?",
        "created_utc": 1671237807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mmmm",
        "author": "isuchm",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zntc68/mmmm/",
        "text": "I´ve been reading about Pythagoras, and many of his ideas are inside Christianity. Does anybody have comments on this?",
        "created_utc": 1671236129,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the main differences between Heidegger and Merleau-Ponty phenomenology?",
        "author": "viiivmmiii",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znsr40/what_are_the_main_differences_between_heidegger/",
        "text": "",
        "created_utc": 1671234475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abortion and philosophy",
        "author": "RoughUpstairs8942",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znsfrz/abortion_and_philosophy/",
        "text": "\nWho would have a stronger argument about \"how we can know heather or not a fetus is a moral subject\"\nPlato's- (Rationalist) who would claim thag any knowledge we may have in this situation involved mentally grasping the pure idea of \"fetus\" and\n\"mortality\"\nOr\nHumes- (empiricist) - who would claim that knowledge we may have in this situation involved observing scientifically what fetuses tend to be like and what morality tends to look like in practice",
        "created_utc": 1671233597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does moments matter?",
        "author": "Lumpy-Bed-9685",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znrm9y/does_moments_matter/",
        "text": "Do you think that the moment is important? In the sense, if now I want to satisfy myself with the need to buy cigars and spend some money, knowing that, for example, it will be more difficult for me tomorrow and that I will sacrifice something by not working or buying tomorrow or but to stay at home and save money and be fucked.\n Or to fulfill the desire I want, and tomorrow to manage as I always do... because I think if I sacrifice moments all the time, I will be an unhappy person?\nI think that what makes a person unhappy is unfulfilled moments..\n\nWhat do u think?If u understood anything I said lol but I couldn't explain it other way..",
        "created_utc": 1671231389,
        "upvote_ratio": 1.0
    },
    {
        "title": "works on contemporary art",
        "author": "herdaistaken",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znrg7x/works_on_contemporary_art/",
        "text": "Hi! I want to find philosophers that write about contemporary art. Can you give me some recommendations? I'm not new to philosophy/art, feel free to recomend sth complicated:)",
        "created_utc": 1671230926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dumb question: does anyone know this quote?",
        "author": "MiniBob7",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znqr3u/dumb_question_does_anyone_know_this_quote/",
        "text": "this is going to be really unhelpful but there is a quote I'm thinking of that I need for an essay. I think it was written by a marxist or anarchist. It's along the lines of \"they (capitalists) are not responsible for this system, but I have a suspicion they would not have designed it differently.\" I searched Google and couldn't find it but would greatly appreciate any help on ideas of who it might be",
        "created_utc": 1671229092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is saying that gender is performative compatible with defining such and such gender as \"a person who identifies as such and such gender\"?",
        "author": "SweetPeaZombie",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znqmxh/is_saying_that_gender_is_performative_compatible/",
        "text": "Hi, 32y trans woman here, just read a short paper talking about Butler's theory of gender performativity provided by an individual on one of the trans related Subreddits. Admittedly, the paper was a bit difficult, but I felt like I was grasping some things from it.\n\nAt any rate, I'm curious about the question in the title. If someone identifies as x gender but neither presents themselves as or behaves in a way which is characteristic of x gender, are they not still x gender in virtue of their self identification?\n\nIs Butler's conceptual connection of gender to Austin's linguistic theory of performativity supposed to illustrate that by inwardly self identifying as such and such gender, one is thereby, through that first personal identification as x gender, that gender? \n\nWhat other ways of conceiving of gender, which also take seriously the reality of trans lives, are there which stand in contrast to Butler's view?",
        "created_utc": 1671228780,
        "upvote_ratio": 1.0
    },
    {
        "title": "are we constantly revenging from each other?",
        "author": "ChargeDistinct5075",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znpmg2/are_we_constantly_revenging_from_each_other/",
        "text": "I don't know if it's the best place to ask but I hope people can give me a thorough answar to my question. I see a lot of people treat each other badly becuase of what happened in their childhood. and they learned to be bad as defensive machanism becuase they treated badly (like in case of rape victims or narcissism). how much is it true? are we bad intrinsically or we learn to be bad? or both?",
        "created_utc": 1671226133,
        "upvote_ratio": 1.0
    },
    {
        "title": "are we constantly revenging from each other",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1671225549,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean for a person to \"understand\" a statement?",
        "author": "pacemaker0",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znpawu/what_does_it_mean_for_a_person_to_understand_a/",
        "text": "If I say to you: \"The boy swam across the river\", and you tell me that you understood the statement. What does that mean in terms of the internal representation of the statement in your mind? Just curious to see what others think. Thanks",
        "created_utc": 1671225284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could ethics exist and be developed in a vacuum?",
        "author": "beinghumansucksass",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znp7t4/could_ethics_exist_and_be_developed_in_a_vacuum/",
        "text": "I got into a debate with my girlfriend about: if there was only one human who never experienced human contact or any form of civilisation would he eventually develop ethical framework for his decision making or at least a “sense for good and bad”?",
        "created_utc": 1671225047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good introductions to political philosophy?",
        "author": "WildPhilosopher4105",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znnknl/good_introductions_to_political_philosophy/",
        "text": "I’m(16f) really interested in politics and starting to get politically active. I would love to start reading some introductions on political philosophy and theory but I have absolutely no idea on where to start.\n\nI’ve so far tried reading Friedman’s “Free to Choose” and Nozick’s “Anarchy, state and utopia” but I found them to be a little bit too hard and complicated and I wasn't able to finish them.\n\nI’m a liberal and so I would prefer books with a liberal perspective but I’m also open to reading on other ideologies/perspectives.",
        "created_utc": 1671220839,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ancient Greek philosophers believed that geometry (or what was Mathematics to them) could be used to describe reality. Why did they believe so?",
        "author": "Conquest_of_Mind",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znnhc3/the_ancient_greek_philosophers_believed_that/",
        "text": "I may be wrong in this, but it seems to me that the kind of mathematical mysticism espoused by Thales and Pythagoras (\"everything is number\") had a strong influence on later Greek philosophers. Socrates, Plato (\"let no one ignorant of geometry enter\"), and Aristotle, all seemed to have given a high importance to geometry, not only due to its putative role in cultivating one's mind, but also due to its utility in the pursuit of truth. \n\nI am wondering why they thought that reality could be described mathematically. What were their reasons? \n\nI am asking this because this idea seemed to have escaped other cultures. The Indians for instance dallied in Mathematics, but it was given a much more utilitarian role. The pride of place went to other subjects.",
        "created_utc": 1671220612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memory of a certain painting constantly altering in my mind - what could this be?",
        "author": "notasoultotell_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znmn1r/memory_of_a_certain_painting_constantly_altering/",
        "text": "There is this certain painting in my therapist's office that seriously surprises me every time I look at it. The picture I have of it in my mind is always \\*very\\* different from the painting I see on the wall. This never happened to me before and is so odd to me. The painting depicts a man sitting on a chair in a room - I never forget this is the basic setting, and the colors are mainly yellow and blue - but the last time I looked at it I was surprised to find it looked completely different than what I remembered. The man's body took a much larger portion of the painting, there were several libraries behind him, but the main thing is that the whole \"vibe\" and atmosphere of the painting was absolutely different. Like a totally different painting. And it happened over several times already, so one can't say there is a first \"glimpsed\" memory, and that I got it right the next time. I LOOKED at the painting every time I saw it. And it was like a different painting every time. So what could explain this?",
        "created_utc": 1671218354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is philosophy so phallocentrist to this day? And which philosophers argue against this?",
        "author": "whatshouldidohoney",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znmism/why_is_philosophy_so_phallocentrist_to_this_day/",
        "text": "I am a first year (female) philosophy student and although I am loving it until now, a big cause for concern is the privilege that it is given to the male students by professors, at first I understood it because I tried to reasonate it with the fact that they're more read than most, but seeing them fail at seeing intellect capabilities in women is truly annoying and it is making me lose respect for those professors which otherwise are great. So rather than holding a grudge and coming off as more of a moron than they already see me as (lol),  I want to get well informed about this phenomena, so please share anything you think that might help.\n\nThanks in advance :)",
        "created_utc": 1671218036,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think the universe has no meaning, so we should do whatever we want, since nothing matters anyway",
        "author": "PepperPants_theOG_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znmiro/i_think_the_universe_has_no_meaning_so_we_should/",
        "text": "ive read about it, and absurdism seems the closeest, but it dosent feel right",
        "created_utc": 1671218034,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between existentialism &amp; nihilism?",
        "author": "Nico1011021",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znmdh9/whats_the_difference_between_existentialism/",
        "text": "Both come from the idea that nothing in life matters if I'm correct. So what's the difference?",
        "created_utc": 1671217644,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the pros and cons of utilitarianism vs deontology?",
        "author": "Visual-Froyo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znm8ot/what_are_the_pros_and_cons_of_utilitarianism_vs/",
        "text": "",
        "created_utc": 1671217301,
        "upvote_ratio": 1.0
    },
    {
        "title": "The philosophy of hypocrisy: Can art and artist be separated?",
        "author": "socaas",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znll8j/the_philosophy_of_hypocrisy_can_art_and_artist_be/",
        "text": "I'll get to hypocrisy in a sec but first some background:\n\nBuddy and I were having a conversation about the implications of using AI in art; a hot button topic lately.\n\nHe asserted that something of his appreciation for a piece of art would be lost if he knew it came from a \"soulless\" machine rather than a human being; that knowing something about the back story of the artist enhances the experience — ie. perhaps some unfathomable emotional pain the artist was going through when they produced some particularly dark piece — while lack thereof diminishes it\n\nI asserted the opposite; that it doesn't matter to me whether the artist is human, machine, or anything else. The artist themself is irrelevant to me because otherwise you end up with imo a nonsensical situation where you may greatly enjoy a piece of art but then cease to enjoy it as much simply because the artist isn't who or what you thought they were?\n\nThis to me is exactly what Shakespeare meant by \"A rose by any other name would smell as sweet\". Changing the name \"rose\" to something else doesn't change its scent. It's still the exact same rose with the exact same physical properties no matter what the name is. I argue likewise, your perception of who or what developed a piece of art you appreciated five minutes ago changing should not impact your appreciation because it's still the same exact piece of art with the same brilliant technique, brushstrokes, or whatever else awe-inspiring content.\n\nThen he hit me with no, art and artist are inextricably associated, contextually because surely you wouldn't buy a painting made by hitler to hang around your house, no matter how gorgeous it may be. Him: \"Assuming you saw it in a gallery and fell in love with it not knowing initially it was a hitler painting, and then suddenly found out, what would be the reason to change your mind?\"\n\nMy rebuttal was, apart from social conditioning, there is no difference between buying a hitler painting and buying a [Volkswagen](https://www.thecollector.com/volkswagen-beetle-nazi-germany/) car or [Hugo Boss](https://www.bbc.com/news/world-europe-15008682) clothes, and that assuming the money was not going to support nazi organizations (let's assume it was going to a good charity), that it should not be a problem.\n\nBut it's true. Hypothetically, buying a hitler painting does feel \"ickier\" than buying a volkswagen **and my question would be why that is? It it indeed merely social conditioning or is there a firmer philosophical principle that makes it worse?**\n\nI can find no reasonable differences between the objects:\n\n* They're both objects you gain some utility out of, such as pleasure.\n* They're both arguably \"works of art\"\n   * I'd like to preempt anyone who wants to make the argument that one is \"just a car\" while the other is \"art\". A lot of artistic creativity goes into designing a car or really many consumer items. Happy to debate anyone who wants to take this line.\n\nLikewise, I run into the conundrum, what if my favorite comedian, who I always thought was hilarious, brutally murdered someone I love. If I then got their new standup special for free, even if it was well after my grieving period, of course I doubt I would be able to \"separate art from artist\" and enjoy the comedy as I normally would.\n\nWhat comes out of this is that our perception of art is inextricably tied to the artist? What happens if you come across a painting that you fall in love with but then come to find that there's a 50% chance it was created by hitler? Does it become some sort of schrodinger's painting where you're not sure if it's worth enjoying until you find out for sure? If there's something distasteful about utilizing a product/service created by a distasteful designer, what happens if hitler had invented the cure for cancer? Would you not use it?",
        "created_utc": 1671215576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuff to do after Intro to Formal Logic",
        "author": "Animore",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znldhr/stuff_to_do_after_intro_to_formal_logic/",
        "text": "Hey folks. So I just got done with an intro to formal logic class last semester. I really liked it and wanted to learn more. The problem is, my uni doesn't offer any further courses on logic (without some kind of specific request and polling to see if students would be interested). So I'm wondering where to go next. Here's the stuff we covered (Textbook is forallx by P.D. Magnus):\n\n- Basic logical concepts (validity, consistency, contingent vs tautology vs contradiction, logical equivalence, etc.)\n\n\n- Propositional logic (I'm assuming all the stuff you might expect; symbolization keys, translating arguments, connectives and their characteristic truth tables, a little bit of syntax - stuff like what a well-formed formula is)\n\n\n- Truth tables (constructing truth tables, determining stuff about an argument from truth tables - consistency, validity, stuff like that)\n\n\n- Predicate/Quantified Logic (predicates and constants, quantifiers, translating sentences to ql, stuff like counting with quantifiers, and a bit on syntax stuff like bound variables)\n\n- Natural deduction (we mostly focused on propositional proofs here. Prof mentioned proofs in QL and issued some extra credit stuff for it, but I mostly just read through the textbook on my own ql proof stuff)\n\n\n- Formal semantics (really we mostly just skipped past this part, but I read through the chapter on my own and talked about it with prof during office hours. A bit shaky on it but I think I get the gist; stuff like truth value assignments, truth functions, ways to define truth in prop. logic and pred. logic, models, extensions of predicates and referents of constants, etc.)\n\n\n- A very tiny bit about proof-theoretic stuff that I had read from the textbook; not really talked about in class, but stuff like completeness and soundness, and a little tiny bit on how to prove stuff with models\n\n\nSo I guess my question is what's my next move? What stuff should I tackle? Stuff like modal logic seems really interesting but I don't know if I have the proper background for it. I watched a few online videos about trivalent logical systems and that seemed really interesting too. Would these be the right steps? Also, if it's at all possible, could I get some resources for these next steps as well?\n\nThanks very much, and sorry for the very long-winded question!",
        "created_utc": 1671215011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are These Schools Of Ethic Subjective Or Objective?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znkmh5/are_these_schools_of_ethic_subjective_or_objective/",
        "text": "as we know divine command theory and ethical naturalism is objective while ethical nihilism and ethical relativism is subjective \n\nwhat does: Kantian,Rawl’s Theory,Virtue And Utilitarian Ethics fall under?\n\nsubjectivism or objectivism?",
        "created_utc": 1671213098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy grad programs in Germany taught in English?",
        "author": "rockrotandrule",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znkb4h/philosophy_grad_programs_in_germany_taught_in/",
        "text": "I have been looking for some time and not found any MA or PhD programs in Germany in English that focus on the non-analytic/scientific/logic/math wings of philosophy. This is surprising considering how many other subjects are offered in English. Does anybody know of a good general philosophy program in Germany that is taught in English, and allow you to study German at the same time? Thanks!",
        "created_utc": 1671212265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Kant’s ‘God’ an Abrahamic God, or something else?",
        "author": "Defiant_Cheek_4720",
        "url": "https://www.reddit.com/r/askphilosophy/comments/znjnre/is_kants_god_an_abrahamic_god_or_something_else/",
        "text": "Hi philosophers, I’ve been reading James Rachels’ writing about morality, namely he says the whole concept of an abrahamic god goes against morality - in trying to incorporate this into my essay (to attempt to argue the flaws of the categorical imperative) I’m not sure how to argue for this notion because I have no idea if Kant’s ‘god’ is abrahamic in the first place. I feel every new piece of material I read about Kant and his ‘god’ leaves me with more questions than answers (I’m aware most sources say that Kant is an atheist) - sorry if this is a repetitive question, I’m very new to Kant and philosophy in general - maybe I’m also just focusing my attention in all the wrong places! Some guidance would be greatly appreciated",
        "created_utc": 1671210589,
        "upvote_ratio": 1.0
    }
]