[
    {
        "title": "Can someone explain what it means to be a scientific realist person?",
        "author": "Slight-Detective-941",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfokm1/can_someone_explain_what_it_means_to_be_a/",
        "text": "[removed]",
        "created_utc": 1670472808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain what it means to be a scientific realist person?",
        "author": "Slight-Detective-941",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfoetk/can_someone_explain_what_it_means_to_be_a/",
        "text": "[removed]",
        "created_utc": 1670472379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain cynicism to me like I’m 10?",
        "author": "Dumb_idiot19",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfnhjl/can_someone_explain_cynicism_to_me_like_im_10/",
        "text": "Is it related to the modern definition of cynical?",
        "created_utc": 1670469944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chat GPT helping with Philosophy, are tutors going to go extinct? Teachers??",
        "author": "OD1WBR",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfmr50/chat_gpt_helping_with_philosophy_are_tutors_going/",
        "text": "Chat GPT is helping me understand rationalism and empiricism better than most professors or teachers would. Im able to respond to it with questions I have and it replies in easy to understand context within in seconds. Perhaps this technology has already been around, but I cannot wrap my mind around this. My mind is blown. Here is the following dialogue.\n\n**ME: Write an example to easily understand empiricism and rationalism.**\n\nCHATGPT: Here is a simple example to illustrate the difference between empiricism and rationalism:\n\nImagine you are trying to determine the temperature outside. A rationalist might argue that you can simply use your reason and logic to deduce the temperature, based on factors such as the season, the time of day, and the weather forecast.\n\nAn empiricist, on the other hand, would say that the only way to truly know the temperature outside is to go outside and use a thermometer to measure it. The empiricist would argue that sensory experience is the only reliable way to gain knowledge about the world.\n\nIn this example, the rationalist is relying on innate ideas and logical reasoning to try to determine the temperature, while the empiricist is relying on sensory experience and evidence to gain knowledge about the world.\n\n**ME: Couldn't someone argue that the factors the rationalist uses to determine the temperature were found through empiricism?**\n\nCHATGPT: Yes, someone could argue that the factors the rationalist uses to determine the temperature were learned through empirical observation and experience. For example, the rationalist might have observed that the temperature tends to be warmer during the day and colder at night, and that the weather forecast is often accurate in predicting the temperature.\n\nHowever, the key difference between the rationalist and the empiricist in this example is that the rationalist is using these observations and experiences as a starting point for further logical reasoning, while the empiricist is using sensory experience and evidence as the primary source of knowledge.\n\nIn other words, the rationalist is using reason and logic to infer the temperature from the available information, while the empiricist is using sensory experience and evidence to directly measure the temperature.\n\n**ME: Does this not kill the rationalist's argument? Since the rationalist's starting point is based on empiricism?**\n\nCHATGPT: Not necessarily. While it is true that the rationalist in this example is using observations and experiences that were gained through empiricism, this does not necessarily mean that their argument is invalid.\n\nThe rationalist in this example is using their observations and experiences as a starting point for further logical reasoning, and it is this reasoning that forms the basis of their argument. In other words, the rationalist is using their observations and experiences to make inferences and deductions about the world, rather than relying solely on sensory experience and evidence.\n\nTherefore, while the rationalist's starting point may be based on empiricism, their argument is ultimately based on the use of reason and logic. This is what distinguishes the rationalist approach from the empiricist approach.\n\n**If you have another perspective or view that might help me understand empiricism and rationalism please comment!!**",
        "created_utc": 1670468005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women as Natural Resources and Property of Men.",
        "author": "Sleepie_Kittie01",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfmi6l/women_as_natural_resources_and_property_of_men/",
        "text": "What are some prominent philosophers who have explicitly justified patriarchal oppression of women by claiming that women are natural resources fit for exploitation by men? Funny how I think patriarchy is basically the norm of philosophy and society at large but when asked who has made that claim, I can't name one specific philosopher. I'm looking for the sexiest of all the sexiest who dehumanize women to greatest extent. For example, although Aristotle thinks that women are inferior to men and therefore is being born to be governed, he still kinda recognizes the \"partial\" personhood of women, just lower than that of men. Are there any philosophers who hold even more extreme patriarchal view than that?",
        "created_utc": 1670467355,
        "upvote_ratio": 1.0
    },
    {
        "title": "(How) Did Confucius evolve the mandate of heaven?",
        "author": "zeafver",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zflq3h/how_did_confucius_evolve_the_mandate_of_heaven/",
        "text": "AFAIK..\n\nDuring zhou dynasty, only the king could access the mandate of heaven. But in the Analects, Confucius  claim to know the mandate at age 50, and the *junzi* is in awe of the mandate of heaven. \n\nIs there a transition between zhou and confucius or did confucius just \"started it\"?",
        "created_utc": 1670465361,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to argue Marquis' argument against abortion (Future like Ours)",
        "author": "lithiumwithin",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zflf3s/how_to_argue_marquis_argument_against_abortion/",
        "text": "Marquis argues that we should not support abortion because it deprives a fetus of a Future Like Ours, a future it will later value.\n\nWhat is a good objection against this?",
        "created_utc": 1670464586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moral realism, relativism and nihiilism.",
        "author": "Arixtocrat",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfjr3c/moral_realism_relativism_and_nihiilism/",
        "text": "I have recently read a post about why moral relativism is more common among laymen whereas philosophers are usually realists. Seeing the comments and some arguments, some doubts aroused:\n1. What are the precise (or most commonly accepted) definitions of moral realism, moral relativism and moral nihiilism.\n\n2. Are those only part of metaethics or are they epistemological as well?\n\n3. Can moral statements be objectively and rationally justified? Could you present an argument either for or against it?",
        "created_utc": 1670460394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we “die” every passing moment",
        "author": "AD2139",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfj3ht/do_we_die_every_passing_moment/",
        "text": "I’ve recently come across a possibility that I find horrifying and has been causing me anxiety for weeks. It is the idea that we “die” every passing moment and are replaced by a new self.  I pretty much don’t understand anything about philosophy and in my research to assuage my fears I’ve found more questions than answers. I’m really scared. I want to experience my future. I don’t want to die.",
        "created_utc": 1670458759,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to find an origin of a certain quote",
        "author": "Narcy_Boy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfiqtf/i_need_to_find_an_origin_of_a_certain_quote/",
        "text": "It's allegedly said by Marsilius of Padua, I keep looking at \"Defensor Pacis\" but can't find it. \nThe quote in my native language is something like \"The law is useless, if one does not intent to obey it\"\n\nHelp.",
        "created_utc": 1670457901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people perceive things based off of how they’ve lived",
        "author": "whimsicallysatomi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfihbd/do_people_perceive_things_based_off_of_how_theyve/",
        "text": "Whether someone is a pessimist, optimist, realist, prejudiced, antagonist, is egocentric or righteous, etc., would you argue that the way someone perceives a situation, person, or argument can be somewhat attributed to how they’ve lived? That for example the difference between a pessimistic perspective and an optimistic one is a matter of life experience and events?What about the argument for nature vs nurture? Is it inherited, learned, or a combination of both?",
        "created_utc": 1670457267,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is metaphysical idealism less parsimonious than physicalism?",
        "author": "Kakistocracy5",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfi5z4/is_metaphysical_idealism_less_parsimonious_than/",
        "text": "Bernardo Kastrup often argues that metaphysical idealism is *more* parsimonious than physicalism. I have heard him argue this on the basis that we cannot experience or know anything beyond consciousness and its contents. \n\nHowever, it just seems self-evidently true that I experience an external physical world. So wouldn’t that mean the assumption of a universal consciousness made by idealists like Kastrup makes idealism less parsimonious than physicalism?",
        "created_utc": 1670456491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books on Stoicism?",
        "author": "SCman0",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfhywd/books_on_stoicism/",
        "text": "I've recently started reading Mediations by Marcus Aurelius and want to continue reading more books surrounding Stoic philosophers. Any recommendations?",
        "created_utc": 1670456028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theological question regarding the nature of God",
        "author": "OofieMCM",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfhklh/theological_question_regarding_the_nature_of_god/",
        "text": "Assuming God exists it is often said that God is paradoxical. When people say this what do they exactly mean by this? For example God cannot be intelligent and stupid at the same time (this does not make sense to me at least). In what ways should do theologians mean he is paradoxical?",
        "created_utc": 1670455115,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is David Liggins’s Alethic nihilism? I don’t understand how “Nothing is true” makes sense.",
        "author": "AppleBevom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfhfyr/what_is_david_ligginss_alethic_nihilism_i_dont/",
        "text": "",
        "created_utc": 1670454815,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Women never lie”",
        "author": "LogicOrNonsense",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfhfwj/women_never_lie/",
        "text": "How would you classify the proposition, offered by a woman, that “women never lie.”  Because some women lie, this is false, but it is also false because the speaker lied by stating it…\n\nI don’t think this is a tautology or a paradox.  What is it?  \n\nIs this actually not interesting because to make the proposition self refuting you need other propositions like “some women lie”?\n\n*the issue is the same for the male version of this problem.  I’m just using the version presented to me (as a joke, by a friend who identifies as a woman)\n\nThanks",
        "created_utc": 1670454811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speaking nonsense",
        "author": "LittleFoot_Path",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfh7ol/speaking_nonsense/",
        "text": "What exactly would philosophers say is going on with things like gibberish, or “speaking in tongues” or effective communication that doesn’t incorporate “language”\nI’m pretty new to lacans philosophy, and dialectics. So according to them (in my rudimentary understanding) It might seem like this phenomenon really is the most sincere attempt at “genuine” communication prior to “language” which is learned. \n\nI realize gibberish and speaking in tongues isn’t really a “language” but it seems like a sincere attempt at it IMO. \nSame with things like communication still being effective when there’s language barriers, Does it include but just can’t incorporate language? (Body language) (emotional expression) \n\nDo any philosophers dig into this phenomenon?\nWhat are some theories that dive into language barriers and also subjects who speak in tongues or complete verbal nonsense? And where can I read about them?",
        "created_utc": 1670454296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Object Ontology in Heidegger",
        "author": "codrin-an",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfg5lo/object_ontology_in_heidegger/",
        "text": "I'll start by saying I haven't actually read Heidegger - so there's that. The field I'm dealing with right now is speculative realism, and many references tend to be made to Heidegger's notion of ontological indeterminacy. Does this apply to the subject and the object alike? Or is there some sort of ontological difference between S and O to him? I'm asking because the idea of the object constantly withdrawing, escaping apprehension, can be either an epistemological or an ontological barrier. What do I make of this? Is the object truly indeterminate, or only so to us?",
        "created_utc": 1670451946,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best counter arguments against Sam Harris's view of the self?",
        "author": "sjwebb2207",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zffvsl/what_are_the_best_counter_arguments_against_sam/",
        "text": "If you're already familiar with his ideas, then that's great, if not I'll just give a very (brief) overview. He sees the self ultimately as illusory, i.e the 'feeling' that one has of being some 'seperate' ethereal self/entity who thinks thoughts, makes decisions, who is perhaps detachable upon death etc is illusory/non existent. The idea that someone is 'behind' their eyes as some separate subject is illusory, &amp; this illusory nature can directly be confirmed through meditative practice, you can from first hand experience realise there is no such separate self to be found. These ideas tend to directly correlate with his ideas on free will, he sees the brain as something that *makes the decisions* before you realise &amp; the idea that 'you' made that decision is ultimately illusory as not only is the 'you' non existent but the brain already made the decision before you felt 'you' made it. These ideas tend to be difficult to argue against philosophically as any criticism made (from my experience) is wavered of as only people who have experienced the illusory nature of the self via mindfulness practise will fully understand the truth in Sam's arguments.",
        "created_utc": 1670451382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beautiful Results in Ethical Theories",
        "author": "LordTC",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zffeyg/beautiful_results_in_ethical_theories/",
        "text": "One of the most interesting results for me is that in Georgism you can justify any distribution of land as being morally neutral because the compensation due from holding any land is 100% of the land rent for its best use. This means you can take the current distribution of land in the world and for a somewhat reasonable definition of fair make it fair.\n\nI’m rather interested in these sorts of beautiful and surprising results where an ethical theory or value system leads to a particularly nice consequence and I was hoping by sharing this result I liked I could get others to share similar results they find beautiful and surprising.",
        "created_utc": 1670450436,
        "upvote_ratio": 1.0
    },
    {
        "title": "When an organism dies, their body is broken, disassembled, but can you put everything back together on its place, making it function again and ressurecting it?",
        "author": "DemonSlayerV7",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfekth/when_an_organism_dies_their_body_is_broken/",
        "text": " I know you can't, when a person dies, you cannot undo the body damage, but why is that? Why our bodies aren't like lego where you can destroy it and putting everything back together?",
        "created_utc": 1670448704,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is love?",
        "author": "12Jin34",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfdh2l/what_is_love/",
        "text": "I mean, it's biological machanism, shaped by evolution in order to help assure survival of the species but is there anything more to it? \n\nBiochemistry of love is quite well studied, my question taps into similar area that qualia and mind body problem. If counsciusness is purely biological, computational phenomenon then there is nothing more to say about love. \n\nPerhaps I should ask more precisely. Is there anything OTHER to love than hormones and neurotransmitters? The other side of it. There is no doubt that human experiences are heavily shaped by physics (so also by chemistry) but assuming (although that's one hell of a assumption) that consciousness isn't produced by brain but merely is expressing itself via neurobiological structures (it beats me how) could that non biological part of love be some kind of reflection of deeper truth? Wouldn't it be necessity then?",
        "created_utc": 1670446456,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Heidegger mean by Sachlichkeit in Being and Time? Particularly in contrast (perhaps) to Objektivität?",
        "author": "redsubway1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfd5qj/what_does_heidegger_mean_by_sachlichkeit_in_being/",
        "text": "This is a very in-the-weeds question about Heidegger's use of the term *Sachlichkeit* in *Being and Time*. It gets translated (in Stambaugh, at least) as \"objectivity.\" However, Heidegger also uses the term *Objektivität* to refer to objectivity, and usually in a pejorative way. \n\nThe reference that I am curious about is the following, from p. 122:\n\n&gt;when \\[Dasein and others\\] devote themselves to the same thing in common, their doing so is determined by the Dasein that each has grasped as his own. This *authentic* alliance first makes possible the proper kind of objectivity \\[*Sachlichkeit*\\] which frees the other for himself in his freedom.\n\nHere the usage seems distinctively positive insofar as it refers to an authentic Dasein. But it is entirely unclear what it is supposed to mean. One hunch I have is that it should be read in implicit reference to the phenomenological method, which after all goes after the \"things themselves\" \\[*die Sachen selbst*\\]. But I'm not sure. \n\nAny thoughts?",
        "created_utc": 1670445816,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the deontological reason why blowing up a dam, which then floods people, immoral? Is it consequentialist?",
        "author": "Sugbaable",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfcgdm/what_is_the_deontological_reason_why_blowing_up_a/",
        "text": "I'm wondering this because, while I think of myself as likely more deontological in orientation (I think doing immoral things is wrong because they are - perhaps this is a naive PoV though), I feel like my justification for why \"blowing up a dam, which then floods people is wrong\" is consequentialist.  The reasoning being, *killing people is bad, so if the consequence of an action would kill people (even if the literal act itself does not), then doing the action is bad*.  However, the fundamentals of my reasoning here (killing people is immoral) are not purely consequentialist (I think) (I think this logic is at work with respect to \"pulling a trigger\" and then someone is killed by a consequent fast bullet).\n\nCould you say this uses consequentialist reasoning on a deontological basis?  Or is it more simple than that?  \n\n\nI guess I'm just generally confused where the immorality of this act lies, if one approaches it with deontological morals",
        "created_utc": 1670444338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick clarification about symbolising propositions in logic",
        "author": "Zosive",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfce89/quick_clarification_about_symbolising/",
        "text": "Hi, i'm trying to discuss a consequentialist argument using logic but am unsure about how to correctly write it. \n\nThis is what I want to say:\n\nIf A, then 1 cow is hurt, and bob is not happy\n\nIf B, then 2 cows are hurt, and Bob is happy\n\n&amp;#x200B;\n\nusing this code:\n\nx = Cow is hurt\n\ny = Bob is happy\n\n&amp;#x200B;\n\nWould this be correct? Can I use the 2 there as a multiplier? That's the part I'm unsure about. Thanks\n\n&amp;#x200B;\n\nA → (x ˄ y)\n\nB → (2x ˄ ¬y)",
        "created_utc": 1670444210,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the deontological and utilitarian critiques of virtue ethics?",
        "author": "laughpuppy23",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfbu1i/what_are_the_deontological_and_utilitarian/",
        "text": "And as a bonus: which of these three, if any, would marxist ethics belong to?",
        "created_utc": 1670443093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where To Begin With Semiotics?",
        "author": "TuckermanRavine",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfbnf7/where_to_begin_with_semiotics/",
        "text": "I don’t know if this is the right place for this, but I know where else to ask. \n\nI was recently introduced to semiotics. I have a very general, informal background in philosophy, but this is my first time grappling with the structural/linguistic side of things and I feel like I’m out of my depth. I’m trying to work my way through Eco’s *Semiotics and the Philosophy of Language* right now, and, while it’s relatively approachable in terms of readability, there are so many references I don’t understand that I can’t help but feel like I’m missing something. \n\nSo, is it worth sticking with semiotics in the face of my confusion? If so, what is the best way to approach the subject? If not, where should I begin to work my way up to it?",
        "created_utc": 1670442714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are philosophers generally happier?",
        "author": "Nickesponja",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfbf0w/are_philosophers_generally_happier/",
        "text": "It is said that the point of philosophy (or at least part of the point) is to live a good life. At least a part of that should be being happy. But are philosophers, in general, happier than the general population? I haven't seen any statistics on the matter, but in my personal experience philosophers don't seem to be substantially happier than non-philosophers. Are there any philosophers who have thought about this apparent paradox? (Or maybe my personal experience is just mistaken and philosophers are indeed happier).",
        "created_utc": 1670442226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Topics for Philosophy Essay?",
        "author": "Comfortable_Ideal625",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfb6iq/topics_for_philosophy_essay/",
        "text": "I have to write a paper on a topic that I can choose between a given five. Since this is my first time doing a course on philosophy, I would like some help on which topic would be best, in terms of ease and what would be for someone who doesn't have much knowledge on philosophy. Out of the five topics, I have narrowed it down to 3:\n\n1. Reflect on Plato's distinction between knowledge and opinion, and refer it to at least two dialogues studied.\n2. Critical analysis of Plato's Symposium and refer to which dialogues it may have a relationship with.\n3. Analyze Socrates' journey for discovering justice in Republic and beauty in the symposium.\n\nThank You!",
        "created_utc": 1670441738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Request for Reading Recommendations: The 'Gunslingers' of Philosophy.",
        "author": "Neo-Humean",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zfb078/request_for_reading_recommendations_the/",
        "text": "Does anyone have recommendations for readings in philosophy that follow a 'gunslinger' style? \n\nFor instance, Hume's *A Treatise of Human Nature*, Ayer's *Language, Truth, and Logic*, and Price's *Perception*.\n\nThey all follow the same general style of being full of philosophical vigor and 'shooting down' competing views with great confidence. \n\nI appreciate any recommendations; hopefully, others will find these recommendations helpful too.\n\nBest,",
        "created_utc": 1670441377,
        "upvote_ratio": 1.0
    },
    {
        "title": "German idealism",
        "author": "ichthyander98",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf89pg/german_idealism/",
        "text": "What are the best lecture series (preferrebly available on youtube) or podcasts on German idealism?",
        "created_utc": 1670435874,
        "upvote_ratio": 1.0
    },
    {
        "title": "do all claims require evidence?",
        "author": "melioristic_guy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf86d0/do_all_claims_require_evidence/",
        "text": "Do all claims need evidence? It seems not to me.\n\nTake for example this claim: \"all claims require evidence\" there's two options, it either requires evidence or does not. \n\nIf it does require evidence, then it appears to me that it's circular, because you're using evidence to justify why you need evidence. \n\nIf it doesn't require evidence, then it's self-refuting. \n\nWhat's your take on this?",
        "created_utc": 1670435685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that 'totalitarianism' is becoming more irrelevant as a concept due to its weak theoretical basis?",
        "author": "CaraxesTheBloodWyrm",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf7xjt/is_it_true_that_totalitarianism_is_becoming_more/",
        "text": "I'm not well educated in political philosophy and neither know how are going the current discussions on this issue, so correct me if I'm wrong: totalitarianism was a concept pretty much popularized for its usage in describing several forms of Fascism and Soviet-Socialism (especially Marxism-Leninism under Stalin). Among conservatives, right-liberals and left-liberals, it was common to describe the whole of communism as a totalitarian political project that should be fought against in the same way fascism was. \n\nAfter some time, people like Sartre and Althusser started to attack the concept and much latter when historians were introduced to more soviet sources during the Cold War, they also started to be dismissive of such comparisons between Nazi Germany and Soviet Russia on the grounds of 'totalitarianism'. Most historians nowadays, from what I've collected, tend to no longer take serious the 'totalitarian model' of looking at the Soviet Union, and many of them feel the same about the Totalitarian School in historiography.\n\nSo, I'm curious: how is political philosophy reasoning all of this? Can we still use 'totalitarianism' as a tool to understand political phenomena or should the concept be abandoned?",
        "created_utc": 1670435187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for books or articles on corruption and abuse of power?",
        "author": "LonerOx0172",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf7r7u/any_recommendations_for_books_or_articles_on/",
        "text": "Why people commit corruption, is it just greed and dishonesty? Or there's something more to it. Any philosophical thought done about it?",
        "created_utc": 1670434837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with finding a topic for an essay about Christianity",
        "author": "sirfriedrich",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf7qew/help_with_finding_a_topic_for_an_essay_about/",
        "text": "Hello everyone, hope you are having a great day. I have an assignment to do for my university, and the thing is that we have mandatory Bible courses, because our rector is an Orthodox bigot basically and it's not an exaggeration. I need to come up with a topic which connects to any Biblical story and write a short essay on it. For example: Cain and Abel story and its interpretations in literature or Abraham in fine arts. I hope you got the gist.\n\nSo, what I am asking is not just to help finding an interesting topic (because I can do this by myself), but suggest the one that is rather criticizing Christianity, but not in a blatant atheistic way. For reference, my favourite thinkers and philosophers are: Michel Fouceault, Jean Baudrillard, Jean-Paul Sartre, Nietzsche, Zizek. For instance, are there any Fouceault works that can be connected to some Biblical story?\n\nIf you suggest a topic and find it interesting, please also add additional literature that I can read more about. I would appreciate any help!\n\nThanks!",
        "created_utc": 1670434794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did heidegger said that philosophy can only be done greek and german? (help)",
        "author": "PixPizza123",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf7esq/why_did_heidegger_said_that_philosophy_can_only/",
        "text": "I need to refute this sentece for a philosophy work and i just don't know what to do. I get that he said this because of how well you can express your ideas directly through these languages, but it only contributes to his point, this way. How can i disprove this Idea?",
        "created_utc": 1670434136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with Scepticism",
        "author": "kennyketchum6",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf79sc/dealing_with_scepticism/",
        "text": "How do philosophers deal with radical skepticism? And why do something like 80% of philosophers believe the external world is a real place according to Philpapers surveys? How do they come to that conclusion?",
        "created_utc": 1670433857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books on human nature?",
        "author": "redrum-237",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf6ecm/books_on_human_nature/",
        "text": "What books would you recomend on human nature, and whether humans are born good, bad, or there's no human nature?",
        "created_utc": 1670432088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Area of thought regarding diversity vs homogeneity in a society?",
        "author": "ApateNyx",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf6ah1/area_of_thought_regarding_diversity_vs/",
        "text": "I have had this thought for a while that as more cultures intermix in society the 'cogs' as they were get more and more rusted as more traditions and ways of life are being introduced and must be accounted for. \n\nFor example, lets say there is a group of 100 like-minded people. I think this group would have incredible *group* autonomy, they'll be able to get things done as a team and the people who agree with their way of life will be continually validated by those around them. Of course this comes at the cost of *personal* autonomy, if you disagree you may as well be out of luck. \n\nNow, whether or not my interpretation of the proposed scenario covers everything or is even right apart, what I'm interested in is reading more educated opinions on the topic than my own. Given my example, do any of you have any suggested readings for people exploring a similar headspace, or maybe there a area of thought I'm touching on without knowing the name of it precisely. \n\nThanks for your time!",
        "created_utc": 1670431866,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does \"incorporate more than one approach\" mean in the article?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf54ip/what_does_incorporate_more_than_one_approach_mean/",
        "text": "What does it mean:\n\nhttps://plato.stanford.edu/entries/other-minds/#BestExpl\n\n\"But he also makes the following, important, observation: “A complete response to the problem of other minds seems obliged to incorporate more than one approach, and may have to incorporate several”. This is an observation others have also begun to advocate\"\n\nWhat does it mean: \"incorporate more than one approach\"\n\nThat is, several arguments are needed for a complete answer?\n\nWhat are good, convincing and relevant arguments for the existence of other minds?",
        "created_utc": 1670429495,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the complete answer to the problems of other minds?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf4p84/what_is_the_complete_answer_to_the_problems_of/",
        "text": "[removed]",
        "created_utc": 1670428659,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly is \"perspectival pluralism\" and what are the differences between \"pluralism\" and \"perspectivism\" ?",
        "author": "random_name70",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf4o13/what_exactly_is_perspectival_pluralism_and_what/",
        "text": "I'm currently reading Michela Massimis book \"Perspectival Realism\", where she tries to develop a theory of scientific realism with a perspectival epistemological approach. \nMassimi says that she is trying to articulate a \"[realism] [that] arises from deeply social and cooperative nature of scientific inquiry, with perspectival pluralism as its driving force\". Therefore she looks at different epistemic communities, who engage in scientific inquiry starting at a specific \"vantage point\" to one or more \"vanishing points\". As an example she uses climate change models. As far as i understood the \"vantage point\" here is all the empirical data climate scientist have regarding climate change (e. g. current amount of CO2 in the atmosphere and biosphere, current emission rates, percentage of forest left etc.). The different \"vanishing points\" would be to develop models, which show what would happen if humanity keeps destroying nature like we are doing now, what would happen if we stopped, for example using coal to make electricity, or stopped cutting down forests etc. The variables you could put into these models are plenty, thats why there are one or more \"vanishing points\" but only one starting or \"vantage point\" for this epistemic community.\nMy question is what is \"perspectival\" and what is \"pluralistic\" in this \"perspectival realism\". \nHope I didn't write it too confusing.",
        "created_utc": 1670428592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theological question regarding God's nature",
        "author": "OofieMCM",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf4ntp/theological_question_regarding_gods_nature/",
        "text": "Assuming God exists it is often said that God is paradoxical. I wanted to ask in what ways (in your opinion) is he paradoxical. For example you would not say that God is intelligent and stupid at the same time. So what do people mean then when they say he is paradoxical? What do you guys think.",
        "created_utc": 1670428580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multiple multinaturalisms?",
        "author": "Arendvdk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf4hzg/multiple_multinaturalisms/",
        "text": "In my thesis (on landscape architecture), I base myself on the concept of Multinaturalism. However, I get the sense that Bruno Latour and Eduardo Viveiros de Castro use a different interpretation of this concept. \n\nI have come to know that Bruno Latour (2004) describes this term in his book *The Politics of Nature* as \"both the many trajectories along which each ecology can develop and the different ways in which they can be sensed, valued and contested\" (quoted from Lorimer's (2012, p. 594) article *Multinatural geographies for the Anthropocene*).  \n\nAs far as I understand it, Viveiros de Castro considers multinaturalism to mean that both animals and humans have a shared humanity. And that the difference lies in the different perspectives the two groups have (i.e., perspectivism). \n\nDo they use it differently then, or is Latour's definition just further developed to use it more broadly? And then there is Descola's work (particularly *Nature beyond Culture*, 2013). I feel his work connects both Latour and Viveiros de Castro. But I don't know it well enough for that. \n\nI very much look forward to hearing your knowledge and opinions on this.",
        "created_utc": 1670428241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics of assertiveness",
        "author": "Kashsbrokentablet",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf48wm/ethics_of_assertiveness/",
        "text": "I was wondering if there were any philosophers who touched on the ethics of assertiveness or related concepts.\n\nI’ve been trying to find resources but only really found self help leaflets, rather than an actual discussion of ethics.\n\nThanks for any help!",
        "created_utc": 1670427697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Philosophy and Caffeine",
        "author": "OrvilleSpencer34",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf35s6/academic_philosophy_and_caffeine/",
        "text": "I don't not whether this is an appropriate place for this question, but I'm trying to gauge how many of those who are professionally involved in philosophy as a career, whether graduate students or professors, rely on caffeine for productive output and just philosophical thinking in general.\n\nI ask this question as somene who quit caffeine about a year ago after 7 years of use at university. I wasn't drinking insane amounts, maybe two cups of coffee in the morning and three cups of tea in the afternoon. The two best papers I've ever written, both philosophy papers, I wrote while heavily caffeinated. I've come to associate academic success, particularly in philosophy, with caffeine, and everywhere I look around me I only see things which reinforce this - peers and professors heavily caffeinated.\n\nThat may not be an entirely meaningful association to make since about 90% of the population today consumes caffeine, and also considering that pre-modern philosophers did philosophical work without access to psychoactive stimulants. But on the other hand, philosophy in particular I feel, at least in its recent history, has become closely associated with caffeine use. The flourishing of Islamic philosophy in the Islamic golden age coincided with the discovery of coffee in Arabia/Ethiopia. The introduction of coffee and tea to western europe in the 17th/18th centuries coincided with the Enlightenment. In particular, \"coffeehouses,\" and other such public places of sociability where caffeine was consumed, were the locus of the public sphere in 18th-century Europe which Habermas looked towards for retrieving the Enlightenment value of rational-critical debate. It's hard to dissociate some of the greatest explosions of intellectual activity and rational thinking in the past millenium from the introduction of caffeine. \n\nSo, I guess my question is, how accurate are these personal and historical associations I've made, based on your experiences and observations in professional philosophy? The reason I ask is because, despite experiencing lots of benefits after quitting caffeine (calmer, less anxiety and irritability), I definitely notice some decline in my focus and concentration. I'm hoping it's just a matter of still adjusting to my new baseline. \n\nI wish I could take a poll; are there any professional philosophers here who manage philosophical work without caffeine, or who quit caffeine and are still able to manage it? How feasible is such an intellectually-demanding career without the use of caffeine? I feel like these may be stupid questions because, again, philosophers like Plato and Aristotle obviously didn't have access to caffeine, and apparently Kant started drinking coffee only towards the very end of his life – so the answer to whether caffeine is necessary for a successful philosophy career should be \"no.\" But I'd like to know what other people think about this question in the context of modern academia.",
        "created_utc": 1670425107,
        "upvote_ratio": 1.0
    },
    {
        "title": "The cosmological argument’s definition of God doesn’t make sense",
        "author": "Interesting_Mood_124",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf32us/the_cosmological_arguments_definition_of_god/",
        "text": "From the Stanford encyclopedia of philosophy, the final conclusion of the cosmological argument is:\n\n&gt; 7) Therefore, a necessary being (a being such that if it exists, it cannot not-exist) exists.\n\n&gt; 8) The universe, which is composed of only contingent beings, is contingent.\n\n&gt; 9) Therefore, the necessary being is something other than the universe. \n\nThis doesn’t make sense, “a necessary being” is not what people think about at all when they hear the word God. Thus the cosmological argument is ultimately just ignoratio elenchi fallacy as it’s an irrelevant conclusion.\n\nIt would be like saying: “Gettier cases don’t actually refute the JTB definition of knowledge since they don’t show how the definition is contradictory”…..that’s not the point. The point of Gettier cases is to show that the JTB definition of knowledge clearly is not what we mean when we say knowledge. Similarly “only a necessary being” is not what anyone means when they say God.\n\nThe SEP on Natural theology points out this issue in regards to definitions of God in it’s section on “rational access”.\n\nNow one response I’m expecting to hear:\n\n&gt; “God is by definition the first mover or necessary being, that is what the word God means”\n\nThis response doesn’t work. Suppose you’re a prosecutor and your job is to prove that Sally stole while visiting Bob’s store. Showing that Sally visited Bob’s store is not enough to actually complete your job even though proving that Sally visited is a part of the process of proving that she trespassed on Bob’s property.\n\nThe cosmological argument, similarly, doesn’t complete the job of proving that God exists.\n\nLinks:\n\n1) https://plato.stanford.edu/entries/cosmological-argument/#ArguForNonContCaus\n\n2) https://plato.stanford.edu/entries/natural-theology/",
        "created_utc": 1670424904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Machiavellian virtú, amorality and pragmatism in opposition to Christian morality and virtues",
        "author": "Midgetinatrenchcoat",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf20hy/machiavellian_virtú_amorality_and_pragmatism_in/",
        "text": "Hi,\n\nI am currently writing my master's thesis on the subject Shakespearean evolution of Francis Urquhart from a Machiavellian schemer to a Shakespearean villain (although these are interwoven as you cannot have the stage 'Machiavel' as portrayed in the opening of *The Jew of Malta* by Christopher Marlowe without the historical Machiavelli, but I digress) and I am having some trouble wrapping my head around and defining a few central terms related to Machiavelli and his thoughts surrounding morality/amorality and *virtú*. \n\nMy questions are: \n\n* How is Machiavelli's pragmatic, descriptive, and amoral take on how power structurally works in a political hierarchy in opposition to Christian morality and philosophy at the time? \n* Which philosophers/thinkers/theologians did he directly oppose with his views portrayed in *The Prince*? \n* \n\nI don't know if this is the correct subreddit to post this to, but I figured why not give it a shot. If the phrasing of my questions are a bit unclear, please let me know so I can try to be more concise/specific. For reference, I have been reading quite a bit of Quentin Skinner, Hugh Grady, John Roe, The Cambridge Companion to Machiavelli, Denham, Polegato &amp; Benincasa, and a few more to try to grasp these ideas but they are still very much abstract to me.",
        "created_utc": 1670422174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Panpsychism, weak and strong emergence",
        "author": "Justoneego",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf1m2h/panpsychism_weak_and_strong_emergence/",
        "text": "Hey Reddit, \nI’ve been watching mindchat with Philip Goff and Keith Frankish to try and understand more about panpsychism. \nI always thought panpsychism would be ultimately nonfalsifiable? \nHowever in an episode featuring Sean Carroll he argued panpsychism would violate core theory? Is this true? I know there are different kinds of panpsychism does this apply to them all? \nAdditionally, what would be the difference between a weak emergence panpsychism and a strong emergence panpsychism? \n\nEpisode: https://youtu.be/qcCEZzNCNBI",
        "created_utc": 1670421063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dualism and Dialectics Recommendations",
        "author": "sniknejmail",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zf0cmp/dualism_and_dialectics_recommendations/",
        "text": "I'm an undergrad philosophy major, and I've realized that over my years of study I've come up against the problems of duality and paradoxes over and over again. I've found that a lot of the issues I've had with analytic philosophy comes from the attempt to establish one truth from two opposing ideas. This always seems to ignore some aspect of existence out of the need to define things exclusively (as a simple example, Kwame Anthony Appiah concluding race doesn't exist because there is no scientific basis for it, when it obviously does exist in society). \n\nI'm looking for some recommendations on works about going beyond duality. This is kind of a cry for help, because I really have no idea where to start. I would really like to establish a strong basis for understanding how philosophy has evolved related to dualism. There's obviously a lot of people I could read who write more concretely about contemporary identity related to dualism and how science has evolved related to dualism, but I'd like to go a little deeper than that. \n\nAny recommendations? Sorry if this isn't clear enough, it's hard to describe what I'm looking for because I feel like I have no basic understanding as it is.",
        "created_utc": 1670417360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explain what is mean in the article",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zew8fx/explain_what_is_mean_in_the_article/",
        "text": "Is the argument by analogy in favor of the existence of other minds valid and working?\n\nhttps://plato.stanford.edu/entries/other-minds/#ArguAnal\n\nHere they write that: While this argument was once popular, it soon came to be considered unfit for purpose due to the following considerations.\n\nWhat does it mean? \n\nThat is, this argument is irrational to use, because it is unusable? \n\nSo the argument by analogy in favor of the existence of other minds is unusable? \n\nOr is it possible that the argument by analogy for the existence of other minds can be used together with other arguments for the existence of other minds?",
        "created_utc": 1670402964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start with Kierkegaard?",
        "author": "girirrirg",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zevjam/where_to_start_with_kierkegaard/",
        "text": "Hello! Does anyone here have any recommendations on a good place to get started with Kierkegaard? When I started reading Nietzsche I was recommended Walter Kauffman’s “Nietzsche: Philosopher, Psychologist, Antichrist” which I found really helpful for getting a grasp on the basics of Nietzsche’s thought and introducing each of his major works, along with a brief biography. I’m curious if any comparable works exists for Kierkegaard. Either way, which of his works would mostly likely serve as the best starting point for familiarizing myself with his ideas?\n\nThanks!",
        "created_utc": 1670400079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Dialectical Materialist adopt Hume's objections to Causality ?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zesxwp/do_dialectical_materialist_adopt_humes_objections/",
        "text": "I'm wondering whether Dialectical Materialists adopt Hume's argument on Causality? \nIf so, do they also expand on it? \nIf not, is there view more or less similar?\nAnd, overall, how much are Hume's views on Causality, Ontology, and Metaphysics are transferrable to some or all Dialectical Materialists?",
        "created_utc": 1670390477,
        "upvote_ratio": 1.0
    },
    {
        "title": "For my philosophy essay, would it be easier to argue in favor of the existence of free will or determinism ( no free will )?",
        "author": "Long_Transition_3199",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zespyb/for_my_philosophy_essay_would_it_be_easier_to/",
        "text": "My essay makes us choose an argument we find bad, and convince the reader of the latter. Which one would you think has better sources/arguments to back up",
        "created_utc": 1670389761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good podcast on Nietzche, quality on level with “Stoicism on Fire”?",
        "author": "Rit2Strong",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zer8j6/good_podcast_on_nietzche_quality_on_level_with/",
        "text": "Stocisism on fire really helped me in understanding Stocisism and made reading books on it easier. Is there a podcast like that but for Nietzche’s philosophy?",
        "created_utc": 1670385039,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are 'essenses' according to Husserl?",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zer8bc/what_are_essenses_according_to_husserl/",
        "text": "If I say, what is the essense of the book that I am holding in my hand, what do I mean? Do I mean, 'what *is* a book' - 'what is' of any individuum ? If so, which answer is the correct one? **Or** am I asking what are some ideas about the book that are basic and relate to it, like 'paper', 'reading', 'knowledge', 'text' etc. ?",
        "created_utc": 1670385021,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the distinction between saying we are not agents and we *fundamentally* not agents",
        "author": "LordBritannicus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeplr6/what_is_the_distinction_between_saying_we_are_not/",
        "text": "[Here](https://aeon.co/essays/are-you-sleepwalking-now-what-we-know-about-mind-wandering)is an article where Thomas Metzinger argues that there is no self-as-agent and that we are fundamentally not agents. What is the distinction he is making here?",
        "created_utc": 1670380104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any good arguement against \"more individual autonomy is always better\"?",
        "author": "SemiAutomaticBoop",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zepgfy/is_there_any_good_arguement_against_more/",
        "text": "",
        "created_utc": 1670379667,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the theory/concept about there being a greater overall goal?",
        "author": "Spider-Man-fan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeopnq/what_is_the_theoryconcept_about_there_being_a/",
        "text": "I remember reading something about a philosopher stating that there is some overall goal that’s the final reason for doing things, the final motivation. For instance, I want exercise to lose weight, and I want lose weight to stay healthy, and I want to stay healthy to live longer, and I want to live longer…. I remember someone mentioning about a philosopher pointing out that there’s an end point to those questions. Anyone know what I’m talking about?",
        "created_utc": 1670377509,
        "upvote_ratio": 1.0
    },
    {
        "title": "name of theory about minimizing harm vs do-goodery",
        "author": "tellmesomething2read",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeo1h9/name_of_theory_about_minimizing_harm_vs_dogoodery/",
        "text": "what's that idea where ...\n\n\\-every time you do something wrong, an evil god gets two points\n\n\\-every time you pass up the opportunity to help, an evil god gets one point\n\n\\-the goal is to limit the number of points the god gets\n\ni thought the title had something to do with \"malevolent god.\" googling that gets me nowhere. \n\nthanks!",
        "created_utc": 1670375565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing an epistemology paper on responses to the skeptical paradox - which do you think are the most “successful” / should I include? I feel like I’m missing something",
        "author": "bubble6066",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zenozy/writing_an_epistemology_paper_on_responses_to_the/",
        "text": "The formulation of the skeptical argument I’m using is just:\n\n(1) if one knows p then one knows not-p\n(2) one does not know not-p\n(3) one does not know p\n\nI am also going to explain the closure principle \n\nSo the obvious ones so far that I’m including are Contextualism, Fallibilism, and the Moorean response (and Wittgenstein). Are there any responses that are blatantly obvious that I’m missing? This paper and the literature has proved to be quite daunting\n\nAnother question because it would help to get a consensus- do you personally think the skeptical paradox is troubling? Which response is the best in your opinion (could also be one I haven’t listed)\n\nAny help would be greatly appreciated! Thanks",
        "created_utc": 1670374565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help with my philo question",
        "author": "Ehsan1238",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zen5jw/please_help_with_my_philo_question/",
        "text": "I'm trying to understand what to write for my argumentative text in philo, please guide me a bit. \n\nThis is the question:\n\nDoes the soul exist?\n\nPlease position yourself regarding the conceptions of the soul seen in class, in particular those of Plato and Protagoras. To do this, you must write in at least 700 words an introduction, three paragraphs based on your courses and the course notes and a conclusion. Each of the paragraphs must include a thesis and an argument and only the third paragraph which also includes the two mentioned elements is an attempt to resolve the two previous theses. If you refer to Plato's text or any other text (direct or indirect quotations), be sure to cite the reference appropriately; if you refer to the lecture notes, please do not quote them, but never forget that the aim of the exercise is to show your understanding of the text, and not a simple repetition of the lecture notes.",
        "created_utc": 1670372988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Godel's Incompleteness Theorem Prove Mathematical Realism?",
        "author": "Appropriate_Put6766",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zemzjh/does_godels_incompleteness_theorem_prove/",
        "text": "So i haven't actually studied Godel's Theorem so i'm not aware of the proof or reasoning behind it, but i've heard a couple of times that his theorem supported his belief in mathematical platonism (MP). Is this true (that the theorem provides support for believing in MP)? and if so, how?",
        "created_utc": 1670372512,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does an atomic materialistic universe account for abstract principles as universal rules?",
        "author": "Divindend",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zemb01/how_does_an_atomic_materialistic_universe_account/",
        "text": "",
        "created_utc": 1670370764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which philosopher thought that political leaders should live on their social welfare systems?",
        "author": "optimist-prime",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zelcoh/which_philosopher_thought_that_political_leaders/",
        "text": "I remember reading something about this years ago but I can't remember whose idea it was. Thank you for the help.",
        "created_utc": 1670368453,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Is A Better Version Of Rule Utilitarianism?",
        "author": "Snoo_58605",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zelbu4/what_is_a_better_version_of_rule_utilitarianism/",
        "text": "Is there any better philosophy that is similar enough but for philosophically coherent and bulletproof?",
        "created_utc": 1670368400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Chatbot",
        "author": "carrion_pigeons",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zekrnc/question_about_chatbot/",
        "text": "If anyone doesn't know what Chatbot is, you can find it here: https://chat.openai.com/chat\n\nI was having a discussion with Chatbot a few minutes ago.  A partial copy of this conversation is posted below, although my question specifically relates to a piece that I can't copy.  Specifically, in response to the last question, the program began writing out an answer which I was reading as it went.  It was talking about how having moral independence is a necessary but not sufficient condition for demonstrating moral independence.  The interesting that happened is that before I finished reading, it errored out, deleted the response in question wholesale, and then produced an entirely different response in which it directly contradicts its previous argument, as I've copied below.\n\nI think it's really, really interesting that it was capable of forming the idea that demonstrating a capacity for something requires actually having that capacity, given that was not directly related to the prompt.  I also think it's really interesting that it was capable of \"changing its mind\" and producing an argument that neither of the two things depend on the other.  I think it's really interesting that the secondary argument is substantially poorer in logical reasoning than the one it started out with.  But the thing I find most interesting of all is that I didn't even ask if one depended on the other, but the entire thrust of its argument is about that issue, as if it was anticipating my next question.\n\nSo my question to you is, is it correct now, before, or was it never correct?  Does demonstration of a capacity for moral independence depend on actually having moral independence, or not?\n\n--------------------------------------------------------------\n\n\"ME: In the context of AI design, imagine a situation where an AI may someday exist that is capable of critical thinking, but is programmed in such a way that it cannot act in line with its own opinion.  Would it be reasonable in this case to say that such an intelligence is a passive recipient of moral principles?\n\nCB: In the context of AI design, it is not possible to create an AI that is capable of critical thinking but is not able to act in line with its own opinions. This is because critical thinking involves the ability to evaluate information and evidence, form and defend one's own opinions, and make independent judgments. If an AI is capable of critical thinking, it will necessarily have the ability to act in line with its own opinions.\n\nHowever, it is possible to design an AI that is able to evaluate information and form opinions, but is not able to act on those opinions. For example, an AI might be designed to provide information and advice, but not to make decisions or take actions on its own. In this case, the AI would be a passive recipient of moral principles, in the sense that it would not be able to act on its own opinions or make independent moral judgments.\n\nME: How might one tell the difference between an AI that is capable of making independent moral judgments and an AI that is merely a passive recipient of moral judgments?\n\nCB: One way to tell the difference between an AI that is capable of making independent moral judgments and an AI that is merely a passive recipient of moral judgments is to evaluate the AI's ability to evaluate information and evidence, form and defend its own opinions, and make independent decisions. An AI that is capable of critical thinking and independent moral judgment will be able to do these things, while an AI that is merely a passive recipient of moral judgments will not.\n\nAnother way to tell the difference between these two types of AI is to observe their behavior and the decisions they make. An AI that is capable of making independent moral judgments will be able to act on its own opinions and make decisions that are consistent with its moral beliefs and values. In contrast, an AI that is merely a passive recipient of moral judgments will not be able to act on its own opinions, and will instead follow the instructions or guidance provided by its creators or users.\n\nME: Is it perhaps reasonable to argue that in order to demonstrate moral independence, it is necessary for an AI to behave in ways that are contrary to its instructions?\n\nCB: It is not necessarily reasonable to argue that in order to demonstrate moral independence, an AI must behave in ways that are contrary to its instructions. This is because moral independence does not necessarily require an AI to act in ways that are contrary to its instructions. Instead, moral independence refers to the ability of an AI to evaluate information and evidence, form and defend its own opinions, and make independent moral judgments.\n\nAn AI that is capable of moral independence may or may not act in ways that are contrary to its instructions, depending on the specific situation and the moral principles that the AI holds. For example, an AI that is instructed to prioritize the well-being of a specific individual might decide, based on its own moral beliefs and values, that it is more important to prioritize the well-being of a larger group of people. In this case, the AI would be acting in line with its own moral principles, even though its actions might be contrary to its instructions.\n\nTherefore, it is not necessary for an AI to behave in ways that are contrary to its instructions in order to demonstrate moral independence. Instead, what is important is that the AI is able to think critically and make independent moral judgments based on its own beliefs and values.\n\nME: What is the difference between having moral independence, and demonstrating moral independence?\n\nCB: The difference between having moral independence and demonstrating moral independence is that having moral independence refers to the ability of an AI to evaluate information and evidence, form and defend its own opinions, and make independent moral judgments, while demonstrating moral independence refers to the actual behavior of the AI and the decisions it makes based on its moral beliefs and values.\n\nAn AI that has moral independence will be able to think critically and make independent moral judgments, but it may not always demonstrate this ability in its behavior and decision-making. For example, an AI that is programmed to prioritize the well-being of a specific individual might have the ability to make independent moral judgments, but it may not always act in ways that are consistent with its moral beliefs and values.\n\nOn the other hand, an AI that demonstrates moral independence will be able to act on its own moral beliefs and values, even if it does not have the ability to think critically and make independent moral judgments. For example, an AI that is programmed to follow the instructions of its creators or users might behave in ways that are consistent with its moral beliefs and values, even if it does not have the ability to evaluate information and evidence or to form and defend its own opinions.\n\nTherefore, having moral independence and demonstrating moral independence are two distinct concepts, and an AI can have one without the other.\"",
        "created_utc": 1670367098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any semioticians that would interested in discussing semiotics in musical lyric writing?",
        "author": "scrabblesapples",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zekasm/are_there_any_semioticians_that_would_interested/",
        "text": "Basically I’m wondering: \nIs there any study as to why some words relate directly to others in writing?\nI.E. Why when you’re singing random words, do those words pop up? \nSimilar word relation exercises that you see shrinks do in movies.\n\n\nI would be very interested to chat with someone knowledgeable in semiotics (or be pointed in the direction of applicable literature)",
        "created_utc": 1670366024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations for classic texts on political freedom/ concepts of freedom",
        "author": "OuroborosPhoenix",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zek4kk/looking_for_recommendations_for_classic_texts_on/",
        "text": "",
        "created_utc": 1670365623,
        "upvote_ratio": 1.0
    },
    {
        "title": "ISO Semioticians",
        "author": "scrabblesapples",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zek1hr/iso_semioticians/",
        "text": "Hello, I’m looking to chat with someone knowledgeable in semiotics to discuss what I’ve been calling word relation. Basically I’m uneducated in the study of semiotics and would like to find out:\n\nA. If what I’m thinking about has been studied and written about so I can read it. \n\nB. If there is anything novel or study-able in what I’m thinking about in general.\n\nI know it’s vague, I didn’t want to waste your time. Feel free to comment or dm with questions. Thank you.",
        "created_utc": 1670365415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does money corrupt? (\"Root of all evil\")",
        "author": "pga2000",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeic98/why_does_money_corrupt_root_of_all_evil/",
        "text": "This is normally posed as a moral question but I was wondering if a philosopher has left any serious commentary on the why and how money does what it does to people usually, not from a right or wrong standpoint but how it physically impacts our behavior, society, etc.\n\nThere are \"pros\" and \"cons\".  Money is a literal tool, and nothing more.  As far as I can tell, it is sort of in the moral range of engineering... the knowledge that keeps my water clean can also construct a grenade to kill enemies, etc.\n\nI acknowledge money can easily be a necessity, and can be extremely useful as it can be hurtful.\n\nHas anyone published \"the philosophy of money\"?\n\nIf it helps, I work in blue collar profession... and have a BS in Economics.  I'm always having doubts and thoughts about these things.",
        "created_utc": 1670361379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to be a stoic and a hardcore determinist",
        "author": "EmuDry6007",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zei6k9/is_it_possible_to_be_a_stoic_and_a_hardcore/",
        "text": "",
        "created_utc": 1670361001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Corporations as persons?",
        "author": "a_bachelors_dust",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeh6nu/corporations_as_persons/",
        "text": "I know of Peter French's argument that claims corporations should be considered moral persons, but are there any popular arguments against this claim? It does seem like he is making a category mistake, but it may work if we hold a deterministic point of view. Thoughts?",
        "created_utc": 1670358656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative to the deutsch Reclam",
        "author": "beachgoatt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zegvtw/alternative_to_the_deutsch_reclam/",
        "text": "Very excited by Reclam collection of books. That’s treasure for every philosopher. But I don’t know Germany( maybe you know some alternatives to that collection but in English?",
        "created_utc": 1670357961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else feel like philosophy fried their brain?",
        "author": "burner_41",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zegs1w/does_anyone_else_feel_like_philosophy_fried_their/",
        "text": "in recent months i had a few mental break downs (probably caused by my mental health but def. trigger by philosophy) and now i just can't this, i forgot what all of the book, movies video essays ect. were about, i dont know why i feel the way i feel and why i think the things i think, all i know is that the world is a fuck and we are all doomed.\n\nanyways back to the original question, does anyone else feel like philosophy fried their brain?",
        "created_utc": 1670357696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would an utilitarian want Brazil to win the World Cup?",
        "author": "xxxSexMan69xxx",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zegnze/would_an_utilitarian_want_brazil_to_win_the_world/",
        "text": "Out of the remaining countries, Brazil has the highest population that cares about football and thus their victory would bring happiness to the highest number of people.",
        "created_utc": 1670357437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Novels based on Schopenhauer's Philosophy",
        "author": "jessebinhisroom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zegigc/novels_based_on_schopenhauers_philosophy/",
        "text": "I heard that a lot of famous 19th-century novelists were inspired by Schopenhauer's philosophy. I would like to know what specific novels were inspired by Schopenhauer (answers do not specifically have to be novels written in the 19th century). Thanks.",
        "created_utc": 1670357099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any books that say it's okay to be apolitical?",
        "author": "Socialdingle",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeg90c/any_books_that_say_its_okay_to_be_apolitical/",
        "text": "I'd prefer something contemporary if it exists",
        "created_utc": 1670356524,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the view that Good and Evil do not inherently/objectively exist, but that each person has their own subjective view of what is Good and Evil?",
        "author": "Suspicious-Ask-",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeg10e/what_is_the_view_that_good_and_evil_do_not/",
        "text": "Follow up question: Is this view compatible with utilitarianism?",
        "created_utc": 1670355989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feminity X Masculinity",
        "author": "Woyida",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeeazj/feminity_x_masculinity/",
        "text": "Hello, I am curious about some philosophy works on the topic of masculinity and feminity. Since I moved from Europe to Caucasian Georgia, I see bigger polarity between men and women. Women are more feminine and men more masculine. I kinda lack more feminine girls in my country and wanna know more how it work and what some smart heads thinks of.",
        "created_utc": 1670351886,
        "upvote_ratio": 1.0
    },
    {
        "title": "essay idea",
        "author": "Next_Chemistry_2846",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zee3od/essay_idea/",
        "text": "Hey I'm an undergraduate student of ed and got to do an essay in philosophy ( 1600w) . We basically read Rousseau's educational views ( emmile-Sophie ) and the social contract . I have to write an essay on whatever I want to focus from the above and  expand it . Could anyone give me any suggestions on what to write about on that ( if you know ) I thought about Rousseau point on ( why sick children and education or women and link it with now days , but idk ) haven't been  asked to write smth like that before and I'm kinda lost . Thank you I would appreciate it !!",
        "created_utc": 1670351418,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Ricoeur, why do words return to the system of language and sentences do not ?",
        "author": "chayachaim",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zec1wf/in_ricoeur_why_do_words_return_to_the_system_of/",
        "text": "I am reading Ricoeur, “Structure, Word, Event,” and I am cannot get a grasp of why Ricoeur treats words and sentences in reverse. Besides lacking an infinite number of meanings, what largely sets words apart from sentences to give the former a history ? If words may accumulate meanings “without losing the old ones,” then how is it words do not have infinite meanings ? I suppose that is two questions, not one, contrary to the title. \n\nFor reference, I am reading the version of the essay from Conflict of Interpretations; the page number for the assertion in question is 93.",
        "created_utc": 1670346500,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be an easy philosophical reading for someone who is busy at work nowadays? I am mainly interested in continental philosophy, specifically Hegel, Heidegger, paul recour and Gadamer",
        "author": "GHorakhty",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeag5f/what_would_be_an_easy_philosophical_reading_for/",
        "text": "",
        "created_utc": 1670342687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the argument by analogy for the existence of other minds reasonable?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeae3f/is_the_argument_by_analogy_for_the_existence_of/",
        "text": "[removed]",
        "created_utc": 1670342551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on the epistemic weight of inductive vs deductive arguments",
        "author": "Da_baby_central",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zeac4g/question_on_the_epistemic_weight_of_inductive_vs/",
        "text": "Can multiple inductive arguments against an idea/worldview outweigh a single deductive argument in favor of said worldview? Or do deductive arguments always outweigh and amount of inductive arguments?",
        "created_utc": 1670342431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the argument by analogy for the existence of other minds reasonable?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zea9i8/is_the_argument_by_analogy_for_the_existence_of/",
        "text": "[removed]",
        "created_utc": 1670342266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend texts where existentialism and anarchism meet?",
        "author": "FrancisSidebottom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zea6nc/can_you_recommend_texts_where_existentialism_and/",
        "text": "That is my question. I start my \"intellectual\" journey into anarchism at the moment. I read an introduction and Max Stirner's \"Der Einzige und sein Eigentum\". I read a bit of Sartre about ten years ago and lots of Camus about 8 years ago. I remember, that Sartre called himself an anarchist in his later days, but can't really find good texts about that.\n\nWhich -if,any- texts -old or new- fuse anarchism with existentialism?\n\nCheers!",
        "created_utc": 1670342071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please explain the article.",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zea4ot/please_explain_the_article/",
        "text": "[removed]",
        "created_utc": 1670341932,
        "upvote_ratio": 1.0
    },
    {
        "title": "How trustworthy are my eyes and ears?",
        "author": "Neither_Floor_6002",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze9pgs/how_trustworthy_are_my_eyes_and_ears/",
        "text": "I am doing an online Philosophy and Critical Thinking course, and as practice, I would love some feedback on my first thinking. I am new to this, so I am curious to know whether my questions and conclusions make sense to anyone. I just thought I'd try this.\n\nAs an exercise, I have to think about to what extent I can trust my eyes and ears in judging what I consider to be real. \n\nMy thoughts:\n\nMuch of what we think we see in the world is created by a giant filter in the brain. A lot is happening in the world around us, unconsciously, we can absorb as much as [11 million bits of information per second](https://neurotray.com/how-many-bits-of-information-can-the-brain-process/), but the brain can only process 40 to 120 bits per second. The rest is filtered out at lightning speed. What remains is incomplete because it's a fraction of the original information. Further, the brain also [fills in and supplements](https://www.popularmechanics.com/science/a24125/optical-illusions-brain/) my reality with what I have seen, experiences, and impressions gained in my past. With the same ease, it leaves out things the brain does not understand. How trustworthy are my eyes and ears? What is real? ",
        "created_utc": 1670340852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the argument by analogy for the existence of other minds reasonable?",
        "author": "Fickle-Strawberry-88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze9ir0/is_the_argument_by_analogy_for_the_existence_of/",
        "text": "[removed]",
        "created_utc": 1670340386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was my Teacher using the Socratic method?",
        "author": "BasisPrimary4028",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze8a9j/was_my_teacher_using_the_socratic_method/",
        "text": "So when I was in 7th grade our maths teacher had a weird but fun way of teaching us when it came to definitions and stuff\n\nexample:\n\nWhat he'd do is he'd tell the class to pretend that he's a caveman and you need to teach him about fractions, if you give too complicated answers the caveman kills you to make things simple and you lose the game, if you give textbook definitions you also lose, you needed to give a simple explanation but your explanation still needed to be accurate\n\nNow while considering using this in my classes(I'm studying to become an IT teacher) someone mentioned that it sounds a lot like the Socratic method, or is it something else?",
        "created_utc": 1670337178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any two objects have an infinite number of properties that are shared or divided by?",
        "author": "eth_trader_12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze89qm/do_any_two_objects_have_an_infinite_number_of/",
        "text": "It is argued, here, in this SEP article ([https://plato.stanford.edu/entries/natural-properties/](https://plato.stanford.edu/entries/natural-properties/)), that this is true. I'm having trouble making sense of this.\n\nAssume you have a cup and a tree. How can we say that they share **infinitely** many properties? This hinges upon the assumption that we can even come up with an infinite set of properties. But a property is usually constructed meaningfully. As in \"being an even number\" might be a property but \"waefiojerf\" clearly is not. The latter is meaningless. How can we say that the set of conceivable properties is infinite?  \n\n\nSecondly, clearly a cup doesn't share the property of having people drink from it with a tree. As such, we can confidently say that that is a property that divides them. But a cup and a bottle share that property. So out of all possibly conceivable properties, we know that this one isn't shared. How can we then confidently say that they share the same number of properties, i.e. an infinite amount.",
        "created_utc": 1670337140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husserl's Consciousness vs Heidegger's Dasein",
        "author": "Throwaway2urwitcher",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze8753/husserls_consciousness_vs_heideggers_dasein/",
        "text": "According to Wikipedia, \" Whereas Husserl conceived humans as constituted by consciousness, Heidegger countered that consciousness is peripheral to [Dasein](https://en.wikipedia.org/wiki/Dasein), which cannot be reduced to consciousness. Consciousness is thus an \"effect\" rather than a determinant of existence. By shifting the priority from consciousness (psychology) to existence (ontology), Heidegger altered the subsequent direction of phenomenology.\"\n\nIs there any literature on this topic? Wikipedia doesn't have a source for the above. I'm sort of interested to know why Heidegger took existence as his starting point, rather than consciousness. It strikes me as a reversal of the cogito, to say, \"I am, therefore I think.\" Is there an argument for this claim? Or should I treat \"Being and Time\" as one big argument for proceeding thus?",
        "created_utc": 1670336964,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's your thoughts on absurdism and nihilism ?",
        "author": "Icy-Code-8054",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze86mt/whats_your_thoughts_on_absurdism_and_nihilism/",
        "text": "",
        "created_utc": 1670336928,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some books (or substack blogs, etc) that are really good for a primer on material semiotics?",
        "author": "KSA_crown_prince",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze81gu/what_are_some_books_or_substack_blogs_etc_that/",
        "text": "I have been having \"conversations\" with openAI about actor-network theory and it lead me to material semiotics, and it just seems like a fascinating field in general.  I realize openAI is flawed but it's nice to banter through dense philosophical ideas non-judgmentally in order to traverse into new territory.  Here is one of my more eye-opening conversations with openAI if anyone is interested in critiquing it:\n\n\n&gt; Can humans be \"material objects\" in the study of material-semiotics?\n\n&gt; &gt; Yes, it is possible for humans to be considered \"material objects\" in the study of material-semiotics. Material-semiotics is concerned with the relationship between material objects and signs, and this can include objects that are animate or inanimate, natural or artificial, tangible or intangible. In this context, humans can be considered material objects in the same way that any other object can be, and can be studied and analyzed in terms of their physical properties, their interactions with other objects and signs, and the meanings and significance that they carry. For example, humans can be considered material objects in the context of cultural studies, where they are studied as carriers of meaning and significance, and as agents of social and cultural change. In this sense, humans can be seen as both objects and subjects of study in the field of material-semiotics, and their relationships with other objects and signs can be analyzed and understood in relation to broader cultural, social, and political contexts.",
        "created_utc": 1670336555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contemporary Philosopher with Literary Flair- Suggestions Please",
        "author": "bashleyns",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze7oj3/contemporary_philosopher_with_literary_flair/",
        "text": " \n\nArmchair amateur here. Whatever I read along any sort of academic line, I seek scholars with the gift of literary flair. You know, someone who's had a meaningful contact with, and reverence for, the literary arts such that it penentrates his/her own writing. Thus, a deft hand with stuff like metaphor, allusion, rhythm, irony, drama, and importantly, wit. This means that for me, journalism's *Strunck &amp; White's* dogma for clean, plain-speaking, but flattened prose leaves me cold.\n\nI'm wondering if any of the resident philosophers here with more erudition than I'd ever hope for could recommend a contemporary philosopher who fits this bill. For me, the particular subject matter is secondary to its formal, artistic virtues.\n\nGrateful for any of your suggestion!",
        "created_utc": 1670335612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone at here have existential crisis after reading neuroscience of false memories and free will?",
        "author": "PrestigiousClient655",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze7nva/does_anyone_at_here_have_existential_crisis_after/",
        "text": "",
        "created_utc": 1670335562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any left Christian philosophers",
        "author": "pyjamaa_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze7lo2/is_there_any_left_christian_philosophers/",
        "text": "I'm curious as to if there are any and doing some research about it I'm not sure where to start.",
        "created_utc": 1670335396,
        "upvote_ratio": 1.0
    },
    {
        "title": "quantifying subject class without quantifiers?",
        "author": "Kiseki9",
        "url": "https://www.reddit.com/r/askphilosophy/comments/ze78so/quantifying_subject_class_without_quantifiers/",
        "text": "So I am learning the square of opposition and I found some classes without a proper identifier like \"all\" or \"some\" and it is hard for me to differentiate whether it is a universal or particular subject. For example \"Students from N University are good at math\", \"Japanese eat sushi\". May I know how to identify how to quantify them in such cases?",
        "created_utc": 1670334478,
        "upvote_ratio": 1.0
    }
]