[
    {
        "title": "Formulation of anti-luck analysis of knowledge",
        "author": "Shmilosophy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n52en/formulation_of_antiluck_analysis_of_knowledge/",
        "text": "Are there any immediate objections to this proposed conceptual analysis of knowledge?\n\nS knows that p iff:\n(1) S believes that p\n(2) p is true\n(3) S believes that p for the reasons that make p true\n\nGiven a broadly correspondence approach to truth, the features of the world that make the proposition true figure into my reasons for believing the proposition. E.g., I “know” that my dad is bald because the lack of hairs on my dad’s head figure into my reasons for believing that he is bald.\n\nGettier problems seem to occur when S “luckily” believes that p, which I find plausible to interpret as S believing that p for the “wrong” reasons, i.e. for reasons other than those that make p true. For Smith who believes that “there is a cat in the field” after seeing a cat-facade (with a real cat hidden from view behind the facade), he doesn’t “know” there is a cat in the field, because his belief is accidentally true, i.e. the feature of the world that makes the proposition true (the actual cat in the field) does  not figure into Smith’s reasons for believing so.",
        "created_utc": 1678398846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are all mental state just propositional attitudes, or are the two separable?",
        "author": "LordBritannicus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n4zud/are_all_mental_state_just_propositional_attitudes/",
        "text": "I’m asking in general, but also with regard to Eliminativism materialism in particular for anyone more familiar. For example, the Churchland are Eliminativist about both, is it because the two terms are isomorphic or do they get eliminated on different grounds?",
        "created_utc": 1678398681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick Examples of internal vs external justifications in epidemiology",
        "author": "therealredding",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n4ypr/quick_examples_of_internal_vs_external/",
        "text": "So I’m caught in a rabbit hole. I was trying to get a better understanding of the Principle of Credulity and it was suggested that I read up on Phenomenal Conservatism (PC). However, it turns out that PC relies on some knowledge about Internalism and Externalism in Epistemology (I&amp;E). I just want to get through this PC article before I dive further into I&amp;E. I think I get the broad stokes idea of Internalism and Externalism, but just to be sure, I was wondering if anyone had any example of what an I&amp;E Justifications would look like in the real world.\n\nThanks in advance!",
        "created_utc": 1678398612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought Provoking but Accessible Interviews or Lectures on YouTube?",
        "author": "KillerKremling",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n47f4/thought_provoking_but_accessible_interviews_or/",
        "text": "Looking for recommendations for listening material while I travel. Don't care what it's about so long as it's captivating.",
        "created_utc": 1678396885,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do philosophers know whether we're really acting morally, and how do they give prescriptions for moral behavior?",
        "author": "SportSportManMan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n4615/how_do_philosophers_know_whether_were_really/",
        "text": "Presuming non-relative morality does exist, who's to say the most moral act isn't imposing eternal suffering on everything, and that we're moving away from this utopia in our attempts to be more moral? \n\nMany stances on morality exist, and most of them are probably wrong somewhere, so what philosophical tools can check if even a single one is right?",
        "created_utc": 1678396804,
        "upvote_ratio": 1.0
    },
    {
        "title": "what book/philosophy is like this thoughts in this book",
        "author": "Delicious-Motor8612",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n3j5o/what_bookphilosophy_is_like_this_thoughts_in_this/",
        "text": "the books name is over heaven\n\n\ni liked the philosophy in this page and was wondering what are similar to it",
        "created_utc": 1678395395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Website For Psychology &amp; Philosophy Of Science?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n2y7w/website_for_psychology_philosophy_of_science/",
        "text": "i know that some people have the [Website](https://plato.stanford.edu), but is there one for psychology or the philosophy of science?",
        "created_utc": 1678394034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any proponents psychologism?",
        "author": "Antique_Paint_5500",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n2gge/are_there_any_proponents_psychologism/",
        "text": "Are there any philosophers who have pushed back against anti-psychologism or any contemporary defenders of psychologism?",
        "created_utc": 1678392909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to mathematize Hegel's dialectic completely?",
        "author": "IvanBourbaki",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n1bst/is_it_possible_to_mathematize_hegels_dialectic/",
        "text": "  It is possible to partially mathematize Hegel's dialectic. How? Philosophy studies dialectical and metaphysical pairs of FORM-BODY, ESSENCE-PHENOMENON. But instead of concrete dialectical pairs, one can study abstract pairs A-B, C-D and state the laws of philosophy for abstract pairs.\n\nIt is possible to introduce an algebraic multiplication operation of dialectical pairs. And the result of multiplication is a double, composite pair.\n\nSummary of the results of mathematization (formalization, schematization) of philosophy.\n\nDefinitions. Philosophy is divided into Metaphysics and Dialectics.\n\nA pair of metaphysical categories is denoted by Am-Bm,Cm-Dm. Metaphysical categories are dead, permanent, unchangeable, rigid categories. We model them with constants. Metaphysical logic is a formal logic with the law of the excluded third.\n\nThe law of the metaphysical pair is stated.\n\nA pair of dialectical categories is denoted by Ad-Bd,Cd-Dd. Dialectical categories are living, variable, changing categories. We model them with functions of logical time Ad(t)-Bd(t).\n\nThe law of dialectical pair is stated.\n\nThe mathematization of philosophy does not mean the insertion of integrals into philosophy, but first of all the compression of the formulations of philosophical theorems. We will show the results of the work on the principle of determinism.\n\nFirst, we will give a classical humanitarian exposition of the principle of determinism.\n\nDeterminism. Wikipedia.\n\n\"Determinism (from Lat. determinare — \"to limit, delineate, define\") — the doctrine of the relationship and mutual certainty of all phenomena and processes \\[1\\], the doctrine of universal causality.\n\nAccording to determinism, everything that happens in the world, including the course of history and human life, is predetermined either by fate, or by gods or God (the doctrine of predestination, theological determinism), or by nature (cosmological determinism), or by human will (anthropological-ethical determinism), or by the development of society (social determinism).\n\nMany philosophical theories of determinism boil down to the idea that reality follows a predetermined path\n\nOn this basis, the understanding of freedom is determined, including the conclusion that there is essentially no place for people to choose and, accordingly, personal responsibility.\n\nIn this form, determinism can be defined as a statement according to which there is only one, precisely defined possible future.\n\nDeterminism can also be understood as fatalism. The opposite of determinism is indeterminism\\[2\\]\\[3\\].\n\nAn adherent of absolute determinism was Pierre-Simon Laplace. He postulated that if any intelligent being could find out the position and velocity of all particles in the world, it could accurately predict all the events of the universe. Subsequently, such a hypothetical creature was called the Laplace demon.\"\n\nDiscussion. We see that the humanitarian formulation of the determinism principle is very long, unclear, contains unclear passages and contradictions.\n\nA formalized (schematized) statement of the principle of determinism.\n\nLemma. The principle of determinism is described completely by a dialectical pair: CAUSE d-EFFECT d.\n\nLemma. The principle of determinism cannot be described by a metaphysical pair: CAUSE m-EFFECT m.\n\nLet's show it. There are only two options.\n\nOption 1. The theory of fatalism. Each cause (metaphysical) generates one and only one effect (metaphysical). Then we get the following chain\n\nCause1-corollary 1=Cause 2 – corollary 2=cause 3=corollary 3....\n\nBut all the categories from this chain are metaphysical, permanent, dead, constants. And this means that the chain of categories is uniquely defined. And there are no accidents in it. We have come to the theory of fatalism. According to the theory of fatalism, the fate of a person is predetermined. And if I am destined to die in a car accident in 5 years, then it is impossible to avoid death.\n\nThe first pleasant result of formalization is that the theory of fatalism is described by one metaphysical pair and its formulation is only one line.\n\nOption 2. The theory of indeterminism. Each cause (metaphysical) generates not one, but several consequences (metaphysical. The theory is unpleasant and false. According to this theory, it turns out that there are no laws of physics, mathematics. We threw the stone up. According to this theory, it turns out that once a stone will fall to the ground, and the second time it may not fall, since the law of gravity may not work.\n\nBut the nice thing is that the theory of indeterminism is also described briefly, with one formula.\n\nResults. The theory of determinism lies between the theory of fatalism and the theory of indeterminism. First, we need to fight off the theories of fatalism by introducing randomness. But we also need to fight off the theory of indeterminism by proving that randomness can generate patterns.\n\nA difficult task. We need to introduce randomness into logic, but the problem is that it needs to be introduced in a logical form. The author did it in the following form.\n\nThe principle of determinism is described not by a metaphysical, but by a dialectical CAUSE-EFFECT pair.\n\nLemma. The principle of determinism.\n\nEvery reason\n\n1. generates one and only the main consequence, which corresponds to it and exhausts it.\n\n2. And generates a set of concomitant consequences that\n\neither correspond (do not contradict), but do not exhaust,\n\nor do not correspond (contradict when combined), but exhaust.\n\nDiscussion. The introduction of concomitant consequences made it possible to introduce probability into logic, in a purely logical way.\n\nWhat about the principle of determinism in Wikipedia? The statement of the principle of determinism can be considered a fundamental statement, and the humanitarian versions can be considered consequences, or practical applications.\n\nSo is it possible to completely mathematize philosophy or dialectical logic?\n\nAnswer.\n\n1. The reduction of dialectical logic to mathematical logic takes place not literally, but in a methodological form.\n\n2. It is impossible to reduce dialectical logic to mathematical logic, because dialectics cannot be constructed deductively.\n\n3. But it is still necessary to strive for the mathematization of dialectics.\n\nMaybe one of the mathematicians –logicians would like to continue working? We need an alphabet, we need rules of inference, we need axioms and theorems.\n\nThe author pointed out the obstacles on the way to the great goal: Hegel's mathematical dialectic cannot be constructed by analogy with mathematical logic. And now I am convinced that young mathematicians – logicians will not get bumps going down such a difficult road.",
        "created_utc": 1678390278,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Ontology for Sexual Intercourse",
        "author": "rhett_mysta",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n0wl3/an_ontology_for_sexual_intercourse/",
        "text": "I would like to know what sex is. What is its purpose, and is it separable from reproduction? Is its purpose separable from immediate pleasure? Is sexual intimacy separable from emotional intimacy? Is sex intimate? Is intercourse more profound than a date over fish and wine? Does sex have a definitive purpose, and is it objectively real?\n\nI was encouraged to read *On the Meaning of Sex* by J. Budziszewski. I have yet to read it, and I was wondering if you had any recommendations. I find it important that ontology be the foundations of normative inquiry; understand what x *is* informs our work for how x should be.\n\nThanks for the help,",
        "created_utc": 1678389326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is ad hoc hypothesis something undesirable?",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n0mrk/is_ad_hoc_hypothesis_something_undesirable/",
        "text": "",
        "created_utc": 1678388697,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if Plato was here now, in modern times? How would he see our world, maybe according to his believes?",
        "author": "krismartin55",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n0k68/what_would_happen_if_plato_was_here_now_in_modern/",
        "text": "",
        "created_utc": 1678388528,
        "upvote_ratio": 1.0
    },
    {
        "title": "What might be a good double major to work alongside Philosophy?",
        "author": "HipHopConnoisseur_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n0fzz/what_might_be_a_good_double_major_to_work/",
        "text": "I already have a few prospects: \n\n- Math\n- CS\n- Physics \n- Economics\n\nI know there’s others, but these are the main ones that I’m currently looking at to decide which one works best with Philosophy (and can potentially boost job opportunities and enter grad school). CS might be my main pick, but Math and/or Physics is looking pretty good as well.",
        "created_utc": 1678388282,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is contradiction in logic?",
        "author": "Bubbly-Station2426",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n009s/what_is_contradiction_in_logic/",
        "text": "I will take antonym as an example, the antonym of cold is hot, which means not cold. But I find that \"not cold\" could be other words like \"straight\". If that's the definition of contradiction, that's way too strange. There must be something wrong.",
        "created_utc": 1678387274,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who got a degree in philosophy: is it possible to graduate and not understand philosophy?",
        "author": "Commercial-Season-79",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mzety/for_those_of_you_who_got_a_degree_in_philosophy/",
        "text": "I know one person who graduated and he doesn't seem to have learned much.\n\nIs it something that is seen often?",
        "created_utc": 1678385894,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I cite Aristotle?",
        "author": "Able-Cellist7700",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11myp5e/how_do_i_cite_aristotle/",
        "text": "In every academic paper ive read on Aristotle, they alwayse cite him like this \"(I.4 1253b35-1254a1)\" I only have access to the MIT classics copy of Aristotle's politics (which is what I want to cite), and the page number, lines, etc, are not clearly laid out in that copy.",
        "created_utc": 1678384273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help remembering the name of a concept",
        "author": "agentsporange",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11myem9/help_remembering_the_name_of_a_concept/",
        "text": "Hey all,\n\nI had an interesting discussion today and I was trying to remember the name of a concept I was explaining so I could look more into it:\n\nThe premise is that a lot of religions dictate how a person should live their lives (often in ways that limit individuality/enjoyment) in order to gain higher status in the “next life”. The philosopher argued that these religions were detrimental to the personhood of the people who engage in them.\n\nGoogling has not really been a help. Was it Nietzsche?",
        "created_utc": 1678383584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any book suggestion i could read about Moral Philosophy?",
        "author": "noneofurbiz884",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mx5s9/any_book_suggestion_i_could_read_about_moral/",
        "text": "I am new to philosophy, and it seems like it’s a whole lot of stuff. But i came across Moral Philosophy and is something I want to learn more about. Are there any books or articles you can suggest to me? Thank you!",
        "created_utc": 1678380691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophers who write about positivity in our society?",
        "author": "JoonasV2li",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mwd7u/philosophers_who_write_about_positivity_in_our/",
        "text": "I have been interested in the excessive positivity in todays society and have already read Byung Chul Hans takes on this, but I thought that maybe some of you could recommend other interesting authors/articles/books on this topic.",
        "created_utc": 1678378792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Into what philosophical context did Nietzsche write? And what made his ideas so revolutionary?",
        "author": "RealFused",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mvs4e/into_what_philosophical_context_did_nietzsche/",
        "text": "By philosophical context, I mean what was the popular consensus or schools of thought on philosophical matters? And how did Nietzsche’s work fit into this?\n\nThanks",
        "created_utc": 1678377435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"possible\" logically equivalent to \"conceivable\" or \"imaginable\" in modal logic?",
        "author": "nomenmeum",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mv5u7/is_possible_logically_equivalent_to_conceivable/",
        "text": "It seems to me that it is.",
        "created_utc": 1678375923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smiling involuntarily proves that free will does not exist",
        "author": "ForestManJ",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11muzjz/smiling_involuntarily_proves_that_free_will_does/",
        "text": "If I decide to watch a \"Try not to laugh challenge\" then why would I laugh or smile even though I understood that the purpose was to watch it and not laugh.\n\nIf I have free will then I am able to choose if I want to smile or if I do not want to smile.\n\nBut if I smile while watching a try not to laugh video then why did I smile even though I knew that I was supposed to not smile?\n\nWho smiled in this situation, was it me or was it my body?\n\nIf it was me who smiled then why did I decide to smile while knowing that I am not supposed to\n\nIf it was my body who smiled then that means that my smiling was a purely emotional reaction caused by an external source. A movement of muscles that went against my thoughts.",
        "created_utc": 1678375504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any argument for physicalism that isn't clearly question-begging?",
        "author": "Sorryforallthepoo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mujvh/is_there_any_argument_for_physicalism_that_isnt/",
        "text": "[removed]",
        "created_utc": 1678374432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is There Actually A Strand Of Philosophy Referred To As \"Irrationalism\"?",
        "author": "Lynchler",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mssn6/is_there_actually_a_strand_of_philosophy_referred/",
        "text": " I just picked up this book \"From Rationalism To Existentialism\" by Robert C. Solomon, and in the very first page is this passage:\n\n&amp;#x200B;\n\n\"Although Existentialism is often cited as the high water mark of Western irrationalism, the thesis of this book is that they are much better understood in the context of the powerful rationalist philosophies of the late eighteenth and nineteeth centuries.\"\n\n&amp;#x200B;\n\n  I've heard the term \"irrationalism\" being applied to philosophers like Nietzsche before in some online circles, usually with vague or indefinite meaning attached to it. But seeing an actual philosopher use the term, I wonder if other academics or philosophers also make use of it in referring to certain figures or movements, or if any philosophers have chosen to refer to themselves as such, and what they meant by it.   \n\n\n Thanks for your time.",
        "created_utc": 1678370088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why should a pessimistic view on human nature lead to conservative politics?",
        "author": "JCrago",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mrkco/why_should_a_pessimistic_view_on_human_nature/",
        "text": "I understand that human nature is a complicated philosophical debate, and I don't know enough about it to take a strong stance, but intuitively my views on human nature would be closer to a Hobbes, Calvin, or Epicurus than a Marx or Rousseau. But one thing I've never understood is why a pessimistic view about human nature should lead to defending a conservative political system. Especially if we're talking about a New Right or Thatcherite kind of ideology which emphasises rugged individualism and deregulated competition. To me, it's the equivalent of taking a child you know has a bullying nature and handing them a hammer before shooing them off to play with the others kids unsupervised. \n\nHere's a thought experiment to show what I mean. I think it's fair to think about shoppers at a supermarket in a Hobbesian way; they are a group of atomised individuals all of whose primary goals are fundamentally self-interested -- the acquisition of food for oneself and one's family. Yet, when you ask whether the supermarket should adopt a system of deregulated competition or one of collectivist co-operation, it seems obvious the answer should be the latter one. Left unchecked, richer and stronger shoppers will dominate the weaker and poorer ones. For example, they might shove the weak out of the way to reach the most desirable products, or they might steal out of stock products from the trolleys of the weak, or they will buy out important goods which leave others without (toilet paper, for example). \n\nNot only would such a system be cruel and unfair, but also less efficient. The inequality which the deregulated shopping space leads to does not maximise utility for the largest number, and it seems hard to think that this social contract is very desirable or much of an improvement on the state of nature in the first place. Whereas a regulated shopping space which, say, limits how many of a single product one is allowed to buy, or, say, charges rich shoppers a higher tax to bring down costs for poorer shoppers, seems a much more desirable social contract for a group of self-interested individuals. \n\nSo, why is there an assumption in political philosophy that a pessimistic view of human nature should lead to a conservative politics?",
        "created_utc": 1678366792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Philosophy rewards extreme thoroughness and overthinking ?",
        "author": "martialarts4ever",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mrbmu/does_philosophy_rewards_extreme_thoroughness_and/",
        "text": "I've been always told that I over-analyze even the *ordinary* things like personal relationships, let alone public issues.\n\nSuch comments always sounded strange to me, I act only spontaneously.\n\nI'm already a reader of Philosophy. For this I wonder does Philosophy rewards &amp; enjoys this type of characters that approaches even daily life with rigorous analysis, and simply can't enjoy not being curious, \"not caring\", and mental comfort? \nIs it a personal an attribute that can actually benefit me in Philosophy?",
        "created_utc": 1678366081,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are okay with sharing, what did you do with your Philosophy degree?",
        "author": "AllMusicNut",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mqoyu/if_you_are_okay_with_sharing_what_did_you_do_with/",
        "text": "I am studying philosophy in school and I’m looking to achieve a PhD. My dream is to be a lecturer, but I am wondering what other jobs people with degrees in philosophy my have? I’m thinking things in politics, law, marketing, or communal jobs? I’m very interested to see what else I could possibly do. Thank you for all replies!",
        "created_utc": 1678364160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Logic (as an abstract thing) part of God?",
        "author": "RobinHoodTh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mqcbc/is_logic_as_an_abstract_thing_part_of_god/",
        "text": "Assuming that God exists and also assuming that platonism is true (so abstract objects exist) what are the consequances? Recently I was thinking a lot about mathematics. I think mathematics is the most wonderful thing, because it is the language of nature. I also think that math is not a fundamental part if the Universe but math is based on logic and logic must be a fundamental part of the universe (in my opinion). Let me explain! If you declare mathematical definitions and axioms the consequences of the axioms are inevitable (even though you do not know all the consequences) . There is no alternative of the theorems that follow the axioms, so logic should be fundamental. I also do not think that it is possible that before a certain point on the timeline logic did not exist. This is why I think logic is eternal. God is also eternal by definition and created the Universe. The physical observations support that the Universe's laws are based on logic. Logic is the tool which helps us understand everything. What are the consequences of my statements? Is logic a part of God? Or is logic even more fundamental than God? I hope it is an okay question, because I am just started thinking about philosophical questions recently.",
        "created_utc": 1678363062,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some philosophical arguments for/against teleology? (Preferably with references to other philosophers)",
        "author": "NotLongForThisSite",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mpg3p/what_are_some_philosophical_arguments_foragainst/",
        "text": "It seems teleology is one of those bugaboos in philosophical discourse that one should not speak about, but why exactly? It seems intuitive to assume that something which humans create/can project a use for, that it's function is for the accomplishing of that use. Is it because some may interpret use with purpose? For example, a hammer has a use; is that use its purpose? or is it merely a social role? If the issue is that teleology infers purpose onto abstract use while disregarding its social role, is not this an issue with how humans conceive of things as extensions of themselves and thus to argue against teleology is to argue against human action? I just don't understand why teleology gets a bum wrap but maybe that's just my ignorance on the subject.",
        "created_utc": 1678359972,
        "upvote_ratio": 1.0
    },
    {
        "title": "The philosophical implications of the vast yet finite number of combinations in digital images",
        "author": "trailblazer86",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mp41k/the_philosophical_implications_of_the_vast_yet/",
        "text": " Let's consider a graphic file with a resolution of 800 x 600 pixels, which gives us 480,000 pixels. Each pixel can have approximately 16 million colors, which gives us a gigantic yet finite number of possible combinations. Among these combinations, there must be those that represent every fragment of material reality from macro to micro scale, historical events shown from all possible perspectives, the most improbable images where the only limitation is imagination, and events that will occur in the future. Does this mean that infinity is contained within a finite number of combinations? And if a sufficiently powerful computer were created, could it generate any image, showing, for example, events that have not yet occurred?",
        "created_utc": 1678358733,
        "upvote_ratio": 1.0
    },
    {
        "title": "If two people are arguing whether left-handed people exist, is that an epystemological debate?",
        "author": "sapunec8754",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mo11j/if_two_people_are_arguing_whether_lefthanded/",
        "text": "",
        "created_utc": 1678354651,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could create the world?",
        "author": "Lost-Power-8942",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mlxdb/if_you_could_create_the_world/",
        "text": "If you were someone, something that could create the world, with the good, heartwarming and kind things and yet murders, rapes and other shits happens everyday, so your creations can be happy or suffer, would you still create it?",
        "created_utc": 1678346724,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need suggestions with quotes ?",
        "author": "the_infinitegame",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mk3ti/i_need_suggestions_with_quotes/",
        "text": "Suggest a profound quote for my fathers 50yr birthday, it will be engraved behind a watch so it needs to short.",
        "created_utc": 1678340610,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some notable movements in philosophy within the last 30 years?",
        "author": "weezerdog3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mjd1j/what_are_some_notable_movements_in_philosophy/",
        "text": "Just like the early 1800's had German Idealism, the 1940's had Existentialism, and the 60's/70's had post-structuralism, are there any movements in philosophy that have evolved since the 90's? They don't have to DEFINE an era by any means (since that's kind of hard to tell while it's happening), but I was wondering if anyone abreast in the field has noticed any major defining trends.",
        "created_utc": 1678338248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deontic equivalent of the Utility Monster?",
        "author": "KortenScarlet",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mj8wj/deontic_equivalent_of_the_utility_monster/",
        "text": "Hey all. These days I find threshold deontology to be the closest representation to my moral framework that I'm aware of.\n\nI'm far from a pure utilitarian because I think utilitarianism entails some absurd reductios. One of those, proposed by Robert Nozick, is the Utility Monster thought experiment.\n\nFor those not familiar with it: if there was a creature or a monster who derived orders of magnitude more pleasure (compared to us) out of every unit of utility exchange, pure utilitarianism would entail feeding everyone and everything in the universe to that monster.\n\nI'm not a pure deontologist either, as I wouldn't refrain from sacrificing just one individual for the sake of sparing everyone else in the world from horrible torture just because I don't want to violate that individual's negative rights.\n\nBut I was wondering if there are any colorful, well-known thought experiments for such reductios of pure deontology, similar or equivalent to the Utility Monster for utilitarianism.\n\nThanks in advance for any insight.",
        "created_utc": 1678337927,
        "upvote_ratio": 1.0
    },
    {
        "title": "PLATO organization and anything related",
        "author": "TheFallenGuys",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mixsv/plato_organization_and_anything_related/",
        "text": "I am asking first, if anyone has heard of organizations that are like the PLATO organization. Organizations interested in the overlap of philosophy and highschools. \nSecondly, if anyone knows about what an organization like PLATO would desire from an educator. I am currently going into teaching public school after graduating with a B.A. in general philosophy and would hate to see that interest fall into a hobby.",
        "created_utc": 1678336993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the philosophy of Transcendentalism directly opposed to the psychological concept of Socialization?",
        "author": "planetwords",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mirxi/is_the_philosophy_of_transcendentalism_directly/",
        "text": "",
        "created_utc": 1678336513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exploring Constructivism, Ethics, and Metaethics from a Layperson's Viewpoint",
        "author": "Yahentamitsi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mikrz/exploring_constructivism_ethics_and_metaethics/",
        "text": "   \n   \n Hey everyone! So a bit of background - I'm a freshman in college trying to major in philosophy, and I'm obsessed with it. I've read some of the basic texts on ethics, like stuff from Bentham, Mill, Kant, etc., but I'm kind of unclear if my understanding of them is how they were intended or not. I've been interested in metaethical constructivism, but my biggest worry is that without any formal learning in philosophy, I won't have the skills to properly understand what I'm reading (if I dive into it).    \n   \n*TL:DR:* Should I read a bit about metaethical constructivism, or grab some books like Shafer-Landau or Cuneo and go through them first? Any advice much appreciated!",
        "created_utc": 1678335922,
        "upvote_ratio": 1.0
    },
    {
        "title": "*Experiential Properties* and *Experiential Processes* in certain process-accounts of experience",
        "author": "ImportanceOk9032",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11migmp/experiential_properties_and_experiential/",
        "text": "I'm working on a process account of experience towards a naturalistic understanding of the mind's place in the world: so, mind as emerging from a collection/composition (some relation yet to be defined) of processes. I want to distinguish my position (an account based on physical processes, according to some definition of *physical*) from the positions of some other philosophers (specifically Ian B Phillips) who, in his PhD dissertation seems to be defending the following account:\n\nIn his process account of perceptual experience, Phillips talks about the idea of *experiential properties*, where experiential is understood in the sense of phenomenal. Temporality is said to be the experiential property par excellence, and it is to be attributed to certain experiential processes. Now, my contention is that in his account of *experiential* processes, these processes cannot be *physical* processes, because his experiential processes *do not* exhibit spatial properties: they seem to exhibit purely temporal properties. They are non-spatial purely temporal processes. \n\nSo, it seems to me, these *experiential* processes are just some variant of *mental* processes and Phillips' experiential properties are just some variant of mental properties. It is important to note that Phillips explicitly distinguishes these *experiential processes* from neurological processes, so that the spatial properties of the neurological processes are *not* to be thought of as properties of experiential processes. But, then, how can these experiential processes said to be physical if they do not exist in space? At least, they cannot be concretely physical processes. But what sort of physical particular can be said to have temporal properties but not spatial properties? And indeed no other known properties other than temporal? Isn't it that these processes cannot be physical, but simply some variant of mental? And the corresponding *experiential properties* are simply some variant of mental property? That is to say, isn't it the case that such an account must subscribe to either substance or property dualism?",
        "created_utc": 1678335574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do many (or any) philosophers outside of Kant accept the Categorical Imperative as being a true test of the morality of an action?",
        "author": "idealbarandgrill",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11micxt/do_many_or_any_philosophers_outside_of_kant/",
        "text": "Do many other well-regarded philosophers accept that acting “only according to that maxim through which you can at the same time will that it become a universal law” is a requisite for acting morally?\n\nThanks in advance",
        "created_utc": 1678335271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Carl Schmitt read Walter Benjamin?",
        "author": "xgettes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mhxyo/did_carl_schmitt_read_walter_benjamin/",
        "text": "Does anyone know if Carl Schmitt ever directly engaged with Benjamin's work? I know that Benjamin pulled from Schmitt, and I know that Agamben argued that Schmitt's *Political Theology* can be read as a response to Benjamin's *Critique of Violence...* But do we have any historical or textual evidence that Schmitt *actually* read Benjamin?",
        "created_utc": 1678334063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Variant of preference utilitarianism which considers some preferences invalid?",
        "author": "zaxqs",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mh22t/variant_of_preference_utilitarianism_which/",
        "text": "Like the title says, I'm looking for some school of thought which takes a generally preference utilitarian approach to ethics, but which believes in some kind of principled disvaluation or invalidation of certain kinds of preferences (in particular sadistic or controlling preferences) to avoid pitfalls such as the 1000 sadists problem (Where 1000, or some suitably large number, of sadists' preference for somebody to be tortured wins out against that person's preference not to be tortured)\n\nWhen I search for views like this I seem to run into the assumption that utilitarianism presupposes some object-level ethical stance such as maximizing happiness or preference-satisfaction. But utilitarianism is a meta-ethical position, not an ethical one, and a utilitarian could theoretically advocate any utility function.\n\nUtilitarians can potentially incorporate any number of values usually considered non-utilitarian, such as human rights, as long as their value of these things is consequentialist in nature and comeasurable with other values. I just wonder if there are any utilitarian groups or writers which take this into account.",
        "created_utc": 1678331550,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does human generalize the abstract concept out of concrete example?",
        "author": "Bubbly-Station2426",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mfyiw/how_does_human_generalize_the_abstract_concept/",
        "text": "    To elaborate, I would like to take the defintion of square as example, the square is shape with four equal sides, while we can not directly see it. What we see is square with four 10 inches sides or other sizes. That means it is impossible to imagine what a general square look like. I think this conclusion is against common sense, however, I cannot figure out where I am wrong.",
        "created_utc": 1678328546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there unenforceable moral obligations/prohibitions?",
        "author": "AprioriTori",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mfn2p/are_there_unenforceable_moral/",
        "text": "Normally, when we think of morally obligatory actions or morally prohibited ones, we generally think that it is justified to use some degree of force to compel or prevent those actions. It’s generally agreed that it’s permissible to act in self-defense or expose a nefarious deception. But I’m curious if there are any resources about where we think something is morally wrong or obligatory, but which would not be justified to enforce. As an example, we might believe a thief to have a moral obligation to repay his victims, but requiring him to work and give the money he earns to his victims seems tantamount to slavery.",
        "created_utc": 1678327682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Habermas's public sphere and ideology",
        "author": "browniebaby_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mf1fd/habermass_public_sphere_and_ideology/",
        "text": "Can someone explain what does habermas mean when he claimed that the public sphere might be ideological but it is not mere ideology? Ideology in what sense that he was talking about? Sounds confusing because I thought he insisted on the neutrality of the public sphere. Thanks!",
        "created_utc": 1678326059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has any philosopher ever taken DMT?",
        "author": "ayez17",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mdypn/has_any_philosopher_ever_taken_dmt/",
        "text": "And is there philosophers that have researched DMT or psychedelics in general?",
        "created_utc": 1678323268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defeasibility condition and Gettier",
        "author": "_pudding-and-pie_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11md663/defeasibility_condition_and_gettier/",
        "text": "Hi, I'm currently trying to wrap my head around the idea of defeasibility as a response to Gettier. So Gettier said Justified True Belief is not sufficient for a claim to knowledge because you can have JTB without having knowledge, and defeasibility tries to amend JTB by saying if your justification has no statement defeating your justification you have knowledge. For anyone who knows this subject better than me, can you tell me if my argument is? \n\nBasically my argument is that this condition is too strong. So there are misleading truths that could defeat your justification. So then what counts as a justification? Would that mean we would have to find all true statements out there in order to justify your belief? That would be impossible... does this counterargument hold? Are there better ones out there?",
        "created_utc": 1678321242,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI and authorship",
        "author": "dungeonkrawling",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mbz0y/ai_and_authorship/",
        "text": "Suppose someone enters a prompt which causes a Generative AI to produce some human-like text. Who is the direct author of the text?   \n\n\nIt's certainly not the human behind the AI, since he only entered the relevant prompt (perhaps he can be considered the author in an indirect sense). The AI has been trained to produce human-like texts based on texts written by actual humans, but it's not obvious that these humans should be considered the authors, not even in a indirect sense. So the natural answer would be that the AI is the author. But does it make sense to attribute authorship status to an AI?   \n\n\nMy brute intuition is that it doesn't, although I haven't exatcly developed reasons to back it up. One argument would state that an author is necessarily a phenomenally conscious person capable of having intentional mental states and that AIs are at least incapable of having phemonenal consciousness (which may or may not be a necessary condition for intentional states to exist), leading to the conclusion that they can't be authors. I'm not sure if I'm fully convinced by this, but it is one line of argument.  \n\n\nIn any case, suppose none of the above options counts as the author of the text, and that they are exhaustive. We are lead to conclude that text is authorless, which to me would be a surprising conclusion if the argument is correct. Note that this also seems to apply to other AI-genereated media, such as musical pieces and visual artworks.  \n\n\nHas anyone recently considered these questions, and what do you guys think of them?",
        "created_utc": 1678318330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a word or established definition for this?",
        "author": "Waste-Equal343",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mbv3s/is_there_a_word_or_established_definition_for_this/",
        "text": "I’m trying to find the words to describe how I feel about the capitalist system and i think there might already be a word for it. What is it called when you are anti capitalist, but still comply with the system so that you can afford to live. As I’ve seen, there are many different forms of resistance to capitalism but what is it called when you don’t like it, but still need to work so that you can eat. \n\nIm sure there’s a word for it and im pretty sure I’ve heard it before but I don’t remember what it is.\n\nThanks",
        "created_utc": 1678318079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frege's On Concept and Object",
        "author": "sparrowofstfrancis",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11mb8c9/freges_on_concept_and_object/",
        "text": "What would Frege say about a sentence such as 'a human is a biped'? If I'm understanding him correctly, an object is preceded by a definite article ('the') and a concept by an indefinite article ('a', 'an'). Concepts are predicative by nature and objects are not. So in the sentence 'a human is a biped', do the first two words--i.e. 'a human'--signify a concept or an object? Can you predicate a concept of a concept? Thank you!",
        "created_utc": 1678316627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Time Travel into the Past Metaphysically Possible?",
        "author": "JJEvans1999",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11maq5h/is_time_travel_into_the_past_metaphysically/",
        "text": "Time travel is a very popular idea nowadays and plays a prominent role in sci-fi literature. However, this idea has also become more popular in physics and philosophy. I am mainly interested in time travel into the past. From my reading so far, many physicists believe time travel into the past is at least scientifically possible as many argue that Einstein’s relativity has shown this (I believe Gödel also mathematically proved that time travel into the past is possible). I am not just interested in whether time travel into the past is scientifically or technologically possible (even though it is interesting to see what both general relativity and quantum mechanics can help reveal in this area of inquiry), but whether time travel into the past is actually metaphysically possible. I actually feel like this area of philosophy of time is sometimes neglected. \n\nSome of the arguments I have heard used against time travel into the past include metaphysical paradoxes such as closed causal loops (bootstrap paradox and predestination paradox), the grandfather paradox, bilking (backward causation), Polchinski’s Paradox etc. I am wondering though whether these arguments are really successful in showing that time travel into the past is possible or not. I am also wondering is there a near-consensus amongst philosophers on whether time travel into the past is metaphysically possible. \n\nI also think it is important to mention some key concepts as context for this issue of time travel into the past. These were some of my personal observations that I think is important before debating this question: \n\n*1: Time, unlike space, does seem to have a distinguished direction:*\n\nA) We only go forward in time, not back.\n\nB) We cannot alter the past. We can alter the future.\n\nC)Our knowledge of the past the future is very different.\n\nSo, intuitively, time does seem to have a direction. It is also appears to asymmetrical. But is time really asymmetrical?\n\n*2: Different views within metaphysics about the status of past, present and future*\n\nA) Past and present exist. Future does not. Known as Growing Block Theory (A-Theory of Time). \n\nB) Past, present and future all exist. Known as Eternalism (B-Theory of Time)\n\nC) Only the present exists. Known as Presentism (A-Theory of Time) \n\n(A) Is most compatible with an asymmetrical understanding of time.\n\n*3: Two arguments for thinking that time has a direction*\n\nA) The second law of thermodynamics — The universe is evolving from a highly ordered state to a highly disordered state. This explains the direction of time.\n\nB) Causation — Causes do not occur after their effects. The asymmetry of causation allows us to justify the claim that time is asymmetrical. But is it really the case that causes cannot occur after their effects?\n\n*4: Backwards causation and time travel*\n\nA) If we could travel back in time and alter the past, this would mean that causes could occur after their effects.\n\nB) Time travel is physically possibly if our universe is shaped in a certain way (which we have yet to establish). But is time travel metaphysically possible? Admitting travel back in time would arguably lead to paradoxical cases (as I mentioned earlier), and these arguably demonstrate that time travel is not metaphysically possible.\n\n/ So, does the notion of time travel into the past make sense? Is time travel into the past metaphysically possible? Thanks 🙏 /",
        "created_utc": 1678315496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone say what Hume is trying to make clear here?",
        "author": "thomasvanelk1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11maokz/can_anyone_say_what_hume_is_trying_to_make_clear/",
        "text": "\nWe need to answer 3 questions (ca. 300 words) about Hume’s enquiry concerning human understanding. \n\nI have answered 2 already, but im stuck with one, it starts with this line from hume:\n\n“To endeauvour, therefore, the proof of this last supposition by probable arguments, or arguments regarding existence, must be evidently going in a circoe, and taking that for granted, which is the very point in question” (E, IV.19)\n\nThe question goes like this:\nHume identifies a circularity here when we try to argue for the simularity between past and future. Give the structure of the argument and ineicate where the circularity occurs. Does hume resolve the circularity? Argue why or why not?\n\nI don’t want anyone to do the work for me btw! It’s my first year at uni and i am having trouble understanding this particular question.",
        "created_utc": 1678315391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone say what Hume is trying to make clear here?",
        "author": "ilovefrozenpizzas",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11majxz/can_anyone_say_what_hume_is_trying_to_make_clear/",
        "text": "[removed]",
        "created_utc": 1678315090,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you didn’t have a choice to be born, then why is it so frown upon to want to end your life?",
        "author": "Dreamoneer",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m9v74/if_you_didnt_have_a_choice_to_be_born_then_why_is/",
        "text": "",
        "created_utc": 1678313521,
        "upvote_ratio": 1.0
    },
    {
        "title": "would Kantian ethics suggest that doing anything bad in order to get a good result is bad?",
        "author": "KXVQ",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m9eb7/would_kantian_ethics_suggest_that_doing_anything/",
        "text": "i don’t know too much about philosophy so don’t roast me too hard. but i’ve been checking out Kantian ethics recently and one of the things i’ve been paying the most attention to is how it doesn’t seem to care about the results of the actions someone takes (i think that’s the difference between deontological and consequentialist ethics?) but does that mean that with this philosophy, someone would never do a bad thing, even if the result was good? for example, if a supervillain were to approach someone and say “lie to me, or else i’ll kill a bunch of orphaned babies”, it seems like most people would choose to lie in order to save the babies. but it seems like Kant sees lying as a big no-no, so would he refuse to lie, resulting in the orphans deaths? this question is pretty rambly and also multiple questions at once so sorry and thank you to anyone trying to decipher this.",
        "created_utc": 1678312429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of Aesthetics / Beauty that seems congruent with Indirect Realism or Transcendental Idealism?",
        "author": "Complete-Ad5058",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m9alr/philosophy_of_aesthetics_beauty_that_seems/",
        "text": "What is a theory of Aesthetics that aligns with the view of either the Indirect Realists or Transcendental Idealists? \n\nOr perhaps I should ask which IR’s or TI’s have put forward aesthetic philosophies? \nI guess Schopenhauer’s ‘On Vision and Colour’ is one? \n\nDoes Kant himself put forward a theory or idea regarding Aesthetics in any of his Critiques or smaller works?",
        "created_utc": 1678312183,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find girlfriend that loves reasoning and thinking?",
        "author": "Better_be_tom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m99hj/how_to_find_girlfriend_that_loves_reasoning_and/",
        "text": "I’m 30 years old, I’m from Ukraine. I don’t have problems in searching girls, but they are just normal and I want to have a girl that not only have a good character but girl that want to find a Truth with me. What are the best places to find such girls, if they’re exist?",
        "created_utc": 1678312107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would this make you a happier person?",
        "author": "Far_Organization_610",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m97nn/would_this_make_you_a_happier_person/",
        "text": "Imagine you take a toddler who doesn't have any idea about death and you explain him/her how the average age to die is 30/40, would this make them happier?\n\n At the start, they may feel worse seeing that their life is really short, but that would probably help them get more things done and I feel like there is a chance that they are happier than a person who knows the truth.",
        "created_utc": 1678311985,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you prove that money buys happiness via hypothetical syllogism?",
        "author": "Ok_Advantage_324",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m8y83/can_you_prove_that_money_buys_happiness_via/",
        "text": "so I have:   \nP = I have money\n\nV = I can go on a vacation\n\nH = I am happy\n\n&amp;#x200B;\n\nP --&gt; V and V --&gt; H, then P --&gt; H\n\nif money can buy you a vacation and being on vacation makes you happy, then doesn't money buy you happiness?\n\n&amp;#x200B;\n\nthis is probably very dumb lol",
        "created_utc": 1678311370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any difference between individual thought and thought based on the assumption of objective meaning?",
        "author": "_-_-_-____--",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m8roh/is_there_any_difference_between_individual/",
        "text": "Say you have two individuals, the first one is a strong naturalist, and refuses to believe in anything without empirical justification, they base their thoughts, knowledge and belief purely on empirical evidence and reason. The other believes in an objective meaning that cannot be proven with empirical evidence (for example the belief in god) and allows that assumption of objective meaning to influence their thoughts. \n\nIs there anything more to the free uninfluenced thought of the naturalist compared to the thought of the individual influenced by an empirically unjustified objective meaning?",
        "created_utc": 1678310956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Catholics who are Hegel influenced theologians or Philosophers?",
        "author": "YoungHegel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m8hqo/any_catholics_who_are_hegel_influenced/",
        "text": "",
        "created_utc": 1678310317,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does John Locke’s views of slavery change in his lifetime? What were Locke’s views of slavery as a punishment for violent crimes?",
        "author": "SideOneDummy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m8aaa/how_does_john_lockes_views_of_slavery_change_in/",
        "text": "Do his views of slavery through incarceration contradict the inalienable rights of man of which he stipulates for in his Second Treatise?  Does an older John Locke attempt at reconciling earlier beliefs and his holdings in the Royal African Company?  \n\nWhat are possible misinterpretations of Locke’s moral and/or political philosophy regarding slavery, and what are common parochial interpretations that lack context?",
        "created_utc": 1678309852,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did Diogenes provide to the world of philosophy?",
        "author": "gilbobrah",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m71ga/what_did_diogenes_provide_to_the_world_of/",
        "text": "Other than doing a lot of silly things, is he/the stories of him to be taken seriously and what can we actually learn from him?",
        "created_utc": 1678306978,
        "upvote_ratio": 1.0
    },
    {
        "title": "If pirating a movie/game/book is immoral, is lending a book or a movie to your friends immoral too?",
        "author": "just_arandomrussian",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m6x3q/if_pirating_a_moviegamebook_is_immoral_is_lending/",
        "text": "",
        "created_utc": 1678306702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics and the limits of philosophy",
        "author": "Creative_Engineer_23",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m65kv/ethics_and_the_limits_of_philosophy/",
        "text": "Can anyone recommend an entry point to Bernard Williams' *Ethics and the Limits of Philosophy?* I don't have the time to read it right now, but I want to get acquainted with his arguments (I think I share his intuition about the impossibility of a single, unified ethics)",
        "created_utc": 1678305031,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the novel Sophie's Choice regarded as an example of a philosophical fiction?",
        "author": "jlenders",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m5gn0/how_is_the_novel_sophies_choice_regarded_as_an/",
        "text": "I am currently working on my own novel that I hope to get published one day. I want to my novel to incorporate many different philosophical elements such as existentialism, logic, truth, language, personal identity, metaphysics and reality. But I am looking for a novel that is positively regarded as a \"philosophical fiction\" or a \"philosophical novel\". I believe Styron's *Sophie's Choice* is regarded positively as a novel that does an excellent job of engaging with key philosophical ideas. Is this true? And if Styron's novel is such an example - what might be other examples of philosophical fiction?",
        "created_utc": 1678303483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a framework that draws a clear distinction between necessity and good?",
        "author": "Daviso452",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m4wcd/is_there_a_framework_that_draws_a_clear/",
        "text": "I currently see a great distinction between the two but do not know of any literature or frameworks to reference or whether one even exists (though I assume one does).\n\nTo be more specific, is there a framework that would see protecting yourself from an assailant, finding a cure for a disease, or stopping a child from eating candy for their health as preventing greater evils but not inherently good because they require something bad to be present?\n\nAs a reverse example, is there a framework that proposes that good is only that which improves upon good or neutral, but not prevent or reduce something bad? \n\nI hope I've properly conveyed what I am searching for, and if not, please let me know so I can clarify!",
        "created_utc": 1678302226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is “The Complete Plato Plato (Translator: Benjamin Jowett)” that’s $1.99 on Apple Books a Good Translation?",
        "author": "Callcenterclown",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m4kdx/is_the_complete_plato_plato_translator_benjamin/",
        "text": "I am starting to read plato and this was recommended but I am little skeptical about the translation.",
        "created_utc": 1678301490,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Philosophy?",
        "author": "nomological",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m40gj/what_is_philosophy/",
        "text": "I'm curious to hear any well-formulated definitions of what is philosophy. I wouldn't object to hearing any thoughtful poetic stabs at a definition, for example, I'm keen on the description of philosophy as the \"art of understanding.\" However, I think for the sake of creating any in-depth discussion, the more clearly made the argument for a definition, the better.\n\nI'm particularly curious to hear arguments on whether we can defend the notion that \"philosophy\" is equivalent to the body of work that is generated within (modern) academic philosophy, and whether you think that is an overly reductive take on the discipline (practice, field of study, body of work, etc.), or not.\n\nI think looming in the background, is the potentially dispositive and adjacent question, \"What is a philosopher?\"\n\nObviously, there are different senses of the word, so again, more robust definitions are most welcome, over say, arguing over the various sense and use that the largely uniformed general public may employ with respect to the meaning.",
        "created_utc": 1678300220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the course by Prof David Bonevac a good choice for beginners?",
        "author": "caliber135",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m3mtn/is_the_course_by_prof_david_bonevac_a_good_choice/",
        "text": "https://www.youtube.com/playlist?list=PLzWd5Ny3vW3TmAbJH3fYMRjNUptY0uPW8\n\nhttps://www.youtube.com/playlist?list=PLzWd5Ny3vW3R_1YqkqneW99MaJvmYXg11\n\n\nSo far I've gathered that discussion is important in learning philosophy other than forcing through the primary sources themselves. I'm studying alone i.e. not in an environment with such discussions available, so I figured lectures would be a valid replacement for spotaneous discussion. \n\nI was wondering if Prof David Bonevac is a good resource for beginners, other than the podcast Hi-Phi Nation recommended around here and a YouTube channel Theory &amp; Philosophy I encountered. \n\nCan someone elaborate on what the Analytic School is?\n\nAlso, it'd be great to recommend study guide and video/blog resources which focuses on discussion of texts. Many thanks in advance.",
        "created_utc": 1678299352,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Forgiveness?",
        "author": "BlueBird1523",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m2lpc/what_is_forgiveness/",
        "text": " I find forgiveness to be a really confusing concept and whenever I try to discuss it with people, they repeat a cliché platitude with Christian undertones. I hear it's supposed to feel freeing, but that isn't how I would describe my experiences.\n\n&amp;#x200B;\n\n* Sometimes forgiveness feels like self betrayal and a moral betrayal.\n* Sometimes forgiveness feels like indifference.\n* Sometimes it feels like the decision to continue loving.\n* Sometimes forgiveness feels like a societal and familial manipulation.\n* I don't think forgiveness is synonymous with moving on because forgiveness doesn't equal forgetting. In fact, I've seen many people use forgiveness as a way to avoid moving on and staying in the same stuck relationships.\n* Does an absence of hate qualify as forgiveness?\n* Is forgiveness an umbrella term for other, more complicated, feelings: nostalgia, love, regret, sadness, disillusionment, connectedness, empathy, levity?\n* Is forgiveness always related to suppressing feelings and memories?\n* Is forgiveness a feeling? What does it feel like in the body?\n* Is forgiveness always a fleeting/active emotion? Do you always have to re-forgive constantly after someone has wronged you?\n* Is it just a way to make peace with death and the finite nature of things?\n* \"For if you forgive men their trespasses, your heavenly Father will also forgive you.\" ...okay, but what if I don't forgive god? Also, I thought forgiveness wasn't supposed to have those sort of terms attached?\n\nThere's a famous holocaust survivor who spoke about forgiveness as self-liberation. She gets a lot of pushback from other survivors who disagree with this approach. I have never felt liberated by forgiving someone, despite years of effort, but I often debate both sides of her perspective in my head.\n\nSo anyway, any thoughts or reading you have on the subject would be appreciated. I've been confused about this topic since I was a teenager and I recently pissed off a friend who was arguing the spiritual importance of forgiveness.",
        "created_utc": 1678297016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attempt on consciousness and death",
        "author": "ChemicalSome3901",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m20vi/attempt_on_consciousness_and_death/",
        "text": "Hi all, I would like to share a few thoughts about consciousness and death, as I've been thinking about it for some time, but not sure where it is getting me. Also I am not a philosopher so please don't judge me too harshly if none of this makes any sense. Here goes:Even though we cannot know for certain what happens after we die, there are a few things that are certain. First of all, the time goes on for the ones around us, but for the one person that died time has no meaning, it flies instantly. So what now, are we in the same spot as when the universe was first created? If there could be an independent observer at that point, he could agree that chances for being born then are the same as chances for being born now (after we died). I believe there is common agreement that tremendous amount of things had to go the right way for life to happen in the first place and for each of us to be here. Yet we are. Only 13.8 billion years from the big bang. With that logic in mind, isn't it actually likely that we will be born again, considering the universe is not going to end anytime soon and not to even dive into repeating universe theories etc. \nSo, say that person who died, gets born again, he would not have a memory of his previous experience. From that point of view, death would look like this: final dying moment comes and in the next one we are a baby again (maybe a baby ant or kangoroo for all we know since we don't understand the reason behind having this particular consciousness of our \"current\" body over being anything else). And there would be no way to prove it either. What are your thoughts on all this, is it worth thinking in that (general) direction at all?",
        "created_utc": 1678295713,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is dark ecology (for you)?",
        "author": "Arendvdk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m1sg8/what_is_dark_ecology_for_you/",
        "text": "Hello everyone, I am engaged in Dark Ecology by Timothy Morton. Since I feel there is no clear definition for the term 'dark ecology', I was wondering what you people think it describes?\n\nI allude to a way of understanding ecology in a sense that acknowledges its 'dark' sides (e.g. catastrophes are part of it). \n\nEven as I try to come up with a slim definition, I feel the need to elaborate further and further. Anyway, am curious to hear your explanations/definitions!",
        "created_utc": 1678295175,
        "upvote_ratio": 1.0
    },
    {
        "title": "If racism, sexism, bigotry in general are metaphysical problems, can you ever truly disprove a bigot/ bigots position?",
        "author": "da_real_MassacREEE",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m1sbz/if_racism_sexism_bigotry_in_general_are/",
        "text": "I’m making an assumption here that I think is valid viz bigotry is essentially a metaphysical position. I’m conversing my cousin who is an incel for some time now and i think there is no such thing to disprove him at the level of facts, a fact that might indicate the women have way more in common in their humanity with men than their women hood itself(and even women hood itself might not reflect the “true essence” of women but social conditioning by patriarchal structures). So facts like women and mens similarity in IQs, debunking the fact that women aren’t wired to be attracted to the dark triad traits( because men too are attracted to it), hypergamy being more societal, etc, are all dismissed and almost reappropriated to further his sexist attitude as being simply not reflecting their true nature. So my questions are:\n1. how can you actually start an metaphysical investigation to find the essence of something without being blinded by the contingent properties of that thing? sort of an aristotelian position \n2. is there way of actually dismissing bigotry beyond the facts?(because facts, as seen above, can be reappropriated to further bigotry) \n3. any books on the subjects? i liked Sartres Anti-Semite and Jew",
        "created_utc": 1678295168,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between consequentialism and effective altruism?",
        "author": "bbear122",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m1fxh/whats_the_difference_between_consequentialism_and/",
        "text": "",
        "created_utc": 1678294411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start with Japanese philosophy? Who were the most influential Japanese philosophers?",
        "author": "_Uhtceare_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m1eas/where_to_start_with_japanese_philosophy_who_were/",
        "text": "",
        "created_utc": 1678294306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding the practical ethics of choosing a career: To what extent is it morally justifiable to work towards goals that one actively disagrees with for moral, political, topical, etc. reasons?",
        "author": "Yaxoi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11m0aw1/regarding_the_practical_ethics_of_choosing_a/",
        "text": "This is more of a practical philosophy question:\n\nWe all face perpetual moral dilemmas. We might intellectually agree with certain arguments about what is good or ethical (e.g. on eating meat, protecting the climate, political ideals, religion, ...). \n\nHowever, rather than conforming to these beliefs in all parts of our life, we choose to accept a certain degree of cognitive and moral dissonance in favour of security, stability, wealth, comfort, ...\n\nOne important dimension of this is arguably choice of career. For each individual there are few ways of leaving a bigger mark on the world than through the sum of their professional work throughout their work life .\n\nThus the choice of career this is a question of morality.\n\nSo, is there a philosophical break-even-point that we can identify to decide whether general ethics or personal moral/political/... principles should factor into professional decisions? \n\nTo which degree is it acceptable to work for an employer or towards subject-matter goals that oppose your personal world view? \n\nIs it ethically worse to facilitate goals you disagree with vs. to facilitate the same golas out of true conviction?\n\nI.e., is hypocrisy inherently immortal?",
        "created_utc": 1678291816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a well-painted apple a poorly-painted orange?",
        "author": "AdministrativeLet996",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lzqk7/is_a_wellpainted_apple_a_poorlypainted_orange/",
        "text": "When you paint a picture of an apple, is it equivalent to a poorly painted picture of an orange? Or to be more abstract, is the successful execution of one action a poor execution of another?",
        "created_utc": 1678290536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is solipsism unavoidable?",
        "author": "RealFused",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lzemm/is_solipsism_unavoidable/",
        "text": "It seems to me that any inquiry as to the nature of my mind and other minds always finds it impossible to avoid the solipsist view.\n\nA dualist view places the mind outside the physical realm and as such I have no way to verify the existence of other minds on a physical level but at the same time the materialist view also seems to be unable to explain how it’s even conceivable for me to know of other’s qualia. \n\nIf I were to directly experience someone else’s qualia, surely I must actually have to be them in a literal sense. As if I have my own frame of separate judgement of the qualia that they don’t, doesn’t this change the thing experienced itself? (as they are not identical?)\n\nIt seems like an unavoidable trap. But I was wondering if there were any compelling arguments out of it that could almost ‘prove’ other minds and if not at least suggest they are extremely probable to exist. Thanks",
        "created_utc": 1678289741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is materialism so popular in spite of hard problem of consciousness?",
        "author": "paxxx17",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lz5tw/why_is_materialism_so_popular_in_spite_of_hard/",
        "text": "I'm a physicist without any formal education in philosophy. In my particular field, we're using quantum mechanics (namely Density Functional Theory) to model materials and describe their properties. From a theoretical perspective, it is possible to model an arbitrarily complex system starting from first principles. In principle, we could even model the human brain using known physics. \n\nOf course, modeling the brain would come at a huge computational cost and is impossible in practice. Nevertheless, one should still find it conceivable that such a model could predict certain processes in the brain that lead to various behavior of humans.\n\nWhat is utterly inconceivable to me is how such a model could ever predict the subjective experience itself, i.e., the emergence of consciousness. I just don't see how the subjective experience could ever arise from physical processes as we know them. \n\nIn spite of this, materialism is the most popular view among philosophers nowadays according to the polls.\n\nSo, what am I missing?",
        "created_utc": 1678289160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is Alice?",
        "author": "smartwork00001",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lyo6o/who_is_alice/",
        "text": " If a person (say Alice) lost a limb and we replaced it with a prosthetic, Alice remains Alice, if part of Alice's brain is removed for some reason, Alice is still Alice. If Alice forgets her memories, she is still Alice. If Alice had an accident and it changed her personality, Alice is still Alice? If Alice changes her social connections and a different set of people recognize her as Alice, she is still Alice. So who is Alice? Is Alice the mind or the body? Is Alice the entity that everybody recognizes as Alice? What would have to change for us to not consider Alice as Alice anymore?",
        "created_utc": 1678287995,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to read Aristotle's Rhetoric",
        "author": "URL14",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lyjqz/how_to_read_aristotles_rhetoric/",
        "text": "Hello! I'm new here and I'm new to reading philosophy books too. I read Meditations of  Marcus Aurelius, Descartes and some Plato's Dialogues and I liked them a lot.  \nNow I am trying to read Aristotle's Rhetoric and it's not that easy.  \n**I want to know if there are texts that I should read first to make it easier, or if it's just going be hard and I have to put up with it.**  \nI also found some youtube videos that do a guided reading, so maybe I should give that a try.  \n\n\nI'm sorry if my english isn't that good.",
        "created_utc": 1678287701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy Taught in Schools?",
        "author": "Vuki17",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lxz4d/philosophy_taught_in_schools/",
        "text": "I wanted to hear people’s opinions on whether or not they think philosophy will ever be able to be taught in high schools or even potentially middle schools as a subject. I think it would be an amazing thing in principal, but I imagine that it would be too hard to establish philosophy as a distinct and respected field in these levels of education. I live in the US, so I can only speak for my experience here, but I know there are other countries that have philosophy as an established subject that is taught in schools, not just universities. The main problem that I see coming about is the political nature of the subject. Yes, it would probably be possible to have logic taught in schools as that is pretty non-political to most people, but I feel that any other set of thinkers would be challenging. Parents of students would find countless ways to complain about what is being taught. “We do not want these philosophers taught because they are anti-Christian / atheists.” “These political philosophers are leftist propaganda / Those philosophers are all racist, right-wing extremists.” “These philosophers are post-modern / neo-Marxists.” “Those philosophers are old-white men who advocate for the status quo.” These are just some things that I would imagine people would say about philosophy being taught in schools.  When it comes to people’s children. They get crazy about what is being taught to them. The only way that I can think about this being digestible is if you frame it from a historical perspective and say that we are just teaching philosophy as a history of ideas for the students to be exposed too, but even this seems like it will be a problem. Who would get to decide the curriculum. I imagine that it would be a very political issue in this case, and that it might change drastically depending on who is in office. Anyway, I am curious of people’s thought because I do think philosophy should be taught in schools, but I am not sure how this would be approved in the first place, let alone implemented and taught.",
        "created_utc": 1678286263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I right or just depressed",
        "author": "sugerbaby_wannabe",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lxutr/am_i_right_or_just_depressed/",
        "text": "I read this quote:\"Your worst sin is that you have destroyed and betrayed yourself for nothing.\"\n-Fyodor Dostoyevsky\n\nIt got me thinking\n\nI did myself so wrong I forgot I was a person worthy of kindness and compassion, my pain isn't worth any less than any other human being, I make mistakes, learn and do better.\n\nI find myself thinking that since I'm gonna die anyway my experiences and quality of life doesn't hold value, I'm gonna die anyway why is suffering so horrible I'm gonna die and forget it and be forgotten anyway, my brain tells me since pain is temporary cuz life is temporary therefore it doesn't matter.\n\nAm I right, depressed or both?",
        "created_utc": 1678285951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the correspondence theory of truth contradictory?",
        "author": "TheCosmosIsAnEyelid",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lxn74/is_the_correspondence_theory_of_truth/",
        "text": "I came across [an interesting article](https://www.jstor.org/stable/20128008) by the scholastic philosopher Barry Miller where he criticizes the correspondence theory of truth from a realist point of view, which is rare and interesting: for him, this theory is *\"realism gone wrong\"*, and we are mistaken to take Plato, Aristotle, etc., as supporters of it.\n\nAnyway, he formulates an argument against it that I find interesting, I will rephrase it in my words (I refer to the article for a better exposition, p.292):\n\nThe main problem in his eyes is that the correspondence theory of truth makes truth relational, and therefore undermines itself. In the correspondence theory of truth, a proposition S is true if and only if it corresponds to a state of affairs F. There are therefore three steps, or three elements: the proposition, the state of affairs, and the correspondence between the two, which allows us to judge or not the truth of the proposition S.\n\nLet's start with this example: I have a proposition S that describes F, which I consider true because it corresponds to the state of affairs F.\n\nBut here is the problem: how do we know that the proposition S corresponds to the state of affairs F? This is the same as saying the proposition : \n\n**(S corresponds to F) is true**\n\nExcept that in the correspondence theory of truth, this proposition can only be true if it corresponds to a state of affairs, which amounts to saying the proposition :\n\n**((S corresponds to F) corresponds to F') is true**\n\nBut for this to be true, the proposition must correspond to a state of affairs, which is the same as saying :\n\n**(((S corresponds to F) corresponds to F') corresponds to F\") is true**\n\nEtc, you see that we are now embarked on a vicious regress. There seems to be a real problem with making truth relational.\n\nWhat do you think of this argument?",
        "created_utc": 1678285375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can reasoning count as experience?",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lw5ry/can_reasoning_count_as_experience/",
        "text": "You have a goal and you are thinking, and using logic to arrive at the steps you need to take to succeed. Or your friend tells you a problem or a philosophical question that you want/need to answer. **When you are thinking, isn't it an experience too?**\n\nMaybe you would be more inclined to see 'thinking' and 'reasoning' as experience if you see that there are tons of moments where you don't consciously think but you experience, this time with your senses. There is a distinction between thinking and not thinking. When you are thinking and using logic you are in a state of focus, or in a state of - difficult to describe - flow where you don't do anything and you implicitly reason without much focus like taking the pieces of information your implicit (unconscious) system brought and piece it easily together. This is a mental and physical state you are in so why can't it be considered an experience? \n\n*Plus*, thinking could be said to be an experience because it arrives with its own behavior: you stare at a wall or moving your leg quickly or touching your hair (body language): this helps establish it further as an experience since all experiences have the body language component in them.\n\n**So, has this idea been proposed before?**",
        "created_utc": 1678281416,
        "upvote_ratio": 0.99
    },
    {
        "title": "Hey guys wanna talk with you about this:",
        "author": "Therealandonepeter",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lun6o/hey_guys_wanna_talk_with_you_about_this/",
        "text": "I am from Germany and we have an alternative to the subject religion in school called ethic. It’s generally philosophy and other morale and stuff. I am 18 years old so you can seriously talk with me about this topic. Anyways so my teacher states that morale is an objective opinion but I think, my classmates too, that morale is a way more subjective manner. People have different kind of morales. Like Europeans and Americans, Asians etc. even inside of Europe people have different opinions about what to do and not to do. What do you guys think about that?",
        "created_utc": 1678277088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any plausible argument that matter exists?",
        "author": "Capable-Table7782",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ltmh1/is_there_any_plausible_argument_that_matter_exists/",
        "text": "I don't mean the view of materialism, but rather the idea that there exists anything material. Most people take this for granted and it does seem absurd to deny material reality, but do we have any reasons to believe in the  existence of matter, which are not based on feeling?",
        "created_utc": 1678273904,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did diversity in India coexist?",
        "author": "a_saint",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ltagc/how_did_diversity_in_india_coexist/",
        "text": "So as the polarization today seems to increase, it seems unthinkable that without shared belief we can operate as a society. However, in India there was Hindu philosophy which seemed have many [branches](https://en.wikipedia.org/wiki/Hindu_philosophy) of thought. There isn't any recordings of the equivalent of the culture wars.\n\nHow did such a society with such diverse viewpoints co-exist and why does the same seem untenable today?",
        "created_utc": 1678272831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there metaphysical applications to Marx's use-value and exchange value principles beyond economics, such as structuralism or psychologism?",
        "author": "NotLongForThisSite",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lt2qn/are_there_metaphysical_applications_to_marxs/",
        "text": "I guess what I mean to ask if there have been philosophers who have applied these terms to describe other meta processes besides their economic use?",
        "created_utc": 1678272068,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the currents that work as a contrast to cybernetics?",
        "author": "lovelyPossum",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lsyv8/what_are_the_currents_that_work_as_a_contrast_to/",
        "text": "Cybernetics is the science that aims to explain systems, automation and basically everything from the machine and the standpoint of the cyborg. My question is. What are the currents/dialogues or papers against it?",
        "created_utc": 1678271697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any philosophers who address the physical manifestations of influence?",
        "author": "siwel7",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ls8m8/are_there_any_philosophers_who_address_the/",
        "text": "I'm fascinated by the power of influence, but in a butterfly effect-like way.\n\n\nI've read philosophical ideas from people like Nietzsche, Foucault, and Chomsky, who dig into this subject, but I'm more interested in the physical manifestations of influence and how they directly transmit from one person to another.\n\n\nMy friend said something like, \"A person raises their eyebrows and it causes a building to collapse across the other side of the world.\" I know he was just paraphrasing from the butterfly effect by Edward Lorenz, but that is the very kind of thing I'm interested in. \n\n\nEven reading fictional works of this kind of manner of influence would be a delight for me.",
        "created_utc": 1678269182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Essay help? Perhaps a big ask.",
        "author": "Eyk13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lqq8d/essay_help_perhaps_a_big_ask/",
        "text": "I'm writing an essay about transitivity and wondered if anyone would be able to read over it for me to make sure i'm correct on the things i'm saying about causation. \nObviously, this is a big ask but I don't really have anyone who would be able to do this for me that is already familiar with the content.",
        "created_utc": 1678263847,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the current conversation about ontology? Does it fit with current trends of new materialism?",
        "author": "Senior-Muffin-6991",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lomrt/what_is_the_current_conversation_about_ontology/",
        "text": "",
        "created_utc": 1678256935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does what they do in private, define a person at all?",
        "author": "TheL8Gamer",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11loezd/does_what_they_do_in_private_define_a_person_at/",
        "text": "If somebody does something that practically effects no one else, such as piss on a grave or something, can those actions make them a bad person? Even partially?",
        "created_utc": 1678256241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is being unconvinced of an argument for “x” the same a saying “x” is false or that not “x” is true?",
        "author": "Spoonz4hire",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lo6jh/is_being_unconvinced_of_an_argument_for_x_the/",
        "text": "Say “x” is the statement god exists. Is me having a lack of belief in the existence of god the same as me saying I believe god doesn’t exist?",
        "created_utc": 1678255505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to create nested simulations in such a way that we can study and possibly disprove that we are in a simulation?",
        "author": "Specific-Air-4278",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lo5ld/is_it_possible_to_create_nested_simulations_in/",
        "text": "Have you ever tried to make a computer inside sandbox games like Minecraft? It works but it's much slower than a computer in real life. Same thing with programming languages. A language that has lower access to the hardware such as assembly is faster than high level languages. What if we could explore what are the limits of nesting simulations inside other simulations in the future? There are two scenarios:  \n\nWe aren't in a simulation. If that is the case then nesting simulations inside simulations indefinitely wouldn't cause a 'overload' or 'slowdown' in reality.  \n\nWe are in a simulation. If that is the case then nesting simulations inside simulations like crazy would possibly overload some aspect of the simulation we are in, possibly causing a slowdown of some sort.  \n\nWhat I have in mind is 'creating' computers inside computers indefinitely, (nothing involving people or sentient beings).  \n\nIt may be too early but I think that if we are in a simulation (which I think we are not), there is a way to find out by creating some absurd computational something the system was not intended to process.",
        "created_utc": 1678255421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is so much value placed on inconsequential things?",
        "author": "The1stLegionnaire",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lnx37/why_is_so_much_value_placed_on_inconsequential/",
        "text": "Unsure if this fits community guidelines, will remove if it doesn’t; thank you for your time.  \nRecently was reminded more than ever that the people around are just people — nothing more, nothing less. Obviously, on the basic level, I am well aware that those around are indeed people; people with their own jobs, reasoning, lives, etc, however the reminder was oddly a bit more startling this time. In fact, it is this semi-revelation that lead to the question of why so much value is placed on inconsequential things. (In this case, I’m talking about inconsequential in terms of its effect on others, not on the person themselves).\n\nThere are a number of examples of this, but the examples coming readily to mind of inconsequential things that seem to be blown out of proportion are: sexuality and race (and religion). Certainly, both can have an effect on how one sees themselves — that is indeed important and should be respected. However, where confusion seems to set in a bit is when people on the outside claim it is affecting them.  \nOn the topic of sexuality: How is two people in a loving same-sex relationship affecting anyone outside it negatively? How is someone expressing romantic interest in a consenting party harming anyone at all? How is it any different from romantic interest in someone of the opposite sex? Why does it matter to those uninvolved? The world surely has gotten better with this issue, but it still exists. For example, religious fanatics (no doubt a minority, but a quite vocal one of religions) who say that one will be tormented for eternity over such an act for no reason other than “it says not to” or ruthlessly prosecuted. One question: Why?  \nOn the topic of race: race is a slightly more nuanced topic, no doubt, with its connections to culture and cultural differences. Culture should be remembered and allowed to be practiced if so chosen, but human tendency to separate into “us vs them” often leads to all sorts of issues and mischaracterizations. ”Us“ meaning “good” and “them” meaning “bad” because, naturally, we tend to characterize different and new as dangerous. However, why does skin color matter outside of cultural, heritage, etc. symbolism? In the vast majority of society, skin color or race has no effect on inherent capability, so why would it change a response? All that matters is the person and their measure of character. Neither appearance nor culture are the all-defining factor of a person, so why do either matter that much?  \nOn the topic of religion: Very similar to the description of race. As long as someone religious is acting in good faith and within reason (not an extremist), a practice should be allowed without judgement. Notably, the atheist vs religious argument has been increasingly common within the past few years and neither side is right nor wrong in their opinion. There’s evidence pointing in both directions so it’s an entirely fruitless argument, and yet people become so vicious in discussion. Once again, what’s the point?\n\nAll in all, these were a few examples of quite inconsequential areas that seem to have more worth attributed to them than there needs to be. Please feel free to share your opinions on this matter or any other examples of this, I’d love to read them.",
        "created_utc": 1678254725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consciousness: is it plausible that societal interactions could allow a larger consciousness to emerge? Story below to explain my question further",
        "author": "drugartist",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ln4t5/consciousness_is_it_plausible_that_societal/",
        "text": "In the vast expanse of the human brain, there are over 100 billion neurons, all working together to create the miracle that is consciousness. Each neuron is connected to countless others, forming an intricate network that transmits electrical and chemical signals at lightning-fast speeds. This network is what allows us to think, feel, and experience the world around us.\nBut what if the human brain is not the only network capable of creating consciousness? What if we are part of a larger network, where each individual is like a neuron, connected to countless others in a web of communication and interaction? This thought had always captivated Dr. Maria Santos, a brilliant neuroscientist who spent her career studying the intricacies of the human brain.\n\nAs she explored her research further, Dr. Santos began to recognize the striking similarities between the human brain and human society. Just like neurons, humans communicate with each other through a complex network of connections. These connections take many forms - from the neurons in our brains that communicate through synapses, to the billions of social interactions that occur every day. And just like in the brain, the strength and frequency of these connections can shape the way we think and behave.\n\nDr. Santos was fascinated by the possibility that this larger network of human society could give rise to a higher consciousness, one that transcends any individual. But she also realized that the human brain and human society have crucial differences. While the human brain is a tightly regulated system, with strict rules governing the way neurons communicate with each other, society is far more chaotic, with countless competing interests and agendas vying for attention.\n\nHowever, despite these differences, Dr. Santos remained convinced that there was something deeply important about the way humans interact with each other. Perhaps it was not a higher consciousness that emerged from this network, but something else - something that could not be measured or quantified, but was nevertheless essential to our humanity. \n\nDr. Santos also realized that consciousness could derive from any form of communication, not just the communication of brain neurons or of people in society. Even the communication of movement from one atom to another allows for a fundamental and basic form of consciousness. This means that consciousness is not just limited to the human brain, but can be found in any form of communication, from the tiniest particles to the largest social networks. \n\nAs she looked out over the bustling city below her laboratory, Dr. Santos felt a sense of awe and wonder. The human brain was a miracle of nature, to be sure - but so too was the vast and intricate network of human society. And though she would never fully understand the mysteries of consciousness, she knew that she would spend the rest of her life exploring the endless possibilities of the human network, always seeking to uncover the secrets that lay just beneath the surface.",
        "created_utc": 1678252315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consciousness: Here’s a story that might help give some insights",
        "author": "drugartist",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lmpc7/consciousness_heres_a_story_that_might_help_give/",
        "text": "In the vast expanse of the human brain, there are over 100 billion neurons, all working together to create the miracle that is consciousness. Each neuron is connected to countless others, forming an intricate network that transmits electrical and chemical signals at lightning-fast speeds. This network is what allows us to think, feel, and experience the world around us.\nBut what if the human brain is not the only network capable of creating consciousness? What if we are part of a larger network, where each individual is like a neuron, connected to countless others in a web of communication and interaction? This thought had always captivated Dr. Maria Santos, a brilliant neuroscientist who spent her career studying the intricacies of the human brain.\n\nAs she explored her research further, Dr. Santos began to recognize the striking similarities between the human brain and human society. Just like neurons, humans communicate with each other through a complex network of connections. These connections take many forms - from the neurons in our brains that communicate through synapses, to the billions of social interactions that occur every day. And just like in the brain, the strength and frequency of these connections can shape the way we think and behave.\n\nDr. Santos was fascinated by the possibility that this larger network of human society could give rise to a higher consciousness, one that transcends any individual. But she also realized that the human brain and human society have crucial differences. While the human brain is a tightly regulated system, with strict rules governing the way neurons communicate with each other, society is far more chaotic, with countless competing interests and agendas vying for attention.\n\nHowever, despite these differences, Dr. Santos remained convinced that there was something deeply important about the way humans interact with each other. Perhaps it was not a higher consciousness that emerged from this network, but something else - something that could not be measured or quantified, but was nevertheless essential to our humanity. \n\nDr. Santos also realized that consciousness could derive from any form of communication, not just the communication of brain neurons or of people in society. Even the communication of movement from one atom to another allows for a fundamental and basic form of consciousness. This means that consciousness is not just limited to the human brain, but can be found in any form of communication, from the tiniest particles to the largest social networks. \n\nAs she looked out over the bustling city below her laboratory, Dr. Santos felt a sense of awe and wonder. The human brain was a miracle of nature, to be sure - but so too was the vast and intricate network of human society. And though she would never fully understand the mysteries of consciousness, she knew that she would spend the rest of her life exploring the endless possibilities of the human network, always seeking to uncover the secrets that lay just beneath the surface.",
        "created_utc": 1678251084,
        "upvote_ratio": 1.0
    }
]