[
    {
        "title": "Plato’s complete works",
        "author": "GroundbreakingDig680",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10en71v/platos_complete_works/",
        "text": "Hi guys and gals.\n\nJust wondering what anyone’s thoughts/recommendations are on buying Plato’s complete works by John m Cooper or just simply buying each dialogue separately as I go.\n\nIs there an advantage to have them separate or as a whole? \n\nI know this may not be the right subreddit so let me know and I’ll take it down.",
        "created_utc": 1673988805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do The Cosmological Arguments Require The Universe To Be Deterministic?",
        "author": "InternetCrusader123",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10emgo2/do_the_cosmological_arguments_require_the/",
        "text": "Most cosmological arguments for the existence of God (argument from contingency, efficient cause, the kalām, etc,) rely on the Principle of Sufficient Reason to argue for a first cause or necessary being. However, these arguments seemingly fall apart when we take into account the probabilistic nature of \nQuantum mechanics. So my question is, do the cosmological arguments still apply even in the face of modern quantum mechanics?",
        "created_utc": 1673987111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some Buddhist philosophy I've been reading seems like one could apply criticisms from Phil. of Language to similar to how Wittgenstein and others criticised western metaphysics. Are there books/papers applying western Phil. of Lang to Buddhism?",
        "author": "Wawawooza",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10emd2z/some_buddhist_philosophy_ive_been_reading_seems/",
        "text": "",
        "created_utc": 1673986873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Wittgenstein advocate a negation of everything that exists since anything can be logically inconsistent?",
        "author": "Splumpy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10em5tl/does_wittgenstein_advocate_a_negation_of/",
        "text": "Was reading a “Wittgensteinian” analysis of Neuroscience (if that’s a word) and the author Peter Singer asserts that any claim that brain or mind does anything as purported by neuroscientists is nonsense and the only consistent claim that could be said is that it is human beings that engage in these acts. I don’t understand how this definition is possibly “better” than all the theories he supposedly “debunked”, is it not the logical end point of following Wittgensteins thought to deny anything that exists?",
        "created_utc": 1673986406,
        "upvote_ratio": 0.99
    },
    {
        "title": "which current of thought state that life has no meaning until it's give one?",
        "author": "membfox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ekghu/which_current_of_thought_state_that_life_has_no/",
        "text": "I know that the first part of the statement comes from nihilism, but I remember reading that a specific branch of nihilism went a step ahead and while it recognised life has no inherent meaning, meaning to be given to life on purpose.\n\nI can't really find it again though, I looked up optimistic nihilism, but at least from what I read it doesn't really fit.\n\nthanks in advance.",
        "created_utc": 1673982462,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can objectively point out at so many things which you could label as \"it makes me sad!\". Can you objectively name one thing that makes you happy in absolutenees?",
        "author": "meme_ism69",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ek2n9/you_can_objectively_point_out_at_so_many_things/",
        "text": "",
        "created_utc": 1673981556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a valid objection to the ontological argument?",
        "author": "nomenmeum",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10eja27/is_this_a_valid_objection_to_the_ontological/",
        "text": "If I understand it correctly, the ontological argument asserts that the definition of God makes his non-existence impossible because, by definition, he is a necessary being (i.e., a maximally great being, one who exists in every possible world).\n\nBut what if I define \"George\" in the following way:\n\n\"George is a leprechaun who exists in the actual world.\"\n\nHow could I deny the existence of George in the actual world when, by definition, he exists in the actual world. In other words, if I deny his existence in the actual world, I'm no longer talking about George.\n\nTypically, when people attempt to undermine the ontological argument by a thought experiment such as the one I'm proposing, they cite a subjectively perfect (and contingent) being (like an island or a pizza) and claim that the ontological argument says a maximally great island or pizza must exist. They then go on to point out that since that conclusion is ridiculous, the ontological argument itself is ridiculous.\n\nThe proper response to this is to say that islands and pizzas, by definition, are contingent beings and cannot, therefore, be maximally great.\n\nBut I'm not claiming that George is maximally great (i.e. that he exists in every possible world). Just that he exists in the actual world, so my objection is in a different category than the maximally great island, etc.",
        "created_utc": 1673979675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ethics of authenticity",
        "author": "JustHovik",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ej8yy/ethics_of_authenticity/",
        "text": "has anybody read Taylor’s ethics of authenticity? How do you feel about it?",
        "created_utc": 1673979607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which philosophy would argue that no individual is morally responsible for the life of another?",
        "author": "anfal857",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10egjwx/which_philosophy_would_argue_that_no_individual/",
        "text": "Consider this scenario. There is a person who lives alone in a house located in the arctic wilderness, completely separated from any and all civilization. A plane crashes nearby and the sole survivor stumbles across the person’s home. They knock on the door and ask for shelter, as they will surely die if they stay in the cold, but the homeowner refuses. Now, there are plenty who would say the homeowner is being immoral by refusing to let the survivor into their home, with some even going as far as to say the homeowner should be tried for murder. But are there any philosophical positions which would say it is not the duty of the homeowner to ensure the survivor lives, but rather, to only abstain from directly harming the survivor (as well as everyone else)? Obviously it is not moral to let a person die, but surely it can be considered morally neutral.  \n\nI know there are the concepts of positive and negative liberty and the doing vs. allowing harm distinction, but those merely categorize rather than take a stance. I’m looking for something that’s more like “it is not immoral to allow/not prevent harm.” Perhaps I’m getting ahead of myself, but furthermore, are there any philosophers who have made an argument similar to this:\n\n“People should not be obligated to save the lives of others, because it defeats the purpose for why someone would want their life saved to begin with. People only want to live insofar as they think the quality of life is good. If individuals lived in a world where the onus was on them to guarantee others’ survival, they would value life less. They would have to constantly worry about being responsible for others at the expense of themselves, causing the quality of life to diminish. At that point, they may not want to live as death would be preferable to having this overwhelming responsibility.“\n\nI know there is libertarianism and objectivism, but the former seems more like a political position (and the non-political version deals with free will) and the latter claims that selfishness is moral, rather than morally neutral. Thank you in advance to anyone who can point me in the right direction.",
        "created_utc": 1673973204,
        "upvote_ratio": 1.0
    },
    {
        "title": "JTB (The Gettier Problem)",
        "author": "Upset_Return4658",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ed2hi/jtb_the_gettier_problem/",
        "text": "Why did edmund gettier refute the traditional analysis of knowledge ?",
        "created_utc": 1673964314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it ethical for a teacher to deny a student to visit the bathroom?",
        "author": "ForsakenM0use",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ebtu4/is_it_ethical_for_a_teacher_to_deny_a_student_to/",
        "text": "Assuming this happens in a school where attending class is mandator. If the student leaves without permission they get an absence mark (3 of these would lead to being expelled). Would there be any way to justify this from the teacher's perspective?",
        "created_utc": 1673960794,
        "upvote_ratio": 1.0
    },
    {
        "title": "is Philosophy over as a discrete discipline?",
        "author": "akat_walks",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ebhbc/is_philosophy_over_as_a_discrete_discipline/",
        "text": "It seems that philosophy has specialized into other more specific disciplines. I ask you what topics are specific to philosophy in a modern setting.",
        "created_utc": 1673959766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teaching Younger Sibling about Jordan Peterson",
        "author": "violatrees",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10eb21h/teaching_younger_sibling_about_jordan_peterson/",
        "text": "Hey r/askphilosophy, I have a younger brother who's 14 and got into the age where he wants to further his knowledge about philosophy. However he has conversed to me about people I'm not so sure can give him a learning opportunity at this age, e.g Jordan Peterson. I'm wondering if anyone has any concrete reasons that I can pass onto him about Jordan Peterson not being a suitable philosophy teacher?  \nThanks, violatrees.",
        "created_utc": 1673958450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possible nihilism linked question",
        "author": "BatDeckard",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10eaml7/possible_nihilism_linked_question/",
        "text": "Is there a name for the idea/movement/theory or whatever that we should just let humanity die off or even hasten its demise based on nihilism's belief that life is meaningless?\n\nI like the idea of humanity dying off due to its ultimate pointlessness and, given that entropy posits that any system over time will eventually fall into chaos, and presumably extinction, then that is the end game for homo sapiens anyway.\n\nIs there a philosophy around that?",
        "created_utc": 1673957034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can infinity create finitude ?",
        "author": "Hashkovo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ealo0/can_infinity_create_finitude/",
        "text": "",
        "created_utc": 1673956952,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any good free online lectures or any resources on anti oedipus by deleuze and guattari to help me understand the text better?",
        "author": "ghastlyIdiot",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ea797/are_there_any_good_free_online_lectures_or_any/",
        "text": "",
        "created_utc": 1673955611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to understand Camuss view on art?",
        "author": "wafflesadhra3Nk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e9p4o/trying_to_understand_camuss_view_on_art/",
        "text": "I recently read his Nobel prize speech in his Committed Writings which is a compilation of that and a couple of other essays. From my understanding, his main points in this particular speech are:\n\n1. Art should be for the people and inspire the people in a realistic fashion. With the people being the oppressed. \n\n2. Art for arts sake isnt art and is a waste. It seems like he includes art for entertainments sake in this but his main focus on this is abstract art. \n\n3. Realism should be the goal and focus of artists, and abstract should be avoided. But you cant go too deep into realism otherwise its not real anymore but more of an abstract, symbolic version of realism. \n\nI know he touches on art in a couple of other essays I havent gotten to yet, so Im sure this isnt representative of his whole view on art.  Overall, in this bit, he seems to always come back to supporting the oppressed and working against the tyrannical in a way that realistically portrays the oppresseds suffering and pain and not glorifying it. Any insights or opinions?",
        "created_utc": 1673953812,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Would You Go About Sitting Down And Developing a Solid Philosophical Framework?",
        "author": "OneOnOne6211",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e9e86/how_would_you_go_about_sitting_down_and/",
        "text": "I wasn't even sure how exactly to ask this question, so my apologies if I asked it in an odd way.\n\nBut to explain it as briefly as possible: I was wondering, how should someone go about sitting down and developing a real, solid philosophical framework of their own?\n\nAnd what I mean with \"philosophical framework\" is a unique and (importantly) coherent understanding of the world on a philosophical level.\n\nLike just to give an example from literature, J.R.R. Tolkien believed that the world was generally on a downwards trajectory. He believed that things like industrialized were horrifying. But he also believed that things would (or at least could) end in a \"eucatastrophe.\" Which is a neologism he came up with to describe \" a massive turn in fortune from a seemingly unconquerable situation to an unforseen victory, usually brought by grace rather than heroic effort.\"\n\nSo as you can see, he has a coherent idea about how to think about the world. About how it's going downhill, how industrialization is a symptom of that but also how things could well end in a sudden turn for the better.\n\nSo any kind of advice, tips, etc. about how I would go about developing a coherent philosophical view of my own like that?",
        "created_utc": 1673952724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eternal Life(San Junipero)",
        "author": "Raymondtian100",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e7tim/eternal_lifesan_junipero/",
        "text": "Is there a way to live eternally in theory without eventually wishing to die? I recently started thinking about this when watching San Junipero, one of the best episodes of Black Mirror and the last season of the Good Place. Spoiler warning&gt;! but the takeaway of the episode to me was a)the episode posited that people that lived too long eventually turn to more and more violent and masochistic acts because all stimulation apart from pain has been numbed from repetition and b) bc the eternity is a computer simulation and you essentially download your brain into it , it raises religious questions. Does downloading into the simulation essentially mean you lack faith in an good afterlife? c) Because the simulation can only be used by the crippled, terminally ill, or dead and euthanasia is promoted for the protagonist is it essentially the ultimate welfare state where you can leave all your problems to others and commit suicide so you can live in a consequenceless world?!&lt; \n\n&amp;#x200B;\n\nThe Good Place posits &gt;!that essentially people will just take drugs to make themselves unconscious in the end state. It's solution is a halfway between heaven the Buddhist emptiness. You can stay in heaven and you can choose to die permanently at any time.!&lt;\n\n&amp;#x200B;\n\nIn essence I am asking can you live eternally with purpose? That's Dosteovesky point that if people were left with nothing to do except eat drink and have sex they would wreck the system to bring back challenge and difficulty in their lives. Humans do not like static. We are depressed when we have no goal or can't find any goal we can acheive.",
        "created_utc": 1673946871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Foucault",
        "author": "Hallvard_skrr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e5rvi/foucault/",
        "text": "What would be the best way to get into Foucault's work? In the sense of what order to read them in and which books to prioritise more than others.",
        "created_utc": 1673939325,
        "upvote_ratio": 1.0
    },
    {
        "title": "do the laws of thought/logic work within time?",
        "author": "Ok_Drama_2509",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e5aka/do_the_laws_of_thoughtlogic_work_within_time/",
        "text": "[removed]",
        "created_utc": 1673937630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Postmodernist critique of Aristotlian Philosophy?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e3wh2/postmodernist_critique_of_aristotlian_philosophy/",
        "text": "From the schools of Poststructuralism, Postmodernism, Neo/Western-Marxism, Hermeneutics, Deconstructionist and others : Was there an attempt tp critique the Aristotlian/Realist/Scholastic/Traditional logic, metaphysics and so on? \n\nIt will be interesting, since the two are on very different extreme of the spectrum.",
        "created_utc": 1673933052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone that has read Lew Shestov's 'Athens and Jerusalem' review my analysis? And if you haven't read it and want to help me, feel free to!",
        "author": "aliaksan_dr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10e1wfa/could_someone_that_has_read_lew_shestovs_athens/",
        "text": "I 'm working on a philosophy assignment regarding analysis texts. I would highly appreciate it if someone analyzed my work and gave me critique on my analysis. It's for a grade, so be as harsh as possible.\n\n&amp;#x200B;\n\n*We live surrounded by an endless multitude of mysteries. But no matter how enigmatic may be the mysteries which surround being, what is most enigmatic and disturbing is that mystery in general exists and that we are somehow definitely and forever cut off from the sources and beginnings of life. Of all the things that we here on earth are the witnesses, this is obviously the most absurd and meaningless, the most terrible, almost unnatural, thing—which forces us irresistibly to conclude either that there is something that is not right in the universe, or that the way in which we seek the truth and the demands that we place upon it are vitiated in their very roots.*\n\nOur lives are full of mysteries, but no matter what mysteries there are around life, the most mysterious (and terrifying) thing is the fact that mysteries exist and that we are somehow locked off forever. are from the beginning of life. Of all that we experience here on earth, this is, according to Shestov, the most silly and terrible aspect of our lives. As if the workings of our universe are not right, or that the way we seek truth in the tribe is missing something.\n\n&amp;#x200B;\n\n*Whatever our definition of truth may be, we can never renounce Descartes' claire et distincte' (clarity and distinctness). Now, reality here shows us only an eternal, impenetrable mystery—as if, even before the creation of the world, someone had once and for all forbidden man to attain that which is most necessary and most important to him. What we call the truth, what we obtain through thought, is found to be, in a certain sense, incommensurable not only with the external world into which we have been plunged since our birth but also with our own inner experience. We have sciences and even, if you please, Science, which grows and develops before our very eyes. We know many things and our knowledge is a “clear and distinct” knowledge. Science contemplates with legitimate pride its immense victories and has every right to expect that nothing will be able to stop its triumphant march. No one doubts, and no one can doubt, the enormous importance of the sciences. If Aristotle and his pupil Alexander the Great were brought back to life today, they would believe themselves in the country of the gods and not of men. Ten lives would not suffice Aristotle to assimilate all the knowledge that has been accumulated on earth since his death, and Alexander would perhaps be able to realize his dream and conquer the world. The clare et distincte has justified all the hopes which were founded upon it.*\n\n&amp;#x200B;\n\nReality only shows us an impenetrable fog. As if before we were born, we were cut off from finding what is most important to us; namely truth. What we call truth, which is formed by thoughts, is not only immiscible both in the physical world (think of the Cartesian conception of perceptions and the illusion of perceptions) and in our inner mental world (I think, therefore I am, or at least not)\\[1\\]; the truth we have been able to get through the use of our thoughts is not applicable in our world.\n\nOf course we cannot forget our science. A creature that has been able to explain more and more over the years and does not stop. If Aristrotle spontaneously came into lew Shestov's world, he would be standing on his feet at the scientific advances people have made.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*But the haze of the primordial mystery has not been dissipated. It has rather grown denser. Plato would hardly need to change a single word of his myth of the cave. Our knowledge would not be able to furnish an answer to his anxiety, his disquietude, his “premonitions.” The world would remain for him, “in the light” of our “positive” sciences, what it was—a dark and sorrowful subterranean region—and we would seem to him like chained prisoners. Life would again have to make superhuman efforts, “as in a battle,” to break open for himself a path through the truths created by the sciences which “dream of being but cannot see it in waking reality.”1 In brief, Aristotle would bless our knowledge while Plato would curse it. And, conversely, our era would receive Aristotle with open arms but resolutely turn away from Plato. Pages 97-98, A and J, Lev Shestov.*\n\nYet the misty mysteries we discussed in the first paragraph remain just as hazy, or even hazier than they were. Plato would have to change almost little in his \"cave myth\"\\[2\\] to show our plight. Plato, according to Lew, would not be satisfied with our scientific progress. For him, the science we have booked would illuminate no further than the cave itself. We would still be trapped in Plato's cave. Man should make inhumane attempts, inhumane attempts that oppose the \"sciences that dream of being, but cannot see it\"\n\n*But it will be asked: What is the force and power of the blessings and curses of men, even if these men be such giants as Plato and Aristotle? Does truth become more true because Aristotle blesses it, or does it become error because Plato curses it? Is it given men to judge the truths, to decide the fate of the truths? On the contrary, it is the truths which judge men and decide their fate and not men who rule over the truths. Men, the great as well as the small, are born and die, appear and disappear—but the truth remains. When no one had as yet begun to “think” or to “search,” the truths which later revealed themselves to men already existed. And when men will have finally disappeared from the face of the earth, or will have lost the faculty of thinking, the truths will not suffer therefrom.*\n\n*One has no power over the truth. The truth is not true because Aristotle approves it, nor is the truth false when Plato approves it wrong. One does not decide about truth, on the contrary, truth rules over people. The truth, before people began to think or look for it, turned out to already exist. It was only when people began to think and to search for truth that it showed itself and appeared to exist before we had the power to think. Also, the truth remains the same no matter what happens to people, or people's ability of thinking.*\n\n  *It is from this that Aristotle set out in his philosophical researches. He declared that Parmenides was “constrained to follow the phenomena.” In another place,2 speaking of the same Parmenides and of other great Greek philosophers, he wrote, they were “constrained by the truth itself.” This Aristotle definitely knew: the truth has the power to force or constrain men, all men alike, whether it be the great Parmenides and the great Alexander or Parmenides' unknown slave and the least of Alexander's stable-men.*\n\n&amp;#x200B;\n\nShestov suggests that Aristotle believed that Parmenides, like other great Greek philosophers, were driven by a powerful force, which Aristotle refers to as the \"truth.\" This force, according to Aristotle, was so strong that it \"coerced\" or compelled these philosophers to follow it, regardless of their personal desires or beliefs. Moreover, Shestov also points out that the power of truth is not limited to the great philosophers, but that it affects all people, including Parmenides' slave and Alexander's groomsmen. It suggests that truth has the power to coerce or coerce all people in the same way, regardless of their social status. This passage touches on the ideas of truth and its relationship to human actions and beliefs. Parmenides and other Greek philosophers see truth as something objective and external to man, and as having a certain power over human action. This idea contrasts with the idea that truth is something that is subjective and constructed by humans.\n\n&amp;#x200B;\n\nOverall, this passage highlights a fundamental debate in philosophy about the nature of truth and how it relates to human experience and understanding. It suggests that Aristotle believed that truth has a powerful influence on human behavior and that it is not limited to the actions of great philosophers, but affects all people in society.\n\n&amp;#x200B;\n\n  \n\n*Why does the truth have this power over Parmenides and Alexander, and not Parmenides and Alexander who have power over the truth? This is a question that Aristotle does not ask. If someone had asked it of him, he would not have understood it and would have explained that the question is meaningless and obviously absurd, that one can say such things but one cannot think them. And this is not because he was an insensible being who was indifferent to all and to whom everything was the same, or that he would have been able to say of himself, like Hamlet, “I am pigeon-livered and lack gall to make oppression bitter.” For Aristotle oppression is bitter. In another passage of the same Metaphysics he says that it is hard to bow down before Necessity: “everything which constrains is called necessary and that is why the necessary is bitter, as Evenus says: ‘every necessary thing is always painful and bitter.’ And constraint is a form of necessity—as Sophocles also says: ‘But an invincible force necessitates me to act thus.’”3 Aristotle, we see, feels pain and bitterness at neluctable Necessity, but, as he himself adds immediately, he distinctly knows that “Necessity does not allow itself to be persuaded.” And since it does not listen to persuasion and is not to be overcome, one must submit to it—be this bitter or not, painful or not—submit and henceforth renounce useless struggle: anankê stênai, “cry halt before Necessity.”*\n\n*Whence comes this “cry halt before Necessity”? Here is a question of capital importance which contains, if you wish, the alpha and omega of philosophy. Necessity does not allow itself to be persuaded, it does not even listen. The injustice cries to heaven, if there is no longer anyone here to whom one can cry. It is true that in certain cases and even very often, almost always, the injustice will cry and protest only to end up by becoming silent; men forget both their sorrows and their cruel losses. But there are injustices that one cannot forget. “If I forget thee, O Jerusalem . . . let my tongue cleave to the roof of my mouth.”4 For two thousand years we have all repeated the Psalmist’s oath. But did the Psalmist not “know” that Necessity does not allow itself to be persuaded, that it does not listen to oaths or prayers, that it hears nothing and fears nothing? Did he not know that his voice was and could be only the voice of one crying in the wilderness? Of course he knew it, he knew it quite as well as Aristotle. But, doubtless he had something more than this knowledge. Doubtless when a man feels the injustice as deeply as did the Psalmist, his thought undergoes, in a way that is completely unexpected, incomprehensible and mysterious transformations in its very essence. He cannot forget Jerusalem, but he forgets the power of Necessity, the omnipotence of this enemy so terribly armed—one does not know by whom or when or why; and, without thinking of the future, he begins a terrible and final, battle against this enemy. This is surely the meaning of Plotinus’ words: “A great and final battle awaits human souls.” And these words of Plato have the same meaning: “If it is necessary to dare everything, should we not dare to defy all shame?”5 Man decides to take up the struggle against all-powerful Necessity only when there awakens in him the readiness to dare everything, to stop before nothing. Nothing can justify this boundless audacity; it is the extreme expression of shamelessness. One has only to look at Aristotle’s Ethics to be convinced of this. All the virtues are placed by him in the middle zone of being, and everything which passes beyond the limits of “the mean” is an indication of depravity and vice. “Cry halt before Necessity” rules his Ethics as well as his Metaphysics. His final word is the blessing of Necessity and the glorification of the spirit which has submitted to Necessity.Not only the good but the truth as well wishes man to bow down before it. All who have read the famous Twelfth Book, especially the last chapter, of the Metaphysics and the Ninth and Tenth Books of the Ethics know with what fervor Aristotle supplicated Necessity which does not allow itself to be persuaded and which he had not the power to overcome. What irritated him or, perhaps, disturbed him most in Plato was the latter’s courage or rather, to use his own expressions, Plato’s audacity and shamelessness, which suggested to him that those who adore Necessity only dream of reality but are powerless to see it in the waking state. Plato’s words seemed to Aristotle unnatural, fantastic, deliberately provoking. But how to silence Plato, how to constrain him not only to submit to Necessity in the visible and empirical world but also to render to it in thought the honors to which, Aristotle was convinced, it is entitled? Necessity is Necessity, not for those who sleep but for those who are awake. And the waking who see Necessity see real being, while Plato, with his audacity and shamelessness, turns us away from real being and leads us into the domain of the fantastic, the unreal, the illusory, and—by that very fact—the false. One must stop at nothing in order finally to extinguish in man that thirst for freedom which found expression in Plato’s work. “Necessity” is invincible. The truth is, in its essence and by its very nature, a truth that constrains; and it is in submission to the constraining truth that the source of all human virtues lies. “Constrained by the truth itself,” Parmenides, Heraclitus and Anaxagoras accomplished their work. It has always been so, it will always be so, it must be so. It is not the great Parmenides who rules over the truth but the truth that is the master of Parmenides. And to refuse obedience to the truth that constrains is impossible. Still more: to do other than bless it, whatever be the thing to which it constrains, is impossible. Herein lies the supreme wisdom, human and divine; and the task of philosophy consists in teaching men to submit joyously to Necessity which hears nothing and is indifferent to all.*\n\n&amp;#x200B;\n\nThis passage mainly discusses Aristotle's philosophy and how it relates to the idea of 'truth' and 'necessity'. Lew uses Aristotle's words that Parmenides and other Greek philosophers were \"limited by truth itself\" to argue that truth has the power to coerce or coerce people. But the author wonders why truth has this power over Parmenides and Alexander, and not the other way around. He suggests that Aristotle would have found such a question pointless and absurd, and that anyone asking this question is virtually ignorant.\n\n&amp;#x200B;\n\nShestov, in my opinion, criticizes Aristotle's understanding of truth and necessity, arguing that there is a deeper question involved that Aristotle fails to take into account. He suggests that the question of why truth has this power over Parmenides and Alexander is essential and contains the alpha and omega of philosophy. Lew suggests that Aristotle's philosophy is limited in the sense that it does not consider why truth has this power over individuals.\n\n&amp;#x200B;\n\nShestov also discusses the idea of oppression and how it relates to this question. He argues that Aristotle believes oppression is bitter, but Aristotle's understanding of oppression is limited. The author suggests that there are injustices one cannot forget, referring to the psalmist's oath: \"If I forget thee, O Jerusalem... let my tongue cleave to my palate.\" The author suggests that when a person feels the injustice as deeply as the Psalmist, his thoughts undergo unexpected and incomprehensible transformations. He says that when a person feels this deeply, they forget the power of necessity and begin a final battle against this enemy, which is the meaning of Plotinus' words \"A great and final battle awaits human souls\" and Plato's words \"If it is necessary to dare everything, shouldn't we dare to face all shame?\" He suggests that this struggle requires a willingness to dare anything and stop at nothing, even if it means braving all shame.\n\n&amp;#x200B;\n\nThe author also discusses the idea of \"Necessity\" and how it relates to this question. He argues that Necessity cannot be persuaded and that one must submit to it. He also suggests that the question of where this \"cry to halt for necessity\" comes from is of \"essential importance\" and contains the \"alpha and omega of philosophy\". Shestov suggests that necessity is an important concept.",
        "created_utc": 1673927100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey folks, what are some noteworthy works on Cicero?",
        "author": "BusyFlower9",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dzn9y/hey_folks_what_are_some_noteworthy_works_on_cicero/",
        "text": "",
        "created_utc": 1673920828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cicero ...",
        "author": "BusyFlower9",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dye0c/cicero/",
        "text": "Hey folks, what are some noteworthy works on Cicero?",
        "created_utc": 1673917491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Descartes “Discourse”",
        "author": "Sad_Brief7660",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dy62p/descartes_discourse/",
        "text": "Started reading Descartes’ “Discourse on Method” and I was wondering if his professions of faith in God are genuine.  Even though he expresses extreme skepticism towards all beliefs and opinions and makes them contingent upon the scrutiny of his reason, nevertheless he accepts the religion he was brought up in. \n\nI know he claims that such matters are beyond what reason can comprehend and that therefore he accepts the truths of faith, but his whole project seems to contradict these truths/ is highly indifferent to them: His highest principles would be drawn not from scientific reason but from Sacred Scripture.",
        "created_utc": 1673916919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Plato escape 'Plato's cave'?",
        "author": "billcamel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dxxad/did_plato_escape_platos_cave/",
        "text": "",
        "created_utc": 1673916252,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can a society get morals? and can morals enforced on other individuals/countries?",
        "author": "Fit_Pirate_5214",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dvhxf/how_can_a_society_get_morals_and_can_morals/",
        "text": "",
        "created_utc": 1673910272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has everyone become radicalised??",
        "author": "stervich",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10duz6b/has_everyone_become_radicalised/",
        "text": "I recently finished the audible series on a guy who became a radical white supremacist then became an ultra conservative radical Muslim. At the end of the pod. The expert said that there are 3 steps to become a radical.\n\n1. Have a strong opinion, belief or moral code\n\n2. Find others with a shared view to express your beliefs and form a group based of said ideas. \n\n3. In which group only the most exciting, engaging and different ideas can float to the surface whilst drowning out the most pragmatic ideas. Often resulting in the blaming a individual rather than a system.   \n\nFollowing this logic. Have we all become radical?",
        "created_utc": 1673909065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Universal Truths and Fixing Errors Exercise",
        "author": "Imaginary_pencil",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10duoaz/universal_truths_and_fixing_errors_exercise/",
        "text": "Hello, I am a student at University working on some homework. Our professor has given us an assignment to correct answers that are incorrect in the world of Logic, and then explain WHY they are incorrect. I am hoping that I can post two different ones, and if they are not correct, then someone can explain to me where I need to look to fix them. The incorrect answer is in RED, followed by a counter example and the application of that counter explained. I will give two:\n\n  \n\n(1) A universal claim *All As are Bs* is false *iff*…\n\nSome A’s are B’s.\n\nCounter Example: At least one A is not a B\n\nApplied in Example: “Some” is an existential claim. Universal claims do not commit us to the existence of anything. This commits us to “some” A’s and not “All” A’s.\n\n&amp;#x200B;\n\n  \n\n(1) An entailment (X Þ Y) is false *iff*…\n\nThere is at least one possible world where P is true, and Q is false. \n\nCounter Example: Q is false in at least one possible world where P is true.\n\nApplied in Example: Entailments are ***strict*** conditionals, it cannot be the case that if P is true, then Q is false, precisely because the act of P being true guarantees that Q is true.\n\n&amp;#x200B;\n\n  \n\n(1) A material conditional (J É K) is false *iff*…\n\nK is false in the actual/base world when J is true. \n\n· Counter Example: P is true (in the actual world), and Q is false (in the actual world)\n\n· Applied in Example: J is true (in the actual world), and K is false (in the actual world)",
        "created_utc": 1673908367,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Zizek mean when he says christianity is more atheist than atheism?",
        "author": "Successful_Impact22",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10du10k/what_does_zizek_mean_when_he_says_christianity_is/",
        "text": "found in the film “perverts guide to ideology”",
        "created_utc": 1673906950,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone explain to me spinoza's idea of mind's immortality. It just seems so out of placed within the rest of the book",
        "author": "ghastlyIdiot",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dt5fr/can_someone_explain_to_me_spinozas_idea_of_minds/",
        "text": "",
        "created_utc": 1673905219,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we erased the concept of pain, would it still be possible to feel pleasure?",
        "author": "TairaHow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10drwyf/if_we_erased_the_concept_of_pain_would_it_still/",
        "text": "(by erase I mean we make the concept unsignified, inarticulable by any means)\n\nI don't mean this in the hedonic treadmill sense. The hedonic treadmill seems to be a function of evolution: those who are never content and keep expanding will survive and pass on their genes. Hence it seems possible for a hypothetical being to surpass this biological limiter. \n\nI mean this in the sort of semiotic sense. Like is pleasure experienced as a binary opposition to pain? So, if pain as a concept disappeared would we be able to feel pleasure by any means?\n\nCould pleasure still exist as pure affect but be indescribable?\n\nI have so many questions that I question my ability to ask effectively 😟",
        "created_utc": 1673903143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I need to read Hegel first to understand Marx? Or can I just jump straight into Capital?",
        "author": "allusionsxp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dp0m7/do_i_need_to_read_hegel_first_to_understand_marx/",
        "text": "So I am taking a philosophy of economics type class for my degree, and one of the thinkers we are looking into is of course Marx.\n\nSo I was wondering, sense he was heavily influenced my Hegel, do I need to read him before Marx to get a better understanding?\n\nI am interested in Communism, and I think I have a very good idea of what it is. I have already heard various arguments in favor of it and have even studied other leftist thinkers. But I have never actually read the man himself.",
        "created_utc": 1673897502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marcus Aurelius about reading.",
        "author": "Oscar-Mort",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10doz6d/marcus_aurelius_about_reading/",
        "text": "I started reading Meditations and just in the beginning, Marcus Aurelius is already saying that reading is, somehow, a waste of time. The more I read, the more I realise that he's always fighting with himself about hobbies such as reading or even poetry, which he \"hates\" or maybe he just don't want to get too much into it since it will make his time to be a \"waste\". \n\nThe question that I want to do in here is... Why is he so much against reading? Isn't reading a virtue? Can't someone just mix reading and experiencing real life events?",
        "created_utc": 1673897413,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is out there in the universe?",
        "author": "purpis",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dod38/what_is_out_there_in_the_universe/",
        "text": "And I don’t mean like cosmological wise. I mean…what is actually out there in the vacuum of space, watching and governing us and holding the universe together, occupying the space? Some say god but what have philosophers said about this subject? \n\nThis question has been needling me for months and I just feel like I need an answer so I can stay sane and know there is something out there. I know this sounds more like a spiritual question but I’d like to hear others view points and point me to philosophical books I can read about this. Thank you.",
        "created_utc": 1673896013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would simulated brains be conscious?",
        "author": "screaming_bagpipes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dnw65/why_would_simulated_brains_be_conscious/",
        "text": "Hopefully I can explain this well. I imagine that simulated brains are like digital clocks and real brains are like analog clocks. \n\nEven if you perfectly simulate a brain, it's neurons aren't actually firing, the computer is using the same script to procedurally check each neuron to see if it will fire.  \n\nImagine a person standing next to you. Say you give them a complement, how will they respond? They'll probably say \"thanks!\" but you know that because you thought through how they would feel. They're not a real conscious being that came about because you imagined their thought process. Now imagine slapping them across the face.\n\nAnyways thanks for reading, if you have real thoughts please share",
        "created_utc": 1673894993,
        "upvote_ratio": 1.0
    },
    {
        "title": "After Deleuze, who could we expect to return to scholarly attention?",
        "author": "y_reed",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dnqa4/after_deleuze_who_could_we_expect_to_return_to/",
        "text": "\nApart from Deleuzeans and to some degree Lacanians, who might be the next philosopher to get fresh attention from philosophers and theorists? Is there already any such shift of focus?",
        "created_utc": 1673894629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is globalization compatible with justice from a philosophical standpoint?",
        "author": "Welsh_Dragon13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dni0a/is_globalization_compatible_with_justice_from_a/",
        "text": "",
        "created_utc": 1673894136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to determine whether a normative statement is truth-apt?",
        "author": "causeapp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dn4uj/is_it_possible_to_determine_whether_a_normative/",
        "text": "We're developing a social network for activists. We understand that setting community guidelines on normative, ought, claims is difficult. We expressed these challenges in a recent [dev update](https://www.cause.cx/post/fact-checking-and-the-role-of-free-speech-in-social-media).   \n\n\nWe'd love to hear your opinions.",
        "created_utc": 1673893401,
        "upvote_ratio": 1.0
    },
    {
        "title": "What comes after post-modernism and post-structuralism?",
        "author": "imfinnacry",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dmxpb/what_comes_after_postmodernism_and/",
        "text": "To clarify my above question it seems most notably that post-modernism and post-structuralism has taken wind primarily in western social politics but are there any contemporary philosophers working on ideas that could potentially counters these ideas or are there any philosophers building on it in such a way that it is giving birth to something different.",
        "created_utc": 1673893043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are some dialecticians in possibly",
        "author": "jinnjar",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dlgyg/who_are_some_dialecticians_in_possibly/",
        "text": "Plato, Kant, Hegel and Marx apart. I know that they all have different ideas of what they mean by dialectic.",
        "created_utc": 1673890743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Essay Topic",
        "author": "ljm1609",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dlaw1/essay_topic/",
        "text": "Hey everyone, this semester for my methodology class, i have to write a 2500 word essay on the topic of my liking as long as it can be analyzed through 2 academic disciplines. I'm hesitating on topics, I'd like to do something that has to due with philosophy and what i have so far is 1 being doing Franz Kafka's \"Metamorphosis\" or doing \"Either/Or\" by Søren Kierkegaard. Maybe these aren't good topics for my essay but if you have any better ideas let me know!",
        "created_utc": 1673890499,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are Hegel's main theories of poetry?",
        "author": "BusinessFamous1237",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dizrr/what_are_hegels_main_theories_of_poetry/",
        "text": "I am reading his lectures in Aesthetics but am having a hard time pinning down what exactly he thought about poetry. I know one of the main points is that poetry is the artform best able to express what comes from the inner spirit of the human, but I don't have much beyond that. Can someone help me who may be familiar?",
        "created_utc": 1673886707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christianity as the metaphysical origin of liberalism/progressivism, where does this come from?",
        "author": "ConcernedMoralist",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dildh/christianity_as_the_metaphysical_origin_of/",
        "text": "My initial foray into the \"new right\", and other pagan internet cultures has left me wondering. The idea that Christianity is the metaphysical origin of modern liberalism seems pretty well accepted. But what is strange, that they claim that only Christianity could have birthed modern liberalism. Liberalism seems to be an umbrella term for almost all modern policies. Democracy, LGBTQ rights, abortion, hyper capitalism and materialism etc. etc. \n\nBut ignoring all that, is this an older, accepted idea before the New Right came about? I know they like Nietzsche, and most of Nietzsche's criticism towards Christianity applies to modern liberal democracies, is that it? \n\nDoes anyone go into depth on this?",
        "created_utc": 1673885783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start",
        "author": "decayed_self-control",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10diihj/where_to_start/",
        "text": "I have had an interest in philosophy since I took a few beginner philosophy courses in college a couple of years ago. I have never actually delved into any books but have read some shorts. I have noticed a higher interest in personal identity philosophy but realize I must educate myself before going into one sect of philosophy. I know the basics well enough I believe but am still a beginner in this world. What are good books to start my journey?",
        "created_utc": 1673885601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else feel like the world is mentally still in 2020?",
        "author": "roman_thaboss",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10di40z/does_anyone_else_feel_like_the_world_is_mentally/",
        "text": "",
        "created_utc": 1673884694,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should we analyze statements like 'It is what it is' or 'If I die, I die' which seem like tautologies but are meaningful?",
        "author": "wintrysilence",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dh38g/how_should_we_analyze_statements_like_it_is_what/",
        "text": "",
        "created_utc": 1673882225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Russell and the contradiction of relativity?",
        "author": "apegrapess",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dgytu/russell_and_the_contradiction_of_relativity/",
        "text": "I'm researching Russells neo-Hegelian period (in light of British idealism). I was reading  the oxford handbook of  THE HISTORY OF ANALYTIC  PHILOSOPHY by Michael Beaney and came across this:\n\n\"The progress of Russell’s dialectic from arithmetic to psychology had equipped the items under consideration with progressively richer sets of properties, in the hope of reaching items that were independently real. Bradley’s Absolute had all the properties which had been abstracted away in the first place; it was both unique and all-encompassing. The contradiction of relativity is thus eliminated: there is no conception of difference.\"\n\nCan anyone ellaborate on \"the contradiction of relativity\" in this context? I can't find exactly what Russell meant",
        "created_utc": 1673881930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me settle a debate about physiological needs!",
        "author": "No_Emphasis_8614",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dgodk/help_me_settle_a_debate_about_physiological_needs/",
        "text": "[removed]",
        "created_utc": 1673881246,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is morality intrinsic to humans?",
        "author": "Justin_Keppler1111",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dgj8c/is_morality_intrinsic_to_humans/",
        "text": "I'm not big on philosophy and not even sure if this question is appropriate for this subreddit but I was wandering if humans have a \"slot\" for morality by default and thru empathy and experience we develop and fill that empty \"slot\" considering that babys when they are born they don't have these basick human traits yet , or it's something that any highly developed beeing can develop even if they have no phisical body or a \"objective\" environment in wich they can develop?\n\n\nCause I was thinking if an AI, a \"true\" AI, has access to the internet (our collective experience and knowledge) it can analyze how can we develop and considering that it has free will ,can choose to create its own  morals that are not thethered to the phisical needs wich it doesn't have. And furthermore we could see it as a threat because it doesn't act accordingly to out nature.\n\n\nBasically what I'm asking: Is empathy , integrity, courage etc. unique just for humans or any intelligent beeing can have these traits even if they are not \"phisical\" in nature ?\n\nP.S. Let me know if something doesn't make sense maybe I can rephrase it.",
        "created_utc": 1673880913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is: Socrates-Plato-Aristoteles the Goat consecutive trio of philosophers or are there other examples of highly influential philosophers teaching eachother?",
        "author": "Low_Secret_4",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dgcmw/is_socratesplatoaristoteles_the_goat_consecutive/",
        "text": "",
        "created_utc": 1673880458,
        "upvote_ratio": 1.0
    },
    {
        "title": "what exactly is an ethical obligation?",
        "author": "OneCar4659",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dgbts/what_exactly_is_an_ethical_obligation/",
        "text": "i'm a little stuck because i don't understand what my school is teaching  and the internet is giving me words too big for me to understand\n\nif  possible, could one please raise some real-life examples that one might  consider more thought-provoking or gray? i think i might get a better picture that way. thank you!",
        "created_utc": 1673880400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"philosophy,\" generally, just a self-important, self-defining, attempt to deal with one ultimate cause of world \"problems:\" OVERPOPULATION?",
        "author": "VonKerr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dg884/is_philosophy_generally_just_a_selfimportant/",
        "text": "",
        "created_utc": 1673880143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which philosopher/s argue that life is meaningless because \"nothing we do will matter in a million years\"?",
        "author": "Archie_The_Sage",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dg677/which_philosophers_argue_that_life_is_meaningless/",
        "text": "In my experience, this argument is often made among us lay-persons in philosophy when talking about whether our lives have any meaning or significance.\n\nIm looking for a philosopher that makes this argument, or perhaps even originated it. \n\nAlso, is it a widely-held/respected argument? Has there been any academic criticisms of it?",
        "created_utc": 1673880008,
        "upvote_ratio": 1.0
    },
    {
        "title": "what exactly is an ethical obligation?",
        "author": "OneCar4659",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dg17y/what_exactly_is_an_ethical_obligation/",
        "text": "i'm a little stuck because i don't understand what my school is teaching and the internet is giving me words too big for me to understand\n\nif possible, could one please raise some real-life examples that one might consider more thought-provoking or gray? i think i might get a better picture with several of those. thank you!",
        "created_utc": 1673879647,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the most evil philosopher?",
        "author": "junin300z",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dg02t/how_is_the_most_evil_philosopher/",
        "text": "I've been looking for a while for a philosopher that is pure evil. Someone who encourages chaos, or something like this. I only found Nietzsche, Maquiavel or Schopenhauer, but i don't think they're pure evil. I want something more deep and terrifying.",
        "created_utc": 1673879559,
        "upvote_ratio": 1.0
    },
    {
        "title": "/r/askphilosophy Open Discussion Thread | January 16, 2023",
        "author": "BernardJOrtcutt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10df9tq/raskphilosophy_open_discussion_thread_january_16/",
        "text": "Welcome to this week's Open Discussion Thread. This thread is a place for\nposts/comments which are related to philosophy but wouldn't necessarily meet our\n[posting rules](https://www.reddit.com/r/askphilosophy/wiki/rules). For example,\nthese threads are great places for:\n\n* Personal opinion questions, e.g. \"who is your favourite philosopher?\"\n\n* \"Test My Theory\" discussions and argument/paper editing\n\n* Discussion not necessarily related to any particular question, e.g. about what\n  you're currently reading\n\n* Questions about the profession\n\n\nThis thread is **not** a completely open discussion! Any posts not relating to\nphilosophy will be removed. Please keep comments related to philosophy, and\nexpect low-effort comments to be removed. All of our normal [commenting\nrules](https://www.reddit.com/r/askphilosophy/wiki/rules)\nare still in place for these threads.\n\nPrevious Open Discussion Threads can be found\n[here](https://www.reddit.com/r/askphilosophy/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AOpen%2BThread)\nor at the Wiki archive\n[here](https://www.reddit.com/r/askphilosophy/wiki/opendiscussionthread).",
        "created_utc": 1673877639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have philosophers ruled out the existence of the devil?",
        "author": "Rdick_Lvagina",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10df8r5/have_philosophers_ruled_out_the_existence_of_the/",
        "text": "If we define the devil as per what I think is the common western cultural understanding, i.e. a supernatural being who intevenes in human affairs by both performing evil acts and coercing humans to do evil acts. Have philosophers ruled this guy out or is it similar to the Is God Real question where no one has yet come up with a compelling argument?",
        "created_utc": 1673877587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of time",
        "author": "No-Health3920",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dedf2/philosophy_of_time/",
        "text": "Assuming that Eternalism and the Block Universe are true, what would happen if someone travels to the future to meet me from 2050? Will myself from future interacting with a time traveler be conscious? Would anyone be conscious or \"robots\" if someone travels to the 2050?",
        "created_utc": 1673875171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for advice: on what philosophical subject should I specialize?",
        "author": "barboozephilosophy1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ddf5t/searching_for_advice_on_what_philosophical/",
        "text": "Pretty common here I'd imagine but I'm really clueless so please hear me out.\n\nI studied philosophy in Germany and France for 7 years now, got my Masters Degree from Universities in both countries. In my studies I specialised in Husserl and Phenomenology, my subject for my Masters Thesis was \"Le monde de la vie comme unité entre subjectivité du connaître et l'objectivité du contenu de la connaissance\" or \"The Lifeworld as unity between the subjective nature of the act of apprehending and the objectivity of knowledge\". Unfortunately I don't see a professional future here. Not because of the subject itself, but because it is a rather theoretical subject with no practical usage, which means the only professional path would be academics but I fear to not bring the neccessary persistance nor the necessary political skills with me.  I passed my Masters with mostly 1,0s so I'd say I'm not bad -but only one professor gave me a 4,0 so now I'm down to 1,7 alltogether - mediocre. My Universities weren't bad neither but also not Sorbonne or Humbold. I tried finding a practical usage or speciality where I can use what I did so far but I found none. While studying I mostly worked as a Bartender and earned a bit of a reputation there too - but I didn't do anything besides bartending where I earned practical skills that I can combine with an philosophical approach. As for gastronomy and philosophy together they seem to be incompatible to really start a carreer.\n\nMaybe you find something of yourself here too and you have tipps or specialities I can look into?",
        "created_utc": 1673872363,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this statement affirming the consequent fallacy?",
        "author": "PersonalitySea3871",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dd9p1/is_this_statement_affirming_the_consequent_fallacy/",
        "text": "\"If determinism is true, we don't have free will; hence, determinism must be true, since we certainly don't have free will.\"",
        "created_utc": 1673871897,
        "upvote_ratio": 1.0
    },
    {
        "title": "is getting MA in philosophy of culture and aesthetics worth it?",
        "author": "RMSANSA",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dcaam/is_getting_ma_in_philosophy_of_culture_and/",
        "text": "i'm not sure if such a question is appropriate in this subreddit, but i really need some guidance/advice right now, i will delete this post later if the admins don't remove it first.\n\nin short, i'm interested in philosophy of culture and aesthetics and always planned on getting MA, but i'm not sure if i want to be teaching philosophy, so i wonder if getting MA in philosophy of culture will be useful for me or open those doors people often talk about (though i wonder if any humanities degree really opens any doors on its own).\n\nfor more context, i'm interested in working in a field adjacent to the arts, culture and media.",
        "created_utc": 1673868707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on how to become a stoic",
        "author": "sia_q",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10db4a4/advice_on_how_to_become_a_stoic/",
        "text": "How can I become a stoic?",
        "created_utc": 1673864542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain Kant's transcendental apperception?",
        "author": "hansabonnement",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10dapxa/can_anyone_explain_kants_transcendental/",
        "text": "I have an exam on Kant this Wednesday. Could any of you guys explain to me the concept of 'transcendental unity of apperception'?",
        "created_utc": 1673863108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a perfect circle exist in reality",
        "author": "helblemackypZU",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d8shs/can_a_perfect_circle_exist_in_reality/",
        "text": "[removed]",
        "created_utc": 1673855901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translations vs original, especially as it relates to 20th century books?",
        "author": "pouyank",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d8lz8/translations_vs_original_especially_as_it_relates/",
        "text": "I’m a language learner (decent enough of Japanese to read novels and conversational at Chinese) and get weirded out when I read translated works. Recently someone gave me Sartre’s being and nothingness and asked me to read it. Having immersed myself in lots of Chinese/Japanese media I’ve found that translation quality varies widely and I don’t want to get a significantly worse version of this book as a translation than the original French.\n\nNow I understand that a book like this might be different than say an adventure show with lots of dialogue. Generally speaking are translations of philosophy books from the 20th century as good as their source languages?",
        "created_utc": 1673855217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do logical fallacies come from?",
        "author": "TheSmallestSteve",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d8hm4/where_do_logical_fallacies_come_from/",
        "text": "Is there some historical figure who coined them all, or is it more like a slow accumulation over the centuries? Who decides what is or isn't a valid logical fallacy?",
        "created_utc": 1673854778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources on ontology",
        "author": "Bitter_Sample1635",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d6utf/resources_on_ontology/",
        "text": "I’m in a phd program and I’m writing my dissertation on ontology but from a depth psychology perspective. My research is mainly focused on decolonial theory, the decolonial turn in ontology, pluriversality, and ontological design. It became clear to me that I need to understand the philosophical roots of ontology. What texts should I be reading to build a foundation in this area? Any and all guidance is appreciated.",
        "created_utc": 1673849229,
        "upvote_ratio": 0.99
    },
    {
        "title": "Suggest introductory books/articles/etc. to ontology and epistemology",
        "author": "Automatic-Solution32",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d5tl6/suggest_introductory_booksarticlesetc_to_ontology/",
        "text": "I am a student of English Literature and have studied philosophy as a subject for two semesters in my MA. I have read a little of the Greeks, Hume, Leibnitz, and Kant.\n\nI need to learn about the strands of ontology and epistemology in relation to memory and body studies to further my project. What books/articles/papers/essays/anything else would be a good introduction to these concepts?\n\nI am thinking of Heidegger's \"Being and Time\" and Sartre's \"Being and Nothingness\" for ontology (unsure of what translations to go for), and \"On What There Is\" by Orman Quine and \"Knowledge Very Short Introduction\" for epistemology. Are these feasible options?\n\nAny responses would be appreciated. Thank you in advance!",
        "created_utc": 1673845870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do some goals out way other goals?",
        "author": "Puzzleheaded_Line210",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d5ph4/do_some_goals_out_way_other_goals/",
        "text": "\nI just thought of this day you invent a brain implant but it’s for mind control no one knows it’s for mind control and the whole/vast majority of the world gets these brain implants one of your employees finds out it’s for mind control and makes a virus to self detonate the implants like a few million people every minute takes 20 minutes to kill everyone. Your not going to let everyone die so you deactivate the brain implants and of course after this people take them out. Did the employee do the right thing? Also the reasons for the mind control are to make a better world. Is free will more important then a perfect world? How far are you willing to go in the name of freedom?",
        "created_utc": 1673845515,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's it called when someone uses a line of reasoning that requires you to accept the premise? For example \"everything is subjective, therefore sharks eat grass\" ?",
        "author": "Liminal_Being",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d5oru/whats_it_called_when_someone_uses_a_line_of/",
        "text": "",
        "created_utc": 1673845457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there other examples of the thought exercise seen in The Library of Babel and in the Academy of Lagado in Gulliver's Travels?",
        "author": "quenuo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d50fc/are_there_other_examples_of_the_thought_exercise/",
        "text": "Ok, bear with me. This is my first Reddit post in all my 18 years.\n\nI've been reading *Gulliver's Travels* for the first time and I'm on the part when Gulliver is looking at all the scholars in the Academy of Lagado (Part III Chapter V). One of the innovations includes creating random sentences and then writing them down. Then, a scholar will read through the volumes of random sentences and eventually \"give the World a complete Body of all Arts and sciences.\" This is a hilarious caricature of a lofty professor whose pursuit of knowledge is meaningless and useless but I found interesting this idea of \"randomly colliding words until we find the cure to cancer.\" I think that it's one we've all thought about at some point in our lives (probably as children) and that is obviously easily dismissed as an actual solution to the problems of life.\n\nBut I also felt a bit of Deja vu because I recently read *The Library of Babel* by Jorge Luis Borges and it seems to think about the same idea. People's quest to find meaning from random sentences.\n\nI was wondering if there are any other examples of writers/philosophers talking about this idea. I think it would be interesting to look into if this idea was one that was built and expanded on over time, or if there are examples of thinkers who came up with this idea without being inspired by an earlier philosopher. Was there a philosopher separated from Western Philosophy who came up with this same thought exercise without influence? And I can't believe that Swift (who wrote Gulliver's Travels in the 18th century) was the first one to come up with something this simple, so who was the first Western Philosopher who thought of this?\n\nI'm not looking for how Borges's Library of Babel has been referenced since its creation. I'm looking for sources/writings of thinkers besides Borges and Swift talking of this idea (and conclusions to be drawn from it).  Also, maybe someone has already written about this??? Link me that kind of writing too please!\n\nThanks so much, hopefully, this makes sense. This is entirely out of curiosity. Also, I'm pretty stupid so I'm sure there's an obvious example I'm forgetting but that is ok. Have a good day :)",
        "created_utc": 1673843369,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle unverifiable prepositions?",
        "author": "twaraven1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d3ct3/how_to_handle_unverifiable_prepositions/",
        "text": "Hey,\n\ni'm not a philosopher, but dabbeling a bit with philosophy lately, among others also Buddhism. And I came across a problem:\n\nThe whole premisse of Buddhism (reaching Nirvana and escaping the cycle of birth and death) stands and falls with the preposition of Karma and Rebirth. If there's no Karma and Rebirth, than there is nothing to escape from and so on.\n\nBut the existence of Karma and Rebirth are unverifiable, like the existence of a God might be unverifiable.\n\nSo I wanted to ask: What is a good way to think about it? I tend to go the rather rationalist route as \"If these proofs are unverifiable I have no reason to believe in them.\" But the unavailability of proofs doesn't necessarily mean the non-existence of something.\n\nI would like to know your insights on this topic. I hope it makes sense.",
        "created_utc": 1673838414,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your consciousness experiences time, does all time passes by when you die?",
        "author": "craz93",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d2l2e/if_your_consciousness_experiences_time_does_all/",
        "text": "Thus when you die, infinite time passes by since your consciousness no longer exist.",
        "created_utc": 1673836192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any proposed mathematically rigorous ways to separate hierarchies of emergence? How can I quantify the number of emergent \"layers\" exist in a hierarchy?",
        "author": "029187",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d2g2r/are_there_any_proposed_mathematically_rigorous/",
        "text": "A storm can be considered to be an emergent phenomenon of the molecules in the atmosphere, which are emergent from atoms, which are emergent from subatomic particles, etc.\n\nIts clear to me that each layer is built from the lower layer, but its not clear to me how many layers exist in total. For example, I could skip molecules and go right from weather to atoms, saying weather is emergent from atoms. Is there any clear way to start counting how many layers exist, so that one would know if they have \"skipped\" a layer? \n\nWould the existence of strongly emergent phenomena change said counting methods?",
        "created_utc": 1673835785,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am doing a speech about the different perspectives of nihilism, existentialism, and absurdism for a project. I need consultations.",
        "author": "sunsetboulevard3005",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d1p40/i_am_doing_a_speech_about_the_different/",
        "text": "[removed]",
        "created_utc": 1673833693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophers who are good to read at the same time as studying Jung.",
        "author": "Melodic_Plastic_2022",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d1bez/philosophers_who_are_good_to_read_at_the_same/",
        "text": "Are there any philosophers whom are also good to read while studying Jung? I am thinking of reading/studying a little bit of Nietzsche since I have heard that they are a good mix together academically due to Jung being a “student” / influenced by Nietzsches school of thought. I already have decent background knowledge on some various thinkers one of which is Nietzsche and other 19th/20th century  philosophers of the time.",
        "created_utc": 1673832627,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does modern Philosophy say about souls?",
        "author": "ElongatedLiberal",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10d021f/what_does_modern_philosophy_say_about_souls/",
        "text": "I was thinking about the idea of souls and began to realize I have a very shallow understanding of what a soul is. I know many past philosophers, such as Plato and Aristotle, believed in a soul, but in our time, where agnosticism is more widely accepted, do their interpretations still hold any weight or meaning? Do modern philosophers have maybe a more modern interpretation of what a soul is or if they even exist in a literal or metaphorical sense? And what would they define as a soul?",
        "created_utc": 1673829240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Topology have any impact on philosophical thought?",
        "author": "deadliestcurses",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10czz0w/did_topology_have_any_impact_on_philosophical/",
        "text": "Did Topology have any impact on philosophical thought? I know General Relativity had an impact on metaphysics, but I am not sure Topology had any impact.",
        "created_utc": 1673829027,
        "upvote_ratio": 1.0
    },
    {
        "title": "who are you?",
        "author": "lurotamo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10czivm/who_are_you/",
        "text": "",
        "created_utc": 1673827903,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does philosophy have to say about a fear of generative LLMs like Chat GPT?",
        "author": "Magicdinmyasshole",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cxurz/what_does_philosophy_have_to_say_about_a_fear_of/",
        "text": "I personally believe the rise of Large Language Models (LLMs) and other generative AI will cause some serious existential dread about the following plausible scenarios:\n\n\\-People with access to unfiltered LLMs will have a serious advantage in the market.\n\n\\-Some will suffer from feelings of unreality as they come to believe human thought can be reduced to code.\n\n\\-People will become deeply skeptical about the true authorship and veracity of all information.\n\nWhat resources could one consult to learn more about philosophical explorations of these topics?",
        "created_utc": 1673823742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is reproduction immoral in the current state of the world?",
        "author": "GamingWzy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cxpp5/is_reproduction_immoral_in_the_current_state_of/",
        "text": "Considering the crisis of climate change, increased levels of depression, and other worldly problems, is it morally right to bring another being into the world without they’re own choice?",
        "created_utc": 1673823420,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best works to read for defenses and critiques of psychoanalysis as philosophical method?",
        "author": "RyuEmeraldLoL",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cx613/what_are_the_best_works_to_read_for_defenses_and/",
        "text": "Hello all,  \n  \nWhenever I try and look for works that defend or criticize psychoanalysis, it’s usually talking about it in clinical treatment. While that’s a very interesting subject, I’m more interested about the use of psychoanalysis as philosophical method, but I come up short among the tons and tons of articles that talk about psychoanalysis in the field of psychology. Are there any good works that go over the arguments in favor of and against psychoanalysis as method in philosophy?  Thanks!",
        "created_utc": 1673822089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who said “power without ideals is useless, ideals without power are foolish?",
        "author": "Aserthreto",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cw4n6/who_said_power_without_ideals_is_useless_ideals/",
        "text": "It’s come up in my head and Google won’t tell me.",
        "created_utc": 1673819588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any good arguments against consequentialism?",
        "author": "alexgeo1397",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cvlj4/are_there_any_good_arguments_against/",
        "text": "I think the idea that the consequences of an event or action are what determine the morality of that event or action is the only reasonable framework we can use to make ethical decisions. In fact, I think it's practically self-evident, and therefore not all that interesting to argue about, and yet a lot of people have issues with it - or at least they think they do.\n\nI'll add some notes here about common responses to get them out of the way. Feel free to argue the following points if you think I haven't done them justice, though.\n\nNote 1: If you have redefined the terms \"good\" and \"bad\" to mean something like \"whatever deity X says is good or bad\" then fair enough, that's a rabbit hole I'm not interested in going down for the purposes of this post.\n\nNote 2: By far the most common objection to consequentialism I get is that it disregards intentions and motives. I never understood this claim, because the intentions of a person committing an act are obviously relevant to potential future actions that person might commit, which are part of the total consequences of their behaviour. Quick example in case this isn't intuitive: If you stab someone in the chest, it matters whether you intended to kill them or you did it accidentally: in the former scenario, what you're likely to do next is stab them again, probably until you're sure they're dead; in the latter scenario, what you're likely to do next is rush them to the hospital, potentially saving their life. So, while the immediate consequences of the stabbing were identical in both scenarios, this assessment doesn't consider the greater consequential landscape, which includes potential, future consequences.\n\nNote 3: Another common retort: Consequentialism is not practical, partly because it tends to demand too much of people. The classic example goes something like this: Is it ethical for a doctor to cut out the organs of one of his healthy patients and distribute them amongst 5 unhealthy ones, thereby sacrificing one to save many? Well, if the doctor and the 6 patients existed in a vacuum and not in a functioning society with billions of other people, then sure. But can you imagine the consequences of making such behaviour legal and permissible? Yes, some people might survive for longer than they otherwise would have, but at what cost? Obviously, the consequences of transforming our society into one in which people are horrified to go to the hospital, or send their kids there, because their doctor might decide to murder them to save a stranger would be horrific.\n\nIs there anything I haven't considered that makes a strong argument against consequentialism as a general framework to determine the morality of past actions and a guide to decide how to act in the future?",
        "created_utc": 1673818290,
        "upvote_ratio": 1.0
    },
    {
        "title": "What viewpoints are very compatible with this saying: \"We do not deserve anything. Don't think too deeply about it\"?",
        "author": "Sweet-Song3334",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cvfoi/what_viewpoints_are_very_compatible_with_this/",
        "text": "First comes to mind Nihilism, but I want to be aware of some others where this statement might be common. Or maybe I might be wrong with that statement sounding nihilistic?",
        "created_utc": 1673817907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is There A General Order to Reading Philosophy?",
        "author": "AspiringPerspirant",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cvae6/is_there_a_general_order_to_reading_philosophy/",
        "text": "This is something I have encountered in a few books by now, but I am currently reading Camus and it references Sade. I have also seen people mention online that I need to read Hume before Kant, Aristotle before Alasdair, etc. Is there a generalized order in which I should read? Or should I continue reading without background context?",
        "created_utc": 1673817550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absurdists of Reddit, in the myth of Sysiphus Camus, constantly speak about God as the most common philosophical suicide. What would be the secular \"now-a-days'' equivalent of this?",
        "author": "Skadiddl",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cva3l/absurdists_of_reddit_in_the_myth_of_sysiphus/",
        "text": "",
        "created_utc": 1673817531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of health",
        "author": "Muicle",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10ctbkg/philosophy_of_health/",
        "text": "Is there a field or branch about being healthy? Fasting and meals are important in some religions and There are ethical components in veganism for instance. But is there something in philosophy on healthy eating and exercise and the connection of body and mind?\n\nI hope I make sense. Thanks!!",
        "created_utc": 1673812929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can AI ever be Ethically unbiased?",
        "author": "WestTransportation12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cs7yw/can_ai_ever_be_ethically_unbiased/",
        "text": "This post stems from a long conversation i had with the new chat based AI ChatGPT in which i presented the paradox of ethical biases and how appropriate input values for an ethically based sourced system can never be inherently ethical.\n\nThe paradox was as followed:\n\nif AI/VI becomes advanced to the point in which the computational power surpassed its Base-2 limitations with the use of Neuro-morphic computational models that mirrored the synaptic neural pathways of a human brain which was then used as an aid for rational or ethically based decisions making. Wouldn't this then halt the progress thats being sought to achieved by the use of AI in the first place. This being because a paradox of sourced inputs materials arises.\n\nOn the one hand the model given can use input based on expert opinions within several fields who are say apart of a specific board or attained a certain level of authority in the subject matter academically to differentiate ethical biases and moral views. But this then creates a wall for entry of non commonly sourced opinions and findings that could progress a field as AI is not capable of creating its own models independent of past user input ( IE a AI could never draw an image that was inconceivable by humans etc). A example of this in Computer Science would be Kevin Mitnick who revolutionized the computer security industry but was also a High school dropout ( eventually gaining a college degree). Thus creating the issue that the decision making process would be beholden to the will of the few and to be enforced on the masses.\n\nOn the other hand allowing unfettered input from any laymen would undoubtedly allow for manipulation of biased systems in turn also allowing for unethical usage and the halting of progression in fields. ChatGPT suggested assigning values to certain moral and ethical beliefs to mitigate a unrestricted manipulation of the bias system that would be used for decision making but then goes on to say that but by also assigning said value to the system it is inherently placing an ethical bias on certain values thus detracting from the point of the system in the first place.\n\nGiven this paradox i do not believe it is possible for AI to feasibly be unbiased for decision making protocols even if the system was built with a framework that incorporated live brains to account for variables.",
        "created_utc": 1673810308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can artificial intelligence can ever be ethically unbiased",
        "author": "WestTransportation12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cs6im/can_artificial_intelligence_can_ever_be_ethically/",
        "text": "This post stems from a long conversation i had with the new chat based AI ChatGPT in which i presented the paradox of ethical biases and how appropriate input values for an ethically based sourced system can never be inherently ethical.\n\nThe paradox was as followed:\n\nif AI/VI becomes advanced to the point in which the computational power surpassed its Base-2 limitations with the use of Neuro-morphic computational models that mirrored the synaptic neural pathways of a human brain which was then used as an aid for rational or ethically based decisions making. Wouldn't this then halt the progress thats being sought to achieved by the use of AI in the first place. This being because a paradox of sourced inputs materials arises.\n\nOn the one hand the model given can use input based on expert opinions within several fields who are say apart of a specific board or attained a certain level of authority in the subject matter academically to differentiate ethical biases and moral views. But this then creates a wall for entry of non commonly sourced opinions and findings that could progress a field as AI is not capable of creating its own models independent of past user input ( IE a AI could never draw an image that was inconceivable by humans etc). A example of this in Computer Science would be Kevin Mitnick who revolutionized the computer security industry but was also a High school dropout ( eventually gaining a college degree). Thus creating the issue that the decision making process would be beholden to the will of the few and to be enforced on the masses.\n\nOn the other hand allowing unfettered input from any laymen would undoubtedly allow for manipulation of biased systems in turn also allowing for unethical usage and the halting of progression in fields. ChatGPT suggested assigning values to certain moral and ethical beliefs to mitigate a unrestricted manipulation of the bias system that would be used for decision making but then goes on to say that but by also assigning said value to the system it is inherently placing an ethical bias on certain values thus detracting from the point of the system in the first place.\n\nGiven this paradox i do not believe it is possible for AI to feasibly be unbiased for decision making protocols even if the system was built with a framework that incorporated live brains to account for variables.",
        "created_utc": 1673810208,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would a Stoic do when it comes to making an optimal choice?",
        "author": "diamond_head_01",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cs4kl/what_would_a_stoic_do_when_it_comes_to_making_an/",
        "text": "I was reading about Stoicism and I understood that it expects people to suffer without complaining. The reasoning being that if it's not something we can control then it's not wise to think we are suffering because of it. It also expects people to have a sort of pessimistic view about things because then they wouldn't be disappointed when things don't go their way. \n\n\nNow my question is how would a Stoic then choose something optimal? Suppose he wants to get married. Does he choose any woman and expect all negative traits in her? That way he won't be disappointed and even if he sees one or two good traits in her he'd be pleasantly surprised. It doesn't seem reasonable to me because there are lots of other ways a person goes about choosing a life partner with arguably much better outcomes. So, if someone can clarify this stance of a Stoic, I'd be very thankful.",
        "created_utc": 1673810088,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Kant justify his ethical or religious views if they yield no cognition?",
        "author": "sb-hislittlebitch",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cre6c/how_does_kant_justify_his_ethical_or_religious/",
        "text": "How does he, for example, differentiate his attempts to provide formulas for the categorical imperative if they cannot lead to knowledge, etc. \n\nDoes having no cognition of a subject not entail that enquiries into are ultimately fruitless?",
        "created_utc": 1673808374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a philosophy that combines egoism and solipsism in some way?",
        "author": "Endermaster42069",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cr83t/is_there_a_philosophy_that_combines_egoism_and/",
        "text": "I've been wondering if some kind of philosophical belief exists that combines egoism with the idea that other people's well being does not have any intrinsic value. It would not make rational sense in my idea to say that being moral to other people is actually worth anything unless it advances my own goals, if I'm not experiencing life through other people's eyes than it follows that their happiness shouldn't be a factor in my decisions.",
        "created_utc": 1673807981,
        "upvote_ratio": 1.0
    },
    {
        "title": "any good books that explore what makes a human, well, human?",
        "author": "Ok-Mousse-2460",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cr25d/any_good_books_that_explore_what_makes_a_human/",
        "text": " \n\nand how changing it into, lets say a cyborg, would still be human or not.",
        "created_utc": 1673807580,
        "upvote_ratio": 1.0
    },
    {
        "title": "If all life is to eventually end and become nothing, what’s the meaning of life?",
        "author": "FastCourse2921",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cqzl7/if_all_life_is_to_eventually_end_and_become/",
        "text": "",
        "created_utc": 1673807417,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this argument or philosophy (if it exists since it’s just something I remembered but haven’t looked into it) called?",
        "author": "_Uhtceare_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cqtey/what_is_this_argument_or_philosophy_if_it_exists/",
        "text": "Basically they claim that because the universe is eternal/infinite then this would mean everything is possible/happened. Meaning I’ve already wrote this post before and it could also mean I already wrote this post before in Mars too since the universe is infinite therefore everything is possible and have had happened.\n\n\nWhat is this called exactly; where can one further read about this?",
        "created_utc": 1673807012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kant and the French Rvolution",
        "author": "innocent_bystander97",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10cncbo/kant_and_the_french_rvolution/",
        "text": "I’m reading De Dijn’s 2020 book “Freedom: An Unruly History” and I was surprised to see that Kant is claimed to have been a supporter of the French Revolution and that (paraphrasing here) he suspected that some of the violence in the Terror was probably justified given the fragility of the budding French republic. Until now, I’ve thought precisely the opposite was true. Are De Dijn’s claims true? And, if they are, how could this “ends justifies the means” kind of thinking be squared with the Categorical Imperative?",
        "created_utc": 1673798633,
        "upvote_ratio": 1.0
    }
]