[
    {
        "title": "Are there any philosophical arguments *for* polytheism?",
        "author": "Victorreidd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tl1bw/are_there_any_philosophical_arguments_for/",
        "text": "",
        "created_utc": 1679041375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book that goes into explaining “othering” people?",
        "author": "throwawaythigh_highs",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tkhxw/book_that_goes_into_explaining_othering_people/",
        "text": "What I mean by “othering” people is focusing on an aspect of people that are different (like being LGBT, being low class, etc) and using it to demonize people and justify violence towards them under the guise of defending our society from degeneracy. I’d like a book that goes into depth with examples in history and explaining why this happens. Id also not just like a purely western-focused perspective, because I’ve met people from other countries who have experienced this and I would like to know more about this, not just about Naziism or White Supremacy. Thank you.",
        "created_utc": 1679039350,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why when we have to pick a number from 1-10 we almost always pick 7?",
        "author": "Itsmecupheadfan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tkagm/why_when_we_have_to_pick_a_number_from_110_we/",
        "text": "",
        "created_utc": 1679038542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which philosophers and philosophical arguments completely disavow even euthanasia?",
        "author": "dididiodkdkk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tjjvr/which_philosophers_and_philosophical_arguments/",
        "text": "[removed]",
        "created_utc": 1679035803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this argument valid?",
        "author": "DLwegoyo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tj38q/is_this_argument_valid/",
        "text": "The French are frogs, you are a French, you are a frog.\n\nFor all French they are Frogs, you are a French, you are a frog",
        "created_utc": 1679034169,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Phaedo Socrates compares the body to a physical prison. How does the body become an obstacle to knowledge according to Plato? How does Aristotle re-imagine the relationship between body and mind in De Memoria?",
        "author": "AcanthisittaKlutzy93",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11th9ul/in_phaedo_socrates_compares_the_body_to_a/",
        "text": "",
        "created_utc": 1679028145,
        "upvote_ratio": 1.0
    },
    {
        "title": "if there is no such thing as objective goodness, objective morality, objective ethics then why do people pretend to be \"a good person\" online and offline? why not be savage instead?",
        "author": "BlackRoseOcean",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tgrcl/if_there_is_no_such_thing_as_objective_goodness/",
        "text": "if everyone has a different reality and different conscience then why do people pretend to be a good person? and if they do pretend to be a good person (no lying, no cheating, no abuse, no theft, no backstabbing) then why not accept that there are universal standards of morality, goodness and ethics? \n\nI feel like people preach objective morality and ethics when it suits them and then go their own way when it comes to their own needs and wants.",
        "created_utc": 1679026521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why might embodied cognition be important in understanding consciousness ?",
        "author": "Blizzwalker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tf90y/why_might_embodied_cognition_be_important_in/",
        "text": " Why would thinking have to take place ( or evolve) in some kind of matter ?  Would only some version of monism pose this as a necessity ?",
        "created_utc": 1679022121,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've seen it said that psychological egotism is not testable. What other explanations for people's actions *are* testable, and can't psychological egotism be merged with modern neoclassical economics to 'test' it?",
        "author": "JustTaxLandLol",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11td1hd/ive_seen_it_said_that_psychological_egotism_is/",
        "text": "From wikipedia,\n\n&gt;Psychological egoism is the view that humans are always motivated by self-interest and selfishness, even in what seem to be acts of altruism.\n\nTo me, it seems that if we can quantify people's interests honestly and then model their choices, we can see whether they act out accordingly. Of course this is limited to experimental settings. It's not very easy to get honest answers of why people may or may not job on grenades and then test if they act accordingly.\n\nRegardless, what alternatives are there? To say that people carry out actions when they had consciously considered better alternatives consciously acknowledged they were better, and then did something worse doesn't seem possible. I guess there's a way around it by allowing people to consciously value other people's well-beings but excluding that from the calculus of what is considered their self-interest.  Is psychological egoism contradicted by bounded rationality or something?",
        "created_utc": 1679016099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any editions of Karl Jaspers complete works?",
        "author": "External-Basil5165",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tchh7/are_there_any_editions_of_karl_jaspers_complete/",
        "text": "Hi! I'm looking for Karl Jaspers complete works either in english or spanish. I've tried seaching them on different places but I havent seen any edition gathering everything. Are you aware of any editions? If so, which one would you recommend? \nI appreciate any info on this. Thanks!",
        "created_utc": 1679014626,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between a polymath and a Jack of all Trades?",
        "author": "BwanaAzungu",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11tb61a/whats_the_difference_between_a_polymath_and_a/",
        "text": "*Jack of all trades, master of none*\n\n*But oftentimes better, than a master of one*\n\nI suppose the straightforward answer to my question is: a polymath is a master in many fields, and a Jack-of-all-trades has only superficial knowledge in many fields. \n\nBut suppose we have a random person, who has a widely varied set of experiences and expertises: would this person be considered a polymath, or a \"Jack\"?  \n\nOr in other terms: would we consider this \"superficial knowledge\" or \"profound wisdom\"? \n\nTrying to be more concrete: \n\n- How do we distinguish between, or recognize, \"superficial knowledge\" and \"profound wisdom\"?  \n\n- Can a \"superficial knowledge\" add up to \"profound wisdom\"?",
        "created_utc": 1679012101,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Cicero Approach Justice and Retribution?",
        "author": "beefsouvlakidinner",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t9z9d/how_did_cicero_approach_justice_and_retribution/",
        "text": "What were his thoughts on justice and punishment? Were there any contradictions between the way he wrote about justice and the way he dealt with fhe Catiline conspiracy?",
        "created_utc": 1679009203,
        "upvote_ratio": 1.0
    },
    {
        "title": "About true nothingness",
        "author": "Limember",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t974y/about_true_nothingness/",
        "text": "I don't even know if this is the right sub to ask but it makes the most sense. So, some time ago I struggled with some instrusive existential thoughts (and that's why i don't even like typing about this here), and ill try to describe it here to see if there's any philosophical concept for this. \n\nSo, i like talking about the movie \"Everything everywhere all at once\" to describe this. Basically, take the concept of everything, like the existence bagel in the movie, and when i say everything, i mean EVERYTHING: everything that is and could be, not just in our universe, but in existence in general, so an example is an universe where 1+1 = 3, or one where the concept of vision doesnt exist, or one where there are totally new unimaginable colors, think about if this was all a simulation of a simulation of a simulation... you really have to think outside the box.\n\nNow, look away from the bagel and look behind you, and what is there? Nothing, nothing at all, and that is the big epiphany that I feel I comprehended at that time (might just be me thinking I comprehended it, idk). Whenever i remembed and understood this, i had a breakdown and a panic attack because it was just too overwhelming and it disconnected me fully from my life, like nothing made sense or had value anymore. This led me to start taking 3 different meds. Another way of describing the feeling is that I was trying to wake up, like I was in a dream, but there's nothing to wake up to, so it's almost like I stopped existing, like existence (the everything kind) as a whole is fundamentally pointless. \n\nI'm fine now and can contain the thoughts because I know it will just go away, but has anyone else here experienced this, or at least heard about it? Because the fact that I haven't found anyone that understands the heaviness of this made me even worse at the time.\n\nThanks for reading.",
        "created_utc": 1679007496,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent does utilitarianism prioritize solving for extinction?",
        "author": "PowerfulPraline9038",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t8dcs/to_what_extent_does_utilitarianism_prioritize/",
        "text": "In more specific terms, does utilitarianism justify long-terminism principles? \n\nLet's say the term utilitarianism is broad in this topic, a doctrine that justifies an action as long it promotes pleasure and perhaps minimizes pain. \n\nDo utilitarian principles justify any action if it improves the chance of extinction? Or are there any caveats that are in order? \n\nFor example, letting 99.9% of the population die for .1% for humanity to continue on from an extinction level event with the alternative being everyone dies but lives a normal life before the extinction event. Would utilitarianism justify that or would it argue that it's only benefitting .1% of people and is bad for that reason?\n\n  \nI know of negative utilitarianism, but there are problems with that. Anyway, thanks for the help.",
        "created_utc": 1679005638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Taoism",
        "author": "BeneficialLunch3050",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t6bgs/question_about_taoism/",
        "text": "How are we supposed to let go of something that causes us anxiety and pain. Taoism is about letting go and flow but how are we supposed to let go of something if I can’t even take my mind off of it. All my decisions revolve around it. How am I supposed to let go? I can’t even take my mind off of it",
        "created_utc": 1679000864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I explaining the philosophy correctly?",
        "author": "Pouch_kine",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t6084/am_i_explaining_the_philosophy_correctly/",
        "text": " \n\n[https://youtu.be/pT70qgHicdI](https://youtu.be/pT70qgHicdI)\n\n\\*\\*\"\\*\\***I think therefore I am\"**\n\nHello, after having discussed with many friends and family, I have often been advised to open a YouTube channel in order to popularize philosophy. And it's true that I really like to make the notions of philosophy interesting and accessible by trying to balance what is boring or what wants to pass for \"intellectual\". So that's what I did in this video. I present Descartes, French philosopher and his main idea \"I think therefore I am\". I would have liked a feedback from the community !",
        "created_utc": 1679000148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Est-ce que j'explique bien la philosophie ?",
        "author": "Pouch_kine",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t5z68/estce_que_jexplique_bien_la_philosophie/",
        "text": " \n\n[https://youtu.be/pT70qgHicdI](https://youtu.be/pT70qgHicdI)\n\n\\*\\*\"\\*\\***I think therefore I am\"**\n\nHello, after having discussed with many friends and family, I have often been advised to open a YouTube channel in order to popularize philosophy. And it's true that I really like to make the notions of philosophy interesting and accessible by trying to balance what is boring or what wants to pass for \"intellectual\". So that's what I did in this video. I present Descartes, French philosopher and his main idea \"I think therefore I am\". I would have liked a feedback from the community !",
        "created_utc": 1679000081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Objective morality for atheists? How does it work?",
        "author": "MentalDespairing",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t5nlf/objective_morality_for_atheists_how_does_it_work/",
        "text": "I am a person who gets very sad and existentially depressed at creating my own meaning and have zero interested in creating my own meaning. To me the idea that all laws and morality is subjective means that a murderer and an altruist are both equally rights, since nothing is objectively good or bad, and all laws will be based on cold statistics, democracy and our worship of survival and art.\n\nAt the same time I don't believe any religion is true.\n\nDoes any philosophical ideology exists that coherently, without the original ideology requiring God and me just removing it and following it anyway, but an ideology that from the start says things are good and bad, without it being based on nihilistic survival or religion?\n\nBut it must be coherent. Not cherry picked from philosophers who required God in their worldview. I think Kantian morality requires a God and it is not entirely sincere to remove that and do non-religious deontology? Is this correct? Not just whether I **can** do so, but if it is absolutely coherent with the original deontology. \n\nI am not very well written or educated so sorry if this is phrased poorly. Hopefully someone will understand.",
        "created_utc": 1678999342,
        "upvote_ratio": 1.0
    },
    {
        "title": "what brings true happiness or joy?",
        "author": "accwowtp3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t45b5/what_brings_true_happiness_or_joy/",
        "text": "Temporary pleasures do not bring true happiness. \n\nAppreciating things and being grateful is what brings us happiness. \n\nWould love to hear any and all answers!!!",
        "created_utc": 1678995875,
        "upvote_ratio": 1.0
    },
    {
        "title": "What philosophers engaged with the following anti-realist description of knowledge and reality?",
        "author": "Early-Union-9895",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t2esa/what_philosophers_engaged_with_the_following/",
        "text": "I feel like there's a certain \"vibe\" in many accounts of science, especially social sciences, that could be summarised something like this: We get all our information as an unstructured, unmarked, fuzzy stream of data and the only way me make sense of it is by imposing concepts unto it and those concepts are constructed (mostly) socially.\n\nI find this position quite plausible but really struggle to make any coherent statement about is it as I mostly got to thinking like that in a very unsystematic manner.\n\nSo, are there any authors or schools of thought that suggested or discussed such ideas directly? Do I need to go all the way back to Kant or what?",
        "created_utc": 1678991854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uniqueness, immutability and existence of past",
        "author": "gigot45208",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t2568/uniqueness_immutability_and_existence_of_past/",
        "text": "It seems many of people view a past as something which is unique - for example they talk about “the past”, like there is one and only one, and they talk like there’s a truth about the past, as I’m what actually happened, and if we had the resources, the evidence, the acumen, we could figure out what it was.  Along those lines, they also seem to think a past can’t change.  If it was true yesterday that the heat won the nba championship in 2013, well then it’s gotta still be true.\n\nThree related questions I have around this : first one is how does one verify or find evidence to support any of this? After all these assumptions are fairly foundational. Second is  have philosophers done much investigation / discussion on this.  I’ve looked in SEP, not really found anything. Third question: I feel like there may be some ontological problems.  A past seems to be defined as not existing.  So hii oh w does one impart qualities to that which does not exist?\n\nThanks!",
        "created_utc": 1678991251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought experiment: To be cruel or to be a hypocrite?",
        "author": "HumanSoupForTheSoul",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t1axr/thought_experiment_to_be_cruel_or_to_be_a/",
        "text": "Not a philosopher, so my apologies if this is the wrong place. \n\n\nI was reading a book where a group of people was forced to play a death game. 2 experienced people A and B decide to abandon the newbies at the starting point knowing they might die without their help. \n\n\nA felt no remorse, as she think she is justified to do so. Every man for himself.\n\n\nB felt guilty and remorseful, and wish that the newbies can survive. But ultimately he still leave them behind.\n\n\nEveryone in the comment section prefers A, as she is at least straightforward with her intention, and calling B a hypocrite. \n\n\nBut for some reason, I think I would prefer B because he still has some morality within him. To me, there is 5% chance he might save a newbies, while A has 0% chance. And B's 5% chance outweighs A telling the truth.\n\n\nWhat are your thoughts on this?",
        "created_utc": 1678989403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lovers of philosophy: Your guidance is requested",
        "author": "CETVELBIRINCI",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t16pn/lovers_of_philosophy_your_guidance_is_requested/",
        "text": "I've been thinking of doing a P.h.d in philosophy. I have no experience in the field, but I love to read and write and think. I probably spend around the same time a week reading for pleasure as I do actual school work. Probably 20 hours of class and the same for reading.\n\nWith that being said, I have no idea what to expect. I did a physics major as an undergrad not even because I loved it, but just because I happen to be gifted at it that seemed like a good use of my tuition money. I took a couple classes my senior year and really enjoyed them.\n\nDoes anyone have experience going into philosophy after studying something different for undergrad? Is it reasonable to think I could study this and work 20-25 hours a week as a consultant or free lancer?\n\nI want to do something that challenges me and stimulates my mind alongside a business venture or job that will allow me to invest and have some freedom when I get older. I have no aspirations for going into the field of academia, but this is something I feel I can grow from and find personal satisfaction in.\n\nIs it reasonable to study a P.H.D for personal satisfaction? Is it reasonable to think I can do things outside of this at the same time? Does how highly ranked the grad school affect how difficult the work is for a P.H.D (ie if I apply to a school ranked lower, will it be better for my school, work balance?)\n\nSome extra information in order to give better advice on weather this is possible(not sure if this is relevant but, nonetheless):\n\nI have always done well in school but never at been at the top of my class, mostly because I get bored pretty easily and have trouble sticking to learning one thing at a time:\n\nI am graduating with a gpa around 3.8 in math and physics in three years at a school ranked between 50 and 100 in the US. I scored a Gre of 331, 167 quant, 164 verbal, 5.5/6 analytical writing which I think could qualify me for a good P.H.D program.",
        "created_utc": 1678989143,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Mark Fisher mean by the post-fordist “big Other”?",
        "author": "mackattacktheyak",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11t02fp/what_does_mark_fisher_mean_by_the_postfordist_big/",
        "text": "Am I understanding this right?: In Capitalist Realism, fisher talks about how postmodernity hasn’t really gotten rid of the symbolic or the big Other, and then he says that media takes our desires and preferences and gives them back to us as the desires and preferences of the big Other. I’m a bit confused on that part. Would it be correct to say that this is related to how social media and platforms like twitter take on an outsized importance when it comes to beliefs and opinions expressed, so that the most fringe and incendiary posts become representative of a conversation that most people aren’t really having? Or am I way off?  What IS the big other that he is describing in postfordist late capitalism?",
        "created_utc": 1678986704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do you think everything happens for a reason?",
        "author": "MAndrew502",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11szw0n/why_do_you_think_everything_happens_for_a_reason/",
        "text": "",
        "created_utc": 1678986322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to remember a philosopher who believed that what makes a person who they are, are their memories?",
        "author": "Fireredpokemom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sz3ef/trying_to_remember_a_philosopher_who_believed/",
        "text": "",
        "created_utc": 1678984584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can English majors do Masters in Philosophy?",
        "author": "TartOne7845",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sy98n/can_english_majors_do_masters_in_philosophy/",
        "text": "",
        "created_utc": 1678982717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do beliefs come from?",
        "author": "supr3me2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sxhza/where_do_beliefs_come_from/",
        "text": "",
        "created_utc": 1678981012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some years ago I read a Philosopher who firmly believed that the idea that man is made to be happy is a great lie. Does anyone know who that Philosopher may have been? And as a follow up, any opinions on this or recommendations on notable Philosophers who have also dealt with this issue?",
        "author": "Eden_Burns",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sx7iz/some_years_ago_i_read_a_philosopher_who_firmly/",
        "text": "I have to say, I am in sympathy with this idea. I believe that humans are made to survive and procreate, and any such things as happiness, unhappiness, anger etc are all just by-products of our consciousness, which has no intrinsic purpose, just as I believe life has no inherent purpose besides that which we choose to give it.\n\nAre there any philosophers who deal with this kind of thing specifically, and where?",
        "created_utc": 1678980337,
        "upvote_ratio": 1.0
    },
    {
        "title": "in a democracy what protects the interests of the losing side ?",
        "author": "ththeoryofeverything",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11swu04/in_a_democracy_what_protects_the_interests_of_the/",
        "text": "",
        "created_utc": 1678979474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Part 1 of the foundation of the entire Wissenschaftslehre.",
        "author": "lerook9",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11srb4y/part_1_of_the_foundation_of_the_entire/",
        "text": "Hi guys, I just joined the sub and I need some guidance. Is anyone familiar with this body of work? If yes, can you explain simply what is meant by \"The I posits in the I a divisible not -I in opposition to the divisible I?\" I'd really appreciate any help understanding this.",
        "created_utc": 1678965950,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts on the way Deleuze and Guattari uses language in Anti Oedipus?",
        "author": "writeleaves",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sp75k/what_are_your_thoughts_on_the_way_deleuze_and/",
        "text": "So apart from the fact that it's remarkably hard to comprehend, what do you folks think is going on in his writing? I'm reading the translation in English and it feels like a fever dream without even trying to make you understand what he's talking about. Is this some kind of idiosyncratic element of the French language or is this just a poorly written book, with some mind blowing and excellent insights?",
        "created_utc": 1678959109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is emergence something we ascribe because our models arent sophisticated enough?",
        "author": "blondebumseeker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sp5t0/is_emergence_something_we_ascribe_because_our/",
        "text": "I read an article on reductionism, which postulated that\n\n&gt;while you are obviously made of atoms, you are also more than just atoms. You, your dog, and the specifics of your person-dog affection could not be predicted, even in principle, even from perfect knowledge of all your elementary particles.\n\nBut if the universe cannot be fully explained with atoms and elementary particles, where do these emergent properties come from if not from the properties of constituent parts and if one knew all the rules of the universe, doesnt there need to be something inherently random to explain unknowable properties?",
        "created_utc": 1678958984,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the best principle that can guide you to live your life in the best way? isn't that the whole purpose of philosophy, to elevate human existence?",
        "author": "SoUnsure7",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11snmq7/what_is_the_best_principle_that_can_guide_you_to/",
        "text": "What's the best that the whole of philosophy can offer to mankind?\n \nWhy can't we come to a conclusion (regarding the best way to live) as a whole, even though so much time and energy has been spent in pursuit of learning and understand philosophy?",
        "created_utc": 1678953343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aren’t all a-priori truths merely a-posteriori truths as contained and described within natural human language? More precisely, are there any a-priori truths that can be reached, conveyed, or understood without using representational language?",
        "author": "Perma-Banned-AIDS",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sm6wu/arent_all_apriori_truths_merely_aposteriori/",
        "text": "",
        "created_utc": 1678947953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a philosophy that can help someone become more indifferent?",
        "author": "Realistic_Airport_46",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11slnmz/is_there_a_philosophy_that_can_help_someone/",
        "text": "As a kid, I discovered buddhism. Without being able to put it into words, I had just naturally developed a philosophy that can be described as such: I perverted the   concept of upekkhā.\n\nUpekkhā seems to mean something different to everybody, but practically applied, it is meant to develop the ability to give love and compassion without preference.\n\nMy misunderstanding of Buddhist philosophy turned into this idea that indifference was a virtue - the ideal that one should be unmoved by even tragedy or great fortune.\n\nHaving rebounded and spent some time not being so stone cold and uncaring, I think it's time for me to come full circle again and deliberately seek to develop indifference.\n\nIs there a particular philosophy that can help me develop myself in this way?",
        "created_utc": 1678946125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who/what can I read about animal rights and liberation?",
        "author": "barrie2k",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sl3l2/whowhat_can_i_read_about_animal_rights_and/",
        "text": "AFAIK Peter Singer does not support structural social change, just direct actions in his beliefs. I would love to read something a little less outdated, but if anyone has any insight LMK! Thank you in advance",
        "created_utc": 1678944187,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is knowledge based for those who deny that there is \"given\" knowledge that does not need justification?",
        "author": "yoshi888888888",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11si3fu/how_is_knowledge_based_for_those_who_deny_that/",
        "text": "",
        "created_utc": 1678935195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Hume seem to think that we have no a priori knowledge of matters of fact?",
        "author": "AllisModesty",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sgxtm/why_does_hume_seem_to_think_that_we_have_no_a/",
        "text": "Hume does not seem to argue for this, but rather asserts it at the beginning of enquiry 4. In 2 and 3, he's argued that we have no innate ideas, but rather all ideas come from experience.\n\nBut that is one thing. To say all propositions about what exists or what is the case are knowable only through experience is quite another. And doesn't seem to straightforwardly follow from the supposition that we have no innate ideas.\n\nSo, why does Hume seem to think this?",
        "created_utc": 1678932280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your strength is made perfect in weakness.",
        "author": "MikeSercanto",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sfu2k/your_strength_is_made_perfect_in_weakness/",
        "text": "",
        "created_utc": 1678929600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reasoning and evidence: is there any distinction between them?",
        "author": "pfcorn",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sfnke/reasoning_and_evidence_is_there_any_distinction/",
        "text": "Against my better judgement, I decided to scroll through the inner depths r/debatereligion and came across a [surprisingly interesting discussion](https://www.reddit.com/r/DebateReligion/comments/11kwxq4/2022_debatereligion_survey_results/jcd0j1t/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3) on whether there is any difference between evidence and reasoning. \n\nWhat do philosophers tend to think about this?",
        "created_utc": 1678929168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it evil to be selfish at all?",
        "author": "Jeylavas",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11seytg/is_it_evil_to_be_selfish_at_all/",
        "text": "Using an example, a man puts the needs of others first, to the point that he gets sick (physically or mentally) as a result of not caring enough about himself. Would the man be selfish (read:evil) if he put his needs first until he is no longer sick?",
        "created_utc": 1678927517,
        "upvote_ratio": 0.99
    },
    {
        "title": "How did Leibniz respond to Molyneux’s problem?",
        "author": "allusionsxp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sevvg/how_did_leibniz_respond_to_molyneuxs_problem/",
        "text": "I am currently reading about Leibniz vs Locke on the inmate was of ideas, but I can’t seem to find where Leibniz addresses Molyneux’s problem.\n\nBeing given a page number would be nice, but also a straight answer.",
        "created_utc": 1678927319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plotinus tale of a Basilisk?",
        "author": "DNVN04",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11seb1h/plotinus_tale_of_a_basilisk/",
        "text": "I’ve been stumbling around with a “reference” of a tale where Plotinus befriended a Basilisk, but the creature died as soon as it heard a cock crow.\n\nBut nothing about where the story actually came from, is there an actual tale of this? What was Plotinus the greek philosopher doing befriending a basilisk? I’m so confused, sorry if it doesn’t have to do anything with the subreddit.",
        "created_utc": 1678925958,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Heidegger was criticized on this view on philosophy of history?",
        "author": "Seadom6363",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sdgvc/how_heidegger_was_criticized_on_this_view_on/",
        "text": "I friend of mine said it was too theoretical and almost unapplicable... Did any historian applied his philosophy of history?? did anyone criticised it?\n\n&amp;#x200B;\n\nThank you very much.",
        "created_utc": 1678923892,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone explain this paradox?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11scxht/can_someone_explain_this_paradox/",
        "text": "somebody said “Imagine an archer is loosing an arrow at a target in the distance. It is acceptable to state that there is an infinite number of points betweens the head of the arrow and the target, yes? Now imagine the arrow has traveled half of its remaining distance to the target. Is it still fair to say there is an infinite number of points between the arrow head and its target? Now it covers half its distance again. Is there still an infinite number of points between the arrow and its target? And so forth.\n\nYou can always keep doing this, because in an infinite value, you can always keep dividing by half, and you'll always have more room to divide again.\n\nBut to say that because there is an infinite space that also means the arrow never reaches its target, is absurd. This is just part of the seemingly fallacious nature of infinite values.”\n\n\nwhat does this exactly disprove and how is it used in arguments?",
        "created_utc": 1678922591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aldous Huxley’s Brave New World - The New World State",
        "author": "0Beefs0",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11sb9oi/aldous_huxleys_brave_new_world_the_new_world_state/",
        "text": "Is it best for humans to live in blissful ignorance or a free world rife with suffering. Why?",
        "created_utc": 1678918724,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Kant's definition of reason?",
        "author": "Able-Cellist7700",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s9gi7/what_is_kants_definition_of_reason/",
        "text": "Not pure reason, just reason. One definition i've heard is “the origin of certain concepts and principles,” but this is a bit odd to me. When light enters my eyes and hits my retinas, the image is upside down and reversed, but my brain knows to flip the image right side up, would this be considered reason to Kant, as it is a necessary faculty of the mind to making sense of reality? clearly not, but I want to understand why not. Also, how does he distinguish categories from reason?",
        "created_utc": 1678914769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice (not a reading list question)",
        "author": "ben_wade54",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s8km5/advice_not_a_reading_list_question/",
        "text": "\nHey all, I’m majoring in philosophy and minoring in English at the University of Georgia. I’ve began studying philosophy heavily in my spare time. I am by no means an expert in philosophy, but I wouldn’t call myself a beginner either. I’ve taken my first philosophy class, and I’m actively reading comprehensive philosophy books about epistemology and existentialism(huge Nietzsche fan). I know it does not require a bookshelf of knowledge to begin formulating ideas, but I believe a vast, diverse pool of knowledge is extremely helpful. I have a few approaches that I’ve considered; any advice is greatly appreciated.\n\nApproach 1: Start from the beginning of philosophy and move chronologically through some of the major pieces in the discipline. \n\nApproach 2: Specialize in a field of philosophy on my own time and let my classes at UGA guide me through the history of philosophy.",
        "created_utc": 1678912845,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to read after Meditations by Marcus Aurelius",
        "author": "umlautsart",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s8jgh/what_to_read_after_meditations_by_marcus_aurelius/",
        "text": "Hi, so it's my friend's birthday soon and he's super close to finishing Meditations by Marcus Aurelius. I'm not gonna lie I know absolutely nothing about the book but for his birthday I want to get him something that's similar.\n\nwhat would you recommend for him? (bare in mind we are only 15)",
        "created_utc": 1678912778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought of this quote. Do you agree?",
        "author": "Bobinclear",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s7lv7/thought_of_this_quote_do_you_agree/",
        "text": "Being consistent is important but the wrong consistency brings inconsistency. Therefore we need inconsistency to be consistent.",
        "created_utc": 1678910726,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Kant's categorical imperative one is asked to \"act only according to that maxim whereby you can at the same time will that it should become a universal law\". But wouldn't I require a pre-existing moral system in order to decide what should become a universal law?",
        "author": "philippians_2-3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s781a/in_kants_categorical_imperative_one_is_asked_to/",
        "text": "Apologies if this is a dumb question. As I said in the title, it seems to me that in order to decide if something should become a universal law I require a pre-existing moral philosophy independent from Kant's moral philosophy.\n\nDoesn't this make the categorical imperative kind of redundant?\n\nAn example of this is if I were to ask a homophobic person if they would marry someone of their own sex and if they think that gay marriage should be a universal law, they would most likely say no. If I were to ask a more progressive person if gay marriage should be a universal law, they would most likely say yes.\n\nIn both cases, both persons used Kant's categorical imperative to come to a different conclusion, because they have different moral philosophies that inform their decision of what should or should not be a universal law.\n\nAm I misunderstanding Kant's categorical imperative? Thanks!",
        "created_utc": 1678909909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a waste of time to begin Capitalism &amp; Schizophrenia without having read many of what people call prerequisites for beginning D&amp;G?",
        "author": "supposed-throwaway",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s73uj/is_it_a_waste_of_time_to_begin_capitalism/",
        "text": "I am quite familiar with Marx and have a passing understanding of Kant and Nietzsche, but beyond that I don't know much about Freud, Lacan, Hume, Foucault or many of the others I've heard people talk about as prerequisites for understanding D&amp;G. I have heard a quote though from Deleuze recommending that even the layman just dive right into AO, which gives me hope, but I want to know if I really need to read some more before I do. I'm hoping that with the internet, making notes and diagrams as a tool i'll be able to (slowly) get through Capitalism &amp; Schizophrenia - am I mistaken?",
        "created_utc": 1678909665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moral Absolutism help PLEASE",
        "author": "_swiftie_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s6wfa/moral_absolutism_help_please/",
        "text": "Hey, so for school I have to compose a speech, memorize it, and present it in class. We're encouraged to do a speech about something we're passionate about. Recently I've really been into the concept of moral absolutism, that good and evil are a social construct/illusion etc. \n\nI've also been researching this quite a lot and for example, I know I want to include perhaps a quote or paragraph devoted to  Friedrich Nietzsche but the problem is I'm so lost :(\n\n I don't know how I should present my ideas, what order or quotes to use and I don't really know what to do for any of my other paragraphs.\n\nI want to make it easy to remember but not too dull and actually factual and interesting.  I really need help so any would be much appreciated !!!",
        "created_utc": 1678909223,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the difference between Autonomy/ Maturity in Immanuel Kant’s philosophy?",
        "author": "fictionalguyy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s5h11/whats_the_difference_between_autonomy_maturity_in/",
        "text": "How exactly does the concept of \"maturity\" differ from \"autonomy\" in Immanuel Kant's philosophy?\n\nAs far as I understand, the concept of „maturity\" corresponds to the everyday understanding of autonomy, but Kant defines autonomy quite differently in later texts (as a \"relation of one's own will to one's principles\" or something, I don't understand the difference...)",
        "created_utc": 1678906239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does pleasure always lead to pain?",
        "author": "jdc7733",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s4sio/does_pleasure_always_lead_to_pain/",
        "text": "",
        "created_utc": 1678904827,
        "upvote_ratio": 1.0
    },
    {
        "title": "How mental events cause physical events?",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s4e0p/how_mental_events_cause_physical_events/",
        "text": "",
        "created_utc": 1678904001,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about this quote? Can we correlate it to Nietzsche's perspective?",
        "author": "_nihilxander_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s479t/what_do_you_think_about_this_quote_can_we/",
        "text": "Under the influence of great fear, almost everybody becomes superstitious.\nCollective fear stimulates herd instinct, and tends to produce ferocity towards those who are not regarded as members of the herd.\nFear generates impulses of cruelty, and therefore promotes such superstitious beliefs as seem to justify cruelty.\nNeither a man nor a crowd nor a nation can be trusted to act humanely or to think sanely under the influence of a great fear. ~Bertrand Russell",
        "created_utc": 1678903613,
        "upvote_ratio": 1.0
    },
    {
        "title": "A quote from The Book by Alan Watts - are we just running from ourselves?",
        "author": "mirk__",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s3qsk/a_quote_from_the_book_by_alan_watts_are_we_just/",
        "text": "Hence the marvelously involved hypocrisies of guilt and penitence, and the frightful cruelties of pun-ishment, warfare, and even self-torment in the name of taking the side of the good soul against the evil. The more it sides with itself, the more the good soul reveals its inseparable shadow, and the more it disowns its shadow, the more it becomes it.\nThus for thousands of years human history has been a magnificently futile conflict, a wonderfully staged panorama of criumphs and tragedies based on the resolute taboo against admitting that black goes with white. Nothing, perhaps, ever got nowhere with so much fascinating ado. As when Tweedledum and Tweedledee agreed to have a battle, the essential trick of the Game of Black-and- White is a most tacit conspiracy for the partners to conceal their unity, and to look as different as possible.",
        "created_utc": 1678902671,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your best recommendations for someone who is going to start a major in philosophy?",
        "author": "EverettDonovan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s2h0k/what_are_your_best_recommendations_for_someone/",
        "text": "Things you expected that didn't happen, things you didn't expect that did, and the overall highs and lows of it.",
        "created_utc": 1678899939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Existence is weird",
        "author": "Southern-Astronaut-3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s0x4y/existence_is_weird/",
        "text": "Existence is weird when you think about from perspective out of religions and philosophy.. I feel nothing can explains it .. however we try to figure out and make it clear.. it’s still mysterious",
        "created_utc": 1678896612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy- ethics",
        "author": "No-Caterpillar-4628",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11s00rd/philosophy_ethics/",
        "text": "Does a person who has the capacity for decision making, have the right to make their life shorter in order to avoid suffering or to make their life better?",
        "created_utc": 1678894748,
        "upvote_ratio": 1.0
    },
    {
        "title": "What question of philosophical nature would you make regarding death and time? It has to be provocative and make people think. It's from school and I need help; please.",
        "author": "Welsh_Dragon13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rzkmo/what_question_of_philosophical_nature_would_you/",
        "text": "",
        "created_utc": 1678893768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Simone Weil discuss ontology? what were her views on Hegel?",
        "author": "obtusix",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rzfwn/does_simone_weil_discuss_ontology_what_were_her/",
        "text": "Does she formulate her own ontology? Can someone give me a brief rundown and also point out which book i will find her discussion in? What were her views of the Hegelian dialectic and Hegelian absolute?",
        "created_utc": 1678893492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoroastrian ethics",
        "author": "LordofLights21",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rx8oo/zoroastrian_ethics/",
        "text": "I've been curious about how Zoroastrianism related to the contemporary categorization of ethics ie: virtue ethics, deontology, consequentialism, etc. \n\nDoes anyone have some input on which system best fits the faith/ philosophy?",
        "created_utc": 1678888778,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the step up from a loaded question?",
        "author": "GuardianOfZid",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rw0y3/what_is_the_step_up_from_a_loaded_question/",
        "text": "As I understand it, a loaded question is one that makes a controversial assumption, such as “when did you stop beating your wife?”. What word or phrase would describe a question that makes a demonstrably false assumption? For example, if I was to verbally ask a person “when you do completely lose your hearing?”.",
        "created_utc": 1678886099,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would consitute life in the sense of a \"no killing rule\"?",
        "author": "Jeylavas",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rvcwh/what_would_consitute_life_in_the_sense_of_a_no/",
        "text": "Would it only apply to things that are alive in the sense of biology, or would it also apply to things that are only imitations of life, such as the Undead, Golems, or Robots? \n\nnote: I know that the Undead and Golems are not real, but I am using them as an example of what I am talking about.",
        "created_utc": 1678884436,
        "upvote_ratio": 0.99
    },
    {
        "title": "Can determinism and solipsism both be true or does one negate the other?",
        "author": "jimmymulligan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11run1g/can_determinism_and_solipsism_both_be_true_or/",
        "text": "[removed]",
        "created_utc": 1678882542,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am interested to widen knowledge about Heraclitus and interpretations of him. Please recommend reliable sources (texts, podcasts…) which offer actual insight.",
        "author": "whatshouldidohoney",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rtnen/i_am_interested_to_widen_knowledge_about/",
        "text": "I am particularly interested in Nietzsche’s and Hegel’s views on him, but interpretations from others are also welcomed.",
        "created_utc": 1678879816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone generate an example of a concept or object that does not contain concepts of each: triangle, circle/oval, square/rectangle?",
        "author": "doogle_126",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rt6w3/can_anyone_generate_an_example_of_a_concept_or/",
        "text": "I will give 50 bucks to the first person that can find an example missing one of the three both in any physical object, or any metaphysical idea. Due to the nature  of the question, you may reframe the question in any way you see fit, then give an example. But I have having *cogito ergo sum* levels of provability and very few Ideas after asking everyone I know.",
        "created_utc": 1678878439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good introductions to phenomenology and psychoanalysis",
        "author": "random_name70",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rsmz4/good_introductions_to_phenomenology_and/",
        "text": "I have been looking for good introductory works to phenomenology and psychoanalysis. Preferably in German , although English is perfectly fine as well. I do not know how introductions are usually written, but for phenomenology I would like to have some overview of Husserl, Heidegger, Merleau-Ponty etc. for psychoanalysis I am not very versed in, so a good overview of the basic traditions would be enough. On top of that, I like when there is a chapter on current theories and further reading suggestions.\nThank you :)",
        "created_utc": 1678876743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with understanding Badiou's idea about multiplicities",
        "author": "KariusForPresident",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rsdwp/help_with_understanding_badious_idea_about/",
        "text": "So I am reading a book with essays on Derrida but the author makes a lot of comparisons. At the moment I am at a place where he talks about Badiou and his ideas about \"the situation\", \"the emptiness\", \"the event\" and multiplicities. I have read previously on Deleuze's ideas about multiplicities but they seem to be in opposition with Badiou's.\n\nThe text in the book which I'm struggling with is a quote for Badiou: \"I call a situation every presented multiplicity, and the multiplicities can be consistent and inconsistent: an inconsistent multiplicity is a presentation which retroactively is understood as an non-singular (non-one) from the moment, in which being-one is a result; the consistent multiplicity is the multiplicity of the composition of the account, \"the multiplicity as \"many-singularities\" (\"many-ones\"), accounted for (calculated by) the action of the structure\". \n/The translation was done from Bulgarian to english by me, so it might not be perfect/\n\nI am really struggling with the current passage, especially with the idea about consistent multiplicities. Any help would be greatly appreciated. Thank you!",
        "created_utc": 1678875949,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is pleasure? Are there any issues with Aristotle's idea that pleasures are us exercising our natural capacities/dispositions?",
        "author": "Constant_Living_8625",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rrvva/what_is_pleasure_are_there_any_issues_with/",
        "text": "Here's the passage from Nicomachean Ethics I'm taking this from:\n\n&gt;Because pleasures are not A-to-B processes (not all of them even involve any such process). They are {activities}, exercisings [of our capacities], and hence are endpoints {and goals}.\n\n&gt;They don’t arise when we’re changing from A to B. They arise when we’re using [some part of our nature]. Not all pleasures have some other thing as their endpoint. That’s only true when people are being brought to a completion of their nature. That’s why it’s simply not right to say that pleasure is a ‘perceptible A-to-B process’. It would be better to say that it’s the exercising of our natural dispositions.\n\n(book VII chapter 12)",
        "created_utc": 1678874333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a label for someone who accepts Marx's \"negative\" thesis (analysis and critique of capitalism), but does not accept his positive thesis (views about communism)?",
        "author": "riverfallingpetals",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rqm84/is_there_a_label_for_someone_who_accepts_marxs/",
        "text": "For example, you might accept:\n\n1. That many of Marx's analyses and critiques of capitalism are true (for example, that capitalism will be superseded; that alienation of labor and commodity fetishization are real phenomena under capitalism, etc.)\n\nBut you also think that:\n\n1. Descriptive claim: Capitalism will not be followed by communism, but by something else.\n2. Regardless of the truth of the descriptive claim, you do not think that communism represents a morally good state of affairs.\n\nThanks.",
        "created_utc": 1678870038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can technology make old philosophy obsolete?",
        "author": "melody10511",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rpmti/can_technology_make_old_philosophy_obsolete/",
        "text": "The internet has already noticeably changed our social interactions. Also, starting from dental implants and neural prosthetics to eventual brain machine interface, the augmentation of human body with machines seems to be an inevitability. Recent advancements in AI and biotechnology are definitely making me nervous about the proximity of this future. I wouldn’t be surprised if there has already been a case of human being whose body consists more of artificial devices than of bones and flesh (can Stephen Hawking count as one?).\n\nIf we ever reach a point where the majority of individual’s physical and mental activity is handled by machines, are we the same humans in comparison to older generations?\n\nOnce they start drastically changing the human realities such as emotions, social interactions and aging, will older philosophical ideas still be valid? I guess my worry is that if technology can change our realities beyond recognition, older ideas will simply be obsolete since they are embedded in an outdated reality of older humanity.",
        "created_utc": 1678866612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the urge to detach from society have any reference in philosophy?",
        "author": "CommandOk8837",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rotmg/is_the_urge_to_detach_from_society_have_any/",
        "text": "Choosing to live alone or being alone for most of the time considered as a deviant from social structure?",
        "created_utc": 1678863807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the idea of ‘Instantaneous’ a fallacy?",
        "author": "Complete-Ad5058",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rne3i/is_the_idea_of_instantaneous_a_fallacy/",
        "text": "Can two things really be instantaneous? If you cut down the measure of time more and more (which you can do infinitely for the universe isn’t ‘pixilated’ and Plank-time is only the limit of measurement and not the unit of time) surly you will arrive at a ‘scene’ where given the right resolution one thing happens before the other? \nIt’s only our temporal perception that ‘approximates’ instantaneousness? \n\nMoreover, does this then mean that the Law of Identity could be applied to two things that are identical in every way except in spatial position (at the same time). \n\nWe can apply the LoI to two things that are identical in every way but exist in two different spatial coordinates (as long as not at the same time). Because every quality of them is identical still. Ie I am still me when in space or earth for the two things are identical just not at the same time. If there was something identical to me but in space at the same time, by law of Identity we’d be compelled to exclaim they are two different things. \n\nSo what if things are never truly instantaneous, surly then if we ‘play the footage slower and also slower’ we’ll arrive at a time where one ‘me’ exists before the other or is in space before the other on earth, so what then prevents us to assume that both me’s are the same thing for the are identical and not made instantaneous in time? (I admit this hypothetical is a poor example and relies on ‘time’ travel or faster than light speed travel to allow for the earth me to enter space quicker than what is perceived as ‘instantaneous’, when cutting up time more finely, but hopefully you get the idea)",
        "created_utc": 1678858975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accepted to both Leiden and SF State for an MA Philosophy -- Request for advice on which to choose",
        "author": "Lonely_Geologist6432",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rmz11/accepted_to_both_leiden_and_sf_state_for_an_ma/",
        "text": "[removed]",
        "created_utc": 1678857554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I less hypocritical if I acknowledge my hypocrisy?",
        "author": "SGdude90",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rmr53/am_i_less_hypocritical_if_i_acknowledge_my/",
        "text": "I was invited to a dinner for a project completion. I had freelanced for said project for merely 2 days, and considered my effort so minimal I didn't think I was a member of the team so I turned the dinner down  \nThe menu was sent out and they are serving lobsters, wagyu beef and crazy high end food in a top restaurant. I immediately accepted the dinner invite  \nMy friend pointed out my hypocrisy because I had claimed I wasn't a member of the team  \nI answered so what? It's a free high end meal. Why should I turn it down?  \nDoes acknowledging my hypocrisy make me any less of a hypocrite?",
        "created_utc": 1678856804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a philosopher who gives convincing reasons for why killing and/or causing grief to others is right?",
        "author": "Archi_violencia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11riohl/is_there_a_philosopher_who_gives_convincing/",
        "text": "The idea that there might be a long, hyper complex book that says this floating around in the internet screws me up, becaause I don't want to harm people lol.",
        "created_utc": 1678845644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me understand Hegel's concrete universal?",
        "author": "parcha_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rimwb/can_someone_help_me_understand_hegels_concrete/",
        "text": "",
        "created_utc": 1678845552,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a university work to do and I wanted some help, is basically criticize the theories of Rousseau, can anyone help me?",
        "author": "z0robr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ribth/i_have_a_university_work_to_do_and_i_wanted_some/",
        "text": "",
        "created_utc": 1678844835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Term that refers to all visual art?",
        "author": "color_sui",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rhxy8/term_that_refers_to_all_visual_art/",
        "text": "Idk if this applies here but I think it might just because it might help me understand aesthetics. Art you observe with hearing is called music and it applies to all genres but what about Art you observe with sight? Visual art doesn’t really have a term that I know if that refers to painting, sculpting, drawing, photography, etc all together. They normally just refer to it as the kind of art it is or just “art”. Maybe it’s because I’m coming from a musicians prospective but I’ve always seen these different forms of visual art equivalent, to different genres of music such as rock, jazz, Hip-Hop, etc and the different forms and styles of painting as subgenres like with Rock for example grunge, hard rock, indie etc. This is how I was able to understand visual art whenever I first got into it but now I’m kinda thinking it’s not comparable. I think it might be because there hasn’t been much of a reason to refer to visual art as a whole outside of rare occasions so they never created a term cuz it was unpractical but as of late I have found myself in the need for such but I haven’t really been able to find one. Maybe you can say that there is more then just music when referring to audible art such as having a conversation or slam poetry but I don’t necessarily think of them as audible art but then again maybe they are. Also with art that is observed with taste we normally call it food but sometimes it doesn’t have to be food such as the taste of smoking products but I do think it might be a bit of a stretch. Anyways I kinda just wanna know more opinions and if this question has been asked before and where. Also I want to know if there is a word for it cuz just saying “visual art” doesn’t really feel right.",
        "created_utc": 1678843952,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be some examples of Bodies without organs?",
        "author": "Nicominde",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rg0sm/what_would_be_some_examples_of_bodies_without/",
        "text": "Deleuze's and Guattari's ambiguous definition of the body without organs has me intrigued. They give examples for the empty BwO (that would be Schizophrenics, hypochondriacs and drug addicts) who destratified but didn't intensify, but I couldn't find any examples of full BwOs which both destratified and intensified nor cancerous BwOs which became too stratified and became fixated on predetermined objectives.",
        "created_utc": 1678840036,
        "upvote_ratio": 1.0
    },
    {
        "title": "If God has attributes that are additional to his essence, doesn’t that mean that he could have lacked those attributes?",
        "author": "Lokokan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rexsx/if_god_has_attributes_that_are_additional_to_his/",
        "text": "By definition, God’s essence would be the things that are necessary for God to be what He is. If he has attributes additional to the essence, then He could lack those attributes and remain God. So for example, he could be *not* knowing, powerful, etc.",
        "created_utc": 1678820142,
        "upvote_ratio": 1.0
    },
    {
        "title": "If there's a branch of philosophy called Philosophy of Logic, why does Rationalism fall under Epistemology (Philosophy of Knowledge)?",
        "author": "gonzo1483",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rd75u/if_theres_a_branch_of_philosophy_called/",
        "text": "",
        "created_utc": 1678816378,
        "upvote_ratio": 1.0
    },
    {
        "title": "What fallacy is this?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rd5vz/what_fallacy_is_this/",
        "text": "“you like murdering people in games therefore you like murdering people in real life?”\n\nit looks like the is-ought fallacy to me.\n\nit’s truthful that they like killing people in game but it does not ought to mean that they also like it in real life.",
        "created_utc": 1678816298,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think therefore I am Descartes",
        "author": "Positive-Isopod-9355",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11rbkyl/i_think_therefore_i_am_descartes/",
        "text": "Hi everyone, I’ve googled what was meant by this and this comes up.\n\n“I think; therefore I am” was the end of the search Descartes conducted for a statement that could not be doubted. He found that he could not doubt that he himself existed, as he was the one doing the doubting in the first place. In Latin (the language in which Descartes wrote), the phrase is “Cogito, ergo sum.”\n\nHow do we know that we actually think anything in the first place? I think therefore I am is expressed as a fact in this statement. How can we know that we have thought? \nIf I made his text I have a suspicion that I wouldn’t have expressed this as a fact like he did. \n\nI’m wondering if anyone else has thought what I’m thinking. \n\nI observe life in the current moment without recognition or interpretation of what a thought is. Or whether I even think. Let’s call this a state in which I don’t think.\nThus Contradicting “I think and therefore I am”?\n\nSorry if this is too unspecific to post. I’d like some discussion though. \n\nMany thanks everyone.",
        "created_utc": 1678812894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who belongs to the Humanity?",
        "author": "KarlT1999",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ra32e/who_belongs_to_the_humanity/",
        "text": "Is a question that we all inevitable need to answer however seeing Humankind or rather Homo Sapiens have already tried that against themselves with disastrous results I think that we ought to think atleast twice before answering that question.",
        "created_utc": 1678809653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is entering into a close relationship with significant mental health issues inherently unethical if you do not disclose those feelings to the person upfront?",
        "author": "c4hokian",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r8ilu/is_entering_into_a_close_relationship_with/",
        "text": "Given the high likelihood that later disclosure places a burden on/causes harm to the other person in the relationship, and the frequent weaponization of suicidality by abusive partners.",
        "created_utc": 1678806186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intellectual Property Contemporary Arguments",
        "author": "Lukeweaving",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r7r8i/intellectual_property_contemporary_arguments/",
        "text": "Hello!\n\nI have familiarised myself with the classical arguments in favour of property and ownership (Locke, Mill, Hegel, etc) but have become interested in the nature of intellectual property.\nAre there any contemporary arguments for/against intellectual property rights. Perhaps someone who has specifically adapted these classical views.\nI have tried to find some myself but for some reason I have had a hard time finding anything extensive or explicitly on intellectual property.\n\nThanks!",
        "created_utc": 1678804465,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should be more frowned upon, to be prejudiced against one race or a multiple, or be prejudiced against the entire human race?",
        "author": "DrawingDry4477",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r7pm8/what_should_be_more_frowned_upon_to_be_prejudiced/",
        "text": "I’m new to philosophy, so I don’t know if the question makes sense or not. But if you understand it, give me your answer.\n\nDetailed, please. Feel free to be poetic.",
        "created_utc": 1678804364,
        "upvote_ratio": 1.0
    },
    {
        "title": "How accurate are Bertrand Russell’s descriptions of socialism and syndicate anarchism in “Proposed Roads of Freedom”? How many teaspoons of salt should I take as I read this work?",
        "author": "staringdownwetpaint",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r5vrn/how_accurate_are_bertrand_russells_descriptions/",
        "text": "",
        "created_utc": 1678799911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of the Pathetic?",
        "author": "martialarts4ever",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r54ya/philosophy_of_the_pathetic/",
        "text": "Are there philosophers that challenged the conception of Patheticnes and what is socially Pathetic?\n\nOr philosophers that argued for Patheticness?",
        "created_utc": 1678797890,
        "upvote_ratio": 1.0
    },
    {
        "title": "difference between Heideggers Aletheia and Disclosure?",
        "author": "Largest_Half",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r3zkd/difference_between_heideggers_aletheia_and/",
        "text": "What is the difference between Aletheia and disclosure?",
        "created_utc": 1678794489,
        "upvote_ratio": 1.0
    },
    {
        "title": "what forms of logic should i learn?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r3lx9/what_forms_of_logic_should_i_learn/",
        "text": "is modal,deontic, temporal, doxastic, epistemic logic enough?\n\nor is there others that exist that i should study aswell, i need recommendations.",
        "created_utc": 1678793254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Schopenauers will --&gt; purpose?",
        "author": "Balder1975",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11r334f/schopenauers_will_purpose/",
        "text": "Is there any difference between Schopenauers \"will\" and what we understand as \"purpose\", or \"purposive behaviour?\"\n\nSchopenauer says the will to live is ultimate. Can it equally be said that all things have a purpose, which is to live, and that this purpose is the ultimate explanaton of all phenomena?",
        "created_utc": 1678791567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience Machine 352 (another one of those)",
        "author": "Art_is_it",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11qzhdx/experience_machine_352_another_one_of_those/",
        "text": "**Skip this part if you know the original experiment:**\n\nSumming up: you have to weight the pros and cons of entering a machine where your body floats in a tank while you live a perfect life in a simulation, without knowing it \"isn't real\". The question is wether you'd enter the machine or stay in your \"real life\". For most people who say they wouldn't enter, there's the counter argument that if someone came up to you right now, in this life, told you that you are already leaving a simulation while you're body is floating in a machine; would you like to leave and go back to your \"real life\" or would you rather stay in this simulation? You'd be less confident in your decision, but even if you wanted to go back, imagine if he told you that in your \"real life\" you're a prisoner in a maximum security prison? Most people would just stay in this life even if it's not \"real\".\n\n**Ok, now the Experience Machine #352 (everyone comes up with a new one):**\n\nIf someone came up to you and said you're in this machine for the last 10 years and if things are not going so well it's because the technology wasn't so advanced when you entered the machine. Also during all these 10 years your brain has been acquiring knowledge on how to set up the perfect life with the newest and best unconscious passive learning technology, while you were inside the machine, floating in the tank.\n\nIf you asked about how was your life before the machine they would tell that they only allow extreme cases of suffering to enter the machine and you were one of those, although they can't disclose all the information.\n\nHe would then ask if you'd prefer to stay here, leave the machine for good to go back to your \"real life\", or just reset the program and reprogram a \"new simulation\" with all you've learnt through all these 10 years. Also independently of your decision they'd ask wether you'd like to remember everything from this life or to erase it all.\n\n**The Twist**\n\nThe twist from the original experiment, as far as I can see, is both that we don't care about how real or not real our life is and that while pain and pleasure are still the most important aspects of life, we're still blindly following status quo bias. I say that because:\n\n1. I imagine that most people wouldn't want to go back to a case of extreme suffering.\n2. I'm assuming a lot of people would prefere to just stay here for loved ones and things like that even if this is a \"simulation\", no one is real, and you can have it 10 times better.\n3. The fact that most people probably wouldn't want to remember anything about this life right now, when heading to the new perfect life also reinforces both 1 and 2. 1: We just seek pleasure and 2: we rather be fooled and happy than know the story and be happy.\n\nBut I'm most uncertain about the third one... I'm not sure the massive majority would rather not remember.\n\n&amp;#x200B;\n\nIs there anything new or am I overlooking it? The question about remembering seems important to me but I can pinpoint exactly why. Can anyone enlighten me?\n\nThank you",
        "created_utc": 1678778069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience Machine 352 (another one of those)",
        "author": "Art_is_it",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11qyrqw/experience_machine_352_another_one_of_those/",
        "text": "**Skip this part if you know the original experiment:** \n\nSumming up: you have to weight the pros and cons of entering a machine where your body floats in a tank while you live a perfect life in a simulation, without knowing it \"isn't real\". The question is wether you'd enter the machine or stay in your \"real life\". For most people who say they wouldn't enter, there's the counter argument that if someone came up to you right now, in this life, told you that you are already leaving a simulation while you're body is floating in a machine; would you like to leave and go back to your \"real life\" or would you rather stay in this simulation? You'd be less confident in your decision, but even if you wanted to go back, imagine if he told you that in your \"real life\" you're a prisoner in a maximum security prison? Most people would just stay in this life even if it's not \"real\".\n\n&amp;#x200B;\n\n**Ok, now the Experience Machine version 352:**\n\nIf someone came up to you and said you're in this machine for the last 10 years and if things are not going so well it's because the technology wasn't so advanced when you entered the machine. Also during all these 10 years your brain has been acquiring knowledge on how to set up the perfect life  with the newest and best unconscious passive learning technology, while you were inside the machine, floating in the tank.\n\nIf you asked about how was your life before the machine they would tell that they only allow extreme cases of suffering to enter the machine and you were one of those, although they can't disclose all the information.\n\nHe would then ask if you'd prefer to stay here, leave the machine for good to go back to your \"real life\", or just reset the program and reprogram a \"new simulation\" with all you've learnt through all these 10 years. Also independently of your decision they'd ask wether you'd like to remember everything from this life or to erase it all.\n\n&amp;#x200B;\n\n**The Twist**\n\nThe twist from the original experiment, as far as I can see, is both that we don't care about how real or not real our life is and that while pain and pleasure are still the most important aspects of life, we're still blindly following status quo bias. I say that because:\n\n1. I imagine that most people wouldn't want to go back to a case of extreme suffering. \n\n2. I'm assuming a lot of people would prefere to just stay here for loved ones and things like that even if this is a \"simulation\", no one is real, and you can have it 10 times better.\n\n3. The fact that most people probably wouldn't want to remember anything about this life right now, when heading to the new perfect life also reinforces both 1 and 2. 1: We just seek pleasure and 2: we rather be fooled and happy than know the story and be happy.\n\nBut I'm most uncertain about the third one... I'm not sure the massive majority would rather not remember.",
        "created_utc": 1678775519,
        "upvote_ratio": 1.0
    }
]