[
    {
        "title": "Odds of being born",
        "author": "Atrox1980",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p3kz5/odds_of_being_born/",
        "text": "If you assume that a human being comes into existence as one of millions of egg cells , how does philosophy explain the incredible odds of someone’s birth? I am an observer, the odds of my birth are incredibly low , going back many generations , me being here today depended on the right egg cell being fertilized , going back many centuries. What are the possible explanations?",
        "created_utc": 1678590539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Accidents Have Essence?",
        "author": "AAA-Idk09876",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p2drz/do_accidents_have_essence/",
        "text": "",
        "created_utc": 1678587189,
        "upvote_ratio": 1.0
    },
    {
        "title": "The about section of this sub says the answer should reflect the state of reasearch. What does philosophical research mean?",
        "author": "dg_713",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p2da3/the_about_section_of_this_sub_says_the_answer/",
        "text": "Whay does it mean to be up to date with the latest of research in this or that field of philosophy? What is philosophical research? I thought most of the time involves a lot thinking as opposed to research.",
        "created_utc": 1678587149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing good for others without being morally based is Socratic. Any thoughts?",
        "author": "aperfectreality",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p23tv/doing_good_for_others_without_being_morally_based/",
        "text": "The most intelligent thing that a man can do in accordance with Socrates. Is to do good for others. I find situationally, like fixing something, solving a problem or i.e helping someone before oneself is merely a simple matter of practicality than morality in principal ethics. Is there any other way to see it about 200 years B.C? A fundamental prospect of being human.",
        "created_utc": 1678586431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you know that chairs exist?",
        "author": "Connect-Passion5901",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p1wb2/can_you_know_that_chairs_exist/",
        "text": "I want to make sure I have sufficient justification for sitting down.",
        "created_utc": 1678585832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any of you think you can know that chairs exist?",
        "author": "Connect-Passion5901",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p1grb/do_any_of_you_think_you_can_know_that_chairs_exist/",
        "text": "No one ever seems to have a response to this even though it's kind of important. Is it actually knowable at all?",
        "created_utc": 1678584616,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good philosophical arguments against the possibility of time travel into the past? (Philosophy of Time/Metaphysics)",
        "author": "ElisaC2003",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p13nk/what_are_some_good_philosophical_arguments/",
        "text": "I was wondering what are some good and powerful philosophical arguments against the logical and metaphysical possibility of time travel into the past. Some of the ones I am aware of are the grandfather paradox and closed causal loop ones. Are there any other ones in addition to these? If they are any good scientific arguments against it, then that is also fine to post. Thank you ☺️.",
        "created_utc": 1678583587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trolley Problem",
        "author": "spasteful",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p10li/trolley_problem/",
        "text": "Oh no! A trolley is heading towards 5 suicidal people. You can pull the lever to divert it to the other track, killing 1 person instead. What do you do?",
        "created_utc": 1678583361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why some people relate Identity Politics / Political Correct Language with Postmodernism?",
        "author": "eimai_papi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p0u23/why_some_people_relate_identity_politics/",
        "text": "First of all, I am sorry for my bad English, but English is not my first language.\n\nNow:\n\nI have met many people, online and IRL as well, who claim that IDPOLs and PC are somehow related / influenced by postmodern philosophy. This opinion is equally frequent in IDPOL/PC supporters, and opposers as well (as far as I can tell)\n\nI have noticed that Jordan Peterson and other conservatives heavily promote this idea (JP doesnt even understand psotmodernism at the first place!) but I cant see any other reason some people  have this view over IDPOL an postmodernism.\n\nI wonder if it has to do with Derrida's Deconstruction on linguistics. But besides that, postmodernism is about doubt / questioning. As far as I know, postmodern philosophers would have a completely different approach to many IDPOL / PC opinions about identity etc.\n\nI have also met IDPOL supporters who claim that they are also very influenced by Max Stirner and (who, although not a postmodernist, didn't like social constructs like identity) and other individualists.\n\nI don't want to start a thread about IDPOL/PC etc. It is not about if it's good or bad, if I am / you are with it or against it.\n\nI am just trying to find the relation between these and postmodernism, because I feel like there is not any at all.",
        "created_utc": 1678582873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Life Really Fair?",
        "author": "universe_isinyou",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11p0p3q/is_life_really_fair/",
        "text": "What do you guys think about life being fair or unfair to everyone? Honestly I have been on both spectrums of the thought. I used to think life is fair if we look at long term(the bigger picture) of our lives but now I have been more inclined towards life not necessarily being fair to everyone. Which sides are you on? Fair or unfair? If so, why?",
        "created_utc": 1678582507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any reading recommendations for virtue epistemology?",
        "author": "MicahJordan1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oyhqk/any_reading_recommendations_for_virtue/",
        "text": "What are some of the more prominent and/or influential readings (books or papers) in virtue epistemology?",
        "created_utc": 1678576939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the entirety of Nietzsche's philosophy be reduced to an argument for gay rights?",
        "author": "StopRacismintf2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oyfww/can_the_entirety_of_nietzsches_philosophy_be/",
        "text": "[removed]",
        "created_utc": 1678576813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Many questions I have about various philosophers.",
        "author": "TYLOPRO",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11owv1b/many_questions_i_have_about_various_philosophers/",
        "text": "Hello everybody! I have recently, in the past few years, started to study philosophy, and I have questions that I have written down over the past few months that I want some clarity on. There may be some obvious ones in there, but I am slow to pick things up with philosophy sometimes, and I would like others' opinions. I hope this post gets some attention and some really good responses!\n\n1.)  What is the significance of Kant’s claim that *sapere aude* is the appropriate answer to the question, “What is Enlightenment?” \n\n2.)  Does Kierkegaard believe that we can provide objective reasons for our faith in God, or would he argue against that?  \n\n3.)  How come the underground man believes it is difficult for a person of thought, or of sensibility, to become a person of action?\n\n4.) What are the differences Nietzsche claims exist between the moral, premoral, and extramoral periods.\n\n5.)  Why is Nietzsche so critical of slave, or herd, morality.\n\n6.)  What concept of true freedom does Kafka use in his story, “Report to an Academy”?\n\nThe following passages caught my interest, but I feel like I do not have that great of an understanding of their significance. Also the context and an interpretation of what they are saying put in a more easily digestible way would be fantastic. \n\n 1.)  “The means that nature employs in order to bring about the development of all of the predispositions of humans is their antagonism in society, insofar as this antagonism ultimately becomes the cause of a law-governed organization of society.” Kant, “Idea for a Universal History from a Cosmopolitan Perspective,” p. 6 (fourth proposition). \n\n2.)  “And we are fundamentally inclined to claim that the falsest judgments (which include synthetic judgments a priori) are the most indispensable to us, and that without accepting the fictions of logic, without measuring reality against the wholly invented world of the unconditioned and self-identical, without a constant falsification of the world through numbers, people could not live—that a renunciation of false judgments would be a renunciation of life, a negation of life. To acknowledge untruth as a condition of life: this clearly means resisting the usual value feelings in a dangerous manner; and a philosophy that risks such a thing would by that gesture alone place itself beyond good and evil.” Nietzsche, *Beyond Good and Evil* (§4).",
        "created_utc": 1678573028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions for Gregory B. Sadler",
        "author": "piccdk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11owaoq/questions_for_gregory_b_sadler/",
        "text": "Hey there!\n\nI am interviewing Gregory B. Sadler for my [podcast](https://www.anagogepodcast.com) this upcoming week.\n\nAnything that you'd like to ask him? I'm focusing mostly on philosophy teaching and stoicism, but happy to cover other topics also.",
        "created_utc": 1678571687,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are must-read books/articles in contemporary philosophy of science?",
        "author": "LordCarlos",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ovi5d/what_are_mustread_booksarticles_in_contemporary/",
        "text": "Hi, I'm familiar with all the big names of the 20th century in philosophy of science (Popper, Kuhn, Cartwright, etc.) but don't really know what the contemporary landscape looks like. Have there been any big movements that have taken place? What do most current philosophers of science talk about?\n\nI mostly want to read things published in the 21st century (but of course have some wiggle room).\n\nThanks!",
        "created_utc": 1678569724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we live to learn, or learn to live?",
        "author": "SniperMan16420",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oug9g/do_we_live_to_learn_or_learn_to_live/",
        "text": "",
        "created_utc": 1678567145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idealism without free will",
        "author": "Informal_Nebula_8489",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ou3xx/idealism_without_free_will/",
        "text": "Are there any idealist philosophers that deny the existence of free will?",
        "created_utc": 1678566296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do insects have souls or are they just biological machines?",
        "author": "ForestManJ",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11otwpb/do_insects_have_souls_or_are_they_just_biological/",
        "text": "I feel regret and remorse when I intentionally kill any insects such as spiders or mosquitos or flies.\n\nMy observations and my research has caused me to side more with the belief that insects do not have souls because they do not indicate self awareness or emotions or deep thinking.\n\nMost insects in most situations seem to act based on instincts and reflexes which means that they do not have free will. Free will requires souls to exist.\n\nI still have a lot of doubt in this idea. If I am wrong then that means that I have been killing insects with souls and ending their life on earth early.\n\nI want to make a conclusion based on all of your answers and ideas and also advanced research.\nI will also answer any additional questions that you will have.\n\nDo insects have souls?\n\nNote:\nI will also say that I know that insects are animals but I do not know what makes insects biologically different from humans and animals that have hair. I have a very small knowledge in biology and other science topics.",
        "created_utc": 1678565805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interpreting self-destructive behaviors:",
        "author": "uselessfuktoy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11otijr/interpreting_selfdestructive_behaviors/",
        "text": "How can we understand self-destructive tendencies - such as self-harm, addiction, or risky behaviors - in terms of their underlying motivations? Are they a form of rebellion against societal norms and values, a search for meaning and purpose, or do they primarily stem from weakness and surrender to internal and external pressures?",
        "created_utc": 1678564846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was early Marx at all influenced by the romantic ideals of unity/totality?",
        "author": "ThickRats343",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ot2fc/was_early_marx_at_all_influenced_by_the_romantic/",
        "text": "I was reading the 2nd chapter of Frederick Beiser’s Hegel and he explains how the Romantics’ central ideal was that of unity (and totality played a part in this), but that modern division of labor and developments in technology presented a problem for how to actually achieve this ideal (as the division of labor has people committed only to one task for their entire lives, meaning that they aren’t fully self-realizing the totality of their talents and abilities).\n(I might be butchering the explanation, so if you’re confused it’s all in section  two of Hegel: Early Ideals, mostly in the latter half of the section)\n\nIn the book, Beiser makes some comments about how alienation becomes an obstacle to achieving this goal, and he also says how Hegel was influenced by these romantic ideas. It occurred to me that, considering Hegel’s influence on Marx (and I think the fact that Marx definitely would’ve at least partially engaged or read some of the romantics), Marx could’ve been partly influenced by all of this to develop some of his early critiques of capitalism and capitalist division of labor as well as to develop the idea of alienation (which I understand for him will be different than it is for Hegel, but the term just caused me to make a connection).\n\nIf there’s not any strong influence here, I’m wondering if any other thinkers have considered that capitalism might stand in contrast to romantic ideals of self-realization of unity and totality. \n\nThanks in advance 🙏",
        "created_utc": 1678563716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who am I? what does it mean to be me?",
        "author": "Perfect-Engineer3226",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11os9z9/who_am_i_what_does_it_mean_to_be_me/",
        "text": "I was recently asked these two questions (why isn't important) and for the first time in a long time was stumped by them. Who am I?  And, What does it mean to be me? Both were great questions that I'm sure were meant to evoke introspection in my psyche, causing me to exit the other end with a deeper understanding of myself. Only it didn't. At first. Like the biblical character Job, I wrestled with this question till I was mentally exhausted. Sure I could have cheated and done some clicky-clacky web search on the matter, but I was genuinely interested in finding out for myself.\n\nI love philosophy and what it brings to the table. I enjoy learning about the obscure shoulders that others stand on to voice their understanding of matters and how it affects the world. Posing seemingly easy questions that in truth are difficult. The one that stood out to me the most was Heraclitus. His notion of Unity of Opposition or paradox speaks to me, and I'm sure many of you reading this as well. \n\nGrowing up, I was driven to be accepted or not outside the social circle. Later I grew to believe that I didn't need it though deep down I still pursued acceptance. Pushed love away because I hated myself yet craved it immensely. Hated being around people but loved social interaction. The birth of my firstborn was bittersweet because it ended one era and began another. Thirsted for knowledge, yet contempt in my ignorance. Pursuing perfection, falling short, seeking forgiveness yet incapable of forgiving myself. You see where I'm going. \n\nThis leads me to my first question, Who am I? Well, I am me. That's it. A culmination of life experiences just trying to do my best with what I got. Question number two, What does it mean to be me? Well, you already read it. I'm a paradox. I am two opposing truths on the same matter. I can't be who I am today if it weren't for who I was then. I can't know love if I don't understand hate. I can't accept others if I don't know what it's like to be unwanted. I can't be pleased by the birth of my firstborn if I haven't experienced death. Life is a two-sided coin flipped thru the air by chance and what it lands on is what I deal with. At least that's my understanding of it, right now.\n\nSo I pose the same question to the mass;\n\nWho are you?",
        "created_utc": 1678561811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are we here?",
        "author": "MoviesOnTheMoon",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11os1ux/why_are_we_here/",
        "text": "There cannot be absolutely nothing so there must be something. But why are we part of that necessary something? It seems incomprehensible.",
        "created_utc": 1678561279,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Peter Singer think about John Stuart Mill?",
        "author": "Noxempire",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oq7sw/what_does_peter_singer_think_about_john_stuart/",
        "text": "Did he ever directely speak about his views on his predecessors in terms of Utilitariansim? Considering they share their core framework but disagree about certain points, I am rather intrigued by that.",
        "created_utc": 1678556833,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your thoughts on the \"Pleasure Machine\" thought experiment?",
        "author": "onelaughterplease",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oq3j3/what_is_your_thoughts_on_the_pleasure_machine/",
        "text": "This whole thought experiment puts me on edge and every answer to this question I've seen feels incomplete, like there's something missing. For example, not all pleasure feels the same, like eating a delicious meal and watching your favorite movie feels different even though both are pleasurable and I think the distinction matters. \n\nBut also, it just feels impossibe to wrap my head around and I personally find it to distressing to think about, and I'm trying to find some closure.",
        "created_utc": 1678556533,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Soul and Creativity",
        "author": "dissertation101",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ooy96/the_soul_and_creativity/",
        "text": "**\\*Research survey - posted here to collect valuable diverse perspectives and contributions\\***\n\n**What is the soul and is it linked to creativity? Specifically, how did soul music come to be named after the philosophical concept?**\n\n**If you have a moment to help with postgraduate research by completing this survey, I’d be most grateful:** [**https://docs.google.com/forms/de1FAIpQLSfvpI6Qf7wHmM39RYg\\_\\_jcoHOW4TZHf4hOLYvMJEImWtjmeHg/viewform?usp=sf\\_link**](https://docs.google.com/forms/de1FAIpQLSfvpI6Qf7wHmM39RYg__jcoHOW4TZHf4hOLYvMJEImWtjmeHg/viewform?usp=sf_link)\n\n**Or feel free to comment on this thread!**",
        "created_utc": 1678553695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that on other planets creatures evolved to perceive time differently?",
        "author": "SaltPresent344",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oown3/is_it_possible_that_on_other_planets_creatures/",
        "text": "As I’m sure we all know, everything about how we perceive time is in our heads. There’s no such thing as a flow of time and the past present and future all exist at once.\n\nIf the existence of time is something that only resides in our heads, is it possible that on other planets life evolved a radically different perception of time? As in, maybe there are life forms which holistically see the past, present, and future and know how they’ll die from the moment they’re born. Idk, I’m just curious.",
        "created_utc": 1678553580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why This Works?",
        "author": "Guan_vilie",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11onvy2/why_this_works/",
        "text": "Why proving to a human being is motivating and satisfying but not to an object, animal or other things? Like proving someone wrong, fulfilling a promise or bet.\n\nAnd the for promises one make to his own self, great people can fulfill them but the amount of will and determination needed is high compared to doing it for someone else. Because it involves pain and validation?\n\nThere are so many stories like this:\n ''They said I could never do this, could never make it then I proved them wrong and became great'' \nMy question is what were you doing before if you were so capable? \n\n\nExcuse my English.",
        "created_utc": 1678550970,
        "upvote_ratio": 1.0
    },
    {
        "title": "why are criminals punished",
        "author": "Sunny_Reddy18",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11onhso/why_are_criminals_punished/",
        "text": "This question is probably asked before but i can't find it, please provide link if it's asked before \n\n\nCriminals punished for their mistakes but the thing that is causing them to commit crime is either the nature or their current condition.\n\nIf it's their nature that is causing them to commit crime, its not really there mistake because they can't control it\n\nIf it's their current condition that forced them to commit crime they are also not responsible for their crime because it's their current condition that put them in a position to commit crime\n\nA simple answer would be that they are punished so that they won't repeat the crime next time if that's the case then what about death penalties and lot of hate that the receive from people",
        "created_utc": 1678549998,
        "upvote_ratio": 1.0
    },
    {
        "title": "What types of things does Plato consider to have forms?",
        "author": "CaterpillarFar444",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oncy2/what_types_of_things_does_plato_consider_to_have/",
        "text": "In particular I'm curious if proper nouns have forms. Forms seem to be invoked to identify the shared quality in disparate things that go by the same name, so it doesn't seem like a proper noun would fit this purpose. However, if you take a word like \"Greece\" you can point to it on a map and say \"this is Greece,\" stand in Greek territory and say \"I am in Greece\" or say that Greece has reached an agreement with the European Union. These all seem to be different uses that point to a common thing between them that maybe Plato could have seen as a form.\n\nI'm also curious if common objects have forms. In hearing people talk about the theory of forms they always seem to talk about the form of \"chair\" or something, but in the dialogues Socrates only seems to talk about abstract concepts having forms like \"virtue\" or \"equality.\"",
        "created_utc": 1678549662,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which age did u discover philosophy",
        "author": "Upset-Sprinkles-4794",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11omvsv/in_which_age_did_u_discover_philosophy/",
        "text": "I am only 14  just curious",
        "created_utc": 1678548435,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Heidegger's association with the Nazis affect the interpretation of his Philosophy?",
        "author": "throwawayphaccount",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11omhu7/how_does_heideggers_association_with_the_nazis/",
        "text": "Heidegger was a Nazi. Does being a Nazi affect the value of his work? Aren't the claims/arguments of philosophers evaluated independently of their persons?",
        "created_utc": 1678547413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plato’s Democracy",
        "author": "asianbabiii",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oljci/platos_democracy/",
        "text": "What do you think of Plato’s take on democracy? Is it even relevant still in modern society?",
        "created_utc": 1678544925,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve heard of antiwork. Why haven’t I heard of pro-work?",
        "author": "spice-hammer",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11okx1z/ive_heard_of_antiwork_why_havent_i_heard_of/",
        "text": "Yeah, the r/antiwork subreddit is full of cringe, but set that aside for now and take a look at the idea that inspired the subreddit in the first place - “Work sucks”. There’s a ton of art, literature, philosophy, music etc that revolves around this topic, not just a single sub, and there wouldn’t be if this view didn’t resonate with people. \n\nIf we’re living in a world where the most constant, present theme of survival is work - where you need to trade a huge amount of the single life you get to just maintain a decent standard of living; where for the vast majority, one of the most important relationships in your life is inherently oppositional and exploitative (you’re never going to get a company that’s *happy* to give you a raise); where the supposed trade you’re making - “work, and you’ll live well and be able to retire in your 50s or 60s” - seems more and more like bullshit in the current climate; where “you are what you spend your time doing”, and most of what you spend your time doing is suppressing the things you actually want to do deep down; would it really surprise you if being anti-work was the default position of most people? \n\nOk, here’s the actual question: It seems like people who are *opposed* to anti-work sentiments and arguments will try to counter them by implicitly or explicitly saying that people who are anti-work are weak of character or corrupted by cultural Marxists or something. This seems to rest on an assumption that work is actually good - that everyone is by default pro-work, and if you’re anti-work something has gone wrong. *But I never, ever hear that implied pro-work argument* - just insults. No one has ever actually tried to convert me to a pro-work viewpoint using the logical argument that those insults should be resting upon. \n\nThe other position that I often hear goes something like “Life is a series of pills to be swallowed, and work is just another pill. Try not to think about or talk about the fact that it sucks, because that will just make you miserable”, and damn, that’s also really, really unsatisfactory. It’d be great if the argument that there’s something wrong with not wanting to work was actually articulated because fuck, that’s grim.\n\nDo any of you guys know what this secret pro-work argument is? It’s not like I savour feeling bleak about work. If I could switch to enjoying it (actually enjoying it, not just occasionally palling around with my coworkers, finding tiny bits of it that I like etc., but actually appreciating the concept of working to survive for the rest of my life) that’d be great. But I haven’t EVER heard an argument that it’s actually a good thing - only that, because work is less bad than being homeless, I’m a weakling for not tricking my negative to emotions into being positive or neutral emotions through sheer force of will. Willpower is finite and I’d rather use it to do things I actually find meaningful. \n\nConvert me baby",
        "created_utc": 1678543254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isn’t the middle ground also an extreme?",
        "author": "Diamondedge365",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11okt6i/isnt_the_middle_ground_also_an_extreme/",
        "text": "We often talk about extremes in terms of left wings, right wings, up and down, hot or cold, but often treat the “middle ground” as if it isn’t an extreme in its own right? It’s too complicated and contradictory to explain, but is there a middle ground to the middle ground?",
        "created_utc": 1678542974,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do we life for?",
        "author": "idkhomosapien",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ok2nu/what_do_we_life_for/",
        "text": "",
        "created_utc": 1678540919,
        "upvote_ratio": 1.0
    },
    {
        "title": "On nihilism: Is it truly the case that experiencing this world has no significance or value?",
        "author": "imfeelingsomekindowf",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ojr71/on_nihilism_is_it_truly_the_case_that/",
        "text": "At a fundamental level, all experiences have inherent value when compared to the absence of experience or non-existence, even if it includes suffering. This conclusion can be reached by objective and logical reasoning. What are your thoughts on this matter?",
        "created_utc": 1678539996,
        "upvote_ratio": 1.0
    },
    {
        "title": "How am I experiencing the current moment when I will die?",
        "author": "ComplexSynergy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ojkis/how_am_i_experiencing_the_current_moment_when_i/",
        "text": "I will try my best to articulate the conundrum I have, so here goes.\n\nAs I see it, everything I know at this current moment is simply what I've remembered. There's so much I have done in my past that I have _lost_. At the time, those events were being experienced by me, but they may as well never have.\n\nTo cement the point, imagine I experience some event, and then I am hypnotised to forget it. At the time, the experience was real, my mind was processing it -- but that might as well not have happened at all after the hypnosis.\n\nThat's how I see what I experience on a day to day basis -- or all of life, really. If we simply return to non-existence, no thoughts, nothing: then how is what I am experiencing now not already forgotten??\n\nThere will be a future state of me that has already forgotten that I am sat in my bed at the moment, that I can hear my family laughing at some joke downstairs, so how am I currently able to experience and know about it? There will be 40-yo me (20 years away) who will not remember this. How am I not already at that state where I forget this has happened?\n\nIt's hard to explain and if anyone has a better word for it that would be great.",
        "created_utc": 1678539466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literatur about the compatibility of causal determinism and the activity required for free agency",
        "author": "Zawinuel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oj2f8/literatur_about_the_compatibility_of_causal/",
        "text": "Hello, iam currently reading the Book four views on free will ( Fischer, John Martin ; Kane, Robert ; Pereboom, Derk &amp; Vargas, Manuel (2007). Four Views on Free Will. Wiley-Blackwell. ) In the chapter about compabtiblism there is a section where John Martin Fischer discusses various source incompatibilism objections against his  view of free will. In this context he mentions that it is unclear if causal determinism would allow the actitivity that is needed for agents to make free choices (free on the conditions of fischers view of free will). Fischers describes this problem as follows:\n\n ^(\"An agent is not simply a coherent and separate individual or self – an agent is “active” in a signature sense, rather than merely or wholly passive. The second worry then is that causal determinism rules out activity in the relevant sense – it would render us all completely passive. Harry Frankfurt, who many philosophers assume is a compatibilist, has recently expressed the worry that causal determinism might rule out activity; he thus concludes that we do not yet have a conclusive defense of compatibilism.\")\n\n I found this to be a very interessting idea but sadly fischers discussion of this problem doesn't go really in depth and i don't know where to find more on this. So i have the following question to this community: Does anybody know to which of Frankfurts writings Fischer is reffering here? And is there any literature on this topic that you would recommend?",
        "created_utc": 1678537924,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to structure my reading-club for \"Das Kapital\"?",
        "author": "GenosseGradevsky",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oirzg/how_to_structure_my_readingclub_for_das_kapital/",
        "text": "Hello everyone,\n\nSome fellow students and I have decided to start a reading-club for Marx' \"Das Kapital\". Kapital is usually considered quite a huge and tedious read and I am currently wondering how to structure our reading-sessions precisely.\n\nI am unsure how else to phrase this, but our goal is basically to have a deepened understanding of Marxist economy without necessarily reading every single additional detail - for instance, I can imagine that we would not miss all too much if we skipped that chapter about the national differences of wages.  \nI guess it is best to think of it as an introductory reading-group into Das Kapital. We would like to understand the main-concepts of the Marxist critique of capitalism.\n\n&amp;#x200B;\n\nWhich chapters are inexpendable? Which ones can we skip? Is there a recommended order in which to read *Das Kapital*? I am curious as to what you think. Here is a list of all the parts and chapters.\n\n \n\n|**COMMODITIES AND MONEY** |CommoditiesExchangeMoney, Or the Circulation of Commodities |\n|:-|:-|\n|**THE TRANSFORMATION OF MONEY INTO CAPITAL**|The General Formula for CapitalContradictions in the General Formula of CapitalThe Buying and Selling of Labour-Power |\n|**THE PRODUCTION OF ABSOLUTE SURPLUS-VALUE** |The Labour-Process and the Process of Producing Surplus-ValueConstant Capital and Variable CapitalThe Rate of Surplus-ValueThe Working DayRate and Mass of Surplus-Value |\n|**PRODUCTION OF RELATIVE SURPLUS VALUE** |The Concept of Relative Surplus-Value / Co-operationDivision of Labour and ManufactureMachinery and Modern Industry |\n|**PRODUCTION OF ABSOLUTE AND RELATIVE SURPLUS-VALUE** |Absolute and Relative Surplus-ValueChanges of Magnitude in the Price of Labour-Power and in Surplus-ValueVarious Formula for the Rate of Surplus-Value |\n|**WAGES** |The Transformation of the Value(and Respectively the Price) of Labour-Powerinto WagesTime-WagesPiece-WagesNational Differences in Wages |\n|**THE PROCESS OF ACCUMULATION OF CAPITAL** |Simple Reproduction / Conversion of Surplus-Value into Capital / The General Law of Capitalist Accumulation|\n|**SO-CALLED PRIMITIVE \\[‘ORIGINATING’\\] ACCUMULATION** |The Secret of Primitive AccumulationThe Expropriation of the AgriculturalPopulation from the LandBloody Legislation Against the ExpropriatedSince the End of the Fifteenth Century.The Forcing Down of Wages by Act ofParliament / The Genesis of the Capitalist FarmerImpact of the Agricultural Revolution on IndustryThe Creation of a Home Market forIndustrial CapitalThe Genesis of the Industrial CapitalistThe Historical Tendency of CapitalistAccumulationThe Modern Theory of Colonization |",
        "created_utc": 1678537050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of time.",
        "author": "No-Caterpillar-4628",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oin0s/philosophy_of_time/",
        "text": "Does time pass?\n\nSo which arguments are stronger the ones that argue that time does indeed pass or the arguments that argue that time does not pass?",
        "created_utc": 1678536623,
        "upvote_ratio": 1.0
    },
    {
        "title": "What define me; what am I? Is it my thoughts? My actions &amp; behavior?",
        "author": "Zoilist_PaperClip",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ohg57/what_define_me_what_am_i_is_it_my_thoughts_my/",
        "text": "What did philosophers say about this, and where to read more in depth with regards to this subject?",
        "created_utc": 1678532733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can torture be ethical if person does not remember it?",
        "author": "CommonCasual1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ogt88/can_torture_be_ethical_if_person_does_not/",
        "text": "I was reading an article about anesthesia awareness- an issue, where patient is fully awake during surgery but cannot move.\nIt is very rare, but there is a suspection of many cases going unreported, because anesthetics also block the function of making memory.\n\nAnd almost every person who was fully awake and remembers it suffer from PTSD or other mental health problems.\n\nAnd according to that article there was a survey if its ethical or not- and there was a suprisingly large minority that said if the patient does not remember it, then it does not matter.\n\nDo you think such torture is ethical or do you find some argumets for it?",
        "created_utc": 1678530437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people laugh when some one falls down?",
        "author": "Letgov",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oenek/why_do_people_laugh_when_some_one_falls_down/",
        "text": "[removed]",
        "created_utc": 1678522669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is being an a*shole normalized in our society?",
        "author": "forgotten_dreamer97",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oemhn/why_is_being_an_ashole_normalized_in_our_society/",
        "text": "Recently I saw a Twitter debate where one user misunderstood someone's tweet so the other person attacked them by saying they probably don't have friends in real life. Here's the kicker, the main argument started over the person misunderstanding a joke. A misunderstanding of jokes and other social cues can be a symptom of neurodivergency. \n\nSo a whole argument happened after due to one person not comprehending that the other person may be dealing with a symptom of neurodivergency which sparked the argument. Instead of just ignoring the person and going along their day, that personally used the \"you probably don't have friends\" insult. An insult that can easily target neurodivergent individuals.\n\nThe scary part is, many people are on the side of the person who attacked the other person. My question is, why are we at a point in society where being an asshole or a jerk is accepted around social circles?\n\nWe hear all the time in movies, tv, mature figures, that we must use empathy and that it's not good to instigate fights, but when we're in those types of positions we basically throw away that advice. We choose to be an asshole, and the world has no problem with it.\n\nWhat is going on here, and how can we fix this issue?",
        "created_utc": 1678522579,
        "upvote_ratio": 1.0
    },
    {
        "title": "book suggestion",
        "author": "me3198",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oea7q/book_suggestion/",
        "text": "Hi guys,\nPlease suggest a book on free will vs determinism",
        "created_utc": 1678521396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any distinction between justice and sanctioned retaliation for an ethical anti-realist?",
        "author": "AccomplishedQuestion",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oea6b/is_there_any_distinction_between_justice_and/",
        "text": "Are there any ethical anti-realist philosophers that make a distinction between the ideas of justice and sanctioned retaliation? If so, how are they making and justifying that distinction?",
        "created_utc": 1678521392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memory and morality",
        "author": "Mr_sushj",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11odtyd/memory_and_morality/",
        "text": "So recently I’ve gotten kinda of interested in memory and identity, I ended up thinking about it and I had some interesting hypotheticals that I came up with, and that I’m having trouble answering.\n\nHypothetical 1\n\nSay there is man A and man B and a mad scientist that is man C. Say man C has a time machine that can send an object back in time to a previous state(so if you had a rotten apple and you used it would become a ripe apple) now say man A brutally molest man B but afterwards man C throws man A into the time machine making him go back to the state man A was in one week before. Would it be immoral to prosecute man A for the crime that he committed, and if so what should be his punishment(and let’s say for the sake of the argument man A will not molest again after the time machine)\n\nHypothetical 2\n\nSay there is man A and man B and a mad scientist that is man C. Say man C has a drug that will erase one week of memory for whoever is injected with it. Now say man A brutally molest man B but afterwards man C injects man A with his drug, and man A forgets everything that happened in a week. Would it be immoral to prosecute man A for a crime that he doesn’t remember, if so what is different in principle from the first example?\n\nHypothetical 3\n\nNew hypothetical, say we don’t prosecute the man A and say it’s immoral to hold someone accountable for actions they don’t remember. What if man A regains his memories from his sexual assault against man B… should we then hold him accountable? Like say some time has elapsed like three weeks.",
        "created_utc": 1678519774,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would humans behave, compared to today, if they were virtually immortal, meaning they could only die of unnatural causes such as blunt force, stabbing, guns, etc.?",
        "author": "graydrizzl3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11od6ff/how_would_humans_behave_compared_to_today_if_they/",
        "text": "",
        "created_utc": 1678517429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a hypothetical philosophical zombie be able to think?",
        "author": "Niftyszn",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11obiqr/would_a_hypothetical_philosophical_zombie_be_able/",
        "text": "I see many people say consciousness has evolved because it allows one to be creative and make better decisions through thinking. But would a philosophical zombie also be able to \"think\"? Or would it be like how AI calculates things, which is different to thinking.",
        "created_utc": 1678511694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading Kant &amp; Darwin Advice?",
        "author": "Complete-Ad5058",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oavba/reading_kant_darwin_advice/",
        "text": "[The hyper link of this text is a link detailing my query, but briefly I wanted to ask if anyone who’s aware of the references of Kant’s work in Charles Darwin’s main publications, do they have any suggestions or tips or recommendations to best understand the relationship of Kant’s notions in Darwin’s thinkings. Also if my reading list ought to be rearranged or added too. Many thanks](https://www.reddit.com/r/evolution/comments/11oatl0/origin_descent_emotions_reading_advice_pure/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "created_utc": 1678509567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Help Finding Examples of Recent Hasty Generalization Fallacy In The Media | Homework Help",
        "author": "Mimishki",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11oab0l/need_help_finding_examples_of_recent_hasty/",
        "text": "Hi Guys! I’ve been scouring the internet and I can’t find anything. \n\nI need to find a linkable example of Hasty Generalization fallacy and it has to be in the past 12 months. \n\nIt doesn’t have to be an amazing example. For another part of the assignment I used an Andrew Tate TikTok of him justifying his beliefs because of religion as an example of Appeal to Tradition. \n\nIf you guys know where to find - or have an example of Hasty Generalization in the past 12 months I would loveeee to see it! Thanks so much ❤️❤️",
        "created_utc": 1678507758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Zeus give mankind hope?",
        "author": "JasonBourneYourArse",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o9y3b/why_did_zeus_give_mankind_hope/",
        "text": "Did he not realize it was in the box that he stuff all the other chaotic things into? Perhaps some other god snuck it in with Zeus knowing? Thank you in advance 😌",
        "created_utc": 1678506625,
        "upvote_ratio": 1.0
    },
    {
        "title": "What will effects be of technology on dichotomy between natural world and human culture ?",
        "author": "Blizzwalker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o9hu1/what_will_effects_be_of_technology_on_dichotomy/",
        "text": "Let me clarify- am not asking what technology will do to the environment (although a vital concern). Am asking how advancing tech might change how we see the division between the natural world and the \"artificial\" world of human culture. If what it means to be human is transformed, if we can engineer virtual worlds that compete with the traditional world of nature, might that not alter our valuing of the natural world ?\nSeems 3 possible scenarios kind of exhaust the outcome :\n1) the tech world is so integrated into us (perhaps literally) that we find the world of nature insignificant-- we leave it behind.\n2) In our advancement, we heighten the dichotomy between our Hi-Tech selves and the natural world.   Nature is valued even more as it becomes denigrated and more inaccessible.\n3) Nothing happens to this division -- the tension between the two worlds remains as it historically has been.\n\nMaybe there are other outcomes, some kind of synthesis perhaps. Maybe it is a non-issue, but it seems like a genuine question facing us.\nI have read some stuff by Bostrom, wonder what/who else might address this ??",
        "created_utc": 1678505212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking For a Good Lecture Series on James's Varieties of Religious Experience",
        "author": "RadicalShiba",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o7tfw/looking_for_a_good_lecture_series_on_jamess/",
        "text": "Just as the title says! Am hoping to have something to watch along as I read to provide clarification on difficult passages and historical context. Can't seem to find anything on YouTube though. Any advice? Thank you!",
        "created_utc": 1678500184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking For a Good Lecture Series on James's Varieties of Religious Experience?",
        "author": "KaleidoscopeWanderer",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o7q76/looking_for_a_good_lecture_series_on_jamess/",
        "text": "As title says! Am hoping to read the book along with a lecture series that provides some context and explanation as I go along. Can't seem to find any on YouTube! Thank you :)",
        "created_utc": 1678499947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wouldn't refusing to date or have children with white men be an effective way to end white supremacy?",
        "author": "VeryMentallyIll61524",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o75mn/wouldnt_refusing_to_date_or_have_children_with/",
        "text": "This would effectively stop the source of systemic equality at it's source. White men have been given an opportunity to change time and time again but they haven't. They are still set in their ways. This strategy would completely change power imbalances.",
        "created_utc": 1678498292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone describe the main takeaways from Levinas’ “Peace and Proximity” and Levinas’ view on how to properly see other people/living beings?",
        "author": "theharryyyy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o69rl/can_someone_describe_the_main_takeaways_from/",
        "text": "",
        "created_utc": 1678495837,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your interpretation of note 531 from the compilation of Nietzsche's notes \"The Will to Power\"?",
        "author": "Ok-Fix-2971",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o68o5/what_is_your_interpretation_of_note_531_from_the/",
        "text": "I understand this compilation may not strictly represent Nietzsche's perspective, but I nonetheless am eager to understand this particular passage, if only for the satisfaction of understanding.",
        "created_utc": 1678495758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any analytical philosophers who defend biblical inerrancy?",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o60ut/are_there_any_analytical_philosophers_who_defend/",
        "text": "Is there any?",
        "created_utc": 1678495161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is God a placebo according to AA?",
        "author": "carvinbutter",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o5527/is_god_a_placebo_according_to_aa/",
        "text": "I'm having a hard time wrapping my mind around the coexistence of God.",
        "created_utc": 1678492860,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some fundamental beliefs that are part of your philosophy of life?",
        "author": "customsolitaires",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o5159/what_are_some_fundamental_beliefs_that_are_part/",
        "text": "Ive been thinking of this recently and I guess mine are to cause the least possible harm to others, I cant be happy if I am the reason for other person's suffering and my second one would be choose happiness, when making important decisions I try to first weight how much happiness is this going to bring to me or not.",
        "created_utc": 1678492594,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is THE purpose of life?",
        "author": "Terradubia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o4u69/what_is_the_purpose_of_life/",
        "text": "",
        "created_utc": 1678492092,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what language to read philosophical texts?",
        "author": "agonking",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o2lpg/in_what_language_to_read_philosophical_texts/",
        "text": "I have been reading philosophy mostly in English which is not my mother tongue. Is it better to switch to my normal language or continue reading in English?\n\nMy issue here is that I can not understand everything in English(could also be due to the difficulty of the material) and also the possibility that the translated text will be of poor quality.",
        "created_utc": 1678486548,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has Plato's Atlantis Finally Been Found?",
        "author": "PralineWorried4830",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o2ktj/has_platos_atlantis_finally_been_found/",
        "text": "Below is the description from the book Atlantis &amp; Its Fate In The Postdiluvian World: A possible site for Plato's Atlantis by Kodiak Island.\n\n\"Has Plato’s lost city of Atlantis been found? This book explores the historical, geological, genetic and anecdotal evidence that supports the existence of the lost city of Atlantis. It examines a new site discovered by Michael Szymczyk near Kodiak Island in Alaska. This location may contain a sunken Poseidon monument and the ruins of an ancient city now underwater. \n\nSzymczyk discovered the site while following the genetic footprints of the X haplogroup as well as the ancient writings of Herodotus, Pliny the Elder and others. Ancient historians such as Manetho and Sanchuniathon wrote of the first Egyptian kings known as the Auletians or Aleteans, one which related to the Berbers. The word Auletians shares phonetic similarities to the Aleutians of Alaska and may have originated from a distant proto-language of the Eskaleut language in Alaska (recent genetic evidence shows the Aleut originated 13,000 BCE in Beringia and not from a migration around 4,000 BCE as often claimed). The Berber of North Africa shared a common ancestor with the Sammi 7,000 BCE, a group now in northern Sweden but originally from northern Siberia, which pointed to a location near Beringia as the original site for Atlantis. This site has previously remained undiscovered due to assumptions of arctic-Mediterranean weather and that Plato and the Ancient Egyptians meant the Atlantic Ocean, the idea of multiple oceans being a modern invention. The Ancients knew of only one true Western ocean which encompassed the world.\n\nIf this is Atlantis, does Plato’s Timaeus also contain knowledge of quantum theory? Might it also suggest the possibility that a divergent path of cultural and technological development took place in prehistoric times that was passed down to Pythagoras and then to Philolaus and Plato through the Ancient Egyptians? Could descendants of a hypothetical civilization have survived to the present day and escaped detection by utilizing time dilating technology? If so, could they be responsible for UAP sightings, crop circles, cattle mutilations and other strange phenomena at places such as Skinwalker Ranch? Could they also have been the source of the myths of Native America, Ancient Egypt, Ancient Greece, the Levant, Ireland, India and the Orkney Islands?\n\nThis book shows how to validate that hypothesis by collecting evidence of time-dilation at UAP hotspots through the use of clandestine filming techniques and high frame per second video cameras. It also shows where Einstein went wrong and looks at new technology that could be made possible by a unified theory of quantum gravity, allowing for scientific advances in the fields of agriculture, transportation, clean energy and possibly even time travel.\"",
        "created_utc": 1678486495,
        "upvote_ratio": 1.0
    },
    {
        "title": "What proves causation?",
        "author": "MentalZiggurat",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o2flh/what_proves_causation/",
        "text": " \n\nWhat  is the proof that cause and effect is a literal depiction of phenomena?  Consistent correlation does not mean causation. Where is the evidence  that shows there is actually generation or causation occurring since  correlated difference across time is only evidence of  correlation/relational variation?  \nI understand that cause and effect  works as a narrative to describe certain types of correlation, but why  has it been accepted as literal truth rather than allegory? What is the  reasoning behind the acceptance of cause and effect as literal truth, if  there is any?\n\nMore broadly, where  is the evidence that proves becoming is occurring, rather just being  that is distributed across multiple dimensional fields?\n\nIf  my wrist does not cause my hand to exist, and they are beside each  other as related differences in space, why are related differences  located beside each other in time seen as causes and effects?",
        "created_utc": 1678486160,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to read in the Critique of Pure Reason?",
        "author": "No_Shoe1628",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o1a1i/what_to_read_in_the_critique_of_pure_reason/",
        "text": "So I have the critique of pure reason, with both versions A and B. I have a good understanding of his fundamental concepts through many youtube videos and other readings. What I want to know is which specific chapters and/or excerpts are very important in gaining a deep understanding of Kant?\n\nIn college, my philosophy classes would assign us to only read certain parts of a book in which those parts were detrimental in gaining a deep understanding. I'm 24 years old with a corporate job and am just looking to learn and connect the dots of life. For the same reasons they made us only read certain parts in college (saving time and getting straight to the meat of the ideas), I would like to do this with Kant. Thanks in advance!",
        "created_utc": 1678483394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Growing Block Universe and the time travel in this concept",
        "author": "No-Health3920",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11o0rs6/growing_block_universe_and_the_time_travel_in/",
        "text": "Is time travel theoretically possible in the Growing Block Universe? It should, because it still exists which means it's real but the difference between the present and the past is that past is 'fixed' or 'unactive' which means no one is conscious there anymore. What if someone traveled to the unconscious past? Will he be the only conscious being around or he will also become unconscious or maybe it's logically impossible at all?",
        "created_utc": 1678482171,
        "upvote_ratio": 1.0
    },
    {
        "title": "What of \"Dasein\" was original to Heidegger (as opposed to, e.g., incorporation of \"memento mori\")? And how can one know if they're living sufficiently authentically, by Heidegger's standards?",
        "author": "vaguelystem",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nzxly/what_of_dasein_was_original_to_heidegger_as/",
        "text": "",
        "created_utc": 1678480193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a hard time empathising with criticisms of ontological pluralism",
        "author": "fixikwkw",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nzrrm/having_a_hard_time_empathising_with_criticisms_of/",
        "text": "Why is it sometimes (or often) considered erroneous to take an ontological pluralism position when there seem to be very clear examples of differing worldviews resulting unequivocally objective facts? ~~Especially~~ in science fields",
        "created_utc": 1678479796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can’t humans just kill themselves by thought and willpower alone?",
        "author": "YoureMrLebowskidude",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nz7yd/why_cant_humans_just_kill_themselves_by_thought/",
        "text": "Why can’t one kill themselves by willpower and thoughts alone?\n\nWhat are the moral underpinnings here. Clearly we have an autonomic nervous system that prevents such things to ensure our survival , but ignoring that does it mean we are in a simulation, created by a god? Is there a book I could read exploring this exact question? We have thoughts of our own thought doesn’t allow us to do simple things like shut down our hearts should we want to? \n\nVery curious if neitsczhe discussed this or what he would think about willing this to power.",
        "created_utc": 1678478536,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best graduate programs in Logic in Europe, for someone coming from Philosophy?",
        "author": "random_access_cache",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nx6l9/what_are_the_best_graduate_programs_in_logic_in/",
        "text": "I am currently working on my Master's degree in philosophy. I have a great interest in Logic, but since some graduate programs are more math oriented, I was wondering if there was a certain consensus about which programs that are offering a graduate degree in Logic are more philosophical, or are a better bet for someone coming from Philosophy - considering not all accept phil. masters. Thank you for any help.",
        "created_utc": 1678473808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any utilitarian arguments against ethical meat if we ignore climate change for the sake of discussion?",
        "author": "Capable-Table7782",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nttnx/are_there_any_utilitarian_arguments_against/",
        "text": "It would seem that animal farms increase iverall utility if we propose that the animals living thwre are given good lives. \n\nThe most obvious argument against this view is that it is wrong to kill the animals, because they lose their future happiness. This argument is worth considering, but if we disallowed this kind of  animal farming, the animals would never get any of the pleasure, because there would be no one raising them. This means that even if killing the animals decreases the utility, banning these farms would cost even more utility.",
        "created_utc": 1678466005,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do socialist philosophers cope with living in a capitalist society?",
        "author": "rooknerd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nt8re/how_do_socialist_philosophers_cope_with_living_in/",
        "text": "I am having trouble fitting in the capitalist structure of our society. I see people obsessed over brands and splurging extra money just for the name. People drowning in debt, just to show off in front of others. Spending money on unnecessary things, when they could've saved it for a rainy day.\n\nShopping malls look something out of a dystopian novel to me. (I'm from a developing country) Malls stand high and mighty with their clean and pristine look, while just a few blocks away there are slums where people do not have access to a proper toilet.\n\nI can't be the first person to have these thoughts.\n\n **How do the philosophers and critical theorists who are socialist cope with living in capitalism? Are there any essays or books that talk about this?**",
        "created_utc": 1678464684,
        "upvote_ratio": 1.0
    },
    {
        "title": "what if there is an infinity equation, one that allows multiple loop sizes?",
        "author": "kiltedweirdo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nshwh/what_if_there_is_an_infinity_equation_one_that/",
        "text": " One example comes to mind (3n+1 odds, n/2 evens) in repitions of 4,2,1 or 4=2\\^2, 2=2\\^1, 1=2\\^0\n\n[https://www.desmos.com/calculator/cucyrjsh5i](https://www.desmos.com/calculator/cucyrjsh5i)\n\nis an example (1)\n\n2\\^n=1/2\\^-n where 2\\^-n=1/2\\^n.\n\nthis creates a unique double pathway.\n\nCollatz seems to infinite, but its infinite in 4, 2 ,1 repititions.\n\nwhat if 4=2\\^2, 2=2\\^1, 1=2\\^0 and 4=1/2\\^-2, 2=1/2\\^-1, and 1=2\\^0 is our center?\n\nthese would all be reinforcing causal loops. This means that the infinity path is literal, to create extra energy by taking the normal square.\n\nThis might support Sweden's finding that atoms make a d note sound. (2014)\n\nfrom google:\n\n\"According to the theory, **the sound from the atom is divided into quantum particles**,\" said Martin Gustafsson, the research article's first author. \"Such a particle is the weakest sound that can be detected,\" said Gustafsson.Sep 12, 2014\n\ncould energy be a \"I think therefor I am, and I grow?\" situation?\n\nlike when we have savings accounts. nothing there, they don't grow. but put money in, and you see growth, even if small.\n\nexample 2:\n\nmass as proton and neutron=2. energy as electron=1.\n\nExample 3:\n\nmass is mass=1. charge and spin as energy=2.\n\nwhen mass is over energy, example 2:2/1, example 3: 1/2\n\nwhen energy is over mass, example 2:1/2, example 3: 2/1\n\nin other thoughts. i think 1+1 can equal 3.\n\nstep 1, add a negative sign.\n\n\\-1+1\n\nstep 2, solve\n\n\\-1+1=0\n\nstep 3, count integers mentioned from lowest to highest.\n\n(-1,0,1) has 3 integers. two step movements (commas)\n\nI use Newton's third law when thinking of this. -1 and 1 are equal but opposite.\n\n(-1,0,1)=2n+1 (+1 accounts for zero) (also Schrödinger's cat comes to mind)\n\n(-2,-1,0,1,2) 2n+1 where n=2 (+1 accounts for zero)\n\nn, 2n, 2n+1 makes all numbers.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nTOOLS I USE, WORKS IN PROGRESS:\n\n&amp;#x200B;\n\n1,2,3,5,7,11,13,17,19,23,29,31,37\n\nn=1 (for x)\n\n2=2n where n=1 (for y)\n\n3=2n+1 where n=1 (for z)\n\n5=2n+1 where n=2\n\n7=2n+1 where n=3 (see line 3)\n\n(we lose 9 as 2n+1 where n=4 if 4=2n where n=2)\n\n11=2n+1 where n=5\n\n13=2n+1 where n=6\n\n(We lose 15 as 2n+1 where n=7 where 7=2n+1 where n=3)\n\n17=2n+1 where n=8\n\n19=2n+1 where n=9\n\n(We lose 21 as 3×7)\n\n23=2n+1 where n=11\n\n(We lose 25 as 5\\*5)\n\n(We lose 27 as 3\\*3\\*3)\n\n29=2n+1 where n=14\n\n31=2n+1 where n=15\n\n(We lose 33 as 3\\*(4+7))\n\n(We lose 35 as 5\\*7)\n\n37=2n+1 where n=18\n\n(We lose 39 as 3\\*13)\n\n41=2n+1 where n=20\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n(x)\n\none integer. n\n\n(x,y)\n\nOne comma. n\n\ntwo integers. 2n\n\n(x,y,z) n=1\n\ntwo commas. 2n\n\nthree integers. 2n+1\n\n(x,y,z,w)\n\nthree count. 2n+1 n=1\n\nfour integers. 2n n=2\n\n(x,y,z,w,a)\n\nfour commas. 2n n=2\n\nfive integers. 2n+1 n=2\n\n(x,y,z,w,a,b)\n\nfive commas. 2n+1 n=2\n\nsix integers. 2n n=3\n\n(x,y,z,w,a,b,c)\n\nsix commas. 2n n=3\n\nseven integers. 2n+1 n=3.\n\n(x,y,z,w,a,b,c,d)\n\nSeven commas. 2n+1 n=3\n\nEight integers. 2n n=4\n\n(x,y,z,w,a,b,c,d,e)\n\nEight commas. 2n n=4\n\nNine integers. 2n+1 n=4\n\n(x,y,z,w,a,b,c,d,e,f)\n\nNine commas. 2n+1 n=4\n\nTen integers. 2n n=5\n\n(x,y,z,w,a,b,c,d,e,f,g)\n\nTen commas. 2n n=5\n\nEleven Integers. 2n+1 n=5\n\n(x,y,z,w,a,b,c,d,e,f,g,h)\n\nEleven commas. 2n+1 n=5\n\nTwelve integers. 2n n=6\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i)\n\nTwelve commas. 2n n=6\n\nThirteen integers. 2n+1 n=6\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k)\n\nThirteen commas. 2n+1 n=6\n\nFourteen integers. 2n n=7\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k,l)\n\nFourteen commas. 2n n=7\n\nFifteen integers. 2n+1 n=7\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k,l,m)\n\nFifteen commas. 2n+1 n=7\n\nSixteen integers. 2n n=8\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k,l,m,n)\n\nSixteen commas. 2n n=8\n\nSeventeen integers. 2n+1 n=8\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k,l,m,n,o)\n\nSeventeen commas. 2n+1 n=8\n\nEighteen integers. 2n n=9\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p)\n\nEighteen commas. 2n n=9\n\nNineteen integers. 2n+1 n=9\n\n(x,y,z,w,a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q)\n\nNineteen commas. 2n+1 n=9\n\nTwenty integers. 2n n=10\n\nsteps has two variables to track. two ways. integers vs commas.\n\nintegers are step locations, or quantity of step footings.\n\ncommas are step movements.\n\nthis alternates 2n and 2n+1.\n\nwhy 2n+1. because it unifies n to match numbers ½ of the time.\n\n&amp;#x200B;\n\nCOLLATZ AS TIME (result) where n= neutron + proton as mass 2/3\n\n\\-1=3n+1 n=-2/3 where n/2=-1/3\n\n0=3n+1 n=-1/3 where n/2=-1/6\n\n1=3n+1 n=0 where n/2=0 (newton’s third law of motion switch from division to multiplication)\n\n2=3n+1 n=1/3 where n\\*2=2/3\n\n3=3n+1 n=2/3 where n\\*2=1+1/3\n\n4=3n+1 n=1 where n\\*2=2\n\n5=3n+1 n=1+1/3 where n\\*2=2+2/3\n\n6=3n+1 n=1+⅔ where n\\*2=3+1/3\n\n7=3n+1 n=2 where n\\*2=4\n\n8=3n+1 n=2+1/3 where n\\*2=4+2/3\n\n9=3n+1 n=2+2/3 where n\\*2=5+⅓",
        "created_utc": 1678462983,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a goal of a person is minimizing suffering, wouldn't the best course of action be eliminating all life and making the planet uninhabitable again? Is there a name for something like this, or does this not work at all?",
        "author": "NotMyMainButOk420",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nqsua/if_a_goal_of_a_person_is_minimizing_suffering/",
        "text": "",
        "created_utc": 1678458841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, looking for the best updated version of The Dialectic of Enlightenment",
        "author": "Dry-Beat6588",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nqecs/hi_looking_for_the_best_updated_version_of_the/",
        "text": "Hello, I was wondering if anyone could recommend me what a reputable or standard translation/version is for the Dialectic of Enlightenment. I'm looking at amazon and there seems to be several. If anyone could point me in the right direction, thanks!",
        "created_utc": 1678457808,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between referent and extension?",
        "author": "tragiclight",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11npn0d/what_is_the_difference_between_referent_and/",
        "text": "A critical thinking book says that the referent of a term is what the term refers to, and the extension of a term is the set of things the term refers to. \n\nThe set of things a term refers to seems to be equivalent to what the term refers to. I can't distinguish one from another. Are there any examples to illustrate the difference?",
        "created_utc": 1678455949,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if infinity is more simple than we ever thought possible, because of 2^n=1/2^-n, with n to -n being our center cross?",
        "author": "kiltedweirdo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nply2/what_if_infinity_is_more_simple_than_we_ever/",
        "text": "[https://www.desmos.com/calculator/cucyrjsh5i](https://www.desmos.com/calculator/cucyrjsh5i)\n\nis an example. \n\n2\\^n=1/2\\^-n where 2\\^-n=1/2\\^n.\n\nthis creates a unique double pathway. \n\nCollatz seems to infinite, but its infinite in 4, 2 ,1 repititions.\n\nwhat if 4=2\\^2, 2=2\\^1, 1=2\\^0 and 4=1/2\\^-2, 2=1/2\\^-1, and 1=2\\^0 is our center?\n\nthese would all be reinforcing causal loops. This means that the infinity path is literal, to create extra energy by taking the normal square. \n\nThis might support Sweden's finding that atoms make a d note sound. (2014) \n\nfrom google:\n\n \"According to the theory, **the sound from the atom is divided into quantum particles**,\" said Martin Gustafsson, the research article's first author. \"Such a particle is the weakest sound that can be detected,\" said Gustafsson.Sep 12, 2014",
        "created_utc": 1678455879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which philosopher said something along those lines, was it heidegger? If so, does anyone know where I can get the full quote or read its context?",
        "author": "_Uhtceare_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11npj1z/which_philosopher_said_something_along_those/",
        "text": "It’s essentially an analogy of life where a person who is sleeping in their home suddenly wakes up in a train and instead of asking why he is where or where the train is heading, he just enjoys his time in the train. Or somewhere along those lines? I don’t remember it exactly",
        "created_utc": 1678455675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should the universe/existence be understood as a productive phenomenon as opposed to the classical theories of types, forms, transcendental ideas?",
        "author": "NotLongForThisSite",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11npeyp/should_the_universeexistence_be_understood_as_a/",
        "text": "What I mean by productive is not in a Hegelian sense, for I can't presume to know first causes or intent; but by productive I mean how phenomenal existence propels itself forward almost as a self determining organism, like a snail slowly inching its way along as its foot contracts so as to allow it to move. It is this contraction I am analogizing, not so much the snail itself, again I want to avoid intentionality.",
        "created_utc": 1678455384,
        "upvote_ratio": 1.0
    },
    {
        "title": "answers to anti natlism ?",
        "author": "wildguitars",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nopyj/answers_to_anti_natlism/",
        "text": "hey guys ive heard good explanations for anti natalism.. what do you think about it? \n\ngood source of information is david benatar, he has some good books etc",
        "created_utc": 1678453581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any discourse within liberalism on how to ensure that there's going to be a next generation in society?",
        "author": "IceFl4re",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nmt4u/is_there_any_discourse_within_liberalism_on_how/",
        "text": "As far as I read on liberalism as a philosophy, from the classical ones to modern ones and even those who try to mix liberalism with, say, socialism, I never come across anything that talks about societal perpetuation.\n\nBasically it's something like this:\n\nAny society that wants to be able to last for more than 1 generation would eventually need to:\n\n- Ensure that there's going to be a next generation to take over (enough people willing to have kids)\n\n- Those kids needs to be raised decently in a good community so that they don't become antisocial or else\n\n- These needs must be done without breaking the fundamental premises of that society.\n\nI found nothing within any strain I can find within liberalism that are willing to address this.\n\nAt best I find about open borders &amp; immigration (but really it isn't forever, it's more like kicking the can down the road), and public education. But that's it.\n\nIf anything, a lot within liberalism tend to make concerted effort to attack the aforementioned needs, in the name of personal liberty, harm and the like. Even if it's not direct attack, it's still basically changing what's normalized and taught.\n\nSo, is there anything within liberal philosophy that are willing to address this?",
        "created_utc": 1678448407,
        "upvote_ratio": 1.0
    },
    {
        "title": "why can't intuition and basic belief count as evidence for God?",
        "author": "Snoo80571",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nllox/why_cant_intuition_and_basic_belief_count_as/",
        "text": "I'm an atheist. My atheism is supported by lack of evidence for god existence and positive evidence for god not existing (the problem of evil, the problem of hell, contradictions in the concept of perfect being), but I've been wondering why can't intuition counts as evidence. Why can't god be a kant category or a basic belief like the existence of matter and other minds. This wouldn't support religion of course but will support a spirituality without religion. \n\nHaving god as basic belief will reverse the problem of pointless suffering into: \n\nIf god exists there will be no pointless suffering.\n\nGod exists\n\nTherefore, there's no pointless suffering\n\nI'll probably be an atheist anyway but i want to be open to entertaining other positions.",
        "created_utc": 1678444611,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to reconcile people's \"choices\" in a deterministic world view.",
        "author": "Ramza_Claus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nlkca/how_to_reconcile_peoples_choices_in_a/",
        "text": "I am determinist. Let me define how I use that.\n\nThe universe began to expand 14BYA. Last night I chose Turkey and veggies for dinner, and a couple seconds ago, I stopped typing to scratch an itch above my right eyebrow. These things are all dependent on each other. The speck of dust which irritated my eyebrow was set into motion when my cat rolled on the floor. She did that cuz she was stretching after waking up. And she woke up because she slept. And she slept because she's a mammal who needs sleep. And she's a mammal because she evolved from other animals. And other animals... Yadda yadda yadda because the universe began to expand. So did I really CHOOSE to scratch that itch? Did I really CHOOSE to eat what I ate? Or are these choices just me responding to stimuli? I'm made of matter, and this particular matter does a cool process called life wherein we seem to experience things. Bacteria does this too and no one would say their response to stimulus is a \"choice\"; they're just little bacteria. Our responses are much more complex, but as far as I can tell, these are just responses all the same.\n\nHow can we reconcile our response? If my neighbor is a total jerk to me, isn't he just matter obeying the laws of physics? How can I be \"upset\"? And what even is \"upset\" besides more chemicals just doing what physics demands they do? How can I tell my neighbor he ought not to do something when he isn't \"doing\" anything? \n\nI've heard about compatabilism, but it makes no sense to me. I either have the option to eat turkey or I don't have that option. I feel like compatabilism is trying to say we have an illusion of choice, like we experience something that feels like free will. But it's really just response to stimulus. Which is just determinism under a softer name, I think.",
        "created_utc": 1678444485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Dialectic fail so often?",
        "author": "actinoterix",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nj34b/why_does_dialectic_fail_so_often/",
        "text": "[removed]",
        "created_utc": 1678436069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that materialism and idealism are equally good representations of the same reality?",
        "author": "RobinHoodTh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ngw5b/is_it_possible_that_materialism_and_idealism_are/",
        "text": "",
        "created_utc": 1678429108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me remember this philosophers name",
        "author": "Philosophystone_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ngqki/help_me_remember_this_philosophers_name/",
        "text": "Hi everyone, I need help recalling a particular philosopher I briefly read about a while ago. I remember very little, except that this philosopher had written a paper in university/college for an assignment that ended up changing the course of a particular philosophical branch (I think it may have been ethics but not quite sure).\n\nIf this description sounds similar to any philosophers you know, please let me know. Thanks!",
        "created_utc": 1678428632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do good people exist?",
        "author": "ShowMeHerFeet",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ngp0e/why_do_good_people_exist/",
        "text": "We've debating about The Problem of Evil for a long time and, at least to me it seems that the answer is that the universe itself is a cruel place where the meanest, the most selfish creatures prosper. But if evil is just the default nature of the universe, why good people bother doing good?    \nI heard one answer that is that it's merely a subconscious ulterior motive that being in-group makes you more likely to prosper and it's encoded in our DNA through evolution, but is that the only answer?",
        "created_utc": 1678428509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading List for epistemology run down",
        "author": "ConstructionNo7774",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nggiv/reading_list_for_epistemology_run_down/",
        "text": "I'm writing a philosophy themed series where every arc represents a major philosophical topic. the first arc is epistemology and I came up with this reading list with the goal to reach kant levels of epistemology and metaphysics:  \n\n\n1. Plato - \"Theaetetus\", \"Timaeus\"\n2. Aristotle - \"Metaphysics\"\n3. Aquinas - \"Summa Theologica\"\n4. Francis Bacon - Essays\n5. Descartes - \"Meditations on First Philosophy\", \"Principles of Philosophy\"\n6. Spinoza - \"Ethics\"\n7. Newton - \"Newton's Philosophy of Nature\"\n8. Leibniz - \"Monadology\", \"Discourse on Metaphysics\"\n9. Berkeley - \"A Treatise Concerning the Principles of Human Knowledge\"\n10. Wolff - \"Philosophia Rationalis\"\n11. Locke - \"An Essay Concerning Human Understanding\"\n12. Hume - \"Treatise of Human Nature\", \"Enquiry Concerning Human Understanding\"\n13. George Hamann - \"Socratic Memorabilia\"\n14. Nicolas Malebranche - \"The Search After Truth\"\n15. Immanuel Swedenborg - \"Heaven and Hell\", \"Divine Love and Wisdom\"\n16. John Stuart Mill - \"A System of Logic\"\n17. Immanuel Kant - \"Critique of Pure Reason\", \"Prolegomena to Any Future Metaphysics\"\n\nI was wondering if theres anything on this list that has been expanded upon or better explained by later philosophers and thus not necessary reading or if there is anything I have missed. thank you very much.",
        "created_utc": 1678427839,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is democracy? How important is it?",
        "author": "caliber135",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nffnj/what_is_democracy_how_important_is_it/",
        "text": "I just started Prof Sadler's intro series and came across John Stuart Mill who denounces western liberal democracy for not evaluating intelligence for the eligibility of votes, whose argument can be traced to Socrates and a lot of philosophical tradition I'm largely ignorant of. The overwhelming consensus I garnered from a brief search is that democracy is flawed, especially western liberal version. Hence the question raised on the nature and value of democracy.\n\nMeanwhile, I've been lurking at communist threads and often find people discussing the dictatorship of proletariat as opposed to the dictatorship of bourgeosie. My limited understanding is that the votes cannot control the choice of candidates, and are influenced by the advertisement bombardment; plus the coercive economic system that comodifies people's lives for the bourgeosie who gains exponential power from surplus value, rent and interest from the products alienated, creating a power structure where wealth exploits is the vote. \n\nBefore giving credit to dictatorship, I'd like to ask how representative is western liberal democracy of democracy as a whole? Advertisements remind me of shadows in the cavemen metaphor fixating the audience into stereotype of irrational crowds that I want to avoid; however aside from capitalism, social structures inherently legitimize themselves, how diverse and constructive can democracy be in monitoring itself? How does democracy resolve the contradiction of law of exception? If democracy can only be achieved with a leveled playfield, how important is it? \n\nHow did French socialists and Marx etc come up with the dictatorship of proletariat as a solution towards these issues? Is democracy any good? What can true democracy be with our contemporary knowledge of technology etc? Suppose we imagine a democracy at its purest form and conditions, what would it be like?",
        "created_utc": 1678424760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Neville Goddard taken seriously by philosophers?",
        "author": "Steven_W_Ryan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nd5oz/is_neville_goddard_taken_seriously_by_philosophers/",
        "text": "I was recommended to read Neville Goddard and I tried out *Feeling is the Secret*, but didn't make it very far before seeing this line \"Emotional disturbances, especially suppressed emotions, are the cause of all disease.\"\n\nI got a \"woo-woo nonsense\" vibe that sounded kind of like Scientology.\n\nCurious what philosophers think about him.",
        "created_utc": 1678418422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the counter-argument that the argument below allows for the existence of other beings other than God, work? For example, if we use another thing for the predicate P (positive).",
        "author": "Specific-Air-4278",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nclcr/does_the_counterargument_that_the_argument_below/",
        "text": "Text document that I made where I'm studying it: [https://docs.google.com/document/d/1ZBg\\_cHg4NA1l\\_t5CodYGKgUvkhmXpu0K9rko1ysgtFs/edit?usp=sharing](https://docs.google.com/document/d/1ZBg_cHg4NA1l_t5CodYGKgUvkhmXpu0K9rko1ysgtFs/edit?usp=sharing)  \nGödel’s ontological argument, Hájek’s emendation  \nThe logic used is classical second-order S5 modal logic with varying domain semantics.  \nIt avoids modal collapse.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nDefinition of God\n\n∀x (Gx ⇔ ∀ψ (∃φ (Pφ ∧ □ ∀y (φy ⇒ ψy)) ⇔ □ ψx))\n\nBefore we move on to what the formula above says, the term “necessarily implies” needs to be explained.\n\nIf it’s the case that in every possible world, whatever has a property φ also has a property ψ, then we say that φ “necessarily implies” ψ.\n\nNote that every property necessarily implies itself, because in every possible world where someone φ, they obviously also have φ.\n\nNote that the variables φ and ψ are not forbidden from denoting the same property (φ = ψ).\n\nWe are now ready to explain what the formula says. It says:\n\nA being x has the property of being God if and only if both of the following statements hold:\n\nIf there exists a positive property φ, then in every possible world, x has every property necessarily implied by φ.\n\nIf in every possible world, x has a property ψ, then there exists a positive property φ that necessarily implies ψ.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 1\n\n∀φ ∀ψ ((Pφ ∧ □ ∀x (φx ⇒ ψx)) ⇒ ¬P¬ψ)\n\nIf a property φ is positive and in every possible world, whatever has φ also has ψ,\n\nthen the property of ‘not having ψ’ is not a positive property.\n\n(Note that the variables φ and ψ are not forbidden from denoting the same property (φ = ψ).)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 2\n\nP(G)\n\nThe property of being God is a positive one.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThis theorem follows from A1 and A2 (the goal of the argument).\n\n□ ∃x Gx\n\nIn every possible world, there exists an x such that x has the property of being God.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_",
        "created_utc": 1678416950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of Hybrid Theories in Normative Ethics?",
        "author": "mcstravickdk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ncegi/examples_of_hybrid_theories_in_normative_ethics/",
        "text": "So far, all I know is that threshold deontology is an example. I thought rule utilitarianism might be but was unsure.   \n\n\nWhat other examples are there of such mixed theories?  \n\n\n(Also, is there a hybrid theory combining virtue ethics, deontology AND consequentialism?)",
        "created_utc": 1678416446,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was wondering people's thoughts on this. A deceased spouse reunites in the afterlife with their spouse, who had remarried during the remainder of life spent while they had been dead. When all 3 enter the afterlife, would there be ill feelings harbored? Would all 3 spend their time together?",
        "author": "Jwozzz",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nbqxy/i_was_wondering_peoples_thoughts_on_this_a/",
        "text": "To preface, I apologize if this is the wrong place to ask this question, I am just really curious on what different people think would occur in this situation. I was thinking of asking this question on religious subreddits but I think it would be kind of limiting, as I feel most would say the same sorts of things like, in heaven we are all one\n\nI don't think I explained it well in title so I will try to give an example, just think of heaven existing even if you don't, any blissful afterlife can work but just begin by thinking its real. Young man and woman fall in love, get married, get pregnant, and the husband ends up passing away before the child is born. The wife ends up remarrying after falling in love years after the husband's death. The basic religious concept of the afterlife says we are able to see our loved ones again in pure bliss and euphoria. So, when the wife and her new husband pass away, would the wife be reunited with her deceased ex-husband and spend her afterlife with him, or would she be reunited with her most recent husband? If all 3 were together, could feelings of jealousy and resent grow? Or do those negative emotions not even exist in the afterlife in the first place? \n\nAlso I just thought of this, but eventually years and years later, when the daughter dies, will she be reunited with the step-father that raised her for her entire life? Or would she be reunited with her biological father who she never met? \n\nI guess the answer to these two questions would be based on some rules and characteristics of said afterlife, but I would love to hear what y'all think of these situations",
        "created_utc": 1678414764,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do 'and', 'or', 'it seems the case', 'implies' etc correspond to in the world? To what fact?",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nbm7l/what_do_and_or_it_seems_the_case_implies_etc/",
        "text": "Does the Correspondence Theory of Truth have an answer to this? Logical Atomism maybe?",
        "created_utc": 1678414419,
        "upvote_ratio": 0.99
    },
    {
        "title": "Are there philosophical ramifications to just foregoing sex?",
        "author": "EducatorBig6648",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11nasbm/are_there_philosophical_ramifications_to_just/",
        "text": "In a movie Oscar Isaac's character says *\"Anyway, sexuality is fun, man. If you're gonna exist, why not enjoy it?\"* Without going into the individual person's nature and nurture (i.e. going into psychology and culture), how do you think this fits with people choosing to remain virgins?\n\nI mean, for one thing it's an argument that we're not just vehicles for our genes unless the invention of sperm banks caused the number of \"voluntary celibates\" to go up.",
        "created_utc": 1678412311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are fetishization and objectification morally defensible?",
        "author": "Asleep_F0rever",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11na8bx/are_fetishization_and_objectification_morally/",
        "text": "Fetishization and objectification, the fragmentation of others or oneself into sexual parts and functions for gratification, have negative connotations. To be fetishized and objectified, means to be \"sexually dehumanized.\" Even racial preferences and erotic media are considered \"problematic\" for that reason \n\nBut are fetishization and objectification always humiliating? Contrary to popular opinion, can fetishization and objectification be beneficial and empowering?",
        "created_utc": 1678410896,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to judge ethics",
        "author": "great_cthulu28",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11na5ef/how_to_judge_ethics/",
        "text": "Are there any ethical philosophies that attempt to judge ethical systems as opposed to judging particular actions or people?",
        "created_utc": 1678410683,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the main point in Husserl's phenomenology?",
        "author": "nushtaev",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n9lce/what_is_the_main_point_in_husserls_phenomenology/",
        "text": "",
        "created_utc": 1678409285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Commensurability problems, weighting problems, and the reality of financing a war through taxes",
        "author": "KitsuneKarl",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11n80yd/commensurability_problems_weighting_problems_and/",
        "text": "I am a huge gamer, but a super finicky/picky gamer, and my absolutely favorite game of all time released an expansion recently.  I've counted the days down for months, nerding-out/daydreaming about playing it, and was extremely excited that it was finally about to drop when... I remembered they were Russian.  Obviously the game company pays taxes, and so if I pay them $30 dollars I am effectively giving the Russian Government what?  $10?  I understand that the typical preson is like \"no you loser, money is my god above all other gods and transcends responsibility and you can spend it on whatever you want with total impunity and you're a nazi if you think otherwise\", and I get that the official stance of career trollfarms is, \"yeah, BUT WHAT BOUT 'MERICA?!  You're a hypocrite and therefore should fund the war on Ukraine!\", I am expecting less impaired judgment from this subreddit.\n\nSo my first thought is that maybe I can go OLDSCHOOL and just purchase an indulgance, like I give Ukraine's military a certain amount and then I don't have to feel bad about handing a Russian soldier a shiny new box of ammo.  But that brings me to my first problem: how on Earth am I supposed to calculate something that absurdly complex?  I buy the Russian soldier some bullets ($10), so I have to buy the Ukrainian military a few grenades ($150)?  But then that seems low, since those bullets could do a LOT of damage.  So maybe it isn't enough to just buy the grenades but I need to buy the grandes ($150) AND some body armor ($1800) for the Ukrainian?  But really its doing damage to Russia to negate the money I gave them.  So maybe then I need to buy the Ukrainian soldiers a bunch of RPGs instead ($700)?  In practice, how the hell am I supposed to compute this?  I want to play my damned video game!\n\nThe other problem I am having is a commensurability problem.  I don't see why I should care that I did a greater amount of good to Ukraine than I did harm to Ukraine via taxation on my game - it remains I did harm to Ukraine.  At the end of the day, I STILL handed the Russian soldier some ammo, and it is a separate matter that I also gave a much greater amount to Ukraine.  I'm no less guilty of that offense for having done different goods (despite how indulgences were supposed to work, because indulgences are bullshit and I just meant that as a joke.)\n\nI REALLY want to play my game my damn (Russian) game.  But what the hell am I supposed to do?",
        "created_utc": 1678405493,
        "upvote_ratio": 1.0
    }
]