[
    {
        "title": "How to get more philosophy reading done?",
        "author": "DMoody4084",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lleki/how_to_get_more_philosophy_reading_done/",
        "text": "Hi! I am a current undergrad student, looking to go to grad school as well. While I do love reading philosophy, I've found it to be quite hard to keep up while also fully grasping the depth of the ideas. Does anyone have any advice?",
        "created_utc": 1678247442,
        "upvote_ratio": 1.0
    },
    {
        "title": "about music",
        "author": "malena__",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lkugr/about_music/",
        "text": "hello everyone, would you recommend me some texts about a philosophical, maybe aesthetic (recommend me theorical or fictional texts), approach to music? i've been thinking about this subject for a while. i've found interesing ideas about it in the literary symbolism for example. whatever book that talks about it and the impact on humans, or its nature. thank you all and sorry in advance if my english has some mistakes, im not a native.",
        "created_utc": 1678245909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best sources for John Dewey about Religion and School?",
        "author": "JackP2020coc",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lksq6/best_sources_for_john_dewey_about_religion_and/",
        "text": "Hello, I was curious about finding any sources or texts by Dewey himself pertaining to his religious beliefs and influence on the Education system. Looking up this information can be tricky and a lot of surface information seems very repetitive, any help is greatly appreciated. \n\nThank you!",
        "created_utc": 1678245774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heidegger and Unanswerable Questions",
        "author": "NoahsArkJP",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lk35d/heidegger_and_unanswerable_questions/",
        "text": "I recently finished reading \"Heidegger, and Essential Guide\". One big theme discussed is the importance for Heidegger of asking unanswerable questions like why is there something rather than nothing or what is Being. This got me thinking about another question. It's a difficult question to ask, so I hope I can articulate it well enough:\n\nThe question relates to the limits of knowledge not just for humans, but any beings, even those more intelligent than humans if they exist. The question is: *do all questions, like the ones above, which are or seem to be unanswerable to us, in fact have answers (*whether or not we know or have the ability to discover the answers*)*? Is this question itself unanswerable, answerable, or just currently unanswered? More generally, and to break it off into two questions: 1) Does every phenomenon (like existence) or question have some explanation/answer, 2) are such explanations and answers understandable given the right level of intelligence?\n\nThanks",
        "created_utc": 1678243928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is a philosophical question not considered philosophy ?",
        "author": "TheNewManRisen",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ljrqm/why_is_a_philosophical_question_not_considered/",
        "text": "According to the Sub Rules ?",
        "created_utc": 1678243104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reviving this thread: \"Why should I be moral?\"",
        "author": "DaUnkos",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ljdt2/reviving_this_thread_why_should_i_be_moral/",
        "text": "&lt;[https://www.reddit.com/r/askphilosophy/comments/2rdmw4/why\\_should\\_i\\_be\\_moral/](https://www.reddit.com/r/askphilosophy/comments/2rdmw4/why_should_i_be_moral/)\\&gt;\n\nI'm concerned with creating a morality that all 8 billion+ homo sapiens can get behind. Don't tell me it's impossible: all groups of homo sapiens higher than 150 in number must operate on shared fiction--so, please, theorize with me!\n\nLet's also remember most folks are not inclined to reading Heidegger-length tomes. As a result, I have found that the most widely accepted \\[non-religious\\] moral philosophy nowadays is The Four Agreements. The opening gist is that any society currently operates on \"\\[cultural\\] agreements\" that have almost all been agreed upon by past generations who are long dead.\n\nFor example, in my country, we are currently sexually repressed to a mind-bottling degree, which makes sense given that we were founded by religious refugees so extreme and intolerable they had to flee England across the entirety of the Atlantic Ocean.\n\nSo when I observe my fellow countryfolk wasting so much of our time nowadays on issues like \"gay\" marriage, \"trans\" rights, etc.; issues that are merely products of the deeply sexually repressed cultural agreements bequeathed to us by our ancient ancestors; I feel like I'm screaming into the void about solutions, as most folks currently cannot comprehend the magnitude of cultural modes that have existed throughout the history of our species, and are instead stuck like ostriches with their heads collectively buried under their obviously faulty paradigm.\n\nSo, my fellow Feurbachs! Please, join me in collaboration and let's discuss not the reasons for its implausibility, but rather the possibilities of synthesizing the lowest common denominator of morality that every one of us can get behind!\n\nMy first question for you all is: how can we get our fellow ostriches to stop fearing the unknown enough to get their heads out of the ground and breathe some fresh air with us?\n\nCheers mates\\~\\~\\~",
        "created_utc": 1678242098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone send me a [working] link to Singer's MA Thesis?",
        "author": "DaUnkos",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11liqoc/can_someone_send_me_a_working_link_to_singers_ma/",
        "text": "It's called \"Why should I be moral?\"\n\nthis link is dead :( &lt;[http://dtl.unimelb.edu.au/R/LSS3QGBEB493GSJG729BBIKGAGFB7BMI7K7YEHHB9BD77GASQU-00003?func=dbin-jump-full&amp;object\\_id=264525&amp;local\\_base=GEN01&amp;pds\\_handle=GUEST](http://dtl.unimelb.edu.au/R/LSS3QGBEB493GSJG729BBIKGAGFB7BMI7K7YEHHB9BD77GASQU-00003?func=dbin-jump-full&amp;object_id=264525&amp;local_base=GEN01&amp;pds_handle=GUEST)\\&gt;\n\nAnd the Melbourne Uni library won't loan it out &lt;[https://cat2.lib.unimelb.edu.au/record=b3016095](https://cat2.lib.unimelb.edu.au/record=b3016095)\\&gt;\n\nCheers my fellow Feurbachs\\~\\~\\~",
        "created_utc": 1678240472,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we immediately understand what 'the only rule is there are no rules' means?",
        "author": "SportSportManMan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lhsh1/how_do_we_immediately_understand_what_the_only/",
        "text": "Logically, the phrase is contradictory because it's self-referential, but we know it really means 'you can do whatever you wish within the confines of the activity.' Why does it make sense to parse it this way?",
        "created_utc": 1678238003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought Experiment Concerning this statement: “I am in a coffee shop.”",
        "author": "Low-March6725",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lgw01/thought_experiment_concerning_this_statement_i_am/",
        "text": "Philosophically speaking, how would you interpret this statement?",
        "created_utc": 1678235698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does Aristotle list \"ethnic\" conflicts?",
        "author": "aristurtle2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lgvlo/where_does_aristotle_list_ethnic_conflicts/",
        "text": "[removed]",
        "created_utc": 1678235670,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are arguments for compatibalism in the free will debate and does anyone have links to book extracts, articles or other literature by people in favor of compatibalism?",
        "author": "drwkcb",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lgm5y/what_are_arguments_for_compatibalism_in_the_free/",
        "text": "So im writing about the question if free will is real/an illusion and i need some more fuel for talking abt compatibalism. Sadly i cant get to the library as plannned due to bus strikes at the moment so i need to find online rescources for it (im crunching hard rn). Does anyone have any recomendations for people/books/articles i can find online and use as scources?",
        "created_utc": 1678235016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origins of the title of the Peripatetic Axiom",
        "author": "SurprisedPhilosopher",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lfz85/origins_of_the_title_of_the_peripatetic_axiom/",
        "text": "Why does the **Peripatetic axiom** bear that name.  \nIt is the principle that:  *Nothing is in the mind that was not first in the senses*\n\nThe \"axiom\" comes from Aristotle via Aquinas - but why is it given the title \"Peripatetic\" which comes from Aristotles \"Peripatetic school\"?  \nWas this axiom so closely associated with Aristotle or taken as so fundamental that it gets the titular name of his school?\n\nI am initially concerned with the historical question:\n\n1) Who or where/when or amongst which group did it begin to be called the Peripatetic axiom ?\n\nBut my main focus is:  \n2) Is it because of its central importance in Thomist and/or Aristotelian philosophy that it gets the titular name of Aristotle's Peripatetic school.\n\nWhich touches upon the two further - but less important to me questions of  \n3) How central was this principle to ancient Aristotelians and/or medieval schoolmen ?\n\nand  \n4) Were attitudes/interpretations of this principle different in ancient and medieval times?",
        "created_utc": 1678233507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have recommendations on works going into detail on the philosophical implications of truly sentient AI?",
        "author": "_laja",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lfgxn/does_anyone_have_recommendations_on_works_going/",
        "text": "Ideally I would enjoy something like Blackburn's Think where it has ongoing argument/counterargument, and touches on multiple authors and topics, but I am interested in any recommendations!",
        "created_utc": 1678232288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Existentialism…or what?",
        "author": "activepanda709",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lf32a/existentialismor_what/",
        "text": "[removed]",
        "created_utc": 1678231374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Existentialism…or what?",
        "author": "activepanda709",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lee87/existentialismor_what/",
        "text": "[removed]",
        "created_utc": 1678229844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did ancient western philosophers consider normative and descriptive statements to be qualitatively different in the way that we do?",
        "author": "schmsofthetls",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ldvgo/did_ancient_western_philosophers_consider/",
        "text": "Many ancient western philosophers certainly make the assumption of a \"higher cosmological order.\" Plato's forms and Aristotle's teleology certainly seem to be normative in the sense that they describe how things \"ought\" to be, but they also seem to be descriptive in the sense that a \"form\" or a \"telos\" is part of the nature of reality. Of course, I may not be understanding it right but to me it seems like they conceive of them as deeply intertwined.",
        "created_utc": 1678228710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Papers arguing for Moral Naturalism?",
        "author": "FizzayGG",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lduec/best_papers_arguing_for_moral_naturalism/",
        "text": "Hi everyone,\n\nI've been reading up on Metaethics for a while, and currently lean toward Moral Non Naturalism. I realise I don't really understand much about the Naturalist position though, and was surprised to find it's a popular position (at least as far as the Phil Papers survey is concerned)\n\nAnyone know of any good papers that aren't behind a paywall? Bonus points if it's specifically a response to Non Naturalism\n\nCheers guys",
        "created_utc": 1678228642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is theology seen as distinct from philosophy rather than philosophy based on a specific set of assumptions?",
        "author": "Knozs",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ld0ad/why_is_theology_seen_as_distinct_from_philosophy/",
        "text": "Hi, I know you get many questions about theology vs philosophy vs philosophy of religion, so let me give you more context.  \nI used to believe that theology was part of philosophy, but then I found out that this is generally considered wrong and it's supposed to be seen as a distinct though related discipline.  \n\n\nSearching for answers about this here I noticed something resembling a consensus that theology is different from philosophy because it starts from the assumption that (a specific conception of) God exists and the philosopher believes in personally, while philosophy of religion provides more of an \"outsider's perspective\".  \n\n\nAssuming this is correct (for purpose of the question - it does sound a bit odd since I understand there are atheist theologians), why is this enough to make theology distinct from philosophy, when philosophy and specific philosophical schools of thought generally start from specific assumptions too?  \n\n\nAfter all, ethical theories start from a specific set of assumptions which the philosopher generally personally believes in, but ethics is still considered a branch of philosophy.  \n\n\nAre theological assumptions supposed to be seen as fundamentally different and thus disqualify the discipline from being philosophy?   \n\n\nPS: I'm not asking this from a pro-theology/religion perspective by implying that not considering theology philosophy is unfairly dismissive of it BTW (I'm an atheist)",
        "created_utc": 1678226815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy in Flowers for Algernon?",
        "author": "Low_Knowledge_4740",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lcr3w/philosophy_in_flowers_for_algernon/",
        "text": "\nI have to write a paper on Flowers for Algernon by Daniel Keyes for a philo class and I was wondering if there were any philosophy allegories/buzzwords I should mention. (I have Plato’s allegory of the cave already). Any help would be much appreciated!!",
        "created_utc": 1678226270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can abductive reasoning be about future given some evidence?",
        "author": "Nothavingdiscussions",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lcod7/can_abductive_reasoning_be_about_future_given/",
        "text": "Some source about it?",
        "created_utc": 1678226103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it right to understand Aristotle as essentially putting forward a common sense metaphysics?",
        "author": "-tehnik",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lcl90/is_it_right_to_understand_aristotle_as/",
        "text": "Everything I've learned about Aristotle over the years gives me the impression that, when it comes to metaphysics, he:\n\na) never contends common sense positions, only those of other philosophers, be it Plato, the atomists or whoever\n\nb) believes in a strong way that language reflects the real world \n\nAnd this gives me the idea that Aristotle isn't even putting forward some unique kind of metaphysics. He's just giving a detail philosophical articulation of the metaphysics any normal, non-philosopher person believes in.\n\nIs this right? Or does it overlook something important?",
        "created_utc": 1678225910,
        "upvote_ratio": 0.99
    },
    {
        "title": "What does existential nihilism say about duty?",
        "author": "ApotheosisOfEntropy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lby23/what_does_existential_nihilism_say_about_duty/",
        "text": "[removed]",
        "created_utc": 1678224484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can one truly determine if they’re conscious?",
        "author": "NotUniqueUsernameee",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11lbstk/can_one_truly_determine_if_theyre_conscious/",
        "text": "This is a tacky theoretical question I know, but I believe it to be a legitimately interesting question if given it’s weight. \n\nI know it’s been tackled before but honestly I’m pretty dumb and… lazy. I’d like a modern perspective based upon previous works and research by geniuses. Reddit can provide that. \n\nOk, so how can I determine whether or not I’m conscious? Well, I can begin by dissecting whether I’m aware of myself, my qualities, my surroundings, and how my surroundings influence myself, just to name a few. If I can see a clear correlation, and I can assume the basic premise of consciousness is reasonable, I can certainly and very easily establish that I am conscious.\n\nBut… How does one observe his or her inner-workings? How could one possibly analytically and objectively separate themselves into two separate and distinct sides (both of which firmly rooted in his or her own reality), and then establish that one side is conscious and the other side is the observer of consciousness?\n\nFurthermore, taking this another step down this confusing road; if one cannot determine whether they are conscious because the whole determination process is a sham.. How does one know that consciousness (or even the ideas and definitions of consciousness) are real in the first place?",
        "created_utc": 1678224150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having trouble with Reductive Materialism vs Eliminative Materialism",
        "author": "blarneyone",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l9wt5/having_trouble_with_reductive_materialism_vs/",
        "text": "Hi all,\nI'm doing a bit of reading on materialism, particularly regarding the mind/consciousness, and I'm getting tripped up on some terms. Namely, reductive and eliminative physicalism. As far as I understand it, reductive materialism in this context contends that mental states (desires, emotions, etc.) can be mapped, or reduced, down to a set of physical circumstances within the brain, such as the firing of specific neurons mixed with specific neurotransmitters in specific amounts. Eliminative materialism, on the other hand, I'm a little more sketchy on. From what I've read, apparently eliminative materialism claims that mental states such as those addressed by reductive materialism simply don't exist. \n\nI'm having trouble understanding what someone means if they say that a mental state doesn't exist. I get that a mental state may not exist as an extant physical entity in reality the same way a car or elephant does, but if a mental state can be explicitly identified by a physical configuration of neurons and chemicals, isn't that mental state then exactly that physical configuration? And if that physical configuration **is** the mental state, doesn't it therefore exist?\n\nWhat am I missing? Thank you!",
        "created_utc": 1678219978,
        "upvote_ratio": 1.0
    },
    {
        "title": "History of Western philosophy book from existential-hermeneutic-phenomenological or pragmatic perspective?",
        "author": "SpiritualBreak",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l8le2/history_of_western_philosophy_book_from/",
        "text": "The EHP and pragmatic perspectives resonate most with my own way of thinking. Are there any histories of W. philosophy written specifically from those perspectives, or at least written by an author friendly to them? Thank you.",
        "created_utc": 1678217090,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a good entry point for Lacan and Deleuze?",
        "author": "PoisonousOrange",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l8l64/whats_a_good_entry_point_for_lacan_and_deleuze/",
        "text": "Basically the title: I'd like to begin reading some of their books (or even some authors that explain their thought) to understand them. Any recommendations?",
        "created_utc": 1678217075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought experiment involving causation and bundle theory: “I am in a coffee shop.”",
        "author": "Low-March6725",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l7tt1/thought_experiment_involving_causation_and_bundle/",
        "text": "How would you interpret this statement operating in the framework of causation? Does bundle theory play a role in the banal statement of: “I am in a coffee shop.”",
        "created_utc": 1678215388,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a \"complex object\" as used by Bertrand Russell?",
        "author": "Thomassaurus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l7qcg/what_is_a_complex_object_as_used_by_bertrand/",
        "text": "",
        "created_utc": 1678215167,
        "upvote_ratio": 1.0
    },
    {
        "title": "deus mendigo",
        "author": "piostremel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l7kce/deus_mendigo/",
        "text": "Oh, o homem é um #deus quando sonha e um mendigo quando pensa, e quando o entusiasmo desaparece fica como um filho #pródigo, expulso de casa pelo pai, e olha para os míseros centavos que a compaixão lhe deu pelo caminho.\n\n#filosofia\n\nHyperion (Livro I, epístola II) - Hölderlin",
        "created_utc": 1678214785,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are Hegel's spirits?",
        "author": "Largest_Half",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l7jkl/what_are_hegels_spirits/",
        "text": "Could somebody explain and help me understand the Hegelian concepts of spirit? As in; Subjective spirit, objective spirit, absolute spirit. Also the Volksgeist, weltgeist, zeitgeist?\n\nSorry if this may asking a lot - struggling to understand the whole spirit concept!",
        "created_utc": 1678214737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studying Philosophy,my question is what are two arguments you believe go against Moral Relativism?",
        "author": "pppjd25133",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l76pe/studying_philosophymy_question_is_what_are_two/",
        "text": "One argument for me would be “touring humans for fun is wrong” … I am here for OTHER OPINIONS &amp; to see if I have clear understanding of moral relativism and if anyone can shift my insight on moral relativism. Thank you!",
        "created_utc": 1678213936,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is a thesis that I’ve been working on as a 14 year old. Opinions? (I don’t care if it’s harsh or critical)",
        "author": "uToPiAnReALm",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l6wp9/this_is_a_thesis_that_ive_been_working_on_as_a_14/",
        "text": "",
        "created_utc": 1678213331,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are two thorough arguments against moral relativism",
        "author": "pppjd25133",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l6wbx/what_are_two_thorough_arguments_against_moral/",
        "text": "In detail can you provide two arguments that go against moral relativism, why did these stand out most to you why are they the most important arguments that go against moral relativism.",
        "created_utc": 1678213308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading a translation vs original language?",
        "author": "ospsdkvnlvnlvks",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l6q6u/reading_a_translation_vs_original_language/",
        "text": "I began learning German so that I could study philosophy in German, but am now concerned that it is futile. I am really poor at learning languages (although a lifelong goal of mine is to to speak a second language - spoken German doesn't interest me however), and I fear I could study for years and still, for example, get a more accurate understanding of Hegel through reading an English translation than the German.\n\nI do not intend on being a professional scholar of German philosophy, so wonder if I'm better off relying on the scholars who have translated the works instead of devoting years to doing it myself.\n\nDoes anybody have experience learning a language to study philosophy, and whether it is worthwhile for a hobbyist?",
        "created_utc": 1678212933,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the implications of Heidegger's analysis of technology for our understanding of the human condition and the possibilities for human flourishing? In what ways might his insights challenge or inspire us to rethink our priorities and values as a society?",
        "author": "Sovereign_Panda",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l5gme/what_are_the_implications_of_heideggers_analysis/",
        "text": "I'm writing my Post-Kantian Philosophy Masters dissertation on Heidegger and his famous essay 'The Question Concerning Technology' and wanted to get some ideas and inspiration outside of my own head.",
        "created_utc": 1678210089,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the mind aware that it is concious?",
        "author": "hunterscodes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l4ykv/how_is_the_mind_aware_that_it_is_concious/",
        "text": "I am going down a rabbit hole of thought and these are the assumptions I have right now:\n\nConsciousness is a fundamental of the universe. It is unchanging. Anything that can have an input through a \"sense\" is conscious even at the most basic level such as a thermometer, though it cannot reflect, or even understand it is conscious since it lacks the complex computation of something like human brains.\n\nIdentity is the individuals POV. When I say identity, I mean (inset your name) experience of reality. Your wants and dreams, your individual experience, your identities POV is within your mind through your memories. In a thought experiment, if you were to transfer your memories to another individuals, your individual POV would shift into another mind, as each mind has the same fundamental consciousness, you are simply uploaded to a new outlet tuned into the frequency of consciousness.\n\nI believe we all share the same consciousness which is separated by individual minds, our minds tap into this fundamental ocean of consciousness, though we are unaware of this since we are within our own individual minds and perspectives limited by identity and the physical brain.\n\nMy confusion is how we are able to even write about our POV, consciousness in the first place. How is it that I am aware that I am conscious, rather than a silent observer watching a brain that is just doing its thing? Maybe consciousness is a silent observer yet it is unaware that it is truly separate from the mind, since it is experiencing the thoughts and emotions of the being. But then again how would the being even be able to articulate that there is a conscious POV in the first place? It does not make sense to me, I hope this makes sense and if anyone can shed light in holes in these thoughts or further examine these thoughts I would appreciate the discussion.",
        "created_utc": 1678208932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plato’s Parmenides (145d): The whole is not in the parts, specifically not in all parts. What is Plato’s reasoning here?",
        "author": "stalinposter",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l45i3/platos_parmenides_145d_the_whole_is_not_in_the/",
        "text": "A one has shape. It will be both (a) in itself and (b) in another. In reasoning out (b), Parmenides denies that the whole is in the parts, neither (1) in all the parts nor (2) in any part. The argument in (1) is confusing, located at 145d.\n\n&gt;If it were in all, it would have to be also in one part, for if there were some one in which it was not, it could not be in all. But if this one part is one among all the parts, and the whole is not in this one, we can no longer say it is in all the parts. \n\nIs he saying that the whole cannot be in one part (and if not in one part, then not in all), similar to the reasoning in the next paragraph that the greater cannot be contained by the smaller? I think that’s what he’s saying now, as I type this out.",
        "created_utc": 1678207139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an official name or term for the idea/behavior I’ve been describing as sophomore syndrome?",
        "author": "Theycallmegurb",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l2kya/is_there_an_official_name_or_term_for_the/",
        "text": "\nThis may be the wrong place and if it is I apologize.\n\nI’ve always found that the people who treat freshmen the worst aren’t seniors but sophomores. Something about being low on the totem pole but not the very bottom seems to bring out the worst in people when it comes to interacting with the lowest group on the totem pole. I can come up with a few quick examples (these are obviously generalizations) like: Irish immigrants being discriminated against in the early 1900s and some of the worst pockets of racial violence being in areas of highly Irish and black populated areas, Journeymen treating commonly treating apprentices more poorly than the masters/foremen, and (without getting too political) impoverished far right wing Americans blaming other impoverished Americans for being a drain on the our systems.\n\nIs there a name for this type of behavior in humans or am I just off my rocker and drawing connections that don’t exist?",
        "created_utc": 1678203563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arguments and Exclamations",
        "author": "aribowe13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l25h2/arguments_and_exclamations/",
        "text": "What is the difference between arguments and exclamations?",
        "created_utc": 1678202585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there more to life?",
        "author": "lunarlight666",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l24qe/is_there_more_to_life/",
        "text": "In a broad sense of things, a human life is heaviliy habitual: wake up, go to sleep, work, eat, do this, do that. The repetitiveness itself somehow pertains its own sense of meaninglessness. Certain activities are not to be broken since they allow for one to be. But why is it then that I am able to question whether I wish to continue doing so as it threatens one's survival? Am I suicidal? (LOL) Rather often I come about aware of what I did at that moment to realise that I have already done so and am subconsciously willing to do it again sooner or later, and, in a sense, it is rather dull, terrifying. Anyways, the point of this is can there be more to life than just \"conventional living\"?",
        "created_utc": 1678202537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does Egoism fall on the political spectrum?",
        "author": "BoyBecomesToy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11l0vht/where_does_egoism_fall_on_the_political_spectrum/",
        "text": "I'm currently reading Max Stirner and have come to a bit of a crossroads. Whilst I can see the irony in this question - as politics itself can be considered \"a spook\" - I've found myself wondering where people across the political spectrum would personally identify with or reject Egoism. \n\nLeft, right or anywhere in between I'd love to hear people's thoughts!",
        "created_utc": 1678199506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Marxists/Lacanians seen to abolish all human contradictions?",
        "author": "Hilarial",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kym69/do_marxistslacanians_seen_to_abolish_all_human/",
        "text": "I'm trying to get into Marx and Lacan, and my understanding of historical materialism is shaky. To my understanding, every *thing* or notion of a *thing* arises as a distinct identity in opposition to its own opposite. This can be observed in matter, and in ideas, which then go on to influence each other and create both material and social change.\n\nIn advising for communism, does Marx advocate for the abolition of heirarchy in a utopian sense? Or just the abolition of social heirarchies? Man and woman can be considered to be defined in position to each other, not because of their genitalia but by patriarchy and agriculture. The notion of a man or woman need not exist.\n\nI'm pretty sure I have that wrong. Also I'm not referring to Marxism-Leninism here.",
        "created_utc": 1678193695,
        "upvote_ratio": 1.0
    },
    {
        "title": "A \"weird\" type of values: friendship and personality",
        "author": "Smack-works",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kydm6/a_weird_type_of_values_friendship_and_personality/",
        "text": "I know about the [\"Intrinsic vs. Extrinsic\"](https://plato.stanford.edu/entries/value-intrinsic-extrinsic/) value distinction.  \n\nI want to ask how philosophers classify such values as \"friendship\" or \"personality\". To me those values feel a bit weird and philosophically interesting. I'm going to explain what I'm talking about with the two examples below. \n\n## Example 1: friendship\n\nI value my friendship with Bob. More than anything else.\n\nI want to preserve my friendship with Bob.\n\nHowever, only in a **limited** way: for example, I don't want to manipulate Bob or trick him in order to preserve our friendship. I'm ready that our friendship can end in a natural way.  \n\nOur friendship is like a \"game\": I want to win the game (more than anything else), but I don't want to cheat, even if I lose.\n\nSo, it feels like a weird temporal and path-dependent (i.e. it depends on the history of the world, not only on the current state) value. And at the same time it seems to be an intrinsic value. \n    \n## Example 2: personality\n\nI value Bob's personality. More than anything else.\n\nI want to protect Bob's personality from forceful, harmful, unwanted (by Bob) changes. \n\nHowever, Bob's personality still can change drastically.\n\nSo, how to describe such value? It feels intrinsic, but it's also path-dependent and changeable.  \n\n...\n\nHow can a philosopher classify/analyze such values?   \n\nI know, I haven't precisely defined the situations in the examples. I'm just hoping I'm far from the first person to ask those questions.\n\nI guess the most obvious way to deal with the examples is to say I have multiple types of intrinsic values: for example, I value my friendship with Bob, but I **also** value some set of deontological principles (like \"don't manipulate Bob, even if you lose his friendship\"). However, I think such answer is a way to avoid the main discussion: *\"when we value friendship in a normal human way, what do we actually value, what are the essential properties of that value?\"* Modeling the situation with many different values may sidestep this important question.",
        "created_utc": 1678193022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do fictional characters exist?",
        "author": "Silver_Primary1549",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ky56x/do_fictional_characters_exist/",
        "text": "",
        "created_utc": 1678192387,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much of The Prince is a true reflection of Machiavelli’s beliefs? How much was it opportunism? How much was it satire? Is there an argument that Machiavelli was actually mocking the Medicis and/or offering advice to them in the form of a poison pill?",
        "author": "SideOneDummy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kw5ts/how_much_of_the_prince_is_a_true_reflection_of/",
        "text": "Having read both *Discourses on Livy* (one of my favorite political philosophy treatises I’ve ever laid eyes on), Machiavelli draws a clear change of tone that not only criticizes the necessity of autocratic societies, such as principalities, but is skeptical of their ability to survive wars and revolution. \n\nHave you read *Discourses on Livy*? What do you believe Machiavelli actually believed?",
        "created_utc": 1678186677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are some philosophers that are both analytical and continental in nature?",
        "author": "Danaheh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kvovq/who_are_some_philosophers_that_are_both/",
        "text": "Preferably those who are mainly analytical, and derive their continental views with the influence of their analytical lens",
        "created_utc": 1678185144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do we have knowledge by acquaintance( Russell )with mathematical entities?",
        "author": "GroundbreakingOwl492",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kuf4z/do_we_have_knowledge_by_acquaintance_russell_with/",
        "text": "Hi everyone,\nI’ve read Russell’s paper on the topic of knowledge, but it is unclear to me wether we understand concepts such as the addition through acquaintance or description. I really need to get this clear for an assignment…does anybody know the answer? Thanks in advance",
        "created_utc": 1678180778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fredric Jameson's Marxist Hermeneutic",
        "author": "This-Promotion-949",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ku6f5/fredric_jamesons_marxist_hermeneutic/",
        "text": "Hi. When I google Jameson, I see this term 'marxist hermeneutics' and that he is trying to create an interpretive framework for Marxism as it existed for Biblical studies. What are some details of this hermeneutics and why would Marxism need an interpretive framework? Also how does this relate to modern hermenutic thinkers like Gadamer and Ricoeur? I noticed that Jameson draws upon Ricoeur in his book Valences of Dialectic.",
        "created_utc": 1678179862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Kant a theist, an agnostic, or an atheist?",
        "author": "Av3rageNerd78",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kr5x6/is_kant_a_theist_an_agnostic_or_an_atheist/",
        "text": "I have heard many things about Kant being either A) Agnostic, B) Theist, or C) an Atheist. I know he’s highly regarded as one of the most influential figures in the Enlightenment era, however there has been numerous discussions about whether he was any of these 3, I’m curious as to what majority of folks say he is, and which one seems more probable.",
        "created_utc": 1678169344,
        "upvote_ratio": 0.99
    },
    {
        "title": "Are Jeffrey Kaplan's videos a good source for learning philosophy?",
        "author": "Archi_violencia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kpij3/are_jeffrey_kaplans_videos_a_good_source_for/",
        "text": "",
        "created_utc": 1678164561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it harder for an intelligent 2D creature to think of 3D, than for us to know the origin of the universe?",
        "author": "afewquestion",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kp0la/is_it_harder_for_an_intelligent_2d_creature_to/",
        "text": "So if a 2D creature is very intelligent, it can think \"I am living in a world of infinite 1D lines stacked together. I also know that a 1D is made up of infinite 0D points\" - because this creature understands 0D, 1D and 2D. It can then think, what happens when we have infinite 2D planes - it will have trouble thinking about it visually, but it may think \"I can travel from one plane, to the next plane\". Same way we know that 4D can be an infinite stacking of 3D objects - creating the illusion of time or movement etc\n\nThis is still pretty hard to think about. But would knowing the origin of the universe for us be able hard as the 2D creature thinking about the 3D?",
        "created_utc": 1678163158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Predicate Logic - proof of a lema",
        "author": "cleandiva",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kop1h/predicate_logic_proof_of_a_lema/",
        "text": "I need help with this question I've been asked as part of a metalogic assignment - thought I'd come here.\n\n(Because the subscripts aren't showing up, just note that every superscript I use in this post is actually a subscript)\n\nHow do I prove that natural number n, Γ^(n) is p\u0015consistent?",
        "created_utc": 1678162266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Down Up vs Up Down",
        "author": "ElectronicRhubarb841",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kohdt/down_up_vs_up_down/",
        "text": "Up down in short is the classical view of going from the top \"God\" down to everything bellow. A sentence that come to mind is \"as above so bellow\". \n\nDown Up on the other side is the idea that life, nature, the universe and ultimately reality emerged from the bottom up. How would that be? Well, one sentence that come to mind is \"positing the presuppositions\". Everything capable of positing its own presuppositions is taking there own power of reflection to grow up into complexity. \n\nAn example is the concept of true versus false infinity. False infinity is a infinite repetitive entity which isn't going nowhere or isn't building anything out of their infinity. On the other side true infinity starts with an obstacle. Something inherently capable to experience its limitation and start building from there.\n\nAn example is the cell. Without the cell membranes, a cell would not be able to multiply. But as soon as a cell takes knowledge of its limiting membranes, it can start multiplying and as such create a true infinity that builds upon an entity positing its presuppositions. In this case, I'm positing a limitation, it's time for multiplying and create out of limitation an infinite amount of combinations building life, nature, earth, the universe from the ground up.\n\nIsn't this view a proof that we can get rid quite easily of god. Reality emerging out of physical laws, chemical reactions and finally biological components. We are litteraly matter made alive from the ground up. Matter looking at it self. Not god looking over matter. There nothing but us over dead matter. And nothing over living matter. We are alone. Fully responsible. I think it's a very scary scenario for most which explains the god invention. \n\nWhat's your opinion? How would you put it in your own words...?",
        "created_utc": 1678161689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can an all-knowing being know the universe's origin?",
        "author": "afewquestion",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kocmo/can_an_allknowing_being_know_the_universes_origin/",
        "text": "Let's assume there is a being that is all-knowing, is it possible for it to know how everything started? And is it possible that everything always was, and can an all-knowing comprehend this?\n\nThanks!",
        "created_utc": 1678161338,
        "upvote_ratio": 1.0
    },
    {
        "title": "“The unexamined life is not worth living” vs “Amor Fati”",
        "author": "memebaes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ko3il/the_unexamined_life_is_not_worth_living_vs_amor/",
        "text": "So I was watching a video that explains Nietschze’s idea of living life, “Amor Fati” which means love of fate. From what I understood, Nietschze says that you should accept your fate as it is because you took the best decision at that moment with what you had and with what your state of mind was in that moment. Once you’ve learnt to love your fate is when you can achieve greatness and be happy.\n\n“The unexamined life is not worth living “, said socrates. Here’s where the conflict rises for me. If I look at both the ideas separately, I understand and appreciate these. But when I examine these in conjunction, I think that it’s important to examine life because that’s how I can understand what I did wrong but that leads to me thinking about my fate and not accepting it. Is there a way to analyze this in a different way to get better clarity?\n\nNote: I’m a complete beginner at philosophy so excuse my shabby framing/delivery of argument",
        "created_utc": 1678160631,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I read after Camus ?",
        "author": "COOLKC690",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ko0nd/what_should_i_read_after_camus/",
        "text": "Im a teenager and I recently finished reading some works by Camus - liked the philosophy and the process of studying itself.\n\nWhat’re other philosophers I should check out ? I’m still a teenager about to enter high school so hopefully not Hegel lol. Nonetheless I just wanted to know some good philosophers wether they’re of similar Themes or just good enough for me to comprehend. \n\nThank y’all !",
        "created_utc": 1678160405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a good philosophical argument against incestuous relationships?",
        "author": "HariboMeow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kmdm9/is_there_a_good_philosophical_argument_against/",
        "text": "So there are two arguments I hear most often: firstly it leads to genetic defects (what if you used contraceptives), and secondly it causes an increased potential for emotional turmoil between the people involved (but there are all kinds of situations where an increased potential for emotional turmoil is caused, for example long distance relationships, that don't get nearly the same level of pushback as incest does).\n\nDo you have a good argument against incest if it involves two consenting adults who use contraceptives?",
        "created_utc": 1678156092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logic Textbook Suggestions",
        "author": "simism66",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11km1t3/logic_textbook_suggestions/",
        "text": "I'm teaching introduction to logic next year, and I'm not completely happy with any of the existing textbooks, so I'm writing a coursebook so that I can do things exactly how I want and provide the explanations that I think would be most helpful. I figured I'd ask if people here (whether you're a teacher or student) had any thoughts/suggestions about topics/issues/ideas that students often find confusing that I should pay special attention to in writing a coursebook, specific exercises that are particularly good ones for students to do, or anything else that comes to mind. Thanks!",
        "created_utc": 1678155276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Harry Frankfurt’s “On Bullshit”",
        "author": "ripweiss",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11klzba/harry_frankfurts_on_bullshit/",
        "text": "I’ve recently read Harry Frankfurt’s “On Bullshit” and I don’t fully understand why actively ignoring the truth is worse than subverting it. In my understanding the difference is almost nothing because they’re both disregarding the truth for their own gain. If truth is the highest good (or one of the highest) then how is the disregard of it worse than the active subversion of it? Is there a step I’m missing in this argument or a psychological step that the Bullshitter makes that I’m not releasing?",
        "created_utc": 1678155107,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is Aristotle’s concepts of ‘potentiality’ and ‘actuality’ to be understood?",
        "author": "RealFused",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11klwyf/how_is_aristotles_concepts_of_potentiality_and/",
        "text": "The analogy was given to me that a kettle is potentially hot and actually cold when it is not on a stove. But it is potentially cold and actually hot when it is on a stove. With this analogy I wonder if the kettle could not also be said to be potentially ‘hotter’ even when it is being heated? Does Aristotle allow for multiple potentialities of a thing or is there a single potentiality that is destined to be actualised?\n\nNow this seems to me to simply be a rhetorical category saying that things might change in the future, I was wondering how it carried any metaphysical weight or significance about an object beyond saying ‘a seed might become a tree’?",
        "created_utc": 1678154950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Democritus right about there being no true empty space? (In regards to atoms)",
        "author": "Tap__Tap__",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11klr17/is_democritus_right_about_there_being_no_true/",
        "text": "I was starting to listen to the Philosophize This podcast after taking the course and he brought up Xeno’s paradox about halving a distance an infinite number of times. I remember our professor bringing this up but not elaborating on it *at all* and it left me stumped. Until I heard about Democritus theorizing that all empty space being completely filled with atoms. And I audibly went “Ohhh”, but I am wondering if this is legitimately the what people believe today? I wanted to google it but I felt I could flesh it out more here.",
        "created_utc": 1678154535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question of Extreme Moral Burden",
        "author": "AKerr1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kl92a/question_of_extreme_moral_burden/",
        "text": "(This gets a bit heavy, so only read if you want haha)\n\nIf all men alive until the end of human existence were able to make a deal to suffer immensely so that one man may live forever in happiness, should they? \nEven if it isn’t overt happiness, maybe just enough to produce a satisfied smirk, if it is enjoyed infinitely, then eventually it will overtake even the most unimaginably terrible pain suffered by the trillions that came before. \nI doubt that the one man would want that, but mathematically, if you were to say that happiness and pain were able to cancel each other out, it would make sense. \nIf the happiness is infinite, it will eventually overtake the pain, no matter how immense.\n\nFollow up: Should all men, even atheists, proselytize a religion of salvation, even dedicate their lives to the cause, so that if Hell is real they save at least one? Even if there is only an infinitesimal chance that said religion is real, there still remains the chance, and with it come infinite stakes. Do we not have the moral obligation to maximize the potential happiness-to-suffering ratio?\n\nIf not, how much should we weigh our own happiness and the happiness of others right now versus the potential to help much more later? Should we give up all passions in the pursuit of justice and bettering the world, even if it means we will be miserable? It is likely our individual suffering will be overtaken by the good that we create in this pursuit. Should we attempt to make others feel the terrible weight of such an extreme moral burden, then forcing them to suffer, but for the potentially profound betterment of other people? Like a moral investment?\n\nPlease let me know your thoughts.",
        "created_utc": 1678153280,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are good secondary sources on philosophy of logic for analytic philosophers?",
        "author": "Iansloth13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kkxlp/what_are_good_secondary_sources_on_philosophy_of/",
        "text": "I am going to begin a research project for class outlining the role of logic in the thought of Frege, Wittgenstein, Russel, and Ayer, and I would like a possible reading list essentially for responses to these thinkers. \n\nPapers seeking to either interpret their views or critique are both welcome. \n\nThat is all really.",
        "created_utc": 1678152515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does anything exist? Why does the universe exist rather than just being “nothing”? Can there ever really be “nothing” since there’s always been “something”?",
        "author": "thcontinuum4799",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kklwb/why_does_anything_exist_why_does_the_universe/",
        "text": "",
        "created_utc": 1678151706,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is nonbinary?",
        "author": "7OzZzie",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kjty8/what_is_nonbinary/",
        "text": "There are only two sexes, male and female. That is a biological fact. But gender ideology on the other hand is much more complicated and \"diverse\". A couple weeks ago I thought that there were three genders identities: male, female, and nonbinary. But I saw a matt Walsh video and am now contemplating the existence of non-binary. I have a good nonbinary friend and their reasons for being non binary are that they don't feel comfortable in their body. They aren't non binary because they like \"more masculine things'. They told me that they are identifying as nonbinary because they feel really uncomfortable in their body, they hate the parts that they have but they don't \"vibe' with the other sex. I was friends with them when they were a woman but an unhappy one. They didn't feel happy in their body but they didn't want to be in the body of a man. They struggled with their mental health and body dysphoria and gender. And it was until three months ago which they now identified themselves as non binary. They told me that they chose to be non binary because they were confused and stressed with their gender for a long time. And identifying as nonbinary felt like a safe place and a safe way for them to identify as while they are still figuring out their gender. But from what I've seen so far with them is that they are happier, more confident, more outspoken, and social. They didn't make their gender identity their whole personality, and they didn't identify as non binary because they like more feminine or more masculine things. They identify as non binary because they are still trying to figure out what gender that they want to identify as. I'm in highschool and I'm just so confused with the strong opinions of Jack Star and Matt Walsh whom I sort of understand and agree with, but seeing my friends side of their story just makes me question everything surrounding nonbinary. If anyone could help me please do! Im sorry this is so long.",
        "created_utc": 1678149805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are some philosophers that are extremely profound yet receive little attention from the mainstream?",
        "author": "NotLongForThisSite",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kjs6y/who_are_some_philosophers_that_are_extremely/",
        "text": "Maybe it's a matter of preference as a philosopher who is known is not unknown, but are there any such philosophers? Blondel, for example, was very influential though fail into obscurity after the post WWII condition took over.\n\nAlso, to clarify, I am not asking about philosophers who are just unknown in the West, like Russian or Chinses philosophers. Rather, philosophers who made almost no contribution to the greater discourse of philosophy yet whom you feel should be discussed or more known.",
        "created_utc": 1678149683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is empirical science the only way to reach the truth? If yes, prove it with empirical science.",
        "author": "Icy-Acanthisitta-101",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kixjh/is_empirical_science_the_only_way_to_reach_the/",
        "text": "",
        "created_utc": 1678147653,
        "upvote_ratio": 1.0
    },
    {
        "title": "If qualia is real, and God is said to be omniscient, would he then necessarily also be omniqualescient (having qualia of every imaginable experience)?",
        "author": "frankichiro",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ki87h/if_qualia_is_real_and_god_is_said_to_be/",
        "text": "I don't believe in God, but I'm sure you are familiar with all the claims of how God is the greatest possible being, with omniscience, omnipotence, omnipresence, and similar attributes. God's possible existence also seem dependent on mind dualism, as opposed to naturalism or physicalism. This leads us to the concept of qualia, as hypothesised in the Philosophical Zombie thought experiment.\n\nSo, if qualia is real, and the greatest possible being is conscious, it would have qualia. An omniscient being would then presumably also be omniqualescient, and somehow have first-hand subjective experience of every imaginable experience. But this leads to a lot of philosophical weirdness...\n\nIf omniqualescience is necessarily true, then it is surely increasingly absurd, and contradict God's alleged omniscience and omnipotence, as it would mean God has experience of things like curiosity, helplessness, surprise, defeat, jealousy, and all kinds of things an all-knowing, all-powerful being would be ironically entirely oblivious of. He would also have first-hand experience of very horrible and perverted things.\n\nBut if omniqualescience is not necessarily true, then limited qualia still contradicts God's omniscience, as there are evidently things God is unable to know, which can only be learned through first-hand experience, as suggested in the thought experiment Mary's Room. This would suggest that God is fundamentally unable to relate to the human experience, in the same way humans are unable to relate to being a different species of animal. I see a lot of theological concerns in this case, depending on how God is imagined. What does it say about a being's capacity for love and morals if it may only be able to sympathise, but not empathise? How would God be able to perfectly design things that are pleasurable for our senses if he lacks the qualia to understand them? It's very common to misjudge things before personally experiencing them.\n\nLastly, if God has no qualia at all, then he is per definition a Philosophical Zombie, which means physicalism is true, and God can not possibly exist. But this was a weird premise from the start, as God would essentially be exclusively the \"mind\" part of the Mind-Body problem, and therefore be the very thing that has qualia. But, it also highlights the question of how an ultimate being, said to somehow exist beyond time and space, is even able to objectify things as external to itself, as there is nothing outside of itself to relate to. It would mean that whatever makes God conscious, it's emerged entirely from within, with nothing external added.\n\nThen again, as consciousness is to be self-aware, and God can't have an outside perspective of himself if there is nothing beyond God, it very much suggests that God is not a conscious being.\n\nAs I stated at the beginning, I am an atheist, because an omniscient being is completely absurd to me, but also impossible unless mind-body dualism is true. So I wonder how the concept of qualia affects the theological debate in regards to the philosophical arguments for God's existence and nature.\n\nTherefore, would you say that omniqualescience is necessarily true for an omniscient being?",
        "created_utc": 1678146045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is your life basically about status?",
        "author": "bbalint66",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ki69w/is_your_life_basically_about_status/",
        "text": "A simple animal is 'safe' when it has all the physiological needs (food, water, shelter), have enough companion (females, and others who can spend time with), and his status is well established in the group and the area so he won't be afraid to loose these things. When some other animal endanger any of these factors, he becomes 'unsafe' and does everything to come back to the state when he was 'safe'.\n\nAren't we human want the same? But now it is more difficult to get the status part?\n\nFirst it's hard to get it, because you have to work hard for it. You have to be good at something - in the social circle - in which no one is better than you. But after you get it, your social circle is expanded, you meet people who can be better than you at those particular things or somebody you knew also get better at this thing. And now you have to 'beat' those people too. And to make matter worse with social media, you see people that are better than you from 'very close', and deep inside you feel that your status (and your safety) is at risk.\n\nOne of my main concern, is being a better version of yourself (being kinder, smarter, better listener, etc.) can also be originated from status? You improve yourself, probably because you feel that other people (girls, close friends, family) doesn't like you (I mean deep down why would you do that if you feel that everyone is okay with you), so in a way your status becomes threatened? Yes, sometimes its only in your head or you are in a bad relationship, but after all you want to change to feel safe again.\n\n&amp;#x200B;\n\nP.S.: I am caught up in this whole world is a status game and everything that I read just strengthen this idea. I really did not want to sound ignorant, I feel that I don't know enough about the subject, and afraid to make very hard conclusions.",
        "created_utc": 1678145918,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much Kant should you read before the phenomenology of spirit?",
        "author": "TheChickenMan2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ki0bx/how_much_kant_should_you_read_before_the/",
        "text": "My goal is to read Hegel, but I am aware that having a solid grasp of Kant's philosophy is very important in understanding Hegel. I have already read the Critique of pure reason and I am wondering if I need to read the rest of his works as well i.e. The critique of practical reason and critique of judgment. I am primarily interested in Hegel's theology and metaphysics if that helps.",
        "created_utc": 1678145542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientific v legal reasoning",
        "author": "Siderox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11khz2b/scientific_v_legal_reasoning/",
        "text": "I was talking to old mate ChatGTP about the differences between scientific and legal reasoning. They gave me a handful of example texts by Frederick Schauer, Karl Popper, HLA Hart, and Brian Leiter. Unfortunately, one thing ChatGTP is not good at is referencing specific articles. I think it just made up the names of the articles it referenced, and it wasn’t very helpful when I tried to narrow down just where it got the info from (because, obviously it’s trained on hundreds of thousands of philosophical texts). \n\nSo, does anyone know of some good articles (books and book chapters are fine too) that discuss the differences between scientific and legal reasoning (eg from an epistemological framework)?",
        "created_utc": 1678145462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who would you say makes the “best” argument for nihilism?",
        "author": "Felt_presence",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11khg56/who_would_you_say_makes_the_best_argument_for/",
        "text": "",
        "created_utc": 1678144289,
        "upvote_ratio": 1.0
    },
    {
        "title": "In simple terms explain Ontology?",
        "author": "SurfinginStyle",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kh1xj/in_simple_terms_explain_ontology/",
        "text": "",
        "created_utc": 1678143418,
        "upvote_ratio": 1.0
    },
    {
        "title": "“The big dinner party” or something like this that?",
        "author": "herea005",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kg5vd/the_big_dinner_party_or_something_like_this_that/",
        "text": "I was listening to a Norwegian podcast but I don’t know what the English translation is. If you know about something similar to this it would help me a lot",
        "created_utc": 1678141420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chat GPT’s answer to this question: What have the philosophers throughout history thought on the idea of quantum mechanics being a fundamental part of the universe?",
        "author": "Low-March6725",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kg5ac/chat_gpts_answer_to_this_question_what_have_the/",
        "text": "“Quantum mechanics is a relatively recent development in science, having emerged in the early 20th century, so the concept did not exist in the philosophical discourse of earlier periods. However, there have been philosophical debates about the nature of reality and the fundamental building blocks of the universe that are relevant to the questions raised by quantum mechanics.\n\nOne historical perspective that is relevant to quantum mechanics is the idea of atomism, which dates back to ancient Greek philosophers like Democritus and Epicurus. Atomism proposes that the universe is composed of indivisible, unchanging particles called atoms, and that all macroscopic objects are made up of these atoms. This view has some parallels to the quantum mechanical concept of wave-particle duality, which suggests that subatomic particles like electrons can exhibit both particle-like and wave-like behavior.\n\nAnother perspective that is relevant to quantum mechanics is the philosophical school of idealism, which holds that reality is fundamentally mental or spiritual in nature, and that physical objects are ultimately composed of immaterial substances. Idealism challenges the idea that there is an objective physical reality that exists independently of our perceptions, which is a central assumption of classical physics. The strange phenomena of quantum mechanics, such as entanglement, have been used to support idealist arguments that the physical world is ultimately mental or spiritual in nature.\n\nMore recently, philosophers have engaged with the specific questions raised by quantum mechanics, including the debate about the nature of underlying reality and the role of observer effects in quantum measurements. The philosophical debate about quantum mechanics is ongoing and actively debated, with various schools of thought proposing different interpretations of the theory.”",
        "created_utc": 1678141383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any philosophies that argue we are both individuals and a collective consciousness?",
        "author": "SvetlanaButosky",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kfsds/any_philosophies_that_argue_we_are_both/",
        "text": "I mean, as with all social animals, we live both for ourselves as individuals and for the species as a collective, yes? \n\nNo animals on earth are more deeply connected to each other than humans, using our technology we have literally developed the largest collection of individuals, billions of humans living with and for each other, we are both individuals and a hive mind, just like cells in a body? Sometimes we may not agree with each other, groups will fight, just like defective or cancerous cells, but for the most part we function well as a whole, yes? \n\nWhat philosophies argue in this manner? That we have a responsibility not just to ourselves, but also to the collective whole and our common desires and goals? \n\nI think this is a powerful argument, especially as a counter argument against individualistic and pessimistic philosophies like Narcissism, Nihilism, Antinatalism, Pro mortalism, etc. \n\nOne for all and all for one.",
        "created_utc": 1678140575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Hobbes have any alternatives?",
        "author": "Geaston123",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kfcjk/did_hobbes_have_any_alternatives/",
        "text": "Hobbes claimed the State was a rational solution to the state of nature but can’t there be other solutions, especially if the post-contractual state no longer serves the fundamental obligation of protection against a British and nasty life? My specific question: isn’t it just as rational for an impoverished Russian, Salvadoran, Mexican, Kenyan etc. to seek an alternative structure outside of the state to thrive in if one presumes the state has failed in any basic obligation of security? Furthermore, is joining an international criminal gang and showing them loyalty any less rational than accepting citizenship? Wasn’t Hobbes just highlighting *one* option?  I live in Mexico and the state doesn’t do much for anyone and for most is simply burdensome. Shouldn’t it fail in any rational context and don’t say ‘vote them out’ because that is naivety at its grandest.",
        "created_utc": 1678139625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Introductory book on classic Existentialism?",
        "author": "drewtrue21",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kfbfu/introductory_book_on_classic_existentialism/",
        "text": "I'm currently reading Sokolowski's intro to phenomenology and then I will go with Husserl's Phenomenology. \n\nAfter that I'd like some introductory book for  Kierkegaard's and Nietzsche's Existentialism so that I move more gently to Heidegger's, Sartre's and Ponty's works.\n\nDo you have any suggestions?\n\nThanks in advance!",
        "created_utc": 1678139557,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the disagreement between Einstein and Henri Bergson about time/ duration concept?",
        "author": "philosphicalsuicide",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11kbk86/what_was_the_disagreement_between_einstein_and/",
        "text": "",
        "created_utc": 1678131631,
        "upvote_ratio": 1.0
    },
    {
        "title": "What really is the difference between the object relations and self psychology psychodynamic theories? Why would you theoretically want to use one over the other in practice?",
        "author": "amandapandabear",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k9x84/what_really_is_the_difference_between_the_object/",
        "text": "I feel like I keep getting stuck in differentiating these two because the idea of internalizations of external relations that object relations puts forth seems identical to the lack of self cohesion caused by external relations in self psychology, at least in how it might practically manifest. What actually sets internalization of relationships apart from self deficits that form from suboptimal caregiver relationships?",
        "created_utc": 1678128484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have a pdf of an English translation of On Cosmogonic Eros?",
        "author": "Just-Lock-1562",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k8if2/does_anyone_have_a_pdf_of_an_english_translation/",
        "text": "I found a paid copy but I’m in South Asia and won’t be able to buy it. Any help will be appreciated!",
        "created_utc": 1678126706,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the critiques about Gödel’s ontological argument (C. Anthony Anderson’s emendated version)? I have seen that there are several emendations/variations of Gödel’s argument. Which of those variations is the best one?",
        "author": "Specific-Air-4278",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k8856/what_are_the_critiques_about_gödels_ontological/",
        "text": "The argument is below. It avoids modal collapse (axiom 1, definition 1, definition 2 were the ones that Anderson changed). You could also check the document I made where I tried to make it easy to understand, [https://docs.google.com/document/d/1s0wFJyY1kEnOd0ZGbdPK6yvBNV1wyC40UmmOP4xQcg4/edit?usp=sharing](https://docs.google.com/document/d/1s0wFJyY1kEnOd0ZGbdPK6yvBNV1wyC40UmmOP4xQcg4/edit?usp=sharing)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nDefinition 1\n\n∀x \\[Gx ⇔ ∀φ (Pφ ⇔ □ φx)\\]\n\nA being x has the property of being God if and only if both of the following hold:\n\n– If a property φ is positive then in every possible world, x has φ\n\n(this is basically the same as “In every possible world, x has all the positive properties”).\n\n– If in every possible world x has a property φ, then φ is a positive property.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nDefinition 2\n\n∀x \\[φ *ess* x ⇔ ∀ψ (□ ψx ⇔ □ ∀y (φy ⇒ ψy))\\]\n\nA property φ is said to be the *essence* of x if and only if both of the following hold:\n\n– If in every possible world x has a property ψ then in every possible world it is *not* the case that someone has φ but not ψ.\n\n– If in every possible world it is *not* the case that someone has φ without ψ, then in every possible world\n\nx has ψ.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nDefinition 3\n\n∀x \\[Ex ⇔ ∀φ (φ *ess* x ⇒ □ ∃y φy)\\]\n\nA being x is said to be *necessarily existent* if and only if the following holds:\n\nIn every possible world there exists *at least one* thing that has the *essence* of x.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 1\n\n∀φ (Pφ ⇒ ¬P¬φ)\n\nIf a property φ is positive, then the negation of φ is not positive.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 2\n\n∀φ ∀ψ ((Pφ ∧ □ ∀x (φx ⇒ ψx)) ⇒ Pψ)\n\nIf (φ is a positive property and in every possible world whatever has property φ also has property ψ) then\n\nψ is also a positive property.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nTheorem 1 follows from A1 and A2.\n\n∀φ (Pφ ⇒ ◇ ∃x φx)\n\nIf φ is a positive property then there exists a possible world in which at least one thing has property φ.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 3\n\nP(G)\n\nThe property of being God is a positive one.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nTheorem 2 follows from A1, A2, and A3.\n\n◇ ∃x Gx\n\nThere exists a possible world in which there exists an x such that x has the property of being God.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 4\n\n∀φ (Pφ ⇒ □ Pφ)\n\nA positive property is positive in every possible world.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nTheorem 3 follows from A1, A2, A3, and A4.\n\n∀x (Gx ⇒ G *ess* x)\n\nIf a being x has the property of being God then the property of being God is the *essence* of x.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAxiom 5\n\nP(E)\n\nThe property of necessarily existing is a positive one.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nTheorem 4 follows from A1, A2, A3, A4, and A5 (the goal of the argument).\n\n□ ∃x Gx\n\nIn every possible world there exists an x such that x has the property of being God.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_",
        "created_utc": 1678126376,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Ship of Theseus: At what point does it become another ship?",
        "author": "Low-March6725",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k3a40/the_ship_of_theseus_at_what_point_does_it_become/",
        "text": "I was given a pen by a police officer after I complemented his pens. The pen was not threaded in fully and I had to send it to a fixer of pens in Maryland. (I was in Arizona at the time and no one gives a fuck about pens there.)\n\nThe pen returns to me and it is fixed: it is threaded in fully. So, now this pen has been on the shirt of a police officer, traveled to Maryland, and now I use it everyday. \n\nI come to find out that the pens are going for 10 bucks on Amazon and I can literally buy a pack of them for 10 bucks. This really fucks my mind up.  \n\nMy question is this at what point did my pen become another pen? I feel my pen is different from the pens on Amazon because they don’t have experiences tied to them. \n\nAre they the same pen? I personally feel they are not. What do you think?",
        "created_utc": 1678119681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that you can simulate any other logic using first order logic?",
        "author": "tekktokk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k2t5v/is_it_true_that_you_can_simulate_any_other_logic/",
        "text": "* [From philosophy stack exchange](https://philosophy.stackexchange.com/questions/79719/is-it-there-a-completely-expressive-formal-system-logic-language): \"Is it there a \"completely expressive\" formal system / logic language?\"\n\n&gt;There is no perfectly expressive logic. Every logic powerful enough to include arithmetic is incomplete. Moreover, each one of those logics can be augmented by additional axioms to be more complete than it was - to yield more true theorems than it had. This means that you can always make a logic more complete, so there is no most complete one.  \n&gt;  \n&gt;**However, there is good news. Within first-order logic, you can \"simulate\" the rules of second-order logic and every other logic too.** This is why ZFC (a first-order logic in which the objects are sets) can be considered a foundation for all of mathematics. What you do is define a proposition in second order logic as a particular kind of set in ZFC, and define second-order logic proofs also as particular sets in ZFC, according to rules for how to construct these sets. Then to ask whether a proposition in second-order logic has a proof, is the same question as whether a particular set exists in ZFC.\n\nand wanted to confirm if that's actually true. Does that mean you can simulate higher order logic using first order logic? Is anything lost by merely \"simulating\" HOL using FOL as opposed to... whatever the alternative would be; constructing it from scratch, I suppose.",
        "created_utc": 1678118636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there alternatives to the Münchhausen trilemma?",
        "author": "SportSportManMan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k1892/are_there_alternatives_to_the_münchhausen_trilemma/",
        "text": "Can a proof be completed with appealing to circular, regressive, or dogmatic arguments? \n\nAnd also: are any of the three options really that bad? What's wrong with baseless assumptions in proofs?",
        "created_utc": 1678115068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you heard anything about Text buddy before if you can be my text buddy I will be paying you $5000 weekly Allowance",
        "author": "Downtown-Ad2115",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k0btm/have_you_heard_anything_about_text_buddy_before/",
        "text": "",
        "created_utc": 1678112814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good sources to learn about the social construction of sex as a category of identity?",
        "author": "becomingemma",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k0a9m/good_sources_to_learn_about_the_social/",
        "text": "I’ve been reading Judith Butler’s Gender Trouble where they discuss Foucault, Wittig, and other feminists on the view that sex is often portrayed as a biological reality when in fact the identification of humans through their sexual organs primarily serves the interest of capitalist institutions like the family to ensure the continuity of labour and economic productivity. \n\nI was wondering where else I can read more about the discourse on sex as a social construction rather than objective biological reality. Any leads are appreciated!",
        "created_utc": 1678112706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Growing Block Universe Philosophy",
        "author": "No-Health3920",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11k09ay/growing_block_universe_philosophy/",
        "text": "If there is an objective **now** in Growing Block Universe what's exactly the difference between the past and now when they both are equally real? Is time travel possible in the growing block universe?  \nI can't find answers to my questions about Growing Block Universe anywhere.",
        "created_utc": 1678112636,
        "upvote_ratio": 1.0
    },
    {
        "title": "A great time for new insecurities",
        "author": "Similar-Gap-3168",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jzw32/a_great_time_for_new_insecurities/",
        "text": "A girl friend of mine texted me this a few days ago and i've been pondering over it since. Anyone could tell me what it might mean?",
        "created_utc": 1678111665,
        "upvote_ratio": 1.0
    },
    {
        "title": "/r/askphilosophy Open Discussion Thread | March 06, 2023",
        "author": "BernardJOrtcutt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jzpv4/raskphilosophy_open_discussion_thread_march_06/",
        "text": "Welcome to this week's Open Discussion Thread. This thread is a place for\nposts/comments which are related to philosophy but wouldn't necessarily meet our\n[posting rules](https://www.reddit.com/r/askphilosophy/wiki/rules). For example,\nthese threads are great places for:\n\n* Personal opinion questions, e.g. \"who is your favourite philosopher?\"\n\n* \"Test My Theory\" discussions and argument/paper editing\n\n* Discussion not necessarily related to any particular question, e.g. about what\n  you're currently reading\n\n* Questions about the profession\n\n\nThis thread is **not** a completely open discussion! Any posts not relating to\nphilosophy will be removed. Please keep comments related to philosophy, and\nexpect low-effort comments to be removed. All of our normal [commenting\nrules](https://www.reddit.com/r/askphilosophy/wiki/rules)\nare still in place for these threads.\n\nPrevious Open Discussion Threads can be found\n[here](https://www.reddit.com/r/askphilosophy/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AOpen%2BThread)\nor at the Wiki archive\n[here](https://www.reddit.com/r/askphilosophy/wiki/opendiscussionthread).",
        "created_utc": 1678111238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is morality about one's true \"correct\" belief, or is it a performance to appease other people and contribute to society?",
        "author": "Cynthia24689",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jz5x6/is_morality_about_ones_true_correct_belief_or_is/",
        "text": "Hi, new here and I don't know too much about philosophy but I had some experiences that make me question the definition of morality. Any ideas welcome and feel free to recommend me anything to read up on more :)\n\nGrowing up I believe myself to be a person with high moral standards (e.g.: I'm generally polite and donate/volunteer when I have the ability to). However 2 things happened to me recently.\n\nFirst: My grandma is quite sick, she is very close to me. I don't have the ability to help her much (she is not even in the same country as me) other than letting go of some of my own money (I'm a busy uni student and only work a little) to support her treatment. However I now feel guilty for enjoying my own life such as hanging out with friends and eating good food. If morality is about \"self\" I believe I'm acting unmoral by enjoying things, but if morality is about \"others/society\" I'm being moral since I can't do anything else and the best thing to do is to take care of myself and not bother my parent (btw I live alone).\n\nSecond: Among a new group of friends I just met, I was talking about this old friend of mine who is a gay man and is kind of camp. I said \"I wonder why many gay men have a similar valley girl accent\". Many got angry at me saying that's offensive and I shouldn't say that (for the record no one there is camp gay as far as I can tell so I don't think I'm directly making anyone uncomfortable). Also I'm female and gay but somewhat straight passes other than having stereotypical short blue hair. I made my comment with no ill intention, plus I joke about my own blue hair all the time. I tried to explain further but one of them told me to just shut up. I now felt really guilty as if I have done something wrong (making a potentially offensive comment) but in my heart I knew it wasn't out of hate. Am I being moral or not?\n\nI could have asked this question on AITA but don't feel like have that many people judging me lol. Plus I do want to discuss beyond these 2 experiences, I have been fairly conflicted on this topic for a while now (e.g.: I don't know if I should let my family know that I volunteer as I don't want to feel like I'm virtue signaling which will be immoral). Furthermore I believe in karma and higher forces and always try to live my life in the most moral way.",
        "created_utc": 1678109821,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did plato mean by this in the republics cave allegory?",
        "author": "__throwaway1616765",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jypf1/what_did_plato_mean_by_this_in_the_republics_cave/",
        "text": "“And is there anything surprising in one who passes from divine contemplations to the evil state of man, misbehaving himself in a ridiculous manner; if, while his eyes are blinking and before he has become accustomed to the surrounding darkness, he is compelled to fight in courts of law, or in other places, about the images or the shadows of images of justice, and is endeavouring to meet the conceptions of those who have never yet seen absolute justice?”",
        "created_utc": 1678108656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interpretation of Merleau Ponty's psychic blindness case study and vague theory of mental states implication in analogy",
        "author": "daniel-prime9",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jvzzm/interpretation_of_merleau_pontys_psychic/",
        "text": "So I'm reading the third chapter of Ponty's phenomenology of perception about bodily space and his psychic blindness case study of patient Schneider. And how I understand his psychic blindness is that he cannot 'perceive' (I use perceive here not in a visual sense but as sensory understanding of physical touch let's say) his body being touched without seeing the action or doing the touching himself. So perhaps another term would be an 'external tactile phenomenological blindness'. \n\nNow if this interpretation checks out, then I had a weird intuition/idea about some implication for mental states. I am entirely sure myself what I mean with this, but if a mental state such as an emotion is caused by perceiving some action or object in the world that causes a mental state (so let's say Schneider's body is being hurt without seeing the pain being inflicted which would normally give a normal person the mental state of being in pain, another example would be a verbal insult although I suppose this would never rely upon visual perceiving but instead auditory perception), would in analogy to this his mental state only be able to be affected through literally seeing it or experiencing it rather than an action being inflicted upon him that he cannot objectively situate himself in? Like I said I'm not entirely sure where I am going with this and what the implications of this would be, perhaps it simply means that the autonomy he would have over his mental states (like his body) would be more limited than another person, being more dependent upon his senses than merely perceiving it through his 'body'.",
        "created_utc": 1678101231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there an established term for the inappropriate use of deductive logic in real world situations?",
        "author": "ItWillBeALaugh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jvyp1/is_there_an_established_term_for_the/",
        "text": "The following is an example of the type of flawed reasoning I am referring to:\n\n* Sodium is a poisonous substance. \n* Chlorine is a poisonous substance. \n* Therefore, the substance produced by reacting sodium and chlorine will also be poisonous.\n\nThis is of course untrue, the reaction product of sodium and chlorine is table salt. I realise that the logical fallacy committed in this specific case is a hidden premise: The properties of a substance are similar to those of its reactants. However, I am wondering if there is an existing term for this general class of flawed reasoning. \n\nTo further explain what I am referring to, in the real world it is very rarely possible to start with a set of axioms and then use deduction to make predictions about real situations. As the \"axioms\" are typically only valid under certain conditions, have exceptions, or are simply wrong but sound \"obvious\". Instead we need to look for evidence to support our claims, such as testing them scientifically.\n\nHopefully this made sense, and thank you in advance to anyone who has any input.",
        "created_utc": 1678101119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study Guide for Judith Butler's \"Gender Trouble\"",
        "author": "Public_Weight839",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jvp0s/study_guide_for_judith_butlers_gender_trouble/",
        "text": "Is there any books/lectures concerning Judith Butler's book \"Gender Trouble\"? I am very new to philosophy and the only philosophical topic I have exposure to is Logic. I am a Compter Science student if that helps. Philosophy is very new to me and I find Judith Butler very hard somehow.",
        "created_utc": 1678100342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defending poststructuralism",
        "author": "VeritableFerrit",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11juq9r/defending_poststructuralism/",
        "text": "What kind of responses have there been to the Sokal affair and other 'exposés' of the use of scientific and mathematical concepts in the works of Deleuze and Guattari, Baudrillard etc. Richard Dawkins (bleugh) gives a fairly compelling breakdown in Postmodernism Disrobed.\n\nAfter flirting for a while with poststructuralism and having read enough to get past the initial incomprehension I am now a bit put off with going further.\n\nHappy to hear people agreeing that these author's approach to disciplines outside philosophy is disingenuous but I'd be more interested to hear from people who have tackled this and still use these authors with confidence.",
        "created_utc": 1678097215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Russell's concept of proper names and definite description: what about mathematical entities?",
        "author": "GroundbreakingOwl492",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jubfl/russells_concept_of_proper_names_and_definite/",
        "text": "Hi everyone,\n\nI have to write a paper on this topic and one of the things I have to write about is the relationship between language and mathematical entities. I really need to get this thing clear before I can even begin: does Russell say anything about the relationship between proper names/definite descriptions and mathematical functions( for example, addition )? Can proper names like \"addition\" be translated into a description for a specific mathematical function, or are these kinds of entities excluded from the dominion of proper names and description?  Thanks in advance",
        "created_utc": 1678095871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sense of self, inner monologue and intelligence",
        "author": "NKnown2000",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jtzhi/sense_of_self_inner_monologue_and_intelligence/",
        "text": "People around me have always considered me an intelligent person. I've always done extremely well in school without much work, I help my wife with her university studies even though our majors are completely different, and I usually have a good answer when asked about anything. However, I often feel downright stupid, like my inner self has problems producing the simplest of thoughts.\n\nI figured a person's thoughts could be divided into four layers, starting from the most external one:\n\n1. **Verbal communication:** I struggle to find words and express my thoughts coherently though spoken language. It might take me two minutes and several sentences to explain something that could be said in a single sentence. I'm mildly autistic, it may explain this partially.\n2. **Inner monologue:** While I do talk to myself inside my head, I often find it extremely difficult to even think verbally. Sometimes it feels like I struggle to produce a single sentence, even without speaking it out loud. \n3. **Nonverbal, conscious thinking:** Even without having to produce a verbal thought, it often feels like there's nothing but fog inside my head. There are periods in which I'm incapable of producing the simplest of thoughts. Sometimes this may only activate if I'm asked something, it makes me feel like a real life NPC.\n4. **Sense of self / ego**: This is the innermost part of what we are. It makes everyone the main character in their own lives. However, we can't feel anyone else's ego, we can't see anyone else as the main character. We can only assume they think somewhat like we do. We're all alone inside our heads, which makes it impossible to know whether someone's brain works better than mine, whether their thinking is more constant and efficient.\n\nIt feels like my brain has so much potential I'm unable to use. I feel more like ChatGPT when I can answer a question I'm asked but I'm unable to think in other situations. **How can I know if this is normal? What could I do to feel more human? How would I be capable of intelligent thought when I don't know whether I'm thinking at all?**",
        "created_utc": 1678094716,
        "upvote_ratio": 1.0
    }
]