[
    {
        "title": "Do you feel the same about death?",
        "author": "HVRRICAN3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jrrgs/do_you_feel_the_same_about_death/",
        "text": "I understand the motive that death is the state where you are the most peaceful. There are no more emotions or feeling. For example no more pain, suffering and emotions in general.\n\nMy problem is that I just can't cope with the thought of the complete abstinence of being and consciousness. \n\nDo you feel the same? How do you cope with that?",
        "created_utc": 1678087260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a philosphy based on a core belief I’ve lived by but don’t know where to start",
        "author": "atnoonweride",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jqpj5/looking_for_a_philosphy_based_on_a_core_belief/",
        "text": "I was raised on Christianity but as I got older I moved away from that belief as it didn’t feel right anymore. As an adult I’ve lived by \n-be the best version of yourself \n-be happy \n-as long as you’re not harming others \nand the belief that doing good for the sake of helping others without expecting a return or as a way to earn your “ticket”into heaven. \n\nIs there a philosophy or selection of philosophical stances that follow these guidelines?",
        "created_utc": 1678083985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can't philosophers extract their own premises in academic writing?",
        "author": "Koalaman_The_Great",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jps0p/why_cant_philosophers_extract_their_own_premises/",
        "text": "I'm new in this 'academic' sphere of philosophy but I've been interested for a while.  \nAcademic writing seems to always be the rambling-on of a person. Sometimes those ramblings are structured well or the idea is clearly explained, and those are amazing to read. Regardless, a lot of them would probably do fine with (at most) a page or two of dot-point premises, sub-conclusions and conclusions. We as readers have to do that anyway, and maybe I'm just lazy but honestly I feel like this way of writing would help us in many ways. It would allow us to figure out implicit assumptions, we could analyse each dot-point individually and expand upon it or classify it as \"statistically invalid\" or \"controvertial\" or whatever. Why don't we do that?\n\n(you might say because it is sometimes difficult to express your idea in dot points because they are very complex. Perhaps this would be a 'summary' version of the whole argument?)\n\nPut another way, we can think about 'meta-science' as asking the question 'how do we make sure the scientific method explores reality in the best way possible?'. Our conclusion has come with the hypethesis/literature review/method (independent var/dependent var/control)/discussion etc.\n\nWhat has been the advancement in the study of 'meta-philosophy'? How do we make sure that ideas of metaphysical/ethical/aesthetic etc. are explored in the best way possible by scholars?",
        "created_utc": 1678081189,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly distincts consequentialism and Kantian ethics?",
        "author": "twaraven1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jpa95/what_exactly_distincts_consequentialism_and/",
        "text": "Hello,\n\nI'm currently learning a lot about Kant (still a beginner) and a thought came to my mind:\n\nThe Categorical Imperative states that one should according to that maxime of which one could wish that it would be a universal law.\n\nThis is generally accompanied with an example along the lines of \"Stealing. If stealing was accepted as a universal accepted practice, society wouldn't function. Therefore one should not steal.\"\n\nIn this example the moral validity of an action is measured by its consequences on a large scale, but Kantian ethics is generally portrayed as opposed to consequentialism. Examples like this are fairly common. I have to add that not the immediate consequences of an action are taken into account, but rather on an abstract level (maybe this is the difference of consequentialism and Kantian ethics).\n\nSo my question is: What marks the clear distinction between Consequentialism and Kantian ethics / duty ethics? \n\nI hope this question isn't dumb :D\n\nThank you. Cheers.",
        "created_utc": 1678079682,
        "upvote_ratio": 1.0
    },
    {
        "title": "this sub is ran by elitist cucks 🤡 y’all can suck a fat one",
        "author": "seas2699",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jnjyy/this_sub_is_ran_by_elitist_cucks_yall_can_suck_a/",
        "text": "",
        "created_utc": 1678074747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Kant: People as ends in themselves?",
        "author": "twaraven1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jnjuy/question_about_kant_people_as_ends_in_themselves/",
        "text": "Hello,\n\nin a thread on r/philosophy someone mentioned that according to Kant one should not treat people as 'merely ends in themselves', but as 'ends in themselves'. If this is a distinction made by Kant, what does it mean?\n\nThat being said I maybe should mention that English is not my native language, and even though know the 'nominal' meaning of merely, i might not catch on on the vibe it wants to bring across.\n\nCheers.",
        "created_utc": 1678074738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me come up with a counter argument for my philosophy paper?",
        "author": "merciiofpatience",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jnavm/help_me_come_up_with_a_counter_argument_for_my/",
        "text": "My paper is reviewing Peter Singer's famine affluence and morality 1972. Im not gonna summerize it but if someone eally wants to help im happy to DM. \nMy argument is he contradicts himself throughout by arguing for moral obligations that he himself says do not map onto practical realities. My reasoning is as follows\n\nSinger says the best outcome wouldn't be achieved from everyone doing what they really ought do, which i understand to mean give everything they possible can until the point of equal moral significance. He is saying practically that would create an overabundance, but one is still morally obligated to do it, which I find contradictory. \n\nSinger is saying that other people's contributions to relieve suffering is a relevant factor to the circumstances of the suffering, and can change how much you are obligated to contribute in order to achieve relief. Singer then says that how many other people are in the position as you in regarding the suffering has no baring on one's moral obligation, and it would be better if people contributed while being unaware of others contributions, which seems to be contradict him saying that the contributions of others is practically relevant.",
        "created_utc": 1678074035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any philosophers working with quantum physicists?",
        "author": "ElliElephant",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jlq20/are_there_any_philosophers_working_with_quantum/",
        "text": "Occasionally I get lost in thought about both these topics, and today my thoughts have taken me here:\n\nTwo of the greatest mysteries in each field\n\n**What is consciousness?**\n\n**What causes wave function collapse?**  \n\n…answer each other quite elegantly \n\nSo a hypothesis:\n\n_Consciousness is the ability to collapse wave functions. In other words, that which is conscious is that which can observe_\n\nIs there any cross-discipline research ongoing into questions like this? \n\nThanks",
        "created_utc": 1678069725,
        "upvote_ratio": 1.0
    },
    {
        "title": "It seems given enough time and brain power you can rationalize any political belief. If that’s the case how do you know what beliefs are right or true?",
        "author": "Gloomy-Pineapple1729",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jlk8a/it_seems_given_enough_time_and_brain_power_you/",
        "text": "It seems that there are people all over the intelligence spectrum from low IQ to geniuses that can be conservative or liberal. Atheist or religious. Pro-capitalist vs pro-communist and so on. \n\n I probably identify as liberal. But when I watch people like Jordan Peterson and Milton Friedman present their arguments for conservative beliefs it can make a lot of sense.  \n\nFor example I just watched a YouTube interview of Milton Friedman giving an explanation why minimum wage / equal pay for equal work is actually an anti-black and anti-feminist law. \n\nIt takes away Black Americans advantage of being able to work for lower wages in exchange for Experience. So that they can eventually reach the point of having enough experience where they can now apply to jobs and earn a higher wage. \n\nSo the black Americans who are already disadvantaged because of poor education via government schooling end up unemployed not gaining experience or knowledge and therefore only compounding their disadvantages in life.\n\nAnd then for a woman trying to have a career that men naturally have an advantage in (firefighting) you take away their only competitive advantage of being able to offer their services for a lower wage. Which leads to the profession being completely male dominated. \n\nOfc maybe given enough time and reasoning you can come up with arguments why Jordan Peterson or Milton Friedman are wrong or vice versa. And you can have a back and forth potentially forever on a single political point. \n\nTherefore how does one know their political beliefs / ideologies are right? Does that make pretty much all ideologies pretty much meaningless? Because you can infinitely argue for almost any ideology and make it sound or reasonable given enough time?",
        "created_utc": 1678069290,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best ways to engage in critical thinking? And how can I improve them?",
        "author": "Secret-Package-5147",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jl7we/what_are_the_best_ways_to_engage_in_critical/",
        "text": "I hope everyone reading this is doing well!\nOver the last couple of weeks I’ve been trying to improve my critical thinking and the way in which I go about it.\n\nAnd I was curious to see if anyone had any methods or pathways to better sharpen this skill. \n\nI understand this skill doesn’t go from zero to hero instantly. But there must be something I can begin to implement in order to improve it over a period of time, even if that means decades ahaha\n\n\nI appreciate anyone’s thoughts on this matter! \n\nThanks so much :)",
        "created_utc": 1678068405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kierkegaard question",
        "author": "11Earth99",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jkodv/kierkegaard_question/",
        "text": "Can somebody please help me understand what Kierkegaard meant when discussing the “teleological suspension of the ethical?”",
        "created_utc": 1678066987,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the arguments for materialism and physicalism?",
        "author": "Beh1ndTheScenes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jjkkc/what_are_the_arguments_for_materialism_and/",
        "text": "Materialism and physicalism \"reduce\" everything to matter. To them, everything that exists, is material. Nothing is over and above the physical \n\nI'd be interested in philosophical articles and books that defend and offer evidence of such an anti-spiritual doctrine. Are there any?",
        "created_utc": 1678064086,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are good arguments fo mereological nihilism?",
        "author": "Beneficial_Exam_1634",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jidia/what_are_good_arguments_fo_mereological_nihilism/",
        "text": "Preferably ones that address Bradley Rettler's \"Puzzles about Material Objects\".",
        "created_utc": 1678061009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Locke",
        "author": "wwdforfun",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ji7jl/locke/",
        "text": "In this paragraph, when Locke says the \"common stock of mankind\", is he trying to say that farming and agriculture benefits not just the person whose property it is, but everyone (compared to unfarmed land)? \n\n&gt; To which let me add, that he who appropriates land to himself by his labour, does not lessen, but increase the common stock of mankind: for the provisions serving to the support of human life, produced by one acre of enclosed and cultivated land, are (to speak much within compass) ten times more than those which are yielded by an acre of land of an equal richness lying waste in common. \n\nIf so, what role does the claim play in his larger argument.. I don't really understand",
        "created_utc": 1678060604,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an argument against moral nihilism?",
        "author": "QuestioningNihilist",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jgosu/what_is_an_argument_against_moral_nihilism/",
        "text": "[removed]",
        "created_utc": 1678056951,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Nietzsche mean by \"All idealism is falseness in the face of necessity\" in his famous Amor Fati passage in Ecce Homo?",
        "author": "Educational-Ad6936",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jglhj/what_does_nietzsche_mean_by_all_idealism_is/",
        "text": "Note that I'm not asking about the idea of amor fati itself. Rather, my question pertains to what precisely does Nietzsche mean by the word *idealism* in this passage (e.g. is it used colloquially, or is he referring to transcendental idealism), and in what sense can it be called false in light of the metaphysical necessitarianism / determinism Nietzsche seems to endorse?\n\nThank you :)",
        "created_utc": 1678056732,
        "upvote_ratio": 1.0
    },
    {
        "title": "philosophical theory that addresses the idea that nothing matters if it's not causing harm?",
        "author": "girlhelpimdying",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jbpek/philosophical_theory_that_addresses_the_idea_that/",
        "text": "I've structed my life on a 'live and let live' principal, and tend not to care about anything unless it's causing active harm. Basically subscribing to the idea that it's none of my business unless it affects my life, and if it DOES affect my life, my personal opinion on it does not matter if it's making someone else happy and not causing me harm. \n\nIs there a name for this?",
        "created_utc": 1678047299,
        "upvote_ratio": 1.0
    },
    {
        "title": "More recent work like Singer's Rethinking Life and Death?",
        "author": "HoraceKirkman",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11jau9r/more_recent_work_like_singers_rethinking_life_and/",
        "text": "I have used Peter Singer's [Rethinking Life and Death](https://www.amazon.com/Rethinking-Life-Death-Collapse-Traditional/dp/0312144016/) many times, but it's getting a bit long in the tooth (mid 90s) so I'd like a more modern equivalent (as he doesn't seem to be planning a new edition).  I mean like it in two respects: content, as in, discussing end-and-beginning-of-life issues in bioethics broadly, and in the incredibly accessible writing style - suitable for an intro class.\n\nSuggestions?",
        "created_utc": 1678046350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psychiatry, philosophy and logic",
        "author": "LaoShanLung",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j9qb0/psychiatry_philosophy_and_logic/",
        "text": "I'm a 24 years old brazilian medicine student aspiring to become a psychiatrist. I was mesmerized when I discovered that Karl Jaspers was able to use Husserl's Phenomenology as philosophical basis for his psychopathology.\n\nNowadays most of medical research is focused on graphics, statistics and so on. Even though I understand the usefulness of this way of approaching subjects, I'd like to deepen my knowledge on philosophy and logic aswell.\n\nThat's why I'm here: I'd like to know if there are any authors whose studies could be of interest for an aspiring psychiatrist in order to expand our understanding and treatment of mental illness.\n\nThank you in advance!",
        "created_utc": 1678045124,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you respond to the Nihilists?",
        "author": "monkeyrpinter",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j9k95/how_do_you_respond_to_the_nihilists/",
        "text": "I am a little tired of the stoic/nihilism themes, and I'm looking forward to learning something of contrast- and possibly more feel-goody.\n\nAny arguments against the nihilists? Any good reads that are not as depressing? What thinkers did you get that exposure from?",
        "created_utc": 1678044936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creation",
        "author": "rojodeso",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j87bm/creation/",
        "text": "What certainty is there of not creating the world through self-awareness?",
        "created_utc": 1678043488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a unique internal dimension for every human?",
        "author": "Drakkun99",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j7w4f/is_there_a_unique_internal_dimension_for_every/",
        "text": "Does everyone relate to the world from its internal dimension (from which one interpret the outside world and which is also composed by sensations and feelings)? Are these internal dimensions unique to each human being although being sometimes similar? Could there be a “more valid” internal dimension to the others?",
        "created_utc": 1678043119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Nietzsche ever write about Gaia?",
        "author": "Sanito03",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j3t7p/did_nietzsche_ever_write_about_gaia/",
        "text": "I know that he believed dionysian pantheism to be a solution for pain and death but I haven't read a lot of Nietzsche so I don't know how it differs from Gaia and other pantheist ideas but I am interested in hearing what he would've thought about her. I know that he was into the greeks so he must've talked about it at some point since it's a different perspective of religion than what he usually is known for.\n\nDisclaimer: I'm not really a philosopher I'm just interested in the ideas and I'm also very hungover right now so excuse me if this post isn't very detailed with a very clear and concise point.",
        "created_utc": 1678037429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Metaphysical Experience Possible? Discussion Article",
        "author": "Otarih",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j3ah7/is_metaphysical_experience_possible_discussion/",
        "text": "[https://absolutenegation.wordpress.com/2023/03/05/is-metaphysical-experience-possible/](https://absolutenegation.wordpress.com/2023/03/05/is-metaphysical-experience-possible/)",
        "created_utc": 1678036856,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone be both moral objectivist and utalitarianist?",
        "author": "Imhere129",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j37k4/can_someone_be_both_moral_objectivist_and/",
        "text": "",
        "created_utc": 1678036768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there use in being good?",
        "author": "Archi_violencia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11j1y7z/is_there_use_in_being_good/",
        "text": "I've been recently fearing being good may be a \"stupid\" thing to do. If you're smart and evil you'll probably live a lot better in more effortless ways. Cheating and lying to your friends to use them, robbing people instead of working for hours, being a corrupt politician with millions of dollars, etc. There have been many evil people who have succeeded in life and they would've probably succeeded a lot less trying to be good. I fear that in the field of philosophy someone may have written something extremely long/deep about all of this that would convince me of empathy being completely useless, use my friends and become a complete psychopath.\n\nI know that if good is a utilitarian thing for me, that probably means I'm not a good person.",
        "created_utc": 1678035323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this bad philosophy or bad thinking generally?",
        "author": "-_ABP_-",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11izdli/is_this_bad_philosophy_or_bad_thinking_generally/",
        "text": "Literally at least, for the terms it calls itself by?\n\nhttps://web.archive.org/web/20211208192622/https://philosophyworks.org/home/",
        "created_utc": 1678029176,
        "upvote_ratio": 1.0
    },
    {
        "title": "The concept of Tradition",
        "author": "KingsAndWitches",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iy4nn/the_concept_of_tradition/",
        "text": "Hello there,\nI would like to know if there are any authors that discusses the concept of tradition, or traditional values, in a broader sense. Any information would be of great help.\n\nThank you all for your time.",
        "created_utc": 1678025671,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do people know what is and isn't conscious?",
        "author": "Probable_Foreigner",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iwvzd/how_do_people_know_what_is_and_isnt_conscious/",
        "text": "Hi everyone,\n\nIt seems to me that people are unreasonably certain about what things are conscious, given how little we know about what causes this phenomenon. This has come up in recent discussions about AI, where it seems most people are absolutely certain that AI isn't conscious, yet people will also state that they are certain that animals are conscious, all without knowing what causes consciousness.\n\nMy view on this is: we don't really know what causes consciousness to exist, but I know that my brain has the mechanisms necessary to make consciousness, since I am conscious. It's also pretty certain that other humans have this mechanism in their brain, so I'm pretty sure they are conscious too. \n\nAs for everything else, I don't think we can determine that with any degree of certainty. For example, are cats conscious? I don't think we can actually know this, and I don't mean that in the kind of \"radical skeptic\" way. There are parts of the human brain which are unique to us, and it's not unlikely that these parts of the brain are what give us consciousness. If that were true, then cats may not be conscious at all. Therefore, it is not unlikely that cats do not have any consciousness. The same argument can apply to any animal, or even an AI. With that in mind, how do people seem to know what is and isn't conscious, despite not knowing the root cause of the phenomenon?",
        "created_utc": 1678022116,
        "upvote_ratio": 1.0
    },
    {
        "title": "games and philosophy: sources on emergent properties out of conflating rulesystems",
        "author": "andthisisthewell",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ivl68/games_and_philosophy_sources_on_emergent/",
        "text": " \n\nI hope this is the right sub to post this!\n\nSince  the beginning of this year I have been writing short stories, generated  by playing solo rpgs. I've posted two stories now, one short part every  week. in between these stories I write posts about learning to play  solo rpgs and learning to write short stories.\n\nIn  this weeks post I look at the interplay of different rulesets in  writintg these stories. On one hand, there a the rules of the game,  which in solo rpgs consist of surprising yourself in the world you  design for yourself by rolling on random tables or consulting oracles.  You have an idea, and you change that idea mechanically. On the other  hand, there are heuristics which work in writing: show don't tell,  arrive late leave early, etc. There two 'rulesets influence eachother in  interesting ways.\n\n[Here](https://teigills.substack.com/p/philosophizing-with-the-hammer-playing?sd=pf)  is the post. My question is: do you perhaps know of other sources in  game design, writing or philosophical texts that are about the emergence  of new rules by different rulesets?",
        "created_utc": 1678018014,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the objections to the claim that God exists because someone must have started and created everything?",
        "author": "matchateatimes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iubos/what_are_the_objections_to_the_claim_that_god/",
        "text": "Or more specifically, I'm looking for possible arguments against Article 3 of Thomas Aquinas' The Summa Theologica which basically states that God must exist because everything couldn't have been created or caused from nothing.",
        "created_utc": 1678013639,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is murder wrong but abortion isn't?",
        "author": "edoerxd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11islmp/why_is_murder_wrong_but_abortion_isnt/",
        "text": "It's pretty much what the title says, im not pro-life, I just want to know what philosphy has to say on this",
        "created_utc": 1678007592,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best arguments for or against the meaning of \"truth\" according to pragmatism?",
        "author": "yoshi888888888",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iqimv/what_are_the_best_arguments_for_or_against_the/",
        "text": "I refer to the proposal that truth is defined in terms of utility.",
        "created_utc": 1678000249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a universe full of nothing just a mathematical point?",
        "author": "afewquestion",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iourg/is_a_universe_full_of_nothing_just_a_mathematical/",
        "text": "Since a universe isn't a container, it is just everything that is - a universe full of nothing just becomes a mathematical point, or an idea, and thus a universe full of nothing cannot exist right?",
        "created_utc": 1677994737,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes a good ethical argument?",
        "author": "Apiperofhades",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iolo6/what_makes_a_good_ethical_argument/",
        "text": "I'm curious here. Recently I listened to an audiobook of alasdair macintyre's \"after reason\". I liked it. Near end there's a section where he talks about \"consistency\", and he says some are willing to go out on a limp to be consistent with their own theories. I felt a little confused by this. What exactly is considered a good ethical argument? Is that all there is to making an argument? What about theories like John Finnis? I've read his arguments are consistent but they're still considered weak.",
        "created_utc": 1677993959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why was Heidegger so against metaphysics?",
        "author": "Largest_Half",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11io1c7/why_was_heidegger_so_against_metaphysics/",
        "text": "Currently trying to understand Heidegger better - what exactly is Heidegger's argument against metaphysics and why was he so against metaphysics? or, if my assertion here is incorrect - please enlighten me!",
        "created_utc": 1677992235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critique of Nagel's \"What is it like to be a bat?\"",
        "author": "Quiet_Musician6712",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11intev/critique_of_nagels_what_is_it_like_to_be_a_bat/",
        "text": "One of the fundamental aspects of his argument is that the subjective experience of consciousness can not be formed without having physically experienced that thing, such as the taste of a salty apple. However, one way I would be interested in critiquing him is that he fails to take into account that physical experience is not the only way to give rise to subjective experience. Someone, who hasn't tasted a salty apple, but has previously tasted an apple and also has tasted salt, can imagine what the salty apple might taste like based on his past experiences and thus give rise to a subjective experience. I got this idea from a paper by David Lewis titled \"What experience teaches us.\"\n\n&amp;#x200B;\n\n I'm interested in hearing your thoughts, is this criticism valid given that the person is only imagining the taste? I still think it does because it shows that physical experience isn't the only way to give rise to subjective experience.",
        "created_utc": 1677991556,
        "upvote_ratio": 1.0
    },
    {
        "title": "In general, do our judgements of what's good and what's bad result from what is and isn't useful to the perpetuation of the species?",
        "author": "Archi_violencia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11imgma/in_general_do_our_judgements_of_whats_good_and/",
        "text": "",
        "created_utc": 1677987585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Greatest Problem for Men",
        "author": "NoahsArkJP",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11im8tb/greatest_problem_for_men/",
        "text": "Recently I wanted to research the question of what is the greatest problem standing in the way of man's happiness: is it other people, is it ourselves standing in our own way, or is it natural forces like sickness, natural disasters, etc.? This seems like a very important problem, yet I don't remember reading any articles or seeing any books on it. I'd appreciate any thoughts and recommended reading. \n\nThanks!",
        "created_utc": 1677986968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phenomenology Historical Anthology",
        "author": "AlaisDahen",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11im1qa/phenomenology_historical_anthology/",
        "text": "Are there any decent anthologies of phenomenology? We didn't really touch on that topic too much while I was getting my degree. We focused more on metaphysics (primarily Aristotelian and Thomistic) and how the other fields of philosophy such as anthropology, ethics, and politics are built off of those metaphysical systems/ premises. Thanks guys!",
        "created_utc": 1677986402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yall what's a good podcast that's not too overwhelming because I'll open it in the background while drawing",
        "author": "Denizpow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11im1kk/yall_whats_a_good_podcast_thats_not_too/",
        "text": "Obviously about philosophy and different philosophers. I dont read much so I wanna learn a bit as well but I wouldn't be able to follow a lecture kinda thing while drawing. Idk just write your favourite philosophy podcasts i dont care",
        "created_utc": 1677986390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any criticisms of Lyotard's Postmodern Condition?",
        "author": "ReluctantAltAccount",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iluqv/are_there_any_criticisms_of_lyotards_postmodern/",
        "text": "[https://rationalwiki.org/wiki/Jean-Fran%C3%A7ois\\_Lyotard#:\\~:text=Essentially%2C%20Lyotard%20breaks,is%20entirely%20baseless](https://rationalwiki.org/wiki/Jean-Fran%C3%A7ois_Lyotard#:~:text=Essentially%2C%20Lyotard%20breaks,is%20entirely%20baseless).\n\nSpecifically, any that criticize him for calling a belief in science baseless because people follow a metanarrative?",
        "created_utc": 1677985846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does Andrew Tate fall on the philosophical spectrum?",
        "author": "Low-March6725",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ilsr0/where_does_andrew_tate_fall_on_the_philosophical/",
        "text": "What is he advocating for man to be?",
        "created_utc": 1677985696,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did ancient philosophers think about reading fiction? Did they think it was a waste of time?",
        "author": "SomeWinter3568",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ih43h/what_did_ancient_philosophers_think_about_reading/",
        "text": "",
        "created_utc": 1677973272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-consequentialist arguments against eating animals",
        "author": "Per_Sona_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ifvbi/nonconsequentialist_arguments_against_eating/",
        "text": "Hello\n\nI am familiar with [consequestialist](https://magnusvinding.com/2020/10/03/underappreciated-consequentialist-reasons/), [political theory](https://www.willkymlicka.ca/publications/books/zoopolis) and some religious arguments against eating animals, especially meat. However, I was wondering what are some of the best non-consequentialist arguments/views against the eating of animal/ flesh.",
        "created_utc": 1677970231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lemmon's Style/Deductive Logic Help",
        "author": "Hyperninja76",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ifk5i/lemmons_styledeductive_logic_help/",
        "text": "I've got into deductive logic recently to see if I like it and I've been reading 'Lemmon style'. I get the general idea of the derivation rules that are used but there are some problems I can't seem to figure out.  \"P ∨ Q, -Q ⊢ P\" would be one of them. First of all, when I look at this problem how would I use -Q? Would there even be a point to using -Q in this problem? I guess it could be used to discharge one of my assumptions but again I'm not really sure how to get there in the first place because I've tried a bunch of different ways and just can't seem to make sense of it.",
        "created_utc": 1677969474,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the view on \"A History of Philosophy\" by Johann Eduard Erdmann among philosophers? Is it still relevant?",
        "author": "flamboyr",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ietp3/what_is_the_view_on_a_history_of_philosophy_by/",
        "text": "",
        "created_utc": 1677967710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problems with Growing Block Universe theory",
        "author": "No-Health3920",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ie1k1/problems_with_growing_block_universe_theory/",
        "text": "Growing Block Universe theory says the past and the present are real but the future doesn't exist yet. If that's the thing, how do we know if we live in the present when the past and present are equally real? The only explaination I can imagine about this theory is that the past is \"no longer active/alive\" but in this sense I don't really know what makes the past \"dead\" or \"unactive\"",
        "created_utc": 1677965852,
        "upvote_ratio": 1.0
    },
    {
        "title": "The importance of self-prediction?",
        "author": "goldenapple212",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ibp52/the_importance_of_selfprediction/",
        "text": "Have any philosophers written about the importance of the ability to predict one's actions, thoughts, or feelings, either in relation to morality or to anything else?",
        "created_utc": 1677960352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the concept of free will an 'illusion'?",
        "author": "EchoingSimplicity",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ibmk6/is_the_concept_of_free_will_an_illusion/",
        "text": "Because when I ask myself what exactly I *thought* free will was, I find that I can't even put it into words. That's quite interesting. Normally when something is disproven, you can still behold and contemplate what it was, but with this, I can't even form the concept in my head properly.\n\nThe closest I can come to is this quote: \"Man can do what he wills, but man cannot will what he wills.\" And that second part, 'cannot will what he wills', seems to touch upon what I thought free will was.\n\nBecause it isn't the ability to decide to decide. When I still \"believed\" in free will, I thought there was a higher level of choice that went even beyond the limits of one's circumstances.\n\nFor example, if someone struggled with procrastination, I thought in some way they were 'choosing' procrastination and that they just had to summon enough 'will' to overcome it, and that it was a moral failing on their part if they couldn't. It was that if you didn't have enough willpower you just had to 'will' that willpower.\n\nAnd I thought that because everyone talked *as if* it were true. \"Stop being lazy,\" or \"Pull yourself up by your bootstraps,\" and \"Just do it.\" \"How do I just do it?\" \"What do you mean 'how', just do it!\"\n\nAnd so I thought that if I failed to 'just do it', it must be because somehow, on some level I couldn't describe, I was *choosing* to not 'just do it'.\n\nIt was only until I realized free will doesn't exist, that I started to question how this thought could even make sense. I started to think of myself as an animal that is pushed and influenced by my environment, rather than an independent soul, whose more merit is determined by the capacity to resist external influence.\n\nNo I *am* the external influence, it *makes* me. What I considered to be my 'will' is just one part of a feedback loop. And now this belief is so utterly well understood that I struggle to even recall what it was that I previously believed in. I mean, how would you even define 'that' thing? How could will or decision exist independently of influence? That would just be pure randomness, and randomness isn't a choice. But yet everyone seems to believe what I used to believe.\n\nIt seems ludicrous that the majority of the human race intuitively believes in a concept so flimsy that it literally evaporates when you try to define it. And why is that? If it's an illusion, what makes it so? Is there a name for phenomena like this, where it can only be understood when you don't think about it too hard (squinting your eyes, so to speak)?",
        "created_utc": 1677960192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we not morally responsible for our choices?",
        "author": "MisturFigure",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ibb7h/are_we_not_morally_responsible_for_our_choices/",
        "text": "I was in a conversation with a Redditor and lost track of the conversation (can’t figure out which profile it was under.) But the basic premise was that because we are only the product of our past which is a product of things that happened to us, we don’t have free will and are therefore unable to make any free choices so we are ultimately not responsible for our choices and actions. I think there’s a Latin term for this stance. \n\nI basically agree that free will doesn’t exist and is an illusion and that there is no independent “self” or “me” who is standing apart from the universe and able to make decisions with any degree of freedom from cause. — The issue I have with the stance is the term “responsibility”. Even if we agree that no one has free will, that doesn’t mean their body shouldn’t be punished for actions that harm others. \n\nEven aside from punishment, the person I was discussing this with took the position that we shouldn’t feel guilt, shame, remorse or regret for anything since we aren’t ultimately responsible for our choices. That sounds nice in that we have a way to avoid those bad feelings, but if we accept this position, then we also shouldn’t feel happy, grateful or content for any choices we make since we can’t take credit for anything we do. Am I wrong here? — I have a follow-on question for this, but I’d like to hear anyone’s thoughts on this.",
        "created_utc": 1677959475,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Hell is empty and all the devils are here\" what do u think of that quote",
        "author": "Pontiaccouldnthink",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ib95i/hell_is_empty_and_all_the_devils_are_here_what_do/",
        "text": "",
        "created_utc": 1677959343,
        "upvote_ratio": 1.0
    },
    {
        "title": "There aren't any sense organs, just a brain, so isn't the 'brain-in-a-vat' thought experiment pointless?",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ib268/there_arent_any_sense_organs_just_a_brain_so_isnt/",
        "text": "Where does the brain get its information from if not from the sense organs - eyes, ears, nose, tongue, skin? *Well*, one could say that the scientist gives the brain information through electrodes and wires - connected to a computer - that go through the brain; information in the form of electric signals.**However**, we need the raw data - the environment, external world - firstly to then translate this data into elec. signals. In the experiment there aren't raw sense data but signls from the beginning: is this possible and realistic?: if not then... title.",
        "created_utc": 1677958903,
        "upvote_ratio": 0.99
    },
    {
        "title": "Has anybody read Giacomo Leopardi? Opinions?",
        "author": "SirOlimusDesferalPAX",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iay82/has_anybody_read_giacomo_leopardi_opinions/",
        "text": "&gt; Crime, too, is often a form of heroism, that is, for example, when committing a crime leads to loss or danger, and yet you still want to carry it out in order to satisfy a given passion, etc., and the more heroic, the more need there is to overcome all the power of protesting nature and of habit (if we are talking, e.g., about a young person, an innocent, etc.), etc. And so it is a form of heroism when, even if no loss or danger is involved, it is carried out by someone who is not accustomed to committing a crime, since it always comes at the cost of an effort and a victory over himself, which is what heroism consists in. From a crime of this kind, therefore, one can always infer something good or at any rate rather remarkable about a person.",
        "created_utc": 1677958647,
        "upvote_ratio": 1.0
    },
    {
        "title": "How valid is the critique on Kant that his moral reasoning gave birth to Hitler, Stalin etc.?",
        "author": "twaraven1",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11iaxoi/how_valid_is_the_critique_on_kant_that_his_moral/",
        "text": "Hello,\n\ni've heard repeatedly, especially from the Ayn Rand sphere of things, that Kants moral philosophy was some kind of precursor of totalitarianism.\n\nHowever, according to my understanding Kant views man as \"ends in themselves\" in a way that it doesn't make sense for me to argue for an ethics where man is redjced to a mean to an end from Kant's point of view.\n\nSo where does this criticism come from?\n\nUnfortunately i'm just starting out with Kant and don't find a lot of resources on this particular question.\n\nCheers.",
        "created_utc": 1677958613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone recommend me some modern philosophers that wrote about the punk(or any alternative) movement in the 20th and 21st century??",
        "author": "stakleno_zvono",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i9x3g/can_someone_recommend_me_some_modern_philosophers/",
        "text": "",
        "created_utc": 1677956247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Morality: now and in the past &amp; some degree of introspection",
        "author": "SirOlimusDesferalPAX",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i9d72/morality_now_and_in_the_past_some_degree_of/",
        "text": "I ask this as a nihilist. I do not hold my view in an absolute form, but rather in a pragmatist manner. If one feels empathy, does this mean that one lacks the capacity to discipline oneself from this impulse? The older I get, the greater is the control of the prefrontal cortex of my behavior: effectively, it loses its spontaneity. I am effectively incapable of spontaneously believing anything. Years of reflection have led me to recognize that I do not possess free will, and as I proceeded with this materialistic interpretation of my own subjective experience, certain things became untenable. A recent disillusionment was other people: if I interact with someone, I am incapable of differentiating whether this act itself is pleasurable (as it was before), or if the knowledge thus obtained is simply deemed useful and thus acquired. I don't know whether it's a positive development or not. However, if I'm becoming increasingly evil, then what exactly is wrong with evil? \n\nThat I was gifted was already obvious when I was 7. Eventually, it was possible for me to skip classes, but my father refused to allow this over fear that I'd become asocial. The effect? I rebelled and stopped caring about school (becoming significantly more asocial than I would have otherwise), having never studied for it since, and acquiring great results anyway, such as 9th place nationally in a competition. In 2021 I was diagnosed with dyslexic dysgraphia, and it also happened to mention that my IQ is 3 standard deviations above average. I do not possess any other disorders. I was told at a young age that I'm a direct descendant of Nogai Khan. I used to think that this is my historian uncle's cope, but let me quote from the founder of psychology, Henry James:\n\n&gt;Thus, when a superior intellect and a psychopathic temperament coalesce...in the same individual, we have the best possible conditions for the kind of effective genius that gets into the biographical dictionaries. Such men do not remain mere critics and understanders with their intellect. Their ideas posses them, they inflict them, for better or worse, upon their companions or their age.”\n\nI can't possibly ignore the continuous evidence for possessing the blood of a person who created the greatest land empire in human history and murdered 40 million while at it. I have become a consistently profitable daytrader with ease and look like a fashion model, my brother's appearance is likewise above-average and his IQ is 2SD above average thus outperforming his peer with ease, whereas my father possesses perfect pitch and possesses extremely good memory regradless of many of his shitty decisions. If Nokhai's name was borne by a country to honor him, what's wrong with me following in his footsteps and engaging in whatever evil actions that he has?",
        "created_utc": 1677954939,
        "upvote_ratio": 1.0
    },
    {
        "title": "To which philosophers are the ideas of these following characters closer?",
        "author": "StephOMacRules",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i7nyw/to_which_philosophers_are_the_ideas_of_these/",
        "text": "For the following views expressed by several fictional characters, which philosopher's ideas are they embracing? \n\nSaga in a nutshell: \"I don't trust the person in charge to protect us for I believe she is not strong enough to defend us from outside threats therefore I will seize power by force from her to prove my point as I feel I'm the one who is more able to protect you all.\" Context is a theocracy with the character wanting to go against the goddess in charge of the community and turn it into his autocracy.\n\nDeathmask: \"The definitions of Right and Wrong are not very clear since they change with the times. It's obvious if you look back on the History of Mankind. Those who are considered evil shall be looked upon as justs if they claim victory in the end. When the Justs are defeated they automatically become Evil. Do you understand? Even if the current Pope (our current ruler) is considered Evil, he will become what is considered Just soon enough.\"\n\nDohko (in response to Deathmask): \"It is impossible for Evil to become Just. The History of Mankind that you spoke of is the greatest proof of that. Many Empires have tried but no matter how powerful or massive their armies were, they have always met with ruins and long been forgotten. That is the fate of all those that let themselves be corrupted by power. Evil cannot be anything other than Evil. True Justice is eternal and no amount of time will change that, like the great flow of these waterfalls, no man can change the fundamentals of Nature.\"\n\nShaka: \"I stand among the ranks of Athena's most honorable knights. We all have the duty to fight and uphold Justice and we should never fight on behalf of Evil. The only truth in this universe is that nothing is certain. Pure Evil, nor pure Righteousness, actually exists here. No matter who stands before me, I can tell you which side they're aligned with. The current Pope (the current ruler) that I saw is undoubtedly... Righteous. That is why I should not show any kind of hostility towards him.\"\n\nShura in a nutshell: \"Because even those I regarded as honorable and as paragons of virtues were not, I lost faith in honor and virtues as a whole and now accept, by turning a blind eye, to follow directives that would have once appeared to me as dishonorable or unjust.\"      \n\nCamus in a nutshell: \"It is acceptable and commendable for people to feel emotions but not for us soldiers because they are weaknesses holding us back that can get us killed.  \n\nAphrodite: \"Absolute power is what Justice truly is. Might makes right. So long as the Pope continues to wield the immense power required to rule Sanctuary, then he himself is the very symbol of Justice. It's only natural, the only reason the world has enjoyed peace for so long is precisely because the Pope enforced it.\"",
        "created_utc": 1677951263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there another work that is structured like Spinoza's Ethics?",
        "author": "PytheasTheMassaliot",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i7k8g/is_there_another_work_that_is_structured_like/",
        "text": "I like going back to Ethics once in a while, just for its structure even. Spinoza builds his theses and arguments about metaphysics, psychology and ethics the same way Euclid puts forth geometry.\n\nSo now I was wondering, are there any other works like this, a work in which a philosophical problem is tackled with that sort of geometrical methodology?",
        "created_utc": 1677951076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Restore my world-view: The i am God-Problem",
        "author": "Vukovic_1501",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i7gkz/restore_my_worldview_the_i_am_godproblem/",
        "text": "Good Evening\n\nBefore a year i took a substance which causing hallucinogenic effects.\n\nI had a phase which was not longer than 15 seconds in which everything turned black.\nI forgot that i was a human. I thought i was dead and a soul stuck in another dimension forever. It felt like a nightmare.\n\nHow do i know now, that i wasn‘t God in this 15 seconds because i assume that i was in a place either before creation (big bang) or in another dimension.\n\nI hope we can analyze this because it destroys my worldview about everything.",
        "created_utc": 1677950910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing after death",
        "author": "ExerciseForTheBalls",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i5xz5/nothing_after_death/",
        "text": "One of my biggest fears is that there is nothing after death, my brain completely shuts down and everything disappears into nothing. \n\nPlease give me a more positive outlook on death so ill stop staring at the ceiling for hours trying to sleep",
        "created_utc": 1677949004,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any pragmatist philosophers that were critical of pluralism?",
        "author": "HeftyAd1718",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i52eq/are_there_any_pragmatist_philosophers_that_were/",
        "text": "[removed]",
        "created_utc": 1677948003,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is this phenomenon called",
        "author": "Sunny_Reddy18",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i2lbd/what_is_this_phenomenon_called/",
        "text": "From the past six months the percentage of misogynistic, anti LGBTQ, toxic masculinity supporters have been growing in Instagram\n\nOne of the main reasons why this is happening is because many reels are promoting these things and because many people are interacting with these reels, the reels are blowing up\n\nBecause these reels are blowing up more people started uploading these kind of reels\n\nThis kind of started a cycle which increases every time\n\n\nWhat is this kind of phenomenon called are there any examples to this which happened in the past or happening right now\n\nI don't know if this belongs in ask philosophy or ask psychology I am not sure so I am posting about this in both subreddit, please delete this post if it doesn't belong here",
        "created_utc": 1677945248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whose the philosopher you enjoy the most? Why?",
        "author": "Kind_Carpenter222",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11i0g5e/whose_the_philosopher_you_enjoy_the_most_why/",
        "text": "",
        "created_utc": 1677940107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain to me how the present day world of philosophy works? What is the state of philosophy today?",
        "author": "Tony_Montana5",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hzym3/can_anyone_explain_to_me_how_the_present_day/",
        "text": "I have started reading philosophy in my own time in a non-academic context recently (though I did take a few classes in undergrad), and I have been exclusively reading pre-21st century philosophers. So, my question is what is the state of present day philosophy? How do they decide what topics to pursue? What are the areas of study that are popular right now? What are the big questions/debates? I guess I'm just kind of confused because it seems like so much has already been covered in the past. Is there new schools of thought I should know about? Or is a lot of it just analyses of past philosophy?\n\nAlso where can I look to for new philosophy material? The only philosopher I really know of that is alive is Slavoj Žižek.\n\nSorry if this question seems vague, I guess I am just trying to get a sense of how to engage with philosophy of my lifetime. The world of philosophy is so expansive that it gets kind of overwhelming for an amateur like me.",
        "created_utc": 1677938808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Nietzsche believe in a literal eternal return?",
        "author": "Hot_Presence_3268",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hyw0v/did_nietzsche_believe_in_a_literal_eternal_return/",
        "text": "",
        "created_utc": 1677935714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does Confucianism place so much importance on filial piety? Does the parent/child relationship compare to the teacher/disciple relationship?",
        "author": "dreamingover",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hvxiw/why_does_confucianism_place_so_much_importance_on/",
        "text": "Hi there, I just wanted to ask if there's any normative force regarding the importance of filial piety. Most of the quotes in the Analects seem to explain what is filial piety, or how filial piety is the basis of an orderly and moral society, but isn't this an assumption that can be attacked? \n\n&amp;#x200B;\n\nWould there be a way to argue that the teacher/disciple relationship is just as important, if not more important than the parent/child relationship without deviating from Confucianism? As far as I know, sources differ on whether xiao is the most important virtue, but can that be used successfully to elevate the importance of the teacher/disciple relationship?   \n\n\nThis is for an schoolwork assignment. Thank you!",
        "created_utc": 1677925064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question Concerning Nassim Taleb",
        "author": "meemaw64",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hv9uc/question_concerning_nassim_taleb/",
        "text": "From the perspective of a general philosophical interest, is it worth reading the works of Nassim Taleb? More specifically, does Taleb's *Incerto* series have philosophical merit?\n\nAbove that, to what field of philosophy (if any) would Taleb's work be relevant? For instance, I know he draws from Karl Popper, but can Taleb's ideas be easily connected to the philosophy of science or epistemology?\n\nThank you for any help!\n\nPS: I understand that terms such as \"worth reading\" and \"philosophical merit\" are quite vague, but I don't know enough about Taleb's work to further hone my question.",
        "created_utc": 1677922680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help regarding writing about philosophy",
        "author": "floofyenthusiast",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11humg8/help_regarding_writing_about_philosophy/",
        "text": "(I’m sorry if this has been asked before and if it’s not appropriate.) \n\nI got into philosophy almost a year ago and I was wondering if I could get some help with writing essays on philosophy (like writing and interpreting other philosopher’s ideas)?",
        "created_utc": 1677920373,
        "upvote_ratio": 0.99
    },
    {
        "title": "what are your thoughts on David Hume and statements of Causality?",
        "author": "Electronic-Echo-9159",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hueeo/what_are_your_thoughts_on_david_hume_and/",
        "text": "",
        "created_utc": 1677919577,
        "upvote_ratio": 1.0
    },
    {
        "title": "phenomenology, nothingness, technology and bureaucracy",
        "author": "loanwarrior",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hry6e/phenomenology_nothingness_technology_and/",
        "text": "I applied to an MA program in philosophy after being inspired by sartre's being and nothingness, which I am currently reading. My thesis proposal states that meaning is rendered obsolete by the nothing, which is manifest through technology and bureaucracy. Is this a good direction to go in or will the mean academics laugh at me?",
        "created_utc": 1677911556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever had a thought that you didn’t concision being into fruition?",
        "author": "WorkingLaw4240",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hq50e/have_you_ever_had_a_thought_that_you_didnt/",
        "text": "Today I was sitting with my thoughts in the shower, as one does, and I found myself thinking about an upcoming work trip I'm going on. One of my friends, (who also happens to be a lead at my job), told me she didn't think I had the energy to do my part and put up with expectations.\nIt was at this point there was literally a voice in my head, (that's sounded like mine), that said \"I literally have so much potential. I can do anything, especially when I'm sober!\" (I smoke a lot of weed and won't be very much on this trip lol).\nThis thought caught me so off guard I actually laughed out loud. I thought it was so strange that a thought I didn't put any work into thinking up, manifested as positive self talk in my own head, and just wanted to post about it and see if others know about this or have any thoughts about it!\nThanks for reading!",
        "created_utc": 1677906162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Dostoevsky even want to refute Ivan's arguments?",
        "author": "Vaudevillexvillian",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hlw56/did_dostoevsky_even_want_to_refute_ivans_arguments/",
        "text": "Dostoevsky insisted that Ivan’s blasphemous arguments were to be refuted later in the novel. Clearly, he was anxious that the censor, the publisher (M. N. Katkov) or the editor might refuse publication. But as time went on, Dostoevsky found the task of refuting them through Zosima increasingly taxing.\nDo you think he would have made an attempt to do so if he didn't fear being denied publication ?",
        "created_utc": 1677894272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Based on Nietzsche's analysis and critiques of Wagner's music, what would Nietzsche likely say about modern music in the later half of the 20th century to now? How would Nietzsche interpret rock, EDM, and musicals?",
        "author": "Isatis_tinctoria",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hlbov/based_on_nietzsches_analysis_and_critiques_of/",
        "text": "Based on Nietzsche's analysis and critiques of Wagner's music, what would Nietzsche likely say about modern music in the later half of the 20th century to now? How would Nietzsche interpret rock, EDM, and musicals?",
        "created_utc": 1677892768,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to respond to Descartes ideas",
        "author": "QBD999",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hl4ci/how_to_respond_to_descartes_ideas/",
        "text": "How to respond to René Descartes 4 Rules of Discourse or to respond to his famous saying I think therefore I exist",
        "created_utc": 1677892227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fictional ancient being talking to humans about destiny",
        "author": "EducatorBig6648",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hk0fi/fictional_ancient_being_talking_to_humans_about/",
        "text": "I am writing a book were I have an ancient being say to the humans \"We cannot change our destiny because we are our destiny and our destiny is us.\" as this ancient being believes in predeterminism and a sort of free will.\n\nPhilosophically speaking, does that hold water or would it just be a a wise-sounding non-fact like \"Everything that has a beginning has an end, Neo.\"?\\*\n\n&amp;#x200B;\n\n\\* (Since I can name something that once it exists it exists forever and beyond.)",
        "created_utc": 1677889405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wittgenstein's ultimate problem of philosophy?",
        "author": "NotLongForThisSite",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hj7ra/wittgensteins_ultimate_problem_of_philosophy/",
        "text": "Maybe not a relevant question to ask, but several years ago while delving into Wittgenstein I happened upon a treatise that said something to the effect that to Wittgenstein language was not the real problem of philosophy, it was only a problem of our ability/inability of relating to the world, and that, the author went on, Wittgenstein had to solve the problem of language before he could tackle what he felt was the real problem of philosophy. The author however never went on to discuss or explain what this real problem was and it has mystified me since. If language is not the real problem of philosophy, what then is for Wittgenstein? Or was the guy just blowing metaphysical smoke?",
        "created_utc": 1677887474,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Knowledge?",
        "author": "FizzayGG",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hijv2/what_is_knowledge/",
        "text": "Hi everyone,\n\nI'm not that familiar with the debate on this question, but I am aware that for a very long time most philosophers agreed that knowledge is \"justified true belief\" (jtb)\n\nGettier Cases, however, changed that. I was wondering what popular definitions of knowledge have cropped up in the place of JTB? Does anyone have any good papers that make a case for a new definition that can survive a Gettier case?\n\nCheers Everyone!",
        "created_utc": 1677885881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zombies and Marys",
        "author": "spamalotsss",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hh45g/zombies_and_marys/",
        "text": "I spent a couple of weekends ago really trying to understand qualia and the contemporary arguments that try to put forth that their existence stands in a causal relationship to my experience of them.  I was an undergrad philosophy major right around the time that philosophy of mind and computer science started their crosstalk, so it's been a while.  However, the arguments I was focusing on recently (p-zombies and Mary's room, mainly) seem to me to be absurd and facile.  I can't help being a little angry that people butter their bread in part by perpetuating these fantasies.  I don't really want to spend much time tearing down arguments, but can someone point me to some more, um, grown-up arguments for accepting that qualia are actual objects that are present in my mind and stand opposite my mental perception of them?",
        "created_utc": 1677882533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Bohumeanism (or “Super-Humeanism”) a plausible metaphysical model for the physical world?",
        "author": "CosmicFaust11",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hgnfa/is_bohumeanism_or_superhumeanism_a_plausible/",
        "text": "David Lewis was one of the most influential philosophers of the 20th century. One of his unique contributions to metaphysics was the development of a theory he termed ‘Humean Supervenience’. This metaphysical theory claims that there is nothing to reality except the spatio-temporal distribution of local natural properties. According to him, there are identifiable fundamental physical objects at points in spacetime. Lewis famously described this view by saying that “all there is to the world is a vast mosaic of local matters of particular fact, just one little thing and another”. Lewis is seen as the main defender of this neo-Humean metaphysical paradigm. \n\nHowever, this view has come under attack with the advent of the quantum revolution in modern physics. The phenomenon of quantum entanglement (non-locality) implies that there are features of the micro-world that appear to display non-separability and this is in contrast to the neo-Humean metaphysical paradigm as it undermines metaphysical atomism/ontological reductionism and implies a version of ontological holism (the whole is greater than the sum of its parts). Jonathan Schaffer, along with many others, is a philosopher that argues for this position. \n\nHowever, some defenders of the neo-Humean mosaic have attempted to overcome this severe problem by amending their conception of Humean Supervenience. After doing some further reading, it appears that there maybe a possible response a person committed to neo-Humean metaphysics can utilise. This has come to be known as “Bohumeanism” (or “Super-Humeanism”). Bohumeanism seeks to defend Humeanism against the non-separability argument (as I explained before many philosophers believe that quantum mechanics implies and motivates ontological holism) derived from entanglement (non-locality). It rejects relational holism (as adding modal relations to the neo-Humean mosaic destroys Humean Separability) and rejects wave function realism (as moving the tiles of the mosaic into a high-dimensional space may destroy the picture). \n\nBohumeanism strategy is to argue that primitive ontology is consistent with Humean Separability (i.e., the ontology is separable) and that POA (primitive ontology approach) laws are consistent with physical statism and Humean Separability (i.e., there is a coherent Humean account of laws). Primitive ontology is a response to the debate over the true ontological nature of the wave function. The primitive ontology approach claims that there is ‘matter’ (or ‘local beables’) in 3D space (or 4D spacetime). Each separate element has a determinate position. Macroscopic objects are made of matter eg. pointers or measuring devices, which have definite positions. The wave function is a law (or a power). It’s physical significance derives from its *dynamical role* in the temporal development of the matter. Any law for the evolution of the primitive ontology will be highly non-local. \n\nSo, the first step for Bohumeanism (or Super-Humeanism) is to argue for a separable ontology — effective wave functions concerns the relative motion of the primitive ontology. Primitive ontology follows non-local Bohmian law of motion. The second step is to argue for a Humean law. \n\nAccording to powerists, this law of motion manifests one (or more) intrinsic power(s). But according to Humeans:\n\nH1: Physical Statism: All facts about the world, including modal and nomological facts, are determined by (or supervene upon) the total physical state of the world.\n\nH2: Humean Separability: The total physical state of the world is determined by/supervenes upon:\n1: the intrinsic physical state of each spacetime point (or pointlike object)\n2: the spatiotemporal relations between those points\n\nBohumeans appeal to 'Best System Account' of laws: this law is just a systematic summary of the facts that balances theoretical virtues.\n\nSo, is Bohumeanism (or “Super-Humeanism”) a successful response from the defenders of Humean metaphysics when it comes to making quantum mechanics compatible with that paradigm? Or is this metaphysical model of the physical world layered with problems? Cheers.",
        "created_utc": 1677881465,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am not good with words and I would like to be able to explain why there are certain unfavorable events.",
        "author": "Numerous_Ad310",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hfxsm/i_am_not_good_with_words_and_i_would_like_to_be/",
        "text": "The events which I'm referring to are the kind that are unavoidable and no one can be responsible for, but not in reference to good and evil.  \n\n\nHere are some examples:  \n\\- Earth simply rotates around the sun, and a meteorite just flies through space and who knows what it could encounter, it could eventually happen upon Earth, when it could have been at another point of its rotation, and collide with it.  \n\\- An unexpected thunderstorm occurs and a bolt of lightning hits a tree and causes a forest fire.  \n\\- Someone wants to talk with someone about something, but that person is not in the mood or is too busy.  \n\\- Someone turns a corner to another street and unexpectedly bumps into someone, who also wasn't expecting to meet this person.  \n\n\nThe only words I can come up with are: as everything happens haphazardly, one person or thing can take a direction or make an action that can however interfere with or be not favorable for another one's direction/action (or many), and there is no system that makes everything go as wished.  \n\n\nAre there any books which might provide a better explanation? Or maybe videos preferably?",
        "created_utc": 1677879865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is philosophy truly accesible to everyone?",
        "author": "Disastrous_Cap_9990",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hek2j/is_philosophy_truly_accesible_to_everyone/",
        "text": "I have been interested in delving into philosophy for a while now but after browsing this subreddit i am beginning to have second thoughts.\n\nThe main reason why i am interested in philosophy is to practice my argumentation develop my critical thinking skills and i any case learn how to successfully compare to positions on any matter and evaluate them.\n\nI was always aware that philosophy was a demanding field of study especially as you started to progress from the Greeks to later contemporary philosophers.After browsing this subreddit  i have come to the conclusion that a person like me that has no guidance should be hesitant to start philosophy.\n\nTo be clear my goal is not and never was to become an academic or anything like that.I just want to improve my critical thinking but it seems that even the \"easier\" philosophers require the quidance of a teacher or like minded indivuals to be properly understood.I think everyone would agree that there is no point in delving into philosophy if you are just going to misintrepret half og what you read",
        "created_utc": 1677876752,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what sense are we the same person to when we were 10 years old ?",
        "author": "Antique-Trouble5153",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11he959/in_what_sense_are_we_the_same_person_to_when_we/",
        "text": "",
        "created_utc": 1677876063,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to reading philosophy",
        "author": "Altruistic_Gold4835",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hcyb8/new_to_reading_philosophy/",
        "text": "Hello, as you have read in the title, I am new to reading philosophy, it’s always been interesting to me but I’ve just now gotten around to reading my first philosophical text. So, that said, I was hoping that you all might have some beginner advice and tips, also on how to take notes? Thanks!",
        "created_utc": 1677873095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it immoral to attack a rock?",
        "author": "SportSportManMan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11hb71m/is_it_immoral_to_attack_a_rock/",
        "text": "Lets suppose this attack takes place in some morally neutral space. Attacking the rock might damage the rock, but will never hurt anything else or cause offense. The rock is also a perfectly ordinary, mindless rock, which isn't important to anyone, which can't experience pain, and isn't capable of suffering, or anything in general. \n\nIs attacking the rock still immoral? If the most immediate reason is because of virtue ethics or moral relativism, what if it were virtuous to attack rocks, and it were considered relatively moral to attack rocks?\n\nAnd, if we suppose the rock is not a crystal or other material which can slowly regenerate itself, is there a version of morality where it's more immoral to gently scratch the rock than it is to harm infinite living beings reversibly but viciously?",
        "created_utc": 1677869202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are vulnerability and submission signs of strength?",
        "author": "Beh1ndTheScenes",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11ha8m7/are_vulnerability_and_submission_signs_of_strength/",
        "text": "To be vulnerable, to open up and submit to another, means to expose oneself to the possibility of physical or emotional injury\n\nIt means to be a prey, ready to be hunt down and dominated by a predator. Is that not humiliating? Why do people believe that vulnerability and submission to power can be strengths, when they are weaknesses? And what does philosophy have to say about vulnerability and submission to power?",
        "created_utc": 1677867748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strong v Weak Intellectual Property Rights",
        "author": "Lukeweaving",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h9tdp/strong_v_weak_intellectual_property_rights/",
        "text": "I am beginning my dissertation on moral justifications of intellectual property right. I have come across the terms strong and weak intellectual property but I am not sure one what they mean. When I have tried to find more information I can’t seem to find what I’m looking for.\n\nThanks for any help!",
        "created_utc": 1677867272,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the responses to RationalWiki's criticisms of the Chinese Room Experiment?",
        "author": "ReluctantAltAccount",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h8rhm/what_are_the_responses_to_rationalwikis/",
        "text": "[https://rationalwiki.org/wiki/Chinese\\_room#Problems](https://rationalwiki.org/wiki/Chinese_room#Problems)\n\nTo me at least, it seems like it's trying to equate an individual with a neuroscientifically proven understanding of language. with a machine that runs on a simpler algorithm with no actual proof of understanding.",
        "created_utc": 1677866113,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Baudrillard's sign theory of value relate to objects of honor such as war medals",
        "author": "KariusForPresident",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h88jo/how_does_baudrillards_sign_theory_of_value_relate/",
        "text": "If I am understanding it correctly (which I am probably not because my reading of Baudrillard has been very limited) the symbolic exchange is a product of post-modern relations. Our viewing of a car as having prestige rather than a use value is a product of the change of language, the hyperbolization of the media, etc.\n\nIf that is true though, how would we explain things such as war honors (which have been around for centuries) which do not have a use outside of their prestige? Do they in fact have other value, and how does their valuing differ from our valuing withing the symbolic exchange?",
        "created_utc": 1677865511,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would life purpose/meaning be like?",
        "author": "00Dandy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h7f2v/what_would_life_purposemeaning_be_like/",
        "text": "I believe life has no real meaning and that I have no life purpose but at the same time I struggle to define those terms.\n\nIf I could create a life with purpose/meaning, I don't know what it would look like. I mean, you could choose anything as your purpose, no? You could say your life purpose is to fart as much as possible.\n\nThe more I think about it, the more those terms seem meaningless when applied to life or the world as a whole. The only inherent purpose of all beings is to procreate (and to survive). I think there can be no other life purpose/meaning. Everything else is secondary. \n\nHowever in our world we have no need to procreate or survive. Humanity will go on without me or my children and so will the people around me. We have basically reached a point where the individual doesn't really matter anymore.\n\nI hope this makes sense. Just some thoughts I had.",
        "created_utc": 1677864604,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what sense is the modal ontological argument thought to be an improvement upon Anselm's original?",
        "author": "nomenmeum",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h5xex/in_what_sense_is_the_modal_ontological_argument/",
        "text": "",
        "created_utc": 1677862984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start with Kirkegaard if I'm a layman?",
        "author": "QirdHakim",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h5h48/where_to_start_with_kirkegaard_if_im_a_layman/",
        "text": "I have zero schooling in philosophy but am an avid reader. My history of reading philosophy is eclectic and diverse, but I've most focused on Aristotle and various liberal Christian thinkers. \n\nWhere should I start with Kierkegaard? if it matters, I'm most interested in his work as it relates to Christian existentialism",
        "created_utc": 1677862061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have any advice on how to start reading Nietzsche's \"The Birth of Tragedy\"?",
        "author": "Himawari-sun",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h4n5k/does_anyone_have_any_advice_on_how_to_start/",
        "text": "Hello to all,\n\nI have to read this book by Nietzche and I won't lie... I find it not very simple. I would have liked some advice to better understand it. I have to hand in a school report about this book, so any help would be helpful!",
        "created_utc": 1677860148,
        "upvote_ratio": 1.0
    },
    {
        "title": "A conversation",
        "author": "let-therebe-light",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h3yaa/a_conversation/",
        "text": "Today I had a conversation with several of my colleagues on many topics. One of the topics that came is how Hawking is a genius like God. I disagreed cuz he's overrated and he isn't as great as we think he is. They started attacking me by claiming that i on the other side am on  level to even say this statement. Of course  I'm not. There even came an argument where they say that AI could gain consciousness. Well, there are people on both sides of this view and they quote Elon Musk to support how AI could gain consciousness. I on the other hand disagreed cuz Musk isn't the guy where we should rely on our argument on. How do you people cope with these people?",
        "created_utc": 1677858484,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many of you managed to make something out of Phil education?",
        "author": "Logical_Pixel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h2yv6/how_many_of_you_managed_to_make_something_out_of/",
        "text": "... and, if so, how?\n\nTo clarify I take the question in the broadest sense possible, so I am talking about everything from actual jobs to side occupations to getting some value out of it in your everyday life.\n\nI myself feel terrible about how my life is going (super dull yet stressful job and I basically haven't touched anything philosophical since deciding not to send in my PhD application months ago), so I was wondering how it went for other people.",
        "created_utc": 1677855907,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ridiculously thin line between good and bad - rant/opinion",
        "author": "tartigrade78",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h2bar/the_ridiculously_thin_line_between_good_and_bad/",
        "text": " \n\nThe idea that there is a thin line between what is considered ethical and non-ethical has been nagging at me lately, im interested in other people's opinions on this especially with regards to jobs. Ill give some examples:\n\nThe bully that bullied you in school... he taught you some serious lessons in life, he made you mentally tough and resillient, he humbled you enough to understand that there is always a bigger fish, he may have driven you to go to the gym, learn self-defence ect.\n\nThe greedy stock market trader on wall street earning millions of dollars a year that you all hate... he payed a ridiculous amount in taxes - much more than you ever payed, he is responsible for helping open up that new public school indirectly through taxes. Many argue that traders are 'regulating the market', essentially finding 'bubbles' (when the companies stock evaluation is inproportionate to it's 'true' value), allowing for greater economic growth.\n\nSay a paramedic makes $80,000 a year - pays 15k tax. Who is better - the investment banker who gave (unwillingly) 5 million dollars to the government which helped funded 5 MILLION DOLLARS WORTH of hospital equipment which helped saved countless lives, or the paramedic who saved 30 LIVES this year and only gave 15k??? Giving money to a middle-aged homeless man... are you not encouraging his behavior? Sure it won't make any realistic behavioral change by not giving him, but are you not decreasing the probability of him turning his life around by 0.1%? 0.1%, in-large, is significant.\n\nThe online 'nigerian prince' that stole $1000 from you... did that not teach you a lesson? After all, you will likely be extremely less gullible to future scams - I mean if he didn't scam you it would have been someone else anyway... right? What about the social media companies 'connecting the world'... all tiktok does nowerdays is make kids less ambitious, satisfying their boredom and giving them the dopamine hit they crave, not so-dissimilar to a drug. Not to mention all the vanity that ultimately drives instagram and facebook ect. Are all the software engineers really such good people? AI - that's a big one... so many jobs lost in the future.\n\nWhat about white lies... telling your friend you like their dress, or their haircut looks good. If you tell them it looks bad, are you being a bad friend by offending them, or are you doing them a disservice as they will likely get a similar haircut in the future?\n\nAnd lastly the greatest issue I have - the idea that all morality and ultruism - is inherintly selfish. Why would a psychopath not give to charity? Because he FEELS no emotional benifit... every person who does anything good, one could argue that it is for themselves and the hit of whatever neurochemicals in the brain they so enjoy after doing something they deem to be 'moral'.\n\nMy point being... How thin is the line???\n\nIf there is a God, how would he judge people and determin where we go after we die?\n\nInterested in what people think about this.",
        "created_utc": 1677854179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kant",
        "author": "Crony_capitalist101",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11h1kwy/kant/",
        "text": "How is Good will manifested in the concept of duty?",
        "created_utc": 1677852239,
        "upvote_ratio": 1.0
    },
    {
        "title": "tse",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677851207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a Philosophy of History?",
        "author": "PhilosopherOfIslam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/11gzicl/is_there_a_philosophy_of_history/",
        "text": "you know how in the philosophy of science you will verify things by looking at the intricacies, is this the same for history? such as eye witness and how valid a historical source is?\n\nif so where can i learn this method?",
        "created_utc": 1677846485,
        "upvote_ratio": 1.0
    }
]