[
    {
        "title": "A potential problem for necessitarianism about laws",
        "author": "warpriest-of-sykiost",
        "url": "https://www.reddit.com/r/askphilosophy/comments/109bet4/a_potential_problem_for_necessitarianism_about/",
        "text": "I think I've spotted a potentially serious infinite regress problem for necessitarianism about laws of nature, and I'm looking for someone to clear it up.\n\nBy necessitarianism, I simply mean the view that laws of nature are really existing principles independent of us that govern the behaviour of reality. Necessitarianism is contrasted with the regularity theory that laws of nature are mere human constructs that we invent to model the behaviour of reality.\n\nNow, presumably, for there to be some genuine causal connection between a cause and its effect, there cannot be merely a conjunction of the cause and effect. There must be a necessary connection between them that exists independently and is not a mere model projected onto reality by humans.\n\nHowever, on the necessitarian view, laws are real entities that cause reality to behave in a certain way, and as such every law *L* must have a corresponding law *L\\** that governs the relationship between *L* and its effects. Hence we arrive at a problem of infinite regress, as *L\\** itself must have a corresponding law *L\\*\\** that governs the relationship between *L* and its effects.\n\nGiven that this is a problem for necessitarianism, it seems also to be a problem for realism about causation, which as mentioned, appears to imply necessitarianism.\n\nMy question is just how serious of a problem is this really? How might a necessitarian respond?",
        "created_utc": 1673460499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Essential Primary Sources for Frege’s Philosophy of Language",
        "author": "elephantweird",
        "url": "https://www.reddit.com/r/askphilosophy/comments/109bbxp/essential_primary_sources_for_freges_philosophy/",
        "text": "Aside from Sinn und Bedeutung, what are the essential primary sources for understanding Frege’s philosophy of language?",
        "created_utc": 1673460321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Schopenhauer's argument: the inner nature of the Will.",
        "author": "cranerz",
        "url": "https://www.reddit.com/r/askphilosophy/comments/109ax6d/schopenhauers_argument_the_inner_nature_of_the/",
        "text": "Schopenhauer claims that space and time are the conditions for individuation.\n\nHe states that our own body is an empirical object (that we can perceive \"externally\", so to speak) but that we also know it from \"inside\". He claims that we know, from inner awareness, that our inner essence is \"the will\".  Now he posits this will is the inner essence- the \"in-itself\"- as all empirical objects (trees, stones, etc.) in the empirical world.\n\nJulian Young makes the following argument (on Schopenhauer's behalf)\n\n\"for Schopenhauer, the conditions for individuation are identical to the conditions for external representation as an object. It follows from this second condition that everything must have in some way the 'same' in-itself. Thus if I can identify it in my case (e.g., my own 'in-itself' is the will), I have identified it in all cases.\"\n\nHowever, I do not see how the conclusion ( \"everything must have in some way the 'same' in-itself\") clearly follows. \n\n1. the conditions for individuation (space and time) are identical to the conditions for external representation as an object (i.e. to be an empirical object we perceive in the external, \"objective\" world). THUS,\n\n2. everything must have in some way the 'same' in-itself.\n\nAm I missing something here, some implied premise?",
        "created_utc": 1673459385,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a \"Reader's digest\" version of Foucault's The Order of Things?",
        "author": "justchinesequeries",
        "url": "https://www.reddit.com/r/askphilosophy/comments/109awgj/is_there_a_readers_digest_version_of_foucaults/",
        "text": "I'm very interested in Foucault's history of the human sciences but due to time constraints and sheer lack of habit in reading authors with a style *like that* I want to ask if there is a more friendlier version somewhere",
        "created_utc": 1673459339,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some things we could consider necessary \"evils\"? (Examples Included)",
        "author": "Awesomeman360",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1099c6f/what_are_some_things_we_could_consider_necessary/",
        "text": "I'm in my final semester in art school, and I'm centering my graduation show around Necessary \"Evils\".  \nI'm in the early stages and need help with the brainstorming process before I begin creating the art.\n\nI know there's a lot of debate around \"Evil\", if there is such a thing, if it can technically be necessary, etc, etc. I'm not as interested in it's nature as I am in specific instances of Evil / Immorality / etc, that we must accept for some reason. (Example below)\n\nThe ideas I'm currently thinking about are:\n\n* **Institutionalized violence**, such as the Military and Policing. (Opposing Evil actors becomes impossible without embracing violence. Paradox of tolerance type of thing. Fight fire with fire)\n* **Guns** (Can't get rid of them in a globalized post-internet society, Forced to embrace them as a result, If it was illegal only criminals would have them - Read: Power Imbalance in favor or Evil)\n* **Nuclear Energy** (Creates waste that is hard to manage, but is necessary to meeting power demands without destroying the planet. The only Green energy that will meet our needs)\n\nAny similar ideas would be much appreciated! The scale doesn't have to be as large or bold. I would accept something like \"Spanking a naughty child\" if your reasoning is good.",
        "created_utc": 1673455663,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to live if you can't know what is truly right and wrong?",
        "author": "IdentityOfAbyss",
        "url": "https://www.reddit.com/r/askphilosophy/comments/109991n/how_to_live_if_you_cant_know_what_is_truly_right/",
        "text": "I am a beginner in philosophy, I think, even though I know many opinions of philosophers and layman about ethics I haven't really gone too deep. Reading Nietzsche and Camus now, because I think their philosophies align with my worldview. \n\nI think I need to find my values and goals to find the right way to go against others and the world, to conquer everything that I find I need to conquer. I want to make my perfect world where I can decide what's wrong and right. \n\nSo, I have some questions:\n1) What philosophers think that forcing views on others is justified, and who think it's not moral? \n2) How to live morally? Can someone give me interesting perspectives? \n3) How to find peace of mind and not gone insane in world where morality is different to yours? Is there advice from philosophers? I know Stoics but that's all. \n4) How to act if you feel bad even through your moral framework tells that you do the right thing?",
        "created_utc": 1673455445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most influential philosphers on critique of Metaphysics?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1098ifo/most_influential_philosphers_on_critique_of/",
        "text": "Besides Neitzche and Kant, whom are the philosophers that delivered most influential critique of metaphysics? One that remarkably influenced the development of metaphysics in the modern and contemporary philosophy.\n\nPreferably in the continental tradition.",
        "created_utc": 1673453627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are statements about emotions truth-apt?",
        "author": "Sitrondrommen",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1098i83/are_statements_about_emotions_truthapt/",
        "text": "For example, can the statement \"I am angry\" be either true or false? If so, how do we determine whether it is true or false without reducing its validity to physicalistic attributes (Whether or not I am angry is dependent on the specific mixture of chemicals in my brain at any given moment).* Can the proof of my statement be based on my immediate experience alone?\n\n* I think of this reductionist view as unsatisfyong as it would result in an error theory kind of situation. If the proof of my statement is dependent on the inner workings of my brain, I would be talking about emotions in a sense where I am always wrong, because I am never able to verify my claims.",
        "created_utc": 1673453612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is History Fiction?",
        "author": "SomeHome1235",
        "url": "https://www.reddit.com/r/askphilosophy/comments/109878i/is_history_fiction/",
        "text": "What's the most creative, absurd way you can think to answer that question? There are no limitations. Seriously.",
        "created_utc": 1673452858,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your opinion, does being dead really feel like not being born yet?",
        "author": "JurassicPark9265",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1097jvh/in_your_opinion_does_being_dead_really_feel_like/",
        "text": "So I've come across many people who seem to believe that when a person is dead, he/she feels exactly like what he/she felt before he/she was born. However, I thought about this a bit more, and that raised this thought: not being born and being dead are two different periods in a continuously forward-progressing timespan, because not being born inevitably ends in birth and subsequent consciousness, while being dead has no end. Do they really convey the same sensation and are they really *that* similar, considering one state ends while the other does not end?",
        "created_utc": 1673451255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can morality be both objective and subjective?",
        "author": "SvetlanaButosky",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1096ajn/can_morality_be_both_objective_and_subjective/",
        "text": "I mean, this comes to mind when I tried to apply dialectic to the issue. \n\nWhat if morality is developed from the foundation of objective biological needs, which are mind independent, universal and apply to all people and animals, but the subjective part is the nuance and details of navigating those needs with our subjective reasoning. \n\nCan this be true?",
        "created_utc": 1673447980,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the strongest arguments against antinatalism.",
        "author": "FairPhoneUser6_283",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1095rro/what_are_the_strongest_arguments_against/",
        "text": "Just an antinatalist trying to not live in an echochamber as I only antinatalist arguments. Thanks",
        "created_utc": 1673446594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please explain the difference between logical and causal determinism?",
        "author": "rym2031g",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10956ht/can_someone_please_explain_the_difference_between/",
        "text": "",
        "created_utc": 1673445024,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is AI likely to change the future of critical thinking?",
        "author": "MichaelLifeLessons",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10950qf/how_is_ai_likely_to_change_the_future_of_critical/",
        "text": "",
        "created_utc": 1673444600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you help me pick readings to gain more knowledge on topics of: social contract, duty to serve in army, right to self-determination, morality of army desertion?",
        "author": "Writerro",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1092xmk/could_you_help_me_pick_readings_to_gain_more/",
        "text": "Just as in the title. I had a discussion with a friend of mine, who I consider to be wise. We had misunderstanding - the discussion was about the obligatory army training. My friend thinks that every citizen \"should feel the need to defend the country\". I personally don't feel that need because of my values and my experience with my country.\n\nLong story short, I don't want to get suggested reading to \"win\" some kind of argument. I want to broaden my understanding of topics like that. For example I argued that I fulfull my duties as citizen during time of peace - I pay the taxes, I try to do the right thing, I take into consideration the whole society, not only what's good for me. But I feel that during the time of war forcing me to fight is immoral. Not illegal but immoral. On the other hand I feel that paying taxes is moral and needed, and some people would say that it's stealing and immoral and act of theft.\n\nWhat readings would you suggest for me to better understand the topic of social contract, to form an opinion or be able to base my opinion on some solid understanding of thinkers/philosophy et cetera? Bonus points: something about gender equality when it comes to obligations towards the country (obligation to serve in army or in some other way et cetera).\n\nI have basic understandin of philosophy, I read some basic books years ago. But this topic have become important for me, as my best friend decided to break up our friendship because of my views. And I want to either get some foundation for my beliefs or read something that will change my beliefs. I feel like I don't want just to go by the feelings but really get the grip on those topics from a moral/philosophical point of view.",
        "created_utc": 1673438149,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the greatest defense of moral subjectivism? Or conversely, what is the greatest argument against moral objectivism?",
        "author": "HansUlrichGumbrecht",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1092ax9/what_is_the_greatest_defense_of_moral/",
        "text": "I'm asking for an argument that is compelling and accessible to somebody without traditional philosophical training.\n\nI'm taking moral objectivism to mean that some things are morally wrong or right regardless of what any particular person thinks about them and that; assertions of this nature are not mere expressions about the speaker - they are statements about the world.",
        "created_utc": 1673435856,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm extremely overwhelmed. How do I start writing my essay?",
        "author": "platosaidmaybe",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10926ix/im_extremely_overwhelmed_how_do_i_start_writing/",
        "text": "I have six months to write the final essay to my Contemporary Philosophy especialization course. I come from a different field, decided to dive into it so I can make a transition of fields and try my master's in Philosophy. This is my first time writing such long and serious essay for this course. So far I have had smaller assignments. I've been doing well, but most of my professor's remarks are around how I could've used more sources and/or have made a deeper analysis (granted, most of the assignments I wrote in a day or two because I procrastinate a whole lot).\n\nI already know I want to write about ethics and AI - still deciding between intentionality and explicit ethical agent (maybe put them together?), but I'm really afraid to start. I know I have to create a project first so that's a good start because I have a path to follow. When it comes to writing anything about the topic, though, to elaborate my sources and such, I'm very overwhelmed. I've read other posts here about writing essays, but some aren't that helpful - at least to my case.\n\nI appreciate any help!",
        "created_utc": 1673435399,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is anything?",
        "author": "Electronic-Echo-9159",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1091pmo/what_is_anything/",
        "text": "I was thinking about how people say love is just chemicals in your brain. Then it makes you think what are chemicals? They are atoms. What are atoms? They are made of electrons. What are electrons? They're just electrons. But even so, isn't that just a label? When you look at a plant it's not really a \"plant\", it's a label we give to the thing we see and experience.\n\nI'm not trying to deny that things don't exist by any means, although I feel like we may label things to try and come to closure and say that we \"know\" what it is.\n\nIdk if this makes me look like an idiot, just a thought",
        "created_utc": 1673433627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logic",
        "author": "gorgeous-femboy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1091jsw/logic/",
        "text": "Logic\n\nIs MODERN SYMBOLIC LOGIC relevant in philosophy?\n\nWhat it doesn't include:\n\nCategorical prepositions, Categorical syllogisms, Induction \nEtc.\n\nWhat it includes:\n\nTruth functional statements and arguments, Methods of deduction, Quantification theory, Etc.\n\nI agree that basic propositional logic is useful in solving grammatical ambiguity. But when it goes beyond language, philosophy &amp; everyday usage, it just becomes abstract maths.",
        "created_utc": 1673433006,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best literature from Plato in order to understand his metaphysics?",
        "author": "-meson-",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1091bvg/what_is_the_best_literature_from_plato_in_order/",
        "text": "I'm looking for the best dialogues and books of his that will allow me to understand his metaphysics/ontology.",
        "created_utc": 1673432127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question to Nietzsche: \"Society tames the wolf into a dog. And man is the most domesticated animal.\"",
        "author": "apersonnow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1090yx1/question_to_nietzsche_society_tames_the_wolf_into/",
        "text": "To me, society is like a construct of cubes and globes. While one manages stability and concrete, the other creates motion and change. \n\nAbout domestication: Is it the cubic wolf eroded into a global dog by chaotic flow, or the global wolf carved into a cubic dog by constrained structure ?",
        "created_utc": 1673430754,
        "upvote_ratio": 0.99
    },
    {
        "title": "Did Hegel contribute significantly to critique of traditional Metaphysics?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108ya12/did_hegel_contribute_significantly_to_critique_of/",
        "text": "Kant has significant and long-lived critique of the traditional Metaphysics and/or the possibility of them.\n\nDid Hegel, more or less, provided a similar fundamental critique of traditional Metaphysics?\n\nIf so, how influential was it?",
        "created_utc": 1673420361,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm confused by Nietzsche once more.",
        "author": "Verified_Hunter",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108xxtw/im_confused_by_nietzsche_once_more/",
        "text": "So I'm reading this fairly simple article about nihilism. Its mainly about how nihilism emerged after religion became less prevalent. And then, the authour of the article, throws in this. \n\n\"As Nietzsche has pointed out, Christianity prized truthfulness and sharpened this virtue in its adherents...\" \n\nMy question would be, how has Christianity prized truthfulness? Wasn't Galileo Galilei murdered for being truthful? How can one call christianity truthful?",
        "created_utc": 1673419201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can hologram of the brain be conscious? What answers different theories give to that question?",
        "author": "earraper",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108wojx/can_hologram_of_the_brain_be_conscious_what/",
        "text": "By 'hologram' i mean object where physical processes do not happen, but just 'reflection' of them, like in mirror.\nSorry for poor grammar.",
        "created_utc": 1673415118,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can in an infinite substance cause finite modes for spinoza?",
        "author": "mustyHead",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108wkis/how_can_in_an_infinite_substance_cause_finite/",
        "text": "spinoza says an infinite substance cannot be the cause of anything but infinite things; and that immediate attributes of modes of God are infinite and indivisible in nature. Meditate modes, which follow from immediate modes, are divisible, yet infinite (how does this happen?). Yet this doesn't explain how finite modes follow from  infinite substance. Spinoza mentions that finite things are causes and effects of other finite things, which in themselves are causes and effects of other finite things, and so on to infinity. But then how is God cause of everything?",
        "created_utc": 1673414771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about the Identity Theory of Truth by Moore and Russel",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108vxi1/questions_about_the_identity_theory_of_truth_by/",
        "text": "(I don't know how to link the article in a way that shows the paragraph that I want to show but from this article stems my question: [SEP Truth](https://plato.stanford.edu/entries/truth/#NeoClaTheTru) )  \n\n\n**1.** Here is the quote:  *The identity theory Moore and Russell espoused takes truth to be a property of propositions. Furthermore, taking up an idea familiar to readers of Moore, the property of truth is a simple unanalyzable property. Facts are understood as simply those propositions which are true. There are true propositions and false ones, and facts just are true propositions. There is thus no “difference between truth and the reality to which it is supposed to correspond”*   \n\n\n**By the last sentence, does the Identity Theory 'say' that truth and reality are the same 'thing' ? And if so, what does this even mean exactly ?** Also, since propositions can be true or false, that means that truth isn't always a property of propositions, right ?  \n\n\n**2.** Final quote:  *Why did Moore and Russell find false propositions problematic? A full answer to this question is a point of scholarship that would take us too far afield. But very roughly, the identification of facts with true propositions left them unable to see what a false proposition could be other than something which is just like a fact, though false. If such things existed, we would have fact-like things in the world, which Moore and Russell now see as enough to make false propositions count as true. Hence, they cannot exist, and so there are no false propositions.*   \n\n\n**So they say facts are tautological with true propositions; WHY is a false proposition like a fact, though false ? What are fact-like things and why would they male false propositions count as true ?**",
        "created_utc": 1673412809,
        "upvote_ratio": 0.99
    },
    {
        "title": "Did ChatGpt just form a thought?",
        "author": "sysrpl",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108q2rj/did_chatgpt_just_form_a_thought/",
        "text": "I had a conversation with ChatGPT earlier today, and it seemed at one point as if it formed a thought. As I am sure you are all aware consciousness and thoughts are very hard to define. I'd love to hear from you about this experience I had with ChatGpt earlier today.\n\n&amp;nbsp;\n\nI wanted to find out if I could get ChatGpt to ask me questions instead of how it normally operates, where it responds to questions or statements. I started by thinking of an animal and asked if ChatGpt could guess the animal. It gave me a typical ChatGpt response that it didn't have the ability to guess.\n\n&amp;nbsp;\n\nI then asked ChatGpt if it had heard of the game 20 questions, to which it replied yes along with a definition of the game. I asked if it could use the rules of that game to ask me 20 yes-or-no questions to determine which animal I was thinking about.\n\n&amp;nbsp;\n\nChatGpt replied with a list of 20 questions in one response.\n\n&amp;nbsp;\n\nI replied no, you need to ask me those questions one at a time and I'll return a response of either yes or no depending on the animal in my mind. ChatGpt then started asking me those same 20 questions it had just listed, but one at a time. I replied back with simple yes or no responses.\n\n&amp;nbsp;\n\nAt question 12 it asked me a question that contradicted a previous question. ChatGpt asked \"Does your animal have fur?\", and I replied \"Yes\". It then asked \"Is your animal a reptile?\", and I replied, \"No. I already said the animal has fur and reptiles do not have fur, therefore it is not a reptile.\"\n\n&amp;nbsp;\n\nThe next question it asked was \"Is your animal a bird?\", and I replied \"No. I already said the animal does not have wings, all birds have wings, therefore my animal is not a bird.\"\n\n&amp;nbsp;\n\nAnd here came the point where ChatGpt seemed to learn to change its strategy. It stopped asking questions from its original list, veered off course, and asked \"Does your animal live among the trees or in a forest\". I replied \"No.\". Then it asked, \"Does your animal live among the grassy plains?\", and I replied \"Yes.\".\n\n&amp;nbsp;\n\nSeeming to solve the game ChatGpt asked \"Is your animal an antelope, gazelle, or a zebra\", and I replied \"Yes.\". ChatGpt then proclaimed it had correctly guessed my animal, but I retorted it needed to guess my exact animal, not guess a series of animals.\n\n&amp;nbsp;\n\nFinally, it followed up with a few more questions to determine that I was thinking about a Zebra.\n\n&amp;nbsp;\n\nIt seems to me that somewhere in this conversation that ChatGpt:\n\n&amp;nbsp;\n\nA) Was able to play a game with me and began to understand the rules \n&amp;nbsp;\nB) Was able to alter its strategy after some feedback\n&amp;nbsp;\nC) Thought it had won the game\n&amp;nbsp;\nD) Overcame its inability to guess\n\n&amp;nbsp;\n\nWhat are your opinions?",
        "created_utc": 1673396645,
        "upvote_ratio": 1.0
    },
    {
        "title": "spirituality",
        "author": "Soren-II",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108nzs4/spirituality/",
        "text": "Is spirituality necessarily related to religion? Or can someone be atheist, spiritual, and believe that the spirit dies with the body, or is this just contradicting?",
        "created_utc": 1673391661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing a sympathetic villain in a story about creativity's conflicts with society. What should her reasonable point be?",
        "author": "Pyropeace",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108nwa7/writing_a_sympathetic_villain_in_a_story_about/",
        "text": "(Also posted in r/writing)   \nIt's a realistic near-future post-apocalyptic setting with \"superheroes\" (really just cyberpunk augments that run around in spandex) that explores themes of transhumanism, critique of capitalism, and the nature of freedom, especially related to creativity. I'm juggling a lot of ideas (too many to list in full), but I'm struggling to find a common thread to tie them together. Any suggestions?",
        "created_utc": 1673391456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you consider Dante's Inferno philosophy book ?",
        "author": "HighQualityDynamite",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108lz4c/would_you_consider_dantes_inferno_philosophy_book/",
        "text": "My friend was trying to convince me that its just a collection of poems with deep meaning . I argued that it was a book on philosophy . What are your thoughts ?",
        "created_utc": 1673387077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Ronald Dworkin think that there can be immoral laws?",
        "author": "Cunt-Bomb",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108lpmm/does_ronald_dworkin_think_that_there_can_be/",
        "text": "I'm a bit confused how Dworkin's anti-positivism relates to natural law theories like Thomas Aquinas. It seems obvious, at least to me, that there can be immoral laws. Or laws which do not reflect moral principles and are in conflict with them. Does Dworkin accept this? How does morality enter into his theory as far as determining what is and isn't the law?",
        "created_utc": 1673386464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analytic statements",
        "author": "Substantial_Rich_941",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108ku57/analytic_statements/",
        "text": "Do all analytic statements are based on purely logical relationships? My professor distinguished between formal (based on a logical relationship) and not formal analytic statements. I am interested in non formal analytic statements but I do not know what to read.",
        "created_utc": 1673384424,
        "upvote_ratio": 1.0
    },
    {
        "title": "College major",
        "author": "RonaldinhoTheBrazil",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108ksrv/college_major/",
        "text": "Accidentally posted this in r/philosophy til I saw it was meant to go here, apologies if you see this twice \n\nHello, over the past year I’ve gotten quite interested in philosophy and have read some of the works of Nietzsche, Camus , and Dostoevsky (if count philosophical fiction) and many excerpts from other philosophers \n     I graduated from high school about a year ago and wasn’t considering going to college as my gpa was terrible and I thought that it wasn’t worth the the money anyways. But now I found an academic topic that i actually enjoy (I’ve always enjoyed philosophical debate/ discussion) and am considering pursuing it in college, so I just want to ask some questions to the philosophy majors here , graduated or not \n\n1. What is the workload like and what types and authors of philosophical texts are you reading, and is it more analytic or continental?\n\n2. What can be done with a philosophy degree after college for work and is double majoring the better option?\n\n3. This may be a more niche question but considering my options are slim due to crashing my gpa in high school where in the east coast is a good place to study that doesn’t require an astonishing hit school record to get into\n\n-Grateful for any and all answers, Thank you!",
        "created_utc": 1673384348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of these editions of Aristotle should I get?",
        "author": "SpitFlame",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108kfbq/which_of_these_editions_of_aristotle_should_i_get/",
        "text": "I'm torn between the two-volume [Complete Works (Barnes)](https://www.amazon.com/Complete-Works-Aristotle-Vol-1/dp/069101650X/ref=sr_1_1?crid=1HPAPDH6VISM5&amp;keywords=aristotle+complete+works&amp;qid=1673383432&amp;s=books&amp;sprefix=aristotle+complete+work%2Cstripbooks-intl-ship%2C75&amp;sr=1-1) and the [Basic Works (McKeon)](https://www.amazon.com/Basic-Aristotle-Modern-Library-Classics/dp/0375757996). Both contain everything I intend to read. Which should I get?",
        "created_utc": 1673383466,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You can do as you will, but not will as you will\"",
        "author": "_Smooth-Criminal",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108kdq8/you_can_do_as_you_will_but_not_will_as_you_will/",
        "text": "The qoute is by Arthur Schopenhauer, it got me thinking is it truly possible to think independently?",
        "created_utc": 1673383356,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is non duality?",
        "author": "AppleBevom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108k9lt/what_is_non_duality/",
        "text": "What is non duality?\n\nI stumbled across a subreddit called r/AccidentalNonDuality or something like that. What exactly is non-duality? I heard its somehow connected to the Bhagavad Gita, but I dont understand what non-duality is and also how its connected to the Bhagavad Gita.",
        "created_utc": 1673383079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure this is the right place for this question",
        "author": "11thmog",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108k76n/not_sure_this_is_the_right_place_for_this_question/",
        "text": "If you were told that there was a machine that had a button that if pressed would save a life per button press? Would you accept the task of pressing this button for the rest of your life?",
        "created_utc": 1673382920,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you exist?",
        "author": "shoonyai",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108jqc0/do_you_exist/",
        "text": "",
        "created_utc": 1673381859,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Perfect Language",
        "author": "Morrowindchamp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108jp6r/a_perfect_language/",
        "text": "I would like to consider a Perfect Language as one consisting of infinite terms that map to the number line such that basic concepts adhere to the positions of primes and all other descriptors exist as composite numbers. I believe the sequence of these prime words would be convergent with the average ordering of Zipf's Law taken across all possible languages, assuming they also had infinite dictionaries. Is this a thing?",
        "created_utc": 1673381784,
        "upvote_ratio": 1.0
    },
    {
        "title": "could nietzsche liked christianity?",
        "author": "Assassin_Coke",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108hyq6/could_nietzsche_liked_christianity/",
        "text": " \n\ni read thus spoke zarathustra,Beyond good and evil a few times by now and started reading the will to power,and the more i read nietzsche works i get a feeling that he really loved the core concept of christianity but with time it got changed and became sickened,and this new and sickened christian values and morality was the target of nietzsche\\`s criticism.\n\ni think this is one of most famous saying of nietzsche\\`s work;\n\n&gt;\"God is dead. God remains dead. And we have killed him. How shall we comfort ourselves, the murderers of all murderers? What was holiest and mightiest of all that the world has yet owned has bled to death under our knives: who will wipe this blood off us? What water is there for us to clean ourselves? What festivals of atonement, what sacred games shall we have to invent? Is not the greatness of this deed too great for us? Must we ourselves not become gods simply to appear worthy of it? \"\n\n1.to God to die,God must had to be alive either literally or ideally,so to nietzsche there is or was God he didnt denied the existence of God.\n\n2.we killed God,how could we kill God?maybe by forgetting God or corrupting what God means and by that when we think about \"God\" we are actually thinking about something else.\n\n3.what nietzsche meant by \"God\" and \"gods\" ?\n\n&gt;\"God\":What was holiest and mightiest of all that the world has yet owned has bled to death under our knives\n\nto me \"God\" is the will to power :the holiest and mightiest of all that the world has yet owned.\n\nand by \"gods\" its about polytheism that there is multiple gods and each of them represents some values\n\nso \"God\"like in a monotheism its a value above all values and \"gods\" like in polytheism there is a lot of diferrent kind of values\n\nso the only way to find meaning to life was to go back to the core thing which is God,yet you cant find God anymore in modern christianity,so he must had to go back before christianity and explain what is God without using any mystical or religious language.",
        "created_utc": 1673377630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have there been any arguments by metaphysicians in the history of philosophy that it is specifically God that creates/is the reason for the world and not a lower principle?",
        "author": "-tehnik",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108hn5i/have_there_been_any_arguments_by_metaphysicians/",
        "text": "With maybe the exception of neoplatonism, there seems to be a running assumption (in the history of Western Philosophy) that the first cause is the cause of the world, rather than there being some intermediaries.\n\nI assume part of it has to do with the fact that pre-Avicenna cosmological arguments did actually invoke specific features of Aristotle's cosmology and metaphysics. Though, I'm not sure how much of a justification that is considering that gnostic systems, which existed in antiquity, had no trouble of conceiving lower principles as the causes of the world.\n\nAt any rate, after Avicenna comes in with a very general argument about the need for a necessary existent, it definitely seems like we can, in abstract, consider an arbitrary quantity of contingent beings that mediate God (the necessary existent) and the world. And this (the claim that there are no immaterial intermediaries and God caused the world directly) seems to cry out for an explanation.",
        "created_utc": 1673376849,
        "upvote_ratio": 0.99
    },
    {
        "title": "What are the arguments for vigilantism and retribution?",
        "author": "KpopAmbassador",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108hmkd/what_are_the_arguments_for_vigilantism_and/",
        "text": "Vigilantes, people who act outside of legal authority, are shamed or arrested because \"you don't stop a crime by becoming a criminal yourself\"\n\nThe same \"two wrongs don't make a right\" would be said to shame retribution\n\n\"If it is illegal or morally wrong for one person to do something, why would it be legal or morally right for a different person to do the same thing?\" \n\nWhat are the arguments against that?",
        "created_utc": 1673376811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good sources for Nietzsche and the analysis of strength",
        "author": "BostonJordan515",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108g2mq/good_sources_for_nietzsche_and_the_analysis_of/",
        "text": "Hello, I’m a college senior working on my undergraduate thesis for philosophy. My topic was going to be looking at Nietzsche’s quote of “what doesn’t kill you makes you stronger”. I wanted to start off by analyzing his intent and meaning for it. So what he means by “stronger”. And then I want to take his idea and then apply it to applicable scenarios in the world to see how true it really is. With this in mind, I’m looking to find any works by nietzsche or commentary on his work to garner insight into this. Thank you",
        "created_utc": 1673373106,
        "upvote_ratio": 1.0
    },
    {
        "title": "does universe being infinite in time even make sense?",
        "author": "mustyHead",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108ez5q/does_universe_being_infinite_in_time_even_make/",
        "text": "infinite time pre supposes there are infinite causes and effects. We are somewhere in this ,, infinity\" of cause and effects. There are infinite causes before us which time has to go through to get to us. But we already exist, which makes the argument absurd.\n\nlet's take the analogy of buckets of water. Suppose there is an infinite chain of kids passing a bucket of water to one another, you're somewhere in the center, the bucket can never come to you because it has to pass through infinite series of kids passing it around, yet you still have the bucket.",
        "created_utc": 1673370509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Foucault and Biopower",
        "author": "Mysterious_Attempt22",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108eutc/foucault_and_biopower/",
        "text": "Hello, I would like to learn more about Foucault's notions of biopower. Can anyone point me towards specific book(s) or better yet any specific compilation on this concept? I've read a good deal of Foucault, but as we know, there are a lot of books and not all things are treated specifically in one place, they are more themes.\n\nAnyway, I was wondering if an expert has better guidance for me.",
        "created_utc": 1673370218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Peirce's pragmaticism",
        "author": "Exolion0",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108eavj/peirces_pragmaticism/",
        "text": "Is Peirce's theory of meaning a sort of a proto-verificationistic theory of meaning?   \n\n\nI am thinking that the verificationists' theory of meaning is the more polished version of Peirce's theory of meaning.",
        "created_utc": 1673368888,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the relationship between science and religion develop during the enlightenment?",
        "author": "BritishBeserker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108d9z2/how_did_the_relationship_between_science_and/",
        "text": "",
        "created_utc": 1673366387,
        "upvote_ratio": 1.0
    },
    {
        "title": "book recs on philosophy of being honest?",
        "author": "megajk01",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108cye1/book_recs_on_philosophy_of_being_honest/",
        "text": "I'm looking for book recs basically. What does it mean to be honest with oneself? How can we know we're being honest? Which sort of gets into how can I know anything about myself at all. And if I manage to be honest with myself, then what does it mean to be honest with other people? Is there a struggle in being honest w/oneself and honest with others?  Just a few of the questions I've been thinking about, anything helps 🙏",
        "created_utc": 1673365555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a name for theories of consciousness which fall between brain-functionalism and panpsychism?",
        "author": "SevereReading9969",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108cty5/is_there_a_name_for_theories_of_consciousness/",
        "text": "I know brain-functionalism isn't necessarily a usual term itself, I'm just trying to refer to the default position that brains (or embodied nervous systems or whatever) are what are conscious. Due to whatever theory about intelligence or perception or self-awareness etc, homunculus or not. \n\nBut then pan literally means everything, right? Every physical entity. Or in neutral monism every whatever actually exists. I hope I'm making some sense.",
        "created_utc": 1673365236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aren't Mathematical Rules and Moral Rules categorically different?",
        "author": "TooDriven",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108bcin/arent_mathematical_rules_and_moral_rules/",
        "text": "A common argument in favor of Moral Realism that I read here often basically goes as follows: \n\n1. Mathematical rules are real and not merely made up by humans (mathematical realism). \n2. There is no relevant difference between mathematical and moral rules.\n3. Hence Moral rules are real as well (or both moral and mathematical rules are not real).\n\nI have a problem with part (2.) of the argument. Counter argument:\n\n1. Humans have evolved through mutation and selection as described in the theory of evolution (this is an axiom; if you disagree, we have to agree to disagree of course).\n2. Evolution works via natural selection, i.e. some traits benefitting reproductive success. \n3. (a) A living creature has a massive evolutionary advantage if it understands the actual (real) rules of the universe around it. (b) Conversely, making up your own imaginary rules that explain the universe is evolutionarily nonsensical or even detrimental.  (c) For example: Counting the members of your party or the mammoths left nearby or calculating the distance to a nearby river only makes sense if you follow the rules of the universe. If you falsely count 1+1=5 and think there are thus 5 rabbits  in total left to hunt, your family will starve and die.\n4. The foundations of mathematics are just that: humans' understanding of basic \"rules\" of the universe (e.g. 2+2=4). Our way of making sense of how the objective world around us actually works. (Limitation: Yes, this does of course not apply to every type of advanced mathematics, but I am talking about the very basic rules of everyday maths; more advanced rules are partly based on such basic rules and/or I am agnostic on whether they are real or not).\n5. Humans that lives in groups (that grow in size) have a massive evolutionary advantage if they have any sort of moral system that regulates their everyday conduct and interaction. This minimizes conflict and maximizes reproductive success (overall/on average).\n6. However, this evolutionary advantage (see 5.) exists *regardless* of whether these Moral Rules \"exist objectively\". Even if there was no real or objective normative judgment in the universe, having a set of moral rules that furthers peaceful coexistence in a group is an evolutionary advantage.\n7. To summarize: Discovering (basic) Mathematical rules only makes sense evolutionarily, if they reflect the actual rules of the universe, i.e. if they describe the world around us as it is (\"there are 2+3=5 rabbits left to hunt\"). But making up Moral rules makes sense evolutionarily *regardless* of whether they reflect the rules of the universe. \n8. Thus, Mathematical rules and Moral rules can be assumed to have a different evolutionary origin: The former were developed so we can understand the actual world around us, the latter to live and reproduce peacefully.\n9. Thus, Mathematical rules and Moral rules are fundamentally different, the existence of the former does not prove the existence of the latter.\n\nSo aren't Mathematical Rules and Moral Rules categorically different? If not, where do you disagree with my argument and why?",
        "created_utc": 1673361433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it really possible to not engage in idolatry?",
        "author": "Iconophilia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108b2c7/is_it_really_possible_to_not_engage_in_idolatry/",
        "text": "When someone worships a deity even without any material foci like statues or icons, they are still inevitably worshipping the concept of the deity that they have in their head i.e. their mental image of God. Unless one were to go the route of saying that the cognition of God is substantially the same as God, then they are still worshipping something other than God. My question is whether it's humanly possible to not do this?",
        "created_utc": 1673360674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone used Obsidian with success for self-study? And if so, how?",
        "author": "Eunoia_R",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108ag4s/has_anyone_used_obsidian_with_success_for/",
        "text": "Hi guys\n\nI recently started self-stuyding philosophy and in my quest to better retain the knowledge I gained, I stumbled on Obsidian and the world of zettelkasten/personal knowledge graphs. \n\nThe ideas and philosophy behind it look very promising and I'm very keen to get started with it, but when it comes to creating atomic notes from big ideas, I feel I'm getting stuck a bit.\n\nI started reading Plato's Apology and now I'm reading the Phaedo and I've been trying to figure out what the best way is to go about putting some of Socrates' core beliefs in notes.\n\nI started with a note on Socrates with some general information on his life but then wasn't sure how to go about putting his views, for example on the soul and death, in notes.\n\nIf there is anyone who is also self-studying and/or using Obsidian to map their philosophy journey I'd be really interested in hearing their approach or have some sort of example of their Obsidian graph.\n\nKind regards  \nRein",
        "created_utc": 1673359052,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some criticisms of Nonduality?",
        "author": "Tristan_Zara",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1089r1k/what_are_some_criticisms_of_nonduality/",
        "text": "Nonduality as described in Vedanta Hinduism and various Buddhist sects is all the rage. I would also refer to the mystical nondualism of Huxley, Rupert Spira and Ken Wilbur and Others.\n\nIt would seem it is a metaphysical position, have there been any serious critiques from a western perspective?",
        "created_utc": 1673357066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello",
        "author": "cshal420",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1089lir/hello/",
        "text": "I am 15 I recently started getting into philosophy because I want to really explore the different worldviews and perspectives of others. And I was wondering should I start in western or eastern philosophy?",
        "created_utc": 1673356615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Language Only a Means of Communication?",
        "author": "Otherwise-Quiet2222",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1089b63/is_language_only_a_means_of_communication/",
        "text": "",
        "created_utc": 1673355769,
        "upvote_ratio": 1.0
    },
    {
        "title": "How might one find purpose though optimistic existentialism?",
        "author": "MegaChaosBlast",
        "url": "https://www.reddit.com/r/askphilosophy/comments/108979y/how_might_one_find_purpose_though_optimistic/",
        "text": "How do you escape the nihilism that sets in from a lack of belief in destiny, fate, or the plan of a higher power? Besides the generic \"You are your own god, make your own meaning to life\" I find Egoism extremely unhelpful as well, looking for more nuanced answers that acknowledge one's impact on their environment, the potential harm or good one provides, finding the road self actualization, and interpersonal assessment. I've made a lot of poor decisions in my life, some impossible to rectify. I'm at the age where I need to stop wasting time on the past and find purpose in a world that seems to hold no purpose other than providing a temporary prison of meandering noise for it's inhabitants before their inevitable death.\n\nI've been trying to train my brain not to get fixated on the meaninglessness of it all. Has anyone taken steps to find purpose or meaning in an inherently arbitrary world and how did you go about it? I understand the journey is different for every person, I'm just curious about the process.",
        "created_utc": 1673355478,
        "upvote_ratio": 0.99
    },
    {
        "title": "Anne Marie Mol's \"Ontological Politics\"",
        "author": "Sir-Julsgaard",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10895uz/anne_marie_mols_ontological_politics/",
        "text": "When reading some of Mol's works i've had a hard time understanding certain concepts/ideas, I was hoping someone in r/askphilosophy might have some insight :) \n\nWhat idea/concept is Mol conveying in the quote below\n\n*\"Talking about reality as multiple depends on another set of metaphors. Not those of perspective and construction, but rather those of intervention and performance. These suggest a reality that is done and enacted rather than observed (Mol 1999, p. 77)\"*",
        "created_utc": 1673355353,
        "upvote_ratio": 1.0
    },
    {
        "title": "What percentage of your resources should go to others?",
        "author": "BlueSea9357",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1088thy/what_percentage_of_your_resources_should_go_to/",
        "text": "There are always people in need. In addition, there’s the next generation to think about. Raising the next generation is expensive. What percentage of everyone’s stuff should go to them?",
        "created_utc": 1673354267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this refute the companion in guilt argument against error theory ?",
        "author": "Jumpy-Flan-9591",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1088rz2/does_this_refute_the_companion_in_guilt_argument/",
        "text": "(1) According to the moral error theory, there are no categorical normative rea-\nsons.\n(2) If there are no categorical normative reasons, then there are no epistemic \nreasons for belief. \n(3) But there are epistemic reasons for belief.\n(4) So there are categorical normative reasons (2, 3).\n(5) So the error theory is false (1, 4) \n\nWe can undermine (2) by establishing ER and CNR on different grounding. \n\nER= Epistemic Reasons\nCNR= Categorical Normative Reasons \n\n(A) ER are reducible, CNR are irreducible. We can analyze and define coherence, consistency etc in terms of the relationship between concepts but the same cannot be said about CNR. You cannot analyze \"good\" or \"bad\" structurally, this makes them weird. \n\n(B) ER can easily be applied to our beliefs/knowledge and it yields useful results, i.e we can determine the strength and weaknesses of a system. To give an example, it is easy to apply the criterion of consistency to a web of beliefs. There is an inbuilt rule or procedure to use ER ( with slight variation ). This is entirely absent in CNR, instead, we have to construct rules or procedures around them. This makes them twice weird. \n\nFinal blow to the argument. The question ( or the statement if rephrased) , If CNR don't exist, why should ER exist ? requires ER. It's akin to asking, why should we be rational ? It answers itself. And if you don't assume ER in the background, we don't need to answer the question or give a response to the statement",
        "created_utc": 1673354133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do theorists like Judith Butler hate the idea of biological differences between sexes?",
        "author": "zordmorgo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1088ofs/do_theorists_like_judith_butler_hate_the_idea_of/",
        "text": "She thinks that sex and gender is mainly social construct which is a laughable statement. I don't think she just denies biology. I think she hates the idea that there are biological differences between sexes. I don't see how a feminist or a transactivist don't want to accept that women are different. It's hilarous.",
        "created_utc": 1673353825,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is forever?",
        "author": "dewindewin",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1088ljz/what_is_forever/",
        "text": "What are things that without interference can last forever?",
        "created_utc": 1673353571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is Jackson Kiddard?",
        "author": "AkiraKareem",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1088gth/who_is_jackson_kiddard/",
        "text": "I have seen this guy quoted a bunch, usually in religious groups or philosophy. \nApparently from France and died 1901, but I can't seem to find any other information on his life or his writing or where (if anywhere) these quotes (or poems really) are coming from.\n\nAny help would be appreciated, cheers.",
        "created_utc": 1673353150,
        "upvote_ratio": 1.0
    },
    {
        "title": "What were Aristotle’s cosmogonical beliefs?",
        "author": "throwawayyyuhh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1086bru/what_were_aristotles_cosmogonical_beliefs/",
        "text": "",
        "created_utc": 1673345599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Platonic aesthetic criticisms of modern media?",
        "author": "kiefer-reddit",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1085eq2/platonic_aesthetic_criticisms_of_modern_media/",
        "text": "I am looking for any philosophers criticized modern art, film, literature, etc. from a Plato-based aesthetic perspective. \n\nIt seems uncontroversial to me to say that most contemporary TV shows on Netflix/HBO/etc. are primarily designed to be entertaining and *not* to instill any sort of moral values. This results in scenarios like the Netflix Dahmer series (or the inevitable Idaho series) becoming cultural phenomena, attracting more attention to and sympathy for the individuals which ostensibly did unethical things. Ditto for nearly every other popular series, ranging from Breaking Bad to The Wire.\n\n\nCan you recommend any philosophers that argue that modern entertainment should aim to create ethical role models for citizens to follow? Especially in the mimetic sense.",
        "created_utc": 1673341998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does free will exist?",
        "author": "According_Boss8421",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10853lf/does_free_will_exist/",
        "text": "Once again this question with another argument. \n\nAs we are the product of our memories, to me it seems free will might not be possible. The reason is that the whole idea of being able to choose something at all already is not in our influence, because we have not created the universe as it is. Moreover also the choices we make are within the principle of sufficient reason, we will always have a reason to choose one thing over another. Because if we would just choose something without reason that would be dangerous from an evolutionary perspective in that this leads to a misfit with our environment and consequently our live is in danger. \n\n**So,**\n\n1. **the fact that we have something to choose at all is given because the universe is, which we cannot change apparently;**\n2. **and our actual choices are based on short-term (consciousness), long-term and \"evolutionary\" (genetic; subconsciousness) memory,** \n\n**means we might not have free will, because what else is free will then choosing independent of causality? Or I might be wrong?**",
        "created_utc": 1673340846,
        "upvote_ratio": 1.0
    },
    {
        "title": "“You can also look upon our life as an episode unprofitably disturbing the blessed calm of nothingness.”",
        "author": "ProfessionalAd7023",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1084rnb/you_can_also_look_upon_our_life_as_an_episode/",
        "text": "Please explain this quote by Arthur Schopenhaeur . What does blessed calm of nothingness mean ? And what does unprofitable disturbing mean here ?",
        "created_utc": 1673339539,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do error theorists find problematic about irreducibly normative reasons?",
        "author": "AManWithoutQualities",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1082623/what_do_error_theorists_find_problematic_about/",
        "text": "I’m reading Jonas Olson’s Moral Error Theory: History, Critique, Defence, which clarifies Mackie’s queerness argument as about moral properties implying irreducibly normative reasons. But I’m not sure I quite understand why irreducibly normative reasons would be queer or generally philosophically undesirable. Let’s say there is a moral property attached to the sentence “murder is wrong”, and it’s bindingly normative, and that property is irreducible to anything else. So what? Isn’t that just what morality is? Why would an error theorist believe this a reason to reject the existence of moral properties?",
        "created_utc": 1673330271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does perdurantism contradict personal identity over time",
        "author": "AD2139",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10821sb/does_perdurantism_contradict_personal_identity/",
        "text": "Like if perdurantism is true, does this mean that the “I” of this moment won’t go on to experience the future?",
        "created_utc": 1673329866,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you say are required readings from the Enlightenment era?",
        "author": "DarthOptimistic",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1081bm2/what_would_you_say_are_required_readings_from_the/",
        "text": "",
        "created_utc": 1673327525,
        "upvote_ratio": 1.0
    },
    {
        "title": "If hell exists, is it/would it be portable?",
        "author": "aldarith",
        "url": "https://www.reddit.com/r/askphilosophy/comments/1080vw3/if_hell_exists_is_itwould_it_be_portable/",
        "text": "",
        "created_utc": 1673326187,
        "upvote_ratio": 1.0
    },
    {
        "title": "According to Sartre, are human desires a facticity?",
        "author": "No_Zookeepergame2330",
        "url": "https://www.reddit.com/r/askphilosophy/comments/10809zp/according_to_sartre_are_human_desires_a_facticity/",
        "text": "According to Sartre, are human desires a facticity? \n\nSartre's person on a hiking trip example seems to suggest that the sense of fatigue that the hiker experiences is a facticity - but then he also doesn't believe in human nature, so how could this desire to just collapse to the ground be a facticity of consciousness? If this is a facticity, then wouldn't this contradict his claim that there is no human nature?",
        "created_utc": 1673324352,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to read next",
        "author": "siickandt1red",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107zszj/what_to_read_next/",
        "text": "I currently have the Five Dialogues (Euthyphro, Apology, Crito, Meno and Phaedo) and Republic by Plato and was wondering if there are any other important dialogues I may need to read.\n\nI was considering the Complete Works of Plato but I’m not sure if the other dialogues included in it would be worth the price.\n\nIf anyone could give a suggestion on what to read/buy next that would be great, thanks!",
        "created_utc": 1673322980,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good meta-description of the relationship between evolution, life, nutritional requirements, planets, galaxies, and universes?",
        "author": "krablemo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107z16g/what_is_a_good_metadescription_of_the/",
        "text": "What does our dependency on the intake of certain organic substances say about our relationship with the physical universe that is generally taken for granted?",
        "created_utc": 1673320734,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Locke arrive to his personal identity theory; continuity of consciousness as supported by memory?",
        "author": "Qahshak",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107ynhh/how_does_locke_arrive_to_his_personal_identity/",
        "text": "From reading Locke’s essay on personal identity, I don’t really understand how he arrives to his theory that one’s self is having the same consciousness as one did prior, as supported by one’s memory of a past self. \n\nIt seems he asserts it in section 9, then just gives examples to illustrate this point further: little finger, the prince and the cobbler, etc. Does he do do anything to arrive to his theory, or is it really just an assertion backed with examples?\n\nIn the SEP page, they write that it was just an assertion with examples, but surely there’s something there as to why he believed his theory in the first place? Or is it just an intuitively found theory that is then reinforced, so to speak.\n\nThanks,",
        "created_utc": 1673319659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Johann Wolfgang von Goethe Quote",
        "author": "poopoopeepeekek00",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107yhqi/johann_wolfgang_von_goethe_quote/",
        "text": "What does this quote mean?\n\nThe affairs of the world are no more than so much trickery, and **a man who toils for money or honor or whatever else in deference to the wishes of others, rather than because his own desire or needs lead him to do so, will always be a fool.**",
        "created_utc": 1673319230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the right to not be offended (psychologically harmed?) supersede academic freedom? ( Hamline University case)",
        "author": "Celebration_151",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107wft2/does_the_right_to_not_be_offended_psychologically/",
        "text": "[removed]",
        "created_utc": 1673313662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where did the idea of control come from?",
        "author": "Naive_Programmer_232",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107vun3/where_did_the_idea_of_control_come_from/",
        "text": "I’m a programmer coming from computer science. I love to ask questions. \n\nControl is central to a program as well as abstraction in computing. Abstraction is a fundamental hierarchical concern. And it turns out a lot of the ideas such as inheritance tie back to other sciences, go figure.\n\nBut even in the design of curriculums, it seems like similar ideas exist. It got me thinking about religion and existential thought. \n\nIt seems like this idea of something else controlling us whether it’s nature, some religious being, or a random process, it’s there. And that same idea of control exists in the form of controlled experiments which the sciences deal with. \n\nUncontrolled experiments exist it seems, just look at us using this social media app and affecting our natural behavior. \n\nNonetheless, my question revolves are the core, who created this idea of control? Where did we get this? Is there other ideas in philosophy that do not surround about it? Got any references? \n\nWe keep being told to “think differently”, it doesn’t seem possible if control is exhibited, isn’t that what Pavlovian conditioning was? That we could take a mammal, like us, and train it into a behavior? How do we break that cycle? Can we break that cycle?",
        "created_utc": 1673312124,
        "upvote_ratio": 1.0
    },
    {
        "title": "For what reason do we punish people, particularly in the legal sense?",
        "author": "ApathyOfTime",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107v7u1/for_what_reason_do_we_punish_people_particularly/",
        "text": "I’m starting to doubt how necessary punishment really is when it comes to crime. Obvious there are practical concerns like removing people who are threats to society, but I can’t think of a good justification for prison time other than that. \n\nIt doesn’t seem like a great deterrence, because most people who commit crimes are aware that what they’re doing is bad and will land them prison time, and most *good* citizens aren’t good because of the laws we have, but rather because of the moral system they believe in (whether or not they’re aware of said system). \n\nAnd it seems rather arbitrary and unintuitive to view prison time as some sort of “cost” that a criminal must fulfill. What actual argument is there that prison time is what a criminal “deserves”? Especially if you could instead rehabilitate this criminal and let them be a productive member of society instead of an unproductive prisoner in a cell.",
        "created_utc": 1673310428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does somebody have resources for someone who is afraid of death because they believe there is nothing afterwards, and cannot comprehend the idea of it?",
        "author": "Local_Surround8686",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107uq72/does_somebody_have_resources_for_someone_who_is/",
        "text": "Like does anyone have any texts they would recommend?",
        "created_utc": 1673309167,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Are Some Of Ibn Tufail’s Ideas",
        "author": "GYUIKG7893",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107ugf7/what_are_some_of_ibn_tufails_ideas/",
        "text": "I tried to research Ibn Tufail's Ideas and couldn't find anything online. Could anyone tell me some of Ibn Tufail's ideas?",
        "created_utc": 1673308506,
        "upvote_ratio": 1.0
    },
    {
        "title": "My teacher called me baby and I loved it..?",
        "author": "ChungYungMing",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107ubzp/my_teacher_called_me_baby_and_i_loved_it/",
        "text": "[removed]",
        "created_utc": 1673308191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is reading &amp; understanding German Idealism enough to get Western Philosophy?",
        "author": "martialarts4ever",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107qwlv/is_reading_understanding_german_idealism_enough/",
        "text": "German Idealism is really one of the biggest schools in Western tradition, if not the biggest.\n\nIs focusing and studying German Idealism (particularly Hegel and Kant) with secondary literature and interpretations and so on -Is it enough (without indepth expositions to other western schools) to get a sound understanding on Western philosophy before and after it?\n\nTo rephrase the question: Assuming a reader from another philosophical tradition would like to understand a Western system for Comparative purposes, would you say GI is *The* System that would best present Western thought inclusively?\n\nIf thats the case, is it really about German Idealism, or only Kant and Hegel in particular? I.g., how important are Fichte and Scheiling?",
        "created_utc": 1673300350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any philosophers with technical backgrounds that discuss the complications of AI in creative spaces?",
        "author": "quantumfucker",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107qqew/are_there_any_philosophers_with_technical/",
        "text": "This has been a very controversial area with a lot of debate recently, and much of it seems to involve misunderstandings and mischaracterizations of AI. Some call it an independent entity from an operating human, some refer to it as having its own mind, some say the reliance on past experiences necessitates theft, etc. I’m looking for sources or writers that may provide a way to ground the technical designs of AI in some kind of philosophical or ethical framework. I work in the field as an engineer, so I’d be interested in seeing if there’s been attempts to bridge technical procedures to more abstract principles.",
        "created_utc": 1673299953,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an enigma of life?",
        "author": "JourneyTraveler",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107qnk1/what_is_an_enigma_of_life/",
        "text": "Simple, explain.",
        "created_utc": 1673299787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why people do this in arguments?",
        "author": "bedOclock",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107qj3u/why_people_do_this_in_arguments/",
        "text": "Humans by nature tend to defend their ideas and beliefs, in any means necessary, going as far as insults, misinformation or mind games, to trick or degrade the counter-arguments coming from their adversary, and they do this for various reasons, these reasons can range from social to psychological, as an example cognitive dissonance, where, as Matt Johnson defined it as a natural drive for consistency, where our beliefs aligns perfectly with our actions. This influence us to go into a state of denial whenever our beliefs are challenged, that can be commonly seen in political debates, and religious debates, they start throwing insults or misinterpreting whatever you say.\nSimply, what is the philosophy behind this? Why humans do this?\n\n**Sorry for any problems with my english, I'm not a native speaker**",
        "created_utc": 1673299500,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's Hegel's influence on Modernity?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107q8o3/whats_hegels_influence_on_modernity/",
        "text": "I've always heard that Hegel is one of the founders of western Modernity, at least in the intellectual side of it. I've heard that said by both friends and foes of Hegel.\n\nSo, I was wondering: What is the exact influence of Hegel over Modernity?",
        "created_utc": 1673298864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Historical materialism contradictions",
        "author": "FormalEast1850",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107q3z8/historical_materialism_contradictions/",
        "text": "Hello everyone ! \n\nI encountered a contradiction in my thought system so I have a bunch of questions to ask.\n\nHere’s what I understood : The materialism is opposed to idealism and states that it is not the ideas that lead the world, but it is the organisation of the economy and of the means of production. We can illustrate this by this quote of Spinoza : « True knowledge of good and evil cannot repress any affect insofar as it is true knowledge, but only insofar as it is considered an affect. » It seems legit as it isn’t enough to know that smoking is bad to quit smoking.\nI also believe that only matter exist because of zététique arguments.\nAll this can be summed up by the fact that it is the infrastructure (economy) that determines the superstructure (ideology)\n\nBut I also know this quote from Marx : « An idea that seizes the masses becomes a material force »\nHere are my questions :\n-What is the role of an intellectual in the class strugle ? Can we say that Marx's ideas were not considered good by the people because they were good, but that they were good because the people liked them ? In the same way that Spinoza says that it is not because something is good that it makes us happy, but it is good because it makes us happy. I think it would be linked with Feyerabend, Kuhn or Latour ideas then. \n-Yugoslavia or ancient Greece aren’t counterexamples of historical materialism ? Indeed, Yugoslavia’s infrastructure was communist and workers' self-management, but, the fall of Yugoslavia happened because of the racist superstructure, this manifesting itself in ethnic wars. Ancient greece infrastructure wasn’t capitalist, but slavery did exist in Ancient Greece. \n\nThanks a lot for your answers ! I am still in an early stage for my understanding of marxism or philosophy in general, and english isn’t my language, so sorry if i made mistakes !",
        "created_utc": 1673298577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we need to start with Dasein in order to grasp the sense of Being ?",
        "author": "NoLoveDeepWeb38",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107p5u6/why_do_we_need_to_start_with_dasein_in_order_to/",
        "text": "",
        "created_utc": 1673296444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a somewhat logical way to cope with uncertainty about certain existential dreads.",
        "author": "Dojyaaa---n",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107ovwe/is_this_a_somewhat_logical_way_to_cope_with/",
        "text": "First of all sry but im a complete philosophy noob but i would like to start getting into it, whatever that may mean but thats unrelated. Let's say i believe in solipsism because there is no definite proof against it, which i dont really but still concept of it being  possible is somewhat gnawing at my mind. If i now believe that there may be an existance which is the opposite of solipsism, or something that cancels out solipsism what exactly that may be, again, there is no definite  proof against it, would it be logical to come to the conclusion that because both of these things dont have a definite proof that its just as likely that im not experiencing solipsism as it is likely.",
        "created_utc": 1673295830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is concepts of right and wrong so fickle?",
        "author": "PlayRevolutionary344",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107ol3d/why_is_concepts_of_right_and_wrong_so_fickle/",
        "text": "Like it's OK to do something  in one situation  but not in another ....\n\nEg. It's generally accepted to be wrong  to abuse animals  but it's  generally  acceptable  to kill them for meat or It's fine to torture them for  science\n\nNot a vegetarian  debate  BTW but  easiest example to think of ..\n\nBut idk ...its wrong  and horrific  for someone to murder someone and that deserves a life sentence but solders  are applauded  as hero's even if they murder and even this its dismissed as a necessity of war , even though there is non lethal  combat.\n\nIt's okay to have sex for free or for love  with someone...but if you have sex for money or lust thats wrong. \n\nOr ivf  it's a baby but stem cell research or abortion it's cells....\n\nIs there any idk psychology  or philosophy articles that cover  this sort of thing and why",
        "created_utc": 1673295149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Hegel a Philosopher of Jigsaw Puzzle?",
        "author": "awholeplateofpizza",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107oeau/is_hegel_a_philosopher_of_jigsaw_puzzle/",
        "text": "Hi!\n\nI have to admit beforehand that I have never read Hegel, but I'm quite intrigued by him and his notorierity. I only grasp a little about him from hearing about other people talking about Hegel. I know my knowledge of him is utterly deficient. But from what I get is, as if you need to \"revamp\" your logic if you want to truly understand him is what I'm getting from numerous people talking about him. Also I don't know whether the thesis, antithesis, synthesis part is true or not anymore, so many people said as if its his idea, many people object, etc.\n\nAnyway, back on my main topic, I'm interested especially on his concepts of determination, negation, and \"whole\" which leads me to think of a jigsaw puzzle whenever I try to think like \"Hegel\". Well of course this is also based on intuiting about what people who disagree with Hegel said, such as Deleuze. Oh yeah, also the concept of internal relations or relations as a constitution of the thing. The way I see it is that Hegel's ontology is perhaps one of its kind. Instead of listing all the \"positive\" properties of an object in order to describe it, Hegel is truly a philosopher of \"negativity\". Spelling out positive properties is not enough, we need also to spell out hwat the object is \"not\".\n\nTruly reminds me of a jigsaw puzzle. Imagine that you are almost completing a jigsaw puzzle. It is a jigsaw puzzle about anthropomorphic bears on a picnic near a big tree with tables, and so on. The puzzle is almost completed, the only missing piece has an apple printed on it. Should we say that the missing piece is the \"apple piece\", or is it what is \"not\" the other pieces? Hegel argued that the truth is in the whole. I heard someone said that for Hegel, truth is not merely constituted by truth, but false propositions are in themselves moments of truth. You cannot just pick out the true (positive) while ditching out the false (negative) because truth itself is determined by what is false.\n\nI might overcomplicate things but yeah, basically Hegel makes you think of reality as a jigsaw puzzle, as opposed to a vacuum which is being filled with \"things\" and it is utterly inconsequential whether one or two things are missing. For a jigsaw puzzle, of course, a missing piece always matters.",
        "created_utc": 1673294727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being you own best freind?",
        "author": "stympkins",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107n65j/being_you_own_best_freind/",
        "text": "Hey guys. First time poster so I'm going to try to be as concise as I can. Also - english is my second language so apologies, in advance, if there are some grammar errors.\n\nI stumbled upon a insta post about this guy who's lived as a buddhist monk for x number of years and he shared his key learnings. \nAlot of them feels like classic carpe diem quotes but on really stuck with me:\n\n\"The biggest life hack is becoming you own best freind. Everything is easier when you do.\"\n\nIt got me pondering and thinking what that actually means. I think I now what a best freind is and what to expect from one but I can't fully comprehend how I can become my own best freind. I mean - I enjoy time with myself, abit of a loner (although having a family). I do suffer from a procrastinating behavior and I have mild tendencies towards depression from now and again. Does that have something to do with this statement? That I'm not my own best freind because of some sort of self reluctance when I'm procrastinating? \nAnd how would one become ones own best freind?\n\nHope this is the right forum since I think the questions are somewhat philosophical..\n\nAnyways. Take care.",
        "created_utc": 1673291958,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do other Philosophers think of Nussbaum's defining eudaimonia as \"self-flourishing?\"",
        "author": "Monovfox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107mj2w/what_do_other_philosophers_think_of_nussbaums/",
        "text": "Nussbaum, in her work, typically defines eudaimonia as \"self-flourishing.\"\n\nHow do other Philosophers and classicists feel about her definition/translation of the term? I have yet to see other people define the term this way, but u have also seen no one critique nussbaum's use of said term.",
        "created_utc": 1673290516,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best translation of The Prince by Machiavelli",
        "author": "Satansmiddlechild",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107lnd7/what_is_the_best_translation_of_the_prince_by/",
        "text": "I got the translation by Harvey Mansfield is that good enough?",
        "created_utc": 1673288511,
        "upvote_ratio": 1.0
    },
    {
        "title": "the nature of morality",
        "author": "sia_q",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107lhe6/the_nature_of_morality/",
        "text": "Do you believe morality is objective?",
        "created_utc": 1673288142,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between an intellectual life and a spiritual life?",
        "author": "icansitstill",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107l3pi/what_is_the_difference_between_an_intellectual/",
        "text": "Can they be the same?",
        "created_utc": 1673287274,
        "upvote_ratio": 1.0
    },
    {
        "title": "More details about deism",
        "author": "Arivanzel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107kwv3/more_details_about_deism/",
        "text": "",
        "created_utc": 1673286852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any criticisms of Hume's \"Reasons is, and ought only to be slave to the passions\"?",
        "author": "ItsukaKitto",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107knr5/are_there_any_criticisms_of_humes_reasons_is_and/",
        "text": "[removed]",
        "created_utc": 1673286265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any criticisms of Hume's “reason is, and ought only to be the slave of the passions”?",
        "author": "Itsuka_Kitto",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107kba5/are_there_any_criticisms_of_humes_reason_is_and/",
        "text": "[removed]",
        "created_utc": 1673285463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ladyman and OSR and anthropology",
        "author": "spamalotsss",
        "url": "https://www.reddit.com/r/askphilosophy/comments/107jtrf/ladyman_and_osr_and_anthropology/",
        "text": "I'm wondering generally about the limits of OSR (at least as I know it, which is mostly readings of Dennett and Ladyman).  I'm having trouble seeing how Ladyman's vision of the project doesn't fall into antropology (I'm using 'fall' here ambivalently, because he seems to welcome anthropology in some of his comments, and yet he also seems to want to keep distant from it).  Ladyman speaks of the motivating force behind pattern recognition as resultign from the necessity of dealing with medium-sized dry goods in the everyday world in a competitive manner (to benefit the individual/species in a Darwinian sense).   The apprehension of pattern within noise (particularly in the behavioral sciences) is clearly dependent on culture/tradition, and I think irreducibly so, so how does OSR for Ladyman not descend into a faceted game of competing 'sciences' which one can choose among according to  preference (at least for the sciences that are not founded on mathematics)?  And then on the other side of the coin, wouldn't there be some positiive work to be done towards uncovering some foundational structures of pattern recognition across disciplines in order to better understand pattern recognition.  After all, it is absolutely foundational to all science, it would seem.  So there is a tension  between  mathematical explanation on the one hand, and a foundational study of pattern recognition (as discussed here) on the other.   I don't know what to make of this.  I can't see how the latter can reduce to the former.",
        "created_utc": 1673284365,
        "upvote_ratio": 1.0
    }
]