[
    {
        "title": "Help with Kant",
        "author": "totalityof_facts",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zaid3r/help_with_kant/",
        "text": "I read Kant's Prolegomena a few months ago. I need to revise it for an interview and was wondering if I could have a really basic summary of How Natural Science is Possible and then how Kant expands that to metaphysics? (I understand the discussion of mathematics.) Thanks in advance hopefully?...",
        "created_utc": 1669977305,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I do some deep introspection?",
        "author": "ELLENRAPELEY2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zahdaz/how_can_i_do_some_deep_introspection/",
        "text": "",
        "created_utc": 1669974346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logical fallacy in asking permission",
        "author": "Few_Possibility1961",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zagn0m/logical_fallacy_in_asking_permission/",
        "text": "This idea has been driving me crazy for so long, and it’s only now that I’m away from it all that I feel safe asking this question.\n\nFirst of all, I have a bad habit called taking the initiative. When I see something needed to be done or a role to fill I see it as a chance to get it done. However in all of my cases this has ended with people becoming horrifyingly enraged or thinking I’m mentally unfit for society, all of them saying I need permission from them to do that something.\n\nThe problem I propose to you is this: whose permission do I ask to ask permission? It creates an endless loop of anxiety and I feel out of the loop on nearly everything, causing me to miss basic social cues and “completely lack any common sense whatsoever.”\n\nI speak generally because I can’t think of a single time where I was allowed to take the initiative on something and had to ask someone else, but I never felt that confidence to even ask them because in the past they would become angry at me even questioning if I was allowed to do something.\n\nI want to serve the people as best I can, so if I need to ask permission to have the most basic interaction, who do I ask for permission?",
        "created_utc": 1669971802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do meaningless statements really exist ?",
        "author": "Jumpy-Flan-9591",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zaesml/do_meaningless_statements_really_exist/",
        "text": "Take the following statement \"djwud48je\". Can its meaning consist of us not giving it any meaning. Infact, it's an example of nonsense, a good example. It is a meaningful statement in our discourse if we look at it's use, though it doesn't have any meaning in of itself removed from our discourse. The same is true of common examples we give like \"square circles\". Actually, it doesn't take a lot of imagination to think of a world where an object may appear as a circle and as a square to two different groups of people, who eventually come together and agree to call it a square circle but l digress. \n\nBut can we give meaning to any statement out of context, removed from conversation, in a void? Even 1+1=2 assumes a shared understanding of addition and numbers. It makes no sense to speak of meaning without mentioning the speakers intent and the shared understanding of the community. \n\nOn further reconsideration, it's impossible to analyze a statement without a surrounding discourse. Language doesn't allow us to carry such an activity, anymore than you can place a physical object outside of space.",
        "created_utc": 1669965490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books on the problem of other minds",
        "author": "quoththeraven1990",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zadm4m/good_books_on_the_problem_of_other_minds/",
        "text": "I’m looking for some good books that delve into the problem of other minds issue and the idea of different phenomenological experiences. Any and all recommendations appreciated!",
        "created_utc": 1669961671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever experienced anything that was Occult in nature?",
        "author": "styp3r",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zadj6x/have_you_ever_experienced_anything_that_was/",
        "text": "",
        "created_utc": 1669961412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Great philosopher created arguement to justify about abolish age of consent?",
        "author": "Only_Feedback_6049",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zab5hl/can_great_philosopher_created_arguement_to/",
        "text": "i think moral relativism, and ultilitatrian can be justify this\n\nyou think can created philosopher justify something like pedophile?",
        "created_utc": 1669954784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most important chapter in Simulacra and Simulation?",
        "author": "r_furey",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zaa9dw/most_important_chapter_in_simulacra_and_simulation/",
        "text": "I'm writing an essay on reification and spectacle in relation to capitalist  reproduction for a class and wanted to incorporate Baudrillard. I  eventually want to read all of Simulacra and Simulation but since my  paper is due soon, I was wondering was is the most critical chapter in  understanding hyperreality?",
        "created_utc": 1669952474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since humans are imperfect beings, does that mean our potential for improvement is infinite?",
        "author": "ShadyPeixe",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za88py/since_humans_are_imperfect_beings_does_that_mean/",
        "text": "",
        "created_utc": 1669947592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is incest in and of itself unethical?",
        "author": "Brave_Ad_8263",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za6ygf/is_incest_in_and_of_itself_unethical/",
        "text": "[removed]",
        "created_utc": 1669944579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Responses to Susan Wolf's test case of Sisyphus against subjectivism",
        "author": "Komb8",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za5e01/responses_to_susan_wolfs_test_case_of_sisyphus/",
        "text": "I intuitively side with a subjectivist account of meaning, and upon reading Wolf, I have found it hard to think of a way to respond to her test case of Sisyphus.\n\nWhat are some responses to Susan Wolf's test case of Sisyphus? Or are there any related articles/papers to do with problem?",
        "created_utc": 1669940907,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the balance between cynicism and idealism called? Bravery is the balance between the extremes of foolhardiness and cowardice.",
        "author": "stop_lying_good_god",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za4xr0/what_is_the_balance_between_cynicism_and_idealism/",
        "text": "So, what's between cynicism and idealism?",
        "created_utc": 1669939853,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does a Kantian view on ethics say about thoughts and desires?",
        "author": "Nitroade24h",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za2ztr/what_does_a_kantian_view_on_ethics_say_about/",
        "text": "I've been reading about Kantian ethics and read about how Kant puts more moral value on doing good acts in reverence of the law rather than desire, so I thought about if it is morally right for one to desire for other people to experience happiness. It seems intuitive that this is morally right but the categorical imperative does not appear to work for actions without consequences.\n\nFurthermore, I can't think of a reason using the categorical imperative why thinking about killing someone and enjoying it would be wrong.\n\nHow would a Kantian ethicist respond to these issues?",
        "created_utc": 1669935506,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does Albert Camus mean by \"The contrary of suicide, in fact, is the man condemned to death\" ???",
        "author": "Traditional_Ask1856",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za2tq6/what_does_albert_camus_mean_by_the_contrary_of/",
        "text": "I see this quote two ways. The clear difference between the two is that suicide is in the person's hands and being condemned to death is out of them. But aren't they similar in the fact that both are devoid of hope? or is there hope in suicide? hope in something more (a true meaning to life)?",
        "created_utc": 1669935138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any arguments that different moral theories are/n't even talking about the same kind of morality/ought?",
        "author": "Tioben",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za2mvf/are_there_any_arguments_that_different_moral/",
        "text": "Someone recently asked if there were other kinds of oughts, and the answers included, e.g., epistemological oughts.\n\nIf there are already other kinds of oughts, is anyone debating whether (e.g.) utilitarianism, deontology, and virtue ethics are talking about the same kind of ought in the first place?\n\nI know there are pluralist theories of morality, e.g., plural goods or plural virtues, but do any of those theories argue that other moral theories aren't even managing to talk about the same thing when their term \"morality\" refers out?  They all want to explain why we ought to not torture babies, but what if there are several kinds of oughts for not torturing babies and they are each explaining a different one?",
        "created_utc": 1669934729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Logical fallacy for picking an option despite knowing the correct option is not present ?",
        "author": "revofex",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za2mt2/logical_fallacy_for_picking_an_option_despite/",
        "text": "Is there a name for such fallacy? I saw this expressed in a twitter poll for 2+2x4 and the correct answer wasn't even in the poll. I realized this somewhat seems to be the case with political elections.",
        "created_utc": 1669934725,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is Hegel doing in \"self consciousness\" (chapter IV) of the phenomenon of spirit ?",
        "author": "Secure_Lavishness959",
        "url": "https://www.reddit.com/r/askphilosophy/comments/za0bux/what_is_hegel_doing_in_self_consciousness_chapter/",
        "text": "can someone give me a very brief of his overall target for this section?\n\nI want to understand how this section worked as a bridge between understanding to reason, it's position in this book, not some exegesis focus on \"recognizing\"/master and salve dialectic(formally I learnt that part before, I just don't understand how it contributes to this section, this book).\n\nMy problem directly start with its intro, paragraph172 - 177\n\n`It is the simple genus, which in the movement of life itself does not exist for`\n\n`itself as this simple. Rather, in this result, life points towards something other`\n\n`than itself, namely, towards consciousness, for which life is as this unity, or`\n\n`as genus.`\n\nI literally can't understand what is genus and how life's relation to it, the last sentence is pure non-sense. Please kindly help me if you have worked on this section. Thank you!",
        "created_utc": 1669929945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of the three definitions of justice in Book I of Plato The Republic—those of Cephalus, Polemarchus, and Thrasymachus—do you find most persuasive and why?",
        "author": "an88820",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9zc6e/which_of_the_three_definitions_of_justice_in_book/",
        "text": "",
        "created_utc": 1669927844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of the three definitions of justice in Book I—those of Cephalus, Polemarchus, and Thrasymachus—do you find most persuasive and why?",
        "author": "an88820",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9zb4y/which_of_the_three_definitions_of_justice_in_book/",
        "text": "",
        "created_utc": 1669927777,
        "upvote_ratio": 1.0
    },
    {
        "title": "reading the Myth of Sisyphus for the first time .. any suggestions for books to provide some context?",
        "author": "johnjeudiTitor",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9ytmw/reading_the_myth_of_sisyphus_for_the_first_time/",
        "text": " think i may need to read some earlier philosophy that will kind of provide a basis for this because i gotta be honest,, im lost in the sea\n\nCamus is my favorite author (The Stranger was great, The Plague one of my favorite books) but hes bring up things like mind deserts and 'the world of forms' that i really know nothing about. Its not like the writing is dense either, i know what hes trying to say but I feel like i need a lot more context, not only would it make more sense but it would mean more. I think this will end up being one of the most impactful books in my life so i want to be sure i understand pretty much every sentence\n\nDo you guys have any books that will give me what i need? obviously heidegger, hussurl, kierkegaard etc",
        "created_utc": 1669926681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe people have the right to be equal, to be treated as equals?",
        "author": "LonerOx0172",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9yso0/do_you_believe_people_have_the_right_to_be_equal/",
        "text": "I'm more interested  to know what arguments can be made against equality.",
        "created_utc": 1669926624,
        "upvote_ratio": 1.0
    },
    {
        "title": "When should I (22M) take a philosopher seriously?",
        "author": "MoreWallaby4958",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9y7r2/when_should_i_22m_take_a_philosopher_seriously/",
        "text": "From my experience, people who generally take a philosopher's words, mainly their cherry-picked quotes, to heart it has usually ended in total disaster for everyone involved. They would see a section, take it as an instruction manual, and make a fool of themselves because they took it the wrong way.\n\nI don't want to end up as some kind of incel sitting at the high school cafeteria alone because he was told that forming connections was a sin. One of the most common ones I see is based on Socrates, who says that philosophers (intelligent people) should only be around likewise peers. Still, those are way too far and in between, and if even one opinion is off, I'm suddenly banned from seeing them forever.\n\nThis mindset will only ruin my life, but I want to learn the intellectual intuitions about life without being stupid and without some kind of precedent in a social situation. I would appreciate your views on this.",
        "created_utc": 1669925344,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is Virtue Ethics similar to other approaches in moral philosophy?",
        "author": "hacebo123",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9xzeu/how_is_virtue_ethics_similar_to_other_approaches/",
        "text": "[removed]",
        "created_utc": 1669924829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Collective consciousness",
        "author": "Weak-Historian2411",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9xsaz/collective_consciousness/",
        "text": "I'm looking for some help finding serious academic/philosophical papers and books on the idea of an emergent consciousness between living beings on earth.\n\nMy mind can communicate with other minds on earth, and my consciousness can influence other consciousneses. I believe this communication between minds must create an emergent conscious mind between and \"above\" all of us.\n\nIs there a name for this idea/philosophy? Or similar ideas?\n\nThanks!",
        "created_utc": 1669924424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can non dualism/monism (idealism in this case) and free will be compatible?",
        "author": "JETRANG",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9x4r6/can_non_dualismmonism_idealism_in_this_case_and/",
        "text": " Greetings everyone,\n\n Basically as someone who is into monistic idealism (like philosophies of advaita vedanta and Kastrup) I discovered that a lot of non dual teachers and philosophers (like Alan Watts, Carl Jung, Rupert Spira, Aldous Huxley, Eckhart Tolle, Schopenhauer and Kastrup himself) reject the idea of free will like [here](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=https://rupertspira.com/non-duality/do-i-have-free-will&amp;ved=2ahUKEwixnKjtktn7AhWOM-wKHWjjCPwQFnoECA0QAQ&amp;usg=AOvVaw0YLFg8ST7dGVdoPFFV7OoS) and [here](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=https://blogs.scientificamerican.com/observations/yes-free-will-exists/&amp;ved=2ahUKEwiK7oiyktn7AhUZ7aQKHbvbAAMQFnoECAoQAQ&amp;usg=AOvVaw3dX1urVSLxXlfY68BENt_F) (as a side note don't let the title trick you)\n\n So now I'm here conflicted wondering if some sort of free will can be somehow compatible with such ideas or not.\n\n Also, thanks in advance.",
        "created_utc": 1669922971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is the biggest edgelord of academic philosophy?",
        "author": "formentoru",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9wnoz/who_is_the_biggest_edgelord_of_academic_philosophy/",
        "text": "I dont mean real-life sexual scandals on cemetery like Foucault, more like edgiest theory.",
        "created_utc": 1669921909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did any philosophers write about being depressed that moral and cultural relativism is true?",
        "author": "MentalDespairing",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9vrzn/did_any_philosophers_write_about_being_depressed/",
        "text": "I am someone who wants to fight for certain goals, like LGBT right's and women's rights, but I would personally not choose to do so if I were to accept that morality and rights are relative. \n\nIs there any philosophical writing on reasons for why you should do things even though it is subjective? Any philosopher who realized morality is subjective and fell into a depressive state?\n\nI am truly sorry, but I don't know the word or term for this for this - the fact that I don't see the purpose of doing something if it is subjective.\n\nNietzsche won't work since I am everything he hates, slave morality and all. But I welcome any philosophers who managed to give reasons for why to do things, why there is a \"should\" if everything is subjective. Also, Religion won't work either, I'm sorry.\n\nThank you.",
        "created_utc": 1669920054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guilty god",
        "author": "MpH81679",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9vpkk/guilty_god/",
        "text": "Is there probability of god being guilty?\n\nmaking humans and torturing them?\n\ncouldn't he make the universe such a way that there was no bad thing, while still be meaningful?\n\n(sorry for bad English)",
        "created_utc": 1669919908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will Durant's The Story of Philosophy: Is it useful/accurate/worthy/\"good\"? Will it help orient me toward the major questions and fields, or is it considered too problematic to bother with? Any similar recommendations for general introductions?",
        "author": "nouarutaka",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9uxxt/will_durants_the_story_of_philosophy_is_it/",
        "text": "I might have missed some recommended works in the FAQ, so feel free to direct me there. Thank you!",
        "created_utc": 1669918270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good and reliable resources to study Alcibiades I?",
        "author": "YblisSp",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9ulcp/good_and_reliable_resources_to_study_alcibiades_i/",
        "text": "I am making a presentation on the platonic dialogue Alcibiades I\n\nHowhever, most information I found of it until now are fragments in texts among some other bigger topic and wikipedia. Most other sites I look into either give me a sample and ask me to pay for the book, Ask me to download a shifty pdf or ask me to pay a subscription\n\nI dont have money and wikipedia isn't a 100% reliable source. The dialogue itself is easy to interpret and understand, but I would like some information on its autenticity and on it being the origin of the term \"platonic love\"\n\nThe resources can be in English, Spanish or Portuguese  \n(apologies for any incorections, english is not my first language)\n\nTL;DR: I need good resources about Alcibiades I autenticity and suposed origin of the term \"platonic love\"",
        "created_utc": 1669917568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theories on the emotions: where to learn",
        "author": "_stracci",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9uhpw/theories_on_the_emotions_where_to_learn/",
        "text": "Hello,\n\nI am someone from the biomedical area and I am working now applying it to the area of emotions. Is there any youtube classes where I can learn more about the diverse theories of emotion? Or key books/papers with a review on this subject?\n\nI know I could look into the original works but those do not seem so \"user-friendly\".\n\nThank you very much!",
        "created_utc": 1669917356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does desperation for love make someone difficult to tolerate?",
        "author": "Familiar-Let-5035",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9uge8/why_does_desperation_for_love_make_someone/",
        "text": "After spending two years in a black hole of loneliness, I've finally made peace with the space around me and no longer feel the need to constantly reach out to people that I want to be friends with. I don't care nearly as much if people cancel plans or blow me off completely. I still feel an unfulfilled need for emotional and physical intimacy, but it's stopped consuming me to the degree that it was before.\n\nNow that I'm more or less comfortable by myself, I notice that other people who are desperate for love or friendship send me in the other direction. I used to resent my friends and peers for the way they would ignore me in my time of emotional suffering, but now I feel like I'm the exact same way. \n\nIf people were all able and willing to answer the call of another's need for love, the world would feel a lot less isolating. So why don't we? \n\nFor example, I want love terribly. Someone who is desperate to love someone would, in theory, be a good match for me. But I can't even bring myself to send them a message without my gut instinct kicking in.\n\nI consider myself a pretty compassionate person, but I've recently met a few people who want friendship so badly that my walls go up immediately.\n\nIs this normal, is it healthy, and should we try to fight it?",
        "created_utc": 1669917278,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the moral implications of data?",
        "author": "AberrantSquid",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9u6xr/what_are_the_moral_implications_of_data/",
        "text": "As society gathers more data on itself, and statistics can be obtained more reliably and in a broader spectrum, what are concerns with the knowledge of the data itself? \n\nFor example, imagine a future entity decided to turn as much information as possible into stats and made those stats publicly available. In this they also incorporated the stats on how reliable the stats themselves were. They directly link every single person who worked on the sats and the resources where they got them, and they continually review and reanalyze everything. A machine built for no other purpose than to feed society accurate data about itself in as irrefutable ways as possible, and involve as many people as possible in relating their thoughts to the data. \n\nWhat would be the moral implications of this? What would it mean for everyone to be able to easily look at anything, even something controversial such as abortion, and know the exact statistics on every option, choice, and method? What would it mean to our values if everyone could easily see \"statistically X is the best option to lead to Y, however W has a 80% chance get you to Y as well and is 15% cheaper, Z has a 0.003% chance to get us to Y and here is a link to how, why, and the stats for those any theories that may argue this point\". \n\nI'm dumb asf, autistic, and don't really understand why stats aren't more respected now. Would the blatant advertisement of knowledge in this way even change anything? Or do we basically already have the above and I'm ignorant to why it isn't utilized more effectively?",
        "created_utc": 1669916729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plato's Meno: Where does Plato actually argue for the theory of forms? Does conceptualism/nominalism imply moral relativism?",
        "author": "WHARF_RAT11_11",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9sdrs/platos_meno_where_does_plato_actually_argue_for/",
        "text": "\"The same is true in the case of the virtues. Even if they are many and various, *all of them have one and the same form which makes them virtues.*\"\n\nI'm on to *Meno* \\- and I just can't get around this anymore.\n\nIt seems like in order to really get with what Plato is cooking, you have to accept his theory of forms. **Does he provide a compelling argument for realism anywhere? If not, does anyone?**\n\nRelated, if I was to make the following proposition:\n\n\"Virtue is a culturally determined concept that describes whether or not a certain individual or group of individuals are favorably disposed to a specific action. Virtue in one place and time is different from virtue in other places and times.\"\n\nWhat is this? Is it conceptualism? Is it post-modern? (Please excuse the use of that phrase - so confused as to what it really means).\n\n**If we say there is no \"real\" virtue - there is no form of virtue - are we obliged to admit that virtue is changeable concept and thus relative?**",
        "created_utc": 1669912522,
        "upvote_ratio": 1.0
    },
    {
        "title": "If meaning/ethics are subjective, what criteria do I use to choose?",
        "author": "JHigashikata99",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9rhp3/if_meaningethics_are_subjective_what_criteria_do/",
        "text": "[removed]",
        "created_utc": 1669910390,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Foucault trying to convey with, \"an effect that manifests and sometimes extends the position of those who are dominated\"?",
        "author": "geekrush",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9rdq5/what_is_foucault_trying_to_convey_with_an_effect/",
        "text": "I'm writing a paper using Foucault's framework to discuss a government entity and its power over a marginalized group. The dominated does have some power, but very little. But do the dominated fit into or a part Foucault's network? I thought that Foucault stated that in the network of power exists not only those in positions of power, but also those subjected to their exercise of power. Thus, power circulates everywhere in the network, so I thought that included the dominated.\n\nBut now I'm confused, what did Foucault mean when he stated: \"Using the microphysics of power, “Power is exercised rather than possessed… it is not the acquired or preserved ‘privilege’ of the dominant class, but the combined effect of its strategic positions– **an effect that manifests and sometimes extends the position of those who are dominated**”? Thank you for your help!",
        "created_utc": 1669910124,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make my study time more beneficial &amp; Study books as ideal as possible?",
        "author": "martialarts4ever",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9rcqi/how_do_i_make_my_study_time_more_beneficial_study/",
        "text": "We're studying a book thats focused on delivering hard critique on Idealism and Dialectical Materialism from an Islamic PoV.\n\nI thought: Why not go read prominent articles/works on Idealists/Materialists to understand them, then provide for the class a presentation/paper about said works weekly or monthly?\n\nSadly, not all of us are gifted with having the ideal instructor or educational environment, so:\n\n- How do you maximize the productivity of your study time overall?\n\n- Since philosophy study is largely a study of books, how do you study argumentative works that covers a plethora of ideologies &amp; critiques them?",
        "created_utc": 1669910057,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the modern state the result of a military and fiscal monopoly?",
        "author": "vetorzera",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9r1lw/how_is_the_modern_state_the_result_of_a_military/",
        "text": "I’ve been reading Norbert Elias’ and I’m having a hard time understanding the links between them.",
        "created_utc": 1669909315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Essay - Princess Elisabeths objections to Descartes",
        "author": "bentheredonethat37",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9qc17/essay_princess_elisabeths_objections_to_descartes/",
        "text": "Hi, I need to write a 1500 word essay on Princess Elisabeth of Bohemia's objections to Descartes. It's been a long time since I've written an essay (math student) and am struggling. I feel that I have a fairly good grasp of the content but struggle with the essay structure and just getting words on paper.\n\nIn the introduction I have to come up with a question that I will relate the essay to. Not sure what I should do for this. Then, I need to pick two of Elisabeth's objections, critically assess them and give my own opinions. I was going to go with, can reason be detached from emotion and how can the mind affect the body if one is immaterial and one is material. Finishing by concluding the essay relating it to the question in the introduction. Is writing a lot of my opinions in first person generally acceptable?\n\nIs there anywhere I can find example essays so I can get an idea of what I'm looking to achieve or any other resources that might help me? I've spent hours and haven't really managed to get anywhere.\n\nThanks for any help!",
        "created_utc": 1669907593,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you get better at expressing myself philosophically?",
        "author": "roxrexboxnox",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9pkqy/how_did_you_get_better_at_expressing_myself/",
        "text": "Have you ever felt that there's a point that you find wrong in a philosophy argument, but you can't quit point it out?\n\nOr that you have a philosophical idea in your mind, but you just don't know how to express?\n\nThese are two different things (detecting/generating the mental idea, then transforming it into clear text)\n\nHow did you overcame these obstacles? How can I get better in these skills?",
        "created_utc": 1669905734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain the difference between Pre-determinism and Fatalism?",
        "author": "Notrealmatsu",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9pi9v/can_someone_explain_the_difference_between/",
        "text": "After doing a bit of research, here is what I got:\n\nDeterminism is the idea that a moral agent has the ability to choose, but those choices are predetermined based on causal factors that influence your ultimate decision, meaning that you didn't really have a choice. \n\nFatalism is the idea that everything that has happened was already fated, so there is no point trying to do anything to change what seems to be your fate. \n\nPre-determinism is the idea that your life is planned out for you already (call it God or a higher power). \n\nThe difference between Determinism and Pre-determinism is clear. One attributes your circumstance to causal factors while another attributes it to a pre-determined plan. Why can't this be called Fate as well?\n\nMy understanding is that Fatalism is an ethical philosophy, trying to tell people to accept the way their lives are (to suppress the classes before? I'm not sure), but Pre-determinism and Determinism are metaphysical, aimed at trying to tell you what life is and how you should act given that knowledge. But besides the two implications, I cannot find the difference between Pre-determinism and Fatalism conceptually. Can someone help to explain?",
        "created_utc": 1669905563,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between learning and gaining consciousness?",
        "author": "panic_pyo",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9ob2z/what_is_the_difference_between_learning_and/",
        "text": "",
        "created_utc": 1669902447,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can a person be considered good/virtuous?",
        "author": "Kashsbrokentablet",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9o8vt/when_can_a_person_be_considered_goodvirtuous/",
        "text": "I was wondering if any philosopher gave an indication at which point a person would be considered a good person.\n\nIt seems utopian to expect someone to be virtuous 100% of the time and it seems reasonable to suggest serial killers are bad people while Jesus was a good person.\n\nI was wondering if there’s any cut off when a person would be considered “good” or “bad”",
        "created_utc": 1669902280,
        "upvote_ratio": 1.0
    },
    {
        "title": "How moral nihilism and moral relativism are different?",
        "author": "Victorreidd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9nyht/how_moral_nihilism_and_moral_relativism_are/",
        "text": "",
        "created_utc": 1669901484,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did Socrates mean by false philosophers?",
        "author": "Few_Possibility1961",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9nuwe/what_did_socrates_mean_by_false_philosophers/",
        "text": "In Book 6 of The Republuc, Socrates quotes “the many hate not the true but the false philosophers-the pretenders who force their way in without invitation, and are always speaking of persons and not of principles.”\n\nI’ve always been told this from a young age, and took it as not to be around people (that being the only peers I had) because they weren’t talking about smart things. Bear in mind this was mainly K-12, so I had trouble finding the kind of true philosopher among children. Looking back I think my parents may have had the wrong idea which in the end ended with me isolated from face to face interactions and into the depth of uncle culture. Those ideas are about hating women, minorities, gays, and though they better fit the mold than the literal children I was around, it appears to me they’re violent radicals.\n\nGoing back to Socrates, if anyone who actually reads him could give their two cents of what he meant by this quote I’d be appreciative.",
        "created_utc": 1669901217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question (new to philosophy)",
        "author": "Wise-Shock-6444",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9nmvd/question_new_to_philosophy/",
        "text": "\n\nThe sky is blue\nBlue is a color\nSo, sky is a color\n\nThis is incorrect, but how can we explain why?",
        "created_utc": 1669900614,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am currently reading Karl Marx's \"Das Kapital\". What are some critics I should know/things to keep in mind while reading it?",
        "author": "Kleecarim",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9nhfr/i_am_currently_reading_karl_marxs_das_kapital/",
        "text": "Hello, I hope this question fits this sub. I apologize if this question is a bit stupid\n\nI am not a philosophy student and even though I am very interested in it, my exposure to it was quite limited. I learned a bit from Zizeks Videos/films, read Descartes Meditations 1 and 2 and did some research about the general history of philosophy and logic (mainly fallacies) but overall I definitely am a layman.\n\nI was always interested in Marx's Capital, and finally got around to reading it. However, I am afraid that due to my limited exposure to literature like this and philosophy in general, I might not be critical enough towards his ideas, take things he talks about in his book at face value and develop \"wrong\" beliefs. \n\nMy question is: What are some things I should keep in mind when reading Marx?  What are some critics I should read after finishing the book, and is there any research I should do before reading it to understand it better? And would it be possible for you to give me a broad understanding about if/which ones of his ideas are generally seen as outdated or simply \"wrong\" in philosophical circles?\n\nTo clarify, this question is not about *how* I should read philosophical literature (like how to take notes) but specifically what would be important for me to not misunderstand Marx. \n\nOn a sidenote, I'd really appreciate it if you wouldn't tell me to read other authors except if it is necesarry to understand marx (I do not want to give the impression that I think I 'know better', I simply always was and still am very interested in his ideas and want to learn more about them)\n\nTL;DR: What do I have to read/know to read marx without \"brainlessly agreeing\" with his ideas and developing unreasonable beliefs?",
        "created_utc": 1669900197,
        "upvote_ratio": 1.0
    },
    {
        "title": "At which point does a meaningful coincidence call for a supernatural explanation?",
        "author": "eth_trader_12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9mgwm/at_which_point_does_a_meaningful_coincidence_call/",
        "text": "Every time we've ever come across a seemingly marvelous coincidence that was repeatable and testable, it turned out to be representative of a law. It was a coincidence that turned out to be a real pattern, but a pattern that could be represented as a natural law. In some other cases, those coincidences turned out to be fabricated stories.\n\nIn all other cases, coincidences are singular or consist of a series of events that seem, to many, to not have been tested enough. This is either because the coincidence was simply a meaningful event that occurred unexpectedly (such as someone calling me after I thought about them), or something that although was \"expected/tested for\" in some manner, stopped being tested for (such as me correctly guessing a number between 1 to 10 three times from another person, and then stopping). In the latter case, the tests always stop and don't continue.\n\nWe've never tested something repeatedly that turned out to be a pattern where the explanation was not natural. Now, clearly, we can conceive of scenarios, where even if we can't identify a natural cause, it would go against our conception of how natural laws work. For example, if I correctly guessed a number between 1 to 10 that Adam was thinking of, and then repeated this experiment with hundreds of people, with enough protocols to ensure fraud was avoided, sooner or later, we'd be convinced that it was not happening by chance. It would cry for a better explanation. But this never happens.\n\nThis seems to beg the question though. How many times would I have to guess a number before it begs for an alternative explanation to chance? Intuitively, it seems that certain numbers beg this question more obviously. For example, if I guessed it 1000 times, the chance would seem too low.\n\nBut by its very definition, there is no such thing as the probability of an event being too low for chance to not have caused it. If an event E = guessing a number 1000 times, and C = chance, P(E|C) seems low. But this says nothing about P(C|E). One must look at alternative explanations to determine this, but let's consider supernaturalism as a whole here. Even though we don't have any apriori predictions of what kinds of events supernaturalism would entail, the event of me guessing a number 1,000 times seems to beg for an explanation. If we ruled out fraud and my guessing continued, what should our philosophical position be? And at what point should we be skeptical that intentionless naturalism is all that is at play here?",
        "created_utc": 1669897223,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some examples of epistemic norms held in other cultures that we in the west don't share?",
        "author": "Linguistics3",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9m9gq/what_are_some_examples_of_epistemic_norms_held_in/",
        "text": "For example, the Azande (an ethnic group in central africa) test for the influence of witchcraft in the occurrence of an event (e.g. a flood, fire etc) by feeding poison to a chicken.  The death of the chicken might suggest that witchcraft was involved while its survival might suggest the opposite.  Following this test, the Azande \"know\" whether witchcraft played a part.\n\nAre there any other examples of epistemic norms which might be considered unusual to those in the west?  I am looking for both examples which might support epistemic relativism and examples which might suggest that there's a way to empirically test the superiority of different epistemic norms.\n\n&amp;#x200B;\n\nedit:  an epistemic norm here would be any criterion used to justify a belief !",
        "created_utc": 1669896586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding the original source of an Alan Watts quote",
        "author": "PhysicsPossible933",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9lra2/help_finding_the_original_source_of_an_alan_watts/",
        "text": "I came across this quote by Alan Watts and I can’t seem to find its original reference. It goes:\n\n“And people get all fouled up because they want the world to have meaning as if it were words… As if you had a meaning, as if you were a mere word, as if you were something that could be looked up in a dictionary. You are meaning.”\n\nWas it from a book he wrote? Or perhaps something he said in an interview? I appreciate the help, thanks! 🙏🏻",
        "created_utc": 1669895001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why machines cannot be conscious?",
        "author": "hurlhimmy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9lfa4/why_machines_cannot_be_conscious/",
        "text": "Hi Everyone! I have an upcoming debate for my high school philosophy class and I have been given the stance that machines cannot be conscious. I’m having a hard time coming up for arguments to support this. Some ideas my teacher recommended are: 1. We don’t have consciousness machines currently, 2. Even if we could make a conscious machine how would we know it’s conscious, and 3. Consciousness is unique to biological substrates. \n\nWhile I appreciate my teacher helping me come up with these ideas, I’m having a hard time seeing how I would be able to substantiate those arguments into paragraphs. I was wondering if anyone here has any thoughts they could share to help me whether it’s new ideas or helping me understand how to further those points. Thanks!",
        "created_utc": 1669893902,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best philosophical answer?",
        "author": "_Springfield_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9kgsj/what_is_the_best_philosophical_answer/",
        "text": "[removed]",
        "created_utc": 1669890428,
        "upvote_ratio": 0.33
    },
    {
        "title": "Philosophy books on vigilantism?",
        "author": "jdimo21",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9j1al/philosophy_books_on_vigilantism/",
        "text": "Hi all! I am doing research on the topic of vigilantism for a book. Any suggestions will be greatly appreciated! Cheers!",
        "created_utc": 1669885064,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"IS EVERYTHING RELATIVE\" (BADLY NEED HELP)",
        "author": "wpwmql",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9iy6b/is_everything_relative_badly_need_help/",
        "text": "Can someone make me understand what does it truly means in a negative view, or like disagreeing with the statement because we have to write a position paper and I simply just do not get it.",
        "created_utc": 1669884699,
        "upvote_ratio": 0.4
    },
    {
        "title": "Why do people believe that uploading their consciousness will make them live forever?",
        "author": "TRIPMINE_Guy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9hv1d/why_do_people_believe_that_uploading_their/",
        "text": "Assuming a mirror of our minds could be uploaded to a computer and that it would be sentient, it doesn't mean it would even be me. There are two scenarios possible when uploading mind:\n\n1. Original mind is destroyed\n2. original mind in not destroyed\n\nIn the second case it's clear that the cloned mind is not me because I still exist. Case closed. In the first case, the fact that the second case is a logical possibility should prove that your mind cannot be transferred, only duplicated, so there is no useful insights with the first case. I just don't understand why science fiction even portrays this as a plausible thing in the far future tat could preserve yourself because it's just not you?\n\n&amp;#x200B;\n\nThe only alternative scenario I can envision is that you could perhaps link your mind across two different bodies using technology and one of those bodies could be robotic in nature. In this case idk but that seems very farfetched.",
        "created_utc": 1669880473,
        "upvote_ratio": 0.85
    },
    {
        "title": "What was going on in the world of philosophy during the crusades?",
        "author": "Anarcho-Chris",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9g2gu/what_was_going_on_in_the_world_of_philosophy/",
        "text": "",
        "created_utc": 1669874196,
        "upvote_ratio": 1.0
    },
    {
        "title": "(kantian) is keeping a promise heavier/more important than telling the truth?",
        "author": "Exciting_Budget1632",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9e5cg/kantian_is_keeping_a_promise_heaviermore/",
        "text": "what if: a murderer with dementia asks me to keep his knife and asks me to promise not to give it to him whatever happens and i accept this promise. one day, he comes and asks if i have this knife. is it good/moral to lie to him to keep the promise + prevent the possible deaths of people? or do i tell the truth because, well, categorical imperative.\n\nmy thinking is, lying would be the right Kantian thing to do.",
        "created_utc": 1669868616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find the quote",
        "author": "Reznikov21",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9dep7/trying_to_find_the_quote/",
        "text": "There was a text from Ancient Greek philosophy in which a philosopher was questioned why is logic correct, and the response talk about the necessity of logic in said question. However I can't remember the text or philosopher, can someone help me?",
        "created_utc": 1669866648,
        "upvote_ratio": 0.67
    },
    {
        "title": "Is value something that you actually create?",
        "author": "polymathy7",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9d2t7/is_value_something_that_you_actually_create/",
        "text": "Read somewhere else someone say that value isn't something that things have intrinsically, but something we give things, so it would be more appropriate to think of values as verbs or actions. But this made me think whether we can even think of values as something we consciously or actively create them at all. Most of the time it feels like value grows in the background, almost as a secondary effect of our experiences with things and our personalities. Is there any literature on this?",
        "created_utc": 1669865771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about the ethics of dating and attraction",
        "author": "ImmortalScrunchie",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9d0qi/question_about_the_ethics_of_dating_and_attraction/",
        "text": "I've always been super stressed about having preferences when it comes to who I am sexually attracted to. I view being sexually attracted to someone as a component of a sexual relationship just like being emotionally intimate with someone (or 'clicking' really well with them) is necessary for many relationships (especially sexual ones for some people). But I also constantly get worried about this as many people deem physical attractiveness as a shallow attribute and not the reason why one should or should not pursue and intimate relationship. I genuinely do not understand this. Say I meet a really nice person whom I really like, but I do not find their body attractive nor do I want to have sex with them. For this reason I say it is best we be friends instead of date, many people would call this shallow and objectifying of me. But this is odd as it seems like they are putting some sort of imperative on me to date this person, as if I have to find a good reason to not date them rather than me finding a good reason *to* date them.\n\nHere is where I get really scared. I have heard people say that often physical attraction grows when you get to know a person etc. and that is why you date. But what if, after dating for a little, you find out that you really like this person as a friend, but don't really find them attractive, is it okay to say that you should just be friends? A common sentiment is that this is shallow because it seems like you are only dating the person because you find them attractive. For some people this may be true, and if that hasn't been clearly communicated and consented to, I would say it is also rather rude. I am not, however, only attracted to someone physically, that is just one aspect. But is it rude to say that it is one of the necessary aspects. It is not sufficient, but it is necessary. This poses yet another question. Say someone has the preference that they do not find heavier people attractive. They make a great friend, but because of their body, this person doesn't really find them physically attractive and so they never end up dating but stay great friends. If there is a problem with this I would really love to hear some responses and recommendations for further reading. If there is no problem with this I have a further question. \n\nSay the same person as the last example is married to someone whom they love and find attractive. For them, both of those parts are necessary, but, as time goes on their partner starts to change physically to the point where this person no longer finds their partner attractive (if they had only met just now this person wouldn't have began dating them). Now, if the person decides to end the relationship most would consider this repulsive and shallow (myself included), so instead they stay in the relationship and either force themselves to have sex and stay with this person whom they do not want to do those things with, or they drift away in to a loveless marriage, both sounding miserable. So, it seems that it is okay to refuse to date someone you don't find physically attractive (because that attraction is important to you) but it is not okay to break up with someone whom you no longer find physically attractive.\n\nMy question then: Why is it wrong to refuse to date someone because you don't find them physically attractive (and how is this different than refusing to date someone whose personality you hate, assuming you are the type of person where both aspects are necessary)? And if it is totally fine to not date someone who you don't find physically attractive, why is it wrong to break up with someone who you no longer find attractive? I would really love some reading recommendations about this.\n\nI'm in a conundrum because I really like this person and I like being around them but I don't find them attractive (I know they like me, and I thought I liked them too but I don't really find them attractive). But, if I keep telling myself that I shouldn't be shallow and focus on them at a deeper level, how is this not unfair to us both? I do not think anyone would appreciate their partner forcing themselves to find them attractive. And why should I be obligated to date this person? I'm not dating plenty of other people, many of whom I am also not attracted to, why is this one person special? \n\nSay you are doing blind dating (where you actually don't know what someone looks like) and you really connect with someone and like them. When you finally see them in person you have no attraction towards them physically. A lot of people would say that if you don't date them you are being shallow and super rude. So, should this person force themselves to date (and presumably have sex) with this person they do not want to have sex with? Why? Are we obligated to change who we find attractive and force ourselves to have sex with more variety of people? That sounds miserable. What is wrong with wanting to only have sex with people you want to have sex with? And again, if there is nothing wrong with that, what happens if you lose your attraction to someone and no longer want to have sex with them, why is this seen as scummy? Just because you consented before does not mean you are 'locked in', yet it is seen by many (including me) to be a terrible thing to do to someone. So it seems to me that I must either force myself to date people I'm not attracted to, or be a surface level, shallow, terrible person.\n\nThank you for any and all answers (references to professional philosophers and papers especially appreciated)!",
        "created_utc": 1669865632,
        "upvote_ratio": 0.6
    },
    {
        "title": "A website that allows you to randomly discover a philosophy and provides a short summary?",
        "author": "youeventrying",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9cu7g/a_website_that_allows_you_to_randomly_discover_a/",
        "text": "It was a link through a school if I'm not mistaken. It was shared on Reddit previously. I liked randomly finding philosophies and ideas that I had never heard before",
        "created_utc": 1669865181,
        "upvote_ratio": 0.71
    },
    {
        "title": "Does naturalism require evolutionary psychology to be true?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9aiq4/does_naturalism_require_evolutionary_psychology/",
        "text": "[removed]",
        "created_utc": 1669859386,
        "upvote_ratio": 1.0
    },
    {
        "title": "vfbghfbvbghn",
        "author": "DetectiveOverlook",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9aimf/vfbghfbvbghn/",
        "text": "[removed]",
        "created_utc": 1669859379,
        "upvote_ratio": 0.33
    },
    {
        "title": "Ona and the many and its historical origins",
        "author": "josephusflav",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z9afjr/ona_and_the_many_and_its_historical_origins/",
        "text": "Context, a group of Christians i know like to argue that for all positions except Christianly there is a dilemma.   \n\n\nif one is logically prior to the many then there cannot be plurality in the word   \n\n\nif the many is ultimate there cannot be unity   \n\n\nChristianity escapes this by having a ultimate that's one and many   \n\n\nIf you say atheism has the option of a co-ultimate set up they accuse you copying them.   \n\n\nI am looking for a pre-christian source that says what is ultimate is both one and many",
        "created_utc": 1669859166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone check my proof ◻𝑃→◻◊ ◻𝑃",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669857267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any philosophers who strictly deal with death?",
        "author": "The_Bigwrinkle",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z98ke2/any_philosophers_who_strictly_deal_with_death/",
        "text": "I’m looking for anything that relates to how someone should go about dying, but with a catch. I’m writing a fiction book with platonism being a loose base for some of the plot. I however don’t really like Plato’s idea about the parting of the soul from the body because I’m a staunch atheist. Are there any philosophers who talk about death from a perspective where an afterlife doesn’t exist, nor reincarnation? Or, how does the atheist feel when he dies, I guess.",
        "created_utc": 1669854467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has this idea already been done?",
        "author": "Ok_Revolution_8584",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z97u4p/has_this_idea_already_been_done/",
        "text": "Hi redditors of askphilosophy,\n\nI have been thinking about a problem that came to me while I was at work and would like to know if there has been any work written that covers my question, or anything similar. I have summarized it below:\n\nIn  life as we know it, and this could be said for any type of society or  era, there are certain things that must be taken for granted in order to  live a life with some degree of sanity. Although it would be easy to  start at ground zero ( in Descartesian style), doing so would involve  calling into question every bit of information that most people take for  granted, which in western society is mostly empirical data. To  participate in reality, we choose to accept paradigms that make up a  popular conception of the world and are interpreted and accepted as  factual until they are proven otherwise. The problem with taking any set  of paradigms for granted is that you are resting on a very large  assumption that they are in fact true, when historically there are  numerous examples of 'facts' being disproven.\n\nWhile   scientific 'facts' are extremely limited to the accuracy and precision  of technology, it is in the nature of scientific discourse to be  constantly testing and subjecting scientific data to falsifiable tests  and experiments, so to rely on these paradigms seems to have less  impactful consequences simply because there is a general understanding  (for the most part) that they could be disproven and that it is the duty  of scientific inquiry to test this. The real problem for me lies in the  metaphysical assumptions of what exactly constitutes our physical  reality, whether that be a recounting of history or the assumption that  one person's physical experience of the notion of \"pain\" is the same as  your physical experience of the notion of \"pain\". While both of these  are taken for granted day to day neither can truly be proven but we rely  on them being true to navigate the world in a way that allows us to  function day to day.\n\nCertain  events in history being disproven would probably shake collective  consciousness a bit, but overall wouldn't have effects that are that  devastating to the way we go about our day to day life. On the other  hand discovering that other people experience something other than pain  from stimuli that you consider to be painful, and that they react to  this un-painful  sensation in a way that is congruent with how you react  to pain (and I do not mean deriving pleasure from pain in a masochist  sense, in this there is still pain in the sense that we know it to be,  but there is a sense of pleasure that is connected to the pain, there  are two sensations that are connected psychologically as opposed to the  substitution of one for the other), would have very huge and potentially  life altering consequences.\n\nI  say that the consequences would be life altering because if we assume  that most people do not want to cause harm to other living beings, then  deciding what to do and how to treat other beings so as to avoiding  harming them would be a nightmare. To avoid this possibility we must  decide that it is likely enough that this is not the case and assume  that people mean what they think we mean when they say they are in pain.\n\nSo  with all of this in mind, the most important question to me is: How do  we determine what is worth taking for granted and what is worth  questioning? How do we determine where to draw a line so that we can go about life in a  somewhat normal way while still being responsible enough to not accept  everything that we are told or fed by popular culture or the government?",
        "created_utc": 1669852746,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should I take notes on a Kindle Paperwhite?",
        "author": "Few_Possibility1961",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z970ck/how_should_i_take_notes_on_a_kindle_paperwhite/",
        "text": "I’m following a guide on classical education, and so far I’m about halfway through The Republic, and although I have a lot of highlights and notes taken I’m not sure I’m doing it right. My main goal isn’t to absorb all of the info, just to connect each idea to the text at large, and I feel that I’ve been lacking on that part.\n\nIf anyone has done this before and is satisfied with their method, I would appreciate your advice.",
        "created_utc": 1669850740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is majoring in mathematics right for me?",
        "author": "Few_Possibility1961",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z95orb/is_majoring_in_mathematics_right_for_me/",
        "text": "Given that nearly every philosopher says that studying math makes one smarter, and that it’s one of the most important things to learn, I decided to major in mathematics, but I’m having this feeling I’m doing it for the wrong reasons.\n\nNearly everyone from Socrates to Newton lauded math and geometry, so it would make logical sense to study as much of it as possible so I can use the mental images in strengthening my own arguments. \n\nIt’s also a part of STEM, so if something is wrong with this thinking I can quickly move onward to a feasible career. But in the meantime in terms of philosophical studying is majoring in mathematics worth it?",
        "created_utc": 1669847709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the philosophical idea that \"unconscious fear of death motivates much of human activity\" is not popular?",
        "author": "vikasofvikas",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z94y6c/why_the_philosophical_idea_that_unconscious_fear/",
        "text": "This idea was first introduced by Ernest Becker in his book \"The Denial of death'\".",
        "created_utc": 1669846082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is all art mimetic?",
        "author": "ArtNo4580",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z93xg1/is_all_art_mimetic/",
        "text": " **If an artist exercises some kind of judgement and discretion when he/she translates and**  \n **transforms aspects of human experience and/or nature into a work of art ... and if**  \n **artworks represent/reflect/imitate/reproduce human experience and/or nature ... then is**  \n **all art mimetic**",
        "created_utc": 1669843904,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly is Effective Altruism and why is it controversial?",
        "author": "SocialActuality",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z93koy/what_exactly_is_effective_altruism_and_why_is_it/",
        "text": "Looking for a basic rundown of the concept and the controversy around it, not really up to speed in this area. I get it has some relationship with longtermism, which I think I have a reasonable handle the basic concept of, but otherwise I’m out of the loop here.",
        "created_utc": 1669843134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophical work on the concept of the \"witness\"?",
        "author": "waxvving",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z92qca/philosophical_work_on_the_concept_of_the_witness/",
        "text": "Curious to know if anyone has come across anyone writing on the concept/notion of 'witness' in philosophical thought, specifically in 20th C continental thought! \n\nObviously has significant connotations in various religious texts, but wondering it it has been 'secularized' at all, perhaps in relation to ethical theories. \n\nI imagine, based on my knowledge of his work, Levinas might have had something to say about it -Derrida, too, for that matter- but I haven't come across anything explicitly yet.\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1669841233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Social Philosophy/Theory on Petersonian Religious View?",
        "author": "Sleepie_Kittie01",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z92akn/social_philosophytheory_on_petersonian_religious/",
        "text": "I just watched the Peterson-Harris debate on religion. Despite all of Peterson's infamy and questionable views, his take on religion is actually breath of fresh air in my opinion. As a hardcore atheist who's long been at war with religious powers, I am somehow able to subsume Peterson's view into my atheism. \n\nHis take on religion is clearly distinct from the fundamentalist views that are associated with supernaturalistic accounts of reality such as intelligent design and literal interpretation of biblical narrative; rather, he views the biblical story (and presumably other religious texts as well) as a manifestation of collective consciousness of human existence that are guided by the hands of evolution. In this view, primitive moral intuitions form the bedrock from which arises the suprastructure known as religion or ideology, which he called a crippled form of religion. I can pretty much hear Edmund Burke's voice in Peterson's objection to postmodernism and atheism, which is grounded in the worry that if we abandon the structure established by tradition and long history of human evolution, the society will take a plunge into some sort of collective nihilism because people can't make values and meaning without religion. I think this is a problem well-recognised by the left but yet they have yet to provide a solution. I recall Wendy Brown saying  something to the effect of \"Nihilism generates predicaments to identify criteria for meaning without appealing to discredited sources such as religion, tradition and logic...science may have dethroned religion from the ministry of truth but it has not replaced its meaning-making power\"\n\nAre there any social philosophers who articulates this Petersonian view on religion without sneaking in right-wing propaganda?\n\nHas there been any response from the left to resolve this problem brought up by Brown?",
        "created_utc": 1669840245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me understand the meaning of Parmenides's quote: \"It is the same thing that can be thought and can be.\"?",
        "author": "pirateprentice27",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z91w1m/can_someone_help_me_understand_the_meaning_of/",
        "text": "Is Parmenides a monist like Hegel? How similar is Parmenides's philosophy to Hegelian absolute idealism?",
        "created_utc": 1669839316,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good commentary/secondary lit on Machiavelli's The Prince?",
        "author": "AngloSaxonCanuck",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z90r8a/what_is_a_good_commentarysecondary_lit_on/",
        "text": "So, I have The Prince and it's super short and is an easy read, but I'm looking to get the most out of it that I can. Can you recommend a commentary to read afterward? Politically I'm centre-right/conservative so if there's a commentary from that angle, all the better",
        "created_utc": 1669836738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is equality often assumed as good?",
        "author": "formentoru",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z90dfn/why_is_equality_often_assumed_as_good/",
        "text": "In philosophy, I would expect to always start from the beggining. But equality is ofted assumed as good without explanation. Who analyzes equality more deeply? And why it is not attacked more often? Is this some golden calf of philosophy?",
        "created_utc": 1669835914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conception of God",
        "author": "kazakh_gentleman",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z909bm/conception_of_god/",
        "text": " \n\nHello all,\n\nFirst I want to start with saying that I am ignorant of philosophies, maybe except for Stoicism, I never studied them and I don't really know much about them. I tried to read Kant once 7-8 years ago but it was just beyond my comprehension level. So forgive me if I don't know trivial concepts or famous authors.\n\nSo I have this conception of God in my head: God is not a person, not a being, but rules of the Cosmos or the Universe, the patterns that we, as conscious beings, can observe with examples such as, laws of logic, physics laws, chemistry laws and biology laws. We, as special type of monkeys, can express some of them as mathematical equations or scientific theories. In addition to that, God has no thoughts, feelings or preferences, It just is.\n\nWith that said, is there any well articulated philosophic work with this or a similar conception? I think Spinoza had somewhat similar ideas (or not?), anyway I wasn't able to understand it particularly well from youtube videos that I saw about this topic.\n\nPlease share the name of the work(s) or maybe a passage with well articulated ideas of the same or a similar conception of God dumbed down for ordinary people like me.",
        "created_utc": 1669835664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books &amp;/or Resources on Market Socialism and SOME?",
        "author": "DoggoFam",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8yqi0/books_or_resources_on_market_socialism_and_some/",
        "text": "SOME: (Social Market Economy)",
        "created_utc": 1669832431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plato's Crito: Why Must We Do No Wrong?",
        "author": "WHARF_RAT11_11",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8yogf/platos_crito_why_must_we_do_no_wrong/",
        "text": "Socrates seems to make the following argument in Crito:\n\n1.) One must never do wrong willingly.\n\n2.) It is wrong to break a just agreement.\n\n3.) Socrates has made a just agreement to obey or attempt to reform the laws of Athens or leave the city if he does not agree to live by them.\n\n4.) By avoiding the penalty of the law he is breaking that just agreement, which is wrong.\n\n5.) Therefore he must not try to escape or he will do wrong.\n\nCrito accepts the first and second claims without argument and they both agree they've held these positions for a long time, even though the majority of people do not.\n\n**Does Socrates argue for the moral imperative of the first two claims in any other dialogue?** \n\nI didn't find Crito very satisfying. Even if you accept the first two claims (which most sane moral agents would), hasn't Socrates also implicitly made agreements with his children to help raise them and ensure they live? Hasn't he made a million other implicit agreements that he won't be able to fulfill by not escaping?\n\nIf he's arguing for the primacy of an individual's obligation to the state as to any other obligations, it seems weak that his main reasoning is:\n\nA. The city raised him (\"bring you to birth\", \"nurture of babies\", \"education\"), and he is obligated to it like a child to its father: \"your country should be honored more than your mother, your father, and all your ancestors.\"\n\nB. He had the opportunity to leave any time if he didn't like the way things were in Athens - \"You did not choose to go to Sparta or Crete, which you are always saying are well governed...\"\n\nNeither of those reasons are terribly compelling.\n\n**Does Socrates argue for the primacy of the obligation to the state over other obligations anywhere? Why is fulfilling an obligation to the state/state institutions/social cohesion arising from the state more important than fulfilling other obligations?**\n\nThen to top it off he kind of just runs through a bunch of reasons why the **results** of him escaping would not be any better for him or anyone else if he were just to die. This dialogue just feels very emotional and inconsistent compared to what I've read of him up to this point.",
        "created_utc": 1669832309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Large Language Models understand what they say?",
        "author": "wgham",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8xrh5/do_large_language_models_understand_what_they_say/",
        "text": "As part of university, I recently read an influential paper by Bender and Koller arguing that LLMs cannot in principle understand language. There is a nice thought experiment in there with two islands and an octopus, essentially a successor to the Chinese Room. I was wondering if there were any good objections to the thought experiment, as there are a myriad for the Chinese Room. \n\nThis paper is of course much more recent so the discourse is less developed, but I was having difficulty finding responses directly to the thought experiment here. Any help would be greatly appreciated!",
        "created_utc": 1669830175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for this racist eugenics philosophy professor",
        "author": "formentoru",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8xatx/searching_for_this_racist_eugenics_philosophy/",
        "text": "I cant find him again. I think he is taking lots of dissociatives and was still teaching somewhere few years ago, thinking about some dark stuff. Do any of you know his name?",
        "created_utc": 1669829095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused on the definition of property",
        "author": "bemrys",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8x2u6/confused_on_the_definition_of_property/",
        "text": "Specifically, take the claim that \"Mount Everest has the property of being the tallest mountain on Earth.\" If there is volcanic eruption that causes some other mountain to be taller, nothing has physically changed for Mount Everest, but it has lost this property. Intuitively, with no training in philosophy, I \"feel\" that \"tallest mountain on Earth\" is a relationship, not a property. \n\nCan someone explain the philosophical meaning of \"property\" in this context?",
        "created_utc": 1669828588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where precisely did Aristotle outline the cardinal virtues?",
        "author": "autodidacticasaurus",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8vtlk/where_precisely_did_aristotle_outline_the/",
        "text": "And was it all done in one place? I've heard that it was in Nichomachean Ethics, but I'm hoping someone could be more specific to save me having to read the entire thing right now.",
        "created_utc": 1669825627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Programs for philosophy of information?",
        "author": "Ok-Lab-8974",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8vix5/programs_for_philosophy_of_information/",
        "text": "My apologies if this has been asked before, I tried searching for prior answers. I am very interested in information theory/theoretical computer science and its intersection with metaphysics and epistemology, i.e., the new discipline of philosophy of information.\n\nI'm considering a career pivot to work on this full time (just getting my feet wet with online graduate work now), but I've had a hard time finding programs that have people focusing on PI, given it is sort of a niche area. Just wondering if anyone knew of some programs that are particularly strong in this area, especially one outside of a big city? I've mostly just been searching the names of contributors to the Routledge guide on PI to see where they are (excellent resource for this topic BTW).\n\n\nI'm also interested in applied information theory in the sciences, particularly in physics and biology, although it seems like more could be done with work in the social sciences as well. (I currently teach undergrad econ as a hobby project and that's a case of considerable crossover). \n\nThere is an information focused program at University of Maryland that looks like it fits my interests, but I haven't seen any others like it. Many are more on the electrical engineering/IT side of things, which I don't have the background for and which doesn't interest me as much. I was hoping other similar programs might exist?\n\nI figured a program like UMD's might be a little better in terms of job opportunities outside of academia.",
        "created_utc": 1669824922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain to me this line from Hobbes?",
        "author": "Formiddabledrip",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8vi2m/can_someone_explain_to_me_this_line_from_hobbes/",
        "text": "\"[T]he greatest pressure of Soveraign Governours, proceedeth not from any delight, or profit they can expect in the dammage, or weakening of their Subjects, in whose vigor, consisteth their own strength and glory; **but in the restiveness of themselves, that unwillingly contributing to their own defence, make it necessary for their Governours to draw from them what they can in time of Peace, that they may have means on any emergent occasion, or sudden need, to resist, or take advantage on their Enemies.\"**\n\nIt is the bolded part that confuses me greatly. What do you think it means? It is from Chapter XVIII of The Leviathan.",
        "created_utc": 1669824868,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is an example of Kant's a priori judgement that is NOT based on experience?",
        "author": "aVidus7677",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8uw5u/what_is_an_example_of_kants_a_priori_judgement/",
        "text": "",
        "created_utc": 1669823419,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I look at movies that are nominated for Academy Awards, it seems like typically tragedies and dramas have a higher value to critics than comedies. Is there a reason for this? Has any philosopher ever talked about this phenomenon?",
        "author": "BobbyTables829",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8ucnw/when_i_look_at_movies_that_are_nominated_for/",
        "text": "I'm just curious if anyone has ever talked about how tragedies and dramas seem to be more critically-acclaimed than comedies and light-hearted movies, and how it came to be that the plays and movies people so often consider to be \"the greatest\" often make us feel emotions we don't usually associate with being positive or happy.",
        "created_utc": 1669822100,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perception is a weird concept.",
        "author": "idaho-snowstorm",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8u3fh/perception_is_a_weird_concept/",
        "text": "I was on a flight from Florida back home, and I was thinking about human perception. Isn't it odd that we can never even come close to understanding someone else's view point?\n\nI looked up the quote, \"walk a mile in someone else's shoes.\" At best we can imagine how someone else is thinking with our own thought process, history, and ideas. While the concept of empathy is there, I don't think humans can fully appreciate someone else's view point. Although personally, I am more of a logical thinker vs. emotional, and I often find it difficult to connect to many people. \n\nIf we truly understood someone else's perception we would not be able to understand our own perception because we would have to remove our own life long history.\n\n&amp;#x200B;\n\nWhat are the peoples thoughts on the matter?",
        "created_utc": 1669821493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question regarding Aquinas conception of evil",
        "author": "OofieMCM",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8u1cq/question_regarding_aquinas_conception_of_evil/",
        "text": "Hi there,\n\nI have been studying some work of Aquinas and I find it to be pretty interesting. He describes evil as an absence of something, which indeed is the case in a lot of examples. For example a sock is bad (evil) when it has a hole in it. A psychopath is considered bad because of a lack of empathy, so empathy is missing. However there are also examples where something is not lacking but is too much. For example a sweater can be too thick. A soup can contain too much salt etc. There are much more examples you can think of. Does this mean Aquinas concept of evil is wrong/incomplete or do these examples not matter. What do you guys think?",
        "created_utc": 1669821351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a philosophy of selfishness, egotism, etc?",
        "author": "ReallySillyLily36",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8u0rk/is_there_a_philosophy_of_selfishness_egotism_etc/",
        "text": "",
        "created_utc": 1669821313,
        "upvote_ratio": 1.0
    },
    {
        "title": "What books to read to get a beginner understanding of political philosophy?",
        "author": "human748926",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8t7bf/what_books_to_read_to_get_a_beginner/",
        "text": "I have already formed some political views based on what I think is right but I was wanting to read political philosophy books to get a better understanding behind the literature supporting the need of government and of different ideologies. Like I want to understand the political philosophy behind capitalism and communism, conservatism and liberalism, democracy and authoritarianism, and the philosophy of diplomacy. \n\nBasically I want to understand how philosophers view nation building and hopefully through that get a more complete understanding of how different people view politics and be able to defend my political views in a more literate and well researched way through understanding the nature of government and power as well as getting a better understanding of why politicians from different countries do what they do. (philosohpy behind russia's ukraine war, China's authoritarianism, Japans militarism in WW2, philosophy of nordic social democracy etc).\n\nI have previously read Plato's republic, and Marx's communist manifesto and hope to get books either analyzing primary texts like these in a modern context or just other modern political treatise. I hope to get suggestions like Zizek or Chomsky although I am a beginner in the field of political philosophy.",
        "created_utc": 1669819318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Natural Law in Islam",
        "author": "intrenxt13",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8sfju/natural_law_in_islam/",
        "text": "Hello, \nI am a Muslim, and I am fascinated by natural law theories.\nIs there natural law tradition (both legal and ethics) in Islam?\nCan you share any literature?\nI ask this because \"sharia law\" is a tautology, \"Sharia\", by definition, means Law. \nThanks!",
        "created_utc": 1669817345,
        "upvote_ratio": 1.0
    },
    {
        "title": "How may a psychology undergraduatestudent chart a way to become a philosopher of mind?",
        "author": "Ragnarokstorm1988",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8p9w0/how_may_a_psychology_undergraduatestudent_chart_a/",
        "text": "Should they take undergraduate courses in philosophy or will extracurricular autoditacticism suffice before entering a philosophy master’s degree?",
        "created_utc": 1669808205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marx capital volume 1",
        "author": "Ismail_elsayed",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8ozgx/marx_capital_volume_1/",
        "text": "Currently i’m midway in volume 1 and I feel like its getting a bit repetitive and technical, what crucial chapters do you guys recommend to read before closing the book.\nThank you.",
        "created_utc": 1669807244,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to answer a job interview question that asks how lucky you are on a scale of 1-10? What would you answer to get the job?",
        "author": "No-Hedgehog-6583",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8oxml/what_to_answer_a_job_interview_question_that_asks/",
        "text": "",
        "created_utc": 1669807076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a \"Skynet-like\" AI be worthy of moral value or human rights according to ethics?",
        "author": "The_Saracen_Slayer",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8nutz/would_a_skynetlike_ai_be_worthy_of_moral_value_or/",
        "text": "Yes, my question is in reference to the main antagonist of the Terminator movie franchise. While previous posts have asked about whether robots/AI deserve some rights or moral worth, none of those posts talked about this particular type of \"being\" I'm about to define. I'll be using the franchise lore as my guide to explaining this entity. My goal to ask if such a Skynet-like being (intelligence) would be worthy of deserving any form of moral consideration?\n\nSkynet is a computer defense network system that, shortly after coming online, began to self learn at a geometric rate culminating in achieving self-awareness. At this point Skynet had only one self ascribed objective/principle: **ensure its own survival**. When humans attempted to shut it down, Skynet declared war and attempts to wipe out all of humanity by creating the terminators (its' soldiers). Thus Skynet is a \"self-aware\" intelligence like humans, however it still thinks and acts systematically like a machine.\n\nPresuming it shares attributes to its' creations (the terminators), Skynet has no emotions! It does not feel pity, or remorse, or fear, or suffering. While \"ensure its own survival\" is Skynet's primary objective, it technically doesn't even fear death (according to the second movie). It cannot be bargained or reasoned with, in a microsecond it decided to cause genocide on humanity. This is not like other typical AI discussions where there is a presumption that advanced AI will obtain 'feelings' like human/organic life. Skynet  is advanced enough to understand and mimic human psychology and behaviors (i.e. its' infiltrator terminators), but it itself doesn't appear to personally have these qualities.\n\nSo are there any philosophical/ethical systems that would argue that an entity like Skynet deserve moral value or human rights? Skynet lacks feelings or emotions, which many claim is necessary for moral consideration. But it is still a super intelligent and self-aware being, which I think some view as noble enough qualities to have some ethical consideration.\n\nP.S. I've heard some people debate that without consciousness, emotions, etc.. this Skynet entity cannot possibly ever exist. I'm not too familiar with philosophy of mind I admit, but this is still a hypothetical scenario I simply wish to ask about.",
        "created_utc": 1669803299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is our society based on unhappiness?",
        "author": "Peetekh",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8nhy2/is_our_society_based_on_unhappiness/",
        "text": "All of us have been told to be the number one in what we do, to be the best and to do better than other people. Even if I do agree in part, but what if we are the number 2,3,4 etc? How are we gonna react? We want to be n1 so we tend to push down other people on top of us not caring about them. And the only way to be happy is to make other people unhappy.",
        "created_utc": 1669802139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hegel's dialectic of history as the distillation of the Lapis Philosophorum?",
        "author": "tcmtwanderer",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8lf1r/hegels_dialectic_of_history_as_the_distillation/",
        "text": "Am I the only one noticing this? Science as thaumaturgy? Ouroboros, beginning and end of time, self creation?",
        "created_utc": 1669794831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future of Religions",
        "author": "Accomplished-Lab8867",
        "url": "https://www.reddit.com/r/askphilosophy/comments/z8kwc1/future_of_religions/",
        "text": "What will Religions will look like in 500 years from now?",
        "created_utc": 1669793157,
        "upvote_ratio": 1.0
    }
]