[
    {
        "title": "would harsher sentencing policies based on the victim being from an underprivileged group be against the principle of equality before law ?",
        "author": "ththeoryofeverything",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlmzvt/would_harsher_sentencing_policies_based_on_the/",
        "text": "",
        "created_utc": 1671011654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Colloquially, Is Materialism a Dualist Ontology?",
        "author": "msrywas",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlma5x/colloquially_is_materialism_a_dualist_ontology/",
        "text": "I understand that materialism is a monist ontology in which physical matter is all that exists. However, It doesn’t seem like anyone really believes that so when people say they are materialists/physicalists do they actually mean they are dualists?",
        "created_utc": 1671008951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good books/papers on objective truth?",
        "author": "ChickenOpen4737",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlm2jh/good_bookspapers_on_objective_truth/",
        "text": "Can anyone recommend good literature on this topic? Thanks!",
        "created_utc": 1671008154,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best works to read on the ethics of passing on one's faith to one's children?",
        "author": "Apiperofhades",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlkzfd/what_are_the_best_works_to_read_on_the_ethics_of/",
        "text": "This is a topic I've seen a lot of discourse about but I haven't seen any philosophical material addressing it, besides one essay. I'd like more general recommendations here.",
        "created_utc": 1671004000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Freud more favorably looked at in modern philosophy than he is in modern psychology?",
        "author": "wattayatalkinabeet",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zli3vz/is_freud_more_favorably_looked_at_in_modern/",
        "text": "I may be very off base, so forgive me if I’ve misunderstood anything. It’s a very prevalent belief (not sure if it’s actually the most common but I see it often) that while Freud was instrumental in the early development of psychology, many or most of his ideas are disregarded in the practice.\n\nFrom what I understand, his theories of the mind were mostly untestable and therefore had no basis in many aspects of psychology as a science.  Do his ideas still hold value in philosophy of mind or of any other areas of philosophy?\n\nFrom what I’ve heard about Freud’s teachings, they seem intuitive. I would like to read his work, but only if there is enough interest in him in philosophy since I do not care for psychology that much.\n\nThanks!",
        "created_utc": 1670994230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luck. Does it actually exist, or is it something we self-create? I absolutely believe it exists, and the entire world runs off of it….",
        "author": "ryanwscott",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlgl0q/luck_does_it_actually_exist_or_is_it_something_we/",
        "text": "",
        "created_utc": 1670989707,
        "upvote_ratio": 0.99
    },
    {
        "title": "What's destiny? why you believe/ not believe in it?",
        "author": "PlentyNovel4961",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlggp4/whats_destiny_why_you_believe_not_believe_in_it/",
        "text": "",
        "created_utc": 1670989355,
        "upvote_ratio": 1.0
    },
    {
        "title": "On Kant's text",
        "author": "MrInfinitumEnd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlg70r/on_kants_text/",
        "text": "&gt; *1. The idea of transcendental philosophy. Experience is without doubt the first product that our understanding brings forth as it works on the raw material of sensible sensations. 1 It is for this very reason the first teaching, and in its progress it is so inexhaustible in new instruction that the chain of life in all future generations will never have any lack of new information that can be gathered on this terrain. Nevertheless it is far from the only field to which our understanding can be restricted. It tells us, to be sure, what is, but never that it must necessarily be thus and not otherwise.*c For that very reason it gives us no true universality, and reason, which is so desirous of this kind of cognitions, is more stimulated than satisfied by it. Now *such universal cognitions, which at the same time have the character of inner necessity*, must be clear and certain for themselves, independently of experience; hence one calls them a priori cognitions:2 whereas that which is merely borrowed from experience is, as it is put, cognized only a posteriori, or empirically)  \n\n  \nWhat does he mean by this paragraph; especially by the italic segment that I made ?   \n\n\nFor example: my understanding brings forth my experience... because it works on the raw material (?) of sensible sensations ?",
        "created_utc": 1670988584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about logical levels",
        "author": "babayada",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlfxsy/question_about_logical_levels/",
        "text": "I have two different scenarios that don't jive. I am not a logician, mathematician, and only come to this subject by way of Gregory Bateson and a current theory of self concept that is out there.\n\nThe way I understand (or misunderstand) logical levels/types (are they the same thing?) is something like this:\n\nFruit -- Apple -- Fuji Apple -- The Small Fuji Apple I'm Eating Now\n\nEach entity is at a logical level, right? A level of abstraction or specificity, depending on how you move up or down the chain. Moving down from fruit you go to apple, which is a more specific, less abstract, representation of fruit. Likewise, moving up from apple you go to fruit which is more abstract than apple.\n\nIn programming this is called abstraction, and you sub-class from a class by using an IS A relationship.\n\nIn self concept there is the idea that from experiences we can generalize about qualities we have and from those qualities we can further generalize a more abstract self concept.\n\nThis is the process of deduction, right?\n\nWell, along one chain there is consistency... a individual small Fuji apple is a Fuji Apple and a Fuji apple is a Fruit.\n\nBut if I say, an experience is a quality and a quality is a self concept, it makes no sense.\n\nWe don't deduce the Fruit from the Apple from the Fuji Apple from the small individual Fuji Apple I'm eating... We see that there is a belonging to categories.\n\nThere is some kind of typing or categorical thing going on there that doesn't mesh.\n\nAre there different kinds of abstraction? Can deduction be called a process of generalization or abstraction?\n\nSo, I am clearly confused, and I would like to know how the one and the other relates to the process of abstraction and generalization and if you could say that in the self concept chain described whether legitimately there is a movement between logical levels of abstraction and specificity going on.\n\nThank you in advance, and apologies for my confused presentation.",
        "created_utc": 1670987870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any books on anti-patriotism?",
        "author": "Nistlay",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlftw5/are_there_any_books_on_antipatriotism/",
        "text": "I don't mean nationalism vs patriotism and all of that. I'm talking about the idea of being proud of the piece of land you were born at doesn't make much sense from a logical stand point. Sure, most of us identify with the culture and costumes of the countries we were born at, but in my mind that's not the same thing as being proud of your countries history and all. I guess my main issue here is: how can you be proud of something you had absolutely nothing to do with? I'm trying to research more and test this idea. Are there any good books on the subject?",
        "created_utc": 1670987579,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s good YouTube sources for educational philosophy content",
        "author": "whatshouldidohoney",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zld35q/whats_good_youtube_sources_for_educational/",
        "text": "Although I read philosophy sometimes I’m interested in a shorter version on someone else’s view upon a philosophical standpoint and most I can find is moron channels with made up philosophy which I guess caaaan trigger an existential reflection or something like that but rather than that most is bs",
        "created_utc": 1670980274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Schleiermacher take the meaning of a text to be what the author wishes to communicate?",
        "author": "furriesdid911",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlcn17/does_schleiermacher_take_the_meaning_of_a_text_to/",
        "text": "I'm having trouble fully understanding Schleiermacher's hermeneutics.\n\nI understand that according to Schleiermacher, interpretation is the extracting of meaning from a text following understanding. As such, interpretations can either be accurate or not, depending on their proximity to the \"true meaning\" of the text.\n\nAccurate interpretation requires first accurate understanding. However, due to stark conceptual differences between people, fully understanding one another is impossible, and as psychological understanding of the author is a necessary component of understanding a text, we can never achieve a completely accurate interpretation of a text.\n\nIs this unattainable, completely accurate interpretation (the \"true\" meaning) of a text simply just what the author intends to communicate? I know elsewhere Schleiermacher says we must first understand the text as well as the author, and then understand it better then them. Is then the meaning of a text a kind of multi-faceted entity that cannot be neatly summed up? To understand a text's meaning is then to understand what the author both explicitly and implicitly intends to communicate, the author psychologically and the historical and social context in which it was written. \n\nOr am I just completely misunderstanding things?",
        "created_utc": 1670979141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any criticisms of phenomenology?",
        "author": "StopMeIfYou",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlbmfa/any_criticisms_of_phenomenology/",
        "text": "Of course, asking for criticism of a whole l diverse and rich field, is and should be controversial. But I was indeed wondering, if there is any philosopher, especially continental, who raised questions and offered criticism of phenomenology in general, in principle, from husserl onwards?",
        "created_utc": 1670976543,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 'What is it like to be a bat', Nagel argues that reductionism cannot be used to understand consciousness. Am I correct in understanding his argument?",
        "author": "o--h--o",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlaot8/in_what_is_it_like_to_be_a_bat_nagel_argues_that/",
        "text": "The argument seems to be roughly like this: \n\nSomething for what it to be X means that X experiences life. If X is a human then it may have eyes, ears, nose, skin, and experiences sight, sound, and touch. If X is something else, maybe a shark that experiences something having to do with electrical discharge, or as a bat or dolphin it experiences a sensation of echo location. \n\nThere is something for what it is like to be a particular kind of creature such as a bat. This is a statement about the existence of such experiential phenomena. We understand its meaning in analogy with our own existence. As a person who exists I see, hear and feel tactile sensations, I can imagine other creatures experiences these senses too, and I can generalize from this and form the thought that other creatures feel different sensorial experiences that I do not experience. \n\nThere exist different sensorial experiences for different creatures. For example, bats use sonar and have neural processing architectures within their brains to use and perceive this information. Something for what it is like to be that thing is about what it is like to experience life with that kind of neural processing happening.\n\nSensorial experiences are impossible to understand if they are not themselves experienced, because to understand them means to experience them. An argument Nagel gives is that adding to or subtracting from his own experience cannot provide this understanding, because doing this is just a reimagining of himself as a human imagining being a bat. Reducing his experience by making him blind or adding to it by giving him flight is just imagining a blind person flying. How to add echolocation? There doesn't appear to be a proper analogy. Maybe echolocation is perceived as sound or vision or tactile sensation or taste or something we cannot comprehend since we don't have it. \n\nSince such experiences cannot be understood (such as what is it like to be a bat), then it is also not possible to understand consciousness through any form of reduction, since in order to understand it, a point of view must be taken where it occurs, but the point of view taken to understand it is the objective point of view (from science) which is independent of consciousness, just as a human's point of view is independent of a bat's (orthogonal to it, does not intersect, does not possess it), and therefore is outside of it and cannot 'see' it. Consciousness disappears under this objective point of view. In other words there is no objective point of view to understand consciousness, therefore there is no reduction to obtain that understanding. \n\nTherefore materialist reductionism is false because there is no point of view within it where consciousness can be understood so it cannot exist. Essentially a reductio ad absurdum.",
        "created_utc": 1670974235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discrimination",
        "author": "Aggravating_Kick784",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlai8j/discrimination/",
        "text": "Where and to what extent should the state intervene to provide safeguards against discrimination?",
        "created_utc": 1670973798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I feel euphoric each time I think or am philosophizing?",
        "author": "oxymoray",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zlag6q/why_do_i_feel_euphoric_each_time_i_think_or_am/",
        "text": "I just feel waves of euphoria when I get to conclusions of things or get to know something new or getting information in general, or when philosophizing about various topics. I feel drunk/high all the time, completely detached from reality.\nWould it be the diagnosed neurosis and probable psychosis causing it? This is one of the things I haven't talked about to any of the people.",
        "created_utc": 1670973656,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean to say something is ontologically real?",
        "author": "Time-Caterpillar",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zla8cr/what_does_it_mean_to_say_something_is/",
        "text": "I’ve been having a hard time understanding what Ontology actually is. Furthermore, I can’t seem to understand the difference between metaphysics and ontology. I read and read trying to understand the difference but for some reason it goes over my head.\n\n\nAs a simple example: lets say you have a rock. The rock exists physically. It is a perfect sphere and is composed of a single element down to the atom. You can perceive it with your senses, analyze, and idealize the rock. So your are aware of, and know it exists. But what does it mean to say that the rock is ontologically real?\n\nOr am I missing the point somewhere in my thought process?",
        "created_utc": 1670973144,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have Philosophers said about the emotion of \"surprise\"?",
        "author": "Polar_Phantom",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl9urd/what_have_philosophers_said_about_the_emotion_of/",
        "text": "I've tried looking, but I can't find much. Surprise is a curious emotion, and I imagine it poses a number of epistemological issues, for example. How it relates to knowledge, memory, prediction etc.\n\nAnd why we even have it. Why we even feel surprise - I've read that it helps people and other animals survive but drawing our attention to new stimuli. But even so, I'm curious what Philosophers think.",
        "created_utc": 1670972275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of testimony",
        "author": "Big_Meet_871",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl9n1z/philosophy_of_testimony/",
        "text": "Hi, what are good beginner/introductory books that explore the philosophy of testimony, and if someone can provide a reading list ( ie beginner, intermediate etc ) that would be ideal. Thanks.",
        "created_utc": 1670971770,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to explain the concept of abstraction in accessible terms?",
        "author": "rdef1984",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl9cot/how_to_explain_the_concept_of_abstraction_in/",
        "text": "In my work I teach communications infrastructure, and one of the early concepts involves the concept of the 'abstract' or 'mathematical' model of communication from [Shannon and Weaver](https://en.wikipedia.org/wiki/Shannon%E2%80%93Weaver_model). This is simply the idea that the model is generalisable to multiple different media, and is relevant to the class to show the strengths and weakness of reducing communication to focusing on information alone. \n\nThe problem is that the idea of abstraction or generalisation seems to be beyond the grasp of the students. There's plenty of reasons for this that are outside my control - many are post-pandemic first year students, effectively operating two years behind their peers from last year. Many students don't recognise media as a category, so the idea of a comparison between graffiti, printed books, and instant messages is difficult to begin with, however that's a part of the teaching goal with this content so it's less of a worry. They also don't generally understand that a lot of media aren't digital, so they already think that Shannon and Weaver's model is an ontological account rather than an epistemological or pragmatic one. \n\nHowever, I feel like abstraction should be easy to understand. I've tried comparisons between distance, speed, and acceleration (i.e. that each is an explanatory abstraction of a thing) given the way that high school physics is taught, but, well, that went about as well as you might think. I've tried just saying abstract/mathematics == generalised. I've tried demonstrating it practically. \n\nI was hoping that, given philosophy's focus on forms, categories, and abstraction itself, someone might be able to guide me in explaining this, or at least looking to other resources, perspectives, or pedagogic strategies, that might help to address this.\n\nI will post in r/Professors if I don't have any luck here, but I think the (very understandable) level of burnout and self-preservation might be a barrier to getting the answer I'm after, namely, how to explain the idea of abstraction to first year students?",
        "created_utc": 1670971105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nosedive episode from (black mirror) from a philosophical view.",
        "author": "BenneHEJ",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl8k12/nosedive_episode_from_black_mirror_from_a/",
        "text": "This post is for the people who've watched Black mirror (Nosedive). You don't have to answer all the questions ofcours but it would be really interesting to get one of these answered since im new at philosophy and want to learn more about it. \n\n If you could how would you break free from the system in the Nosedive society from a philosophic perspective? And would you say there is a moral about what freedom is in the series? \n\n&amp;#x200B;\n\nHow would Platon and Popper view society in the episode? What similarities/differences do you see between their ideal societies and the society in the episode? \n\n&amp;#x200B;\n\n In the episode we see how nice comments and superficial relationships (cause) lead to higher social status (effect). How would Hume and Kant see this?",
        "created_utc": 1670969256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marxism",
        "author": "SpecialistCup6908",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl8fjy/marxism/",
        "text": "Hey everyone, here’s my question:\n\n\nRegardless of your political beliefs, do you consider marxism as a science/scientific tool, or only as a philosophy.\n\nThanks in advance :)",
        "created_utc": 1670968971,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about Bogardus' paper on trans ameliorative inquiry?",
        "author": "TairaHow",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl8asg/what_do_you_think_about_bogardus_paper_on_trans/",
        "text": "https://philpapers.org/rec/BOGSIP-3\n\nHis arguments seems quite logical and methodical and no one has responded to his paper. Why? Is it because he is right?",
        "created_utc": 1670968692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do actions hold propositional content?",
        "author": "Angrysliceofpizza",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl79uc/do_actions_hold_propositional_content/",
        "text": "[removed]",
        "created_utc": 1670966333,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do philosophical arguments matter?",
        "author": "Minute-Temporary-161",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl745j/why_do_philosophical_arguments_matter/",
        "text": "Bear with me if that question is stupid, I don't have almost any knowledge about philosphy.One of my schoolmate told me about one of the arguments for god I think it was called watchmakers argument he said that as a watch must have a maker so must the universe (paraphrasing) after thinking a while I thought wouldn't god also have a creator but he said god was always present and he created universe but isn't the watch just put together rather than created he said yes but universe was created \nNow idk about the argument maybe he was right, most of my classmates do agree with him so maybe I'm not thinking right but in science we are taught to believe in evidence so why do these arguments matter? Are these arguments about what is more likely?",
        "created_utc": 1670965963,
        "upvote_ratio": 1.0
    },
    {
        "title": "is Will To Power (book) any good? i have read most of Nietzsche's work and I'm thinking about reading it. Is it entirely corrupted?",
        "author": "probably_gonnaregret",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl72lb/is_will_to_power_book_any_good_i_have_read_most/",
        "text": "",
        "created_utc": 1670965862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moral reasons and moral subjectivity",
        "author": "thepinkfranksound",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl6r2u/moral_reasons_and_moral_subjectivity/",
        "text": "Granted, you are a moral anti-realist (moral is subjective), why should you follow normative moral principle A instead of principle B? If moral is not objective, why should I for example care for others and not murder my neighbors? How can you justify and give reasons for a subjective principle? I haven't found a good answer to these questions.\n\nAlso, any good articles or litterature on this topic?",
        "created_utc": 1670965124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discrimination",
        "author": "Aggravating_Kick784",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl69vp/discrimination/",
        "text": "The right to be free from discrimination is often in conflict with the freedom people claim to act on the basis of prejudicial attitudes and thought. For instance, I might choose to have friends who have the same racial/ethnic/gender identity as myself and feel that my right to choose these friends is not to be interfered with by anyone. On the other hand, discrimination is increasingly recognized as causing social harm necessitating the imposition of a duty against acting in a discriminatory way by certain social actors.\nWhere and to what extent should the state intervene to provide safeguards against discrimination?\nfeel free to use personal experience, news stories, etc. critically what do you think",
        "created_utc": 1670963989,
        "upvote_ratio": 1.0
    },
    {
        "title": "The importance of context for judging actions morally",
        "author": "DieAufgabe",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl61jd/the_importance_of_context_for_judging_actions/",
        "text": "I recently had an argument with someone about the moral character of an artist who consistently did bad things in their life, and whether or not we should be able to appraise said person as a bad person or not, given that they had childhood trauma.\n\nSo here's my question. If we had two people with a morally identical profile — they've both committed the same morally reprehensible acts, done the same good deeds, etc. — and are identical biographically except one had childhood trauma and one didn't, would we be inclined to think that the one who had childhood trauma is a better person than the one who didn't, because the one with childhood trauma has a psychological profile which can explain why they did the acts they did and the other didn't?\n\nPersonally, I think that the context doesn't matter, and that we judge actions based on their moral content rather than the context behind the actions. But I'm interested to hear what the subreddit has to say. I know that it has been shown in a recent study (https://www.nuffieldfoundation.org/news/children-exposed-to-poverty-and-trauma-more-likely-to-offend-as-adults) that \"a history of adverse childhood experiences and trauma in adulthood – such as bereavement, relationship breakdown, and having a serious accident or illness – also affected people’s ability to stay away from crime.\"\n\nSo maybe I'm being too harsh? I don't know, but I really do think that since sociology is descriptive and that morality is prescriptive/normative in prescribing what we ought to do, that background shouldn't matter when it comes to judging someone's character for the acts they did.",
        "created_utc": 1670963436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Ayn Rand so popular yet rejected in more serious academic circles.",
        "author": "Queasy_Builder2501",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl5agd/why_is_ayn_rand_so_popular_yet_rejected_in_more/",
        "text": "I dont know much or havent Read anything of hers but she seems pretty relevant as a refference amongst certain folks.",
        "created_utc": 1670961674,
        "upvote_ratio": 1.0
    },
    {
        "title": "What constitutes good online moderation?",
        "author": "hookdump",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl213p/what_constitutes_good_online_moderation/",
        "text": "I've been thinking a lot about the controversies surrounding Twitter and its recent changes in moderation and safety policies, in light of my (modest) knowledge of political theory and philosophy of language. I'm thinking mainly of Langton, Dworkin, Austin, Cappelen, Waldron.\n\nA few questions arised in my mind. I'd love to hear your thoughts; ideally anchored in relevant philosophical literature.\n\n**1) Which online spaces warrant (or require) moderation? Why?**\n\nFor such spaces:\n\n**2) What constitutes good and bad moderation?**\n\nConsidering various possible answers to those questions, I think, one ends up with this one:\n\n**3) Can speech be harmful?**\n\nIf so...\n\n**3a) How does that work?**\n\n**3b) What kinds of harm?**\n\n**3c) How harmful are we talking?**\n\nI'm particularly interested in views that take into account both care for free speech, but also sensitivity to the harms speech can cause. (In other words, positions that try to steelman and reconcile both \"sides\" of the argument).",
        "created_utc": 1670954018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice on how to overcome doubt? From a philosophical perspective of course",
        "author": "joequinn88",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl1d64/any_advice_on_how_to_overcome_doubt_from_a/",
        "text": "For some context my therapist says I most likely have “low grade OCD”. I have absolutely no idea where I stand on anything because of constant doubt. Most of the advice I’ve read or have been told is basically to stop overthinking and to just act, but I’m not paralyzed by my doubt I just can never say anything with certainty. My doubt also isn’t necessarily self doubt it’s more along the lines of “can I ever really know anything”.\nSorry if this is bad formatting or something I’m completely brain dead at the moment lol.",
        "created_utc": 1670952475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the socratic method misunderstood? Is socrates misused, for example by people doing classical education?",
        "author": "-_ABP_-",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl0r6n/is_the_socratic_method_misunderstood_is_socrates/",
        "text": "Has socrates become a talking point? \n\nI don't know about politics but heard people called conservatives mention him often. \n\nAnd i had a middle school teacher who seemed to call asking students a question or few, or doing q&amp;a, socratic. Is that Socratic?\n\n I don't mean the ideas about plato's reliability, unless those help here?",
        "created_utc": 1670951088,
        "upvote_ratio": 1.0
    },
    {
        "title": "can you direct me to any works by Heidegger or Levinas that deal with the question of the animal?",
        "author": "PJ_Gallagher",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zl07dd/can_you_direct_me_to_any_works_by_heidegger_or/",
        "text": "I am curious and am not sure where to start with the above mentioned philosophers,I would also appreciate any secondary sources on Heidegger and Levinas on the question of the animal.",
        "created_utc": 1670949798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meta - ethical non - naturalism",
        "author": "Gjmac24",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkzyrs/meta_ethical_non_naturalism/",
        "text": "Does anyone have any good papers or resources against meta-ethical non-naturalism?",
        "created_utc": 1670949232,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some book recommendations for having a good conceptual understanding of General Relativity.",
        "author": "hala3mi",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkzc73/what_are_some_book_recommendations_for_having_a/",
        "text": "I am looking for a book that conceptually clarifies General Relativity and discusses the philosophical implications and debates surrounding it.",
        "created_utc": 1670947794,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I say something like \"Vanilla Ice Cream is the best because it sells the most out of any Ice Cream\" but it doesn't, am I still giving an Opinion or am I lying? Or am I just saying an untruth?",
        "author": "ReallySillyLily36",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zky64l/if_i_say_something_like_vanilla_ice_cream_is_the/",
        "text": "",
        "created_utc": 1670944589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question to compabilists regarding free will(and other free will believers):How do you argue the fact that humans can't predict their own thoughts?",
        "author": "Dramatic-Play-4289",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zky0f7/question_to_compabilists_regarding_free_willand/",
        "text": "",
        "created_utc": 1670944159,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly was George Sorel's view on the concept of a political party and organisation?",
        "author": "RowenMhmd",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkx9wt/what_exactly_was_george_sorels_view_on_the/",
        "text": "",
        "created_utc": 1670942249,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the book to read that compares the different views on morality and ethics?",
        "author": "eyefalafel",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkwd1g/what_is_the_book_to_read_that_compares_the/",
        "text": "Sorry if this question has been asked already",
        "created_utc": 1670939827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you tell me more about this ninja paradox?",
        "author": "Frostzeichen",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkuwzp/can_you_tell_me_more_about_this_ninja_paradox/",
        "text": "Okay so this one's not really an official paradox that I've read about, but something I thought of after watching a show called \"Hitoribocchi\".\n\nThe paradox goes like this:\n- A friend tells you that you are a ninja even though you know that you are not. So you try to prove it.\n- First, you tell them that you are a not a ninja. Your friend says you are lying. You are a ninja.\n- Second attempt, you tell them that you are a ninja. Your friend believes you. Then you tell them that because ninjas will not tell you if they really are ninjas to hide their true identities, you are not a ninja because you said that you are one. Your friend replies that by admitting you were a ninja and then contradicting yourself, you were trying to deceive them so they would believe that you are not a ninja. Because that is a ninja thing to do, it does not break your previous argument, nor theirs. So you are still a ninja.\n- Third, you demonstrate ninja-like things. You fail at these demonstrations. Your friend says you are trying to deceive them again by showing you that you are incapable of ninja-like things. Hence, you are a ninja.\n- Fourth and last attempt, you insist that you are not a ninja. Your friend insists back that you are not a ninja. In the end, you gaslight yourself to believing that you are a ninja.\n\nAnyways, I'm sure that this has already been talked about before. But I'm just not sure where. If I may give a guess though, this has something to do with \"innocent until proven guilty\" at court.\n\nYou can practically replace ninja with anything else - a criminal, thief, pervert, spy, assassin, or even a genius, doctor, or superhero. I can't think of a way to counter an assumption about my identity if I were \"assumed\" to be something first.\n\nBut if we go around the other way, it becomes easier to do the opposite. If, say, I am assumed to *not* be a ninja, then I can counter that assumption by proving my ninja-like abilities.\n\nAnyways, I wish I could read more about what other people have to say about this. The example looks seriously too good to not have been used as an example before, but I can't seem to find out where.",
        "created_utc": 1670935693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any thoughts?",
        "author": "babydevilschild",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zku0ws/any_thoughts/",
        "text": "I'm brainstorming ways in which the study of epistemology, the philosophy of mind/consciousness (free will included), and the philosophy of language can help us solve economic and political problems in our increasingly interconnected world. In other words, how are these subjects relevant to the economic and political problems we face today?\n\nIf you have any ideas, I would love to hear them. Thanks.",
        "created_utc": 1670932849,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the current \"paradigm\" in Philosophy and Sciences?",
        "author": "UnnecessaryMovements",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zktp94/what_is_the_current_paradigm_in_philosophy_and/",
        "text": "My professor in philosophy believes we are in a post-modernism which to him the paradigm is \"decentered\" (from Cosmocentrism to Theocentrism to Anthropocentrism). \n\nAre paradigms predictable and describable or is it retrospective and can only be observed after it happened?",
        "created_utc": 1670931726,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I reconcile Mill's views in On Liberty about free speech with the idea of being intolerant about intolerance?",
        "author": "SparklesMcSpeedstar",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zktbjc/how_do_i_reconcile_mills_views_in_on_liberty/",
        "text": "First of all, bear with me. Any remarks that I make I assure you is purely in pursuit of understanding, not fascism - or at least I don't think so. I'm also stupid, and I haven't fully explored all of J.S Mill's books, although I really should when I get the free time.\n\nAnyways, one of Mill's main point in his fantastic book On Liberty is the idea that all ideas, no matter how stupid, should be allowed a voice. This is because he believes that all ideas bring some sort of public value, and society would be the better for it. Even the most moronic of ideas should be brought to public attention if only to completely shut it down through discourse, displaying to the world how utterly moronic it is so future generations do not repeat the same mistake. \n\nAt least, that's how I understood it - I was merely a 2nd year undergrad when I first came across it. I really liked that philosophy, because one of the ways I learn new things is by being wrong and having someone else or experience itself correct me. \n\nHow do I reconcile this view with the idea that Fascist and Racist views should be deplatformed? I understand that we should be intolerant about intolerance, but I fail to see a way to reconcile this and Mr. Mill's views. Is it due to the rise of internet as a platform, which Mr. Mill could not possibly account for? Is there some information I'm missing about how J.S Mill views this hidden in his other books?",
        "created_utc": 1670930434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good audiobooks?",
        "author": "Aggravating-Ad-8191",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkt1k7/any_good_audiobooks/",
        "text": "\n\n\nI started reading meditation by marcus aurelius , translated by Gregory Hayes, and am enjoying it but I don’t have time to read at work, and usually listen to music all day and want to try a audiobook, specifically the enchiridion or the discourses, I would like one with good narration and that has language that is clear and “simple” to understood (like Gregory Hayes translation of meditation) , as always if this is the wrong sub Lmk so I can ask somewhere else, Thankyou and have a nice day/night",
        "created_utc": 1670929461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virtues &amp; Failing to Notice QUESTION.",
        "author": "QuestioningCarvana",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zksdqb/virtues_failing_to_notice_question/",
        "text": "[removed]",
        "created_utc": 1670926860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions on categorisation within moral realism",
        "author": "zomskii",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zks1jh/questions_on_categorisation_within_moral_realism/",
        "text": "I have a theory of meta-ethics, and am just wondering how it relates to other positions. I’m looking for clarity around the difference between something being true, and something being real.\n\nIn brief, I believe that some moral decisions can be made using logic alone, and therefore some ethical statements are objectively true. However, these are always context specific, never general. \n\nAn analogy could be drawn with decisions made in chess.\n\nMy view is that statements such as “It is wrong to steal” are not true, in the same way that the statement “It is wrong to sacrifice your queen” is not true. I don’t think that any such general statements are true.\n\nHowever, I do believe that moral statements such as “In situation A, you should do X” can be true. Similarly, in a specific point in a chess game, the statement “The player should move their bishop to b2” could be true.\n\n1. My understanding is that Moral Realism is the view that there are moral facts. Would a statement in the from “In situation A, you should do X” be considered a fact? By analogy, is it a fact that “The player should move their bishop to b2”?\n2. My understanding is that Ethical Naturalism is the view that ethical propositions are made true by objective features of the world. Would ‘logic’ be considered as an objective feature of the world?\n\nFinally, I don’t believe that there are moral properties or moral features of the world. When I talk about some moral statements being true, it is not because of any relation to moral rules. The statements are objectively true, if the proposed course of action is logical, given the situation.\n\nIs my position a form of “moral realism”?\n\nIs my position a form of “ethical naturalism”?",
        "created_utc": 1670925525,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m in psychological distress after reading about and researching philosophy.",
        "author": "MrRipe",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkrlnh/im_in_psychological_distress_after_reading_about/",
        "text": "I’ve been going through an existential crisis for the past few months and I’ve been researching and learning about philosophy for several hours every day. I’ve familiarized myself with many arguments for and against the existence of god, free will, meaning to life, the existence of things like love and beauty, and I’m just exhausted. I’ll read a philosopher whose ideas give me hope, and then I’ll read another philosopher who seems to shoot those ideas down completely and makes it seem like the only mature way to look at life is that it’s completely meaningless and my brain is hallucinating everything for me. At this point I’m questioning if I’m real, my friends and family are real, my environment is real, and ultimately if I should continue living if I’m just living in an illusion. I’m starting to feel scared and trapped in my own body with no way out, and it’s frightening me. Should I stop reading about philosophy? How can I stop spiraling into intense depression because of these things?",
        "created_utc": 1670923738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone give me a definition for epistemic dependence ?",
        "author": "Ski_66",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkri31/can_someone_give_me_a_definition_for_epistemic/",
        "text": "this was a question on one of my phil assignments and just curious if anyone has a good definition.",
        "created_utc": 1670923319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about form and attributes in Aristotle's Metaphysics.",
        "author": "TheChickenMan2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkp70f/question_about_form_and_attributes_in_aristotles/",
        "text": "I'm at book 7 in Aristotle's Metaphysics and having trouble understanding it. I'm wondering how if the material (or substratum) is without prediction how can things have attributes? Do forms contain attributes?",
        "created_utc": 1670914711,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Judith Butler view the body?",
        "author": "Acceptable-Zebra-813",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkndes/how_does_judith_butler_view_the_body/",
        "text": "I'm currently going over Gender Trouble for an essay I'm writing, and it seems that I understand what Butler claims the body is *not*...\n\nThey say, the body is \"*not* a surface\", \"but as a series of boundaries, individual and social, politically signified and maintained\"... Now I get this idea that we \"presuppose\" the body as this \"mute\" site upon which \"culture\" is then thrusted, and that this can reinforce the nature/culture binary. \n\nHowever, they then speak about the body: \"If the body is not a “being,” but a variable boundary, a surface whose permeability is politically regulated, a signifying practice within a cultural field of gender hierarchy and compulsory heterosexuality, then what language is left for understanding this corporeal enactment, gender, that constitutes its “interior” signification on its surface?\"\n\nSo, first they say the body is a boundary, but then they also say the body is a surface and speak about the body as if it *has* boundaries, but THEN the body is a signifying practice??... like I just don't concretely understand what role (or multiple roles) the body plays here. \n\nFrom what I understand, Butler views gender as \"performative, acts\" (similar to Austin) that \"subjectivates\" subjects through their unconscious cited repetition of gendered acts. This makes sense to me, seems very concrete. But I don't understand their theory of the body--is it a \"site\" where these gendered acts take place (it doesn't seem that this is the case, since they keep saying that it is NOT this, even though this answer seems to make the most \"sense\"), is the body itself a discourse (this makes the least sense to me, despite some secondary lit saying this is more or less the correct interpretation), or is it a construct of discourse? \n\nDon't explain like I'm 5, but like I'm an undergrad trying to write a final essay, who also genuinely cares about understanding Butler and theory but only has a few classes worth of interactions with post-structuralism.  thank you for your help!",
        "created_utc": 1670908948,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if we can only \"live\" so much?",
        "author": "Cookie_Spiritual",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkn8hi/what_if_we_can_only_live_so_much/",
        "text": "What if we can only \"live\" so much?\n\nWhat if some people can only live/experience so much before there's nothing left to do, but die?\n\nAnd what if some people simply get there\nfaster than others, and there's nothing left to\ndo, but die young?",
        "created_utc": 1670908552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a good global history of philosophy?",
        "author": "rhyparographe",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkly8q/is_there_a_good_global_history_of_philosophy/",
        "text": "I have a reasonable grasp of the history of European and Christian philosophy, scarcely at all the history of philosophy in China, the Jewish diaspora, Slavic countries, the mostly untranslated Sanskrit corpus, etc. Rather than jump into specific regional histories, I am looking for a bird's eye view of the whole of philosophy whenever and wherever it has arisen, one which takes some pains toward regional completeness.\n\nAre there any publications that present a good global history of philosophy of the kind I describe? Maybe such a venture could only be undertaken in adequate depth as a series of volumes, with specialists by region, but I'm hoping there is something briefer which is still of scholarly value. If nothing else, I'd be happy with a guide to global historical philosophical literature, again with regional completeness as a priority.",
        "created_utc": 1670904823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any flaws in McLuhans reasoning within his work “The Medium is the Message”?",
        "author": "rylyvy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkllil/are_there_any_flaws_in_mcluhans_reasoning_within/",
        "text": "",
        "created_utc": 1670903813,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we had to, could we put 'formal fallacies' under the category of 'informal fallacies'?",
        "author": "StunningMango998",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkl4q0/if_we_had_to_could_we_put_formal_fallacies_under/",
        "text": "If there were no classes of \"formal\" and \"informal fallacies\", and we had to place \"formal fallacies\" under the categories of \"informal fallacies\" (Fallacy of irrelevance, inappropriate presumptions, etc), where do you think we would put it under? \n\nDo you think it could be under the category of \"fallacy of inappropriate presumptions\"?\n\n(By \"formal fallacy\", I am referring to self-contradictions, and self-defeating arguments).",
        "created_utc": 1670902493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does philosophy have limits?",
        "author": "the48s",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkl2o6/does_philosophy_have_limits/",
        "text": "",
        "created_utc": 1670902326,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we suppose that philosophy consists of questions, then when will these questions, which are philosophy in the first place, be resolved?",
        "author": "the48s",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkl0oy/if_we_suppose_that_philosophy_consists_of/",
        "text": "",
        "created_utc": 1670902177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a name for the stronger version of Solipsism?",
        "author": "Gutscazerk",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkjx5h/is_there_a_name_for_the_stronger_version_of/",
        "text": "Solipsism is about doubt of anything but yourself existing. So what is the name of doubt of all things, including your own existence?\n\nDo any philosophers write about the idea that you cannot be certain even of your own existence? It seems to follow that since thinking itself can be flawed and logic may be wrong, just because it appears we have thoughts does not mean we must exist.",
        "created_utc": 1670899193,
        "upvote_ratio": 1.0
    },
    {
        "title": "is the trend in philosophy of law and normative ethics that retroactive laws are bad ?",
        "author": "ththeoryofeverything",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkjhy3/is_the_trend_in_philosophy_of_law_and_normative/",
        "text": "Why is that ? Clearly some retroactive laws are better than others that don't impose punishments",
        "created_utc": 1670898058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any texts on the relationship between Lacan and Derrida, as well as on Zizek and Derrida?",
        "author": "Toa_Ignika",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkixlp/are_there_any_texts_on_the_relationship_between/",
        "text": "I am reading *The Sublime Object of Ideology* and I’m very ambivalent about Zizek’s critique of Derrida. I have also had difficulty with *The Purloined Poe* in the past, and would love to read a systematic exploration of the interaction between Lacan and Derrida.",
        "created_utc": 1670896613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Genuine question about intentionality",
        "author": "nochillmarchill_",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkipho/genuine_question_about_intentionality/",
        "text": "On your philosophical perspective—what does intentions mean? And what are the basic steps on how to implement intentionality, especially during times when your actions are questione",
        "created_utc": 1670896008,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the main views on the question of what “good” and “bad” mean?",
        "author": "Lokokan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkhn94/what_are_the_main_views_on_the_question_of_what/",
        "text": "This question is motivated by the comments in [this](https://www.reddit.com/r/askphilosophy/comments/zjtz2u/what_does_it_mean_if_morality_exists_ie_if_moral/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) thread. \n\n“Good” and “bad” clearly have emotive meaning. So at a basic level we can immediately infer that when someone uses the word “good” they approve of whatever is being described (and disprove in the case of “bad”). A commenter in the above thread also made the point that “X is bad” also has the meaning that “you shouldn’t do X”. \n\nBut as someone else pointed out, it’s hard to know what “you shouldn’t do X” even means. Whenever I have used the word “should”, I have actually meant “given X, you should (or should not) do Y”. So “you should study hard” implicitly assumes that you should study hard *if you want good grades*. \n\nI guess I’m asking (1) can we get any more precise meaning for the words “good” and “bad”, and (2) what does “you should (or should not) do X” in the absence of a conditional even mean?",
        "created_utc": 1670893248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about Nicomachean Ethics",
        "author": "JohnDuberson",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkgr82/questions_about_nicomachean_ethics/",
        "text": "I've read everything in the book up to book 4, but it seems that after that Aristotle goes on a long description of every virtue. In all summaries and general overviews of the book, I see them talk about the Golden Mean, eudaimonia, describing how the good life is the virtuous one (all stuff that's been covered in Books 1-3). Is there anything significant in the following books? If so, which books would you reccomend. Not a philosophy student, just looking for stuff applicable in my daily life. Thank you!",
        "created_utc": 1670890976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plantinga’s free will defense and sensus divinitatus",
        "author": "ibedumbb",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkfrrl/plantingas_free_will_defense_and_sensus/",
        "text": "Hi, I have been thinking about Plantinga’s free will defense and the relationship that this might have with his sensus divinitatus.\nPretty much, wouldn’t believing that some people have a better sensus divinitatus at birth is an obstruction to free will? If a person, like Plantinga, is born with a good sensus divinitatus they will know that God exists, therefore making the repercussions of doing evil (hell) more real. Me, a person who cannot sense the divine, might be less compelled to do good because I am not as aware of God as he is. Wouldn’t that give him an unfair advantage in knowing to do good? Wouldn’t that make free will an unfair deal, or not truly free will?\nI guess I don’t really understand how Plantinga can believe in both without contradicting himself, but I don’t know if it actually is a contradiction of if I’m misunderstanding him.",
        "created_utc": 1670888585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any philosophers who wrote on a) finding meaning in suffering or b) meaninglessness of suffering?",
        "author": "beinghumansucksass",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkf4kb/are_there_any_philosophers_who_wrote_on_a_finding/",
        "text": "Thanks a lot for any recommendations.",
        "created_utc": 1670887066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nietzsche BG&amp;E 13, 20",
        "author": "SongOfS8",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkepjf/nietzsche_bge_13_20/",
        "text": "I've began reading Nietzsche's Beyond Good and Evil, but I don't quite understand his views on causation and teleology. Sections 13 and 20, for example, almost seem contradictory to me, though I am a bit ignorant.\nDoes Nietzsche argue against the principle of causation and/or teleology in 13 and other sections? If so, does that mean section 20 is a contradiction on his part, as it seems he is arguing that \"the spell of certain grammatical functions is ultimately also the spell of physiological valuations and racial conditions,\" or that this determines what kind of philosophical ideas come from a region? Does teleology/causation even play a role in this? And what does Nietzsche think about causation and teleology?",
        "created_utc": 1670886088,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question on objective ethics terminology",
        "author": "Capital_Secret_8700",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkeo4q/a_question_on_objective_ethics_terminology/",
        "text": "So, in Kantian ethics, there are categorical and hypothetical imperatives.  I was wondering if these terms were specific to his ethics. Would it be accurate to say that a utilitarian’s categorical imperative would be to maximize wellbeing and minimize suffering? Would it also be accurate to say that a theist’s categorical imperative is to worship God and follow his commands? Or does the term not apply here?\n\nI just want to be clear when conversing with others about ethics.",
        "created_utc": 1670886010,
        "upvote_ratio": 1.0
    },
    {
        "title": "lacan and sarte",
        "author": "Cs-MoP",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkef1i/lacan_and_sarte/",
        "text": "What are the differences between sartes gaze and lacans mirror stage. Or are they the same thing",
        "created_utc": 1670885438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone ever truly happy or fulfilled while alone?",
        "author": "Someones_Heree",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zke5tm/is_anyone_ever_truly_happy_or_fulfilled_while/",
        "text": "You always hear about people wanting to be alone, cutting people off, taking time off for themselves in some search for self improvement but does that ever work? Are these people ever truly happy being by themselves? Maybe it sounds like a weird question, but I’ve never heard of these success stories. They begin to exhibit behaviors or do things that seem like a distraction. Can humans truly be happy by themselves? If so how? How do you learn to enjoy your own company? It seems like most people just become more miserable after doing this thing that seemed like it would save them, now they’re all alone with nothing to show for it.",
        "created_utc": 1670884868,
        "upvote_ratio": 1.0
    },
    {
        "title": "what forms of philosophy believe that consciousness does not exist or reality itself is false? i’m simply interested in the theory",
        "author": "Raven_Requiem",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zke3cv/what_forms_of_philosophy_believe_that/",
        "text": "",
        "created_utc": 1670884718,
        "upvote_ratio": 1.0
    },
    {
        "title": "What counterpoints are there to Susan Wolf's 'reason view' argument for compatibilism?",
        "author": "Blackblood909",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkd0m9/what_counterpoints_are_there_to_susan_wolfs/",
        "text": "I have a 5000 word assignment I am writing, discussing Susan Wolf's reason conception of moral responsibility, which claims that someone is only morally responsible for an act if they are able to act in accordance with what is 'good and true' at the time of the act. However, I can barely think of enough to fill 3000 words of analysis about it: the only potentially controversial points I can really think of are the requirement of moral realism, as well as the definition of 'could have acted differently'. I want to talk about more than that, but everything else just seems to be uncontroversial definitions, or simply Wolf outlining her view with examples and the like. Is there anything else I've missed?",
        "created_utc": 1670882482,
        "upvote_ratio": 1.0
    },
    {
        "title": "is theft immoral or is it just unlawful?",
        "author": "WillingnessEasy7042",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkczir/is_theft_immoral_or_is_it_just_unlawful/",
        "text": "From large corporations obviously.",
        "created_utc": 1670882418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Will and The Principle of Avoiding Blame",
        "author": "FizzayGG",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkcqs4/free_will_and_the_principle_of_avoiding_blame/",
        "text": "Hi everyone,\n\nI recently read a paper by GK Harrison on an alternative to the Principle of Alternative Possibilities (PAP) called the Principle of Avoiding Blame (PAB)\n\nPaper can be downloaded [here](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=https://periodicos.ufsc.br/index.php/ethic/article/download/14698/13463/45336&amp;ved=2ahUKEwjY3bG___T7AhW__rsIHQKeDgoQFnoECCwQAQ&amp;usg=AOvVaw3rGHnKZMFk6fm8kzgVwLGf)\n\nI'll try to summarize the ideas here. For reference, this is what I mean when I use these terms on this post\n\nPAP: A person is morally responsible for what they've done if, and only if, they could have acted otherwise \n\nPAB: A person is morally responsible for what they've done if, and only if, they could have avoided blame\n\nCompatibilism: Free will is compatible with Determinism. We couldn't have acted otherwise, but we are still responsible for our actions. Free will is simply acting on our desires without external impediments or coercion. (I know not all compatibalists would sign off on this, but it's a popular view that I want to discuss)\n\nThe Frankfurt Case put forward a situation where someone was unable to act otherwise, yet was still responsible for his actions. Therefore PAP is false. This is a popular argument in favour of Compatibalism\n\nHarrison's paper concedes this, however he points out that The Frankfurt Case doesn't put forward a situation where someone couldn't have avoided blame, yet was morally responsible for their actions. Jones could have chosen not to shoot the president, and have the mind control chip come online. Sure, he couldn't have done otherwise, but in this outcome we would not have blamed Jones for his actions.\n\nPAB seems intuitive. How can we hold someone responsible when their avoiding blame is impossible? Can we come up with a situation where someone couldn't have avoided blame, but we still hold them responsible? \n\nMy questions are these:\n\n1. Is there something wrong about the PAB?\n\n2. Assuming we aren't capable of having acted otherwise, how is it possible for us to avoid blame for our actions?\n\n3. If a compatibilist wouldn't hold Jones responsible when the mind control chip causes his actions, how can we hold him responsible when determined influences cause his actions? What's the difference? (Let's assume the chip doesn't just make Jones shoot the president, but makes him want to shoot the president as well)\n\nCheers everyone!",
        "created_utc": 1670881899,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a good beginner novel for someone wanting to explore absurdism?",
        "author": "SnooRegrets5558",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkcpwa/what_is_a_good_beginner_novel_for_someone_wanting/",
        "text": "",
        "created_utc": 1670881845,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there arguments against the \"overvaluation\" of artists in society ?",
        "author": "Roundaboutan",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkbuqf/are_there_arguments_against_the_overvaluation_of/",
        "text": "I saw a movie by Hong Sang Soo in which a director is a moron who has average conservative ideas who mades movies instead of a free spirit who has understood the meaning of life.\n\nAre they philosophers who critizices the idea that artists are superior being in front of the society ?",
        "created_utc": 1670879990,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the arguments against the individual \"valorization\" of artists ?",
        "author": "EscalonVizard2",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zkbimf/what_are_the_arguments_against_the_individual/",
        "text": "[removed]",
        "created_utc": 1670879272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of survival as ethical?",
        "author": "Altruistic_Ad_0",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zka5mu/philosophy_of_survival_as_ethical/",
        "text": "I have been writing on my own about survival as being what democracies, markets, people should optimize for. I felt survival, to be born, grow, reproduce and die is fundementals to put existence. And that in the history of philosophy, survival has somehow has been forgotten. I read a lot, but I'm pulling a blank here. It's also hard to Google. Nietzsche wants us to be powerful, anarchists want us to be equal. I figured this line of thinking would fall under utilitarianism, but they tend to want more happiness rather than more survival. \n\nWhat can I read? Where can I be redirected?",
        "created_utc": 1670876348,
        "upvote_ratio": 1.0
    },
    {
        "title": "For PhD applications: Is an invitation to visit the campus for a recruitment weekend or interview a tentative acceptance, or another step in the screening process?",
        "author": "Seek_Equilibrium",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk9q6k/for_phd_applications_is_an_invitation_to_visit/",
        "text": "I know in a lot of fields, PhD applicants are invited to interviews and then only a subset of those are offered an acceptance, depending on how those interviews go. My experience so far in the philosophy PhD application process has not given me a clear sense of what these invitations mean. The one invitation I’ve (unofficially) been notified of so far sounded, from the tone, like I will be accepted and they are hoping to convince me to choose them. Is this how I should expect it to be for any other invitations to visit campuses that I receive, or should I brace myself to interview like my life depends on it?",
        "created_utc": 1670875393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you choose to live only for thinking and enjoying from it?",
        "author": "Baha8484",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk9p41/would_you_choose_to_live_only_for_thinking_and/",
        "text": "Would you choose to live if you have no communication with outside of your brain?\n\nI was thinking about the relationship between pleasure and life, the question came to my mind that if I don't have any communication/connection with outside of my brain at a sudden point (for example loosing the abilities of seeing, smelling, hearing, touching, tasting, and talking) whether I would choose to live in such a condition.\nI think I live for all the pleasure I can take from my life normally so on that condition I will only have two types of pleasure: first one is from imagination and remembering of some nice scenarios/stories for me or someone else to enjoy just like enjoying from memories, stories, and movies. Second one is reaching some new knowledge, in this case trying to come up with new theories and reach new ideas only from what I have already known as informations.\nBut from the first case I also could be sad just after remembering or imagining some good thing because of my inability to do them never again. \nSo, I think if I'd choose to live I would only be living for thinking, and this is quite a tough choice for me...",
        "created_utc": 1670875326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should the apriori confidence in a theory affect whether or not you should believe it?",
        "author": "eth_trader_12",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk9ayg/should_the_apriori_confidence_in_a_theory_affect/",
        "text": "Suppose I have a coin and I’m standing beside my friend. So far I’ve tossed three heads. My friend says “goddamn, you just keep landing heads. It would be crazy if the next ten tosses are heads.” Suppose the next ten land on heads. Let’s call this scenario A. \n\nNow assume the same initial conditions. But instead, your friend says, “I’m going to be honest, I can control these tosses with my head. The next ten will be heads. I’m being serious, my mind is influencing this.” Now let’s assume the next ten are heads. Let’s call this scenario B. \n\nShould one attach greater likelihood to the hypothesis that his prediction somehow causally played a role on the coin tosses in scenario B vs Scenario A? Why or why not?",
        "created_utc": 1670874475,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 48 laws of power = sociopathy?",
        "author": "phine-phurniture",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk851x/the_48_laws_of_power_sociopathy/",
        "text": "Perhaps I am reading into Greene's book a bit much but from  yalls perspective am I right?",
        "created_utc": 1670871965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has the philosophical concept of Eternal Recurrence been debunked?",
        "author": "Icthysia",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk7joq/has_the_philosophical_concept_of_eternal/",
        "text": "So one of the things that jumped out at me from looking at some of Nietzsche's work is the concept of eternal return or eternal recurrence, and I know that a lot of people will argue that it's a thought experiment and it's not meant to be taken literally, but the idea of living the same life over and over again is honestly terrifying to me, and I think it would be scary for a lot of other people. As an atheist, I get a lot of comfort from the idea that death is final, that there's no other life after this.\n\nThat's why I'm wondering if recently there's been anyone that's debunked or disproven eternal recurrence, or at the very least, given some substantial reasons why it's not true.\n\nThe best proof I've heard so far is that we don't really have any evidence that it is, beyond looking too deeply into cosmological models of the universe and ideas like the Big Bounce.\n\nWhat do you all think about this?",
        "created_utc": 1670870731,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do y'all feel about Nietzsche, and have you actually read his stuff?",
        "author": "AnthonyJackalTrades",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk7ayd/how_do_yall_feel_about_nietzsche_and_have_you/",
        "text": "",
        "created_utc": 1670870252,
        "upvote_ratio": 1.0
    },
    {
        "title": "writing on scientism, looking for the best articles or book chapters on the subject, any suggestions?",
        "author": "hi_sigh_bye",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk6ung/writing_on_scientism_looking_for_the_best/",
        "text": "",
        "created_utc": 1670869268,
        "upvote_ratio": 1.0
    },
    {
        "title": "The fact that John Locke bought stocks of a slaver company affects his philosophy in some way?",
        "author": "gringawn",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk666f/the_fact_that_john_locke_bought_stocks_of_a/",
        "text": "He starts his magnum opus saying \"Slavery is so vile and miserable an estate of man, and so directly opposite to the generous temper and courage of our nation; that it is hardly to be conceived, that an Englishman, much less a gentleman, should plead for it.\" But then he buys RAC stocks\n\nHow can it be explained?",
        "created_utc": 1670867830,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have been reading Kierkegaard's Either Or and this part is particularly difficult for me to understand. Please explain this part to me.",
        "author": "Don_Icy",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk5bf7/i_have_been_reading_kierkegaards_either_or_and/",
        "text": "Someone please explain this part to me from Either/Or by Kierkegaard\n\n\"Since sensuality in general is what is negated, it first comes into view, is first posited, through the act that excludes it by positing the opposite, positive principle. As a principle, power, a system in itself, sensuality was first posited with Christianity, and to that extent Christianity has introduced sensuality to the world.\"",
        "created_utc": 1670865972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy PhD",
        "author": "JustinB1016",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk5ak2/philosophy_phd/",
        "text": "I graduated college a few years ago and have been considering becoming a philosophy professor. Would that be a mistake?",
        "created_utc": 1670865919,
        "upvote_ratio": 1.0
    },
    {
        "title": "What books published in 2022 provide an accessible and engaging overview of recent research in an area of philosophy today?",
        "author": "lux514",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk4rqd/what_books_published_in_2022_provide_an/",
        "text": "I am looking for general recommendations for new books for armchair philosophers.  It seems that most intro books are about dead guys, and I feel I'm missing out on what must be an incredible amount of output happening today.  I am open to any topic, but I suppose I would be most interested in epistemology, metaphysics, and ethics.",
        "created_utc": 1670864781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is all morality based on wants?",
        "author": "Lost_Sand9666",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk3f2p/is_all_morality_based_on_wants/",
        "text": "Obviously, it would be wrong to say that \"I want X therefore X is morally good\" but for an action to be moral, does that imply that there is at least the potential for someone to want said action?  For example, most people would consider drunk driving immoral, even if the driver wants to drive drunk, but this is only because theoretically, there could be a person who a drunk driver harms who does not want to be harmed.  Would it be possible for there to be an action that is moral that nobody wants, or an action that everyone wants that is immoral?",
        "created_utc": 1670861783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to Start With Mind-Body Dualism, After Plato",
        "author": "AAA-Idk09876",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk33w2/where_to_start_with_mindbody_dualism_after_plato/",
        "text": "I was reading the Republic and Phaedo a month ago, and was interested in the ideas of dualism in both. What other philosophers have covered this subject, both pro and anti it? I know Descartes has, so anyone but him and Plato.",
        "created_utc": 1670861112,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your thoughts about human consciousness? Do you think our body filters consciousness rather than creating ?",
        "author": "Objective_Shake_4864",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk1a0c/what_are_your_thoughts_about_human_consciousness/",
        "text": "",
        "created_utc": 1670856979,
        "upvote_ratio": 1.0
    },
    {
        "title": "What limits freedom?",
        "author": "Baha8484",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk19h8/what_limits_freedom/",
        "text": "There are many works about freedom/liberty but son few about limits of freedom. Do you know any works and ideas on this topic?",
        "created_utc": 1670856944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does zero exist?",
        "author": "Icy_Moment3503",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk0w0t/does_zero_exist/",
        "text": "Do you believe it is a number or a math tool?",
        "created_utc": 1670856061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does zero exist? I believe it does not depending on what topic.",
        "author": "Icy_Moment3503",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk0ija/does_zero_exist_i_believe_it_does_not_depending/",
        "text": "I believe zero is not a number, but a math tool to help calculate amount and value. Ten has a value of ten, but if we remove zero we get the value of one. My theory is that zero is a math tool and my previous sentence proves this. Am I wrong?",
        "created_utc": 1670855150,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is Zizek all about (idealogy-wise)",
        "author": "Jandonjones2344",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zk0hu9/what_is_zizek_all_about_idealogywise/",
        "text": "I want to delve into him one day, but I’m curious as to where to start / what kind of arguments he is making",
        "created_utc": 1670855104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Informal analytic statements",
        "author": "Substantial_Rich_941",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zjzwl2/informal_analytic_statements/",
        "text": "Hi, is there such thing as a informal analytic statement? Can someone recommend me any book or paper about it?",
        "created_utc": 1670853675,
        "upvote_ratio": 1.0
    },
    {
        "title": "/r/askphilosophy Open Discussion Thread | December 12, 2022",
        "author": "BernardJOrtcutt",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zjzw1z/raskphilosophy_open_discussion_thread_december_12/",
        "text": "Welcome to this week's Open Discussion Thread. This thread is a place for\nposts/comments which are related to philosophy but wouldn't necessarily meet our\n[posting rules](https://www.reddit.com/r/askphilosophy/wiki/rules). For example,\nthese threads are great places for:\n\n* Personal opinion questions, e.g. \"who is your favourite philosopher?\"\n\n* \"Test My Theory\" discussions and argument/paper editing\n\n* Discussion not necessarily related to any particular question, e.g. about what\n  you're currently reading\n\n* Questions about the profession\n\n\nThis thread is **not** a completely open discussion! Any posts not relating to\nphilosophy will be removed. Please keep comments related to philosophy, and\nexpect low-effort comments to be removed. All of our normal [commenting\nrules](https://www.reddit.com/r/askphilosophy/wiki/rules)\nare still in place for these threads.\n\nPrevious Open Discussion Threads can be found\n[here](https://www.reddit.com/r/askphilosophy/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AOpen%2BThread)\nor at the Wiki archive\n[here](https://www.reddit.com/r/askphilosophy/wiki/opendiscussionthread).",
        "created_utc": 1670853638,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is Hegel's truth different from truth for the logical positivist?",
        "author": "makelx",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zjzbjb/how_is_hegels_truth_different_from_truth_for_the/",
        "text": "How would a Hegelian speak of a statement of factual truth, and how would a logical positivist, and how then would these two differ?",
        "created_utc": 1670852203,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the purpose of existence as a whole?",
        "author": "AssGobbler6969",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zjxiqw/what_is_the_purpose_of_existence_as_a_whole/",
        "text": "I see a lot on what is the meaning of a man's life but rarely on what is the meaning of everything. I want to what is the purpose of existence of humanity as a whole. Both according to rational philosophers and religions.",
        "created_utc": 1670847698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding the Puer Aeternus, and the correlation between socialization and discpline",
        "author": "Final_Biochemist222",
        "url": "https://www.reddit.com/r/askphilosophy/comments/zjwrer/regarding_the_puer_aeternus_and_the_correlation/",
        "text": "So I just started watching [this](https://www.youtube.com/watch?v=9A7GTGSfrIU&amp;t=24s) video and I've found the subject rather interesting. In a way, a lot of the points made about Jung's Puer Aeternus or the Eternal Child speaks volume of me.\n\nHowever, I've still got a couple of questions in mind. \n\nThe overcoming of the puer in that of the transition between the day-dreaming to the action oriented world. Through hard work, pain, and discipline, can one transform from a hedonistic child to an adult. It is ironically only through subjecting yourself to responsibility can you be free from the confines of your parameter.\n\nIn the video, it is said that one of the ways to overcome the archetype is to start focusing on the external world: acting instead of simply perceiving and thinking, and integrating yourself into the collective away from the comforts of the mother, but also to retain a sense of individuality so you don't become a sheep.\n\nBut in contrast, I know a lot of guys who aren't quite social and has vivid internal life. However, they still managed to remained disciplined and work towards their goals, perhaps even more so than socialites. They're called 'nerds'. \n\nSo, I don't really understand Jung's attribution between being unsocial and being undisciplined, as both factors seems to be indpeendant of one another.",
        "created_utc": 1670845686,
        "upvote_ratio": 1.0
    }
]