[
    {
        "title": "In an end of the world scenario with two people, how many generations of kids would they have to have to negate the effects of inbreeding?",
        "author": "FiveCentsADay",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ouvvv/in_an_end_of_the_world_scenario_with_two_people/",
        "text": "Assuming they have say, 2 sons and 2 daughters. ",
        "created_utc": 1528235146,
        "upvote_ratio": ""
    },
    {
        "title": "Guns and drugs... when unrestricted one is more dangerous and the other is safer. Why?",
        "author": "trep89",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ou9z2/guns_and_drugs_when_unrestricted_one_is_more/",
        "text": "Okay so just forgot all political motivations and positions. Ive often heard cited that countries which legalize all drugs and tax them, see a decrease in drug deaths and abuse. It has also been cited that areas with higher gun restriction have less gun deaths. I feel like its fair to say drugs and guns are similar; both can be used safely or nefariously, both can fatal if not used properly or safe if they are.\n\nGiven the similarities between the potential effect on life, why does unrestricting drugs produce a similar result to restricting firearms  ",
        "created_utc": 1528230731,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a Scientific explanation for nights where mass amounts of people can't fall asleep?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8otzup/is_there_a_scientific_explanation_for_nights/",
        "text": "[deleted]",
        "created_utc": 1528228772,
        "upvote_ratio": ""
    },
    {
        "title": "If every existing atom was spread out evenly throughout the length, width, and height of the universe, what would the universe look like?",
        "author": "TTTristan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8otois/if_every_existing_atom_was_spread_out_evenly/",
        "text": "Would there even be enough atoms to make up a visible universe? Or would the space between stars and galaxies be too wide to the point that atoms are too evenly spread to be noticeable by the human eye?\n\nHow far apart would each atom be from the closest other atoms?\n\nWhat other interesting ramifications to the universe would this cause? Would the entire universe essentially become a vacuum similar to earth's upmost atmospheric layer for a period of time?\n\nWould they coalesce into some sort of giant mega galaxy? Or would they stay the same space apart (assuming an infinite amount of atoms) as each is being equally pulled by the gravity of each other atom?\n\nThis likely is a partly /r/theydidthemath question, but I think it applies here as well.\n\nWas told to post here instead of r/askscience.",
        "created_utc": 1528226496,
        "upvote_ratio": ""
    },
    {
        "title": "Could life have originated from Mars?",
        "author": "TylerTheBro1",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8otkmm/could_life_have_originated_from_mars/",
        "text": "This might sound dumb but hear me out... Mars was habitable so could it have got struck with a meteor and shot rock into the atmosphere that had organisms on it or something and that meteor later would land on earth or something?",
        "created_utc": 1528225751,
        "upvote_ratio": ""
    },
    {
        "title": "Would you like a free copy of my science fiction book in exchange for an Amazon review? Details inside.",
        "author": "SilenceintheAbyss",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8othw5/would_you_like_a_free_copy_of_my_science_fiction/",
        "text": "[removed]",
        "created_utc": 1528225229,
        "upvote_ratio": ""
    },
    {
        "title": "What is the scientific consensus about the emotion vs logic debate?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8osza9/what_is_the_scientific_consensus_about_the/",
        "text": "Some philosophers like the ancient Greeks actually believed that emotion was the enemy of logic and that emotional feelings may hinder or affect one's logical reasoning. It is also in fact one of the philosophies that the Vulkans use in the famous Star Trek series where they prosper more on logic and teach to hinder or suppress emotion.\n\nEven Hume and Kant has the famous debate between that pure reason is the optimal path towards life satisfaction vs the use of emotion and passion.\n\nTo some extend, I do agree with this especially if the emotional response to a particular situation is very high such as rage or fury or extreme sadness and depression and melancholy.\n\nBut to some extent, emotions are there for a biological or perhaps even as an evolutionary reason.\n\nThe feeling of fear gives us the indication that a possible danger or threat is nearby. The feeling of lust can enhance sexual pleasure during sexual intercourse *(which has been proven to boost the well-being of the individual)* and anger is useful tool whenever there is a threat nearby, the emotional drive during a passionate experience can bring a joyful experience.\n\n\nSo I guess the line between emotion and logic is the self-awareness and self-empowerment through one's emotions which may take time to fully master *(there is also another phenomenon in psychology known as emotional intelligence)*\n\nPlus, I even read once (I cannot remember where) that is an experiment done of people who had brain lesions on areas associated with emotion, they were unable to make the simplest of decisions which gives the impression that emotional intelligence or some emotion of some kind must influence problem-solving or human reasoning",
        "created_utc": 1528221543,
        "upvote_ratio": ""
    },
    {
        "title": "What components would be neccessary to build a machine that starts out the size of your hand, and after you push a button it turns a landscape into a self sustaining autonomous town capable of supporting human life?",
        "author": "Stone_d_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8osdaw/what_components_would_be_neccessary_to_build_a/",
        "text": "If it's connected to other robots or to the internet it could just survey the land like a drone and coordinate everything online using some well designed software. I'm interested in what kind of 3D printing, drill bits, starting materials could be used to make a small machine like this that with specific programming could seek out the right materials to build itself into, say, a 3D printer, or a stove, or a toilet, or a greenhouse, or a 3D printer capable of making itself again. Basically, you flip the switch and next thing you know there's a town built using the materials on the landscape.",
        "created_utc": 1528217243,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any difference for diameter of rolled blanket if it is folded before rolling or not?",
        "author": "kbe4",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8os5yi/is_there_any_difference_for_diameter_of_rolled/",
        "text": "",
        "created_utc": 1528215782,
        "upvote_ratio": ""
    },
    {
        "title": "Csn grey matter regrow in striatum if i stopped watching porn?",
        "author": "Boobyyyy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8os5mk/csn_grey_matter_regrow_in_striatum_if_i_stopped/",
        "text": "[removed]",
        "created_utc": 1528215711,
        "upvote_ratio": ""
    },
    {
        "title": "What happens to the GPE of an asteroid that orbits a sun or planet, when the distance changes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8os0ws/what_happens_to_the_gpe_of_an_asteroid_that/",
        "text": "[deleted]",
        "created_utc": 1528214777,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be possible to speak without a lower jaw?",
        "author": "marveljew",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8orvt3/would_it_be_possible_to_speak_without_a_lower_jaw/",
        "text": "",
        "created_utc": 1528213704,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if all the Earth's volcanoes erupted indefinitely?",
        "author": "Stranger_of_Cydonia",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8orurd/what_would_happen_if_all_the_earths_volcanoes/",
        "text": "Suppose that, for whatever reason, every active and dormant volcano on the planet erupted simultaneously, and continued to do so indefinitely. Aside from the Venusian impact it would have on our atmosphere, what would be the geological ramifications of this? Realistically, how long *could* this continue? How long until the mantel and core noticeably cooled? Would this, in turn, weaken the Earth's magnetosphere? Would it be a planet killing event?",
        "created_utc": 1528213503,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that any of the non-natural elements that we've made on Earth occur naturally on other planets or elsewhere in the universe?",
        "author": "trombonizt",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ortlk/is_it_possible_that_any_of_the_nonnatural/",
        "text": "I know most of the elements in the f block and after only exist for a short amount of time before they decay, but could there be perfect conditions for them outside of Earth?",
        "created_utc": 1528213254,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if planet hit a star at 0.99c?",
        "author": "Morri0",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8orj22/what_would_happen_if_planet_hit_a_star_at_099c/",
        "text": "",
        "created_utc": 1528211074,
        "upvote_ratio": ""
    },
    {
        "title": "What are your opinions on Stephen Hawking saying black holes could be portals to another universe?",
        "author": "TheBeyonder-616",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oqo21/what_are_your_opinions_on_stephen_hawking_saying/",
        "text": "So we all know Stephen Hawking \\(Rest in Peace\\) is one of the best scientists of the modern era for his work on theoretical physics and black holes, And talking about black holes...\n\nThe celebrated physicist has put forward an extraordinary theory about what lies on the far side of black holes .\n\n**Stephen Hawking claims black holes are portals to another universe \\- but there's no coming back**\n\nUndermining previous research that claims whatever falls into a black hole is never seen again, the 74\\-year\\-old argues they are safer than first thought.\n\nHawking claims that you could travel through a black hole and survive \\- although he admits you'd probably come out the other side in a different universe, and there'd be no going back.\n\nAccording to Hawking and fellow theorists Andrew Strominger and Malcolm Perry, the answer lies in black holes' zero\\-energy particles, known as \"soft hair\", which store information on the black hole's horizon \\- the invisible boundary that is the point of no return.\n\nHawking and his fellow researchers seem to think these hairs could solve the central paradox of black holes, backing up the basic laws of the universe which state that anything that has ever existed is preserved via its information.\n\nSo i'd just like to know your opinions on this, what are your thoughts?",
        "created_utc": 1528204203,
        "upvote_ratio": ""
    },
    {
        "title": "When we encounter two animals that are in a life and death struggle, why is it such a common instinct to want to help the weaker animal?",
        "author": "truemeliorist",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oqml5/when_we_encounter_two_animals_that_are_in_a_life/",
        "text": "I recently saw this video:\n\nhttps://youtu.be/BT5f1YXWeVU\n\nA boat owner allows a seal to shelter on his boat, and evade pursuing orcas.\n\nI'm pretty sure I would have done the same thing too. But why? Why wouldn't our instinct be to knock the seal off so the orca can have a nice nourishing meal?\n\nI guess as a larger question, what fuels our rationale for \"rooting for the underdog\"? Is there an evolutionary or cognitive/behavioral reason? Is it because instinctively we know the orca could kill and eat both of us?",
        "created_utc": 1528203856,
        "upvote_ratio": ""
    },
    {
        "title": "Do viruses have any profreading enzymes/mechanisms?",
        "author": "Truthplease5",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oqkpc/do_viruses_have_any_profreading_enzymesmechanisms/",
        "text": "(Also) When in a host cell, and the virus 'hijacks the components; is there evidence that the host cell fights back and uses its own proofreading enzymes/mechanisms therefore decreasing viral antigenic drift and increasing the possibility of an adequate immune response?",
        "created_utc": 1528203386,
        "upvote_ratio": ""
    },
    {
        "title": "s it theoretically possible that the science advances into a point where the life expectancy would be near to 300 years or more? What are the major challenges to do so?",
        "author": "Landinque",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oqil1/s_it_theoretically_possible_that_the_science/",
        "text": "",
        "created_utc": 1528202817,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Ice Planet for Fiction",
        "author": "VanitasShomanaut",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oq96k/question_about_ice_planet_for_fiction/",
        "text": "I was wondering if anyone would know if it's plausible that a planet covered in snow, could also be afflicted by large and persistent electric storms (lightning) on a frequent basis.  I have a rather limited knowledge of logistical science, and I was thinking that maybe the consistent electric storms would cause the snow to always be more of a mush, but I'm not sure.  \n\nAny help or opinion is appreciated.  \n\nThanks!",
        "created_utc": 1528200377,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Ice Planet for fiction",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oq0w1/question_about_ice_planet_for_fiction/",
        "text": "[deleted]",
        "created_utc": 1528197958,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly happens when an object collides with a star?",
        "author": "CoolestDudeOne",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8op7t9/what_exactly_happens_when_an_object_collides_with/",
        "text": "Combustion reactions require oxygen, and there isn't any oxygen in space, so would it be accurate to say the object doesn't actually burn? ",
        "created_utc": 1528188038,
        "upvote_ratio": ""
    },
    {
        "title": "Can you guys help me debunk this proposition? Is this falsifiable?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oov8v/can_you_guys_help_me_debunk_this_proposition_is/",
        "text": "Alright guys so I was reading something this guy wrote, really smart guy, he's a cognitive scientist somewhere in Massachusetts. He was responding to the question \"Are we the universe observing itself?\" And his answer was no. I don't want to misrepresent him but I also don't want to post his entire response, it's pretty long, so I'll post the most important parts\n\n&gt;Probably not. It seems that our organisms benefit from complex information processing, and hence evolved a bunch of fat cells into biological computers: our brains. These biological computers count the impulses of  sensory neurons in extremely fancy ways, to predict future sensory  input, with respect to the needs of the organism. These fancy ways  include the generation of a dynamic world model, including a self model,  and an integrated protocol of operations performed on this world model.\n\nNow, I know that what we see through our eyes is not analogous to looking outside of a window, no, it's rather closer to\n\n\\(but not exactly like\\) how a computer monitor projects information. Our eyes obtain information from an external source and our brains take such information and generates what we \"see.\" This is why we have hallucinations, because sometimes what our brain generates isn't what's there. Now what is confusing me is this part here\n\n&gt;Through  meditation, we can turn off or modify these bindings, and as a result,  may experience out\\-of\\-body experiences, depersonalization, loss of  agency or feelings that we cause everything in the world to happen, loss  of our bodily sensations or the impression that we are one with the  universe, with God, with Gaia, with cells, with elementary particles,  with another person, with a plant or with another arbitrary imagination.  This may feel very surprising and overwhelming at first, but the  miracle is not that you can experience not being you, but that you  usually believe to be you!  \n&gt;  \n&gt;I suspect that  the idea that our consciousness is a “narrowing down” of a universal  consciousness is often the result of such experiences. But the universe  is nothing that we can ever experience: our brains do not have access to  the world “out there”, but only to a few electrical blips coming in  through our sensory neurons. The particles in the sensors of these  neurons do not touch the universe, but are merely entangled with  particles that are an almost infinitesimal distance away. From the  fluctuating patterns in these entanglements, our biological computers  construct a dynamic universe. The universe exists inside of our brains:  outside, there is only a pattern generator with an unknowable structure.  If we experience that we are the consciousness of the universe itself,  we are experiencing our normal integration process that is not properly  identifying with our personal self model, but instead with our whole  world model. We are still experiencing a representation created by our  brains.\n\nSpecifically this portion\n\n&gt;But the universe  is nothing that we can ever experience: our brains do not have access to  the world “out there”, but only to a few electrical blips coming in  through our sensory neurons. The particles in the sensors of these  neurons do not touch the universe, but are merely entangled with  particles that are an almost infinitesimal distance away. From the  fluctuating patterns in these entanglements, our biological computers  construct a dynamic universe.\n\nTo simplify, I believe he's saying that we don't actually know what's \"out\\-there.\" The representation of the universe which our brain generates may not be an accurate model of what actually exists \\(if anything exists at all\\).\n\nNow I know that some things exist that, if not for the tools that we've created, we wouldn't know existed. For example infrared, we know that some other animals can \"see\" infrared. We can't, and it is very probable that\\-that changes how we experience day\\-to\\-day life. I mean, a lot of robberies could be prevented if we had infrared senses \\(I think\\).\n\nAnyway what's really bringing me on the verge of existential crisis is the fact that I don't know if anything exists outside of my mind, and even if anything does exist outside of my mind, I don't know if it is an accurate representation of what there is. A relatively interesting thought that I had was I know that in dreams, a lot of things happen which don't make any sense whatsoever in real life, but while I dream they feel like they make perfect sense. For example I remember I had a dream the other day, I walked into a room and I saw a girl that I hadn't seen or thought about in years, as a matter of fact I never even talked to this girl, she just went to my school and I saw her in the hallway from time to time, I never thought of her either, anyway I continue walking and she splits into three exact copies the same way that bacteria do and moves in uniform. Now you may think \"that's weird,\" however in the dream I didn't think it was weird at all, it felt like it made sense at the time, nothing was odd. I didn't realize how weird this was until I woke up. My concern here is that everything which I experience may not make any sense in real life either \\(and at that point, what is sense?\\) and there would be no way for me to know that.\n\nI know at the moment this seems like a non\\-falsifiable proposition, a rather solipsist one, however surely there must be a way to turn this proposition into a falsifiable one, scientists turn unfalsifiable theories into falsifiable ones all the time. Surely this is no exception. I want this debunked, it's fucking with my mind.\n\nEdit: [Link](https://www.quora.com/Are-we-simply-the-universe-experiencing-itself-Is-the-universe-compelled-to-do-so-when-it-happens-to-create-life-with-the-emergent-properties-of-consciousness)\n\nEdit: It seems I got downvoted. I understand that this post comes across as something that isn't serious or perpetuating solipsism, however that isn't my intention here at all. I'm just really confused and hope that someone can help me with with this.",
        "created_utc": 1528183270,
        "upvote_ratio": ""
    },
    {
        "title": "Is CRISPR currently being used to treat any genetic diseases?",
        "author": "thecorndogmaker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oos1i/is_crispr_currently_being_used_to_treat_any/",
        "text": "Is there a reason, other than ethical or financial, that we can't replace the Huntington's disease gene sequence with a wild type using CRISPR? Are tgere other factors causing the disease than just one protein? Is there an issue getting Cas9 into the right cells? Could it cause problems in other cells?\n\n\nAre there any diseases that are using CRISPR right now? Is the method currently being used for other reasons?",
        "created_utc": 1528182179,
        "upvote_ratio": ""
    },
    {
        "title": "What is the probability that what we think of as the Oort Cloud, in varying densities, actually fills the entire meaningful volume of the Milky Way outside the astrosheaths/astrospheres of all the galaxy's stars? Or if this is not the case, what would be different about our galaxy if it were?",
        "author": "aqua_zesty_man",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8onmx3/what_is_the_probability_that_what_we_think_of_as/",
        "text": "",
        "created_utc": 1528169560,
        "upvote_ratio": ""
    },
    {
        "title": "what was the last biggest breakthrough in science you've heard of?",
        "author": "R221B",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ol92g/what_was_the_last_biggest_breakthrough_in_science/",
        "text": "",
        "created_utc": 1528148711,
        "upvote_ratio": ""
    },
    {
        "title": "Is there anywhere in the universe where there is sustained nuclear fission, in the same way that there is sustained fusion in the core of stars?",
        "author": "SomeGuy_tor78",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8okrau/is_there_anywhere_in_the_universe_where_there_is/",
        "text": "",
        "created_utc": 1528145075,
        "upvote_ratio": ""
    },
    {
        "title": "How will climate change at the current rate affect earth by the year 2950?",
        "author": "smileforkirk",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8okdve/how_will_climate_change_at_the_current_rate/",
        "text": "I wrote a short story last year about a wasteland style kind of post apocalyptic environment. I based this on the effects of climate change. Well now I am making a video game based on that story, and I really wanted to get as close to accurate as possible based on what the current projections for climate change would be in the year the game takes place.\n\n\nI want to make my world as realistic as possible when traversing through\n\n* Would we have a hard time finding fresh water? \n\n* What would day to day life be?\n\n* Will there be plant life? - if so what kind?\n\nThanks for the answers!",
        "created_utc": 1528142400,
        "upvote_ratio": ""
    },
    {
        "title": "Since we simulate non unitary models (so, unitary models could happen in a simulated universe) and since in pancomputationalism, the universe would be itself a computer, they could occur in such a model isn't it?",
        "author": "Noduagga",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8okdqo/since_we_simulate_non_unitary_models_so_unitary/",
        "text": "In this discussion, it is said that non-unitary models of the universe could not exist, even in universes described by digital physics theories: \nhttps://old.reddit.com/r/AskScienceDiscussion/comments/8fz0v4/is_there_any_model_of_hypothetical_universes/\n\n\nBut since in pancomputationalism the universe is described as being a computer itself. Since we can compute non unitary models in a computer, then, if the universe itself is a computer, wouldn't that mean that non unitary models would occur in a pancomputationalist universe?\n",
        "created_utc": 1528142371,
        "upvote_ratio": ""
    },
    {
        "title": "Plausible Reincarnation? Based upon an Infinite Universe/Infinite Number of Universe's",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8okc09/plausible_reincarnation_based_upon_an_infinite/",
        "text": "[deleted]",
        "created_utc": 1528142013,
        "upvote_ratio": ""
    },
    {
        "title": "does having the left arm cut off as opposed to the right arm (untreated) bleed out quicker?",
        "author": "Shiniru",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ojvmc/does_having_the_left_arm_cut_off_as_opposed_to/",
        "text": "[removed]",
        "created_utc": 1528138719,
        "upvote_ratio": ""
    },
    {
        "title": "When Icarus flew too high wouldn't his wax get cold due to the atmosphere?",
        "author": "skeetskeetskeetskeet",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ojui2/when_icarus_flew_too_high_wouldnt_his_wax_get/",
        "text": "  ",
        "created_utc": 1528138496,
        "upvote_ratio": ""
    },
    {
        "title": "All animals are decomposers",
        "author": "PizzaTostada",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ojf2c/all_animals_are_decomposers/",
        "text": "Decomposers are organisms that turn organic matter into inorganic matter to produce energy and are confined in the groups fungi and monera.\nAnimals produce energy by turning, for example, glicose into H2O and CO2.\nBut if animals turn organic matter(glicose) into H2O and CO2(inorganic matter), shouldn't they be decomposers while consumers?",
        "created_utc": 1528135394,
        "upvote_ratio": ""
    },
    {
        "title": "If a perfectly controlled electric force could be channeled through a human body (Without killing them), could they become magnetic?",
        "author": "AndrewWilsonnn",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ojd6a/if_a_perfectly_controlled_electric_force_could_be/",
        "text": "I don't know if this is the right place for this. If it isn't, I'd love to be directed to somewhere I could ask this! I figured /r/askscience was the wrong place, due to this being sorta speculative.\n\nMy main motivation stems from a sorta sci-fi comic I'm making. I'm trying to use a little bit of actual science to explain the phenomenon my main character can perform. He's in possession of an object that lets him perfectly control electricity and electric flow, while not succumbing to the negative effects of electricity flowing throughout his body.\n\nWhat I could grasp from basic research was that there is a field of study called Biomagnetism, but that seems to be more sensory than anything physical.",
        "created_utc": 1528135014,
        "upvote_ratio": ""
    },
    {
        "title": "Could we breed cats for greater diversity?",
        "author": "Dbejshdv",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oikx1/could_we_breed_cats_for_greater_diversity/",
        "text": "I'm aware that cats aren't nearly as diverse as dogs due to being bred only for one purpose (catching vermin) until relatively recently, but could we do so if we wanted to? Would the general anatomy of a cat allow for drastic changes in size or shape, or could new coat patterns occur?",
        "created_utc": 1528129214,
        "upvote_ratio": ""
    },
    {
        "title": "Could a gas intermix (not dissolve) with water if they were able to coexist at the same density?",
        "author": "beardiac",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ohw3s/could_a_gas_intermix_not_dissolve_with_water_if/",
        "text": "E.g., if you were to fill a sealable container halfway with water and the other half with some singular gas like CO2, and continue to add gas volume via pressure until the density of the gas reaches that of water, would the water start to appear to defy gravity and mix freely with the present gas? Further, were the gas concentration to reach a pressure where the density is technically greater than that of water, would the water start to float above the gas?\n\nNote: I know that gases can dissolve into liquids, I'm specifically referring to intermixing without the formation of a solution.",
        "created_utc": 1528124152,
        "upvote_ratio": ""
    },
    {
        "title": "Why did eruption of Fuego vulcano killed and injured so many people if volcanos are monitored?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ohe42/why_did_eruption_of_fuego_vulcano_killed_and/",
        "text": "[deleted]",
        "created_utc": 1528120105,
        "upvote_ratio": ""
    },
    {
        "title": "Have we ever been capable of imaginating/simulating a 4th (or even further) dimension of space?",
        "author": "Choice_reaper",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ohc16/have_we_ever_been_capable_of/",
        "text": "I always have been thrilled by the idea of a 4th/5th/6th (and so on) dimension of space, by that I mean we, humans, live under a 3rd dimension: width length and depth, we can move around those 3 dimensions, but have we been able to emulate what a 4th dimesnion would look like? Or even further? I always thought the human brain (or any creature in 3d) could imagine lower space dimensions, like 2D and 1D, but never higher up, like 4th dimension beings if they existed could not understand what 5D would mean, even if they dedicated their life to it, but I would just love to be proven wrong.",
        "created_utc": 1528119598,
        "upvote_ratio": ""
    },
    {
        "title": "How much information can our brain store?",
        "author": "Prototype-Z01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ohbnj/how_much_information_can_our_brain_store/",
        "text": "Ok, assuming in the future we found a way for human to live forever, would it be possible for our brain to store that much information? Let's say a person lives to a rough estimate of 500years, would he remember everything he has learned or would his brain just delete old memories? I'm really curious. ",
        "created_utc": 1528119500,
        "upvote_ratio": ""
    },
    {
        "title": "Is there significantly more volcanic activity?",
        "author": "Amayax",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ogoh7/is_there_significantly_more_volcanic_activity/",
        "text": "With the volcanic activity at Hawaii and Guatemala, I saw all kinds of messages mentioning many sorts of doomsday stuff. Core to those was there being more volcanic activity. While I don't believe in any doomsday stuff, it did spark a question in me. Is there more volcanic activity or just there just seem to be?",
        "created_utc": 1528113428,
        "upvote_ratio": ""
    },
    {
        "title": "What is the scientific consensus on spirituality?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8og4cf/what_is_the_scientific_consensus_on_spirituality/",
        "text": "It is difficult to even define what spirituality is because it has different meanings for different people even though they mostly reference the same meaning\n\nSometimes it is a means of personal growth. Sometimes it is a means of going deeper within oneself or within the universe and its secrets and mysteries without delving into the religious territory (as spirituality can sometimes be mixed with religious doctrines).\n\nSometimes the whole ambiguity of spirituality is the point becuase different people give different perspectives and different meanings in the same phenomena \n\nBeing a skeptic and Sometimes, a person who tries or values to be rational, I feel mostly certain that spirituality does not exist.\n\nBut yet, at the same time, I really admire the spirit of spirituality. It sounds soothing and mysterious and personal and magical at the same time.\n\nI am not sure exactly how to explain the feeling when you go through a process that you would define as spiritual but it is somewhat confusing on it really is - Whether it is an actual phenomenon or a state of eupohria\n\nThis is also somewhat of a personal experience as well as being trained within the scientific community, I realised a lot that I have been trying too hard to be rational \n\nI got into a stage where I end up thinking and thinking and ruminating instead of actually living or acting. I often end up thinking about acting instead of actually acting and end up doing nothing. I ended up over thinking into every single detail and into every single field that I can think of and this mostly became a pattern, until I came across Nietzsche's philosophies and his anti-rationalist arguments. \n\nAt first, they sounded anti-intellectual arguments until I later realised what he really meant and how I see that most of the world of today is trying too hard to be rational.\n\nSo, I eventually onto some thing that I really liked when I was young which is spirituality\n\nIt is very difficult to accept at first becuase it seems to be more like a state of impulse and the continuous self-awareness (and I mean, self-awareness to the extreme) kept me from actually feeling the moment but I eventually felt more like someone and felt like I am actually acting and behaving instead of just thinking about acting\n\n\nThis is also somewhat of a mystery to me becuase on one hand, my judgment tells me that I am experiencing a difference in behaviour, influenced by continuous reconditioning and alterations of my own personal values and beliefs and that my own biochemistry is influencing my own thoughts and feelings (the illusion of free will in neuropsychology) but at the same time, I have this idea that I want this experience to be a real phenomenon even though I am not exactly sure what I am experiencing or why or what place I am heading towards.",
        "created_utc": 1528106821,
        "upvote_ratio": ""
    },
    {
        "title": "What safe experiment can I perform on myself?",
        "author": "EnoughPineapple",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ofpji/what_safe_experiment_can_i_perform_on_myself/",
        "text": "So I'm sure everyone has heard of the Miracle Berry (if not, it's a tablet-thing that makes sour things taste sweet). I've also heard of this experiment where a participant's brain started so see everything \"normally\" after wearing upside-down glasses for 3 days. I plan to try both things just to see what the experience is like! Does anyone know of anything similar that would also be kind of fun?",
        "created_utc": 1528101151,
        "upvote_ratio": ""
    },
    {
        "title": "Be a part of a new theory discussion: If the theory of multiple universes was true how could we use that knowledge? (specifics in text body)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8of6xu/be_a_part_of_a_new_theory_discussion_if_the/",
        "text": "[deleted]",
        "created_utc": 1528094041,
        "upvote_ratio": ""
    },
    {
        "title": "What happens when you have conflicting realities in a brain-computer interface?",
        "author": "Orwellze",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oeya4/what_happens_when_you_have_conflicting_realities/",
        "text": "In the hypothetical scenario that advanced [BCI's](https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface) are created, receiving and more important injecting complex information into the brain to construct realistic simulation ( A-la Matrix ), what happens in the even in which the information they transmit comes into conflict with external information, such as the body's nervous system?\n\nFirst of all, we need to establish under which conditions that interface would be utilized. Would it be under some kind of full body paralysis and unawareness as in the Matrix? Why it would certainly pose less questions, it's also likely far more difficult and risky to accomplish, and thus the first generation of immersive BCI's will be implement on a fully conscious user, which presents the paradoxes.\n\nWhat happens if someone in the simulated reality punches a cushion, prompting the BCI to signal the relevant neurons to apply the sensation of a cushion, while in reality his hand punches a wall in the room, firing the signal for pain and rigidity through his nervous system, both within the span of milliseconds and perpetuated long afterwards as the BCI attempts to stimulate the feeling of the first lodged in a cushion, while the nervous system keeps broadcasting the blunt pain it just received. The relevant neurons are an input getting two opposing currents, one from the BCI ( Whether it be a headset or hole drilled through the skull or even a nanobot latched on somewhere ), and one through the body's actual nervous system and into the brain. A similar question may be poised about someone putting rotten eggs on his tongue while a BCI is instructed to confer a taste of chocolate.\n\nA scenario can also be described in which a BCI confers the \"reality\" in which by some involuntary force, you are raising your arm upwards. Yet at the same time the nervous system's natural awareness, a breeze on your skin and so on are sending the signal that \"Your arm is still at your side\". \n\nIt will probably a major neurologist to determine precisely what the biological outcome of that would be, possible some kind of medical mess involving seizures and paraesthesia and so on, but maybe someone here has a better idea.\n\n",
        "created_utc": 1528091043,
        "upvote_ratio": ""
    },
    {
        "title": "If it is \"impossible\" to move faster than the speed of light, then why do we accept that the universe is expanding faster than the speed of light?",
        "author": "Jah_Feeel_me",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oejb7/if_it_is_impossible_to_move_faster_than_the_speed/",
        "text": "Wouldn't this alone prove that it IS possible to move faster than the speed of light, thus making us re-think our equations? Am I just not understanding this? I do understand this is all theory, but why are we accepting that the universe is expanding faster than the speed of light, yet, it is impossible for anything to move faster than light. ",
        "created_utc": 1528086317,
        "upvote_ratio": ""
    },
    {
        "title": "What anatomical changes would change if humans were to have wings?",
        "author": "TheBeyonder-616",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oegve/what_anatomical_changes_would_change_if_humans/",
        "text": "So we love to ponder at imaginary creatures right? One example would be angels, fairies from fictional stories, or winged humanoids in general.\n\nBut as we can see, only birds do. Eagles, pegions, bats etc. The quetzalcoatlus being the largest.\n\nBut lets say we evolved to need wings, what anatomical and biological changes would there be to allow a humanoid body to have it? How would our skeletal, body and muscular structure look like?",
        "created_utc": 1528085598,
        "upvote_ratio": ""
    },
    {
        "title": "What is the Carnot Efficiency of the sun, a neutron star or a black hole? How does something more diffuse like a galaxy compare to the Carnot Efficiency of a more compact object like a star?",
        "author": "TaoistInquisition",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oe1l5/what_is_the_carnot_efficiency_of_the_sun_a/",
        "text": "",
        "created_utc": 1528081285,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if a living human was put in an environment where the temperature was absolute zero or close to absolute zero.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8odcxl/what_would_happen_if_a_living_human_was_put_in_an/",
        "text": "[deleted]",
        "created_utc": 1528074844,
        "upvote_ratio": ""
    },
    {
        "title": "What are some common myths or misinformation or popular beliefs that make steam come out of your ears when you hear them AGAIN",
        "author": "PersephoneIsNotHome",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8od3l3/what_are_some_common_myths_or_misinformation_or/",
        "text": "For example - you only use 10% of your brain\n\nEdit - if your field isn't obvious, from the annoying myth, please mention it",
        "created_utc": 1528072375,
        "upvote_ratio": ""
    },
    {
        "title": "If sunlight was prevented from reaching us, what would happen to life on Earth?",
        "author": "Duxshan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ocuam/if_sunlight_was_prevented_from_reaching_us_what/",
        "text": "Or, let's say something blocks off the sun's light from reaching us. Perhaps an indefinite eclipse. How long will it take for plants to die off, and for the food chains to break down? How long will humans last? Will it produce an ice age? \n\nCan someone do a timeline, example, the first days, the first week, the first month, the first year and so on?  \n\n\nThanks!",
        "created_utc": 1528070036,
        "upvote_ratio": ""
    },
    {
        "title": "Since it’s possible to encode malware into DNA, is it also possible for someone to construct a mental image that exploits a vulnerability in a computer that’s trying to map-out the neurons in their brain?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oct30/since_its_possible_to_encode_malware_into_dna_is/",
        "text": "[deleted]",
        "created_utc": 1528069707,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the flaws in the scientific structure or the scientific thought?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ocpgm/what_are_some_of_the_flaws_in_the_scientific/",
        "text": "So I have been a lover of science all my life and I was indoctrinated over and over again the power of the scientific method and how useful it is in finding out the mysteries of multiple phenomena or helpful in indulging our own curiosities or inquisitive natures about different phenomena around us, within us or even phenomena that are far away or cannot be seen visibly.\n\nThese kinds of patterns involving scientific thought such as hypotheses, research making, self-awareness, consulting with professionals, asking questions and so on have been with me in my entire life and it is no wonder that scientists have been glorified as \"heroes\" in many science fiction stories of late becuase they are technically geniuses of modern society and a group of people who inspire progress (supposedly becuase scientific thought can have a multitude of different impacts)\n\nBut as much as I am a big supporter of science and a big supporter of proper research and proper experimentation and verifiable information and credible people who will use that information their workplaces, I do not think that science is a flawless structure \n\nFor starters, potential biases is one of them. Even scientists have biases. Maybe becuase of values that they internalized or inherited or maybe becuase they truly believe their hypotheses.\n\nBut I think that the big problem is the mentality behind the scientific structure. \n\nHow many times have we heard or seen the phrase \"scientists discovered X\" or \"science says Y\" like these are big discoveries and such discoveries dictate our lives?\n\nOf course, I am not saying that these discoveries are done wrongly or scientists are not doing a good job but in most areas, whenever a group of scientists find new discoveries, it is sometimes a piece of a bigger puzzle as many things are not that straight-forward or can potentially be disproven when the same experiments are repeated and end up with different results, or different hypotheses represent different conclusions which contradict each other or not exactly provide the best image on solving the most puzzling of mysteries (eg: nutritional science, neuropsychology, physics and so on)\n\nThere are many times that such articles depict scientists as if they made big discoveries (which every conclusion is a discovery of its own, whether it is something that proves the null hypothesis or not) but in reality, the bigger picture is far more puzzling.\n\nSometimes further questioning and experimentation reveal different results as even experimentation can be done poorly or scientists did not recall a certain mistake that led to either coincidences or not-so-logical reasoning (what we call 'pathological science' as such \"new discoveries\" were proven to be science done wrongly without even knowing)\n\nSometimes upon further inspection of certain experiments or discoveries like meta-analyses prove certain patterns that may or may not be some helpful as such patterns may lead to destructive habits or behaviours (like diagnosing people with mental health issues may be more destructive or prone to errors which will lead to even further errors in judging those people's lives as proven by the Rosenhan experiment)\n\nHonestly, this is also the beauty of science as well as the principle of falsifisblity is also important in scientific work and research (as Carl Sagan used the example of \"there is a dragon in my garage\" to be able to either prove or falsify a claim) in order to avoid or weed out poor or false science may be maliciously beneficial for some people like con people or people wanting to spread false knowledge or biased opinions (Like alternative medicine or scientific articles that were later proven to be wrong or false but people still believe anyway), or help us learn more how to find out how to make better experiments or avoid certain patterns because even the brightest of scientists are prone to making mistakes.\n\nBut Honestly, as much as I am in love with science and I am in love on how people appreciate the power and usefulness of science, I do not see as flawless as many people are led to believe becuase as much as the scientific structure to designed to help us make proper experimentation and research for even the tiniest of hunches, no structure is completely flawless, not even a structure that gets a lot of praise in both in real life and in fictional media ",
        "created_utc": 1528068774,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if an object on Earth suddenly reached the planck temperature, the highest possible temperature, for just 1 minute?",
        "author": "iTacticalTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ocfm7/what_would_happen_if_an_object_on_earth_suddenly/",
        "text": "I was thinking about the effect the Sun has on the solar system and thought about what would happen if an object much smaller suddenly became very hot. What could a tennisball with 1.42×1032 kelvin cause for 1 minute and how much of the planet would it affect?",
        "created_utc": 1528066414,
        "upvote_ratio": ""
    },
    {
        "title": "What's a reasonable estimate for how long my phone will last?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8obbso/whats_a_reasonable_estimate_for_how_long_my_phone/",
        "text": "I use my Samsung Galaxy s7 for 24 hours a day. Sixteen hours I am on my phone doing something. For eight hours I fall asleep to YouTube videos and leave my phone on in my sleep.\n\nI bought the phone in 2017. What's the expected lifespan for the phone with this kind of usage? It's already got screen burn in and the battery drains quickly.",
        "created_utc": 1528056912,
        "upvote_ratio": ""
    },
    {
        "title": "Simulated Universes in Multiverse Hypothesis?",
        "author": "Noduagga",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oaiyw/simulated_universes_in_multiverse_hypothesis/",
        "text": "In this article by Paul Davies \n\n[https://arxiv.org/abs/astro\\-ph/0403047](https://arxiv.org/abs/astro-ph/0403047)\n\nIt is questioned if simulated universes would be included in multiverse hypothesis. I emailed Davies and he answered me that although simulation hypothesis has been taken more seriously these last years by scientists there are some that say that simulated universes cannot be included in multiverse hypothesis \\(despite one of the modt important classifications of multiverses, from Brian Greene, includes them\\).\n\nWhy are there some scientists that say that simulated universes cannot be included  multiverse hypothesis? Would the same happen for universes created by Boltzmann Brains? Would the same happen for those models  where the universe itself would be a computer \\(like those proposed by pancomputationalist theories\\)?  Would the same happen for those universes that would simulate themselves? \\(I mean, that the universe itself would be the simulator and the simulation, with no other reality \"outside\" of it as opposed to normal simulated universe hypotheses, where the universe would be simulated in a computer inside a \"hiigher\" reality/universe\\)   ",
        "created_utc": 1528050263,
        "upvote_ratio": ""
    },
    {
        "title": "I randomly start humming a tune then five minutes later I get in the car turn on the radio and that song starts playing, is this coincidence or is there any science behind this?",
        "author": "Cub1330",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oaixv/i_randomly_start_humming_a_tune_then_five_minutes/",
        "text": "I thought it would be fun to extend the conversation my friends and I had the other night and see if anyone knows any facts or studies about it or just wants to insert their own opinions and experiences. Have you ever randomly started humming a tune and then 5 minutes later you get into your car turn on the radio and it's the song that's playing? Is this just a coincidence or is there some science behind it? ",
        "created_utc": 1528050258,
        "upvote_ratio": ""
    },
    {
        "title": "Universe as a Quantum Computer by Seth Lloyd?",
        "author": "astridhoff",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oacms/universe_as_a_quantum_computer_by_seth_lloyd/",
        "text": "[removed]",
        "created_utc": 1528048828,
        "upvote_ratio": ""
    },
    {
        "title": "What Methods Can We Use To Simulate Evolution In A Contained Environment?",
        "author": "SilverCloud73",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oab4v/what_methods_can_we_use_to_simulate_evolution_in/",
        "text": "",
        "created_utc": 1528048479,
        "upvote_ratio": ""
    },
    {
        "title": "How long would it take us to achieve 1% lightspeed?",
        "author": "DreamCentipede",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oa55l/how_long_would_it_take_us_to_achieve_1_lightspeed/",
        "text": "This is really vague but I’m curious. Say by 2100, do you think we could achieve this? ",
        "created_utc": 1528047075,
        "upvote_ratio": ""
    },
    {
        "title": "How far are we from creating a real life, fully inmersive but non-invasive VR experience and what are the cons and limitations?",
        "author": "simonbleu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8oa20y/how_far_are_we_from_creating_a_real_life_fully/",
        "text": "",
        "created_utc": 1528046361,
        "upvote_ratio": ""
    },
    {
        "title": "Stem-cell human eye lenses, when will there be human trials?",
        "author": "Zerothustra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o9ojl/stemcell_human_eye_lenses_when_will_there_be/",
        "text": "If there is going to be human trials soon, how can someone volunteer?",
        "created_utc": 1528043231,
        "upvote_ratio": ""
    },
    {
        "title": "What happens if we make \"one second\" = to the golden ratio instead does anything change that stands out?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o9no6/what_happens_if_we_make_one_second_to_the_golden/",
        "text": "I am just curious I know this probably is a impossible idea",
        "created_utc": 1528043065,
        "upvote_ratio": ""
    },
    {
        "title": "Is sleeping with an extension cord in my bed dangerous?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o90ys/is_sleeping_with_an_extension_cord_in_my_bed/",
        "text": "[removed]",
        "created_utc": 1528038126,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion/questions on intermittent fasting and Autophagy",
        "author": "BananaMunkey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o8t22/discussionquestions_on_intermittent_fasting_and/",
        "text": "[removed]",
        "created_utc": 1528035495,
        "upvote_ratio": ""
    },
    {
        "title": "How much will cancer treatment advance in the next 20 years?",
        "author": "LIGHT130",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o7vgm/how_much_will_cancer_treatment_advance_in_the/",
        "text": "Will immunotherapy play the biggest role?",
        "created_utc": 1528024189,
        "upvote_ratio": ""
    },
    {
        "title": "What Are Some Resources (Books, Documentaries, Etc) I Can Use To Learn About Prehistoric Cats?",
        "author": "Gh0stthedirew0lf2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o7qia/what_are_some_resources_books_documentaries_etc_i/",
        "text": "",
        "created_utc": 1528022079,
        "upvote_ratio": ""
    },
    {
        "title": "Compactified extra time dimensions?",
        "author": "qeveren",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o6tsx/compactified_extra_time_dimensions/",
        "text": "I've got a basic (layperson's) understanding of the idea of compactified extra spacial dimensions, and that makes me wonder: what would the consequences (if any) be of the existence of compactified extra time dimensions?  Does the idea of a compactified time dimension even make sense?",
        "created_utc": 1528007750,
        "upvote_ratio": ""
    },
    {
        "title": "With the number of parents choosing not to vaccinate their children, in 60 years, when that generation is much older and more susceptible to disease, will the elderly that were vaccinated as children still be fully protected against those diseases?",
        "author": "QuickKev",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o6mnt/with_the_number_of_parents_choosing_not_to/",
        "text": "",
        "created_utc": 1528005071,
        "upvote_ratio": ""
    },
    {
        "title": "Kooky theories among redditors involved in fact based science.",
        "author": "MDCCCLV",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o6bb8/kooky_theories_among_redditors_involved_in_fact/",
        "text": "I'm thinking about a question I have. Do you think it's a problem if a prominent redditor, say someone active in AskScience was smart and had good commentary but believed in a hardcore fringe scientific theory, something that is completely rejected by the scientific community, but that they argued for and believed?",
        "created_utc": 1528001051,
        "upvote_ratio": ""
    },
    {
        "title": "HELP! Nervous for an On-site Tour/Interview at a Biotech Company Next Week. What to expect?",
        "author": "tse_vyctor",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o52i9/help_nervous_for_an_onsite_tourinterview_at_a/",
        "text": "[removed]",
        "created_utc": 1527987645,
        "upvote_ratio": ""
    },
    {
        "title": "Would having the ability to regenerate tissue get rid of scar tissue?",
        "author": "Pecsus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o4vj8/would_having_the_ability_to_regenerate_tissue_get/",
        "text": "If someone had scars and suddenly got the ability to heal like Wolverine\\(\"rapid cell regeneration\" kind of\\), would the scars fade?",
        "created_utc": 1527985659,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if we, the human race and every nation with nuclear capabilities, launched every nuclear missile at the sun all at once?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o4n15/what_would_happen_if_we_the_human_race_and_every/",
        "text": "[deleted]",
        "created_utc": 1527983314,
        "upvote_ratio": ""
    },
    {
        "title": "Do gay men have less testosterone?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o4mge/do_gay_men_have_less_testosterone/",
        "text": "[deleted]",
        "created_utc": 1527983159,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the consequences of a very large body of water suddenly froze over?",
        "author": "Singurularity",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o3p12/what_would_be_the_consequences_of_a_very_large/",
        "text": "Say, by some mysterious magic, the Mediterannean sea/the piece of ocean separating North America from Europe/any other large body of water suddenly froze solid, like, ice sheet kind of freezing over.\n\nWhat could the consequences of such a thing be on the surrounding land/weather/ecosystems?",
        "created_utc": 1527974439,
        "upvote_ratio": ""
    },
    {
        "title": "What if light was fast enough to escape a black hole? If so, how would a black hole look like?",
        "author": "ClassicGuy100",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o3gf0/what_if_light_was_fast_enough_to_escape_a_black/",
        "text": "",
        "created_utc": 1527972213,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any science-supported brain-training exercises for improving memory and attention?",
        "author": "VoiceoftheDarkSide",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o3g3f/are_there_any_sciencesupported_braintraining/",
        "text": "Hi all,\n\nI have read articles claiming that the brain\\-training games such as those provided by the website \"Lumosity\" do not actually improve general cognitive performance but only improve your ability to perform the specific tasks that you give you in the games.\n\nI am curious to know if there are things a person can do to improve their cognitive function in general \\(rather than very specific tasks\\). I know that there isn't some secret universal IQ improvement program \\- all I am looking for is something to improve certain basic mental functions like memory/focus/attention and also reduce their decline with age \\(I'm not old yet, but I would like to start early\\).\n\nAny insight is appreciated.",
        "created_utc": 1527972128,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the primary or initial cause of mass extinction if the Moon were to start falling towards the Earth?",
        "author": "RuvinWolf",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o34dt/what_would_be_the_primary_or_initial_cause_of/",
        "text": "Not sure if this falls under planetary science or physics (kind of both). Would the imbalance of tidal forces from the moon being so close cause the planet to flood over first, or would the Moon passing the Roche limit raining fiery death on the surface first? Or some other cause I'm unaware of?",
        "created_utc": 1527969193,
        "upvote_ratio": ""
    },
    {
        "title": "Rebuilding modern era technologies from scratch",
        "author": "Jarros",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o336x/rebuilding_modern_era_technologies_from_scratch/",
        "text": "Being deeply inspired by /r/primitivetechnology (in those videos the 'progress' stops somewhere between the stone and iron ages), I wonder if it is possible for one person alone to rebuild the technologies of our modern age from scratch (say, the final goal is a smartphone or an adiabatic 50-qubit quantum computer). \n Let's say that person has got a large chunk of land full of natural resources, moderately high intelligence and, most importantly, unlimited broadband connection to the Internet (that equals having quick access to all the knowledge of mankind).\n\nIf it's not possible then what the lowest number of people and their competences required? What are the greatest challenges they will face on their way of reproducing entire human technology step-by-step?",
        "created_utc": 1527968886,
        "upvote_ratio": ""
    },
    {
        "title": "Can you damage your arm from sleeping on it?",
        "author": "hurraybies",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o32ov/can_you_damage_your_arm_from_sleeping_on_it/",
        "text": "I assume the answer is yes, cutting the blood flow obviously isn't good. Can this cause permanent damage? How long would it take? What are some crazy stories about people sleeping on their limbs? Any other interesting information?\n\n",
        "created_utc": 1527968765,
        "upvote_ratio": ""
    },
    {
        "title": "What is a good way to teach the basics of the optical spectrum?",
        "author": "parametrek",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o2zwb/what_is_a_good_way_to_teach_the_basics_of_the/",
        "text": "In my day to day life I get excited about the discovery of new exoplanets and particularly excited when we nail down details about atmospheric composition. So I'll be talking about the latest discovering with someone and invariably they'll ask \"How do we know this stuff without sending a probe out there?\"\n\nAnd I've gotten reasonably decent at explaining spectroscopy. Usually by starting with how a neon bulb works and going forwards from there.\n\nHowever sometimes I get really tripped up by a fundamental misunderstanding about color. I'll say that excited neon always emits a specific orange light and they will respond with something like \"Orange is really a mixture of the primary colors red and green.\" And in the handful of cases where I've run into this I've never been able to bridge the gap. Explaining that RGB color is an optical illusion the same way that \"30 fps is continuous motion\" is an optical illusion doesn't click. Or that white light contains a full spectrum of colors.\n\nWhat is a good way of overcoming the misconception that there are no colors besides RGB and that the color spectrum actually exists?",
        "created_utc": 1527968062,
        "upvote_ratio": ""
    },
    {
        "title": "What's the heat capacity of earth?",
        "author": "Jack_Harmony",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o2cm8/whats_the_heat_capacity_of_earth/",
        "text": "This question arises from the fact that the earth is about one degree warmer than how it used to be in the 50's. Given that this is quite a big deal, that must mean there are lots of possible changes. Lots of changes imply lots of energy, but just how much?\n\nHow much extra hurricane does global warming provide?\n[](/raincloud)",
        "created_utc": 1527962484,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best way of removing a large amount of blood from a carpet without damaging the carpet?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o1skb/whats_the_best_way_of_removing_a_large_amount_of/",
        "text": "[removed]",
        "created_utc": 1527957678,
        "upvote_ratio": ""
    },
    {
        "title": "Straight condensation trails?",
        "author": "VicThorium",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o13e9/straight_condensation_trails/",
        "text": "Knowing that wind is much more violent 11 km above the ground I wonder why condensation trails are pretty straight? \nShouldn't we observe the trails creating major angle line to the direction of flying jet?",
        "created_utc": 1527951980,
        "upvote_ratio": ""
    },
    {
        "title": "What sort of struggles would women face carrying and giving birth to a child on Mars in their 0.376G?",
        "author": "Conkuro-kun",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o10in/what_sort_of_struggles_would_women_face_carrying/",
        "text": "Would women even be capable of conceiving, carrying, and giving birth in 0.3G? Or would women have to spend their pregnancy on a rotating station of some sort to simulate Earth's gravity? \n\nAfter that, would the child be capable of forming a solid skeleton and body structure in low gravity? Perhaps with assistance from various medications? How plausible would this be? ",
        "created_utc": 1527951375,
        "upvote_ratio": ""
    },
    {
        "title": "In your field, which current area of research holds the greatest potential for a major breakthrough in the near future?",
        "author": "GarageJim",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o10di/in_your_field_which_current_area_of_research/",
        "text": "",
        "created_utc": 1527951340,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there no free spindles in string theory?",
        "author": "PerpNurp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o0xd5/why_are_there_no_free_spindles_in_string_theory/",
        "text": "Why are there no free spindles disconnected from branes in string theory? Why do all leaps require closed loops?\n\nCan only closed loops seed branes?\n\nIs there some other explanation, like all free spindles map to points, which have a duality with branes?\n\nOr is such a correlate reserved for some other geometry, so it is not that you cannot do it, but that it is a reserved for some other commensuration/aggregation? That they stack in some other space?\n\nOr am I over thinking this? The loop trivializes the relation so that it can be completed in some form of distinguishing. Connected or disconnected, that’s it.\n\nI can imagine some improbable configuration, so I would think some mathematical wholism should be able to include it, even if it cancels or is better imagined from some other perspective.  I understand if it is more about expanding trivialities to solve the nontrivial or pragmatic reductions to proceed.\n\nTL/DR: Middle out spindle lives matter!\n\n",
        "created_utc": 1527950430,
        "upvote_ratio": ""
    },
    {
        "title": "A question regarding airships and terrorism",
        "author": "WeirdSymmetry",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8o0qzw/a_question_regarding_airships_and_terrorism/",
        "text": "Let's say, in modern day airships are the king of the skies instead of airplanes. If a hijacker managed to fly a Hindenburg\\-sized airship towards the Twin Towers, what would be the outcome? Would it be worse?",
        "created_utc": 1527948322,
        "upvote_ratio": ""
    },
    {
        "title": "Simulated Universes in Multiverse Hypothesis",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nzs70/simulated_universes_in_multiverse_hypothesis/",
        "text": "[deleted]",
        "created_utc": 1527936448,
        "upvote_ratio": ""
    },
    {
        "title": "[speculation] If we would live underwater and have gills, would we be able to sustain our oxygen needs?",
        "author": "Paradise-Shity",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nzhui/speculation_if_we_would_live_underwater_and_have/",
        "text": "",
        "created_utc": 1527932018,
        "upvote_ratio": ""
    },
    {
        "title": "How deep could a person go on a one-way scuba dive?",
        "author": "passengerpigeon20",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nzgfj/how_deep_could_a_person_go_on_a_oneway_scuba_dive/",
        "text": "After watching a documentary about poorly-run scuba diving operations, in which one diving trip accidentally reached a depth of 90 metres using standard recreational scuba equipment rather than the limit of 30, I began to wonder how deep somebody could go on a 60-minute air tank with standard scuba gear if they swam straight down into the deep sea with no intention of ever returning to the surface alive. What would be the first thing to \"give\" on such a suicidal mission?",
        "created_utc": 1527931367,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a revolution coming? Deep learning and neural net AI's.",
        "author": "EightballTV",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nz6yu/is_there_a_revolution_coming_deep_learning_and/",
        "text": "[removed]",
        "created_utc": 1527927106,
        "upvote_ratio": ""
    },
    {
        "title": "Does the greater rate of cortical thinning in adult autistic brains result in an accelerated process of cognitive decline compared to neurotypicals?",
        "author": "AloneBowler1",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nyuki/does_the_greater_rate_of_cortical_thinning_in/",
        "text": "I had this question after reading this article: https://www.spectrumnews.org/news/brain-expands-too-fast-shrinks-too-soon-in-autism/\n\nFor the purpose of this question, I'm mainly wondering about the high-functioning end of the spectrum (e.g., what used to be classified as Asperger's syndrome). Also, by \"cognitive decline\", I'm referring to age-related cognitive decline.",
        "created_utc": 1527921703,
        "upvote_ratio": ""
    },
    {
        "title": "Why doesn’t a charcoal barbecue get red hot?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ny985/why_doesnt_a_charcoal_barbecue_get_red_hot/",
        "text": "[deleted]",
        "created_utc": 1527914082,
        "upvote_ratio": ""
    },
    {
        "title": "What methods do we currently have to counter Antibiotic Pollution in the environment, and what methods are currently being explored?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nxvju/what_methods_do_we_currently_have_to_counter/",
        "text": "[deleted]",
        "created_utc": 1527909673,
        "upvote_ratio": ""
    },
    {
        "title": "what is the highest frequency a musical instrument can produce without going into ultrasound utilizing quartz + volts?",
        "author": "fishrbraindead",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nxt96/what_is_the_highest_frequency_a_musical/",
        "text": "what is the highest frequency a musical instrument can produce without going into ultrasound utilizing quartz + volts?\n\nI know ultrasound can be achievable by oscillating a thin layer of quartz crystals with voltages from 2 smashing electrodes while the crystal is in the middle... but it got me thinking, music also makes sound...\n\nIs there exist a musical instrument that can be blown or produced mechanically to reach ultrasound?\nOr what is the highest frequency a musical instrument has ever achieved? Google does not help me with this question at all, so I had to ask.",
        "created_utc": 1527908983,
        "upvote_ratio": ""
    },
    {
        "title": "If life is proven to not exist on Mars, will it be possible if we use forward contamination as a method of Terraforming the planet?",
        "author": "ChloroFrost",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nxr90/if_life_is_proven_to_not_exist_on_mars_will_it_be/",
        "text": "Since certain bacteria are used to make soil suitable for plants does that mean we could potentially make Mars's soil far more habitable for plant life?",
        "created_utc": 1527908380,
        "upvote_ratio": ""
    },
    {
        "title": "The universe is a cycle and everything that happens will repeat infinite times.",
        "author": "natantantan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nxnoz/the_universe_is_a_cycle_and_everything_that/",
        "text": "[removed]",
        "created_utc": 1527907345,
        "upvote_ratio": ""
    },
    {
        "title": "What is the largest number that humans can comprehend?",
        "author": "ddotquantum",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nwgux/what_is_the_largest_number_that_humans_can/",
        "text": "What is the largest integer that humans can either store in the brain or that humans can imagine?   \nFor example, it’s really hard to image 299792458 things but it can easily be stored in the brain\n\n",
        "created_utc": 1527895733,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion on the theory of living in a simulation",
        "author": "Meesejuice175",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nwdku/opinion_on_the_theory_of_living_in_a_simulation/",
        "text": "I thought this was stupid at the start of people thinking this however after Elon musk discussion about it I’m genuinely interested ",
        "created_utc": 1527894905,
        "upvote_ratio": ""
    },
    {
        "title": "Would surgeries that only damage extracellular areas be scar-less?",
        "author": "Typical_BC_screaming",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8nvtt3/would_surgeries_that_only_damage_extracellular/",
        "text": " ",
        "created_utc": 1527890083,
        "upvote_ratio": ""
    }
]