[
    {
        "title": "When we photoshop images from space how accurate are the color schemes we add?",
        "author": "The_MegaDingus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zk5wx7/when_we_photoshop_images_from_space_how_accurate/",
        "text": "I’ve heard all the pictures of nebulae, cosmic clouds and various other things are photoshopped after the fact to add the colors, based on data we received. How accurately can we portray the colors? Are we using best guesses, or are we getting enough to add the colors accurately?",
        "created_utc": 1670867267,
        "upvote_ratio": 0.5
    },
    {
        "title": "Among the cell structure and function what strike you the most important where you relate to its purpose and function that describes you as a person?",
        "author": "ashx34",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjywb6/among_the_cell_structure_and_function_what_strike/",
        "text": "",
        "created_utc": 1670851127,
        "upvote_ratio": 1.0
    },
    {
        "title": "The knee gives a mechanical advantage point for the leg, would a \"reverse knee lever\" also work?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjyb2s/the_knee_gives_a_mechanical_advantage_point_for/",
        "text": "As shown in [this video](https://youtu.be/XnYO4TnpTCo), the simulated knee cap creates a fulcrum that allows for a better mechanical advantage for the muscles to pull the leg.\n\nSo I was wondering if the reverse would also work, or if it wouldn't change much at all.\n\nFor example, [in this illustration I made on paint](https://imgur.com/a/XpddYuv) it is shown a mechanical lever **type 3** with **30 cm of length**, where the **load** is on a **30 cm** distance from the **fulcrum** and the effort is at **10 cm** distance from the fulcrum.\n\nThe effort is being done by a rope being pulled by a motor.\n\nAccordingly to [this online mechanical lever calculator](https://www.translatorscafe.com/unit-converter/en-US/calculator/lever-mechanical-advantage/), inputing these numbers would give me **0.5 of mechanical advantage**, so in order to lift 1 kg, I would need to input twice the value in order to achieve equilibrium.\n\nHowever, if I insert a \"reverse knee cap\" over the effort at **10 cm** distance and attached the effort rope directly to the load arm, as shown in the illustration, would the mechanical advantage stay the same, or it would change?",
        "created_utc": 1670849754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Among the cell structure and function what strike you the most important where you relate to its purpose and function that describes you as a person",
        "author": "browny371",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjvo26/among_the_cell_structure_and_function_what_strike/",
        "text": "",
        "created_utc": 1670842640,
        "upvote_ratio": 0.99
    },
    {
        "title": "In our generation. what do you think is the most valuable characteristics of living organisms today? why?",
        "author": "browny371",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjsd4j/in_our_generation_what_do_you_think_is_the_most/",
        "text": "",
        "created_utc": 1670833136,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is Shopify testing a new universal search feature?",
        "author": "Rajkishor25",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjrbqq/how_is_shopify_testing_a_new_universal_search/",
        "text": " How is Shopify testing a new universal search feature?\n\n[https://www.quora.com/unanswered/How-is-Shopify-testing-a-new-universal-search-feature](https://www.quora.com/unanswered/How-is-Shopify-testing-a-new-universal-search-feature)",
        "created_utc": 1670830245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outdoor pir sensor",
        "author": "blip1111",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjp4jd/outdoor_pir_sensor/",
        "text": "Where I work there's a passive infra red sensor, whose function is to open a roller door to let people through.   The sensor seems to have the sensitivity turned right down, and I often have to wave my arms madly to trigger it.  I've worked with similar sensors in the past, and usually they can be triggered by waving a stick right in front of it - but not this one.  Any suggestions for how to get this bastard to trigger?  Thanks",
        "created_utc": 1670824511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to keep a star alive?",
        "author": "AlexandertheIght",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjlzj2/is_it_possible_to_keep_a_star_alive/",
        "text": "If we got advanced enough or a alien race was in the same situation as us could we or them  build a theorized device that artificially powers the star by supporting it with its helium or hydrogen needs keeping it stable? How could this possibly work? If it isn't possible why?",
        "created_utc": 1670816927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it foolish for humans to assume that we are the most intelligent creatures on earth?",
        "author": "Blastronaut321",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjl2v8/is_it_foolish_for_humans_to_assume_that_we_are/",
        "text": "",
        "created_utc": 1670814908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a home invasor murderer get away with it nowadays?",
        "author": "Enzo-chan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjk9e2/could_a_home_invasor_murderer_get_away_with_it/",
        "text": "I'm asking that because I've heard your skin use to shed a lot of dead cells. Can such a low amount of genetic matter be enough to figure out who the ofender is, even in the case the man use latex gloves, covid mask and a hair protection(such as a cap)?",
        "created_utc": 1670813114,
        "upvote_ratio": 1.0
    },
    {
        "title": "How realistically fast can the timeline be after ITER has achieved its goals to fusion plant roll out?",
        "author": "SteelRiverGreenRoad",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjhhr6/how_realistically_fast_can_the_timeline_be_after/",
        "text": "Once the design and engineering knowhow is finalised with ITER, what is a realistic timeline for building of subsequent reactors (in parallel?)\n\nI’m assuming the science and engineering of  the full supply chain would be worked out at that point?",
        "created_utc": 1670807249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there a push to natural gas from oil when they are both considered non-renewable resources?",
        "author": "Dataspurgers",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjhblq/why_is_there_a_push_to_natural_gas_from_oil_when/",
        "text": "Is there a push for another solution over that other than lithium batteries that still isn't a renewable resource? Are there no real viable renewable energy sources?",
        "created_utc": 1670806885,
        "upvote_ratio": 1.0
    },
    {
        "title": "What limitations does the Schwinger limit impose on inertial confinement fusion?",
        "author": "Original-Document-62",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zjgrug/what_limitations_does_the_schwinger_limit_impose/",
        "text": "So, does it mean that above a certain energy density, light would produce electron/positron pairs? And if I'm understanding correctly, this means you can't really get any more light per unit of area.\n\nSo, wouldn't this put a limit on how much energy can go into the lasers used for inertial confinement fusion? Are we reaching that limit, or does it look like that limit will prevent us from being able to produce better fusion reactors?\n\nI may be completely misinterpreting what I've read.",
        "created_utc": 1670805769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alien Life",
        "author": "Interesting_Cap4686",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zja6tu/alien_life/",
        "text": "Being that stars and systems are more densely populated in the center of the Milky Way, is it more likely that interplanetary species or collections of species live in this area?",
        "created_utc": 1670794602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Off-world Colony - Genetic Diversity",
        "author": "Beast_Chips",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zj8bs2/offworld_colony_genetic_diversity/",
        "text": "My question is, essentially (or TLDR), how many people would be needed to start a colony on another planet, in terms of keeping a \"healthy\" gene pool? \n\nIf we were to establish a colony on another planet intended to be self-sustaining in terms of people - no new arrivals - would there be a minimum on how many people would need to be there at the start to ensure generational success of the colony? \n\nWould there be factors to consider in terms of a colony with \"healthy\" genetics, other than how many people were present at the start? For example, would choosing an even distribution of ethnicities be more beneficial to the colony's collective genetics? \n\nThanks!",
        "created_utc": 1670791909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Vaclav Smil a charlatan?",
        "author": "jrdubbleu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zj72wg/is_vaclav_smil_a_charlatan/",
        "text": "He writes about everything. Is he just the worlds best literature reviewer and distiller, another joker with an agenda?",
        "created_utc": 1670790192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life in the universe",
        "author": "Interesting_Cap4686",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zj6nwz/life_in_the_universe/",
        "text": "If the creation of life is so improbable, why are there several species and types of life on Earth?",
        "created_utc": 1670789593,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the Earth and Moon had been in the orbit of Venus and Venus was in the orbit of Earth, how would the climate be different on each planet?",
        "author": "workertroll",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zj4ri0/if_the_earth_and_moon_had_been_in_the_orbit_of/",
        "text": "",
        "created_utc": 1670786330,
        "upvote_ratio": 1.0
    },
    {
        "title": "If ghosts are really exists, will they blast off immediately from earth by the laws of physics?",
        "author": "Anarcheddon",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zj0cot/if_ghosts_are_really_exists_will_they_blast_off/",
        "text": "",
        "created_utc": 1670779196,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the Paleocene-Eocene Thermal Maximum 56 million years ago spiked up the planet's temperatures to be as hot as the Triassic, would that also turn the tropics into unlivable deserts?",
        "author": "JohnWarrenDailey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/ziyrd5/if_the_paleoceneeocene_thermal_maximum_56_million/",
        "text": "To put into context, the PETM raised the Paleocene's already warm climate by five to eight degrees Celsius.  By contrast, the Triassic averaged from 122 to 140 degrees Fahrenheit in the tropics, with sea surface temperatures of 104 degrees.",
        "created_utc": 1670776535,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a practical home experiment that I can do to observe evolution?",
        "author": "Torin_3",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zixzku/what_is_a_practical_home_experiment_that_i_can_do/",
        "text": "Hi,\n\nI'm a layman, and I'd like to do some sort of simple home experiment that allows me to see a population evolve. Ideally it will not be expensive or require a lot of time. \n\nI got the idea from Jerry Coyne's book *Why Evolution is True*. On page 129-130 he mentions an experiment with a micro-organism that was put into a vat of nutrient broth and watched for a period of ten days, over which time it developed two mutant sub-types which occupied different areas of the broth. \n\n&gt; We can even see the origin of new, ecologically diverse bacterial species, all within a single laboratory flask. Paul Rainey and his colleagues at Oxford University placed a strain of the bacteria Pseudomonas fluorescans in a small vessel containing nutrient broth, and simply watched it. (It's surprising but true that such a vessel actually contains diverse environments. Oxygen concentration, for example, is highest on the top and lowest on the bottom.) Within ten days - no more than a few hundred generations - the ancestral free-floating \"smooth\" bacterium had evolved into two additional forms occupying different parts of the beaker. One, called \"wrinkly spreader,\" formed a mat on top of the broth. The other, called \"fuzzy spreader,\" formed a carpet on the bottom. The smooth ancestral type persisted in the liquid environment in the middle.\n\nThat is the kind of experiment I'm interested in doing. Basically, I'd like to buy some bacteria (or whatever) and materials online, assemble everything, and leave the experiment alone for a while, then come back to see what has happened.\n\nI've been doing some Googling for the last hour or so, and it seems like the best candidates for this kind of experiment are plants, fruit flies (flightless?), and micro-organisms. I'm having trouble finding ready-made instructions for the kind of experiment I'd like to do, though. I see that science educators use wrinkly spreaders to demonstrate evolution in their classes sometimes, but I'm not sure how to actually get those myself.\n\nI assume there are scientists and science teachers here, so I thought I'd pose the question to this community.",
        "created_utc": 1670775242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is so much emphasis being placed on testing the Artimis/Orion heat shield?",
        "author": "Clever_Unused_Name",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/ziufls/why_is_so_much_emphasis_being_placed_on_testing/",
        "text": "I understand that the heat shield is what allows the capsule to survive the friction/heat of reentry.  But haven't we done this multiple times before, starting more than 50 years ago?  Wouldn't this be somewhat routine by this point?  What's changed that makes this a \"top priority\" of this mission?",
        "created_utc": 1670769393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a baby know good food if they smelt it?",
        "author": "jazinthapiper",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/ziq4fg/would_a_baby_know_good_food_if_they_smelt_it/",
        "text": "If a baby smelt something we adults knew was delicious, like a roast, would they have the same salivary or hunger reflex like we do? Would they have the same desire to eat it even though they have never smelt or eaten it before?",
        "created_utc": 1670761831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a baby know good food if they smelt it? If a baby smelt something we adults knew was delicious, like a roast, would they have the same salivary or hunger reflex like we do? Would they have the same desire to eat it even though it's not part of their capable diet?",
        "author": "jazinthapiper",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/ziq369/would_a_baby_know_good_food_if_they_smelt_it_if_a/",
        "text": "",
        "created_utc": 1670761750,
        "upvote_ratio": 1.0
    },
    {
        "title": "If all the mitochondria in my body instantly vanished, what would happen to my body?",
        "author": "peaceofmind1157",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zii4re/if_all_the_mitochondria_in_my_body_instantly/",
        "text": "",
        "created_utc": 1670740055,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think are the most important scientific discoveries/theories that everyone should know?",
        "author": "peopleoverprofits124",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zih8nk/what_do_you_think_are_the_most_important/",
        "text": "That everyone without a science background should be informed of",
        "created_utc": 1670738121,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you distributed galaxies randomly across the universe, not that that's the case, statistically how likely would you end up with things like the Boötes Void?",
        "author": "pakled_guy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zig70o/if_you_distributed_galaxies_randomly_across_the/",
        "text": "",
        "created_utc": 1670735803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stopping an AI \"Paperclip Maximizer\" via ethics?",
        "author": "Scoob307",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zi26ua/stopping_an_ai_paperclip_maximizer_via_ethics/",
        "text": "Short question: Why can't we hardwire some sort of machine/logic understandable type of ethics into AI to avoid the old SkyNet takeover scenario or a mundane paperclip maker grey-goo-ing the universe into nothing but paperclips? \n\nLonger rant: I don't know much about AI or computer science... apparently not enough to figure out what terms or phrases to search so I'm looking for some pointers. I can't code, don't know much about machine learning schemes, etc. Anyone know of any sources to look into that don't go to deep into the technicals? \n\nI get that we can't just program the Hippocratic Oath into code and tell a system to do no harm. But my guess is that people are trying. What are some key words or topics I can dive into to better understand any of this.",
        "created_utc": 1670703090,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the most optimal solution to deploy a vaccine against an infectious disease: prioritizing the vaccination of the most vulnerable people, or prioritizing the vaccination of people who are vectors of the disease?",
        "author": "Willing_Head_4566",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhywxo/whats_the_most_optimal_solution_to_deploy_a/",
        "text": "I assume it depends on the characteristics of the disease and the vaccine, so my question in voluntarily general and \"naive\". I don't have a specific disease in mind and I am curious to know what characteristics influence the choice of a vaccination strategy. Thanks!\n\nPS: I originally asked this question on /r/askscience (https://www.reddit.com/r/askscience/comments/zhpip1/whats_the_most_optimal_solution_to_deploy_a/), but it has been removed because apparently it would imply speculation or opinions. To be clear, I'm looking for studies on the subject, absolutely not for opinions or speculation. But as a moderator asked me to copy my question on this subreddit and I'm not knowledgeable on the subject, I trust him/her relative to the fact my question would generate speculation, so here it is. But I'd prefer to avoid any speculation or opinion if possible.",
        "created_utc": 1670695194,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you folk teach stoichiometry?",
        "author": "dimonium_anonimo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhx1xq/how_do_you_folk_teach_stoichiometry/",
        "text": "Does anybody have food tips for explaining chemical equation math to students who aren't confident in their math skills? I have a tutoree who is struggling to understand what steps are needed for problems of the following variety:\n\nX grams of molecule A are added to Y grams of molecule B to make molecule C. What is the limiting reactant? How many grams of the extra reactant will be left after the reaction? How many grams of molecule C will be produced?\n\nNot all of them contain all of these aspects, but even when we're given moles, given a balanced equation, told which is the limiting reactant, and only asked to find moles of the product so there is only one step, I still am unable to describe the process in a way she understands. I'll see if I can explain the way I did below, but I usually use visual aids to help, so sorry if I poorly explain it.\n\nIf the only step we need is to find the ratio between the moles, then write down the number in front of molecule A (what we're given) and the number in front of molecule B (what we need to find). Multiply the given number of moles by #B/#A. I show her how if you use units like \"moles of A\" × (\"moles of B\" / \"moles of A\") that they cancel out and leave you with only \"moles of B\" which is what we want. I've shown her how every problem like this will only use 2 of the numbers in the equation, and you are always told which molecules the chosen numbers are in front of. And I can't seem to explain it well enough. So if there are any tips or tricks out there, I'd appreciate hearing about it.",
        "created_utc": 1670690628,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the problem with Heisenberg probability principle?",
        "author": "eltegs",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhvktg/whats_the_problem_with_heisenberg_probability/",
        "text": "In science, what is the difference between uncertainty, and probability, are the two interchangeable?",
        "created_utc": 1670686960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Magnet propelled ball-bearing gun idea.",
        "author": "Tjukmeister",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhvgil/magnet_propelled_ballbearing_gun_idea/",
        "text": "So here is my idea. A gun with a circular chamber on the side with magnets (like a small hydron collider) brings the metal ball-bearing up to a certain speed. When the ball reaches a certain speed, a precise theoretical scifi mechanism closes the looped chamber and provides an entry point to the main gun chamber witch fires the ball out. Stupid idea i had watching some real coil guns.",
        "created_utc": 1670686644,
        "upvote_ratio": 1.0
    },
    {
        "title": "magnet propelled ball-bearing gun theory",
        "author": "Tjukmeister",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhvan8/magnet_propelled_ballbearing_gun_theory/",
        "text": "",
        "created_utc": 1670686229,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do we use θ/360-1=x , when we are solving for the no. of images formed between 2 plane mirrors facing each other at an angle?",
        "author": "SpotifySleeps",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhkp10/why_do_we_use_θ3601x_when_we_are_solving_for_the/",
        "text": "So yesterday my teacher was teaching us about how to solve for the no. Of images by 2 plane mirrors when facing each other at a certain angle, and on the  activity she gave us we were ask to derive a formula in doing so. \n\nWe were gonna do this by using data from our previous experiment. Where we put 2 plane mirrors facing each other at an angle , then putting a pen in the middle to see how many times we can see the pen's image in the mirrors. We did this using 90° 60° 45° and 30° as our angles in between our mirrors. We saw 3 images formed at 90° , 5 for 60° , 7 for 45° , and 11 for 30°.\n\nWith that in mind everybody in class all found that by dividing θ by 360° then - 1 they can get the no. of images formed. \n\nExcept for me... \n\nSomehow , my brain just looked at the last example 11 images formed at 30° and said \" huh isnt 11*30 = 330? So its just missing another 30°... Hmm\" and wrote (360-θ)/θ instead as my answer..\n\n Somehow this works idk how but it works??? And my teacher accepted my answer somehow???\n\nHelp ?? Can someone explain this?? Do other people also use the method I came up with?? Or am I missing something thats why I think it works??\n\nAlso sorry if my grammar and formating sucks , English is my 3rd language and Im on mobile.",
        "created_utc": 1670652492,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if every person in the world jumped all at once?",
        "author": "The_MegaDingus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhjse6/what_if_every_person_in_the_world_jumped_all_at/",
        "text": "Would there be a noticeable effect, and could we detect the sound or vibrations of everyone jumping together? How might it sound?",
        "created_utc": 1670649515,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I calculate the size of a McKibben hydraulic artificial muscle necessary to lift 5 tons of weight?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zhc3nh/how_do_i_calculate_the_size_of_a_mckibben/",
        "text": "So, I intend to make a hydraulic [McKibben artificial muscle](https://youtu.be/L0esNg2ys_s?t=127) out of Aramid/Kevlar, but I don't know the pressure necessary or the diameter required. But I do have the idea of making it 30 cm long.",
        "created_utc": 1670627954,
        "upvote_ratio": 1.0
    },
    {
        "title": "What stops lithium-ion batteries from catastrophically failing every time they're damaged",
        "author": "literaldehyde",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zh9ny4/what_stops_lithiumion_batteries_from/",
        "text": "Obviously there's the occasional catastrophic cases where they do burst into flames, but I've seen people do so many stupid things with stuff involving lithium-ion batteries. \n\nI've seen people putting them in bags with sharp objects which could pierce them, I've seen them run over by cars, etc. \n\nWhat safety measures are in place to make batteries safer? I know certain parts of the battery need to come into contact for it to burst into flames, and I know they have gas vents. \n\nBut considering how often people put thin shelled stuff with li-ion batteries in them into their pockets with potentially sharp objects, what makes properly designed batteries more likely to fail-safe?",
        "created_utc": 1670622233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can AI teach us anything about human cognition?",
        "author": "Ekvitarius",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zh6xn2/can_ai_teach_us_anything_about_human_cognition/",
        "text": "",
        "created_utc": 1670615713,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is future of the earth and humankind ?",
        "author": "signersinger10",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zh2tcm/what_is_future_of_the_earth_and_humankind/",
        "text": "I know it will happen after 4or 5 billion years and I will not be around but the thought that someday the earth will disappear gives me panic attacks .\n\nsomeday everything will end .if we go to mars even mars will end someday because nothing lasts forever and humans will cease to exist..I love stability ,planning everything in advance ,I always imagined that life was infinite like lazy eight ...\n\nI know I should focus on near future but I obsess about this topic and think ,,what is point of developing human race and technology if we will cease to exist some day \" I have severe anxiety and ocd tendencies ...\n\nI am not believer .i do not believe in afterlife ..which gives me even more depressing and nihilistic thoughts\n\nThis is my recent phobia and I really hope I will grow out of this phase but right now I am really sad and depressed about it .I would appreciate every positive outlook on the topic so much",
        "created_utc": 1670606134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for a gift for my science-nerd girlfriend?",
        "author": "ProfessorJessica",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zh1pos/ideas_for_a_gift_for_my_sciencenerd_girlfriend/",
        "text": "Hello friends. If this kind of post would be better in another subreddit, please direct me. \n\nI want to get a nice gift for my girlfriend. She is a Forensic Biology major and is very passionate about genetics, DNA analysis, and that sort of thing. \n\nShe got so excited when she did a 23andme test and got access to her whole genome. She was recently ranting to me about how cool it would be to own one of those compact DNA sequencing things. \n\nDoes anyone here have any recommendations for a gift that I could get her? I'm trying to Google \"DNA sequencer\" and such, but I do not have a science brain and I don't really know where to start. \n\nAny help would be appreciated! If I could get her a gift that helps her explore her passions, that would make me so happy. \n\nI'm willing to spend a chunk of money. If it's like a thousand dollars or so I plan on trying to secretly collaborate with her parents to pay for it. \n\nTL;DR what to get for Christmas for my science loving girlfriend who is obsessed with DNA and genetics?",
        "created_utc": 1670603429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gift ideas for a young teen interested in Biology?",
        "author": "ssladam",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zgwtp3/gift_ideas_for_a_young_teen_interested_in_biology/",
        "text": "I have a young teen that's expressed interest in Biology, and has asked for a microscope for Christmas. I'm worried that microscopes are quite expensive, and that without context or a set goal, it'll end up on the shelf after just a handful of uses.\n\nDoes anyone have advice for a decent gift idea for a teen showing budding interest in Biology?",
        "created_utc": 1670591038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can pockets of radioactive elements be used to trace magma flow in the Earth's mantle?",
        "author": "Millennial_Glacier",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zgvd30/can_pockets_of_radioactive_elements_be_used_to/",
        "text": "",
        "created_utc": 1670586983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im reading some experiments that say we are conscious of the intentions of our movements some milliseconds after we do the movement.. ???",
        "author": "everythingatonce_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zgtf9x/im_reading_some_experiments_that_say_we_are/",
        "text": "so I'm going crazy cause wtf. U mean our voluntary actions are not actually voluntary?",
        "created_utc": 1670581197,
        "upvote_ratio": 1.0
    },
    {
        "title": "What science facts and concepts should be engrained in every human being?",
        "author": "junkindafrunk",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zgpe36/what_science_facts_and_concepts_should_be/",
        "text": "",
        "created_utc": 1670568172,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s in an old man’s drool?",
        "author": "Startedwithnothing33",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zgk6yc/whats_in_an_old_mans_drool/",
        "text": "https://thedragonflyreport.com/2022/11/02/whats-in-an-old-mans-drool/",
        "created_utc": 1670552751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Influence of the Hubble flow in AGNs, quasars and galactic winds (outflows)?",
        "author": "stifenahokinga",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zghgol/influence_of_the_hubble_flow_in_agns_quasars_and/",
        "text": "Galactic winds (or outflows) are produced by AGNs, quasars, super novas...etc which basically eject matter usually in form of waves or spheres, sometimes even arriving to the IGM (Intergalactic Medium) composed by gas (which, when \"at rest\", it moves along the Hubble flow). \n\nHaving said this, does the matter moving along with the Hubble flow influence the energy content of these galactic winds? Does it add more kinetic energy to it (as this paper \u001b[1] seems to mention: see section 2.3)?\n\n[1]: https://reu.physics.ucla.edu/common/papers/2011/benjamin_sarah.pdf",
        "created_utc": 1670545995,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far are we from having functional biocomputers and is it possible?",
        "author": "Mcajsa",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zg8inx/how_far_are_we_from_having_functional/",
        "text": "Hello\n\nI recently learned about that scientist are researching biocomputers. Which I've thought that they were only sci fi thing. And while sci fi things coming to reality in research. But this is interesting.\n\nI am interested into them because they are emp proof in my opinion, but there could be flaws that im not aware of.\n\nI know something small things about what I could find on a wiki about biocomputer and wetware hardware. So I want to know how would be possible to make like a laptop or pc in form of biocomputer? How it would be function as a computer and would it be different from current computer experience? How would be made like cloning printing machine or assembiling it like a frankenstine's monster? And what degree would you will need to research and built biocomputers or other wetware hardware?\n\nThank you for reading this.\n\nCheers",
        "created_utc": 1670527178,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the tallest theoretical structure we could build?",
        "author": "quantumwoooo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zg7z7c/whats_the_tallest_theoretical_structure_we_could/",
        "text": "Ignoring the financials, how tall could we design a structure using any/ all of today's technology?\n\nAssuming the top can be any material/ any size (so it wouldn't need to support any weight etc)\n\n 10, 20km wide base too etc\n\nAswell, could we use heavy duty/ industrial balloons, or solar panels to power wind turbines to reduce the weight? \n\n\nCould we design something 100km tall?",
        "created_utc": 1670526069,
        "upvote_ratio": 1.0
    },
    {
        "title": "What technologies become possible after the advent of functioning nuclear fusion? Are there technologies waiting in the wings that need this power source to become possible or viable?",
        "author": "possblywithdynamite",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zg783o/what_technologies_become_possible_after_the/",
        "text": "",
        "created_utc": 1670524520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the electricity generated by nuclear power plants whose water vapor is used for district heating cheaper than that of regular nuclear power plants?",
        "author": "OrcaConnoisseur",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zg5u7l/is_the_electricity_generated_by_nuclear_power/",
        "text": "Some nuclear power plants, most prominently in Switzerland and Russia, use the water vapor generated by the electricity production process for district heating. It sounds like a very smart use for waste heat that would have usually just gone into the atmosphere. Does this make nuclear power plants that use their waste heat for district heating more economic than those that don't?",
        "created_utc": 1670521492,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is your favorite example of a living fossil and why are they significant?",
        "author": "spudfolio",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zg3nxw/what_is_your_favorite_example_of_a_living_fossil/",
        "text": "Mine is a Bowfin",
        "created_utc": 1670516619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could Venus have been saved by Life? (Carbon balance of Earth vs. Venus)",
        "author": "_Biophile_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zg346z/could_venus_have_been_saved_by_life_carbon/",
        "text": "I've tried looking for an answer to this (biologist here). If Venus had photosynthetic organisms like Earth that were capturing CO2 and storing it in soil/rock (with plate tectonics), billions of years ago, could Venus still be habitable today?\n\nBasically does Venus actually have more carbon currently as a planet (both atmosphere and rock/soil) than Earth? Could storage have \"fixed\" the problem or is it simply too close to the sun with too much carbon?\n\nWill Earth turn into an exact twin of Venus as the sun continues to brighten? (About 0.5 to 1 billion years from now) Or would it be slightly cooler due to carbon balance? (At equivalent solar luminosity)",
        "created_utc": 1670515464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can using transcranial magnetic stimulation to quiet the dorsolateral pre-frontal cortex; be used to increase the success rate in delicate surgical procedures?",
        "author": "SpecialistPast9344",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfzrh9/can_using_transcranial_magnetic_stimulation_to/",
        "text": "If it has been shown to increase accuracy in motor activities; can shutting it down transiently increase success rates in life saving operations where a high degree of motor skill is required?",
        "created_utc": 1670508071,
        "upvote_ratio": 1.0
    },
    {
        "title": "What can nanorobots do in reality? Will they be able to heal wounds in a few minutes? Kill any infection in the body? How is it shown in science fiction films (for example, Foundation the TV series)? If nanorobots are built in real life, will they be able to do what is shown in the films?",
        "author": "UltronAge",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfyq4o/what_can_nanorobots_do_in_reality_will_they_be/",
        "text": "",
        "created_utc": 1670505605,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think is the most interesting science experiment?",
        "author": "No_Construction5642",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfv4pc/what_do_you_think_is_the_most_interesting_science/",
        "text": "",
        "created_utc": 1670494853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could there have been a past high-tech civilization?",
        "author": "A380085",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zft6ux/could_there_have_been_a_past_hightech_civilization/",
        "text": "Hello, I am curious what you think about the possibility of an ancient civilization that was more advanced than us. I know we would have probably already found traces, but could they have been completely wiped out by something to where there isn't any evidence left. Also, we already contaminated the earth when we developed and tested nuclear weapons, but can we be sure this stuff wasn't already in the earth before from a past civilization. For example, did we only have the ability to test this once we already detonated one.\n\nSo do you think this is possible or is just impossible based on what we know?\n\n&amp;#x200B;\n\nThanks",
        "created_utc": 1670487748,
        "upvote_ratio": 1.0
    },
    {
        "title": "An expanding universe or just an explosion?",
        "author": "scarlytteh1",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfseym/an_expanding_universe_or_just_an_explosion/",
        "text": "Is it possible that what we are perceiving as an ever-expanding universe is just the aftermath of the relatively recent Big Bang explosion. Perhaps everything is moving away from each other right now because we're in the aftermath of that explosion and eventually some sort of limit will be reached and then everything will coalesce into a galaxy of galaxies? What do you think?",
        "created_utc": 1670484926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where in the electron transport chain do FAD and NAD change into ATP?",
        "author": "dogrescuersometimes",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfqovz/where_in_the_electron_transport_chain_do_fad_and/",
        "text": "It seems like the electrons moving about have nothing to do with the adenosine and triphosphate. I don't understand how Complex I and II accepting electrons has any effect on the creation of ATP.",
        "created_utc": 1670479055,
        "upvote_ratio": 1.0
    },
    {
        "title": "How feasible would it be (eventually) to create a highly pleasurable recreational drug that is counter-addictive: chemicals are added that directly inhibit psychological or chemical addiction, essentially \"resetting\" you to normal baseline the moment the experience is over?",
        "author": "hogw33d",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zflwr9/how_feasible_would_it_be_eventually_to_create_a/",
        "text": "Since people *can* get dependent on just about anything (including stuff that isn't normally chemically dependent), this would be quite the challenge. In this hypothetical, it doesn't bring you \"down\" or create any kind of weird feedback loop, but just puts you back to feeling normal and content at the end, without detracting from the pleasure you experience in the moment. So this wouldn't be just non-addictive, but actively works to prevent dependency from forming. Is this even possible? How?",
        "created_utc": 1670465834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that conservation of momentum from the Big Bang is responsible for the handedness of everything from atoms to the observable universe? Could it even be the cause of the universe having more mater than anitmater?",
        "author": "blutbad_buddy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfiulb/is_it_possible_that_conservation_of_momentum_from/",
        "text": "",
        "created_utc": 1670458157,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would be able to achieve solarpunkish ecology/world and how would applied ecology help the environment?",
        "author": "Mcajsa",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfabxp/how_would_be_able_to_achieve_solarpunkish/",
        "text": "Hello\n\nI was taught in school about importance of environment, but that was twelve years ago. I found about solarpunk and enjoyed its environmental vision and I don't mean greenwashing where you aestheatacly change the thing. I mean where you change enough with the science and policies to not be dependent on fossile fuels and most of the world have green sufficient, renewable and clean source. Like biofuel or electricity or something similar.\n\nI want to have clean earth and not waste dump. I don't believe in billionares vision of space travel, because I don't want see people, animals and earth suffer from choice of people who says that they will change and that they are green while on other hand they will sell escape tickets for those who wants them.\n\nSolarpunk is only acceptable future that I want to see. Where Im from we have a lot of natural environment and I am proud of it. I am from Croatia, if you want to know.\n\nRecently I found applied ecology which I kinda understood. Which I understood as applied type of ecological science. Where Im from I found two types for study. First one is applied ecology marine and second is applied ecology agronomy.\n\nThey are cool and useful, but I dunno, if that would be like what Im thinking. And that is research and development for new solutions and technology for ecology, reforestry, biodiversity and making more yielding and resisting crops. I was also thinking of how to reduce plastics and metal. To introduce alternatives with more biological and organic components for those stuff that we can replace.\n\nI was thinking how can I contribute to making more green future similar to solarpunk. I know that utopia isn't realistic, but going green and clean is possible, if we take our part to do it right and hold those responsible. But Im currently nobody and recycling.\n\nI want cleaner air to breath, safe plentyful food to eat (I don't care, if food is GMO or from test tube), cleaner water, energy independant and not be underwater. I like more advance technology thats why im not advocating to go the way of caveman, but I want use science and technology to make sure we can coexist with nature.\n\nI am also wonder is there degree or job for research and development for ecology and environmetnal technology. I am asking because I want to do with his own hands to change my environment for the better. Or could I just do stuff with writing, which better suits my skillset.\n\nSo I know that im asking a lot, but can you help me answer this questions about possiblities  of solarpunk future and applied ecology.\n\nSorry if I strayed from a topic at some point.\n\nThank you for reading.\n\nCheers",
        "created_utc": 1670439990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good diy demos showing photon pressure?",
        "author": "timelesssmidgen",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zfa2hd/any_good_diy_demos_showing_photon_pressure/",
        "text": "Or videos of such experiments? I'm imagining something like a heavy duty laser pointer shoving tiny dust particles around or something. I guess it would require a pretty hefty laser pointer, but maybe still within the limits of what consumers can get. If not, maybe [styropyro](https://m.youtube.com/channel/UCJYJgj7rzsn0vdR7fkgjuIA) can think something up! 😝",
        "created_utc": 1670439468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microbiome dysbiosis chicken or egg causality",
        "author": "iceyed913",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zf84zv/microbiome_dysbiosis_chicken_or_egg_causality/",
        "text": "I am aware that the prevailing theory regarding gut dysbiosis is states that eating unhealthy leads to dysbiosis and in turn causes or worsens many pathologies. While I am the first to admit that the modern diet is probably driving this change, I am however unsure about the suposed ease by which this is considered reversible by changing one's diet. Lets state for instance dysbiosis has reached a critical treshhold were sufficient pathogenic bacteria have come to dominate the gut. What I myself and many people with gut issues such as IBS and sibo experience is a worsening of symptoms when trying to adhere to the suposed dietary guidelines. More bloating, maldigestion, cognitive symptoms worsening. \n\nWhere I am going with this is the idea that we are probably need to reverse how we supose this is best treated. Microbiome replacement first and then you will probably find that on a psychological level most will be perfectly willing to stick to a mostly plant based diet with lower animal protein consumption. It's scary to me that mainstream microbiome therapies are still considered so outlandishly unnecessary unless a life is at risk. Delaying this research by implying it isn't essential for the treatment of many pathologies is causing unnecessary suffering. \n\nMoreover if we really want people to reduce their animal protein consumption, why shouldn't we consider sampling the microbiomes of the healthiest plant eaters. Through use of which we might be able to quickly instigate changes in dietary preference. You could be changing so many lives for the better by fast tracking this research. Modern diseases are getting worse by the decade and the medical establishment seems to be unwilling to take a leap of faith on this?",
        "created_utc": 1670435604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists' thoughts on this project to tackle the “replication crisis” by shifting incentives among researchers?",
        "author": "eddytony96",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zf81ms/scientists_thoughts_on_this_project_to_tackle_the/",
        "text": "https://www.vox.com/future-perfect/23489211/replication-crisis-project-meta-science-psychology",
        "created_utc": 1670435416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Microbiome dysbiosis chicken or egg causality",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1670434515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will gene testing eventually be standard for all new embryos to screen for \"bad genes\" and will gene editing be used to remove those \"bad genes\"?",
        "author": "MrZej",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zf4e9c/will_gene_testing_eventually_be_standard_for_all/",
        "text": "I believe gene testing is currently used in some places to screen for genetic diseases but will will it eventually be standard for all new embryos? Will gene testing also be used to screen for genes that may make you more impulsive or more prone to violence? In turn would there be a choice in whether to change those genes or not or would these genes be changed no matter what?",
        "created_utc": 1670428011,
        "upvote_ratio": 1.0
    },
    {
        "title": "biology or astronomy? how did u guys knew what to study?",
        "author": "medicamentosa_veia",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zezqtv/biology_or_astronomy_how_did_u_guys_knew_what_to/",
        "text": "[removed]",
        "created_utc": 1670415455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are monkeys not developing speech and tools, like the apes before archaic humans did?",
        "author": "Capital-Link-2214",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zeyk5v/why_are_monkeys_not_developing_speech_and_tools/",
        "text": "I saw a video of monkey using a stone to crush a nut. The stone worked as a tool, so in a sense monkeys can use tools, but I never heard of monkeys developing tools, like tying a stone to a piece of wood, or similar.\n\nI never heard of monkeys speaking either.\n\nWhy are monkeys not developing these traits, what was it that made the ancient apes (that archaic humans evolved from) do it?",
        "created_utc": 1670411570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any molecules/compounds produced almost solely by industrialization or scientific advancement that could be used to prove the existence of alien life on exoplanets?",
        "author": "Wide-Escape-5618",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zela4e/are_there_any_moleculescompounds_produced_almost/",
        "text": "JWST can determine the atmospheric composition of exoplanets right?  That is my understanding at least.  Maybe 50 years from now we will have a telescope that can do this even better than JWST.  Could this telescope potentially detect an atmospheric composition that could almost solely be explained by an intelligent alien species living on the planet?  Surely there is some obscure molecule who’s overwhelming presence in an atmosphere would be astronomically rare to occur naturally, right?",
        "created_utc": 1670368291,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you get a good overview of all recent/ trending papers of a broad field?",
        "author": "fairly_low",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zel22i/how_do_you_get_a_good_overview_of_all_recent/",
        "text": "I would like to keep up with the trends within different scientific communities, therefore I am looking for a tool, that analyzes a big number of papers and outputs:\n- topics that are mentioned more often lately (trending topics)\n- authors/ specific papers, that have been cited more often lately (trending papers and researchers)\n--&gt; This would be great to understand, where the overall trend of research is going and what might be worth reading more profoundly.\nDo you know a tool, that can do this?",
        "created_utc": 1670367777,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would it take to solve the problem of sand?",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zeklkc/what_would_it_take_to_solve_the_problem_of_sand/",
        "text": "See here: https://www.nytimes.com/2020/11/09/science/what-makes-sand-soft.html. I wonder what it would take to actually solve this problem; would it just take an enormous amount of computing power? Presumably they've already used very powerful computers to try to deal with all of the variables that they need to consider.",
        "created_utc": 1670366715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Blood alcohol level % directly correspond to alcohol by volume %?",
        "author": "Extension_Turnip4592",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zej6l9/does_blood_alcohol_level_directly_correspond_to/",
        "text": "Are these two numbers the same?",
        "created_utc": 1670363363,
        "upvote_ratio": 1.0
    },
    {
        "title": "How fast would an elevator have to travel to be able to pin someone inside the roof?",
        "author": "Chicken_Spanker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zeht5q/how_fast_would_an_elevator_have_to_travel_to_be/",
        "text": "",
        "created_utc": 1670360110,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to calculate the force per pressure of a McKibben artificial muscle?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zeg9n7/how_to_calculate_the_force_per_pressure_of_a/",
        "text": "I was wondering how much force per pressure or how much force in total a McKibben artificial muscle with 30 cm in length and 2 inch in diameter would be able to generate.\n\nWell, I don't want a super ultra precise asnwer, just the general force it would apply.\n\nFor example, I found [this document](https://scholarworks.rit.edu/cgi/viewcontent.cgi?article=10875&amp;context=theses) that has **57 pages** on the subject, but I kinda tried the first equation that appears.\n\n 𝐹 = 𝑃/4𝑛²𝜋 (3𝐿² − 𝑏²) \n\nF =force  \nP =pressure gauge  \nn = number of braid wraps on muscle   \nL =  muscle length   \nb =  muscle length \n\nI tried to apply the following amount of numbers on google calculator (what I didn't knew what to write I just pulled a random number):\n\n100/4²x3.14(3x30²-20²)\n\nAnd the answer was 45137.5, but I don't know if it is newtons or what, because this number seems a bit too high.",
        "created_utc": 1670356568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the refractive index of liquid water change at all depending on it's temperature between freezing and boiling? In general how much does temperature affect a material's refractive index (not including phase transitions)?",
        "author": "pakled_guy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zef2fk/does_the_refractive_index_of_liquid_water_change/",
        "text": "",
        "created_utc": 1670353681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the way DNA work universal?",
        "author": "AlexandertheIght",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zeaak8/is_the_way_dna_work_universal/",
        "text": "I know we are the only known case of life but if we found a carbon based life form would there DNA be the same or similar to ours or could it be completely different from ours?",
        "created_utc": 1670342343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do 2 observers traveling at vastly different speeds **really** experience time differently?",
        "author": "Ex-Military",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zea2kd/do_2_observers_traveling_at_vastly_different/",
        "text": "From what I understand, Special relativity states that experienced time is dependent on the observer's frame of reference - and that time itself actually slows down as you approach the speed of light.\n\n&amp;#x200B;\n\nHere is the scenario: The earth spins at normal rates. The sun passes overhead once every 24 hours. Observer 1, 30 years old, is standing still on the earth. Observer 2, also 30 years old, runs/travels in a circle (radius 3') around observer 1 at or very near the speed of light. Observer 1 watches as the sun passes overhead 3650 times, and says, \"I have been standing still for 10 years, I am now 40 years old.\"\n\n&amp;#x200B;\n\nQuestions: How many times does the sun pass overhead for observer 2? Has time progressed more slowly for observer 2? Finish observer 2's statement, \"I have been running in circles for \\_\\_\\_\\_\\_\\_ and I am now \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ years old.\" If atomic/physical decay (aging) happens more slowly as you approach the speed of light, then who is older, observer 1 or observer 2? Who appears older? What are their true ages?",
        "created_utc": 1670341780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is dark matter evenly distributed?",
        "author": "IgnoranceFlaunted",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/ze8akj/is_dark_matter_evenly_distributed/",
        "text": "Is the measurement we call dark matter found evenly across the visible universe? Do nearby galaxies have the same amount of dark matter as distant galaxies? Is it the same in every direction?",
        "created_utc": 1670337199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe that science and technology is the key to sustainability? Why or why not?",
        "author": "champorado_pancit",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/ze1r63/do_you_believe_that_science_and_technology_is_the/",
        "text": "Title.",
        "created_utc": 1670319175,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some things that science doesn't currently know/cannot explain, that most people would assume we've already solved?",
        "author": "FrodoTheDodo1",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zdrl4o/what_are_some_things_that_science_doesnt/",
        "text": "By \"most people\" I mean members of the general public with possibly a passing interest in science",
        "created_utc": 1670291795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assuming that energy wasn't an issue. Could you learn about the inside of a black hole by creating a small Kugelblitz and observing the radiation that comes out of it as it evaporates?",
        "author": "Memetic1",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zdq6hz/assuming_that_energy_wasnt_an_issue_could_you/",
        "text": "",
        "created_utc": 1670288103,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much force an actuator artificial muscle would need to apply in order to lift something at the pivot of a lever?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zdljzi/how_much_force_an_actuator_artificial_muscle/",
        "text": "**This is not a homework question by the way**, I was trying to imagine a robot arm lifting something at its elbow (a 1 ton weight), but the muscle is on the arm instead of the shoulder.\n\nThe thing I had in mind was:\n\nA 50 cm lever pointing downwards with 1 ton weight at its end with an actuator (an artificial muscle) also at its end pulling a cable on the pivot of rotation of the lever.  \nHow many kilograms of force does this actuator need to exert to balance this lever horizontally?\n\nOr I would need an \"outer wheel\" with a bigger radius (10cm) where the wire would wrap around, allowing for better mechanical advantage to make it possible to lift such thing?\n\n[Illustration on imgur](https://imgur.com/a/ZtOEY64) of what I mean.\n\nIs there an equation for this type of question? Because I couldn't find anything that teached this kind of problem.",
        "created_utc": 1670278038,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does a nuclear reactor work (I'm not talking about the theory of physics, but about real designs) How does a chain reaction begin?",
        "author": "UltronAge",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zdjejc/how_does_a_nuclear_reactor_work_im_not_talking/",
        "text": "How does a nuclear reactor work (I'm not talking about the theory of physics, but about real designs) How does a chain reaction begin?  Are the uranium rods just brought closer to each other?  or do they already stand at a fixed distance and simply increase their length by inserting carbon rods between them that block the reaction?  That is, to start a chain reaction, it is enough to bring two uranium rods closer to each other?",
        "created_utc": 1670273812,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I understand correctly, the less mass something has, the denser it can become without turning into a black hole. This should also correlate to a higher speed of sound in said material. Is there a theoretical limit on how fast this can get?",
        "author": "77gamerman",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zdj9yr/if_i_understand_correctly_the_less_mass_something/",
        "text": "Denser objects have higher speeds of sound. Larger objects require a lower overall density to collapse into a black hole. This means smaller objects can be compressed more, which means that those objects can have a higher speed of sound.\n\nIs there any limit on how fast the speed of sound in a material can be? I assume it can’t exceed the speed of light because that would throw basically all of modern physics out the window. But could a sound wave go at, say, 0.9999999c?",
        "created_utc": 1670273553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could it be feasible to reopen growth plates?",
        "author": "NatureisaCute",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zczmoc/could_it_be_feasible_to_reopen_growth_plates/",
        "text": "",
        "created_utc": 1670223164,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we started pumping water from the ocean into Death Valley (below sea level) could we turn off the pumps and let the siphon effect do the rest?",
        "author": "1pointtwentyone",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcybo7/if_we_started_pumping_water_from_the_ocean_into/",
        "text": "Like stealing gas from a car",
        "created_utc": 1670219046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vaneless Ion Wind Generator in EVs",
        "author": "Academic_Leg_2938",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcy9ja/vaneless_ion_wind_generator_in_evs/",
        "text": "I think we all agree that conventional wind generators on EVs wouldn’t work as the additional drag and power required to propel an EV with one would be higher than the power produced by the wind generator. \n\nHowever, with solid state / vaneless ion wind generators, it seems like it may be a possibility to recapture energy from the existing aerodynamic drag on vehicles (such as incorporating it on an EV where a grill would traditionally be, where there is high relative wind speed to force charged particles against an electric field. \n\nIt’s not a perpetual motion machine, as the energy generated would never offset the energy required to drive the car, it seems akin to an active motion regen device that converts the aerodynamic drag on a vehicle to electric energy rather than wasting it. \n\nI must be missing something big here, because it seems relatively straightforward that it would work. The only thing I could see against it would be the cost of developing something like this and what the energy generation capability would be and if it were worthwhile.",
        "created_utc": 1670218857,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I major in if I want to be directly involved in the manufacture of health products?",
        "author": "cleanpuppies",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcnyg5/what_should_i_major_in_if_i_want_to_be_directly/",
        "text": "hello all. Im trying to decide a major for what i want to do, which is make products for health. i want to manufacture them and create a business that way. products such as skincare products, maybe hair items, and definitely health supplements/vitamins. (for example, retinol lotions, hair spray, and or collagen gummies) just maintenance things as apart of a daily regime. ive considered biochem, chemical engineering, and i just want to know what exact major would be best for this avenue i would like to take. Thanks in advance!",
        "created_utc": 1670192886,
        "upvote_ratio": 1.0
    },
    {
        "title": "hat experiments would yield the most useful results if you could circumvent all ethical guidelines?",
        "author": "tyeishing",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcj6t9/hat_experiments_would_yield_the_most_useful/",
        "text": "",
        "created_utc": 1670182556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whose maps are superior; commercialised software like Google Maps or Chinese/USA military intelligence maps?",
        "author": "grvsm",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcivhg/whose_maps_are_superior_commercialised_software/",
        "text": "Hey everyone i have a question. I've been discussing this with a friend.\n\nMy opinion was that commercialised maps are actually even better than what militarys have but then something came to mind;\n\nMilitarys can use Google maps an probably have additional specialized tools that go far beyond what Google maps even needs to offer. They probably have way better water coverage and things i can't even think about would be needed.\n\nBut i honestly have no idea. I found this [quora](https://www.quora.com/Do-spy-military-satellites-provide-far-better-imagery-location-coordinates-than-the-Google-Earth-other-pvt-companies-imagery-tools-softwares) question but that's about it..\n\nMaybe someone has some sources that talk about this topic, or interesting opinions or insights. Maybe there is even a better subreddit to ask this question so if you have an input i'd be happy to hear!\n\nLook forward to you replies!",
        "created_utc": 1670181861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do My Religious Beliefs Contradict Physics?",
        "author": "AbiLovesTheology",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcen6l/do_my_religious_beliefs_contradict_physics/",
        "text": "Hi everyone.\n\nI have a VERY anti religious atheist online friend. They have a PhD in computational biology and claims that religion and science are incompatible. I really like my friend and we have good conversations but they confuse me sometimes. Obviously I respect her opinion, but she is making me doubt philosophically and theologically.\n\nEven though they are a biologist, we have been having conversations recently about physics. The reason they claim religion and science are incompatible is because physics says everything on Earth is made of matter or energy. They claim that this leaves no room for spiritual concepts like God, spirits or souls.\n\nI am Hindu. I believe in one God with many aspects. I believe in reincarnation and humans and all of nature having a spirit inside. Does this really contradict with physics? Is there any way to reconcile the two fields?\n\nI would love to hear from non scientist theists who like science and philosophy. I would also love to hear from theist and atheist scientists, especially physicists. Philosophers and theologians can join in too!",
        "created_utc": 1670172541,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some interesting new developments in the field of code synthesis using machine learning?",
        "author": "SpecialistPast9344",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcef2o/what_are_some_interesting_new_developments_in_the/",
        "text": "",
        "created_utc": 1670172025,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if climate change had an impact in our genetics and health?",
        "author": "Goodgxl",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcea8f/what_if_climate_change_had_an_impact_in_our/",
        "text": "Are the weather and our health correlated?  \nWould it have an impact on us in the short/long term?",
        "created_utc": 1670171706,
        "upvote_ratio": 1.0
    },
    {
        "title": "What sort or climate impacts could the US expect if the pivot to renewables was focused on hydrogen instead of electric vehicles?",
        "author": "blue_twidget",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zcdrgg/what_sort_or_climate_impacts_could_the_us_expect/",
        "text": "The region west of the Mississippi, and the area between the cascades and the rocky mountains especially, is a desert because the mountain ranges block moisture laden air from the gulf of Mexico and the pacific. Considering burning hydrogen results in water vapor as the exhaust, could making hydrogen fuel cells a priority in the growing population centers here result in an appreciable increase in rain fall in these regions?",
        "created_utc": 1670170511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Direction of planet rotation",
        "author": "Jeff-Root",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zca2ws/direction_of_planet_rotation/",
        "text": "Is there a widely-accepted explanation of why most of the planets in the Solar System rotate in the same direction as they orbit the Sun?  I came up with an explanation myself, but if I could come up with it, a thousand other people must have come up with it a hundred years before me.  But I've never heard or seen it anywhere.\n \n   -- Jeff, in Minneapolis",
        "created_utc": 1670161352,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we found another planet similar to earth, could we eat their food?",
        "author": "Thinks_Like_A_Man",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zby8nv/if_we_found_another_planet_similar_to_earth_could/",
        "text": "Assuming it was an oxygen rich environment and some sort of civilization that had agriculture, would our bodies tolerate the bacteria from their food?",
        "created_utc": 1670121676,
        "upvote_ratio": 1.0
    },
    {
        "title": "We know that the poles are warming up, but which region is warming up faster, the Arctic or Antarctic?",
        "author": "wiz28ultra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbt9qf/we_know_that_the_poles_are_warming_up_but_which/",
        "text": "",
        "created_utc": 1670107915,
        "upvote_ratio": 1.0
    },
    {
        "title": "ELI5: What is ChatGPT?",
        "author": "CircleBox2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbrlvw/eli5_what_is_chatgpt/",
        "text": "",
        "created_utc": 1670103810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feasibility of this sci-fi idea?",
        "author": "Pyropeace",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbrhii/feasibility_of_this_scifi_idea/",
        "text": "Basically, it's a genetically-engineered microbe (or set of microbes) with a massive genome, much of which can function independently as viruses. The microbe is designed to \"download\" genetically-recorded information into the minds of the infected, conveying a large amount of knowledge and potentially altering their behavior. The process isn't perfect--it can lead to symptoms similar to dementia and rabies--but it's incredibly useful for planetary colonization, able to neutralize much of the planet's population and turn the rest into loyal helpers while retaining much of their personality and knowledge. If the potential for rabies symptoms can be reduced, it may be able to be used as an effective tool for peaceful interstellar communication, and to \"download\" skills into individual brains.\n\nI realize that it's fiction and I can do whatever I want, but I want the idea to be grounded in fact as much as possible.",
        "created_utc": 1670103509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding the possibility of treatment within the business scope of avian influenza.",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbo2wt/regarding_the_possibility_of_treatment_within_the/",
        "text": " In Japan, although the amount fluctuates, many chicken lives are returned to the heavens every year, probably to control the influenza epidemic in vain despite the savior's warning.    \n\n Also, this season alone, [3,400,000 birds](https://www.reuters.com/business/healthcare-pharmaceuticals/japan-reports-first-bird-flu-outbreaks-season-culling-340000-chickens-2022-10-28/) were forced to go to heaven.    \n\n At the same time, Japan has taken the direction of not implementing preventive measures with vaccines, saying that they cannot be expected to be effective.    \n\n I can't help but feel a strong grief for this life.    \n\n So I would like to ask, is it impossible to treat influenza-infected chickens in light of the costs within the business?    \n　　    \n\n By the way, regarding the size and price of Japan's economy, the starting salary for university graduates is slightly less than [200,000 yen](https://www.mhlw.go.jp/toukei/itiran/roudou/chingin/kouzou/12/01.html), 20 eggs is about 265 yen, and chicken is about 1 yen/g profit/cost.",
        "created_utc": 1670095073,
        "upvote_ratio": 1.0
    }
]