[
    {
        "title": "Using LDPE scraps for packaging",
        "author": "Pixel_xo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zry3yh/using_ldpe_scraps_for_packaging/",
        "text": "I’m trying to work out a mix of chemicals or additives to be used with LDPE scraps to stop it from yellowing under re-extrusion(Mfg: Film, Bags, etc)\nCould someone help me out with the Chemcials or additives to be used.\n\nI’m trying to mix between 30 to 50% LDPE Scraps with Fresh LDPE.",
        "created_utc": 1671650542,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the questions/mysteries scientist thought they solved or understood only to recently found out that they were in reality totally wrong about it and had no idea about the truth",
        "author": "Level-Equipment-3544",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zrmgr0/what_are_the_questionsmysteries_scientist_thought/",
        "text": "",
        "created_utc": 1671630014,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to prepare for PhD in biological at any top University as a average student who is from a local college with no research or related experience",
        "author": "Level-Equipment-3544",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zrmb9l/how_to_prepare_for_phd_in_biological_at_any_top/",
        "text": "I am currently doing masters in microbiology from a local university from India and I have zero experience about anything related to research but recently I have started to get intrest in doing PhD however I have no idea on how to get into top institution within 2 years .\n\n* I am not sure about the exact branch I want to get into but I am quite fascinated by viruses",
        "created_utc": 1671629781,
        "upvote_ratio": 1.0
    },
    {
        "title": "With large percentage of people around world able to communicate instantly, will the future language eventually evolve into one common global language?",
        "author": "tomytronics",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zrch87/with_large_percentage_of_people_around_world_able/",
        "text": "Spoken language started around 1.5 million years ago and written language goes back about 5,000 years. Many languages formed over time as people split apart, traveled, and contact became nonexistent because the only mean of communication were meeting people thus traveling by foot or later by animal like horses. That often meant months to meet people.\n\nEven English between British and American started to differ in the 300+ years since many left for America.\n\nOver 7,000 languages exists, many of them rarely heard of in general public like various Native Americans (Souix, Navajo, etc). Many more languages existed in the past that now only exists in historical record.\n\nRapid advancement in communication over the last 100+ years meant letters can arrive in days instead of months, people traveling can arrive in days instead of months, even hard to reach remote area aren't often hard anymore, verbal communication between 2 can be done in real time no matter the distance, and now we have internet.\n\nIs it possible in the next few centuries, many lesser languages would become rare or extinct, and we'd start having a common Earth language that can be spoken by several billion people?",
        "created_utc": 1671603959,
        "upvote_ratio": 1.0
    },
    {
        "title": "escape velocity theory question",
        "author": "awesomegame1254",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zraru1/escape_velocity_theory_question/",
        "text": "from what i understand according to the math governing it escape velocity decreases as altitude increases which should technically mean that you could in theory \"achieve\" escape velocity just by travelling far enough away from a given object at a set speed.",
        "created_utc": 1671598537,
        "upvote_ratio": 1.0
    },
    {
        "title": "some smells make you gag, is it bad ignoring the reflex of gagging and keeping being close to the source of the smell or not? (like decomposed food or stuff, or oil or other common day sources where you might gag)",
        "author": "randomusername11222",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zra3ul/some_smells_make_you_gag_is_it_bad_ignoring_the/",
        "text": "",
        "created_utc": 1671596488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me with the logistics of space/location when it comes to theoretical time travel.",
        "author": "3WordPosts",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zr4s91/help_me_with_the_logistics_of_spacelocation_when/",
        "text": "Let’s say the goal is to go back in time to some arbitrary event 200 years ago to witness/stop something significant. \n\nI’ve been thinking about relativity. We know where the event took place, but when it comes to “time travel” would we have any clue on -where- to go?\n\nThe earth is moving around the sun obviously. The sun is moving in the galaxy. Our galaxy is moving relative to other galaxies. So my first question, is there an ultimate frame of reference we can use to determine an absolute set of points to determine a location?\n\nIn my mind it would be impossible to show up in Philadelphia, PA on a certain date/time. Imagine being off by 20 minutes and you’re a few miles away and also you appear inside the earths mantle, up in space, etc just because the calculations were off a bit. \n\nSo we know space is mostly empty. If time travel was ever to be possible my solution would be having time travel “safe zones”. These would be known areas of -nothing-  so if you wanted to watch the Declaration of Independence being signed you would program a local “safe zone” to appear in (maybe like 2 years early to account for travel or something along those lines?) and then you would take off to your target. \n\nSorry this was a ramble, but does anyone have any discussions on this?\n\nTL;DR:  space is too hard to figure out WHERE you are, so if you time travel you just kinda pop in close by and travel to your destination instead of actually appearing in hitlers delivery room.",
        "created_utc": 1671582496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scars",
        "author": "soldier_of_hope",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqwich/scars/",
        "text": "Why aren’t we able to remove scars completely, and how close are we to being able to?",
        "created_utc": 1671562790,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the best sorting algorithm for a long list that's already almost sorted and only has a couple elements out of line?",
        "author": "thetimujin",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqu5rv/what_would_be_the_best_sorting_algorithm_for_a/",
        "text": "",
        "created_utc": 1671557144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any non-polar substances that are transparent?",
        "author": "Deranged_Potato_57",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqspw3/are_there_any_nonpolar_substances_that_are/",
        "text": "",
        "created_utc": 1671553626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any non-polar molecules that are transparent?",
        "author": "Deranged_Potato_57",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqsnw0/are_there_any_nonpolar_molecules_that_are/",
        "text": "",
        "created_utc": 1671553490,
        "upvote_ratio": 1.0
    },
    {
        "title": "In what useful ways would diamonds benefit society if they were abundant and cheap?",
        "author": "Danysco",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqs8u8/in_what_useful_ways_would_diamonds_benefit/",
        "text": "",
        "created_utc": 1671552452,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the temperatures of Earth around these stars?",
        "author": "AlexandertheIght",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqrdwu/what_would_be_the_temperatures_of_earth_around/",
        "text": "If we orbited in the habitable zone if tau ceti and proxima centauri b what would Earth be like temperature life would climate stay the same or make a ice age like world?",
        "created_utc": 1671550306,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some big and common misconceptions and myths about quantum physics?",
        "author": "AraneoKyojin",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqqxnx/what_are_some_big_and_common_misconceptions_and/",
        "text": "",
        "created_utc": 1671549167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very very long term planning, how to gather as much mass as possible before cosmic expansion puts it out of reach?",
        "author": "MWBartko",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqolyv/very_very_long_term_planning_how_to_gather_as/",
        "text": "So we know that cosmic expansion has already pushed parts of our current observable universe outside our potential light cone, if we want to stay in range of as much matter as possible how would we do this? \n\nAdditional thoughts and questions. \n\nI am uncertain if the great attractor that seems to be affecting the Virgo Supercluster / Laniakea Supercluster would keep this massive collection of matter within the same light cone in the face of cosmic expansion or not. \n\nIf it wouldn't could we used stellar engines like Shkadov thrusters to pilot our galaxy's stars and those of the other galaxies we merg with into faster mergers in order to have as much available mass as possible once cosmic inflammation has put everything else out of reach? \n\nIf the great attractor is already going to hold that much together is it hopeless that we would be able to reach and drag back anything more in time? \n\nOr is the idea of piloting stars / galaxies likely to prove beyond our reasonable capabilities for so long it will be a moot point by the time we get there?",
        "created_utc": 1671543099,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if we were terraforming and made weed the main crop?",
        "author": "dahlwatts",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqlkfe/what_if_we_were_terraforming_and_made_weed_the/",
        "text": "What would happen if we were terraforming a planet for hominization and once the conditions were right for plant lite (appropriate atmospheric, temperature, and microbial life conditions etc) and the colonists introduced Marijuana before any other type of plant? Aside from maybe algae. Would it become a very dominant species across the surface? | assume it’d make the colonists a lot of fucking money? \n\nhaven’t slept.",
        "created_utc": 1671534095,
        "upvote_ratio": 1.0
    },
    {
        "title": "If bio-signatures are found in an exo-planet's atmosphere, what further steps would be taken before we can completely confirm life exists on it?",
        "author": "VegasTamborini",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zqi9ty/if_biosignatures_are_found_in_an_exoplanets/",
        "text": "I'm exploring this for some creative writing I'm doing, so I'm interested in the hypothetical scenario: \"Complex life similar to that on Earth definitely exists on this planet, is detectable from Earth, and through observations with satellites we are able to confirm this. However due to the distance, it is not feasible to physically reach it within a normal human's lifespan\".\n\nMy understanding is that the initial step is basically what JWST is currently doing with likely candidates like the Trappist system now. Say it detects bio-signatures. Obviously that's not enough to know for sure, so, what happens next? What are the follow up observations that would be done? Assuming that, as subsequent observations further confirm the initial observation, assume it would be easier to fund larger and more sophisticated experiments to further investigate until we are as sure as we can be without physically visiting that planet.\n\nSo, what are those experiments? What does the timeline look like? At what point would we be certain?",
        "created_utc": 1671522490,
        "upvote_ratio": 1.0
    },
    {
        "title": "I came across a research paper on potential creation of artificial blood.",
        "author": "Wise_Meet_9933",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq9mmn/i_came_across_a_research_paper_on_potential/",
        "text": "I across a research paper on potential creation of artificial blood. Based in China.\n\nFirst of all what?\n\nSecond, isn’t that impossible?\n\nHow?",
        "created_utc": 1671498334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum Mechanics and the End of Science",
        "author": "cumsockaccount",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq60m8/quantum_mechanics_and_the_end_of_science/",
        "text": "I try every science subreddit and they keep deleting my posts and at this point I'm starting to think you guys are trying to cover something up. Even the recent nobel prize was done on this kinda stuff so why are science educators not just helping people understand what it means?\n\nAnyways I'm going to copy/paste what I wrote elsewhere and you can delete it if you want but I will just keep reposting it to different subreddits until someone finally gives me an answer. \n\nSomeone once told me QM is the end of science. The arguments they gave when I googled them seemed to corroborate what they said. I'm just looking for someone to address these points, not necessarily rebut them because I am not a scientist so for all I know some are true. I just want someone to address them.\n\n(1) QM says there are no \"hidden variables\" (Bell's Theorem) so there cannot be any more fundamental causes to be discovered. We used to think the smallest particles were atomic particles but later subatomic particles were discovered. A similar thing can never happen to QM, it is as far as science can take us and this is the \"end of road\" so to speak as there are no more hidden variables that will ever be unhidden and discovered.\n\n(2) QM says that our concept of space is an illusion (spooky action at a distance) and that objects can affect each other from any part of the universe simultaneously faster than the speed of light.\n\n(3) QM says that objective reality itself is an illusion. The belief that there is even an objective reality independent of the observer has been proven false.\n\n(4) QM says that reductionism is false. If a person measures a quantum superposition, what their measuring device will say, and by extension, what they will think about, cannot be derived from the fundamentals of physics. It's not possible, even with perfect knowledge and infinite computational power, to predict what big things like the measuring device will do from the small things like the fundamental particles. So the universe is actually irreducibly complex. I don't really have a paper for this one but is there a way to reconcile the Measurement Problem with reductionism? \n\nThe point wasn't that science can't progress in other areas like biology, but there's no way for the fundamental theory of QM to progress. They told me my belief that we haven't reached the \"end of science\" was unfounded and just me being emotional and not wanting to accept it. Everything from here on out will just be remixes of QM into different forms, but none of these remixes will ever lead to something even deeper than QM.",
        "created_utc": 1671489703,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you want to clean a surface as thoroughly as possible (interpret this however extremely you wish), regardless of any side effects at all, what could you use? How much of a bad idea would it be?",
        "author": "PassiveChemistry",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq5vbh/if_you_want_to_clean_a_surface_as_thoroughly_as/",
        "text": "",
        "created_utc": 1671489352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could flowing or resting water as a ground increase the efficiency of an atmospheric electricity system?",
        "author": "Langston432",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq45lk/could_flowing_or_resting_water_as_a_ground/",
        "text": " I was searching up recently on atmospheric electricity and any efforts to make use of it when the recurring problem seemed to be that the potential voltage is great but the low amperage of such a system would make it unfeasible. If you had an electrical connection to some point in the atmosphere couldn't you make it feasible by using an aquifer or a river as a ground? What about a grounding point deep in the ground?",
        "created_utc": 1671485399,
        "upvote_ratio": 1.0
    },
    {
        "title": "How large would an artificial black hole’s event horizon have to be (in radius) to absorb helium atoms, at minimum? Would a black hole with the same radius as a helium atom suffice?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq449t/how_large_would_an_artificial_black_holes_event/",
        "text": "",
        "created_utc": 1671485312,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's been two years since the Australia wildfires wiped out an estimated 3 billion animals. What has the recovery been like?",
        "author": "ggrieves",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq40qx/its_been_two_years_since_the_australia_wildfires/",
        "text": "\nHas that estimate been revised since it was first widely reported?\n\nAre the populations able to recover?  \n\nWere there any total extinctions?",
        "created_utc": 1671485083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where is the ocean with a good beach and coniferous forests enriched with Phytoncides? and with a warm climate and water of course. Is it true that phytoncides have a good effect on immunity? And how does he do it?",
        "author": "UltronAge",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq30aw/where_is_the_ocean_with_a_good_beach_and/",
        "text": "",
        "created_utc": 1671482712,
        "upvote_ratio": 1.0
    },
    {
        "title": "is sound are air?",
        "author": "Hallowmew",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq2ym1/is_sound_are_air/",
        "text": "",
        "created_utc": 1671482603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats the equation for planet surface temperature?",
        "author": "AlexandertheIght",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq2p1l/whats_the_equation_for_planet_surface_temperature/",
        "text": "Whats the proper equation to detect the temperature of a fictional planet? The equation would have to work for a different type of star and would preferably match with Obliquity, Atmosphere, distance.\n\nI'm starting to get back into planet building and stuck on this bit.",
        "created_utc": 1671481971,
        "upvote_ratio": 1.0
    },
    {
        "title": "A number of rich western countries resist immigration, but don't have enough births to maintain a stable population. How close is the technology to begin cloning or otherwise producing babies without the participation of mothers to meet the shortfall and prevent local population collapse?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zq00jw/a_number_of_rich_western_countries_resist/",
        "text": "",
        "created_utc": 1671475847,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a theory of the distant future",
        "author": "Pog-Champion-",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zpyofi/i_have_a_theory_of_the_distant_future/",
        "text": "Perhaps in the distant future where humans dont need to rely on Earth to survive, maybe we could help other species on Earth advance like us and develop into advaced civilizations.",
        "created_utc": 1671472922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we send rovers to the night side of venus?",
        "author": "OpenPlex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp7rzf/can_we_send_rovers_to_the_night_side_of_venus/",
        "text": "First a probe to see how much cooler the surface is at night. \n\nStart in the middle of the night side and travel away from the approaching daylight side which be over 100 days away. \n\nInclude a copter or drone to travel ahead, and capture a wider view. And it can airlift the rover through rough terrain.",
        "created_utc": 1671395934,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your picks for four places in the solar system to visit and research?",
        "author": "WrongEinstein",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp6jnh/what_are_your_picks_for_four_places_in_the_solar/",
        "text": "Just wondering where scientists consider the most interesting places for likely research.",
        "created_utc": 1671392724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can there be more space in the box than this outside? Like in the Harry Potter movie when the tent is bigger inside than outside. Hermeon's bag and Doctor Who's Tardis. Is it theoretically possible? Based on the theory of relativity that space can be curved and so on.",
        "author": "UltronAge",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp63kc/can_there_be_more_space_in_the_box_than_this/",
        "text": "Can there be more space in the box than this outside?  Like in the Harry Potter movie when the tent is bigger inside than outside.  Hermeon's bag and Doctor Who's Tardis.  Is it theoretically possible?  Based on the theory of relativity that space can be curved and so on.",
        "created_utc": 1671391521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here’s my idea for a fusion reactor",
        "author": "TechnoMan69420",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp5hgy/heres_my_idea_for_a_fusion_reactor/",
        "text": "It’s very simple as we start in a steel sphere layered in the inside of the sphere the walls are covered in powerful electromagnets each with its own independent hydrogen fuel cell for power than there are holes in the walls aswell these holes are lasers solar panels for each laser and at the center of it all is a frozen deuterium, tritium sphere for fuel held in place by the magnets the lasers fire and than BOOM the fuel combusts and turns into a plasma with deuterium and tritium atoms bouncing around in a controlled practically mini sun for fusion energy",
        "created_utc": 1671389910,
        "upvote_ratio": 1.0
    },
    {
        "title": "If ≥3 Body systems are inherently chaotic how are stable orbits possible at all?",
        "author": "WhiteTwink",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp3exu/if_3_body_systems_are_inherently_chaotic_how_are/",
        "text": "Let's look just at our Earth Moon system. The moon orbits the earth because of the gravitational attraction to the earth. But zoom out and its not just the earth pulling on the moon but the sun pulling on both. Then you have the other planets: Mercury, Venus, Mars, Jupiter, Saturn, Uranus, and Neptune pulling on both bodies. Looking with even finer detail you have every asteroid, comet, and piece of space junk also pulling on both bodies. If you zoom out to the farthest view EVERY SINGLE object in the night sky, whose light has reached us because gravity propagates at the speed of light, is also giving minute tugs on the Earth-Moon system.\n\nWith all these myriad of gravitational attractions it makes just looking at the Earth-Moon System quickly turn into a near infinite body problem. Given that just three bodies are extremely unstable, how are any orbits stable when there's a near infinite amount of gravitational influences being applied to every single body?",
        "created_utc": 1671383949,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the sun stopped emitting light and heat for one hour, would more than 500 million people die as a result?",
        "author": "RaipFace",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp1j84/if_the_sun_stopped_emitting_light_and_heat_for/",
        "text": "",
        "created_utc": 1671378656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any electric airplanes (concept or not) that use electrically driven oxygen concentrator and/or ozone generators (that can decompose explosively) to drive turbines? Or it wouldn't be efficient at all?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zp0mxw/are_there_any_electric_airplanes_concept_or_not/",
        "text": "I know that if there was such a thing already, we would already have seen news about them, but it doesn't hurt to ask, *I guess?*\n\nSo, ozone generators are really cheap and compact, oxygen concentrators not so much, air-metal batteries are cheap and compact and work by oxidation.\n\nTo me, it seems an interesting duo that could work together. Sucking the air from the atmosphere, extracting the oxygen from the air, the oxygen (or ozone) activates the battery reaction, the rest (or the most part) of oxygen (or ozone) can be compressed and ignited to drive a combustion turbine engine and fly the damn thing.\n\nAnd so, it makes me wonder: are there any electric air planes/air jets concepts that work like this? Or all this process wouldn't be as efficient as simply converting the electricity into electromagnetic fields?",
        "created_utc": 1671376019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where is the best place to start learning Physics?",
        "author": "Neckerei",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zoydie/where_is_the_best_place_to_start_learning_physics/",
        "text": "I am a M24, and I always did well in school but ended up home schooled in high school due to my health. Because of this, I fell behind drastically in math courses. I've since taken several math classes in my college days for my business degree. I always get super lost and overwhelmed by them. I've always been fascinated with astrophysics, space, planets, how the world works, etc. However, I've had this paralyzing fear since I struggle with math that I'm doomed from a career and education in science. Am I too old to go back to the beginning and learn what I need to learn to pursue this path? If not, where should I even begin?",
        "created_utc": 1671369286,
        "upvote_ratio": 1.0
    },
    {
        "title": "social science: where is the push for \"we are a family\" and buddy system coming from in the military?",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zoryk3/social_science_where_is_the_push_for_we_are_a/",
        "text": "Also, these days there is a lot of evidence that those mindsets are toxic and harmful. Why do they still persist?",
        "created_utc": 1671344805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assuming there exists intelligent life elsewhere, how likely is it that that have developed a periodic table that looks similar to ours?",
        "author": "Moxhi",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zoqceu/assuming_there_exists_intelligent_life_elsewhere/",
        "text": "",
        "created_utc": 1671339157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Without advanced technology, is it easier to circumnavigate the globe by hopping across the equator? How did Polynesians successfully do it?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zolue0/without_advanced_technology_is_it_easier_to/",
        "text": "I would like to open up this discussion about the difficulties of traveling the world by boat, without modern maps or equipment...\n\nI'm hypothesizing that North and South of the equator, there are two major ocean currents that run in the opposite direction of each other. This would allow for ancient Polynesians to send sailors in one direction who would be able to send others back to get their families. But I'm not sure how it was done, and whether the existing historical evidence is complete about these guys. So I'm wondering, how was it done?",
        "created_utc": 1671325281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there more space inside a gravity well than in a similar empty space?",
        "author": "Psyese",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zog1ab/is_there_more_space_inside_a_gravity_well_than_in/",
        "text": "",
        "created_utc": 1671310665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Venus?",
        "author": "EdKow73",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zofxrt/venus/",
        "text": "As everyone knows, lately there is a lot of discussion and plan formation concerning traveling to Mars and possibly trying to \"settle\" the planet.  This frightens me as I continue to learn more about whether we actually found microbial life there already.  This dates back to samples taken and analyzed by a past lander, with several respected scientists claiming there is evidence of it.  If an \"alien\" bacteria makes it back to Earth.....\nThat said, what about Venus?  Yes, the 850 degree surface temperature, acid in the clouds, Venus?  I would assume, but could be wrong, that life could not be there already.  Is it possible to change or remove the dangerous stuff in the atmosphere and release Venus from essentially Hell, potentially making it a possible habital planet?  I imagine the process, if possible, would take a LONG time, but just wondering....",
        "created_utc": 1671310405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could quantum entanglement potentially be used for long distant communication?",
        "author": "movieguy95453",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zofh0e/could_quantum_entanglement_potentially_be_used/",
        "text": "Of all the things in nature that boggle my mind, quantum entanglement is at the top of the list. I feel like I have a decent basic understanding of what it is, but I have a hard time wrapping my head around the idea that the state of one particle can describe the state of a second particle over long distances.\n\nThe idea makes sense at the sub-atomic level for particles in close proximity. But the idea of it working over very long distances (including across the universe) sounds more hypothetical than real.\n\nThat being said, it got me wondering if quantum entanglement has any potential for communication over vast distances. For example, could it possibly allow (near) real-time communication over many light years? Could it possibly reveal information from the universe beyond the observable horizon?",
        "created_utc": 1671309187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could freezing sperm and eggs contribute to combatting the risk of human extinction due to infertility?",
        "author": "kenkeseyblake",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zo690n/could_freezing_sperm_and_eggs_contribute_to/",
        "text": "I recently watched the sci-fyi movie, Children of Men where infertility almost causes human extinction. Then I came to find out that some scientists are actually worried that this could happen in the near future. I am not sure how legitimate their fears are - but isn't true that sperm and eggs can be frozen indefinitely?? I know it's not certainly not the best way to fix the issue, but if hundreds of millions of men and women just froze their sperm and eggs then we wouldn't have to worry about extinction in the near future...at least not from infertility. Right? Someone who knows about Biology please tell if this a viable short term solution. Thank you:))\n\n*Yes I acknowledge that governments or private companies controlling all the sperm and eggs could pose significant risks to our civil rights, but I believe you can store sperm at home under the proper conditions so maybe one way around that issue.",
        "created_utc": 1671283544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can humans artificially add specific missing atoms and particles to the planets to create inhabitable life environment?",
        "author": "icantbetonight",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zo4hbo/can_humans_artificially_add_specific_missing/",
        "text": "",
        "created_utc": 1671276849,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would a planet with a diffent poles location look like",
        "author": "duckling-peanut",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zo2n1j/how_would_a_planet_with_a_diffent_poles_location/",
        "text": "Just sheer curiosity: what if the North pole would be somewhere in the Atlantic, maybe in the Azores, and the South pole somewhere in the Pacific (or whereever it's antipode is), what would the geographical effects be? How would the climate would be? How would the sealevels be? \n\nIs there any map/planet generator that I could give this a try?\n\nThanks!",
        "created_utc": 1671269203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applied Mathamatics vs Physics",
        "author": "Automatic-Oil8170",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zo06gf/applied_mathamatics_vs_physics/",
        "text": "What are the main differences between applied mathematics and physics. And if i get a PhD in applied mathematics can I still be a physicist? Or at least in the basic sense understand basic concepts concerning physics. Thanks!",
        "created_utc": 1671259111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would the population of nematodes outnumber that of all other animals combined?",
        "author": "sad_femboi",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znwn2p/would_the_population_of_nematodes_outnumber_that/",
        "text": "",
        "created_utc": 1671246441,
        "upvote_ratio": 1.0
    },
    {
        "title": "In QED by Richard Feynman, how long do you make the little arrows?",
        "author": "IgnoranceFlaunted",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znvhm8/in_qed_by_richard_feynman_how_long_do_you_make/",
        "text": "I’m (attempting) reading QED: The Strange Theory of Light and Matter by Richard Feynman. In it, he describes a method by which you can find the odds of a photon reflecting by adding together little arrows. I think I understand that the square of each little arrow is the probability of a photon taking that path. Initially, all the arrows are .2 in length, but then he pulls out some .3s and others. I think I missed something. You can use the arrows to solve for the odds of an event, but I don’t grasp where the length of the arrows is coming from (it can’t be the odds, because that’s circular).  \n\nMy question: How do you decide the length of each little arrow?",
        "created_utc": 1671242686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I improve my knowledge/ stay up to date with science news in a way that stretches me but doesn't go over my head?",
        "author": "Ok-Biscotti-8618",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znveok/where_can_i_improve_my_knowledge_stay_up_to_date/",
        "text": "I studied science at school and took extra modules in science as it was fascinating to me. I have since read popular science books and Stephen Hawking's books and follow every science reddit, watch all the YouTube videos like pbs and scishow and listen to some podcasts but I want to know more and cant really get enough.\n\nMy physics teacher at school was amazing at engaging our curiosity in science and often went off curriculum to spark enthusiasm. I vivdly remember learning about the basic concept of quantum mechanics and superposition and schrodingers cat for the first time and it absolutely blowing my mind. \n\nWhere is the best place to dive further into science, particularly physics that doesn't require university level understanding of the topics but also isn't high school/ secondary school level either where it tells you there are only three states of matter etc.? I don't have much intrest for pursuing science professionally (unless a space agency is reading this and what a non formally educated test dummy astronaut lol) but want to learn more to satisfy my curiostity/ for the sake of learning. \n\nI have been recommended a ton of books from the book suggestions reddit but also curious for other formats of media I can learn from.",
        "created_utc": 1671242426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made the image to illustrate the paradox. Pretty sure I'm getting something wrong, but what?",
        "author": "I_spell_it_Griffin",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znq26a/made_the_image_to_illustrate_the_paradox_pretty/",
        "text": "[Relativity Baseball](https://imgur.com/a/0Iolj4v)\n\nIf\n\n**&lt;the catcher arriving at the mark&gt;**\n\nand\n\n**&lt;the catcher catching the ball&gt;**\n\nare the supposed to be **same event**, how could that possibly even work in the catcher's frame?",
        "created_utc": 1671227302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a congenital mutation like hEDS (Ehlers Danlos Syndrome - Hypermobility, f/k/a EDS type III) be a boon or a burden gor an astronauts?",
        "author": "SlightlyControversal",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znq22v/would_a_congenital_mutation_like_heds_ehlers/",
        "text": "Hypothetically, of course.",
        "created_utc": 1671227296,
        "upvote_ratio": 1.0
    },
    {
        "title": "If an object vibrating at a certain frequency comes in contact with another object vibrating at same frequency but out of phase, do they stop vibrating all together or something entirely different happens?",
        "author": "LiveEatSleep123",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znm136/if_an_object_vibrating_at_a_certain_frequency/",
        "text": "",
        "created_utc": 1671216744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memory of a certain painting constantly altering in my mind - what could this be?",
        "author": "notasoultotell_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znlhrs/memory_of_a_certain_painting_constantly_altering/",
        "text": "There is this certain painting in my therapist's office that seriously surprises me every time I look at it. The picture I have of it in my mind is always \\*very\\* different from the painting I see on the wall. This never happened to me before and is so odd to me. The painting depicts a man sitting on a chair in a room - I never forget this is the basic setting, and the colors are mainly yellow and blue - but the last time I looked at it I was surprised to find it looked completely different than what I remembered. The man's body took a much larger portion of the painting, there were several libraries behind him, but the main thing is that the whole \"vibe\" and atmosphere of the painting was absolutely different. Like a totally different painting. And it happened over several times already, so one can't say there is a first \"glimpsed\" memory, and that I got it right the next time. I LOOKED at the painting every time I saw it. And it was like a different painting every time. So what could explain this?",
        "created_utc": 1671215324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any distant planets or solar systems who are really close to each other?",
        "author": "Devilish2476",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znj1i1/are_there_any_distant_planets_or_solar_systems/",
        "text": "I suppose what I’m getting at is, are there possible habitable planets in different solar systems that happen to be extremely close to one another and travel between the 2 wouldn’t take generations of time?",
        "created_utc": 1671208976,
        "upvote_ratio": 1.0
    },
    {
        "title": "What classes of stars can become carbon stars? Could the sun become one?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/znifwo/what_classes_of_stars_can_become_carbon_stars/",
        "text": "",
        "created_utc": 1671207450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is eugenics considered a fringe science and how does it differ from selective breeding on other animals and plants?",
        "author": "Proactiveselfdefence",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zncs54/why_is_eugenics_considered_a_fringe_science_and/",
        "text": "I understand the moral complications and dark history of eugenics but not why it's considered separate and unsupported by modern science.",
        "created_utc": 1671191211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Polydiketoenamine infinitely recyclable polymer",
        "author": "qdf3433",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zna95e/polydiketoenamine_infinitely_recyclable_polymer/",
        "text": "H folks.  I recently learned about this polymer.  But I haven't been able to find any videos that show products or even samples made from the polymer.  Has anyone seen such a thing?  Thanks",
        "created_utc": 1671181055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Special relativity tells us that time passes slower for a person traveling close to speed of light than the person standing still, but how do we know which person is traveling and which is standing still?",
        "author": "Psyese",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zn6atx/special_relativity_tells_us_that_time_passes/",
        "text": "",
        "created_utc": 1671165969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Desalination and Power - 2 in 1?",
        "author": "Gdandrews54",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zn2xbs/desalination_and_power_2_in_1/",
        "text": "All the talk regarding water becoming a limited resource in the next century always brings up the idea of desalination to make potable water. The issue we know is the amount of power required during the process makes it somewhat infeasible. An idea that popped into my head was why don’t we use sea water in power generation (steam turbines)? We would get the potable water from the steam and generate power at the same time. A couple points I could think off the top of my head:\n\n-Salt water has a lower boiling point. Does that limit the energy of the steam or increase the efficiency of the process?\n\n-The amount of potable water may be negligible?\n\n-The amount of energy required to get the steam to condensate still makes it too energy intensive. \n\n\nIs this feasible? Has it ever been proposed or is it just a bad idea? Interested to hear how others might poke holes in this idea.",
        "created_utc": 1671155404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has the wearing of masks led to a measurable increase in severity or frequency of non-covid illness?",
        "author": "atomicskier76",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zn0c0e/has_the_wearing_of_masks_led_to_a_measurable/",
        "text": "Much of the US is experiencing a particularly nasty wave of RSV, Strep and Influenza. I keep hearing people saying effectively that because we wore masks and didn't/don't get low-dose exposure for 2 years we are now having more significant impacts. I've heard this from both nut jobs and less nutty people who all state to some degree that because we wore masks we are now enduring a more significant wave of illness. is there a credible, scholarly, study or past medical evidence that would suggest that at the heart of it, our current experience is because of masks?",
        "created_utc": 1671148053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wormholes as a local explanation of quantum entanglement",
        "author": "stevie_steve87",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmu8p4/wormholes_as_a_local_explanation_of_quantum/",
        "text": "[removed]",
        "created_utc": 1671133808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Some Vaccines Last A Lifetime and Others Don't ?",
        "author": "Level-Equipment-3544",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmrngl/why_some_vaccines_last_a_lifetime_and_others_dont/",
        "text": "And even among the ones requiring boosters why does every vaccine have different time gap. Like for some vaccine you must take another shot in 10 years and for other it might be just 2 years? What effect those things",
        "created_utc": 1671127413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has Pauli exclusion replaced the model of electrostatic repulsion in electrons? (If not, what's their difference?)",
        "author": "OpenPlex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmr57w/has_pauli_exclusion_replaced_the_model_of/",
        "text": "Did we ever have a model that used electrostatic repulsion to explain why objects don't fall through the floor? That's how I was taught, either incorrectly, or maybe correctly at the time but later we've updated the model. \n\nThe strange thing, in my view, is that electrostatic repulsion has a familiar mechanism that's associated with one of the major interactions: electromagnetic. \n\nBut the Pauli exclusion principle seems merely to be a math result. It doesn't appear to be described as a force / interaction. Seems more like a statement, in the way that 'energy is always conserved' is a statement. (and not a force) \n\nSomeone had once explained the Pauli exclusion principle as necessary because placing two electrons in the same place would make the wavefunction zero. Can someone confirm how accurate that is?",
        "created_utc": 1671126175,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the effect of fusion on automobiles?",
        "author": "Basicallysteve",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmnyzb/what_would_be_the_effect_of_fusion_on_automobiles/",
        "text": "I’m not sure which tag bests fits for this question, but here it goes.\n\nIf fusion were to actually be something that catches sometime within the next decade or five, and it happens to provided effectively unlimited clean energy for our use cases, (enough so to say reverse climate change concerns) what would be the best fuel to use for cars? Batteries don’t seem to be the best since their efficiency doesn’t appear to scale well when weight is a factor, so would it possibly make more sense to generate the hydrocarbons to be used in gas vehicles? Or maybe there’s another chemical option that would be safer and/or more efficient to use in the circumstance that we’d be able to generate our fuel source without caring about energy efficiency in the conversion.",
        "created_utc": 1671118461,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the JWST provides the most accurate data we have about certain phenomena bar none and is booked months or years in advance, how do papers published based on its findings get peer reviewed?",
        "author": "Mind101",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmk1ba/if_the_jwst_provides_the_most_accurate_data_we/",
        "text": "What I'm trying to ask is, how do you peer review a paper if you only have the authors' data to go on?\n\nTo my limited knowledge, nothing else at our disposal has the reach or resolution capabilities of some of the JWST's instruments. If there's currently no way to corroborate the data other than to conduct the same measurements independently, how does credibility get established?\n\nI watched one of Dr. Becky's videos where she mentioned how numerous teams already had several papers in the works and were only waiting for JWST confirmation of their hypotheses to publish. That was the so-called \"low-hanging fruit\".\n\nSome of those are probably general enough that supportive evidence grows as the telescope is doing its scheduled work. However, if a group of astronomers is trying to figure out something about a specific galaxy cluster, for example, how do you independently prove their findings if the JWST won't be looking at that particular cluster for months or years and no other means of confirmation is as accurate?",
        "created_utc": 1671107713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does chemistry have such a bad reputation?",
        "author": "Psychological_Rice36",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmgppo/why_does_chemistry_have_such_a_bad_reputation/",
        "text": "Especially with cosmetics, food, supplements and such things, the trend is towards natural ingredients. I once heard that this is totally unjustified. Is that true? What positive examples are there for good chemistry in cosmetics, food and such things?",
        "created_utc": 1671095369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tides on small watery moons",
        "author": "sapere_aude1784",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmghrr/tides_on_small_watery_moons/",
        "text": "For example: If earth had a second moon. Like Phobos, but with significantly more water.\nWould such a moon experience tides? \n\nI know it would be tidely loked to earth, but what about the tidel forces from the sun?\nAnd since its orbital period would be shorter than a day, could they be analogues to earth tides?",
        "created_utc": 1671094501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Biomass and biofuels",
        "author": "Admirable-Rock-6733",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zmdl46/biomass_and_biofuels/",
        "text": "Hi. I have school project regarding this topic, and i just wanted to ask if biomass and biofuels are both a different topic? Are they different? \n\nI have to create a diagram about it and i’m not sure if i should create one or separately for both of ‘em.",
        "created_utc": 1671083583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Seals &amp; Sea Lions evolve to become prey instead of predators in the same way that their close relatives, Bears, Wolves, Big Cats, and Hyenas are?",
        "author": "wiz28ultra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zm9rtt/why_did_seals_sea_lions_evolve_to_become_prey/",
        "text": "",
        "created_utc": 1671071576,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are Seals &amp; Sea Lions prey instead apex predators, even though Carnivorans evolved to be apex predators multiple times on land(i.e. Big Cats, Wolves, Hyenas, Bears, Wolverines).",
        "author": "wiz28ultra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zm9r0s/what_are_seals_sea_lions_prey_instead_apex/",
        "text": "",
        "created_utc": 1671071508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Even though Bears, Canids, Felines,and Hyenas have evolved to be apex predators and very successful predators, why haven't Seals &amp; Sea Lions done the same? What conditions prevent pinnipeds from evolving into larger predators in the same way that Orcas, Lamniformes, and Carcharhiniformes have?",
        "author": "wiz28ultra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zm9nhh/even_though_bears_canids_felinesand_hyenas_have/",
        "text": "",
        "created_utc": 1671071231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are astronomers uninterested in the idea of a Pacman-shaped universe?",
        "author": "mutandis57",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zm5lf4/why_are_astronomers_uninterested_in_the_idea_of_a/",
        "text": "Every time a question about the shape of the universe is asked on r/AskScience, all the responses launch into lengthy descriptions of the options for the curvature of space, but little to no attention is given to its connectivity. Even when someone explicitly asks whether the universe could be a flat 3-torus, they are still given the runaround with describing the curvature instead. I already know about the positive/negative curvature and how it leads to closed/hyperbolic universes! I know how our universe is flat to within margin of error of our current observations. I want to know whether it could be a donut! Anyone who has played Pacman or Asteroids knows how intuitive the idea of a wrap-around universe quickly becomes. Surely I am not the only one curious about the possibility! Yet astronomers don't seem interested to talk about it. Why is that?\n\nHere are my possible theories:\n\n1. **A flat/positive/negative-curved universe is the simplest case. A response will primarily talk about that, since it is at the core of introduction to cosmology. Once we go beyond the case of simply connected space, there is no limit to complexity we can imagine, so we should not talk about it.**\n\nI am asking about a Pacman-shaped universe (a flat 3-torus), which is only *one step* above the simplest case. I'm not asking about exotic situations, like a space with a hard boundary, or some multiply connected ꙮ-shaped (multiocular-O) space with glued patches and wormholes all over the place! :) Is that too much to ask?\n\nI personally believe that an Asteroids-shaped model universe is a much better introduction to cosmology for the curious than the \"galaxies on the surface of an inflating balloon\" model. \"Asteroids\" immediately answers questions that \"balloon\" cannot, such as \"Where is the center of the universe?\" (\"Anywhere you want it to be\" vs. \"Definitely **not** in the center of the balloon\") and \"What is the universe expanding into?\" (\"Just imagine twice the pixels\" vs. \"Definitely **not** into the air around the balloon\"). Then once the \"Asteroids\" model becomes intuitive, you can say the real universe is thought to be like that, but in 3-D and with no wraparound. This way, a 1-up model is even easier to imagine than the \"simplest\" case of a flat/positive/negative universe. What's so simple about visualizing a \"positively-curved closed 3-sphere\" let alone something \"hyperbolic\"?\n\n2. **There are observations disproving it. Astronomers are uninterested in an answered question.**\n\nWhat exactly are these observations? I would really enjoy reading these references! And if the observation*s* is just one or two scientists who came up with an algorithm 20 years ago to test the wraparound hypothesis in a rudimentary way, ran it against an astronomical database, and came up with no hits, why is that sufficient to settle the question? Why are there not constant efforts to collect and analyze additional data to strengthen this confirmation? We are constantly finding new ways to measure and refine the Hubble Constant for example, to the point where even now we are uncovering new physics because different measurement methods are producing noticeably different values of H_0, which demands an explanation! Or the cosmological constant Λ (Lambda), which was originally invented by Einstein, then \"disproven\" from observations by Hubble (causing Einstein to call it his \"biggest blunder\"), then re-introduced in the form of dark energy once better measurements have shown the Hubble parameter to be increasing with time. Why couldn't the same be done for wrap-around hypothesis?\n\n3. **There are no observations proving it. Astronomers do not speak of which they have no evidence.**\n\nWhat would it take to prove? If the universe wraps around on a length scale shorter than the observable universe, ideally we should be able to see the same galaxy in different parts of the sky, or even see the Milky Way from long ago! We spend so much time looking for Einstein crosses/rings, we even come up with exotic methods to prove that a particular Einstein ring 10 billion light years away is formed by a single star in a miraculously-perfect alignment, why couldn't we spend the same effort looking for mirror galaxies? Sure it would be more difficult to match up distant parts of the sky than match a single Einstein cross, but the result would be more important too if successful! Would we recognize Milky Way if we saw it from 10 billion light years away? Are there any \"reference\" stars like pulsars or other features that persist that long? Would the arrangement of galaxies in the local cluster be recognizable or would they have drifted beyond recognition?\n\nThe wraparound scale could be beyond the observable universe. But astronomers are not deterred from speculating beyond the boundary on other questions. They invoke the cosmological principle of homogeneity to claim the universe probably looks the same beyond the Hubble volume as it does here, even though they cannot see it. They also say that the universe could still be positively curved within the current 0.4% margin of error for flatness, and if it is then it is finite, but at least 100 times bigger than the observable universe. Isn't saying that equally as speculative as asking about a wrap-around universe? Could cosmic microwave background anisotropies be used to explore possibility of wraparound beyond the visible range?\n\n4. **The universe is the way it is, not the way we want it to be. Why be so invested in the idea of a wrap-around universe? Wait for evidence prompting for it before speculating.**\n\nIt is true, thinking about a Pacman-universe borders the realm of metaphysics. The primary benefit of that model is that the universe is finite while still being flat, but there is no particular reason that the universe *has* to be finite. It just feels more palatable that way to us humans. But anyone who has ever added a periodic boundary condition to their simulation knows how \"convenient\" it is in creating the illusion of boundlessness for cheap. It is too irresistible! On the other hand, metaphysics has not prevented scientists from forming speculative desires in other areas. In particular it seems to me that physicists prefer the \"Copenhagen\" interpretation of quantum mechanics over the \"Many-Worlds\" interpretation not due to its correctness (both make the same predictions within our ability to measure) or evidence for it (if anything, interference experiments with ever bigger and bigger particles and the existence of quantum computers make a stronger case for Many-Worlds), but seemingly due to the *sheer disgust at the absolute wastefulness* of the many-worlds branching tree. Yet just like in cosmology, there is no principle in physics that demands that the world must be finite or of some sensible size. Even if both Many-Worlds were true and the universe were flat infinite, I still don't understand why aren't astronomers even interested in trying to curtail the size of the universe to the same degree as physicists are interested in pruning the branching of quantum mechanics?",
        "created_utc": 1671060232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why isn't the magnetic field viewed more as a convention, and not fundamental, just like centrifugal force is?",
        "author": "Nemarus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zm3bfz/why_isnt_the_magnetic_field_viewed_more_as_a/",
        "text": "I've been trying to gain a better understanding of electromagnetism, and from what I've read and watched, the \"magnetic field\" is merely an invented *convention* to describe how an electric field from a charge looks when viewed by an observer that is in motion relative to the charge.\n\nLooking around on the internet, I've seen a few others make this assertion: \"**magnetism is just electrostatics combined with special relativity\".** Is that accurate?\n\nIf this is true, then isn't magnetism just an observed phenomenon -- just like centrifugal force? Isn't the fundamental entity still always the electric field?\n\nNow sure, unlike centrifugal \"force\", a magnetic field does not require relative *acceleration* \\-- only relative *velocity* \\-- but it still feels incorrect to describe the magnetic field as some sort of fundamental entity. Even the term \"electromagnetic field\" seems like a needlessly obfuscating misnomer. Why give it a name that suggests this notion of some two-headed gestalt field when it's really just one thing? Why talk about waves of light as oscillating interactions between the electric field and the magnetic field?\n\nPersonally, I feel like my understanding has been hindered by so many sources treating the magnetic field as its own thing. From a physics education standpoint, I feel like it would be simpler if I had been taught in this sequence:\n\n1) Here's what happens between charged particles when they are stationary. \n\n2) Now notice that, because of special relativity, the electric field of a moving charge produces a new orthogonal vector of force. \n\n3) The interactions of this force with the original electric field can cause a wave-like oscillation that can propagate as radiation.\n\n4) To make calculations easier, we can treat this force as if it were the product of another field, the magnetic field. **But this is purely for the sake of convenience of calculation; it is not fundamental.**\n\nThat, to me, would've made everything much easier to understand. I'd have called this force the \"electrodynamic force\" or something. And yeah, maybe historically, the word \"magnet\" was brought in because the phenomenon of magnetism was observed before it was understood, but that, to me, does not seem to justify promoting the notion of a \"magnetic field\" or counting magnetism as half the 'electromagnetic field\". \n\nBut maybe I'm still not getting things right, and I've made some incorrect assertions. But right now it seems to me that the \"magnetic field\" is just a downstream manifestation of the electric field and special relativity.\n\nI'm hoping someone here can say, \"yes that's correct\" or \"no, that's wrong and here's why\".",
        "created_utc": 1671054628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wormholes as a local explanation of quantum entanglement?",
        "author": "stevie_r1987",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zm1kul/wormholes_as_a_local_explanation_of_quantum/",
        "text": "[removed]",
        "created_utc": 1671050374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could we make a sufficiently capable fusion reactor that would be able to create and maintain an actual mini-star like our sun.",
        "author": "LiveEatSleep123",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zlzipu/could_we_make_a_sufficiently_capable_fusion/",
        "text": "",
        "created_utc": 1671045161,
        "upvote_ratio": 0.99
    },
    {
        "title": "Do humans really follow a system of Alphas, Betas, Omegas like some animals do?",
        "author": "Real_Carl_Ramirez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zlq2cm/do_humans_really_follow_a_system_of_alphas_betas/",
        "text": "Redditors like posting screenshots of this commentator named Nick Adams who calls himself \"Alpha Male\" (mostly to lampoon his crazy posts).\n\nBut do humans really follow this system? Also, if we do, are Alphas the sort of people who try to enter politics, and are Omegas the sort of people who are content doing low-paid jobs?",
        "created_utc": 1671021988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ukraine, as of today, is still receiving Russian gas: How does this work, how do they conduct this business?",
        "author": "andthatswhyIdidit",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zlmdwz/ukraine_as_of_today_is_still_receiving_russian/",
        "text": "If you check on on [bruegel.org](https://www.bruegel.org/dataset/european-natural-gas-imports), gas imports to Europe are still occurring: during TURKSTREAM, but more interestingly through Ukraine (UKRAINE TRANSIT) itself.\n\nSo, the state of war being as it is: How does the compensation for this business work between the two opponents in this war? How is it paid for, how is the line kept secure, what are the contractual obligations?",
        "created_utc": 1671009354,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question for the carto-savvy: What would a map of Earth look like if the ocean fills up 88%, not 71%, of its surface?",
        "author": "JohnWarrenDailey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zlhy4c/a_question_for_the_cartosavvy_what_would_a_map_of/",
        "text": "",
        "created_utc": 1670993755,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is wrong with observing and gathering data without making an hypothesis first?",
        "author": "drecklia",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zldoa8/what_is_wrong_with_observing_and_gathering_data/",
        "text": "Why is it bad to observe then draw theories?",
        "created_utc": 1670981793,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the biggest hurdles that still need to be overcome to make nuclear fusion a viable energy source?",
        "author": "strongerthenbefore20",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zld4ps/what_are_the_biggest_hurdles_that_still_need_to/",
        "text": "",
        "created_utc": 1670980388,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've read that Rolamite low-friction bearings are the only simple machine (same family as lever, wedge, pulley, etc) discovered in the 20th century. Can we determine there aren't any more or could there still be things we haven't thought up?",
        "author": "pakled_guy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zlc7rs/ive_read_that_rolamite_lowfriction_bearings_are/",
        "text": "Could we sic some sort of AI on it?",
        "created_utc": 1670978053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is This Considered a Scientific Study ?",
        "author": "razloric",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zlbolv/is_this_considered_a_scientific_study/",
        "text": "https://globalnews.ca/news/9345291/covid-vaccine-hesitancy-ontario-crashes/\n\n&gt;COVID-19 vaccine hesitancy associated with increased risk of a traffic crashes in Ontario",
        "created_utc": 1670976695,
        "upvote_ratio": 1.0
    },
    {
        "title": "The fusion power experiment at Lawrence Livermore National Laboratory in California used 2 megajoules of energy to produce 3 megajoules, or a factor of 1.5 in energy gain. What sort of factor of energy gain would be reasonable for a commercial power plant to be viable?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zl7s93/the_fusion_power_experiment_at_lawrence_livermore/",
        "text": "",
        "created_utc": 1670967505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cognition during complete paralysis under \"zombie-type\" psychoactives?",
        "author": "losala",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zl4dld/cognition_during_complete_paralysis_under/",
        "text": "I'm not interested in \"zombies\" as seen in pop culture, but in the effect on mind and perception during the conscious-but-paralysed phase. Does the subject see and hear? Does the mind act as a completely passive receiver of sensations, with no \"will\" or desire to move or escape? Is memory impaired? In other words, I need *unbiased* but somewhat detailed reportage on \"what is was like\" to be conscious but completely unable to move or initiate action. (I know there have been some hoaxed-up reports...) Google gives me medical/neurochemical studies of tetrodotoxin et al--not what I need.",
        "created_utc": 1670959477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our CFL bulb just exploded and caused a terrible smell in the house. Did we just get Mercury poisoning through aerosol?",
        "author": "CBHawk",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zl34iv/our_cfl_bulb_just_exploded_and_caused_a_terrible/",
        "text": "",
        "created_utc": 1670956532,
        "upvote_ratio": 1.0
    },
    {
        "title": "In need of advice about a case study",
        "author": "atinylittlebug",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zl0soj/in_need_of_advice_about_a_case_study/",
        "text": "I work as a research specialist in a large university epigenetics lab. My background is in invertebrate husbandry and my lab studies a kind of invertebrate, which I am responsible for keeping, breeding, etc. \n\nLong story short, I successfully treated a fatal disease that affects these inverts and my PI suggested I write a case study on what I did. However, I have no science background and my PI travels abroad 95% of the time so I cannot ask them for much advice. Others in my lab do not take this project seriously because they don't understand it, only have a background in epigenetics and not invert husbandry, etc. \n\nAny advice on how to move forward, places to go for writing help, where to even submit something like this, etc?\n\nThanks in advance!",
        "created_utc": 1670951179,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much energy could we capture with a dyson swarm before there would be a noticible reduction in light levels?",
        "author": "JulianGyger",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zl0fg3/how_much_energy_could_we_capture_with_a_dyson/",
        "text": " Hey Reddit\n\nIf we were to construct a dyson swarm (a giant constellation of solar collectors/mirrors orbiting the sun to collect its energy) how much of the suns energy/light could we collect without messing up our climate or making it noticibly darker on earth and other planets?",
        "created_utc": 1670950344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Must scientific solutions always be ethical? How can society play a part in managing ethical dilemmas in science and technology?",
        "author": "yknikkii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkzzdl/must_scientific_solutions_always_be_ethical_how/",
        "text": "[removed]",
        "created_utc": 1670949273,
        "upvote_ratio": 1.0
    },
    {
        "title": "does carbonated water actually clean any better than regular water?",
        "author": "timelesssmidgen",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkywsd/does_carbonated_water_actually_clean_any_better/",
        "text": "I was always taught, whenever you spill something on a fabric that can't easily be washed (carpeting, couch, etc.) Reach for the carbonated water, douse the stain, blot dry and repeat. It works pretty well, but is the carbonation part actually helping over plain water? I can imagine it's just a myth inspired by the bubbles, but maybe there's more to it...?",
        "created_utc": 1670946627,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does science and technology aim to do?",
        "author": "yknikkii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkwpkg/what_does_science_and_technology_aim_to_do/",
        "text": "[removed]",
        "created_utc": 1670940737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical science has been so successful that people now expect too much from it.",
        "author": "yknikkii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkwnx1/medical_science_has_been_so_successful_that/",
        "text": "[removed]",
        "created_utc": 1670940618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are close-up mirror reflections blurry for nearsighted people?",
        "author": "UCRecruiter",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkwd1w/why_are_closeup_mirror_reflections_blurry_for/",
        "text": "TL;DR: Why are reflections in a mirror held close to the eye still out of focus for a nearsighted person?\n\nLonger for clarity: I'm extremely nearsighted. When I'm holding a mirror close to my eyes, I'm looking at a surface that is reflecting the image of something further away. Since the mirror's surface is only a few inches away from my eyes (a distance at which I would be able to see an object in focus), I would expect that the reflected image would be in focus. It's not; it's just as blurry as if I were looking 'through' the mirror at the distant object itself.\n\nWhy is the reflected image still blurry when I'm looking at a reflection on a surface that's very close to my eyes?",
        "created_utc": 1670939827,
        "upvote_ratio": 1.0
    },
    {
        "title": "[BIOLOGY, GENETICS] is it scientifically possible to create a unicorn?",
        "author": "Freevoulous",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zktykp/biology_genetics_is_it_scientifically_possible_to/",
        "text": "Simply put, is it possible with today's level of genetic engineering to give horses an inheritable trait of a single horn centrally placed on their head?",
        "created_utc": 1670932650,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the biggest problem in communicating science today?",
        "author": "zlejondrej",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkr4w7/what_is_the_biggest_problem_in_communicating/",
        "text": "How do you feel (scientists and non-scientists alike) about how science is communicated today? I have the feeling that either people take science as a substitute for God, an all-knowing, all-capable entity that is gonna save us all, or they encounter so many conflicting, out-of-context experiment results that they stop believing in it all together. What would be a better way to communicate science and its limits? Is there any practical way to convey probability, uncertainty and critical debate to people who don't have the time or resources to spend on the issues?",
        "created_utc": 1670921929,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we had a moon that was far enough away, could we have solar/lunar eclipses that last multiple days?",
        "author": "Dinoboy225",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkgkuf/if_we_had_a_moon_that_was_far_enough_away_could/",
        "text": "",
        "created_utc": 1670890523,
        "upvote_ratio": 1.0
    },
    {
        "title": "How loud would the sun be if there was 1 atm of pressure between us and it?",
        "author": "siliconvalleyist",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zkezap/how_loud_would_the_sun_be_if_there_was_1_atm_of/",
        "text": "",
        "created_utc": 1670886718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could we genetically engineer or selectively breed a unicorn into existence?",
        "author": "BeneficialPomelo6485",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zk8aeg/could_we_genetically_engineer_or_selectively/",
        "text": "We have horses, we have rhinos, narwhal, and other animals woth horns. Would it be possible to combine them or is something biologically incompatible with horses and horns?",
        "created_utc": 1670872289,
        "upvote_ratio": 1.0
    },
    {
        "title": "A very strange question, but a serious one. I can only think of this place having the brains to answer it. So here goes.....",
        "author": "nogudatmaff",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zk853d/a_very_strange_question_but_a_serious_one_i_can/",
        "text": "Place - Our Solar System - But just the Sun, Earth and some Earth's moons. \n\nThe Earth - Tidal locked orbit of the Sun. \n\nOnly nightime for sun-side of Earth is a nightly complete eclipse of the Sun, lasting about 4 hours.\n\nSo here are the questions......\n\n1. In order for the Moon's to provide night-time degree's of darkness, how much bigger and closer to the Earth would the moons have to be?\n2. I say Moon's becase I assume in order to provide 8 hours of darkness, the Earth  would have to have more then one Moon, and each one with a relativly slow ordit. \n3. Relating to question 2, how many moons would we be talking about? If the day periods were all equally 16 hou.\n4. Final question, during the dar period, how many moons or part moons would be visible during daylight as they continued their equidistant rotation around the earth?\n\nThanks for taking in my rather silly questions :-)",
        "created_utc": 1670871967,
        "upvote_ratio": 1.0
    }
]