[
    {
        "title": "Where does the government keep its money?",
        "author": "DankerOfMemes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tosgt/where_does_the_government_keep_its_money/",
        "text": "[removed]",
        "created_utc": 1502738784,
        "upvote_ratio": ""
    },
    {
        "title": "How are historical events sorrounding the Jewish People, the Holocaust and Israel being handled by the Judaic Faith?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6toraj/how_are_historical_events_sorrounding_the_jewish/",
        "text": "[deleted]",
        "created_utc": 1502738504,
        "upvote_ratio": ""
    },
    {
        "title": "what advice would you give to someone who wants to cut 70% of socialising with people?",
        "author": "underground_gamblr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tnw9m/what_advice_would_you_give_to_someone_who_wants/",
        "text": "[removed]",
        "created_utc": 1502731205,
        "upvote_ratio": ""
    },
    {
        "title": "Do athletes who have to undergo prolonged bedrest or similarly limited activity suffer neurochemical deficits?",
        "author": "cp5184",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tmt3t/do_athletes_who_have_to_undergo_prolonged_bedrest/",
        "text": "[removed]",
        "created_utc": 1502721397,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | August 14, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tmm4c/monday_reading_and_research_august_14_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1502719537,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly is a social construct? Do all relevant professionals recognize it as a testable, useful, and meaningful concept?",
        "author": "MephistorPrinceOfBad",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tksni/what_exactly_is_a_social_construct_do_all/",
        "text": "(I looked into it a bit on Wikipedia, but [the Wikipedia article that searching \"social constructs\" gets you](https://en.m.wikipedia.org/wiki/Social_constructionism) seems like it might be about both social constructs AND theories that place emphasis on the relevance/importance of social constructs.)\n\nI would also like to know: Is there any controversy about social constructs that doesn't fall directly into the purview of my questions?",
        "created_utc": 1502694034,
        "upvote_ratio": ""
    },
    {
        "title": "Why were some Nazi symbols avoided after the war while others are still widely-used?",
        "author": "EagleZR",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tk4or/why_were_some_nazi_symbols_avoided_after_the_war/",
        "text": "This question is more about America's reasoning in this. I'm not as familiar with how other countries behaved. \n\nIf we're attempting to totally avoid anything reminiscent of the Nazis, why do we continue to use some of their symbols? We avoid the Nazi salute and the swastika, but we still use the eagle in many of our symbols and favor classical Roman and Greek architecture. Of course we were using those before the Nazis, but we were using the \"Nazi\" salute and the swastika before them as well. I can understand not wanting to tear down existing buildings like the White House and the Capital building, but we still continue to build in that style. And it would be cheap and easy to stop putting the eagle on things, hoping that all existing things linking the eagle to America would die out. \n\nIs it due to some refusal to admit that we might be similar to the Nazis? While the Nazi salute was just something we did and the swastika was less central to our national symbolism and identity, the eagle and our reverence of the Greeks and Romans were central to us, and we refused to label them as \"bad\" or \"dangerous\" because we were unable to admit that we could also be that bad? \n\nI thought of this while trying to fall asleep and got curious. Sorry if I ramble or if it's a simple answer.",
        "created_utc": 1502684489,
        "upvote_ratio": ""
    },
    {
        "title": "Fiduciary Responsibility and \"Socially Conscious Corporations\"",
        "author": "djweidman",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tjp01/fiduciary_responsibility_and_socially_conscious/",
        "text": "Are public companies betraying their fiduciary responsibility to their shareholder by persuing \"socially conscious\" objectives. For[ reference](https://www.law.cornell.edu/wex/fiduciary_duty) \"Corporate officers and directors are not permitted to use their position of trust and confidence to further their private interests.\"  So they're not furthering their \"private interests\" but not furthering the interest of the company either (unless someone decides it's profitable to look like a socially conscious company to the public.)",
        "created_utc": 1502679278,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent is the rise of the alt-right caused by a crisis in masculinity, if at all?",
        "author": "North_London_Gunner",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tiiqz/to_what_extent_is_the_rise_of_the_altright_caused/",
        "text": "",
        "created_utc": 1502666046,
        "upvote_ratio": ""
    },
    {
        "title": "What would the conviction rate be in an ideal society?",
        "author": "ol_stoney_79",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6thu3z/what_would_the_conviction_rate_be_in_an_ideal/",
        "text": "[removed]",
        "created_utc": 1502659060,
        "upvote_ratio": ""
    },
    {
        "title": "Why are serial killers/mass murders mostly white men?",
        "author": "LyricalWillow",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6thkum/why_are_serial_killersmass_murders_mostly_white/",
        "text": "According to this statistic, the majority of serial killers are white male serial killers. http://maamodt.asp.radford.edu/Serial%20Killer%20Information%20Center/Serial%20Killer%20Statistics.pdf\n\nOr is this a stereotype?   ",
        "created_utc": 1502656509,
        "upvote_ratio": ""
    },
    {
        "title": "Question on structural vs discriminatory inequality",
        "author": "DamnDatAssSoFine",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6thgpb/question_on_structural_vs_discriminatory/",
        "text": "Would it be true to say if a manifest inequality turns into a law (such as voting age in the US which would be discrimination against age) it counts as a structural inequality and if it remains as is, it counts simply as discrimination?",
        "created_utc": 1502655386,
        "upvote_ratio": ""
    },
    {
        "title": "How can I get social skills?",
        "author": "sanim120",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6th73f/how_can_i_get_social_skills/",
        "text": "[removed]",
        "created_utc": 1502652827,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good books to read on the economics of the Guild System?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6teeru/what_are_some_good_books_to_read_on_the_economics/",
        "text": "",
        "created_utc": 1502619774,
        "upvote_ratio": ""
    },
    {
        "title": "What is the relationship between the media and \"health myths\"?",
        "author": "migorengqueen",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6te7u6/what_is_the_relationship_between_the_media_and/",
        "text": "E.g. stomach ulcers are caused by stress- how has the media influenced this myth? Is it possible that us having more of an ability to \"self diagnose\" could affect this?\n\nI'm doing an assignment at uni about this, and would love to hear your ideas or have a look at any journal articles you may know of. ",
        "created_utc": 1502616272,
        "upvote_ratio": ""
    },
    {
        "title": "What's the \"success rate\" of children born into isolated religious or political communities?",
        "author": "Vostochis",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6te532/whats_the_success_rate_of_children_born_into/",
        "text": "Of the children born into groups that attempt to create a bubble around their world, blocking outside influences such as media or social contact, is there any data on how many remain a part of the belief system and how many leave, and if so, what factors caused these decisions to be made?",
        "created_utc": 1502614729,
        "upvote_ratio": ""
    },
    {
        "title": "What are evidence-based approaches for working towards a peaceful and harmonious co-existence with people who have diverging beliefs and worldviews?",
        "author": "Bruce--",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6te0uz/what_are_evidencebased_approaches_for_working/",
        "text": "I'm talking about in communities, both small and large. \n\nI understand social systems play a part in this, but I see lots of people using various approaches to try promote a peaceful and harmonious co-existence, but I suspect many are probably ineffective, or perhaps even counter-productive. \n\nI know that what actually provides results is usually counter-intuitive, even if it seems obvious in retrospect. ",
        "created_utc": 1502612447,
        "upvote_ratio": ""
    },
    {
        "title": "Does Trump have narcissistic personality disorder?",
        "author": "gapeswithapes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tdbax/does_trump_have_narcissistic_personality_disorder/",
        "text": "[removed]",
        "created_utc": 1502600126,
        "upvote_ratio": ""
    },
    {
        "title": "What is the Verdict on the Effects of Ethnic Diversity?",
        "author": "ExRedRadical",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6tajjl/what_is_the_verdict_on_the_effects_of_ethnic/",
        "text": "So I've seen lots of people online making claims that diversity is evil and terrible for social trust, and citing various articles to prove their point. \n\nRather than take them at their word, I decided to do my own research on the matter.\n\nThe best summation I got was this, a systematic review.\n\nhttp://www.annualreviews.org/doi/abs/10.1146/annurev-soc-071913-043309\n\n&gt; Guided by a clear conceptual framework, we structure the empirical results of 90 recent studies and observe three patterns. We find that (a) there is consistent support for the constrict claim for aspects of social cohesion that are spatially bounded to neighborhoods, (b) support for the constrict claim is more common in the United States than in other countries, and (c) ethnic diversity is not related to less interethnic social cohesion. We discuss the implications of these patterns.\n\nPer this review, it seems that, aside from at the neighborhood level, diversity, far from being evil and terrible, is null.\n\nBut I wanted to ask you guys what the consensus in the field was, and also ask if there is other research you recommend I should read.",
        "created_utc": 1502567370,
        "upvote_ratio": ""
    },
    {
        "title": "Selectorate theory's predictive power",
        "author": "literallyarcher",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6t8o71/selectorate_theorys_predictive_power/",
        "text": "Curious if anyone could point me to a study where Selectorate theory was rigorously back tested or made verifiable predictions of outcomes. Any type of organization but I'm most interested to see if someone has used it to predict market outcomes of business.",
        "created_utc": 1502547629,
        "upvote_ratio": ""
    },
    {
        "title": "Is there such thing as slavery without forced labour?",
        "author": "slopeclimber",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6t7mn1/is_there_such_thing_as_slavery_without_forced/",
        "text": "I'm asking if owning people as property, objects without making them work is slavery",
        "created_utc": 1502531320,
        "upvote_ratio": ""
    },
    {
        "title": "why would a culture would become more conservative?",
        "author": "Sillynik",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6t2e1e/why_would_a_culture_would_become_more_conservative/",
        "text": " i found it interesting how cultures like the Persians after the islamic revolution,the Victorian era in the UK, territories after the Ottoman empire, and dynasties after the song dynasty all became more conservative than they previously were. I was wondering what would cause people to want to do this.",
        "created_utc": 1502469918,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any cultures/societies where dark skin is considered ideal?",
        "author": "Roughneck16",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6t1xqt/are_there_any_culturessocieties_where_dark_skin/",
        "text": "Traveling the world, I've noticed a consistent trend across cultures: lighter skin is considered beautiful and desirable and darker-skinned peoples are viewed as inferior.\n\nI've seen this phenomenon in India, the Far East, Latin America, and the Middle East. In all those cultures, the soap opera stars, models, etc. are all fair-skinned folks.\n\nI'm curious, is there a culture that deviates from that trend?\n\n[EDIT: I am *not* endorsing racism/colorism. I find it repugnant. I'm just acknowledging that it's a real phenomenon.]",
        "created_utc": 1502465835,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | August 11, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6t1cwp/friday_freeforall_august_11_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1502460359,
        "upvote_ratio": ""
    },
    {
        "title": "How are biases in academia characterized and resolved?",
        "author": "veyenn",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6t0bzq/how_are_biases_in_academia_characterized_and/",
        "text": "I hear a lot about the \"liberal bias\" of academia, especially in right wing writings. I don't know about the validity of this claim, but it seems to me to be a challenge to claim there is or isn't a bias at all.\n\nIf an overwhelming proportion of researchers believe X, how can we know how much of that is because those who justifiably believe not-X are not as engaged in the system, and how much is because the truth of reality is probably X and not not-X?\n\nThe second part is more of a practical matter. What are the mechanisms within the academic institution that can reduce this bias and how can we know if they are even effective?",
        "created_utc": 1502448296,
        "upvote_ratio": ""
    },
    {
        "title": "Research help?",
        "author": "bloosquid",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6syksy/research_help/",
        "text": "I'm looking to start some research in the criminology field this year and will be pulling articles from most fields of social sciences. What's the most efficient way to read published studies and analyze the results without having to read the whole thing word for word? I'm having problems getting caught up in reading all the text and not clearly grasping the findings. Thanks!",
        "created_utc": 1502422179,
        "upvote_ratio": ""
    },
    {
        "title": "Fat talk and social media?",
        "author": "l45k",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6syi46/fat_talk_and_social_media/",
        "text": "Hey all, just wondering if anyone has looked into a link between 'fat talk', weight stigma, thin idealisation and any link between them and social media use. It's thought that those variables can have consequences like eating disorders such as anorexia nervosa, bulimia etc amongst other issues. I have seen quite a bit of anecdotal reporting as well as some cross sectional studies but nothing really of note for longitudinal or more than just a small sample of women. If anyone is currently looking into this field or have some studies I should check out that would be great. Any scales you would think are useful for research. Thanks =)",
        "created_utc": 1502421294,
        "upvote_ratio": ""
    },
    {
        "title": "What textbook would you recommend to self study social psychology?",
        "author": "seventeen_potatoes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sxc6s/what_textbook_would_you_recommend_to_self_study/",
        "text": "The topics I am interested in friendship formation and dynamics, conversation structures, impression formation, and socialization. ",
        "created_utc": 1502408567,
        "upvote_ratio": ""
    },
    {
        "title": "Is my friend's therapist a hack?",
        "author": "DamiensLust",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6swzq9/is_my_friends_therapist_a_hack/",
        "text": "[removed]",
        "created_utc": 1502404983,
        "upvote_ratio": ""
    },
    {
        "title": "Are there political trends amongst conspiracy theorists?",
        "author": "jokul",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sug7s/are_there_political_trends_amongst_conspiracy/",
        "text": "There's some hubub about /r/Conspiracy being very pro-Trump in the wake of the Manafort raid and I know that they have been targeted in the past as a major recruitment center for white nationalists, but at the same time, /r/Conspiracy is just a single sub and not necessarily indicative of any trends in the greater conspiracy theorist community.\n\nSo, amongst people who believe in conspiracy theories, are there any typical political leanings? If yes, are there any suggested explanations for this phenomenon? ",
        "created_utc": 1502382479,
        "upvote_ratio": ""
    },
    {
        "title": "Credulity and the National Character - Really?",
        "author": "OhSoWittyUsername",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6suakg/credulity_and_the_national_character_really/",
        "text": "A recent piece in *The Atlantic*, [\"How America Lost Its Mind\"](https://www.theatlantic.com/magazine/archive/2017/09/how-america-lost-its-mind/534231/) states that a high percentage of the American public believes (or tells pollsters they believe) a tremendous amount of nonsense.\n\n&gt; A third of us believe not only that global warming is no big deal but that it’s a hoax perpetrated by scientists, the government, and journalists. A third believe that our earliest ancestors were humans just like us; that the government has, in league with the pharmaceutical industry, hidden evidence of natural cancer cures; that extraterrestrials have visited or are visiting Earth. Almost a quarter believe that vaccines cause autism...\n\nThe article then goes on to claim that credulity for the fantastic is a distinctly American phenomenon, rooted in our history and culture.  Over the long piece, the writer ties together a number of strands to explain how the United States got to this point.  \n\nWhat I'm curious about is the author's thesis, that such widespread belief in nonsense is unique to the United States.  Are there studies out there for other industrialized nations that indicate similar widespread acceptance of utter malarkey?   Or is the article's thesis correct, and the American people are distinctly adept at believing in lizard people and conspiracies to hide the wonder-working medical miracles of natural foodstuffs?  \n\nMy hunch is that the author is mistaking normal human tendencies with \"national character,\" a common mistake for anyone criticizing a nation, but I'd be curious to see if there's evidence backing up my hunch.",
        "created_utc": 1502381107,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for sholarship on the alt-right",
        "author": "System-Fail",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ssxey/looking_for_sholarship_on_the_altright/",
        "text": "Hello Asksocialscience,\n\nCurrently I'm planing on doing some work about the so called identitarian movement in Germany. Therefor I'm looking on literature dealing with them or similar alt/new right groups. I'd like to analyze (and criticize) their concept of identity politics, so I'm especially interested in this perspective. Thank you in advance.\n\nedit: Thank you all for your responses, it's much appreciated!  ",
        "created_utc": 1502367602,
        "upvote_ratio": ""
    },
    {
        "title": "Are there legal safeguards for researchers in the U.K.?",
        "author": "historyiseverything",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ssk1s/are_there_legal_safeguards_for_researchers_in_the/",
        "text": "I'm currently studying the 'Reading the Riots' research by The Guardian and the LSE on the August 2011 UK riots. In it they discuss how they interviewed both people who were arrested and those in the community who hadn't been arrested but had taken part on the grounds of guaranteeing anonymity.\n\nAs this was taken place in October 2011 while people were still being arrested does this not count as withholding information from law enforcement?",
        "created_utc": 1502362719,
        "upvote_ratio": ""
    },
    {
        "title": "Are they legal safeguards for researchers in the UK regarding sources?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sshsd/are_they_legal_safeguards_for_researchers_in_the/",
        "text": "[deleted]",
        "created_utc": 1502361793,
        "upvote_ratio": ""
    },
    {
        "title": "Some Helpful Tips ( essay help) For Writing a Great Essay",
        "author": "DissertaitonHelp",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6srzgz/some_helpful_tips_essay_help_for_writing_a_great/",
        "text": "[removed]",
        "created_utc": 1502353742,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Reformation of the Swiss Monetary System a Bad Idea?",
        "author": "Gulliveig",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sr9ot/is_the_reformation_of_the_swiss_monetary_system_a/",
        "text": "In Switzerland, there is a popular initiative to reform the national monetary system. \n\nIs this an evolution of the [Chicago Plan](https://en.wikipedia.org/wiki/Chicago_plan)? And why does it come now, as there seems to be no apparent crisis (other than the overvalued currency)?\n\nI think I understand the proponents' arguments (see the [campaigners' Web site](http://www.vollgeld-initiative.ch/english/); Vollgeld = 'full money\"), but I am not really convinced, as I can imagine quite many risks.\n\nFor instance, will this not directly lead to a credit crunch? Would the Swiss not seek abroad credits? Who would pay for monetary services? And would such a reform not call for a lot more legislation in general, to enforce its acceptance and not circumventing it?\n",
        "created_utc": 1502342786,
        "upvote_ratio": ""
    },
    {
        "title": "Stalin's Purges and The Great Terror killed or imprisoned millions of lives of during the course of his reign. Did the environment of constant paranoia and suspicion have any lasting effects on the Russian population? If so, how?",
        "author": "nowlan101",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6spt7t/stalins_purges_and_the_great_terror_killed_or/",
        "text": "",
        "created_utc": 1502325580,
        "upvote_ratio": ""
    },
    {
        "title": "Should I Pursue a PhD In Economics/Finance?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6snyvx/should_i_pursue_a_phd_in_economicsfinance/",
        "text": "[removed]",
        "created_utc": 1502307783,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | August 09, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sloob/theory_wednesday_august_09_2017/",
        "text": "[removed]",
        "created_utc": 1502287582,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a term for using an argument that appeals to your opponent's perspective?",
        "author": "random_number_string",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6slkyr/is_there_a_term_for_using_an_argument_that/",
        "text": "[removed]",
        "created_utc": 1502286531,
        "upvote_ratio": ""
    },
    {
        "title": "How is alienation and commodity fetishism related in marxism?",
        "author": "Snurre-Snup",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sk327/how_is_alienation_and_commodity_fetishism_related/",
        "text": "You can hopefully help me with my struggles. I think i got a decent understanding of them separated but I cant figure out how they are related? \n\nAlienation is something happening for the worker in the workplace because of his relation to the product that he produces. It comes in four areas:\n\n- Alienation from the product\n- Alienation from the process\n- Alienation from the species essence\n- Alienation from others\n\nCommodity fetishism, on the other hand, is the concept that commodities on the market have some kind of inherent value in it self. That the effort of the workers that produced it isn't reflected in the value. \n\nBut how does these two concept relate to each other? The fetishism of the commodity makes people not recognize the work of the worker which alienates them further? What area of alienation is this? \n\nThanks a lot! :) ",
        "created_utc": 1502266534,
        "upvote_ratio": ""
    },
    {
        "title": "What portion of sex in the past was rape?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sj8zd/what_portion_of_sex_in_the_past_was_rape/",
        "text": "[removed]",
        "created_utc": 1502254289,
        "upvote_ratio": ""
    },
    {
        "title": "I like to be alone but i feel really bad (for them) when i see other people alone, is there a name when you like something but you feel is bad for other people?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6siky2/i_like_to_be_alone_but_i_feel_really_bad_for_them/",
        "text": "[removed]",
        "created_utc": 1502246465,
        "upvote_ratio": ""
    },
    {
        "title": "How big of an impact do marketers have on society?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6si8rb/how_big_of_an_impact_do_marketers_have_on_society/",
        "text": "[removed]",
        "created_utc": 1502242714,
        "upvote_ratio": ""
    },
    {
        "title": "What causes certain underground trends/fads to become mainstream?",
        "author": "Corohr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sfy99/what_causes_certain_underground_trendsfads_to/",
        "text": "Every once in awhile a trend/fad that used to have a small following all of a sudden starts picking up ground to the point that it becomes mainstream (or at least close). What are the theories as to why certain trends pick up and others don't? For example, backyard chickens, minimalism, Multi-level marketing (essential oils, luluroe, etc) ",
        "created_utc": 1502221077,
        "upvote_ratio": ""
    },
    {
        "title": "Would recalling a memory of an emotional moment always instil said emotion in the person as well? (More clarification inside)",
        "author": "krakonkraken",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sf41t/would_recalling_a_memory_of_an_emotional_moment/",
        "text": "This is a hypothetical question that popped into my head - I don't know if this question can be answered, so I apologise if this breaks the no speculation rule or if it's more appropriate for another sub. \n\nSo a more detailed illustration of my question is this: Alice has memories of punching Bob, because she hates him. Alice's memories are then suppressed or wiped in some way (ignoring the plausibility of this actually happening), so she has no recollection of ever knowing Bob, punching Bob, or hating Bob at all. \n\nAt a later date, the memory of her punching Bob, and of just knowing that Bob exists in general, returns to Alice. Will the return of that memory make Alice hate Bob again? Or will she only remember hating him, instead of actually feeling the hatred again, and just feel neutral towards him?\n\n\n",
        "created_utc": 1502214070,
        "upvote_ratio": ""
    },
    {
        "title": "Are men generally more competitive and risk takers than women? Does capitalism and individualism rewards men better than women?",
        "author": "jokoon",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sek48/are_men_generally_more_competitive_and_risk/",
        "text": "I'm asking this question regarding the whole google memo leak.\n\nGenerally I have always thought that women are better at cooperating in a work environment, while men prefer to compete and be \"centered\". So it makes sense that men are generally better paid, since it's hard to really measure team-work.\n\nI don't know if I'm asking the right question.\n\nI hear so much about gender inequality, but to me, the economy and social models of today will always favor men because of competition, capitalism, markets, performance orientation, etc.\n\nWhat do you think?\n\nPS: I'm not taking any side, I just want to learn if there is some science that can explain gender difference and salary differences.",
        "created_utc": 1502209079,
        "upvote_ratio": ""
    },
    {
        "title": "Did the internet allow political extremism to become more widespread?",
        "author": "khoreshtefesenjoon",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sejql/did_the_internet_allow_political_extremism_to/",
        "text": "I feel like the religion of political extremism is becoming much more widespread. Does this have any relation to the ease of information gathering via the internet? Does the internet incentivize echo chambers of extremism more than it does a healthy, broad consuming of information? ",
        "created_utc": 1502208986,
        "upvote_ratio": ""
    },
    {
        "title": "What is the cause or motivation behind racism?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6seg9h/what_is_the_cause_or_motivation_behind_racism/",
        "text": "Racism against blacks because of their skin. \n\nI still find it very hard to believe that people have a prejudiced impression towards the blacks *(or any other person who is not Caucasian)* because of their skin colour.\n\nTo this day I still find it a stupid reason for such a hatred-inspired philosophy and yet it persists. \n\nSo why it existed in the first place and why, after all the movements that occurred from the past century like MLK, Malcolm X and Mandela trying to end racism, racism still exists?",
        "created_utc": 1502208166,
        "upvote_ratio": ""
    },
    {
        "title": "Has conservative/right wing politics become basically a religion?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6se8j7/has_conservativeright_wing_politics_become/",
        "text": "[removed]",
        "created_utc": 1502206278,
        "upvote_ratio": ""
    },
    {
        "title": "How real is hypnosis?",
        "author": "pedrodegiovanni",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6sdhan/how_real_is_hypnosis/",
        "text": "[removed]",
        "created_utc": 1502198993,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any truth to the idea of the most homophobic people actually being gay?",
        "author": "KaiserCanton",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s8l4f/is_there_any_truth_to_the_idea_of_the_most/",
        "text": "I hear this a lot, but I haven't seen anything that supports this. Is it actually true or just bunk?",
        "created_utc": 1502139813,
        "upvote_ratio": ""
    },
    {
        "title": "\"Emerging adulthood\" is a relatively new and controversial term in psychology. Is there a consensus on who and what the term applies for?",
        "author": "SmytheOrdo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s7tew/emerging_adulthood_is_a_relatively_new_and/",
        "text": "I've seen the term applied to 18-30 year olds in general, I've seen it as a more narrow term to describe \"behind\" in personal development who are playing catchup so to speak. What is the general consensus of the term, if any, and where did this notion come from?",
        "created_utc": 1502133092,
        "upvote_ratio": ""
    },
    {
        "title": "What is the term when a religious group demonizes society? How and why did American culture became secular?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s79il/what_is_the_term_when_a_religious_group_demonizes/",
        "text": "[deleted]",
        "created_utc": 1502128364,
        "upvote_ratio": ""
    },
    {
        "title": "Where would the money go?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s6m08/where_would_the_money_go/",
        "text": "[deleted]",
        "created_utc": 1502122814,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | August 07, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s5pvy/monday_reading_and_research_august_07_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1502114737,
        "upvote_ratio": ""
    },
    {
        "title": "Engels noted that the Centralized State in India and other Asiatic countries acted as an entrepreneur by providing irrigation facilities without which Agriculture as not possible. What were the origins of this system and how did it develop?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s4sot/engels_noted_that_the_centralized_state_in_india/",
        "text": "",
        "created_utc": 1502103507,
        "upvote_ratio": ""
    },
    {
        "title": "Nazi Germany, while heavily invested in racial purity and superiority, also developed cutting edge technology. Why do modern U.S. based Neo-Nazi groups tend to distrust and disdain modern scientific development?",
        "author": "potatowithaknife",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s47xw/nazi_germany_while_heavily_invested_in_racial/",
        "text": "I've found it confusing that in the past, Nazi Germany relied upon and encouraged the development and research of advanced technologies of almost any kind, and while this is an extremely broad description, it seems that compared to modern Neo-Nazi groups that such endeavors are discouraged.  Why were past groups, with a similar racial philosophy but encouraging technological superiority, replaced with modern groups focusing entirely on race and birth rather than cutting-edge research? ",
        "created_utc": 1502093796,
        "upvote_ratio": ""
    },
    {
        "title": "What could cause a college educated 30 year old man to be lonely, unemployed, with almost no job experience? And how likely is that to lead to devious behavior?",
        "author": "veryawesomeguy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s43xa/what_could_cause_a_college_educated_30_year_old/",
        "text": "I read a profile of this man, sentenced to prison for stealing panties, and hope that unemployment won't cause me to do awful things\n\n\"Kim went on to get an associate's degree in computers from Portland Community College and a BS in genetics and cellular biology from Washington State University in 2001.\nIt was a good pedigree, on paper. But by 2004, Kim was 30, was still living at home and apparently had held only one job: a one-year stint at Intel before he attended WSU. He had, as far as his family knew, spent the three years since he had returned home from college trading stocks on his computer and attempting to find work.\"\n\nhttp://www.wweek.com/portland/article-4094-the-panty-thief.html\n\nHow common is this scenario and how much is the economy to blame? If I had degrees and still couldn't be hired three years after college it'll drive me nuts too.  The way I see it here is that unemployment can cause loneliness, and low self-esteem that makes it harder to be in a relationship and a lack of intimate partner can cause sexual problems which can lead to deviant behavior as viewed by society",
        "created_utc": 1502091956,
        "upvote_ratio": ""
    },
    {
        "title": "What is gender?",
        "author": "Yooper1120",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s2vhp/what_is_gender/",
        "text": "When a person says, \"I have no gender\", what do they mean by gender?\n\n\nObviously, when someone says, \"I have no gender\", they don't mean they don't have a vagina or a penis.\n\n\nAccording to the dictionary, gender is just another word for sex, or the traits typically associated with one or the other. But typically associated doesn't mean exclusively associated, so there's no reason people with vaginas can't burp and fart while they swig beer. Likewise, there are plenty of penis-owners who like My Little Pony.\n\n\nSo I'm clueless as to what these people mean when they say that.\n\n\nThanks in advance for your answers.",
        "created_utc": 1502074728,
        "upvote_ratio": ""
    },
    {
        "title": "Are there resources out there for absent-mindedness unrelated to ADHD or dementia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s2a5i/are_there_resources_out_there_for/",
        "text": "[removed]",
        "created_utc": 1502067838,
        "upvote_ratio": ""
    },
    {
        "title": "How did \"being cool\" become to be epitomized as one of the most or the most desirable personality traits in American culture? Where did it originate?",
        "author": "literallyarcher",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s1a0i/how_did_being_cool_become_to_be_epitomized_as_one/",
        "text": "It seems kinda odd that \"cool\" is often used as a substitute to describe someone good/trustworthy/successful/tough. It's also interesting that the ideal of a man (and increasingly woman) is someone who has a somewhat detached and un-emotional demeanor, you could say even bored. \n\nMost action stars are exactly this, calm, unrealistically clever or detached when their adrenaline should be making them anything but. Hell, the main character in the movie \"Be Cool\" is this taken up to an absurd extreme.\n\nI imagine in the past many other characteristics were seem as more important than \"coolness\" or being supremely calm. For example, from what little I know I imagine many Europeans valued passion as more important than cool during the dark ages and Roman times. Maybe I'm wrong through.\n\nWhen did it come about? What factors made it seen as a virtue or even the supreme virtue in popular culture?",
        "created_utc": 1502056794,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a paradigm shift from religion to race and ethnicity in terms of social tensions in the West?",
        "author": "acadamianuts",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s17vw/is_there_a_paradigm_shift_from_religion_to_race/",
        "text": "I am not sure whether this is the right sub to ask my question but please feel free to tell me if it isn't the case.\n\nIn the 19th and early 20th century United States, the Irish and Italians faced discriminations because they are Catholics unlike the majority of other European ethnicities. Germany under Otto von Bismarck discriminated the Catholics who are mostly Poles. Nowadays, discrimination on the basis of religion doesn't seem to be an issue (apart from Islam but that is another different topic) and it appears that ethnicity and race have become the source given the rising demographic changes in the West. Is it more accurate to say that religion has largely become a non-issue and instead the social tensions is rooted from ethnicity and race?",
        "created_utc": 1502056200,
        "upvote_ratio": ""
    },
    {
        "title": "I'm watching an old Oprah episode and the audience is pretty evenly split between men and women. When/how/why did daytime talk show audiences become so overwhelmingly female?",
        "author": "thirtysevenandahalf",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s0hy0/im_watching_an_old_oprah_episode_and_the_audience/",
        "text": "",
        "created_utc": 1502048996,
        "upvote_ratio": ""
    },
    {
        "title": "Is anyone familiar with a database of kinship vocabular/terminology?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6s0dcw/is_anyone_familiar_with_a_database_of_kinship/",
        "text": "",
        "created_utc": 1502047731,
        "upvote_ratio": ""
    },
    {
        "title": "Why or why not does porn have a detrimental effect on brain function, contributes to emotional and medical illnesses, and gives rise to deviant sexual arousal?",
        "author": "cheapcardsandpacks",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ryuxm/why_or_why_not_does_porn_have_a_detrimental/",
        "text": "",
        "created_utc": 1502032435,
        "upvote_ratio": ""
    },
    {
        "title": "How come conspiracy theories are becoming more popular or are being reported more lately?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rxkd7/how_come_conspiracy_theories_are_becoming_more/",
        "text": "I know that conspiracies did exist throughout history like the assassination of Julius Caesar is a famous one and I know that weird conspiracies always existed but lately there has been lots of reporting *(and even lots of humiliations)* about these recent conspiracy theories like the Flat-Earth conspiracy, the anti-vaccine movement and so on\n\n*(personally I think that the increased reporting about these people are sensationalism and the amount of people who fit within these categories are exaggerated. Perhaps it is another methods of the news and social media influencing our perceptions once again in subtle ways becuase it is 'popular' or 'trendy' considering that hate and our group bias has a lot of influence)*\n\n\nBut I cannot help but try to make sense out of this.\n\nAnd mind you, this is basically a hypothesis so I would rather have feedback from someone who is more professional than me or someone who is more families about this subject\n\n____________________________\n\nMy understanding is this ... the major distrust towards the government or those in power to create a nation of ignorant people has become an incredibly common theme in many forms of media, both fictional and non-fictional \n\nIt has become so common that it has become a cliche, with common phrases like 'I have woken up' or 'I took the red pill' *(reference to the Matrix)*, or the phrases 'Stand out' or 'Be different' \n\n*(which is itself [ironic](http://justsomething.co/wp-content/uploads/2017/04/32-of-the-most-hilarious-examples-of-irony-ever-05.jpg) because it meant to make people unique and avoid cliches or conform to what is accepted but these phrases have become so common, they became [cliches](https://68.media.tumblr.com/a8c3ca88d8be4d4d281efbba1d99209b/tumblr_oglx3syFXo1qmi74fo1_500.gif) of their own which is why people often respond to such things of this phenomenon as someone trying to be edgy or different or honest but in reality, it sounds like someone wanted to sound real and controversial but missed the point entirely)* \n\nThere are common themes in the fictional world like \n\n- 1984, \n\n- Brave New World World, \n\n- the comics involving Batman, V for Vendetta and so on\n\n- and even in films and TV, conspiracies and mystery are becoming incredibly popular because they provoke a lot of tension and emotion like Riverdale, Prison Break, Wayward Pines and so on.\n\n\n\nThese are common themes that are meant to inspire cynicism towards those in power and these types of stories involving conspiracy and lots of secrets makes people very aware of the real world and how dark it can be and it also makes them even scared \n\nFor example, \n\n- Adolf Hitler looked the saviour of Germany at one point until he eventually started WW2, \n\n- or the Syphilis conspiracy which was rejected for so long actually turned out to be true; \n\n- or the incident of Jonestown whose cult sounded like one with good intention until when it was being investigated it was found that it is not how it seems and the leader committed 'mass suicide' of himself and his entire followers\n\nNoticing these kinds of actual historical events, or the potential of such hidden intent can make people feel incredibly scared and rightfully so, they will feel scared considering that they feel that they are the only ones who 'woke up' from the illusion that those in power want you to believe like the main character in 1984 or the main character in the film ' The Truman Show'\n\nIn a way, I can understand it and I find it quite healthy to be cautious and cynical on what you see on the media, or what is popular or accepted or what those power say considring that politics and media influence has a lot of subtle influences like sensationalism, bias, half-truths, potentially shying away from the truth, twisting words and stories to appear truthful or even optimistic and so on.\n\n\n\n*(heck, I will admit, even I went through that period where I was extremely cynical. I am even cynical to this day to what I see on the media but not the extreme level that i was before. Like for example I find the the fidget spinner is just a toy and it only became popular probably through peer pressure)*\n\nHowever, this is where the healthy part of cynicism is taken to the extreme. \n\n**Distrust. Controversy. Yelling**\n\nThis is the kind of criticism that is so embedded in their heads that forms into a very personal bias. \n\nEven though everyone has a personal bias, a bias that is so personal to you or something that you want to hold on to, the more you are going to protect it and less likely to listen to what other people wish to say.\n\nPlus, this is bias that is reinforced by anger and fear\n\n *(because being under control of a higher power feels powerless and helpless and it is in our nature to never want to get that sense of personal freedom to be taken away)*\n\nThese are emotions that are often triggered when there is conflict or in worse cases, survival.\n\n*(when you are exposed to ideas or agendas that contradict your own, you go into a state of anxiety becuase it does not reinforce your own bias. Because these people feel anger and fear, that feeling of uneasiness can be uncomfortable so to protect yourself, you protect your bias and not listen to what the other agenda says)*\n\nThe more intense the emotions are, the more intense your body is pressuring to do whatever you can to survive and the more likely the fear is very real, no matter how irrational it is. \n\nSo instead your fear trying to make you alive and act, it turns against you\n\nAlso,  there is possibly another explanation.\n\nIt is called the Dunning-Kruger effect which states that peopl who think too highly of their own abilities are in reality the opposite *(meaning that they are possibly grandiose narcissists, or people like low IQs who think of themselves as incredibly smart. One example in particular is Donald Trump)* while people who often downplay their abilities are actually very good\n\nAnother explanation is social influence like children inherit social norms and values to what is accepted in that particular group, according to Bandura's Social Learning Theory . The first group that they experience socialising with is the family. If they live in a family that is very distrustful of the government, they are more likely to inherit those ideals *(I am saying more likely becuase you can never know whether the children do not like those ideals or are exposed to other ideals which they are in favour of)*. Same thing for other social groups like culture or social norms. If those things are common, people are more likely to believe and internalize those ideals out of conformity since humans are a social species. \n\nPlus, it is more likely that people are unconsciously willing to conform out of fear becuase controversial groups are deemed as loud and intolerable. These qualities provoke the idea that these people may be violent as well *(for example, the anti-war protests in the 1960s and 1970s often became violent as well. So was the protest in China in Tiamese Square in the 80s. Or the Black Lives Matter movement of late)*. It is possible that people are likely to unconsciously join out of fear to save their own skin\n\nI am not labelling these people as idiots becuase I do not know their story. My judgement tells me to call them idiots but in reality, I often see them as people who want to do something or want their voices to be heard but their execution is taken to the extreme and it's completely the wrong turn entirely\n\n\n_____________________\n\n**EDIT** - I just learned that [a recent study states that there is no link between conspiracy thinking and rejecting coincidence or unable to see intent](https://www.psychologicalscience.org/news/releases/coincidence-or-conspiracy-studies-investigate-conspiracist-thinking.html) so I guess the problem is a lot of pre-conceived bias and conspiracy theorists are unable to be self-aware of their conspiracy thinking and see the bigger picture or the intent behind the conspiracy? \n\nAgain, maybe they are actually out of intense emotions like fear and anger and willing to obey such thoughts and emotions quickly becuase they are linked to survival?",
        "created_utc": 1502012964,
        "upvote_ratio": ""
    },
    {
        "title": "Fighting/Supporting Unjust Laws",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rsviy/fightingsupporting_unjust_laws/",
        "text": "[removed]",
        "created_utc": 1501952540,
        "upvote_ratio": ""
    },
    {
        "title": "What are some useful psychology books suitable for a layperson?",
        "author": "dewarr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rruaz/what_are_some_useful_psychology_books_suitable/",
        "text": "I've already read a good smattering of these and enjoyed em. I'm thinking of stuff like Cialdini, positive psych, Duckworth's Grit, Thinking Fast and Slow, and stuff on cognitive biases in general. Any major topics/classics I've missed?",
        "created_utc": 1501940991,
        "upvote_ratio": ""
    },
    {
        "title": "In what communities are social intelligence and morality most valued?",
        "author": "theology_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rplil/in_what_communities_are_social_intelligence_and/",
        "text": "[removed]",
        "created_utc": 1501904180,
        "upvote_ratio": ""
    },
    {
        "title": "Are humans sometimes more accountable to other humans than they are to themselves? If so, why?",
        "author": "yankees994ever",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rpamx/are_humans_sometimes_more_accountable_to_other/",
        "text": "This could perhaps be something as simple as the fact that I'm willing to skip the gym in the morning if I'm working out by myself, but feel obligated to go if I'm meeting a friend. Or perhaps more significant life changes such as giving up drinking/smoking or engaging in other positive behaviors. \n\nWhy do people do this? Is there a psychological (or perhaps behavioral economics) term for this?",
        "created_utc": 1501900419,
        "upvote_ratio": ""
    },
    {
        "title": "In societies that are polygynous or polyandrous (but not both), what fraction of the relationships are actually nonmonogamous? If it's more than negligible, what happens to the \"excess\" men or women?",
        "author": "anschelsc",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rlj5o/in_societies_that_are_polygynous_or_polyandrous/",
        "text": "I know the FLDS and such kick a lot of boys out to maintain the gender imbalance, but that presumably doesn't work if the whole country does it. So what happens?",
        "created_utc": 1501863440,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | August 04, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rkoef/friday_freeforall_august_04_2017/",
        "text": "[removed]",
        "created_utc": 1501855556,
        "upvote_ratio": ""
    },
    {
        "title": "Can we explain gender identity the same way we explain religious identity?",
        "author": "bubbleberry1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rket3/can_we_explain_gender_identity_the_same_way_we/",
        "text": "This question is both theoretical (about identity formation in general) as well as practical (how to explain gender identity to people who are resistant to the notion). I teach social sciences but identity is not an area I know well. Sometimes students ask why we need more gender identities than just 'Male' and 'Female', or they conflate sex with gender. In a discussion on a separate topic one student protested to being labeled as a 'Christian' because she identified as a 'Catholic'. This got me thinking about whether religious identity is a way to broach the subject of gender identity in a more familiar way.\n\nSuperficially they share some similarities. Gender and religion are nearly universal to humans but are expressed in so many different ways across cultures. There may be some biological underpinnings for each, but we cannot reduce either type of identities to some biological fact. It would be laughable to say that our brains are hard wired to be 'Presbyterians' but students have no problem saying that babies are 'born male' (in the gender not sex meaning). We acknowledge and respect some types of personally-chosen and deeply-held identities, but then think that other types of identities are made up (or worse) and do not deserve recognition.\n\nWondering about the usefulness of this type of comparison but also where the analogy breaks down. And I'm also looking for some accessible readings on identity formation in general that I can read myself and assign for my class. Thanks!",
        "created_utc": 1501852750,
        "upvote_ratio": ""
    },
    {
        "title": "what's a ELI5 for what 'abstraction' is in sociology that anyone completely unfamiliar with any of this would understand?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rj4uc/whats_a_eli5_for_what_abstraction_is_in_sociology/",
        "text": "[removed]",
        "created_utc": 1501835144,
        "upvote_ratio": ""
    },
    {
        "title": "If we consider interest groups (social groups which share a common interest), is there a need for another concept of groups which act against their own collective interest?",
        "author": "-_Stitch_-",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rhnq4/if_we_consider_interest_groups_social_groups/",
        "text": "An interest group could be people who work at X job or in Y industry. They have a common role which has quantifiable interests in common with each other, and the benefits and costs of different policies can be measured in terms of things like job security, wages, workplace safety, and so on.\n\nAnother putative interest group is group A. Group A is an ideological group entirely in reaction to group B, some cultural group. Group A is not only a hate group, but their ideology about group B is false, and harm toward group B would amount to little actual benefit to A, and maybe even harm. Group A share interests, but it's entirely based on false ideology.\n\nI'm curious if it's a feature of the social sciences to distinguish between groups that have objective interests in common, and those that have subjective or even false interests in common. It's my slip of tongue to call groups like the latter \"identity groups\" when I try to call them \"interest groups\".\n\nMy assumption is that it's possible to have objective interests that contradict your subjective interests. That's probably a philosophical topic. My observation is that many individuals do seem to act against their interests. Rationalizing about smoking addiction could be one. My curiosity is if this scales up into group irrationality, and if this is an express topic in social science. I don't suspect it's the scope of social science to tell group A that they don't even understand themselves, but the theoretical construct of such a group may prove useful.\n\nI suspect this question is too theoretical to have a good answer, but I appreciate the forum to ask it.\n\nThank you! c:",
        "created_utc": 1501814926,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for masters programs - US or Europe, any idea where to research?",
        "author": "juliacakes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rdzgs/looking_for_masters_programs_us_or_europe_any/",
        "text": "[removed]",
        "created_utc": 1501781935,
        "upvote_ratio": ""
    },
    {
        "title": "What's the deal with Batman going camp every few years?",
        "author": "Flareprime",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6rbb5l/whats_the_deal_with_batman_going_camp_every_few/",
        "text": "[removed]",
        "created_utc": 1501754842,
        "upvote_ratio": ""
    },
    {
        "title": "Among different cultures, is the responsibility for carrying/passing down oral traditions gendered?",
        "author": "PmMeExistentialDread",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ra5tg/among_different_cultures_is_the_responsibility/",
        "text": "Having thought about it, I believe that in western culture women are primarily tasked with keeping oral tradition, whether it be family histories or folk songs. \"Miss Susy had a Steamboat\" and other playground rhymes come to mind as an example - I rarely remember hearing boys join in or even remember the words. ",
        "created_utc": 1501737124,
        "upvote_ratio": ""
    },
    {
        "title": "How to find a social research job during gap year?",
        "author": "Awkwardasturtle",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r99r6/how_to_find_a_social_research_job_during_gap_year/",
        "text": "[removed]",
        "created_utc": 1501726633,
        "upvote_ratio": ""
    },
    {
        "title": "What should I get my bachelors degree in?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r8uhc/what_should_i_get_my_bachelors_degree_in/",
        "text": "[removed]",
        "created_utc": 1501722152,
        "upvote_ratio": ""
    },
    {
        "title": "Was literary introspection lower in biblical times? Why was this?",
        "author": "wordboyhere",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r7a7y/was_literary_introspection_lower_in_biblical/",
        "text": "[In this TED Talk by neurologist Mariano Sigman](https://www.ted.com/talks/mariano_sigman_your_words_may_predict_your_future_mental_health/transcript), Sigman makes this grand claim based off of Julian Jayne's theory of conciousness: That the kind of first-person self-awareness we're used to now, was something that had to build itself up continuously over time in literature. Personally I think Jayne's theory is BS but Sigman's computational work finds a linear trend throughout the Bible, using an algorithm mapping words by their semantic neighborhood. He says at 7:14 in the video:\n\n&gt;[W]hat we did is we took all the books -- we just ordered them by time -- for each book we take the words and we project them to the space, and then we ask for each word how close it is to introspection, and we just average that. And then we ask whether, as time goes on and on, these books get closer, and closer and closer to the concept of introspection.\n\n&gt;And this is exactly what happens in the ancient Greek tradition. **So you can see that for the oldest books in the Homeric tradition, there is a small increase with books getting closer to introspection. But about four centuries before Christ, this starts ramping up very rapidly to an almost five-fold increase of books getting closer, and closer and closer to the concept of introspection.**\n\n&gt;So we just ran this same analysis on the Judeo-Christian tradition, and we got virtually the same pattern. Again, you see a small increase for the oldest books in the Old Testament, and then it increases much more rapidly in the new books of the New Testament. And then we get the peak of introspection in \"The Confessions of Saint Augustine,\" about four centuries after Christ. And this was very important, because Saint Augustine had been recognized by scholars, philologists, historians, as one of the founders of introspection. Actually, some believe him to be the father of modern psychology.\n\nWhy was the Bible written like this? Any good sources on this?\n\nHere is his study: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3449397/",
        "created_utc": 1501707463,
        "upvote_ratio": ""
    },
    {
        "title": "How would one from America study social science in mainland China?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r6mad/how_would_one_from_america_study_social_science/",
        "text": "[removed]",
        "created_utc": 1501701809,
        "upvote_ratio": ""
    },
    {
        "title": "Did Marguerite Mead make up stuff in her books or was she a good social scientist?",
        "author": "questioningTW",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r5jr3/did_marguerite_mead_make_up_stuff_in_her_books_or/",
        "text": "",
        "created_utc": 1501692984,
        "upvote_ratio": ""
    },
    {
        "title": "How People React to Unjust Laws",
        "author": "MadeInCanaduh",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r4sp8/how_people_react_to_unjust_laws/",
        "text": "[removed]",
        "created_utc": 1501686536,
        "upvote_ratio": ""
    },
    {
        "title": "Political science blogs by political scientists?",
        "author": "goingtobegreat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r4rby/political_science_blogs_by_political_scientists/",
        "text": "Does anyone know of any blogs written by political science professors? The only one I know is Tom Pepinsky's blog, which I enjoy. Project Syndicate and Political Violence at a Glance are also good and frequently have political scientists featured. Specifically, I would be interested in more comparative politics oriented blogs, but I'm not too picky if the quality is good.",
        "created_utc": 1501686204,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | August 02, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6r4dyh/theory_wednesday_august_02_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1501682775,
        "upvote_ratio": ""
    },
    {
        "title": "What are the strongest and weakest governorships in the United States?",
        "author": "Yankeehat2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qzo2c/what_are_the_strongest_and_weakest_governorships/",
        "text": "I read recently NJ had a very strong governorship, what are some other examples of strong and weak governorships (and why are they so strong or weak)?",
        "created_utc": 1501624992,
        "upvote_ratio": ""
    },
    {
        "title": "What is known about Romani culture and their relationship to Europe?",
        "author": "jokul",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qy3s6/what_is_known_about_romani_culture_and_their/",
        "text": "I have seen recently a large outcry about a video on Reddit where some people caught a Romani (alleged) thief. I read some comments and it seems like people tended to repeat statements like:\n\n* They refuse to use the free areas designated for them  \n* They refuse to let their children get an education  \n* Thievery is in their culture  \n* They love to swindle and litter  \n* They're ruthless opportunists  \n\nNow, I realize some of these are probably true out of circumstance. Their history in Europe is notoriously troubled and these are the types of statements which seem obviously biased.  \n\nEven more apparently balanced comments talk about this behavior being cultural and part of Romani resistance to native culture.  \n\nTo paraphrase Donald Rumsfeld, I don't know what we know. What are the primary causes of animosity between Europe and the Romani? What are the primary causes of the Romani's continued disconnect with the natives?  \n\nOn the one hand, I want to say \"Oh come on, they're all thieves?\" but at the same time, thievery being more culturally acceptable seems fairly normal throughout human history and it doesn't necessarily speak ill of that culture as a whole, after all, the Vikings were a culture who notably raided and pillaged to supplement their lifestyles, and historically many civilizations fueled themselves through conquest. So I don't want to rule out the idea that their culture is more open to thievery and grifting, but at the same time, it comes across as something clearly embedded in racism.\n\nWhat makes me more suspicious is that there never seems to be a Romani perspective. It's always the Europeans providing data about Romani behavior but - and this is probably due to a significant language barrier - I've never seen the Romani's side of the story.\n\n**TL;DR**:\n\n* How effective is Romani outreach by European states?  \n* If it is ineffective, why?  \n* If it is effective, why is it perceived as ineffective?  \n* What is actually known about Romani culture and what causes this clash between it and native European culture?  \n* Are there any Romani accounts of this relationship, how do they differ from native European accounts?  \n* Lastly, to what extent to the \"stats\" about Romani crime rate etc. actually have weight? How skeptical should we be of these \"stats\"?  ",
        "created_utc": 1501611137,
        "upvote_ratio": ""
    },
    {
        "title": "What factors increase the chance of war, and why do governments and leaders make the decision to go to war? What kinds of pretext's have governments made to justify war from ancient to modern history?",
        "author": "Gh0stthedirew0lf2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qvv3k/what_factors_increase_the_chance_of_war_and_why/",
        "text": "I've been thinking about this a lot because although i know factors like territorial disputes, competing geopolitical interests, rival ideologies, and religious and ethnic tensions can lead to war, they don't always do so. So i want to get a deeper understanding of why government throughout history have decided to go to war. Particular questions i had in mind were:\n\n. How much does it matter who the leader of a government is? \n\n. Are dictatorships more likely to go to war, and if so why is that? \n\n. How much does ideology matter? \n\n. What are the pretexts that makes a government think their decision is necessary and/or justified? Specific examples would be great. \n\n. Do you know of any good books or other resources i could use to further my understanding of why wars happen?",
        "created_utc": 1501590325,
        "upvote_ratio": ""
    },
    {
        "title": "What's the next stop after an introductory sociology course?",
        "author": "dewarr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qrqvu/whats_the_next_stop_after_an_introductory/",
        "text": "I don't study sociology (though I wish I did), but I have taught myself the basics of sociology thru introductory texts. I'd like to continue my self-directed education in sociology, but I'm not sure what's next! I don't want to get in over my head. Is there usually a specific course or courses that follow a 101 class?",
        "created_utc": 1501537932,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | July 31, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qom48/monday_reading_and_research_july_31_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1501509934,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for criticism of M.A.D.?",
        "author": "Pierre_Menard_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qlq3i/recommendations_for_criticism_of_mad/",
        "text": "Does anybody have any good book/paper recommendations for criticism of M.A.D., especially one that criticizes M.A.D. from different I.R. theory viewpoints?",
        "created_utc": 1501469724,
        "upvote_ratio": ""
    },
    {
        "title": "How can I become and advocate and educator for blockchain technology?",
        "author": "blockchain_bridge",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qljle/how_can_i_become_and_advocate_and_educator_for/",
        "text": "[removed]",
        "created_utc": 1501467512,
        "upvote_ratio": ""
    },
    {
        "title": "nobody knows what evidence is, what's the most reliable list or link of what counts of 'evidence' across the social sciences for everyone that is uneducated?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qkwn9/nobody_knows_what_evidence_is_whats_the_most/",
        "text": "[removed]",
        "created_utc": 1501459785,
        "upvote_ratio": ""
    },
    {
        "title": "Where does one start when trying to understand the socio-political climate of the middle east?",
        "author": "SpaceGhost1992",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qkrr0/where_does_one_start_when_trying_to_understand/",
        "text": "I'm trying to gain an understanding of the immensely complex nature of the middle east, and with the plethora of information that's out there, I don't really know where to start.. \n\nI'm interested in the relationships of countries like Palestine, India, Israel, Pakistan, etc. and why the occupation of Israel is so controversial. \n\nI'm also interested in how foreign countries like China, Russia, and the U.S. affected the region. \n\nDo I need to go all the way back to the Crusades, or further? Is there any literature on the subject? I almost feel like I don't even know what to ask, so apologies before hand, if any of this is vague and too general.",
        "created_utc": 1501458135,
        "upvote_ratio": ""
    },
    {
        "title": "Do changing social attitudes towards transsexual people have an impact on the portion of the population that identifies as homosexual?",
        "author": "sha_nagba_imuru",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qjmym/do_changing_social_attitudes_towards_transsexual/",
        "text": "In a given social environment where it's more socially acceptable to identify as homosexual than as transsexual, I might expect that the share of the population that identifies as homosexual could take a slight dip as acceptance of trans people rises.\n\nThat is, some portion of people who identify as cis homosexuals may start identifying as trans heterosexuals as that becomes a socially/legally viable option. (Along with a presumably smaller portion of cis heterosexuals switching to identifying as trans homosexuals.)\n\nIs there any data to confirm or deny this model?",
        "created_utc": 1501446279,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"Social Anorexia\" a thing?",
        "author": "Frigorifico",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qfqc8/is_social_anorexia_a_thing/",
        "text": "I obviously noted this in myself. When I have had a great time with friends I start avoiding them, if they invite me out again I don't go, if I see someone I may get along with I become this cold robot.\n\nI once had a great talk with a friend and we both laughed, and when she left I noted that I had pressed mi fingers so hard in my hand I was bleeding in deep cuts made with my finger nails.\n\nI am not socially awkward, I am not shy, I know how to talk to people and give good impressions, but it terrifies me. I hate being alone in the weekends, but I sit every chance to meet new people, I avoid people I get along with.\n\nThen I saw a movie about anorexia and it resonated with me somehow, it left me thinking how they know it hurts them but they do it anyway, even though it would be so easy to do the right thing, but somehow is not.\n\nSo, is social anorexia a thing?",
        "created_utc": 1501391945,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent does social media affect the verbal communication of teenagers?",
        "author": "Flurex",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6qatvx/to_what_extent_does_social_media_affect_the/",
        "text": "",
        "created_utc": 1501333115,
        "upvote_ratio": ""
    }
]