[
    {
        "title": "Has anyone fisked \"human biodiversity\" stances, at a level geared towards the layperson?",
        "author": "dewarr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mrrbs/has_anyone_fisked_human_biodiversity_stances_at_a/",
        "text": "Aka \"scientific\" racism. I'm unfortunately seeing more of it these days, and I'd like to know more about why it's wrong. However, I am not a geneticist, and simply don't have the basis to know all the reasons why they're wrong.",
        "created_utc": 1499834927,
        "upvote_ratio": ""
    },
    {
        "title": "\"Original right\" vs. \"Alt-right\" and labeling movements.",
        "author": "getsangryatsnails",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mp3e5/original_right_vs_altright_and_labeling_movements/",
        "text": "[removed]",
        "created_utc": 1499805974,
        "upvote_ratio": ""
    },
    {
        "title": "Has this been studied?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mo9pc/has_this_been_studied/",
        "text": "[removed]",
        "created_utc": 1499798654,
        "upvote_ratio": ""
    },
    {
        "title": "Did African slaves have surnames before they were brought over?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mn850/did_african_slaves_have_surnames_before_they_were/",
        "text": "[deleted]",
        "created_utc": 1499789510,
        "upvote_ratio": ""
    },
    {
        "title": "( culture me) - what's the most recent kind of culture ranking of various places? and has anyone recently made a cultural 'map' with values you would look at when studying a society?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mkpyc/culture_me_whats_the_most_recent_kind_of_culture/",
        "text": "[removed]",
        "created_utc": 1499758421,
        "upvote_ratio": ""
    },
    {
        "title": "Cults &amp; Secret Societies",
        "author": "IceyHawt1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mjtkp/cults_secret_societies/",
        "text": "[removed]",
        "created_utc": 1499745714,
        "upvote_ratio": ""
    },
    {
        "title": "How is Canada's universal healthcare system financed? Would it be a good model for universal healthcare in the US? If no, which financing system would be a good model?",
        "author": "Moontouch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6miyej/how_is_canadas_universal_healthcare_system/",
        "text": "",
        "created_utc": 1499735880,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't American English significantly more different from that spoken in England?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mhoyq/why_isnt_american_english_significantly_more/",
        "text": "[deleted]",
        "created_utc": 1499723037,
        "upvote_ratio": ""
    },
    {
        "title": "Do people actually tend to become more conservative as they get older?",
        "author": "SmytheOrdo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mg4rg/do_people_actually_tend_to_become_more/",
        "text": "Or is it more a cultural matter? That is, a matter of changing mores around a person.",
        "created_utc": 1499709307,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | July 10, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6menb2/monday_reading_and_research_july_10_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1499695541,
        "upvote_ratio": ""
    },
    {
        "title": "What is the support for each party among different age, social and ethnic groups in Sweden?",
        "author": "NordicSocialDemocrat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mctt3/what_is_the_support_for_each_party_among/",
        "text": "Would be very interested to hear. You guys will have an election soon.",
        "created_utc": 1499669453,
        "upvote_ratio": ""
    },
    {
        "title": "Do you believe people are born gay and/or choose to be gay?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mcmsh/do_you_believe_people_are_born_gay_andor_choose/",
        "text": "[deleted]",
        "created_utc": 1499666481,
        "upvote_ratio": ""
    },
    {
        "title": "( hey, finding current values &amp; way of life of sweden, australia, or switzerland )",
        "author": "makealldigital",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mbmlm/hey_finding_current_values_way_of_life_of_sweden/",
        "text": "[removed]",
        "created_utc": 1499653104,
        "upvote_ratio": ""
    },
    {
        "title": "( hey, finding current values &amp; way of life of sweden, australia, or switzerland )",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6mbbk1/hey_finding_current_values_way_of_life_of_sweden/",
        "text": "[removed]",
        "created_utc": 1499649418,
        "upvote_ratio": ""
    },
    {
        "title": "( hey, finding the current values &amp; way of life of places )",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6madsj/hey_finding_the_current_values_way_of_life_of/",
        "text": "[removed]",
        "created_utc": 1499638714,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for decision making models?",
        "author": "ScienceFan83",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m9tw9/recommendations_for_decision_making_models/",
        "text": "Hello folks!\n\nTL:DR - I'm interested in decision making models that dive into how people learn about a topic as they attempt to change their behavior/purchases. That is, how do they compare their options, weigh risks of engaging, and come to a decision to make changes/purchases. I'd love to hear about other academic decision making models. Any suggestions?\n\nLong version:\nI'm curious about models of decision making and behavior changes. Often, I see overlaps between the way psychology and marketing folks talk about behavior change (which is not surprising).\n\nThe Transtheoretical Model (TTM) of behavior change (summarized here http://www.2legsgood.com/tag/transtheoretical-model/) focuses on health behaviors. We go from a state of not knowing that our behavior is unhealthy to acknowledging it, planning to change it, acting on it, then maintaining it. We sometimes get stuck between stages for a while, or go backwards or forwards too.\n\nIn marketing, on the other hand, they consider a shorter term purchasing decision. Bugday, Sener, and Babaogul (2016) describe five, which feel a somewhat similar to the TTM (see page five here: http://betadergi.com/ttad/yonetim/icerik/makaleler/106-published.pdf). First you recognize a need, you seek out information, you weigh alternatives, you purchase, then you evaluate your purchase. \n\nI feel like it's two different lenses for talking about a very similar process - how we decide to change \n(health behavior, purchase behavior, or whatever behavior). \n\nIs anyone familiar with other models that break it down in similar ways? I'd love to read more about this topic\n",
        "created_utc": 1499632886,
        "upvote_ratio": ""
    },
    {
        "title": "Progressivism - Thoughts",
        "author": "RondaS1969",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m85c8/progressivism_thoughts/",
        "text": "[removed]",
        "created_utc": 1499615551,
        "upvote_ratio": ""
    },
    {
        "title": "The importance of government in American Culture",
        "author": "batman7216",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m859b/the_importance_of_government_in_american_culture/",
        "text": "Hi All!!\n\nAbout 4 or 5 years ago, I was assigned a reading that really stuck with me. The problem: I can't find it or remember the author and it's driving me crazy! And now I can't remember if this is a real theory or I've just created nonsense in my head.\n\nThe idea is that one of the major differences between the cultural identity of America and almost every other country is that America has only had one government. The creation of the country coincided with the creation of the government, which has never been overthrown or replaced. \n\nRussia, for example, has had a string of different governments (Czars, Soviet Union, etc.). Because of this, Russian identity isn't so reliant on or attached to what their government does, because Russian identity has existed throughout the all of this \"changing of the guards.\"\n\nThe point is that Americans' perceptions of their cultural identity are tied to their perceptions of their government, to a much greater degree than in other countries.\n\nAny help would be very much appreciated!!!!",
        "created_utc": 1499615518,
        "upvote_ratio": ""
    },
    {
        "title": "Would an intro to sociology class have less writing or be easier than an intro to cultural anthropology class?",
        "author": "Gunuui",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m7s51/would_an_intro_to_sociology_class_have_less/",
        "text": "[removed]",
        "created_utc": 1499611403,
        "upvote_ratio": ""
    },
    {
        "title": "Math and science vs social science and humanities.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m7s22/math_and_science_vs_social_science_and_humanities/",
        "text": "[removed]",
        "created_utc": 1499611377,
        "upvote_ratio": ""
    },
    {
        "title": "Need help finding a recent article about political consensus as opposed to political centrism",
        "author": "ab7af",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m5dn7/need_help_finding_a_recent_article_about/",
        "text": "Sometime in the last couple weeks, I saw on MSNBC a print journalist (or opinion writer?) discussing his idea that on many issues there is a political *consensus* that is not the political *center.* He gave at least two examples, drawn from the same poll if I remember correctly. A majority of Americans favor legalization of recreational cannabis, and a majority favor mass deportation of undocumented immigrants; neither of these are so-called centrist positions. He was on TV to discuss an article he wrote about there being a consensus that isn't the center.\n\nI'm trying to find his article, or his name, or at least the poll he was referencing. Google has not been helpful, so I'm hoping that someone here happened to read the article, or saw the same segment on MSNBC. I know this is a long shot but any help would be appreciated.",
        "created_utc": 1499571449,
        "upvote_ratio": ""
    },
    {
        "title": "Do pedophiles have occupational preferences?",
        "author": "scratchedhead",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m4gsg/do_pedophiles_have_occupational_preferences/",
        "text": "Or are they more attention-grabbing when working for the Catholic church ",
        "created_utc": 1499559530,
        "upvote_ratio": ""
    },
    {
        "title": "Proper understanding of racism?",
        "author": "mushroompizza1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6m3989/proper_understanding_of_racism/",
        "text": "I've been told most of my life racism is akin to racial prejudice but recently I've been told racism is more akin to white supremacy because racism involves power systems thus whites or others than benefit from a racist system are the only ones in a society which can be racist. \n\nIf this is true, what would white supremacist non-whites be called? What would ethnic prejudices between nonwhites be referred to as? \n\nAm I missing anything in my understanding? ",
        "created_utc": 1499545643,
        "upvote_ratio": ""
    },
    {
        "title": "What causes income inequality?",
        "author": "sn0rlax_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lyv0p/what_causes_income_inequality/",
        "text": "",
        "created_utc": 1499485902,
        "upvote_ratio": ""
    },
    {
        "title": "Idiot or Thug?",
        "author": "Newtonswig",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lw1p4/idiot_or_thug/",
        "text": "[removed]",
        "created_utc": 1499455721,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | July 07, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ltuxn/friday_freeforall_july_07_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1499436359,
        "upvote_ratio": ""
    },
    {
        "title": "Can we categorize the increasing Chinese activity in Africa as \"exploitation\"? If so, to what extent?",
        "author": "alexinternational",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lsrby/can_we_categorize_the_increasing_chinese_activity/",
        "text": "[removed]",
        "created_utc": 1499422759,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the ideology of US Supreme Court judges more of an issue than judges in other countries? (xpost /askhistorians)",
        "author": "tiredstars",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lp6oy/why_is_the_ideology_of_us_supreme_court_judges/",
        "text": "The balance between \"liberal\" and \"conservative\" judges in the US Supreme Court is regularly discussed and considered very important. However I've rarely heard this sort of discussion with regards to the upper courts of other countries (certainly not the UK, where I live).\n\nWhy is this? Or am I mistaken about it being a rare issue in other countries?",
        "created_utc": 1499378307,
        "upvote_ratio": ""
    },
    {
        "title": "What is happening with the demographic transition in Africa?",
        "author": "lurker093287h",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lo5sv/what_is_happening_with_the_demographic_transition/",
        "text": "I recently came across [this](https://www.unz.com/isteve/u-n-world-population-prospects-2017-the-coming-sub-saharan-tsunami/) alarmist sounding blog, which lead me to more official sources like from [this year](https://www.un.org/development/desa/en/news/population/world-population-prospects-2017.html),  with [this](https://esa.un.org/unpd/wpp/Graphs/Probabilistic/POP/TOT/)  and [this](https://www.scientificamerican.com/article/world-population-will-soar-higher-than-predicted/). \n\nThe new world population estimates for the world by 2100\n&gt;A few years ago leading calculations had global population peaking at nine billion by 2070 and then easing to 8.4 billion by 2100. Currently it stands at 7.2 billion. Recently the U.N. revised these numbers steeply upward: the population is now expected to rise to 9.6 billion by 2050 and continue to 10.9 billion by 2100 (black line, below). What caused this drastic revision? Almost all the increase comes from Africa (pink line). Earlier models “had anticipated that fertility rates in Africa would drop quickly, but they haven’t,”\n\nI found [this](https://www.newsecuritybeat.org/2013/08/demographic-transition-stalled-sub-saharan-africa/) that seems to suggest that there has been a slow decline in fertility in some major african countries and this is driving the projected population growth. It also talks about the education of women and family planning etc, but iirc this seems to be only a part of the 'demographic transition' of falling fertility that the closest corrilation is between [infant/child mortality rates and death rates](https://ourworldindata.org/fertility/) generally. \n&gt;The causal link between infant survival and fertility is established in both directions: Firstly, increasing infant survival reduces the parents’ demand for children. And secondly, a decreasing fertility allows the parents to devote more attention and resources to their children.\n\nCan anyone point me in the direction of something that might explain why this is happening, why the numbers are different and whether  these high fertility african countries having a slower demographic transition when the time between decreasing infant mortality and reduced fertility seems to have been getting less over time. ",
        "created_utc": 1499369312,
        "upvote_ratio": ""
    },
    {
        "title": "How do social scientists cope with media bias?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lktps/how_do_social_scientists_cope_with_media_bias/",
        "text": "As a student who studies science *(psychology, to be specific)* and someone who likes to keep up to date, I am often aware that I have to take whatever I see on the media, even the most trusted news outlets *(like CNN or BBC or BusinessInsider)* to take everything that I read with a pinch of salt becuase of potential misinformation, agenda bias, sensationalist articles, especially when it comes to subjects that I am ignorant of *(like history, sociology and so on)* but often do not manage to have enough time to fact-check everything because it takes time.\n\nHow do social scientists cope when there is potential bias or misinformation on what they read on the news?",
        "created_utc": 1499335899,
        "upvote_ratio": ""
    },
    {
        "title": "How effective would modern day advertising be on people from the past?",
        "author": "ostensiblyzero",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ljy3z/how_effective_would_modern_day_advertising_be_on/",
        "text": "I'm being a little vague on purpose (plus if I'm being honest, I'm a little high), so these are two other ways I was thinking of asking this question.  \n  What aspects of advertising today are separate from the social climate in which they were developed?  \n  To what degree is advertising built up in a sort of social consciousness, and to what degree is it separate?",
        "created_utc": 1499321985,
        "upvote_ratio": ""
    },
    {
        "title": "Why is humanity more productive during war rather than peace?",
        "author": "Immortal_Scholar",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ljlmq/why_is_humanity_more_productive_during_war_rather/",
        "text": "",
        "created_utc": 1499317190,
        "upvote_ratio": ""
    },
    {
        "title": "Are there scholarly and notable predictions on the future of student debt in the United States? (Reposting since it didn't get an answer before)",
        "author": "rawlsianreddit",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lix9t/are_there_scholarly_and_notable_predictions_on/",
        "text": "I'm wondering if there are any predictions made by the relevant scholars as to what condition the student debt situation in the United States will look like in the future (short-term or long-term). By \"condition\" I mean the role of government in handling the debt, the continuing affects of student debt on economic growth and/or on the well-being of those who hold this debt.\n\nFor instance, do any scholars believe that the situation will simply continue in a linear fashion? Or do some believe that there will be substantial changes as the total debt incurred by students continues to grow?\n\nThanks in advance!\n\n",
        "created_utc": 1499309107,
        "upvote_ratio": ""
    },
    {
        "title": "Essential readings in Criminology?",
        "author": "analyticalmess",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lgq9s/essential_readings_in_criminology/",
        "text": "Hi all,\n\nI will be applying for Criminology Ph.D. programs for the 2018 year. My background is in psychology and biology. I am interested in the biological bases of crime, similar to Adrian Raine's work. \n\nSince I am not coming in with an undergraduate or graduate degree in Criminology (BA in Psychology and Biology, MS in Experimental Psychology), I am wondering what publications (books, journal articles) I should read to (1) have a good, basic understanding of the essential topics/theories and (2) ensure this is the right path for me. \n\nThank you!",
        "created_utc": 1499286463,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | July 05, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6le827/theory_wednesday_july_05_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1499263582,
        "upvote_ratio": ""
    },
    {
        "title": "Does learned helplessness on a group scale happen? Is it possible?",
        "author": "ugop",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ld7rv/does_learned_helplessness_on_a_group_scale_happen/",
        "text": "Learned helplessness is when a person feels that they are powerless based on severe past trauma or multiple experiences of failure.\n\nCan it happen in a group scale or is it purely an individual phenomenon?",
        "created_utc": 1499250682,
        "upvote_ratio": ""
    },
    {
        "title": "What does the existing literature say about the effectiveness of job training programs?",
        "author": "ImAGiraffe123",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lbyml/what_does_the_existing_literature_say_about_the/",
        "text": "",
        "created_utc": 1499230699,
        "upvote_ratio": ""
    },
    {
        "title": "Beat Poets -&gt; Hippies/Counterculture, fact or fiction? (xpost /r/askphilosophy)",
        "author": "CrownedCaribou",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lbsc9/beat_poets_hippiescounterculture_fact_or_fiction/",
        "text": "Original post for conversations happening there: https://www.reddit.com/r/askphilosophy/comments/6lbg3e/beat_poets_hippiescounterculture_fact_or_fiction/\n\nI see the elements of the beat poets in the hippy culture in their detachment from mainstream, but the counterculture itself was fundamentally counter to that defining detachment. I've only read a little Kerouac and Burroughs, so my experience is limited, but it seems very different from the partially concrete aims and advocacy that defines the counterculture. Additionally, the counterculture came right out of the universities and university culture(citation needed), so they must have been at least in part influenced by their professors. So who was teaching them political philosophy? I really doubt it was the beat poets. In some preliminary research I've been coming up on a clique of some pretty cross-practice scientists- Norbert Wiener- founder of cybernetics/feedback systems, Margaret Mead- popular Anthropologist trying to understand issues of turmoil ridden adolescence the west has seen, Gregory Bateson (also cybernetics and other theories, wife of Mead). Erich Fromm is from the Frankfurt School. Source: http://news.stanford.edu/news/2014/february/turner-democratic-surround-020314.html\n\nI've been looking at this list to see notable professors at and around the start of the counterculture: https://en.wikipedia.org/wiki/List_of_University_of_California,_Berkeley_faculty\n\nI see Thomas Kuhn stand out there, but I'm not sure that's related, but he has some fascinating work on the nature of scientific revolutions that is I think tough to rule out entirely. And it doesn't look like he's escaped entirely the notice of others: https://www.google.com/search?q=thomas+kuhn+countercul.ture&amp;ie=utf-8&amp;oe=utf-8#q=thomas+kuhn+counterculture\n\nStill, his work doesn't seem like it fits as a leader. Same with this one, though seems an interesting man: https://en.wikipedia.org/wiki/Erving_Goffman\n\nAnyway, TLDR, I'm trying to better understand the roots of the counterculture, because I think it is very relevant today. The students raised in that environment now have a generation of adult children running about the world, and I'm not sure the counterculture has been fully unpacked to my satisfaction. The beat poets do seem important in exploring the dregs of the inequalities in 50s America, but don't really seem to have had a deep enough philosophical understandings to do something about it. Someone else must have also been major influencers.\n",
        "created_utc": 1499228211,
        "upvote_ratio": ""
    },
    {
        "title": "I want to write a screenplay centered around psychology and social science. Which scientific concepts could, in your opinion, actually carry a movie?",
        "author": "JurijFedorov",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6lbatx/i_want_to_write_a_screenplay_centered_around/",
        "text": "[removed]",
        "created_utc": 1499221534,
        "upvote_ratio": ""
    },
    {
        "title": "What will happen when the Student Debt Bubble bursts?",
        "author": "sn0rlax_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6l9zfa/what_will_happen_when_the_student_debt_bubble/",
        "text": "What does that term mean? What will be the economic impacts of that?\n\nWill college get cheaper or more expensive?",
        "created_utc": 1499204976,
        "upvote_ratio": ""
    },
    {
        "title": "What is the relation between climate temperature and psychological depression?",
        "author": "ceramicfiver",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6l8f5k/what_is_the_relation_between_climate_temperature/",
        "text": "I'm well aware of Seasonal Affective Disorder and how the sun plays a huge role in psychological depression.\n\nBut what about climate temperature?\n\nThe only article I found was this that says increasing the temperature could help with depression.  \nhttps://uanews.arizona.edu/story/turn-up-the-heat-to-turn-down-depression\n\nDoes anyone know anything else?\n\nThis is personal for me, as I suffer from seasonal affective disorder. But it seems for me that temperature plays a bigger role than sunlight.\n\nFor example I'm living in Berlin right now. In the winter I was very depressed but once hot summer weather got here my depression went away. This past week however has been colder (sweater weather) despite it being July with lots of sunshine, and my depression has flared up.\n\nI'm thinking of moving to a hot tropical climate for this reason.\n\nCan anyone shed any light on this? (Pardon the pun)\n\nThank you very much, I appreciate your time\n\n",
        "created_utc": 1499189184,
        "upvote_ratio": ""
    },
    {
        "title": "Is there consensus on why black americans have disproportionate crime rates?",
        "author": "ImNotFionaApple",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6l0wjk/is_there_consensus_on_why_black_americans_have/",
        "text": "[removed]",
        "created_utc": 1499099056,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | July 03, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6l02sr/monday_reading_and_research_july_03_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1499090731,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best way to attain basic understanding of social sciences without taking it up as an academic study?",
        "author": "-THE_BIG_BOSS-",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kzl03/whats_the_best_way_to_attain_basic_understanding/",
        "text": "I've been fascinated by snippets of social science through politics, shows like The Wire, concepts in film and literature, etcetera. But I've never taken social science/humanity subjects for A level, like most of my friends have. I'm reading through Bourdieu's Forms of Capital essay and I was wondering if there's some sort of recommended reading list, or a social science 101 rundown with topics. Sorry if wrong subreddit.",
        "created_utc": 1499084722,
        "upvote_ratio": ""
    },
    {
        "title": "What are the main differences between structuralism and post-structuralism?",
        "author": "kiddiesad",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kzcvb/what_are_the_main_differences_between/",
        "text": "I'm trying to combine structuralist theory (Durkheim's theory on integration) with a post-structuralist concept (Self governance, from Foucault).\n\nSo I thought I should ask you (in addition to my reading, of course): what are the main differences and challenges when trying to combine concepts from structuralist and post-structuralist theory?",
        "created_utc": 1499081531,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some cultures value strict gender roles over others?",
        "author": "VeronicaNoir",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kx6sc/why_do_some_cultures_value_strict_gender_roles/",
        "text": "For instance why do more liberal societies think gender roles are ridiculous and more conservative societies think men and women have their bound roles?  Also how many exceptions to the rule are there?",
        "created_utc": 1499048277,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best age of majority? Or is it cultural?",
        "author": "justinismyfavorite",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kx6op/what_is_the_best_age_of_majority_or_is_it_cultural/",
        "text": "What is the best mixture of socialization and biology for age majority? For example I doubt 7 or 45 is not good for age of majority.  ",
        "created_utc": 1499048235,
        "upvote_ratio": ""
    },
    {
        "title": "Are there scholarly and notable predictions on the future of student debt in the United States?",
        "author": "rawlsianreddit",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kwsh2/are_there_scholarly_and_notable_predictions_on/",
        "text": "I'm wondering if there are any predictions made by the relevant scholars as to what condition the student debt situation in the United States will look like in the future (short-term or long-term). By \"condition\" I mean the role of government in handling the debt, the continuing affects of student debt on economic growth and/or on the well-being of those who hold this debt. \n\nFor instance, do any scholars believe that the situation will simply continue in a linear fashion? Or do some believe that there will be substantial changes as the total debt incurred by students continues to grow?\n\nThanks in advance!",
        "created_utc": 1499043146,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any studies that show capitalism is the best economic policy to incite innovation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kulo1/are_there_any_studies_that_show_capitalism_is_the/",
        "text": "[deleted]",
        "created_utc": 1499018389,
        "upvote_ratio": ""
    },
    {
        "title": "What portion of patients are prescribed psychoactive drugs to treat mental illness without fully understanding the potential side effects?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ku4w8/what_portion_of_patients_are_prescribed/",
        "text": "[removed]",
        "created_utc": 1499013181,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a relationship between prostitution and female infanticide? In areas where prostitution exists, are female infanticide rates lower?",
        "author": "McKennaJames",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ktr5w/is_there_a_relationship_between_prostitution_and/",
        "text": "",
        "created_utc": 1499008894,
        "upvote_ratio": ""
    },
    {
        "title": "Difference between geography and earth science?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ktgwv/difference_between_geography_and_earth_science/",
        "text": "[removed]",
        "created_utc": 1499005370,
        "upvote_ratio": ""
    },
    {
        "title": "What are your must-read books concerning geo-economics?",
        "author": "ElBaki",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kq7su/what_are_your_mustread_books_concerning/",
        "text": "It's a field that I am rather curious about but have not been able to delve into during University. I have now graduated and have plenty of time, so please post your suggestions.\n\nThank you in advance.",
        "created_utc": 1498952056,
        "upvote_ratio": ""
    },
    {
        "title": "Why do minorities frequently vote for left-leaning parties while many minorities also hold personal views that align closer with right-leaning parties?",
        "author": "Xxxn00bpwnR69xxX",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kpt6c/why_do_minorities_frequently_vote_for_leftleaning/",
        "text": "For example, every single African American person I know voted Democrat. However, the only African American I know that expressed support for same-sex marriage was himself homosexual.",
        "created_utc": 1498947093,
        "upvote_ratio": ""
    },
    {
        "title": "Why was Harry Potter so successful?",
        "author": "Moreh",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kpqj7/why_was_harry_potter_so_successful/",
        "text": "[removed]",
        "created_utc": 1498946237,
        "upvote_ratio": ""
    },
    {
        "title": "Is there evidence that fears of increasing automation, its potential political upheaval and calls for universal income have had effects on investment decisions in the developed world?",
        "author": "meoxu8",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kndcy/is_there_evidence_that_fears_of_increasing/",
        "text": "As in, people are saving and investing less for the long term because they fear there could be major political change, expropriation of property and wealth and so on?",
        "created_utc": 1498920575,
        "upvote_ratio": ""
    },
    {
        "title": "The role of skill certifications in social science research positions?",
        "author": "onejiveassturkey",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kmfxj/the_role_of_skill_certifications_in_social/",
        "text": "This is a bit of a meta question here but I'm a graduating masters student looking to enter the field of sustainable development, which often involves positions of overlapping research, policy, and projects. My education has really stressed the importance of qualitative methodologies: focus groups, semi-structured interviews, transects, direct observational methods, etc. However, I recognize a need to develop more of a capacity to analyze data quantitatively, though I don't think I need to be a data scientist to get a job doing social science research that requires quant. I'm wondering from your collective experiences in and out of academia: if I audit some online course and get the tangible skill of managing data and doing regressions in R, do I need to have some certification to back it up? Or is that not important if the skill set is offered?",
        "created_utc": 1498907462,
        "upvote_ratio": ""
    },
    {
        "title": "What motivates corruption?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kmdx3/what_motivates_corruption/",
        "text": "I know that this is a stupid question but I often wonder why people in high positions of power and influence become corrupt\n\nIs it just because the amount of power that they have, they are motivated by their own darker side of the mind *(the shadow as Jung called it)* to use it for their own selfish interests or it could be something else?",
        "created_utc": 1498906394,
        "upvote_ratio": ""
    },
    {
        "title": "What's the current take on Morton Fried's *Evolution of Political Society*?",
        "author": "Ienpw_III",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kjqq3/whats_the_current_take_on_morton_frieds_evolution/",
        "text": "I've read this book but it's old -- what's been written on the subject since?",
        "created_utc": 1498866477,
        "upvote_ratio": ""
    },
    {
        "title": "What are the key differences between a communist dictatorship and a facist one?",
        "author": "daaaaaaanDragon99",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kiepn/what_are_the_key_differences_between_a_communist/",
        "text": "",
        "created_utc": 1498852807,
        "upvote_ratio": ""
    },
    {
        "title": "Can we test the effects of patriarchy on behavior in a laboratory setting?",
        "author": "ObviousZipper",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6khg7v/can_we_test_the_effects_of_patriarchy_on_behavior/",
        "text": "I've had numerous discussions recently in which the issue came up of whether or not someone does something because of patriarchy, or whether they would do it anyways and are not primarily motivated by systemic gender inequality.  For example, whether or not sexual preference is the result of sexist social conditioning or is an innate physiological characteristic.\n\nI generally hold the opinion that we should be able to investigate this phenomenon by creating an experiment where we either increase or lessen the influence of patriarchy on the participants, and measure how much that change in patriarchy affects their decision-making.  However, many of the activists with whom I've spoken hold the position that even though patriarchy affects phenomena that can be statistically evaluated, it itself cannot be artificially manipulated in a social psychology experiment.\n\nSo what I'd like to know is: can we create a experimentally falsifiable hypothesis by which to determine how exposure to patriarchy affects human behavior?",
        "created_utc": 1498844165,
        "upvote_ratio": ""
    },
    {
        "title": "Do larger chest tattoos correlate with bi-polar?",
        "author": "mrhappy2563",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kguc0/do_larger_chest_tattoos_correlate_with_bipolar/",
        "text": "[removed]",
        "created_utc": 1498838572,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | June 30, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kg4d6/friday_freeforall_june_30_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1498831571,
        "upvote_ratio": ""
    },
    {
        "title": "Are Online Interactions different to face to face?",
        "author": "NottinghamDF",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6kbchf/are_online_interactions_different_to_face_to_face/",
        "text": "[removed]",
        "created_utc": 1498770238,
        "upvote_ratio": ""
    },
    {
        "title": "I've heard \"taboo\" or \"illegal\" people (like Mafia, Yakuza) tend to keep the traditional culture, since they are separated from society. Is that true?",
        "author": "Yoshiciv",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k7u5r/ive_heard_taboo_or_illegal_people_like_mafia/",
        "text": "",
        "created_utc": 1498737399,
        "upvote_ratio": ""
    },
    {
        "title": "Other than tribal mentality what is it about human beings that cause us to tie our identity to concepts like race or religion?",
        "author": "Chronos96",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k7bzs/other_than_tribal_mentality_what_is_it_about/",
        "text": "",
        "created_utc": 1498730096,
        "upvote_ratio": ""
    },
    {
        "title": "Cognitive psychology textbook recommendations for judgment and decision making?",
        "author": "ChiefWilliam",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k4ydx/cognitive_psychology_textbook_recommendations_for/",
        "text": "Over the past three years, I have gotten REALLY into social psychology and will be applying to social psych PhD programs in the fall. I have always had an interest in judgment and decision making, attitudes/lay concepts, and \"basic\" research, but I always stayed within the social psychology literature because I was, frankly, afraid of cognitive psychology. \n\nI am not particularly gifted in mathematics and I always associated cognitive psychology with mathematical psychology and more advanced mathematical modeling, so I stayed away. However, recently, I attended an interdisciplinary conference and attended several talks given by cognitive psychologists and cognitive scientists talking about judgement and decision making research they are doing. I now feel like I have made a huge mistake. I still prefer social psychology, but I deeply regret distancing myself from cognitive psychology. I really gained a new appreciation for cognitive psychology and memory/attention research. \n\nBecause of this, I was hoping to get some textbook reccomendations for intro cognitive psych books on judgement and decision making and lay concept structure/categorization. I am going to be a senior in psychology and am a fairly advanced student - I don't read a lot of cognitive literature but I frequently read social psych articles and am working on three of my own independant projects in social psych - so an intro book geared towards more advanced students would be appreciated. \n\nTL;DR Advanced undergrad in social psychology with no experience in cognitive psychology looking for textbook reccomendations on judgement and decision making and concepts/categorization.",
        "created_utc": 1498697557,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any good popular books on psychology?",
        "author": "dewarr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k2yui/are_there_any_good_popular_books_on_psychology/",
        "text": "EDIT: I meant sociology books, not psychology!\n\nWith some chaff-sorting, there are some very good books on all kinds of science, for the lay audience \n\nIs there anything of the sort for sociology? I've read an introductory text, loved it, but haven't been able to get my hands on another at an acessible price. I'm hopeful that a popular book might be easier to get my hands on.",
        "created_utc": 1498678232,
        "upvote_ratio": ""
    },
    {
        "title": "Why aren't people more concerned about automation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k2e0j/why_arent_people_more_concerned_about_automation/",
        "text": "[removed]",
        "created_utc": 1498673235,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta]How did you all decide which field of social science to specialise on?",
        "author": "namesnotrequired",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k1llw/metahow_did_you_all_decide_which_field_of_social/",
        "text": "[removed]",
        "created_utc": 1498666502,
        "upvote_ratio": ""
    },
    {
        "title": "Does there exist a system for mixed member proportional representation that doesn't rely on parties to work?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k14l4/does_there_exist_a_system_for_mixed_member/",
        "text": "[deleted]",
        "created_utc": 1498662329,
        "upvote_ratio": ""
    },
    {
        "title": "Why did traditional British food have such a small impact on world cussing despite the size of their empire?",
        "author": "stupidrobots",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k0xcz/why_did_traditional_british_food_have_such_a/",
        "text": "England owned half of the world it seems but aside from fish and chips (which really isn't unique to Britain) and pies, I can't think of many food items that are widely available. Chinese, Indian, French, Mexican and German foods (or regional variants thereof) can be found in every major city on earth. Why is British food so uncommon compared to the size of its influence?",
        "created_utc": 1498660482,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | June 28, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k0qnq/theory_wednesday_june_28_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1498658774,
        "upvote_ratio": ""
    },
    {
        "title": "Is social eating dying out?",
        "author": "m0nk3ytal3",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6k0opv/is_social_eating_dying_out/",
        "text": "In this age we have access to a lot more resources and time to do the things we want. Why is it then that people still eat socially? I understand that talking around a table is beneficial however why is food still in that equation? I can eat a meal in less than 10 minutes and go on with what I want to do. I saw older posts saying that there is evidence social eating started around 9000 BC and mainly due to sharing \"energy\" as everyone could contribute to gathering the food and then share the meal to ready themselves for the next hunt/gather. Well haven't we not been doing this for hundreds of years? Is there evidence that it is dying out/ will die out?",
        "created_utc": 1498657740,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't isolated success stories from poor neighborhoods debunk the link between poverty and crime?",
        "author": "everythingdiesalone",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jyz0b/why_dont_isolated_success_stories_from_poor/",
        "text": "[removed]",
        "created_utc": 1498633633,
        "upvote_ratio": ""
    },
    {
        "title": "Was scientific racism actually \"bad science\" by the methodological standards of the time?",
        "author": "MisterBigEnchilada",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jxs31/was_scientific_racism_actually_bad_science_by_the/",
        "text": "Apologies if this has been asked before but I have searched around and been unable to find any good discussion on this point.\n\nObviously the racial science conducted in the 18th, 19th and early 20th centuries purporting to classify various races into scientific categories and measure them by their intelligence, brain size, savagery, etc was tremendously flawed and harmful. Today we know that our folk racial categories are very weak socially constructed proxies for complicated genetic patterns, that 'savage' and 'civilized' are not objective scientific terms, that geographic and ecological factors are mostly responsible for the technological, social and epidemiological advances which the West made over other countries, that those advances were smaller than the West realized at the time, that phrenology and craniometry do not provide any useful information, and so on. So a lot of people regard what was done in the old days as pseudoscientific.\n\nBut lots of other scientific inquiry conducted in other fields in those times was later discredited.\n\nObviously their conclusions were wrong, but to what extent can we actually say that their methodology was pseudoscientific by the standards of the time and rooted in racism? In other words, how do we know that they only came to the conclusions that they did because they were motivated by a desire to show that their race/country/religion was morally superior, as opposed to simply doing what made sense to them? They didn't know what we did now, and the empirical evidence available to them was that there were relatively distinct different races which had different technological and social capabilities. Is it likely that an unbiased inquirer, to the extent that we can hypothesize such a person in that historical context, would have come to similar conclusions?\n\nObviously I'm talking about work which was conducted in many different countries for more than a century and a half in various fields of natural and social science. So probably a generalization is not possible. But any information on this would be appreciated.",
        "created_utc": 1498617954,
        "upvote_ratio": ""
    },
    {
        "title": "How do we suss out the roots of drug/crime epidemics?",
        "author": "fitterr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jtwzv/how_do_we_suss_out_the_roots_of_drugcrime/",
        "text": "Inspired by [this comment](https://www.reddit.com/r/ChapoTrapHouse/comments/6jtjpc/ripmarkusj_lets_talk_about_poverty_yall_this_is/djgx2b5/):\n\n&gt;&gt; (Note always that the drug and crime epidemics FOLLOW the collapse of the ability to reproduce material existence, never precedes.)\n\n&gt; I know this is true but can someone provide a study or book asserting this principle? Would be good when arguing with centrists.\n&gt; \n\n",
        "created_utc": 1498581664,
        "upvote_ratio": ""
    },
    {
        "title": "What is the term related to a larger group (popularity) affecting one's behavior to join in?",
        "author": "duplicit1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jq7b8/what_is_the_term_related_to_a_larger_group/",
        "text": "Hi.  If it's okay to ask a newbie question.\n\nI can't remember a term (I could be wrong, but maybe it's from psychology or sociology 101), where a person decides to join in on something based on the perception that something is popular (\"all the cool kids are doing it\" mentality).\n\nBut I don't mean like peer-pressure because that implies there's an actual direct influence on an individual.\n\nWhat I mean is a scenario where a person just perceives something as really popular, and without an outside factor (like someone pressuring or encouraging them), the person willfully chooses to participate and get involved in order to fit in and conform to the popular consensus.\n\nSo kind of \"group think\" but instead of just thinking, it's an actual behavior/action as opposed to just a thought.\n\nIs there such a term?  Thanks in advance.",
        "created_utc": 1498535131,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | June 26, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jl9t3/monday_reading_and_research_june_26_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1498485936,
        "upvote_ratio": ""
    },
    {
        "title": "What are the main possible reasons why some people oppose LGBTIQA rights and same-sex marriage?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jl395/what_are_the_main_possible_reasons_why_some/",
        "text": "Apart from the usual scapegoat that fundamental religious beliefs are the main reasons why some people oppose LGBTQAI rights and same-sex marriage, what are the possible reasons why people oppose these things despite scientific research saying that it is not exactly unnatural to develop that kind of \"different\" sexuality?\n\nI heard that some people are afraid of change because of the fear of the unknown or the fear that the change will be done by force and the heterosexuals became dominated and the new minority *(same way people were afraid when African-Americans demanded equal rights or when Communism was rising in power and influence)*\n\nI also heard that people neglect whatever the demand on equal rights claim because they claim that it is dominated by teenagers and young adults because they are being rebellious and illogical *(which is kinda true in a sense because it has been considered a usual part of development for many teenagers and young adults to go through risk-taking and rebellious behaviours but not all of them do)*",
        "created_utc": 1498483918,
        "upvote_ratio": ""
    },
    {
        "title": "Immigrants in American Academia",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jk8y4/immigrants_in_american_academia/",
        "text": "[deleted]",
        "created_utc": 1498472615,
        "upvote_ratio": ""
    },
    {
        "title": "Does the death penalty actually deter crime?",
        "author": "theology_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jgxdm/does_the_death_penalty_actually_deter_crime/",
        "text": "For example, if streaming/uploading/downloading child pornography was punished by death, would people stop watching child pornography?",
        "created_utc": 1498426652,
        "upvote_ratio": ""
    },
    {
        "title": "Would BLM be more effective focusing on black crime rather than police brutality?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jfdeg/would_blm_be_more_effective_focusing_on_black/",
        "text": "[removed]",
        "created_utc": 1498409917,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any good books analyzing self-esteem and the self-esteem movement?",
        "author": "morpheusx66",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6jd391/are_there_any_good_books_analyzing_selfesteem_and/",
        "text": "I recently read a book called \"Generation Me\" by psychologist Jean Twenge and she basically said the self-esteem movement which really took off in the 80s/90s basically had no evidence-based psychological backing and may be to blame for a measurable rise in narcissistic attitudes in today's young people. She basically concludes that self-esteem boosting has little, if any, positive effects and that children need to be instead taught self-control and diligence.\n\nAnecdotally, I've noticed a *lot* of people's sense of self seems to be limited by early traumatic experiences, etc. which strikes me as a self-esteem issue and makes me think her judgement isn't a one-size-fits-all. Are there any suggestible books on this topic?\n\n",
        "created_utc": 1498374279,
        "upvote_ratio": ""
    },
    {
        "title": "Muslim Migration to European countries and their effect on the economies of the countries.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j9fic/muslim_migration_to_european_countries_and_their/",
        "text": "[deleted]",
        "created_utc": 1498326040,
        "upvote_ratio": ""
    },
    {
        "title": "Where do people go after they've been gentrified out?",
        "author": "scratchedhead",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j7o4o/where_do_people_go_after_theyve_been_gentrified/",
        "text": "Do they make the neighborhoods they go to  become \"minorly\" gentrified, worse, or have no effect?",
        "created_utc": 1498303503,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any theoretical redesigns of the criminal justice system that might fix some of the underlying problems?",
        "author": "SketchyHippopotamus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j66fy/are_there_any_theoretical_redesigns_of_the/",
        "text": "",
        "created_utc": 1498277100,
        "upvote_ratio": ""
    },
    {
        "title": "Participate in an Economic Psychology study/survey (3-5 mins only!)",
        "author": "timkim23",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j4shk/participate_in_an_economic_psychology_studysurvey/",
        "text": "[removed]",
        "created_utc": 1498259678,
        "upvote_ratio": ""
    },
    {
        "title": "Marx said in Capital that \"Wherever the want of clothing forced them to it, the human race made clothes for thousands of years, without a single man becoming a tailor\".Is this true? How exactly did production take place in such an economy?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j25zf/marx_said_in_capital_that_wherever_the_want_of/",
        "text": "",
        "created_utc": 1498234225,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | June 23, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j1dxt/friday_freeforall_june_23_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1498226753,
        "upvote_ratio": ""
    },
    {
        "title": "Scientific explanation behind criminal activities - are criminals truly \"typically bad\" as the stereotype claims?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j131b/scientific_explanation_behind_criminal_activities/",
        "text": "They are mostly used as the scapegoat for the many ills of a society, both in many works of fiction *(like Batman is the most popular archetype of justice and crime fighting)* and in the real world *(like the Mafia in the US in the 1930s, stories of criminals robbing banks and trains in the Wild West, or right now, President Trump blames Mexicans and ethnic minorities for the crimes that happen in the US, or in the Philippines, the president is on a vigilante killstreak, putting a stop on the drug problem by killing addicts)*\n\nBased on my understanding so far on criminals *(again, I am only saying based on my understanding so I could be wrong)*, they are not exactly as stereotypically evil as we might expect.\n\nIt is true that there are/were crime groups that committed crime deliberately because they want to whether it is for power, money or intimidation, or simply because they can *(like the Mafia and Al Pacino, or the Yakuza in Japan, or the drug cartels in Mexico and El Chapo)*\n\nBecause of this, there are some theories that were brought about in order to understand the mentality of criminals such as the Just World Hypothesis and the classical thought of criminology *(that all crime is done by pure rational and conscious choice)* or the positivist approach *(that criminals had inherited traits that make them more likely to commit crimes or have conduct problems, or perhaps of other factors like psychological or social factors)*\n\nBut the more I learn about criminals, the more I learn that they are mostly scapegoated about political agendas or news articles that people often believe and people start committing crime because they have no other choice.\n\nSome because people of lower classes do not have the sufficient income to live as happily as everyone else and they commit petty crimes such as pickpocket for the purpose of survival. Because such crimes can be easy to detect and catch, their arrest give them a bad name, making them less likely to get a decent job with a decent income and they get stuck in this repeated cycle of crime that they will find it very hard to get out of.\n\nSome do it because they have no other choice or because they were pressured to do it. The common example that I found was African-Americans were unjustly stigmatised for the superior Caucasian males that they are inferior or less civilised, making them less likely to find a decent job. So they commit crimes to survive and the pre-conceived bias of enforcers of justice *(like policeman and judges)* become real and more likely to give these people much harsher sentences.\n\nHeck, I found that this is way more dangerous for black children. Because of social identity theory, they were more internalise the identity that because they are black, they are \"inferior\" or \"criminal\" by nature and this turns into a self-fulfilling prophecy and further reinforces the pre-conceived bias of unjust beliefs by others, especially if their occupation is related to justice or legal department.\n\nSo is the criminal world as black and white as some people think or is it more of different shades of grey?\n\n",
        "created_utc": 1498223376,
        "upvote_ratio": ""
    },
    {
        "title": "If labor productivity growth has been so low in the US, where has GDP growth come from in the last decade in the US?",
        "author": "Gurung33",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6j0wd9/if_labor_productivity_growth_has_been_so_low_in/",
        "text": "Growth in the size of the labor force in the US in the last decade hasn't been particularly high either, or maybe I'm wrong about that.",
        "created_utc": 1498221165,
        "upvote_ratio": ""
    },
    {
        "title": "What, if any, psychological advantages is there for cheering for the \"hometown kid\"?",
        "author": "Schmabadoop",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6izwfr/what_if_any_psychological_advantages_is_there_for/",
        "text": "When I was younger my father took me to a boxing match and the main event had a guy from our home state. I've never met him, do not live in the same town or county, and have never been in the room with him again.\n\nIs there some psychological reason that people will cheer for the hometown kid in a sporting context or is it a somewhat universally-learned cultural behavior?",
        "created_utc": 1498206007,
        "upvote_ratio": ""
    },
    {
        "title": "Do many in social science support the theory of black culture in the US being a large factor in causing black crime rates?",
        "author": "cauteritic",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ivjno/do_many_in_social_science_support_the_theory_of/",
        "text": "[removed]",
        "created_utc": 1498157004,
        "upvote_ratio": ""
    },
    {
        "title": "Does Freud's theory of life and death drives apply *only* to clinical populations, or are these present in everyone in his mind?",
        "author": "catasticvoyage",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6iv5px/does_freuds_theory_of_life_and_death_drives_apply/",
        "text": "I've been reading a lot of Freud lately, and I'm not sure if his work only applies to clinical situations, or if the non-clinical person has these things within them, too. ",
        "created_utc": 1498153620,
        "upvote_ratio": ""
    },
    {
        "title": "Social studies of isolation for long space missions",
        "author": "SanFlash",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6iv5g3/social_studies_of_isolation_for_long_space/",
        "text": "Good evening to all, I'm interested in making my sociology thesis about the application of social studies of situations where a small group of people need to live together for a long time in a small environment and extreme conditions, for upcoming manned space missions for Mars (going to use the proposal of Robert Zubrin in \"The Case for Mars\" as main reference here, as well as the ongoing experiments of the Mars Society in the Utah desert). Basically the intent is to verify the validity of the abitative modules used or hypothesized from a sociological view. \nThe problem is that I don't know what sociological studies exist about and professors, instead of helping, asked me to bring bibliography. \nAnyone here can help me?",
        "created_utc": 1498153554,
        "upvote_ratio": ""
    },
    {
        "title": "How do comment sections after news articles, youtube videos, and facebook posts affect the way we consume information?",
        "author": "noplusnoequalsno",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6isskr/how_do_comment_sections_after_news_articles/",
        "text": "Often the comments are very short, simple and have a kind of “truthiness” to them; they “feel” kind of true even if, upon closer analysis, they completely miss the point or are simply false. More often than not, they seem to be simply hateful and ignorant. \n\nIf someone reads a well thought out article on, say, gender inequality, then gets to the end and sees some kind of “witty retort” like: “If women didn’t want X to happen, they shouldn’t do Y”, does this have an effect on how they interpret what they’ve just read. If so, what are the potential long term effects of internet comment sections on society? ",
        "created_utc": 1498129723,
        "upvote_ratio": ""
    },
    {
        "title": "Social scientific explanation of myths",
        "author": "Abhranta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6irqty/social_scientific_explanation_of_myths/",
        "text": "Hello everyone! I am looking for theories developed by social scientists to understand and explain myths in general and Hindu myths in particular. \n\n",
        "created_utc": 1498112776,
        "upvote_ratio": ""
    }
]