[
    {
        "title": "What studies have been done on social classes within social networks (e.g. FB, TW, IG)?",
        "author": "BlueSky1877",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8q6hxd/what_studies_have_been_done_on_social_classes/",
        "text": "Curious if there's been measurements done on hierarchies within social networks or specific subcultures that can be analogous to social media. I'm thinking more person to person and less person to page.",
        "created_utc": 1528689003,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know that obtaining a college diploma causes better income? What if it's only a correlation and not a causation?",
        "author": "Moontouch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8q5ogu/how_do_we_know_that_obtaining_a_college_diploma/",
        "text": "It's a traditionally accepted fact that getting a college degree is \"worth it\" financially - people with college degrees earn more than ones without, but how do we know that it's the degree itself that causes the better income and not some other factor? What if people who obtain college degrees come from privileged backgrounds which allows them to obtain such degrees in the first place? What if these people were already socially set to perform better financially due to their higher class compared to those who do not have a diploma?",
        "created_utc": 1528681187,
        "upvote_ratio": ""
    },
    {
        "title": "What are some ethnographic studies of British people?",
        "author": "blackbluegrey",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8q36wc/what_are_some_ethnographic_studies_of_british/",
        "text": "I am aware of Kate Fox's *Watching the English* (though I haven't yet read it). Are there any other major works?\n\nI am particularly interested in reading about British Asians, seeing as I am one. When I say 'Asian' I mean it in the British sense - i.e. those of Indian, Pakistani, Bangladeshi, or Sri Lankan heritage. Any recommendations with this focus would be appreciated, though I am open to anything.\n\nAnd as a clarification, I'm using 'ethnographic' in the broadest sense possible. I don't have any formal training in anthropology or sociology so it may well be that the word encompasses a far narrower set of criteria than I am aware of. Really I'm just looking for an on-the-ground analysis.\n\nThanks in advance.",
        "created_utc": 1528658938,
        "upvote_ratio": ""
    },
    {
        "title": "Is the growing use of US prison labor (and the increasing rate of incarceration) playing a part in the availability of entry-level private sector employment?",
        "author": "Anabikayr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8q2koe/is_the_growing_use_of_us_prison_labor_and_the/",
        "text": "It appears that while incarceration rates continue rising in the US, more private sector companies are capitalizing on the availability of cheap American labor.  These companies are able to pay significantly less than minimum wage to inmates, which equals significant cost savings to the companies.\n\nAt the same time in the private sector, the nature of entry level jobs which are available in the US seems to have changed to requiring significantly more education and more experience in most of those specific positions (3-5 years with nearly identical experience).  \n\nI know much has been said about the job climate as it relates to the effects of automation, more individuals with bachelors and masters degrees, and the longer lives and longer working careers for baby boomers.  I'm curious though as to how prison labor could also be contributing to job availability and the job market today.  \n\nAre there any studies or statistics which might address this, whether directly or tangentially?",
        "created_utc": 1528653757,
        "upvote_ratio": ""
    },
    {
        "title": "How credible is the claim that the reason why certain African countries are 'shitholes/struggling is due to culture?",
        "author": "ShadowSJG",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pzq5s/how_credible_is_the_claim_that_the_reason_why/",
        "text": "In regards to Trumps shithole comment, someone said what Trump meant is because these countries have a bad culture such as rape, terrorism, slavery, gangs running amuck.  I was wondering, how credible is this claim?",
        "created_utc": 1528622433,
        "upvote_ratio": ""
    },
    {
        "title": "Is the notion that black people are struggling in America for \"cultural\" reasons a serious sociological or criminological theory?",
        "author": "AKGAKG",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pxzjm/is_the_notion_that_black_people_are_struggling_in/",
        "text": "I was dealing with a conservative who made this claim about why African-Americans are struggling in America:\n\n\"As for the past, there comes a time when you have to take responsibility in the here and now. You can't forever blame the past. It has been pointed out at least since the 60s the African-American community, seemingly for cultural reasons like the epidemic of broken homes in the black community, seems to have particular trouble in improving their socioeconomic situation. Other ethnic groups who have been discriminated against have been able to better themselves, from Irish to Jews to Puerto Ricans. Yes, things might never be perfect for African-Americans - things never are for fallen man - but, as I said, at some point you have to take some responsibility for your own situation.\"\n\n\"On socioeconomic status of African-Americans, your argument would be successful only if it were possible to say that the discrimination of blacks has been so much more and so much more systematic compared to these other groups, to a large enough degree that it explained all their current social issues. This is implausible (even if we leave aside Jews for now). This is not to say past discrimination is not an important factor, nor even that current discrimination may play a role. But African-American cultural issues seem to play a key role today. And, as I said, there comes a time when you have to look to yourself and try to make something of yourself. The obsessive identity politics focus on victimhood is something African-Americans need as a little as Muslims do.\"\n\nHow would one assess their claims, and is there really any merit to what they are saying or is it just right-wing pseudo-sociology?",
        "created_utc": 1528598715,
        "upvote_ratio": ""
    },
    {
        "title": "When will the social misunderstandings die down?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pvfxo/when_will_the_social_misunderstandings_die_down/",
        "text": "[removed]",
        "created_utc": 1528574382,
        "upvote_ratio": ""
    },
    {
        "title": "Do you know of any post-2000 examples of an 'Availability Cascade'?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ptv76/do_you_know_of_any_post2000_examples_of_an/",
        "text": "[deleted]",
        "created_utc": 1528561139,
        "upvote_ratio": ""
    },
    {
        "title": "Has an IAT been done for men/women in a similar way to how it has been done for black/white?",
        "author": "beelzebubs_avocado",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ptlwf/has_an_iat_been_done_for_menwomen_in_a_similar/",
        "text": "In the common black/white implicit association test it pairs up black and white people with either good or bad words. But in the common men/women IAT it pairs men and women with traditional gender roles/stereotypes. Has one been done with men and women with either good or bad words?\n\nSeems like this might be an interesting way to gauge the existence and size of the \"women are wonderful\" effect.",
        "created_utc": 1528558879,
        "upvote_ratio": ""
    },
    {
        "title": "Rambling thoughts - cocaine use and Instragram correlation",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ptdey/rambling_thoughts_cocaine_use_and_instragram/",
        "text": "[removed]",
        "created_utc": 1528556776,
        "upvote_ratio": ""
    },
    {
        "title": "What do academics think of the ladder theory of social class in this essay?",
        "author": "kwizzle",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ptcsl/what_do_academics_think_of_the_ladder_theory_of/",
        "text": "Basically, the authour of [this essay](http://indiepf.com/michael-o-churchs-theory-of-3-class-ladders-in-america-archive/) describes social classes on not only being based on income but also on what each class values.  \n\nI know very little about the author other than he's a blogger who doesn't seem to have formal education on the subject.  I don't want to discredit him for not having a formal education though I'm wary of pop culture armchair socio-political vues and would like to hear what academic experts have to say on the subject, or at the very least be pointed towards some sort of academic primer on social classes.  \n\nThank you in advance.\n\n",
        "created_utc": 1528556620,
        "upvote_ratio": ""
    },
    {
        "title": "In what venues and in what way do scholars actively help progressive organizations other than by doing independent research that can take years to complete?",
        "author": "anotherbird",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pt9ar/in_what_venues_and_in_what_way_do_scholars/",
        "text": "[removed]",
        "created_utc": 1528555719,
        "upvote_ratio": ""
    },
    {
        "title": "The child development book \"Meaningful Differences\" by Risley and Hart shows a powerful effect of parent speaking practices of later child outcomes. Has any study used their data and controlled for family income?",
        "author": "anotherbird",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8psuxm/the_child_development_book_meaningful_differences/",
        "text": "The [book](https://www.amazon.com/Meaningful-Differences-Experience-published-Publishing/dp/B00E32O5KC/ref=pd_lpo_sbs_14_img_1?_encoding=UTF8&amp;psc=1&amp;refRID=88YG56E23PZYE014FYE7) is fascinating in showing how the numbers of words that a child hears \\- and as the use of \"negation\" (\"no!\") \\- are very related to medium\\-term and longer\\-term outcomes, while other structural elements of the language did not matter.  But the social sciences also say that poverty matters to child outcomes.  I am sure the authors had a measure of income or occupation in their study but as remarkable as the study was, the authors did not include that variable in the quantitative analysis.  Has anyone done a replication using their data? ",
        "created_utc": 1528551778,
        "upvote_ratio": ""
    },
    {
        "title": "Adjacent country clearly differ in many ways. Why is it that Northern states of the US have well-being indicators more similar to Canada than to Southern states of the US?",
        "author": "anotherbird",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pscah/adjacent_country_clearly_differ_in_many_ways_why/",
        "text": "Presumably \"cold weather\" is not the reason.  ",
        "created_utc": 1528545659,
        "upvote_ratio": ""
    },
    {
        "title": "Controlling for SES and location, are Black people significantly more likely to be killed by police compared to white people, in the US?",
        "author": "Senray",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pqd7z/controlling_for_ses_and_location_are_black_people/",
        "text": "I'm guessing/assuming that they are still at greater risk, but I'm wondering how much of the disparity is due to SES and location/setting",
        "created_utc": 1528518024,
        "upvote_ratio": ""
    },
    {
        "title": "Do journal editors want to see every control variable in methods?",
        "author": "anotherbird",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pq3ka/do_journal_editors_want_to_see_every_control/",
        "text": "[removed]",
        "created_utc": 1528515091,
        "upvote_ratio": ""
    },
    {
        "title": "Sociology: Difference between Value Freedom and Objectivity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8poi11/sociology_difference_between_value_freedom_and/",
        "text": "[deleted]",
        "created_utc": 1528499405,
        "upvote_ratio": ""
    },
    {
        "title": "From a marketing standpoint, what is the go-to strategy for knocking off brands that carry a default or prestige status among the public? Does one exist?",
        "author": "shazam_7",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pnt8u/from_a_marketing_standpoint_what_is_the_goto/",
        "text": "I'm thinking like- samsung going for apple. \n\nCar manufacturers going for BMW/Mercedes. \n\nFashion brands going for LV, Prada, Gucci... \n\n\nIt seems like taking the space of a company that has firmly established a prestigious brand image, even with a superior or equal product, is almost insurmountably hard. \n\nCould Samsung have done a better job taking on the iPhone? Is there a book on this type of marketting, so to speak? \n",
        "created_utc": 1528493754,
        "upvote_ratio": ""
    },
    {
        "title": "What does the selectorate theory have to say about non-residents voting in national elections?",
        "author": "MS_Ayala",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pniez/what_does_the_selectorate_theory_have_to_say/",
        "text": "I mention the selectorate theory because I think its the most appropiate model for this problem but feel free to bring in any insights from other places. I am interested in knowing what the research has to say about the impact on incentives for democratic rulers of allowing non\\-residents \\- i.e people who where born in the place but moved, or their families \\- to vote in national elections. This has been discussed in my country (Uruguay) for years, but all I hear are arguments from a normative/moral perspective. I want to learn about the evidence and facts to try and have a more pragmative view on the issue.",
        "created_utc": 1528491421,
        "upvote_ratio": ""
    },
    {
        "title": "The book \"Selfish Reasons to Have More Kids\" claims that income depends strongly on your genes and only weakly on who raised you. Is there research that against this hypothesis?",
        "author": "lee1026",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pmolt/the_book_selfish_reasons_to_have_more_kids_claims/",
        "text": "The book cited many adoptive studies. The writer made the argument that all of the studies that he found suggest that for an adopted child, there is essentially no impact on future earnings based on the school district, and future income is only weakly dependent on parental earnings.\n\nGiven the literature that says that income is highly hereditary, would the two sets of research essentially conclude that high income is essentially genetic?",
        "created_utc": 1528485247,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the murder rate for transgender people lower than cisgender people?",
        "author": "etcNetcat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pmjxg/why_is_the_murder_rate_for_transgender_people/",
        "text": "The FBI lists the average rate for all trans people as being well below the average murder rate (though admittedly the rate is extremely low for trans men and extremely high for trans women). Do we have research or data on why this is? Less risky behavior from people who already feel targeted? ",
        "created_utc": 1528484306,
        "upvote_ratio": ""
    },
    {
        "title": "Why do oppressed/minority communities engage in inter-community conflicts rather than work together?",
        "author": "CondimentKiosk",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pkph4/why_do_oppressedminority_communities_engage_in/",
        "text": "(Originally posted on ELI5 but it was too subjective)\n\nIn the past it would have been in the black community with the (I'm not sure if this is a PC term but I don't really know what else to call them but please let me know if there is a better term i can use) the dark skinned black people and the light skinned black people. They would fight each other and think one group was better even though they were already being oppressed by the white community.\n\nIn a more modern context, in the LGBT+ community certain sections of the community believe they face larger struggle and that other sections have done nothing for the community. Some sections believe bi-people have no struggle or trans men also faced less struggle than trans women.\n\nIf they face abuse and oppression why do they step on each other to get to the top rather than climb together?",
        "created_utc": 1528470959,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | June 08, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pk57k/friday_freeforall_june_08_2018/",
        "text": "[removed]",
        "created_utc": 1528466761,
        "upvote_ratio": ""
    },
    {
        "title": "Good books for learning research methods?",
        "author": "RNG_take_the_wheel",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pj8nq/good_books_for_learning_research_methods/",
        "text": "Hi all,  \n\nMy organization is launching a new initiative to do soup-to-nuts research in our industry (everything from hypothesis scoping to survey building to interviewing to analysis) and I've been tapped to lead the effort.  \n\nI have worked as an analyst, consultant, and researcher in the past. I'm also a grad student in a well-ranked analytics program. That said, I am feeling unprepared for the size and scope of this project. I want to make sure that we're doing more than just creating marketing material - I want to *genuinely contribute* to the state of understanding in the field.  \n\nWith that in mind - what books would y'all recommend? I've currently read Applied Social Research Methods by Floyd Fowler, Jr. and Research Designs: Qualitative, Quantitative, and Mixed Methods - John Creswell. I'm also brushing up on my statistical knowledge. I would like to learn how to build quantitative models of social science constructs, but am unsure of what resources will teach me how to do that.  \n\nThanks everyone!",
        "created_utc": 1528458580,
        "upvote_ratio": ""
    },
    {
        "title": "How can a computer science grad switch career to Social Science?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pgnim/how_can_a_computer_science_grad_switch_career_to/",
        "text": "[removed]",
        "created_utc": 1528428509,
        "upvote_ratio": ""
    },
    {
        "title": "Is there research on the effects of \"first world\" countries basically poaching the middle and upper classes of developing nations?",
        "author": "SilverSeven",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pfp22/is_there_research_on_the_effects_of_first_world/",
        "text": "Im a big supporter of immigration, but someone brought this up as a possible downside, and Ive never considered that side of it. Heres the post that got me thinking about it, as he/she words it well:\n\n\"I wouldn't say I'm skeptical of immigration but I do wonder sometime if it isn't bad for the world in the long run. The people we tend to accept as immigrants (middle\\-ish class people who are unhappy with the state of things in their country of origin) are the people who would otherwise be the vanguard of social reform.\"",
        "created_utc": 1528419826,
        "upvote_ratio": ""
    },
    {
        "title": "Where should I look for datasets?",
        "author": "FedorianGray",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8pbm59/where_should_i_look_for_datasets/",
        "text": "Hello all. I am a Master's student in an educational psychology program. I am beginning to work on my thesis, which will explore student's motivation to take math courses in either high school or college. While I have explored the data available on the National Center for Education Statistics website, I was told by my adviser to search for other datasets. Does anyone have any advice as to where I should look? I am combing through google search results with little luck. Any advice you can offer would be excellent. \n\nThanks!",
        "created_utc": 1528388222,
        "upvote_ratio": ""
    },
    {
        "title": "Do other countries have their own version of the concept \"Middle America\", and if so, what is that called?",
        "author": "GlitteringDurian",
        "url": "https://www.reddit.com/r/AskReddit/comments/8parxm/do_other_countries_have_their_own_version_of_the/",
        "text": "",
        "created_utc": 1528384651,
        "upvote_ratio": ""
    },
    {
        "title": "Women control 60% of American wealth? Context?",
        "author": "kublahkoala",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8payet/women_control_60_of_american_wealth_context/",
        "text": "I see a lot of [references to this](https://www.google.com/amp/s/amp.businessinsider.com/women-now-control-more-than-half-of-us-personal-wealth-2015-4) — particularly as an argument against the pay gap. How does this account for money held in joint checking accounts? Is the fact that women tend to outlive men, and men tend to marry younger women, a major factor here? Why the discrepancy between wealth and income?",
        "created_utc": 1528383408,
        "upvote_ratio": ""
    },
    {
        "title": "What specifically does Trump want out of Canada?",
        "author": "Bouncing_Cloud",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p9px9/what_specifically_does_trump_want_out_of_canada/",
        "text": "[removed]",
        "created_utc": 1528372878,
        "upvote_ratio": ""
    },
    {
        "title": "How power-plays function in small and medium groups?",
        "author": "rob-roj",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p8xcv/how_powerplays_function_in_small_and_medium_groups/",
        "text": "I'm having trouble finding applications of conflict theory or other approaches to small-medium groups (from a circle of friends to hobby clubs and organisations).\n\nWhat are the processes at play, apart from most basic cognitive errors and sexual discrimination?",
        "created_utc": 1528363800,
        "upvote_ratio": ""
    },
    {
        "title": "Why do obese people tend to group together in social situations?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p4o8z/why_do_obese_people_tend_to_group_together_in/",
        "text": "[deleted]",
        "created_utc": 1528321424,
        "upvote_ratio": ""
    },
    {
        "title": "Are dreams significative, or is it just random nonsense our brains throws at us?",
        "author": "Menesio",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p3796/are_dreams_significative_or_is_it_just_random/",
        "text": "Hi folks!   \nI believe this is a pretty entry\\-level/common question, so I hope this hasn't been asked before: but I searched the subreddit and I didn't find anythinh.\n\nAnyway: I usually hear that dreams are somewhat significative, that you can use them to understand your subconscious mind and thus to understand yourself. In short, dreams have a meaning, and you can they can give you valiable insight about yourself.\n\nI think that was Freud thought. I studied him in HS (philosophy), just entry level. I also think this is \"common knowledge\".\n\nWhat is the stance of modern day psychology about this topic? Are dream really significative? Should we pay attention to them? Or is just night blabber, nonsense our brain picks randomly?  \n\n\nThanks for the answers! ",
        "created_utc": 1528310619,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true that it is better to be feared than loved if you cannot have both?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p2orc/is_it_true_that_it_is_better_to_be_feared_than/",
        "text": "This is mostly significant for leaders of any kind, whether it is political leaders, business leaders and so on.\n\nNiccolo Macchiavelli, who saw humans as easily corruptible, insidiously cunning and selfish and cruel (at least that is what we think because some people claim that the book \"The Prince\" was meant to be a political satire but many people use it as a leadership guide because if you look at it without a moral or amoral perspective, it teaches how to be an effective leader/ruler), mentioned the phrase \"Better to be feared than loved, if you cannot be both.\" and he made a clear distinction that one should NOT be hated AND feared as the leader will be easily overthrown by his own people.\n\nI can see several historical examples where the leaders were feared yet respected and managed to have an effective rule during their reign (well, somewhat) - Stalin for example because despite his dictatorship and the sheer genocide that was committed for the sake of pushing communism influence (sometimes by military force which contradicts to what Marx said about the revolution of the working class as if the idealism of Marx was used a clever cover to justify corruption and genocide) his iron fist rule was the effective push necessary to fight against the Nazi push in the East, something that Hitler underestimate (and Russia had a large area than France meaning the tactics were not as effective, plus Russia had its own disadavantages like the extreme cold weather and lack of train rails that made it difficult to transport resources and exhausted most of the fuel and energy during combat). Putin is probably another example. I am not sure if the statistics because despite that Russia is mostly anti-democratic, Putin's rule made things better for Russia economically and politically, well ... until the latest chemical attack incident (at least that is what I read once so forgive me if I am wrong)\n\nOther examples that come to my mind such as Nixon and Reagan, Genghis Khan, Julius Caesar, Winston Churchill (to a certain degree) and so on\n\nBut these are mostly historical examples so I am not sure if the statistics agree as well",
        "created_utc": 1528306931,
        "upvote_ratio": ""
    },
    {
        "title": "Do people segregate themselves based on height? That is, do taller people tend to hang out with taller people and do shorter people tend to hang out with shorter people?",
        "author": "RickAndMorty101Years",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p2f19/do_people_segregate_themselves_based_on_height/",
        "text": "I'm wondering if there is research on this. Thanks!",
        "created_utc": 1528305078,
        "upvote_ratio": ""
    },
    {
        "title": "Are Californian Yokuts related to Yakutian Yakuts?",
        "author": "tanktango",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p1i22/are_californian_yokuts_related_to_yakutian_yakuts/",
        "text": "[removed]",
        "created_utc": 1528298666,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | June 06, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8p0vn8/theory_wednesday_june_06_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1528293985,
        "upvote_ratio": ""
    },
    {
        "title": "Why humans still want to play sports or do physical activity despite that advanced technology make it all unnecessary?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ozvjr/why_humans_still_want_to_play_sports_or_do/",
        "text": "[removed]",
        "created_utc": 1528284921,
        "upvote_ratio": ""
    },
    {
        "title": "Aren't the 'framing' and 'priming' media effects basically the same thing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ozswh/arent_the_framing_and_priming_media_effects/",
        "text": "[deleted]",
        "created_utc": 1528284113,
        "upvote_ratio": ""
    },
    {
        "title": "X-Post",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oxba9/xpost/",
        "text": "[deleted]",
        "created_utc": 1528255231,
        "upvote_ratio": ""
    },
    {
        "title": "Query regarding a domestic violence statistic in Cassie Jaye's 'The Red Pill'",
        "author": "DiabolikDownUnder",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ow2yd/query_regarding_a_domestic_violence_statistic_in/",
        "text": "I recently got done watching a takedown of the infamous MRA documentary *The Red Pill* by YouTube film essayist [Big Joel](https://www.youtube.com/channel/UCaN8DZdc8EHo5y1LsQWMiig). While I thought Joel's debunking of the film's arguments regarding the supposed oppression of men in society were great, honestly I found it surprisingly easy to see through each of Jaye's arguments as they came, so much so that I'm now under the impression she might quite possibly be one of the dumbest self-proclaimed 'feminists' I've ever seen considering how easily she just accepts these pitifully weak points by Men's Rights Activists without ever pushing back on them. For the most part I was thinking 'red pill my ass'...\n\nHowever the one point I didn't feel Joel adequately countered, and one I certainly was unable to counter myself was [this suggestion regarding domestic violence against men](https://youtu.be/P0dwWLY3SyY?t=18m1s). Jaye uses a statistic by the Centers for Disease Control and Prevention to claim that 1 in 4 men will experience intimate partner violence in their lifetime. Unlike most of the other arguments in the film, this is an actual statistic from a real survey, not just an anecdote.\n\nHow do you guys feel about Jaye's use of this statistic? The response I've heard most frequently is that while the domestic violence rates against men might be this high, specific types of violence like sexual assault are overwhelmingly more likely to occur to women. However it still surprises me that such a high figure is not discussed more in the media, so I would like to ask how you guys rate Jaye's interpretation of these numbers.\n\n1. [Here's the 2010 survey Jay cites](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n2. [Here's a recap of a more recent 2015 version of the same study](https://www.cdc.gov/violenceprevention/nisvs/2015NISVSdatabrief.html)\n\nThank you!",
        "created_utc": 1528244569,
        "upvote_ratio": ""
    },
    {
        "title": "How do Humans Value Money?",
        "author": "tbryan1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ousqc/how_do_humans_value_money/",
        "text": "[removed]",
        "created_utc": 1528234509,
        "upvote_ratio": ""
    },
    {
        "title": "Physical affection and personal space tendencies differ from one culture to another and seem especially evident between men. Is there reasoning behind this?",
        "author": "JustAcceptThisUser",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ou8l8/physical_affection_and_personal_space_tendencies/",
        "text": "",
        "created_utc": 1528230462,
        "upvote_ratio": ""
    },
    {
        "title": "Physical affection and personal space, especially between men, seem differ from culture to culture. What are the reasons behind these differences?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8otvj9/physical_affection_and_personal_space_especially/",
        "text": "[deleted]",
        "created_utc": 1528227904,
        "upvote_ratio": ""
    },
    {
        "title": "I’ve heard of differences between social/personal views/standards of personal space and physical affection. Is there a reason for these distinct differences? (IE friends/family holding hands or sitting closely to the point of constant touch, specifically with adult males) what areas is this found?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8osqct/ive_heard_of_differences_between_socialpersonal/",
        "text": "[deleted]",
        "created_utc": 1528219782,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone tell me about the Personality Assessment System?",
        "author": "OscarDiggsMKU",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8os7t1/can_anyone_tell_me_about_the_personality/",
        "text": "I've been reading about the [Personality Assessment System](https://en.wikipedia.org/wiki/Personality_Assessment_System), and it sounds pretty amazing, so I'm wondering why I've never heard of it before today. Is this a thing that was taken seriously in the 70s, and is no longer? Is this no more reliable than MBTI? The name makes it difficult to google. Can someone tell me more?\n\n**Edit:** Why am I being downvoted for asking a question? Isn't it novel and specific and answerable?",
        "created_utc": 1528216149,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it the closer you get the Equator the living conditions of the countries seem get worse?",
        "author": "Felony",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oqs1z/why_is_it_the_closer_you_get_the_equator_the/",
        "text": "If you look on any world map and follow the equator from end to end you will find no country considered to be 1st or 2nd world. As you move away from the Equator it seems the farther you go the better the standard of living, with a few exceptions.  \n&amp;nbsp;  \nHow much of the climate is a factor in this? Does year round warm weather cause humans to be more violent? Or is it something else like availability of valuable resources?",
        "created_utc": 1528205184,
        "upvote_ratio": ""
    },
    {
        "title": "Decentralization connected to gentrification?",
        "author": "greatnickname",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oqqyz/decentralization_connected_to_gentrification/",
        "text": "Are there any studies that show a correlation between government decentralization and gentrification? During the last few decades (especially the last 5 years) a lot of government responsibilities in the social domain and urban planning decentralized to the local level, i.e. municipalities and provinces, at least throughout western Europe (other parts of the world I don't know for sure). Has any study shown a significant effect on gentrification - in particular state-led gentrification - since delocalization of gentries often takes place outside of the local jurisdiction? ",
        "created_utc": 1528204927,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone provide a few good links about the living conditions of slaves immediately prior to the American Civil War?",
        "author": "NihiloZero",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oqorv/can_someone_provide_a_few_good_links_about_the/",
        "text": "Someone I know is pushing the idea that the lives of slaves in the United States improved dramatically from when the institution first existed in the U.S. through the period immediately preceding the civil war.  He claims, for example, that they lived in what would be considered \"middle class houses\" in the period just before the civil war.  \n\nNot exactly sure of his general point, but I don't believe his assessment either way.  Unfortunately, most of the information on the subject I find is about the entire period of slavery as a whole or the period during the civil war.  \n\nCan someone here direct me to some links either comparing the living conditions of slaves at certain points and/or about the living conditions immediately prior to the American Civil War?",
        "created_utc": 1528204371,
        "upvote_ratio": ""
    },
    {
        "title": "How do y'all respond to the trope that only wealthy people take English/History, social sciences as a major?",
        "author": "Disrupturous",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oomt1/how_do_yall_respond_to_the_trope_that_only/",
        "text": "[removed]",
        "created_utc": 1528180466,
        "upvote_ratio": ""
    },
    {
        "title": "Favorite social science books pertaining to religion?",
        "author": "Woah_Mad_Frollick",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oo8n0/favorite_social_science_books_pertaining_to/",
        "text": "Hi! I've recently been digging into books that explore religion as a social/historical/literary/cognitive phenomena, from a largely secular perspective. Stuff like the writing of Karen Armstrong, the New Testament historical criticism of Bart Ehrman, \"The Great Code\" by Northrop Frye, \"Breaking the Spell\" by Daniel Dennett, \"When God Talks Back\" by Tanya Luhrman, etc. I have been curious as to what this subs recommendations are on books pertaining to religion from the Social Science perspective. I had earlier been recommended the works of Mircea Eliade, but to my disappointment it seems that his work is no longer considered reputable. I am *not* looking for New Atheist type of anti-religion books. Any recommendations are welcome, and my apologies if this is the wrong sub for this type of post.",
        "created_utc": 1528175925,
        "upvote_ratio": ""
    },
    {
        "title": "Plausibility of mass exits from US labor force for disability rolls in the 2000s? Fact-checking a book. (X-posted r/askeconomics)",
        "author": "descendedlikedante",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oncd2/plausibility_of_mass_exits_from_us_labor_force/",
        "text": "I'm reading *The War on Normal People* by Andrew Yang, a US Democratic 2020 candidate whose platform hinges on UBI. The book warns of the perils of automation, and one particular narrative completely jars me. Yang suggests that \"More than 5 million manufacturing workers lost their jobs after 2000.\" Sounds plausible. Then, “One Department of Labor survey in 2012 found that 41 percent of displaced manufacturing workers between 2009 and 2011 were either still unemployed or dropped out of the labor market within three years of losing their jobs.” Sure.\n\nBut then he says this: “How do the 40 percent of displaced manufacturing workers who don’t find new jobs survive? The short answer is that many became destitute and applied for disability benefits. Disability rolls shot up starting in 2000, rising by 3.5 million, with the numbers increasing dramatically in Ohio, Michigan, Pennsylvania, and other manufacturing\\-heavy states. In Michigan, about half of the 310,000 residents who left the workforce between 2003 and 2013 went on disability. Many displaced manufacturing workers essentially entered a new underclass of government dependents who have been left behind.”\n\nI think that this is Yang's original research, and unfortunately he's not too transparent about how he arrives at this conclusion. Does this sound plausible—or better yet, verifiable? Furthermore, some cursory Googling indicates that manufacturing\\-heavy states do have high disability enrollment precisely because manufacturing jobs often leave people physically injured, unfortunately. Thoughts?",
        "created_utc": 1528166744,
        "upvote_ratio": ""
    },
    {
        "title": "Papers that argue against \"taxation is theft\"?",
        "author": "Filmbhoy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8omqyc/papers_that_argue_against_taxation_is_theft/",
        "text": "[removed]",
        "created_utc": 1528161335,
        "upvote_ratio": ""
    },
    {
        "title": "Assuming the supposition that contemporary science has found that the majority of traditional medicines across all cultures are ineffective in treating their target illnesses, why have these practices survived into the present?",
        "author": "get_trumpin",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8om9rx/assuming_the_supposition_that_contemporary/",
        "text": "Would their perceptible ineffectiveness over a culture’s history not select them for extinction?",
        "created_utc": 1528157182,
        "upvote_ratio": ""
    },
    {
        "title": "In an empirical social science journal article, where is the theoretical framework placed?",
        "author": "anotherbird",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8om23m/in_an_empirical_social_science_journal_article/",
        "text": "[removed]",
        "created_utc": 1528155323,
        "upvote_ratio": ""
    },
    {
        "title": "Sociology Survey on Marriage and Dating",
        "author": "sociologyhelppp",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oltum/sociology_survey_on_marriage_and_dating/",
        "text": "[removed]",
        "created_utc": 1528153415,
        "upvote_ratio": ""
    },
    {
        "title": "Please help me to find academic works/long term studies about the sexual orientation of same sex couples' children compared to traditional male-female parents' children.",
        "author": "jaanv",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ol8xx/please_help_me_to_find_academic_workslong_term/",
        "text": "",
        "created_utc": 1528148685,
        "upvote_ratio": ""
    },
    {
        "title": "Is race real?",
        "author": "SteamboatJesus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8okpor/is_race_real/",
        "text": "[removed]",
        "created_utc": 1528144762,
        "upvote_ratio": ""
    },
    {
        "title": "What is a \"theoretical framework\" in an empirical social science journal article?",
        "author": "anotherbird",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8okhq6/what_is_a_theoretical_framework_in_an_empirical/",
        "text": "[removed]",
        "created_utc": 1528143152,
        "upvote_ratio": ""
    },
    {
        "title": "In what section of a scholarly article do the discussions or sections of \"theoretical framework\" go?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8okc00/in_what_section_of_a_scholarly_article_do_the/",
        "text": "[removed]",
        "created_utc": 1528142012,
        "upvote_ratio": ""
    },
    {
        "title": "Please point me in the direction of academic work arguing for and against \"Gender Critical\" Feminism.",
        "author": "nemo1889",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oiv66/please_point_me_in_the_direction_of_academic_work/",
        "text": "I can only find articles and blog posts which do not have an academic tone and are typically fraught with condescension and insults. I fall squarely in the camp which would say that transmen and transwomen are \"real\" men/women, but I don't think that the concerns expressed by Radical Feminists and Gender Critical Feminists is as easy to dismiss as calling them TERFs. So, can you please provide me with some academic sources which both defend and criticize the gender critical position? Thanks!",
        "created_utc": 1528131350,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | June 04, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ohigp/monday_reading_and_research_june_04_2018/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1528121131,
        "upvote_ratio": ""
    },
    {
        "title": "literature on the structure agency debate, and how it relates to political left and right wings?",
        "author": "tbilisicat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ofo5t/literature_on_the_structure_agency_debate_and_how/",
        "text": "Hi Social Scientists,\n\nI could not find an 'ask sociology' subreddit so I'm asking here. Specifically I am looking for literature on the effects of different epistemological positions regarding structuralism and agency on justice and how society should be organised, and how that affects political parties in either the US or UK.\n\nI am assuming that politically right wing positions place much more emphasis on agency, while left wing positions are more structuralist.\n\nThanks!",
        "created_utc": 1528100554,
        "upvote_ratio": ""
    },
    {
        "title": "Immunity to the \"uncanny valley\"",
        "author": "Workaholico",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oe9bw/immunity_to_the_uncanny_valley/",
        "text": "[removed]",
        "created_utc": 1528083393,
        "upvote_ratio": ""
    },
    {
        "title": "Academic Study about Hate Crimes against Lesbian, gay, and Bisexual people. Win 1 of 10 $25 Amazon Gift Cards!(18+ Only)",
        "author": "ApoorvaO",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8obqt9/academic_study_about_hate_crimes_against_lesbian/",
        "text": "[removed]",
        "created_utc": 1528060324,
        "upvote_ratio": ""
    },
    {
        "title": "I’ve read that white men are 3xs more likely to commit suicides in the US. Does this include murder-suicides and mass shootings?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8oasds/ive_read_that_white_men_are_3xs_more_likely_to/",
        "text": "[deleted]",
        "created_utc": 1528052457,
        "upvote_ratio": ""
    },
    {
        "title": "Impact of the increase in median age on our media",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8o8313/impact_of_the_increase_in_median_age_on_our_media/",
        "text": "[deleted]",
        "created_utc": 1528027243,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the most socially stratified societies in history?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8o7iu2/what_are_some_of_the_most_socially_stratified/",
        "text": "[deleted]",
        "created_utc": 1528018645,
        "upvote_ratio": ""
    },
    {
        "title": "Does the genre of music that one listens to affect the way said person dresses?",
        "author": "Uskelm",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8o7d31/does_the_genre_of_music_that_one_listens_to/",
        "text": "[removed]",
        "created_utc": 1528016039,
        "upvote_ratio": ""
    },
    {
        "title": "Ethical Piracy?",
        "author": "HighOnDuck",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8o771y/ethical_piracy/",
        "text": "[removed]",
        "created_utc": 1528013289,
        "upvote_ratio": ""
    },
    {
        "title": "What factors are indicators of the longevity of a government?",
        "author": "trueconviction",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8o6agd/what_factors_are_indicators_of_the_longevity_of_a/",
        "text": "I am asking broadly but I am hoping for some statistical studies. What statistically significant factors do long-lived governments have in common? Factors could be anything; GDP, birth rate, immigration, military budget spending, diet, geographic size, climate, average work hours per week, religion, physical infrastructure, government style, average years spent in education per capita, etc.\n\nI realize a lot of these factors may be hard to come by due to lack of records or measurement tools, but I'd still be interested in statistics from more recent history. I'll take whatever I can get, this interests me a bit. Originally posted in AskHistorians and was referred here.",
        "created_utc": 1528000768,
        "upvote_ratio": ""
    },
    {
        "title": "Why have the wages of the top 1 percent in the United States stagnated from 1999 till 2016?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8o0fkp/why_have_the_wages_of_the_top_1_percent_in_the/",
        "text": "In [this](https://www.epi.org/blog/wages-rose-for-the-bottom-90-percent-in-2016-as-those-for-top-1-percent-fell/) article, it is shown that\n\nThe ~~wages~~ income of the top 1 percent in 1999 was 145 percent higher than it was in 1979. However, it was only 148 percent  higher in 2016. In essence, it appears that there was a very small increase in the last 17 years. For the bottom 90 percent, it was 15 percent in 1999 and 18 percent in 2017.\n\n",
        "created_utc": 1527944943,
        "upvote_ratio": ""
    },
    {
        "title": "Does stigma no longer \"stigmatize\"?",
        "author": "MemberOfMautenGroup",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8nzgvj/does_stigma_no_longer_stigmatize/",
        "text": "In my Human Sexuality subject in graduate school we were talking about this [article.](http://journals.sagepub.com/doi/10.1177/0733464815591210)\n\nSo my professor made the assertion that social stigma no longer causes people to stop enacting the stigmatized behavior; in essence, people engaging in the stigmatized behavior double down and continue engaging in the behavior because it is stigmatized.\n\nI don't have a social science background (I hold an MLS bachelors) and I have a few questions:\n\n1) Does my graduate school professor's assertion contradict my undergraduate instructor's assertion that stigma's primarily role is for society to signal its members that they should not engage in the stigmatized behavior? If yes, who is correct? If no, how?\n\n2) If my undergraduate instructor is incorrect, is the assertions that \"one goal of any society to make uniform its members' behavior\" and \"societies utilize behavioral engineering/control to meet social goals\" still correct, or are they incorrect?\n\nThank you!",
        "created_utc": 1527931552,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: What variables are most influential for the formation of friendship?",
        "author": "Ironic_Gangster",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8nyajh/discussion_what_variables_are_most_influential/",
        "text": "I've been putting together an app that creates groups of people who want to make friends. The groups are formed with my compatibility algorithm using scores from a 44 question personality test that utilizes the Five Factor Model. I ask my original question because I want more opinions. Homophily is the general rule for matching people for determining compatibility (similar scores are grouped with similar scores). Disagreements? Questions? Anything you'd like to add?\n\nWhat variables are most influential for the formation of friendship?",
        "created_utc": 1527914497,
        "upvote_ratio": ""
    },
    {
        "title": "What are good examples of Sociological Hypothesis's?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8nwq57/what_are_good_examples_of_sociological_hypothesiss/",
        "text": "[removed]",
        "created_utc": 1527898140,
        "upvote_ratio": ""
    },
    {
        "title": "Why do Evangelical Christians in the US tend to lean very heavily to the right?",
        "author": "-Mamba-",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8nwoti/why_do_evangelical_christians_in_the_us_tend_to/",
        "text": "Based off of the [2nd chart on this page](http://www.pewforum.org/religious-landscape-study/party-affiliation/#religious-tradition-trend), the vast majority of religious groups and religious denominations in the US lean left, even other Christian groups such as Catholics and Orthodox's. So why has the evangelical branch of Christianity shifted to the right side of the political spectrum?",
        "created_utc": 1527897774,
        "upvote_ratio": ""
    },
    {
        "title": "What is the point of deviding people into generations?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8nts7z/what_is_the_point_of_deviding_people_into/",
        "text": "[deleted]",
        "created_utc": 1527874255,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | June 01, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ns4uf/friday_freeforall_june_01_2018/",
        "text": "[removed]",
        "created_utc": 1527861962,
        "upvote_ratio": ""
    },
    {
        "title": "What, if any, are the benefits of suicidal ideation on the sufferer?",
        "author": "banausos",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8np3wt/what_if_any_are_the_benefits_of_suicidal_ideation/",
        "text": "The harmful drawbacks of suicidal ideation on a person are obvious, but are there any benefits? If yes, please recommend relevant books or research.",
        "created_utc": 1527827499,
        "upvote_ratio": ""
    },
    {
        "title": "Do people actually believe Donald Trump's et al. tweets are really from him?",
        "author": "Bravoreggie",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ni6ql/do_people_actually_believe_donald_trumps_et_al/",
        "text": "[removed]",
        "created_utc": 1527771365,
        "upvote_ratio": ""
    },
    {
        "title": "Is duluth model still considered valid?",
        "author": "Melthengylf",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8news9/is_duluth_model_still_considered_valid/",
        "text": "The model basically says that domestic violence is mainly about gendered violence from men to women. However, statistics show pretty much symmetry. There seems to be discussions about which forms of mutual violence are in fact self-defense situations. So in general, I wanted to ask what's the contemporary view of the duluth model.",
        "created_utc": 1527737477,
        "upvote_ratio": ""
    },
    {
        "title": "In what ways did post-modernism change how a layperson in a westernized democracy thinks?",
        "author": "sweater_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ndsk3/in_what_ways_did_postmodernism_change_how_a/",
        "text": "First, sorry if the question is too vague or broad—and perhaps it is better suited for AskPhilosophy. I did my undergraduate in philosophy, so when I say post-modern I mostly mean Foucault and Derrida. This was inspired by reading a discussion about presentism in AskHistorians. It got me thinking about how a non-academic like myself conceptualizes the world and the relationship between myself and society. Do you see any influence from post-modern thought on the cultural conversation, on a meta level?\n\n",
        "created_utc": 1527727664,
        "upvote_ratio": ""
    },
    {
        "title": "Where did names come from?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ndad4/where_did_names_come_from/",
        "text": "[deleted]",
        "created_utc": 1527722865,
        "upvote_ratio": ""
    },
    {
        "title": "How come the use of cigarettes hasn’t been near eradication yet?",
        "author": "kannapop",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8ncf6i/how_come_the_use_of_cigarettes_hasnt_been_near/",
        "text": "Once the public opinion toward cigarettes shifted in the 60s, and in America and other developed nations, there were public smoking bans, why haven’t we eradicated cigarette use? Advertisements are no longer able to pick up new customers, and the generations that had already grown addicted to it are starting to die out. Yet, I know so many millennials who smoke cigarettes without a hint of irony. Their answers over why vary greatly - some started as rebellion, some were influenced by glamorized TV spots, some grew up in families that normalized it. \n\nAre there examples of nations or populations that successfully ridded cigarette use?",
        "created_utc": 1527715698,
        "upvote_ratio": ""
    },
    {
        "title": "Which science course should I use to fulfill degree requirements for an undergraduate economics degree? Physics or biology and why? I am interested in ultimately pursuing a career in international development.",
        "author": "whisperpitch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n9pn8/which_science_course_should_i_use_to_fulfill/",
        "text": "[removed]",
        "created_utc": 1527695828,
        "upvote_ratio": ""
    },
    {
        "title": "Social Research",
        "author": "TheseBear",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n9awy/social_research/",
        "text": "[removed]",
        "created_utc": 1527692762,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | May 30, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n8ui2/theory_wednesday_may_30_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1527689192,
        "upvote_ratio": ""
    },
    {
        "title": "Banking Customer Experience",
        "author": "sarasustelosantos",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n7guv/banking_customer_experience/",
        "text": "[removed]",
        "created_utc": 1527675803,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Traditional medicine still common is Asia",
        "author": "prairie_guy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n4y75/why_is_traditional_medicine_still_common_is_asia/",
        "text": "Why are some traditional medicines still popular and accepted in parts of Asia? I've heard about Rhino horn in Vietnam, and Tiger wine in China, and I don't understand why they are still used despite high prices and no proven medical benefits. I can understand traditional cures being used in remote or traditional areas, but why in very developed areas like China? Why hasn't it been replaced by western medicine and become seen as old superstition?",
        "created_utc": 1527646934,
        "upvote_ratio": ""
    },
    {
        "title": "How can countries defend against resource curse?",
        "author": "martianoverture",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n4vc4/how_can_countries_defend_against_resource_curse/",
        "text": "",
        "created_utc": 1527646202,
        "upvote_ratio": ""
    },
    {
        "title": "Examples of Bad Minority Influence?",
        "author": "Cookielolz",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n2sbw/examples_of_bad_minority_influence/",
        "text": "Hey guys, preparing for exams which feature minority influence and so far I've just had good things like Civil Rights, Women's Suffrage etc. as examples, but are there any historical examples when minority influence has led to bad things in societies? ",
        "created_utc": 1527628546,
        "upvote_ratio": ""
    },
    {
        "title": "What does islamophobia mean, and why are people islamophobic?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n2i4f/what_does_islamophobia_mean_and_why_are_people/",
        "text": "Being Muslim doesn’t tie one down to a certain skin color, the same way race does. However, when people say “Islam is not a race” they usually mean it’s okay to be Islamophobic (but it’s not okay to be Islamophobic).",
        "created_utc": 1527626420,
        "upvote_ratio": ""
    },
    {
        "title": "The organization of the Yakuza",
        "author": "HenrikTheAwsm",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n1wrq/the_organization_of_the_yakuza/",
        "text": "I was wondering how the Japanese Yakuza is organized. [This](https://www.quora.com/What-are-the-names-of-the-different-ranks-within-the-Japanese-yakuza) post shines some light on it, but I still don't understand how the entire hierarchy is organized from top to bottom. \n\nFor some reason it is really hard to find information about this.",
        "created_utc": 1527622154,
        "upvote_ratio": ""
    },
    {
        "title": "This is a survey for first borns in a family to fill out! The survey is anonymous. You may skip any question. Please fill this out honestly. Thank you for helping.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8n1nmn/this_is_a_survey_for_first_borns_in_a_family_to/",
        "text": "[removed]",
        "created_utc": 1527620253,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been research on Sayre's Law?",
        "author": "youcanteatbullets",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8mz8as/has_there_been_research_on_sayres_law/",
        "text": "[Sayre's Law:](https://en.wikipedia.org/wiki/Sayre%27s_law)\n\n&gt;\"In any dispute the intensity of feeling is inversely proportional to  the value of the issues at stake.\" By way of corollary, it adds: \"That  is why academic politics are so bitter.\"\n\nAnecdotally this rings somewhat true to me, I'm wondering if there has been proper, large\\-scale research on this. Interpersonal and/or intergroup conflict research may be applicable even if they don't quote the law by name.",
        "created_utc": 1527601732,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] High or low androgen levels correlated with more science activity and Nobel Prizes?",
        "author": "bartovan",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8myz4t/question_high_or_low_androgen_levels_correlated/",
        "text": "[removed]",
        "created_utc": 1527599518,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn’t the rate of blacks being victims of police shootings “associated” with their higher rate of violent crime?",
        "author": "jargonaut",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8mxt9l/why_isnt_the_rate_of_blacks_being_victims_of/",
        "text": "I’ve seen news articles [such as this one](http://www.newsweek.com/police-shootings-killings-us-unarmed-black-reform-michael-brown-764787) claim that the higher rate of black men being victims of police shootings isn’t associated with their higher crime rate. \n\n- Blacks are 13% of population in US. Black men are 6.5% of the population. \n- Blacks (mostly men) are 31% of police shooting victims. \n- Studies conclude blacks are “3 times more likely to be shot by police” but then say this isn’t associated with higher crime rate. \n- But if blacks commit [52% of homicides, 29% of rapes, 55% of assaults](https://ucr.fbi.gov/crime-in-the-u.s/2016/crime-in-the-u.s.-2016/topic-pages/tables/table-21) and [40% of cop-killings](https://nypost.com/2017/09/26/all-that-kneeling-ignores-the-real-cause-of-soaring-black-homicides/), wouldn’t this likely result in more interaction with police which could result in more police shootings? \n\nSo while it’s true that blacks are being shot by police disproportionately compared to their percentage of the population, it’s not disproportionate compared to their share of the violent crimes committed. In fact, it seems they are shot slightly less than their share of violent crime.  There’s definitely a strong correlation. How are studies and the media coming to the conclusion that the stats aren’t associated? It seems obvious that more crime results in more interaction with police which sometimes results in police shootings. \n\nThe only argument I’ve seen is that some cities with higher violent crime have lower rates of police shootings. But does that really discredit the possible association in national stats? ",
        "created_utc": 1527586897,
        "upvote_ratio": ""
    },
    {
        "title": "how does the income level of an area affect the student outcomes of charter, private, or public schools? does higher income level affect positively across the various types of schools? or are there no directly relevant studies in recent times on this topic?",
        "author": "understandthings100",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8mwt68/how_does_the_income_level_of_an_area_affect_the/",
        "text": "#All claims in top level comments must be supported by citations\n\n",
        "created_utc": 1527574010,
        "upvote_ratio": ""
    },
    {
        "title": "Can one link makeup to sexism?",
        "author": "daniyal120",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8mtfgm/can_one_link_makeup_to_sexism/",
        "text": "[removed]",
        "created_utc": 1527541951,
        "upvote_ratio": ""
    },
    {
        "title": "When did Atheism become the norm amongst scientists?",
        "author": "Khem_kid",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/8mrqjk/when_did_atheism_become_the_norm_amongst/",
        "text": "Albert Einstein died in 1955 and he was theistic. Because he was so high profile and respected, and because I'm not aware of any other scientists publicly challenging him on his theism, I'm assuming being theistic was not unusual for scientists at that time. \n\nHowever, I work in science currently, and almost every scientist I come across is an agnostic atheist.\n\nWhen did being an atheist become the norm for scientists? What social and scientific events led to this? Are there any widely respected scientists who are openly theistic?\n\nThank you.",
        "created_utc": 1527528149,
        "upvote_ratio": ""
    }
]