[
    {
        "title": "Do bureaucratic institutions present a challenge to democratic ability? How?",
        "author": "DrShlomo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/71j5w9/do_bureaucratic_institutions_present_a_challenge/",
        "text": "[removed]",
        "created_utc": 1506001057,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the causes of aromanticism or a sexuality? What factors drive alloromantics/allosexuals to be in a romantic or",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/71h2td/what_are_some_of_the_causes_of_aromanticism_or_a/",
        "text": "[deleted]",
        "created_utc": 1505971760,
        "upvote_ratio": ""
    },
    {
        "title": "How did socializing with friends work before cell phones/internet?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/71dqr2/how_did_socializing_with_friends_work_before_cell/",
        "text": "[removed]",
        "created_utc": 1505937591,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any historical equivalents to the current Blue Lives Matter vs. Black Lives Matter movements?",
        "author": "Courtnall14",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/71cdkh/are_there_any_historical_equivalents_to_the/",
        "text": "",
        "created_utc": 1505926120,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | September 20, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/71bael/theory_wednesday_september_20_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1505916390,
        "upvote_ratio": ""
    },
    {
        "title": "First 'real' political science research paper. How do I cite this thing?",
        "author": "KittehInGloves",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/719wzc/first_real_political_science_research_paper_how/",
        "text": "Hello! Hopefully this is the right sub for this issue. I'm an undergrad studying international relations, and am currently in the process of finishing up my first, intended for publication, research paper.\n\n I'm around 20 pages in now, however am completely struggling with citations. I've been using Chicago style footnotes, however due to numerous citations from journals from the web/urls they are taking up almost half of some pages. I've been looking through other academic papers, and almost all don't seem to have citations at all, save for an end list of sources. \n\nIf anyone has any advice or guides for this, I would be so grateful! I'd hate to have been working for months, only to screw it up via incorrect sourcing. \n\nThanks!",
        "created_utc": 1505899678,
        "upvote_ratio": ""
    },
    {
        "title": "What are some social scientific works being done on Chine?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/719cw4/what_are_some_social_scientific_works_being_done/",
        "text": "I've become acquainted with Confucianism over the past couple of years, especially contemporary Confucianism, and it would almost appear that Confucianism has had a great and long lasting effect on society in China. This is despite attempts only a few years back to purge Confucianism from China itself, which were largely unsuccessful it seems. Now I have read Daniel A. Bell's China's New Confucianism which sort of explains what I'm trying to say in a better light, but I was wondering if there is more to the story other than China returning to Confucianism in a sense.",
        "created_utc": 1505890441,
        "upvote_ratio": ""
    },
    {
        "title": "My Psych Publications",
        "author": "Alexander0011",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/718w8z/my_psych_publications/",
        "text": "[removed]",
        "created_utc": 1505883906,
        "upvote_ratio": ""
    },
    {
        "title": "What factors encourage companies and countries to engage in risk-taking behavior and arms races?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7173bz/what_factors_encourage_companies_and_countries_to/",
        "text": "[removed]",
        "created_utc": 1505864095,
        "upvote_ratio": ""
    },
    {
        "title": "Literature on \"Passing\"",
        "author": "woggabogga",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/716w0e/literature_on_passing/",
        "text": "I'm trying to collect literature on the concept of \"passing\": that is, whenever someone tries to present themselves as a member of a social group other than their own or when others take them for a different group than their own.",
        "created_utc": 1505862065,
        "upvote_ratio": ""
    },
    {
        "title": "Are proofs important to becoming an economist?",
        "author": "ShinySnoo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/716ods/are_proofs_important_to_becoming_an_economist/",
        "text": "[removed]",
        "created_utc": 1505860024,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any studies on prison culture and ideology?",
        "author": "dieLaunischeForelle",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/715v53/are_there_any_studies_on_prison_culture_and/",
        "text": "in an article on vice there was a claim that prisoners are commonly deeply religious because they are stupid.\n\nhowever, in literature the prisoner's piety is commonly shown to be an attempt to suck up to the prison authorities (and to increase the chances of an early release).\n\nIndeed, it appears that it is not religion in particular that convicts tend to dig so much ,but also their state's ideology: on soviet prison tattoos you will find depictions of marx, engels and lenin; on american ones it is more likely to be an eagle or a dollar sign; in latin america it's catholicism or native arts of the respective country.\n\nare cross country studies on the criminal ideologies?",
        "created_utc": 1505852803,
        "upvote_ratio": ""
    },
    {
        "title": "Which scholars views states as multilateral actors and why?",
        "author": "ZD_17",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/715m5v/which_scholars_views_states_as_multilateral/",
        "text": "The dominant view seems to be that states are unilateral actors. States and their actions (of course if it's not an authoritarian regime) seem to be collections of different interest groups that struggle with each other for [internal and foreign] policy decisions. Are there IR scholars who share that view?",
        "created_utc": 1505850713,
        "upvote_ratio": ""
    },
    {
        "title": "Questions for Immigrants of America",
        "author": "Rocket_League-Champ",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/713mry/questions_for_immigrants_of_america/",
        "text": "[removed]",
        "created_utc": 1505834102,
        "upvote_ratio": ""
    },
    {
        "title": "I want to understand Germany current state. What books/articles do you recommend?",
        "author": "LmDol",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/712x7o/i_want_to_understand_germany_current_state_what/",
        "text": "Let's assume I have a historical background of Germany. I want to understand how they are doing in economics, equiality, politics, current affairs topics.",
        "created_utc": 1505827330,
        "upvote_ratio": ""
    },
    {
        "title": "Would social media have a role to play in an Ideal Society?",
        "author": "amazingbob123",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/711jzq/would_social_media_have_a_role_to_play_in_an/",
        "text": "[removed]",
        "created_utc": 1505808692,
        "upvote_ratio": ""
    },
    {
        "title": "Assimilation vs Multiculturalism",
        "author": "litehacker",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70wlws/assimilation_vs_multiculturalism/",
        "text": "In assimilation: Everyone who is a citizen, should hold the same set of cultural standards. You have a homogeneous set of people. It is pretty socially obvious if you don't fit into the group. A good example of this is mainland China. Regardless if you have lived there for a generation and have a flawless accent, if you don't look Chinese, everyone will see you as a foreigner. People take pride in their \"nationality\". Their \"home\". Their \"motherland\". People may use their nationality/religion/\"in group\" to do very good (and very bad) things in life.\n\nIn multiculturalism: Attempting to make multiple different people live together. I've seen this in large cities in the US, like New York. People dressed in multiple different ways, talking with different accents. This comes with it's benefits and drawbacks.\n\nOne of the benefits of multiculturalism include mutual understanding for each other's culture. People who used to fight each other out of nationality, might becomes friends.\n\nOne of the drawbacks include not being able to fully include a culture. Some cultures might be deemed more correct than others. An example I've recently seen - In some Mexican cultures, it is completely fine for dogs to walk around the street without an owner. These dogs are usually owned by locals.. They just don't leash their dog to the property. The dogs like to walk around in random places. Street kids like to play with them. An outsider would be afraid to walk around there, fearing all the unleashed dogs. If this latino culture were to move to NY, and let their dogs out, animal control send their unleashed dogs to a pet shelter.\n\nFor some of the people reading this: *You* might feel like having dogs run around, poop not getting cleaned up, is a bad thing, and should be stopped. Spreads disease and everything. But that is part of your culture.\n\nIn some indian cultures, eating meat might be considered a bad thing, but once again, that is part of their culture.\n\nBeing multicultural environment like NY, people may lose their old cultured identity, and assimilate into the new \"cultureless\" environment, which is still yet another culture.\n\nAnother option to assimilation and multiculturalism, is having multiple \"zones\" with different cultures. A good example of this would be \"chinatown\" or \"italy town\" where although everyone lives in the same state, they still keep to their own cultures, segregated in their own areas. The local governments in these areas can make laws that are more tailored to each culture.\n\nThe main problem I see with these cultured zones the historic problems this caused for jews - https://en.wikipedia.org/wiki/Pale_of_Settlement https://en.wikipedia.org/wiki/Shtetl - The problem was that the national government forced jews to live in these locations. Jews had difficulty moving away from their designated towns, or setting up new towns elsewhere. These jewish zones in areas with poor utilities. Same thing can be said about the United States with segregation of black people, only being able to live and work in certain areas.\n\nTrying to see, in a utopian society, what is the best solution for allowing people of all cultures to join and live in one country. As far as I can tell, these different cultural zones can be maintained, as long as:\n\n1. People have the freedom of movement to any area. New areas can become zoned in new ways depending on the movement of the people.\n2. Local governments can be formed wherever communities of people form. These local governments should be able to note, for example, if dogs can run unleashed. Whatever it is, custom to the culture.\n3. Stop cultures from fighting each other.\n\nI think this last point is probably the most problematic. If a jewish zone is right next to an arab zone, there might be fighting between the borders.\n\nAre there studies comparing these different styles of multiculturalism / assimilation / zoned areas? Which is \"best\"?",
        "created_utc": 1505756622,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain me Amartya Sen's capability theory ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70wbpi/can_someone_explain_me_amartya_sens_capability/",
        "text": "[deleted]",
        "created_utc": 1505753695,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | September 18, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70v77b/monday_reading_and_research_september_18_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1505743537,
        "upvote_ratio": ""
    },
    {
        "title": "Why was marrying several times so commonplace among 1930-1950's Hollywood movie stars?",
        "author": "Grey_Flower",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70ut69/why_was_marrying_several_times_so_commonplace/",
        "text": "Hello!\n\nI can't seem to find much info about this online.... I've been thinking about the frequency of Hollywood marriages in around 1930-1950’s.\n\nI’m wondering why did Hollywood actresses in the 1930’s - 1950’s get married so young? Many were married as teenage girls, which was young even for the times. And considering they had careers and wealth of their own, surely they had less incentive than the average American woman to get married young?\n\nWhy did Hollywood actors/actresses who were popular in the 1930 - 1950’s get married/divorced SO many times? Most seem to get married at least three times, often 5+ times. Considering divorce was more frowned upon back then compared to later decades, I’m wondering why this was considered acceptable when it didn’t align to the standards of society at the time? \n\nDo you think that the frequency with which these stars got married/divorced, influenced the general public?\n\nIf anyone has any comments or can link to articles/papers which cover these sorts of topics, I would love to read.",
        "created_utc": 1505739406,
        "upvote_ratio": ""
    },
    {
        "title": "What do you call a situation where someone who has failed in life transfers their negative feelings and thoughts to someone who hasn't failed yet? Projection?",
        "author": "Havoola",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70u249/what_do_you_call_a_situation_where_someone_who/",
        "text": "I'm not sure about the term \"projection\", as projection means that the person who has failed in life is in **denial** over their failure while **unconsciously** transferring their feelings and thoughts.\n\nI'm looking for the term that describes a person who has failed (and who knows they're a failure) **deliberately and consciously** transferring their negative feelings and thoughts to someone who hasn't failed, for example, a failed, worthless father who deliberately tells his son that he is worthless too. Thanks",
        "created_utc": 1505729646,
        "upvote_ratio": ""
    },
    {
        "title": "Are there​ many theories on the evolutionary significance of a child's imagination? Why is it so active and often fantastical? Why does this fade as we get older?",
        "author": "Evan_dood",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70tb9n/are_there_many_theories_on_the_evolutionary/",
        "text": "",
        "created_utc": 1505717372,
        "upvote_ratio": ""
    },
    {
        "title": "Benefits of a totalitarian regime?",
        "author": "jynandor",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70t59g/benefits_of_a_totalitarian_regime/",
        "text": "I am currently writing a story centered around a brutal, yet largely unquestioned totalitarian government. I was just wondering what benefits (if any) came with a totalitarian system? Economics, during wartime, etc. I have researched and researched but can't seem to find any clear answers or ones without any bias. Thank you so much!",
        "created_utc": 1505714834,
        "upvote_ratio": ""
    },
    {
        "title": "Have there been any studies done on online troll factories, sock puppet accounts, etc and their effect on social media?",
        "author": "guacbandit",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70p0zc/have_there_been_any_studies_done_on_online_troll/",
        "text": "I've read some of the news coming out regarding the \"factories\" from Macedonia and Russia which were putting out fake news during the election. But there's also the well known issue of bots of all kinds plaguing Twitter, Facebook, etc for years. People buy followers, then sell accounts, etc.\n\nI've also just begun wondering whether all these news sites which require registration to post comments aren't also being affected by some of the same things. Most people are not going to register on every single local news site they run into online. So who are the people actually registering and posting on all these small local news site comment sections? Especially since they often all sound similar. (The exception being, maybe, when people can use Facebook accounts to comment... but Facebook itself has plenty of bot account problems)",
        "created_utc": 1505670757,
        "upvote_ratio": ""
    },
    {
        "title": "Why aren't there any reports of white men raping black women in the doj data?",
        "author": "thepasswordisredblue",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70p0dt/why_arent_there_any_reports_of_white_men_raping/",
        "text": "[removed]",
        "created_utc": 1505670610,
        "upvote_ratio": ""
    },
    {
        "title": "I am preparing for a competitive exam, can you guys recommend which optional I should choose (philosophy or Sociology) based on the syllabus and certain other things given below?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70orsu/i_am_preparing_for_a_competitive_exam_can_you/",
        "text": "[deleted]",
        "created_utc": 1505668366,
        "upvote_ratio": ""
    },
    {
        "title": "I am going prepare for a competitive exam. Can you guys recommend whether I should choose philosophy or Sociology based on the syllabus and certain other things given below?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70on4k/i_am_going_prepare_for_a_competitive_exam_can_you/",
        "text": "[removed]",
        "created_utc": 1505667129,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't white men rape black women?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70odgp/why_dont_white_men_rape_black_women/",
        "text": "[removed]",
        "created_utc": 1505664479,
        "upvote_ratio": ""
    },
    {
        "title": "The use of game theory in the cold war",
        "author": "gt6775rf",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70n7bk/the_use_of_game_theory_in_the_cold_war/",
        "text": "Any good, reliable resources for this. e.g science journals...\n\nI've asked this question before but i didn't get any answers, so i thought i'd try again. Here's some more info i posted last time just in case\n\nBasically I'm in my final year of school (Twelfth grade) and i have to do a dissertation on a subject of my choice. One of my subjects is economics so i thought i'd do something related to that and that's how i got game theory in the cold war. I'm still in the early stages of planning it so i dont have anything specific, I was just thinking a general overview of how it was used. I mean if you've got any interesting topics i could talk about, that would be really good.\nMy ideal source would be something thats accurate (the more reliable my citations are, the better grade i get). Also something that a 17-18 year old would understand, but tbh thats not as important as my first point\n\nthanks",
        "created_utc": 1505651165,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any truth to the claim that Western Europe will become a Muslim majority in the future?",
        "author": "connnnnnn5",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70mtn0/is_there_any_truth_to_the_claim_that_western/",
        "text": "",
        "created_utc": 1505645236,
        "upvote_ratio": ""
    },
    {
        "title": "The Economic Impact of Smoking",
        "author": "deathcapsforeveryone",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70kkg2/the_economic_impact_of_smoking/",
        "text": "I have little training in economics, so please forgive any stupid questions. I read that smoking results in a loss of $500b/yr to global economic output because of productive man-years lost to lung disease and cancer, and the medical costs of treating them. Is this truly the bottom line?\n\nIf we were to take into account the effects of\n\n1) Tobacco as a stimulant, arguably amplifying productivity of some workers in their younger, most productive days.\n\n2) The economic activity generated by the tobacco industry and the medical industry.\n\n3) The fact that many of those who die to cancer and lung disease do so in their older ages, at a time when the annual costs to society of keeping them alive, fed, and housed might be higher than their economic productivity. This is especially true for pensioners. \n\n4) Cigarette taxes funding public coffers.\n\nIs net total wealth of society higher or lower in a world with or without smokers?\n\nHere is an alternative formulation where the inheritance of money from the dead do not play a role. Since utility deficits do not carry over into death, is the net total utility of society higher in a world with or without smokers?\n\nI suppose the same can be said for alcohol, though point 1) would not be valid.",
        "created_utc": 1505609249,
        "upvote_ratio": ""
    },
    {
        "title": "Why did membership in fraternal organizations die out over time?",
        "author": "beefstewforyou",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70jypl/why_did_membership_in_fraternal_organizations_die/",
        "text": "Back in the 1950s, it was super common for men to be a member of a fraternal organization such as the freemasons but not so much today. What caused this change? ",
        "created_utc": 1505602201,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone proposed the theory that a certain percentage of those racist toward blacks are actually against the ghetto/gangsta subculture and not skin color?",
        "author": "bookbindr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70go4w/has_anyone_proposed_the_theory_that_a_certain/",
        "text": "[removed]",
        "created_utc": 1505565649,
        "upvote_ratio": ""
    },
    {
        "title": "Help me find study: Survey of college students which suggest economics/business school students differ in moral values/valuations",
        "author": "PhilArt_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70fu3n/help_me_find_study_survey_of_college_students/",
        "text": "A couple of years ago a large social science institution in the US presented a survey study which (if I remember correctly) indicated that business school students and/or college students in economics stood out when it came to valuing moral issues, reading fiction etc. It may have been from Stanford, UoCA, or UoWI but I am unsure. Can someone point me in the right direction?",
        "created_utc": 1505550678,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an equivalent of Native American Reservations anywhere else in the world?",
        "author": "ManeGee",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70axmb/is_there_an_equivalent_of_native_american/",
        "text": "Not sure if this is just something America did or if other countries have created something similar after displacing the once indigenous people?",
        "created_utc": 1505492734,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | September 15, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70a1cs/friday_freeforall_september_15_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1505484365,
        "upvote_ratio": ""
    },
    {
        "title": "Emotion vs Efficiency",
        "author": "DRPPNGBMBS",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/709l4r/emotion_vs_efficiency/",
        "text": "[removed]",
        "created_utc": 1505479447,
        "upvote_ratio": ""
    },
    {
        "title": "Has the proliferation of documentaries about justice miscarriage made it harder to get juries to convict?",
        "author": "secondsniglet",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/702hvx/has_the_proliferation_of_documentaries_about/",
        "text": "Does anyone know if prosecutors have been finding it harder to get juries to convict in the last couple years? There has been such a swarm of documentaries about justice miscarriages in recent years that i am wondering if it is starting to have a real impact in changing juror attitudes (e.g. \"Making a Murder\", \"Confession Tapes\", etc).",
        "created_utc": 1505398604,
        "upvote_ratio": ""
    },
    {
        "title": "What is the roots of Alt-Right?",
        "author": "oguh-ohug",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7029rl/what_is_the_roots_of_altright/",
        "text": "Ideology? Organisations? People? Similar historical organisations (ideological)\nAn example could be John Birch Society (organisation) and paleoconservatism (ideology). Souce: Niko Heikkilä, « Online Antagonism of the Alt-Right in the 2016 Election », European journal of American studies [Online], 12-2 | 2017, document 5, Online since 02 August 2017, connection on 14 September 2017. URL : http://ejas.revues.org/12140 ; DOI : 10.4000/ejas.12140",
        "created_utc": 1505396346,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for balanced economics debates on YT",
        "author": "SirValeq",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7027kt/looking_for_balanced_economics_debates_on_yt/",
        "text": "I've been browsing YouTube for a while and I have trouble finding debates between economists (or scholars from different sciences but talking about economics) from different schools/perspectives. All I can find is them patting each other on the back and agreeing on almost everything, because they share similar views and opinions (like all of them being (neo)keynesians or (neo)marxists etc.).\n\nCan anybody point me to some debates in which there is some real discussions on the issue of free markets or free trade (or whatever really) from both their advocates and opponents? I would love some real discussion, with sides actually disagreeing on most points.",
        "created_utc": 1505395669,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of reading is there on the fetishization of black culture (especially rap) by white people?",
        "author": "-Shaxberd-",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/700qbx/what_kind_of_reading_is_there_on_the/",
        "text": "I remember I took a course on sociology for no particular reason, and we watched a video which at one point stated that the majority of people who listen to or buy rap music are white people. I shrugged my shoulders and said \"Well duh, that's just the base rate of whites to blacks in play\".\n\nBut I see that if you look on Apple Music's Top Albums, 24/25 albums listed are by black artists (not all rap). That seems peculiar to me given the base rate I alluded to; 12.6% of the US population is black, and even the fudge of that math by the fact that black people might be differently represented in the Apple music demographics doesn't seem like it would indicate anything other than the reality that tons of white people are mainly listening to music by black artists. Meanwhile, 15 out of the 20 Top Movie covers from the same system that feature real life people don't have any black people in them at all. 16/20 for Top TV. (Above numbers retrieved from Apple TV).\n\nI don't think this is a quirk of Apple TV. Other forms of black culture have been appropriated by white people as well, like jazz music. But the thing is, rap music still retains its \"black character\" and representation of artists while jazz appropriation led to a large scale of white involvement. I suspect this is because what sells in rap music is inextricable \"blackness\" of attitude that can't be adapted to other sociocultural modalities without seeming like a joke. Thus, in the market of fetishization of black culture, it's the perfect balance of commodity supply and demand.\n\nI'd love to read articles on this, or book chapters. I don't think I'm interested in reading a whole book.",
        "created_utc": 1505373916,
        "upvote_ratio": ""
    },
    {
        "title": "State Legislature Amendment Process?",
        "author": "MasterTotoro",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/700ajw/state_legislature_amendment_process/",
        "text": "One way to amend the U.S. Constitution is by Congress proposing an amendment by 2/3 vote in each house and then 3/4 of the state legislatures amending it. \n\nHow exactly does the second part of that play out? As far as I'm aware, the Constitution doesn't specify whether a simple majority, 2/3, 3/4, or whatever vote is required for a state legislature to agree to pass the amendment. Is that left up to the states themselves? Like maybe Texas only requires a simple majority but Maine requires 3/4?\n\nAny other interesting facts about the process are welcome too!",
        "created_utc": 1505367054,
        "upvote_ratio": ""
    },
    {
        "title": "According to Article IV, Section 1 of the US constitution, states must recognize documents rendered in other states. Does this apply in other countries?",
        "author": "rman108720",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/70097c/according_to_article_iv_section_1_of_the_us/",
        "text": "If I were to travel to another country, could they choose not to recognize my marital status or my birth certificate? Are there any instances of this?",
        "created_utc": 1505366496,
        "upvote_ratio": ""
    },
    {
        "title": "Sociologists, is there any evidence to suggest that one reason for poorer students underachieving in education may be due to pressure to leave school and start work earlier?",
        "author": "RiseofBubblez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zvnvg/sociologists_is_there_any_evidence_to_suggest/",
        "text": "",
        "created_utc": 1505319973,
        "upvote_ratio": ""
    },
    {
        "title": "what are some of the most robust criticisms of the I.Q test?",
        "author": "outworld_dirty",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zvg27/what_are_some_of_the_most_robust_criticisms_of/",
        "text": "",
        "created_utc": 1505318096,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | September 13, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zuqqu/theory_wednesday_september_13_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1505311575,
        "upvote_ratio": ""
    },
    {
        "title": "Introductory social movement theory reading list?",
        "author": "themightyteebs",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ztbts/introductory_social_movement_theory_reading_list/",
        "text": "Had searched the sub, but didn't see this asked before, so...\n\nWhile getting ready for a math/econ degree, I'm trying to dip my toe into general sociology to have a reason to crunch numbers; after some generally light reading in org sociology (Richard W. Scott's introductory overview text, Thompson's Organizations in Action, selected papers I could grab open-access pdf's of), I'm ready to move on to social movement theory.\n\nSince I really just typed in \"Organizational Sociology\" into Amazon and grabbed some books with decent reviews before, I thought I'd try to do myself one better and actually ask folks: what is some recommended introductory reading for understanding social movements (with extra interest given to anything with a quantitative slant, although that may be more advanced than an introductory text might cover)?\n\nThanks in advance.",
        "created_utc": 1505292427,
        "upvote_ratio": ""
    },
    {
        "title": "Why is looting more common in some countries than others?",
        "author": "MrOaiki",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ztb8d/why_is_looting_more_common_in_some_countries_than/",
        "text": "Every time I see a natural disaster happening in the US I see footage of looting. When the same thing happened in Japan, I read there were no instances of looting. Is it a correct assumption that looting is more common in some countries than others, and in that case, why is that so?",
        "created_utc": 1505292095,
        "upvote_ratio": ""
    },
    {
        "title": "How do prisoners get desensitized to the degrading and humilating treatment in prisons?",
        "author": "5i5yphu5",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zsghb/how_do_prisoners_get_desensitized_to_the/",
        "text": "Do they just get used to it and become hardened? Or do they not and suffer psychological trauma?",
        "created_utc": 1505278142,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate is the BBC documentary _Overpopulated_? Is there a different documentary that does a good job of explaining the Earth's growing population?",
        "author": "The_Sven",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zmctt/how_accurate_is_the_bbc_documentary_overpopulated/",
        "text": "[The documentary in question](https://youtu.be/-UbmG8gtBPM).\n\nI'm student teaching and the teacher wanted me to find a good documentary to replace her 25 year old VHS tape. I found _Overpopulated_ and am reviewing it now but it isn't my area of expertise and I don't want to accidentally show the kids a bad documentary. So is it a good and accurate documentary?",
        "created_utc": 1505215869,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence that people 20-35 are/were studying \"useless\" degrees at a higher proportion than older age brackets?",
        "author": "excusemeimclassy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zjq1g/is_there_any_evidence_that_people_2035_arewere/",
        "text": "By \"useless\" I mean the stereotypical basket weaving majors that are usually lampooned as stupid choices. Anything non-STEM, business, nursing, engineering, etc.",
        "created_utc": 1505178512,
        "upvote_ratio": ""
    },
    {
        "title": "If 2 friends or a couple were having dinner together, Statistically what are the chances (percentage of people) that would prefer washing dishes to cooking when splitting chores?",
        "author": "15MOG",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zi08b/if_2_friends_or_a_couple_were_having_dinner/",
        "text": "[removed]",
        "created_utc": 1505161093,
        "upvote_ratio": ""
    },
    {
        "title": "Desperately in need of anger management help",
        "author": "hatsandrats",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zh7r1/desperately_in_need_of_anger_management_help/",
        "text": "[removed]",
        "created_utc": 1505153914,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any cultural or social histories of monasteries? Monastic systems anywhere in the world during any time period?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zg589/are_there_any_cultural_or_social_histories_of/",
        "text": "",
        "created_utc": 1505144167,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | September 11, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zflc8/monday_reading_and_research_september_11_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1505138759,
        "upvote_ratio": ""
    },
    {
        "title": "The use of game theory in the cold war",
        "author": "gt6775rf",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zf8mi/the_use_of_game_theory_in_the_cold_war/",
        "text": "Any good, reliable resources for this. e.g science journals...",
        "created_utc": 1505134991,
        "upvote_ratio": ""
    },
    {
        "title": "Tips for an Economics major",
        "author": "proximacentauri9",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zf30w/tips_for_an_economics_major/",
        "text": "[removed]",
        "created_utc": 1505133152,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between \"splitting\" and \"dichotomous thinking\" in patients diagnosed with emotionally unstable personality disorder (previously called borderline personality disorder)?",
        "author": "StWd",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zbnnt/what_is_the_difference_between_splitting_and/",
        "text": "In this paper: http://www.sciencedirect.com.plymouth.idm.oclc.org/science/article/pii/S0005796712001179\n\n\"Social cognition in borderline personality disorder: Evidence for dichotomous thinking but no evidence for less complex attributions\" by Arnoud Arntz and José ten Haaf in *Behaviour Research and Therapy* (2012)\n\ndichotomous thinking is operationalised using the definition \"Extreme evaluation style (“black or white”)\" and splitting is operationalised following the definition \"Viewing others as either completely good or completely bad (“all good or all bad”)\". Previously I have always understood splitting and dichotomous thinking to be similar positive symptoms of the same negative symptom of being able to think in neutral terms and often presented as patients automatically saying things like \"always\" and \"never\", even when they only mean \"sometimes\", or expressing extreme hatred or love when assessing affect towards others (i.e. an inability to think ambiguously about them which leads to the presentation of \"unstable and intense relationships\" as a key diagnostic criteria for the disorder). In the discussion section of the paper, it reads: \"The evaluations by BPD-patients were not characterized by complete affective polarization, as expected with splitting. Thus, although in the structured format the BPD group showed elevated splitting scores for all roles, these were either not all positive or all negative, or as affectively polarized.\"\n\nI am finding it difficult still to understand what the difference is between splitting and dichotomous thinking. The discussion also says that \"Our findings were not fully in support of the construct of splitting.\" which leads me to believe that \"splitting\" is not a distinct enough concept from \"dichotomous thinking\" and wonder if this is what the paper gets at with these points. ",
        "created_utc": 1505085604,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between an anthropological ethnography and a sociological ethnography? Is there one? Any examples of either?",
        "author": "tereddits",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zanqq/what_is_the_difference_between_an_anthropological/",
        "text": "",
        "created_utc": 1505075280,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any works utilizing ethnography that focus on a wealthy community?",
        "author": "tereddits",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6zaljj/are_there_any_works_utilizing_ethnography_that/",
        "text": "",
        "created_utc": 1505074693,
        "upvote_ratio": ""
    },
    {
        "title": "What are your favorite and/or most read blogs and podcasts?",
        "author": "meoxu8",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6z0ky9/what_are_your_favorite_andor_most_read_blogs_and/",
        "text": "[removed]",
        "created_utc": 1504944374,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Looking for women sexuality statistics",
        "author": "Wmwmwmwmwmwmwmwm",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6z0goi/question_looking_for_women_sexuality_statistics/",
        "text": "I've been interested in women sexuality, mostly about the data/statistics. So I came here with some interest to find out how percentage vise are some sexual acts.\n\nHow goes the percentage of women enjoyment (some recent and thrustworthy data hopefully) between sexual acts (just to mention some as PiV, PiA, cunnilingus and fingering etc.)\n\nAlso I'd really love to know a percentage scale of orgasms from sexual acts (best,worse etc.)\n\nHopefully someone can provide me with some recent data. Thanks in advance &lt;3\n",
        "created_utc": 1504941985,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | September 08, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yuywj/friday_freeforall_september_08_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1504879555,
        "upvote_ratio": ""
    },
    {
        "title": "What is the cultural and political effect of immigration?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ytcfs/what_is_the_cultural_and_political_effect_of/",
        "text": "[removed]",
        "created_utc": 1504856166,
        "upvote_ratio": ""
    },
    {
        "title": "Relationships: What attracts certain people to eachother",
        "author": "14qjk",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yt94j/relationships_what_attracts_certain_people_to/",
        "text": "[removed]",
        "created_utc": 1504854707,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone here familiar with cultural psychology?",
        "author": "morpheusx66",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ysmq9/anyone_here_familiar_with_cultural_psychology/",
        "text": "I recently learned about the discipline, it's fairly obscure but seems to incorporate a lot of what I'm primarily interested in (relation between the mind and ones culture/society). It's very similar to \"psychological anthropology\" which is also of interest to me but has partly different methodologies: namely ethnographic theorizing vs. controlled experiments.",
        "created_utc": 1504845766,
        "upvote_ratio": ""
    },
    {
        "title": "Why are N. Korea and Cuba perceived so differently?",
        "author": "one_of_two_people",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yrwr0/why_are_n_korea_and_cuba_perceived_so_differently/",
        "text": "To clarify, I have grown up in the deep south US so my world view has been skewed by politics and culture thereof until recently. Better stated my question would be\n\n**Why does the life of an average citizen vary so much between North Korea and Cuba?**\n\nBoth have had similar political and social  structures. became cut off from portions of the world. They are both portrayed in popular culture as having strict regime and contempt in general for the US. If you watch any number of travel TV shows you can quite easily learn about \"life of an average person\" in these countries.\n\nBut with trade relations in Cuba are lifting we are finding about things like [this](http://gizmodo.com/cubas-illegal-underground-internet-is-thriving-1681797114) (I've seen a more recent article that goes a little more in depth of the \"how\" of it). It has me wondering why the culture I imagine when I think of cuba is that of being aware that the US is a possible choice to escape if it ever gets worse than it is. While the culture I imagine for N. Korea is one of general fear and blindly trust/brainwashed to obey the government. **Why is my perception of them so different?**",
        "created_utc": 1504836926,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a statistical correlation between level of education and belief in (man-made) global warming?",
        "author": "bsolidarity",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yragm/is_there_a_statistical_correlation_between_level/",
        "text": "",
        "created_utc": 1504830116,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if a congressman brought an air horn to interrupt other people's speeches?",
        "author": "Sine_Habitus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yr3ma/what_would_happen_if_a_congressman_brought_an_air/",
        "text": "[removed]",
        "created_utc": 1504828049,
        "upvote_ratio": ""
    },
    {
        "title": "why did society come into existence?",
        "author": "jaybobular",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yo9rn/why_did_society_come_into_existence/",
        "text": "[removed]",
        "created_utc": 1504801299,
        "upvote_ratio": ""
    },
    {
        "title": "Does an ethnic name hamper your chances of employment in North America?",
        "author": "kaoikenkid",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ynd1p/does_an_ethnic_name_hamper_your_chances_of/",
        "text": "",
        "created_utc": 1504792668,
        "upvote_ratio": ""
    },
    {
        "title": "42% of adult Americans have switched religions at least once in their lifetime. Do any other countries have similar numbers?",
        "author": "ClockToeTwins",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ymsjd/42_of_adult_americans_have_switched_religions_at/",
        "text": "Source for data: http://www.pewresearch.org/fact-tank/2015/08/27/10-facts-about-religion-in-america/?amp=1\n\nDo any other countries have similar numbers to this? Finding survey data on this topic is a bit difficult. Grateful for anyone who can provide any type of data for other countries.\n\n\n",
        "created_utc": 1504786190,
        "upvote_ratio": ""
    },
    {
        "title": "What's something you had to unlearn?",
        "author": "GuerillaBoyfriend",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ym8y0/whats_something_you_had_to_unlearn/",
        "text": "[removed]",
        "created_utc": 1504778472,
        "upvote_ratio": ""
    },
    {
        "title": "Criminal Justice books?",
        "author": "party_tiger",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ykpcl/criminal_justice_books/",
        "text": "I'm a first year Criminal Justice student and am looking for any books on the following that give you a clear understanding of the topic, have good references backed up by solid evidence, or anything that might give an extra bit of info that while not needed would give any essays a leg up.\n\n• Politics and International Relations\n• Public Administration \n• Sociology\n• Criminal Law \n• Legal Systems and Methods\n\nI'm studying in Ireland, so books would ideally but not wholly be focused on Ireland/the UK. I do still want to learn about other countries, as it could only help, but again, main focus on the two aforementioned.\n\nTIA to anyone who bothers to read this and/or help. If you have any other recommended reading or audio books or any advice, please say so :)",
        "created_utc": 1504754840,
        "upvote_ratio": ""
    },
    {
        "title": "Why is random choice\\lottery considered better than wealth for dealing with shortages during disasters?",
        "author": "butterChickenBiryani",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yifl8/why_is_random_choicelottery_considered_better/",
        "text": "In various disaster situations,where say Ubers or flights are in short supply,it is always a PR nightmare when prices go up to balance supply and demand. \n\nBut, OTOH when prices are capped ,it will anyways result in shortages (if it wouldn't result in shortages with price caps , price hikes wouldn't be much anyways) \n\nThe only difference seems to be,instead of allowing people to take a call on whether they can afford to get out of a bad situation depending on how much money they have, forcing them into what's essentially random chance seems to be seen as better by people. Why? \n\n",
        "created_utc": 1504731104,
        "upvote_ratio": ""
    },
    {
        "title": "Is condemnation and intolerance of public nudity in inappropriate places common to all societies and cultures?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yhw2v/is_condemnation_and_intolerance_of_public_nudity/",
        "text": "As in dense cities, as in having completely nude men walking down busy streets or lounging in sidewalk cafes, with women and children about?  As in what transpired in San Francisco for several years?\n\nhttp://nymag.com/daily/intelligencer/2014/03/castro-san-franciscos-public-nudity-ban.html\n\nOr do some societies find this acceptable? *(Considering all cultures throughout Europe/Middle East, Asia and the Pacific, Africa, the Americas, etc.)*\n\nAnd considering that some societies have time and place distinctions, that nudity is accepted at designated beach parks (or defacto nude beaches) or perhaps parks like Berlin's Tiergarten Park, but would *not* be allowed throughout the city at large.  *The distinction is both fundamental and important.*\n\n(And appreciate observations on notable past cultures, e.g., Maya, Roman, Cahokia (Amerindian by Missouri), Egyptian, etc., if available.  They all had large, dense communities.)",
        "created_utc": 1504726081,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone tested the veracity of Democrat or Republican political ideas?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yhuve/has_anyone_tested_the_veracity_of_democrat_or/",
        "text": "[removed]",
        "created_utc": 1504725801,
        "upvote_ratio": ""
    },
    {
        "title": "What can be done about the youth?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ygl8c/what_can_be_done_about_the_youth/",
        "text": "[deleted]",
        "created_utc": 1504714358,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone recommend some good sources about human service work and its role in society?",
        "author": "sesame_snapss",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ygdpv/can_anyone_recommend_some_good_sources_about/",
        "text": "I have to discuss whether human services work is an opportunity for social change or a means of social control, and I'm having a hard time finding relevant sources, particularly journal articles. I'd highly appreciate any help!",
        "created_utc": 1504712385,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | September 06, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yftnc/theory_wednesday_september_06_2017/",
        "text": "[removed]",
        "created_utc": 1504706782,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we like points in games and real life so much? and why do they matter to us?",
        "author": "jaybobular",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yf10l/why_do_we_like_points_in_games_and_real_life_so/",
        "text": "",
        "created_utc": 1504697174,
        "upvote_ratio": ""
    },
    {
        "title": "Canada recidivism rates - Thesis help",
        "author": "Anonymous_goats",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yeq1l/canada_recidivism_rates_thesis_help/",
        "text": "Hi, \n\nI'm from Australia doing my thesis on Indigenous female prisoners in Canada and Australia. While I've found literature related to Australian context, I'm **really** struggling to find up-to-date recidivism rates on Aboriginal female prisoners in Canada. \n\nDoes anyone know where they are located? I've looked everywhere! Correctional services canada; StatCans; Google Scholar. I can't find anything!",
        "created_utc": 1504692523,
        "upvote_ratio": ""
    },
    {
        "title": "How did Hitler become Hitler?",
        "author": "butteryvagina",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6yeklp/how_did_hitler_become_hitler/",
        "text": "I know my question seems very broad or even obvious but what I am trying to figure out is how Hitler convinced a nation that genocide was for the greater good? I know their was fear mixed into it but was there a social stigma already in place that made it possible for Nazi's to follow suit so easily? How does a single man convince a nation that genocide is not a big deal? How did Hitler do it?",
        "created_utc": 1504689963,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any ethnographic works that consist of, or make prominent use of, still photography?",
        "author": "tereddits",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6ybmcn/are_there_any_ethnographic_works_that_consist_of/",
        "text": "",
        "created_utc": 1504651902,
        "upvote_ratio": ""
    },
    {
        "title": "What is the main difference between legal analysis (dealing with specific laws) and qualitative public policy analysis?",
        "author": "guileus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6y8owl/what_is_the_main_difference_between_legal/",
        "text": "Being that public policies are mostly based on laws (at least in parliamentary systems, and at least in the Spanish system even regulations stemming from the executive power are considered \"laws\" even if they do not bear that title, IIRC), what would be the difference between saying you're doing \"public policy analysis\" and \"legal analysis of a reform\"?",
        "created_utc": 1504625115,
        "upvote_ratio": ""
    },
    {
        "title": "Interest rates and quantity theory of money",
        "author": "channelisingslayer",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6y6akq/interest_rates_and_quantity_theory_of_money/",
        "text": "[removed]",
        "created_utc": 1504594125,
        "upvote_ratio": ""
    },
    {
        "title": "Topics for a sociology essay",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6y1hy9/topics_for_a_sociology_essay/",
        "text": "[deleted]",
        "created_utc": 1504543759,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | September 04, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6y0hxm/monday_reading_and_research_september_04_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1504533937,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Raven's Progressive Matrices test biased in favor of East Asians?",
        "author": "RedHermit1982",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6y0dnu/is_the_ravens_progressive_matrices_test_biased_in/",
        "text": "I often argue with \"race realists\" and a big part of their whole view is that Asians are naturally smarter. There's some other pseudoscience involved—yadda yadda r-k selection, blah blah blah IQ and penis size are inversely correlated—but I was wondering if there might be another reason why East Asians consistently score higher on IQ tests.\n\nI couldn't find any literature on the topic, but it seems to me that East Asians might have a cultural advantage on Raven's Progressive Matrices because their languages all involve memorizing and recognizing lots and lots of characters. I read about something similar in terms of advantages in math, i.e. East Asian languages deal with numbers in a simpler way so children can begin working with numbers at a young age.\n\nDoes anyone know? Thanks.",
        "created_utc": 1504532556,
        "upvote_ratio": ""
    },
    {
        "title": "Race, Social or Biological Construct?",
        "author": "CalebJackW14",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xy6ce/race_social_or_biological_construct/",
        "text": "[removed]",
        "created_utc": 1504499822,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any validity to this idea?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xv920/is_there_any_validity_to_this_idea/",
        "text": "[removed]",
        "created_utc": 1504467330,
        "upvote_ratio": ""
    },
    {
        "title": "Sociology research regarding patients and physicians.",
        "author": "KevinGus867",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xv3o0/sociology_research_regarding_patients_and/",
        "text": "Hey everyone, this is my first time in this subreddit. I am conducting research with a professor of mine, this research is about patients view of physicians. We are wanting to narrow our research down, however, are having a difficult time deciding how we want to proceed. Any advice from fellow social science researchers? We would love to conduct this research using surveys. Anyone here conduct research with physicians before? How did this go?\n\nKevin ",
        "created_utc": 1504465823,
        "upvote_ratio": ""
    },
    {
        "title": "https://youtu.be/wg7D_7oYHAo",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xunp4/httpsyoutubewg7d_7oyhao/",
        "text": "[removed]",
        "created_utc": 1504461398,
        "upvote_ratio": ""
    },
    {
        "title": "Do people in the UK have children purely for the extra benefits/welfare?",
        "author": "Wazzok1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xug1q/do_people_in_the_uk_have_children_purely_for_the/",
        "text": "The only papers I could find were studies conducted in the US in the mid-1990s, which say that the extra welfare mothers received was relatively low.\n\nCurrently in the UK, mothers receive an extra £712 a year for each child.\n\nIt appears to me that a parent with 2 children gets almost 2x less benefits than a parent with 5 children does.\n\nDoes anyone have any evidence to support the hypothesis that poor British families have more children to earn more benefits?\n\nDoes anyone have any evidence which suggests otherwise?",
        "created_utc": 1504459329,
        "upvote_ratio": ""
    },
    {
        "title": "Psychology of Fascism",
        "author": "morpheusx66",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xucno/psychology_of_fascism/",
        "text": "I'm really curious about the psychological underpinnings of the fascist/Nazi mindstate. I know it requires you make essentialized statements as individuals vary but a lot of social and cultural psychologists have speculated on the underlying \"personality\" of fascism and it's generally said that it upholds the personality trait \"conscientiousness\" (orderliness, cleanliness, etc.) to pathological levels (a trait which is often correlated with conservatism). Also, I'd safely guess most nazis and alt-righters are low in the trait \"openness\"\n\nThe funny part is a lot of early/pre Nazi culture, art, etc. bears a striking resemblance to far left hippie culture, despite being ideologically polar in many ways (tribal and exclusive vs. global and inclusive), it seems there's an emotional common ground rooted in Romanticism. Early Nazis were very interested in the occult, mythology, healthy and organic eating (there are still major organic co ops run by Neo-Nazis), some of the early Nazi sympathizing artists (like Fidus) had a style which was influential to 60s psychedelic art. Also, many of the proto-Nazis promoted communal nudism (check the prewar book \"Geist und Schönheit\", its full of healthy, idealized, naked exercising Germans). Of course the official Nazis denounced all this, I find it weird that fascism has always seemed to have a strong contingent of hippie dippie romantics.\n\nAny ideas on all this?",
        "created_utc": 1504458443,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a dialectical materialist critique of Paul Feyerabend's 'Against Method'?",
        "author": "energyper250mlserve",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xsq3r/is_there_a_dialectical_materialist_critique_of/",
        "text": "I've found a link to \"Feyerabend's discourse against method: a Marxist critique\", but it's severely paywalled and I'm no longer in an institution. I'm also interested in any other similar critiques of his unusual stand, particularly from an anti-imperialist or Marxist perspective. Have x-posted to r/communism and r/communism101, as I'm not 100% sure where this question/request fits best.",
        "created_utc": 1504439528,
        "upvote_ratio": ""
    },
    {
        "title": "Labour used to be commonly viewed as rehabilitative. Is there any evidence for or against rehabilitation through labour?",
        "author": "energyper250mlserve",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xry3d/labour_used_to_be_commonly_viewed_as/",
        "text": "Basically what it says in the title. Is there any evidence that labour either improves or hinders rehabilitation outcomes, measured through criterion like recidivism and contrition?\n\nIf this isn't possible to answer because no one has made a justice system that focused on rehabilitation for us to look at, is there a next closest thing we could look at?",
        "created_utc": 1504425141,
        "upvote_ratio": ""
    },
    {
        "title": "What do social scientists here think of the work of the German sociologist Frank Adloff? Is his marriage of Hans Joas-type Pragmatism and french Convivialism something new?",
        "author": "trivisiomea",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xqhqh/what_do_social_scientists_here_think_of_the_work/",
        "text": "",
        "created_utc": 1504403535,
        "upvote_ratio": ""
    },
    {
        "title": "Is Silvia Federici considered a sociologist?",
        "author": "trivisonno444",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xpnst/is_silvia_federici_considered_a_sociologist/",
        "text": "She is more commonly referred to as a philosopher and maybe a social scientist (but not specifically a sociologist). I would consider her to be a sociologist because the bulk of her work is based on women's relation to capital. She's also one of the main contributors to the development of the concept of reproduction as key to class relations of exploitation and domination in local and global contexts.I can see that this could be philosophy or political science but sometimes theories of the social sciences overlap. Do you think she could be referred to as a sociologist? \nThanks in advance!",
        "created_utc": 1504393790,
        "upvote_ratio": ""
    },
    {
        "title": "What is good and what is bad about online social media use?",
        "author": "NottinghamDF",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/6xlyyw/what_is_good_and_what_is_bad_about_online_social/",
        "text": "[removed]",
        "created_utc": 1504359443,
        "upvote_ratio": ""
    }
]