[
    {
        "title": "Artificial light vs the day sky.",
        "author": "Kaibur02",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cqzhz/artificial_light_vs_the_day_sky/",
        "text": "So you know how City lights reduce the visibility of stars in the night sky, what would the effects be on the sky during the day if all of the lights in an area were turned on?\n\nProbably a stupid question but I'm bored so.",
        "created_utc": 1536022767,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if something expanded infinitely inside of a room that could never be broken?",
        "author": "Benvincent9177",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cql01/what_would_happen_if_something_expanded/",
        "text": "If the answer depends on the object, the object will be wood.\n\nEdit: Yeah, I know this is impossible.",
        "created_utc": 1536019496,
        "upvote_ratio": ""
    },
    {
        "title": "Did the Zeitgeist Movement or Venus Project ever offer a specific plan for how we’d switch from our current society to their utopian Resource Based Economy?",
        "author": "Grande_Latte_Enema",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cq9xq/did_the_zeitgeist_movement_or_venus_project_ever/",
        "text": "i was intrigued by the zeitgeist films and resource based economy but they failed to present a step by step plan for the transition \n\nyou cant go from now to rbe overnight and expect farmers and truckers to keep sending food and fuel etc\n\nhow do we suddenly stop using money and begin sharing everything based on what a computer claims is the best allocation of resources?\n\nwhats the gameplan to get from here to there?  they never offered that info so i gave up on them",
        "created_utc": 1536017003,
        "upvote_ratio": ""
    },
    {
        "title": "Is someone willing to talk with me about fake science and making it sound real?",
        "author": "reydeguitarra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cp42k/is_someone_willing_to_talk_with_me_about_fake/",
        "text": "Howdy, hopefully this post is allowed. I'm fairly unscientific, but I'm working on writing a novel that will have made up science dealing with the human body (along the lines of DNA or genes). My hope is to make fake science that could sound plausible as a discovery on the future. If you're somewhat familiar with the science of the human body and areas that are not really well understood where discoveries could later be made, I would love to consult with you. \n\nThis novel is a personal project I'm doing for fun, though I do hope to try to publish it, even if just self publishing. I would be happy to list you in the acknowledgments if I do manage to get it done!",
        "created_utc": 1536007910,
        "upvote_ratio": ""
    },
    {
        "title": "My parents don't know that my brother is gay,tell them?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cp2zh/my_parents_dont_know_that_my_brother_is_gaytell/",
        "text": "[removed]",
        "created_utc": 1536007681,
        "upvote_ratio": ""
    },
    {
        "title": "How would life on earth change if there wasn’t a moon?",
        "author": "benjamin_the_thirth",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9couu7/how_would_life_on_earth_change_if_there_wasnt_a/",
        "text": "",
        "created_utc": 1536006066,
        "upvote_ratio": ""
    },
    {
        "title": "If an alien observer in a nearby solar system were observing Earth when the energy from one of our nuclear weapons tests reached their planet, what would they be likely to see and deduce about Earth?",
        "author": "Curleysound",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cnr6b/if_an_alien_observer_in_a_nearby_solar_system/",
        "text": "With the first nukes going off less than 80 years ago, any observer would have to be inside 80 light years. At that distance, would even our biggest airburst register as anything separate from the Sun? What kind of instrumentation would they need?",
        "created_utc": 1535998265,
        "upvote_ratio": ""
    },
    {
        "title": "Do non-migratory animals/insects know about other regions of the world?",
        "author": "greengasser",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cn2hu/do_nonmigratory_animalsinsects_know_about_other/",
        "text": "Do they have any clue about the areas even directly outside of their habitat? \n\nWhat stops them from migrating?\nDo colonies of ants migrate or do they just move their nests around the general area?",
        "created_utc": 1535993544,
        "upvote_ratio": ""
    },
    {
        "title": "If you gave a person a steady supply of cellulase could they get sugar energy from eating grass?",
        "author": "TomJCharles",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cmkhc/if_you_gave_a_person_a_steady_supply_of_cellulase/",
        "text": "So imagine an implant that injects cellulase into the stomach when it detects the presence of grass (however that would work).  And assume that the implant can be topped off from outside the body via injection. \n\nIf the person then ate grass, presumably because there is no other food source, could they get energy from it? \n\nOr does cellulase still require time to work? As in, is it a fermentation process and the human digestive tract is too short to actually extract any energy from the grass? \n\n  \nMy from the hip assumption is that this would result in little, if any glucose production but I lack the background in ruminant and human biology to close the gaps. Or that there are other enzymes involved that are also lacking. Or that a person eating a stomach-full of grass would cause other issues. \n\nObviously, I'm imagining this as a military application for fiction. \n\n\nThanks! \n\n",
        "created_utc": 1535989990,
        "upvote_ratio": ""
    },
    {
        "title": "If there were no extinction level events, what types of species would you expect to be living today?",
        "author": "djYDNA",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cmhra/if_there_were_no_extinction_level_events_what/",
        "text": "In other words, what is the most likely DNA-based species we could expect to find living on other Earth-like planets, after \\~4 billion years of evolution, and billions more? Could there be species that basically represent the pinnacles of adaptation/evolution for DNA-based lifeforms on Earth-like planets?\n\n&amp;#x200B;\n\n\"Definitely don't go to THAT planet, life has been evolving there for 7 billion years with no setbacks. There's definitely apex-species there.\"",
        "created_utc": 1535989444,
        "upvote_ratio": ""
    },
    {
        "title": "What does the following sentence mean? Calculation in chemistry?",
        "author": "henryfranc",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cmefw/what_does_the_following_sentence_mean_calculation/",
        "text": "a composition have sodium salt,  chloride acid, reactant 1, reactant 2.  \npercent concentration of sodium salt + percent concentration of chloride acid percent concentration of reactant 1 percent concentration of reactant 2 = 100% (percent concentration by mass).\n\"Sodium salt have a concentration of 10 percent based on the weight of the chloride acid will be employed\" \nIn which chloride acid is 80gram, chloride acid have 67% (by mass) of the whole composition.\nHow does percent concentration of Sodium salt calculate? ",
        "created_utc": 1535988792,
        "upvote_ratio": ""
    },
    {
        "title": "How confident are we that the Big Bang occurred?",
        "author": "SirNanigans",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cm0tk/how_confident_are_we_that_the_big_bang_occurred/",
        "text": "When gravity didn't account for how galaxies rotated, there was a ton of controversy over the dark matter theory and it's still sometimes explained with key words like \"believe\" and \"theorize\" in scientific entertainment. The 'big bang', on the other hand, seems completely settled on. Any information on it explains it as a sure thing that must have happened whether is was a true beginning or not. The controversy surrounding dark matter was that our physics models didn't work and therefore we ought to consider the possibility that we're just wrong about the math, but I've heard it said that our laws of physics don't work at the point of the big bang, so...\n\nExactly how confident are we that there isn't another explanation?",
        "created_utc": 1535985895,
        "upvote_ratio": ""
    },
    {
        "title": "If we can test brain activity, can we test for hormonal disorders proficiencies or deficiencies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9clcdo/if_we_can_test_brain_activity_can_we_test_for/",
        "text": "[deleted]",
        "created_utc": 1535980148,
        "upvote_ratio": ""
    },
    {
        "title": "Could a space faring alien race be albe to harness the power of a neutron star inside their spaceships?",
        "author": "MateB30",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cl8az/could_a_space_faring_alien_race_be_albe_to/",
        "text": "In my fictional universe called \"Infested Skies,\" and advanced alien race called the Tuen, has the technology needed to create immense spaceships, that could be as long as 80km, wide and tall as 20km. Said ship is used to destroy planets, but I have described it more detailed in this post: https://www.reddit.com/r/theydidthemath/comments/9603qv/request_what_power_of_nuclear_explosion_would_be/ So, if you read this far, my question has two parts: a), Can a neutron star be as small as to fit into the spaceship, and b), Is it possible to move said neutron star, while keeping it in the middle of the ship's reactor?",
        "created_utc": 1535979122,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if every star in existence turned into a black hole the size of the biggest star we know today?",
        "author": "bran76765",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ckyiw/what_would_happen_if_every_star_in_existence/",
        "text": "",
        "created_utc": 1535976485,
        "upvote_ratio": ""
    },
    {
        "title": "MBBS Admission",
        "author": "misohil",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ck1w7/mbbs_admission/",
        "text": "[removed]",
        "created_utc": 1535966657,
        "upvote_ratio": ""
    },
    {
        "title": "If lightening were to strike an infinite plane of steel, how far would the energy travel from the initial strike?",
        "author": "The-Quite-One",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cjuio/if_lightening_were_to_strike_an_infinite_plane_of/",
        "text": "",
        "created_utc": 1535964184,
        "upvote_ratio": ""
    },
    {
        "title": "Could we ever understand an animal s \"language\"?",
        "author": "17Alecs",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cjuin/could_we_ever_understand_an_animal_s_language/",
        "text": "",
        "created_utc": 1535964183,
        "upvote_ratio": ""
    },
    {
        "title": "Do those 'posture corrector' braces actually work?",
        "author": "thibaultmol",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cjngg/do_those_posture_corrector_braces_actually_work/",
        "text": "I've been getting Facebook ads for those Velcro strap-braces that push back your shoulders which SUPPOSEDLY improve your posture...\n\n​\n\nDo those work/are they good for your health?",
        "created_utc": 1535961734,
        "upvote_ratio": ""
    },
    {
        "title": "Penis length related to gender of baby? Female babies being “mistakes” more often?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cirgf/penis_length_related_to_gender_of_baby_female/",
        "text": "I need to prove this chick I know wrong.\n\nShe’s a psychology major. Now has a bachelors in psychology. She thinks she’s really intelligent and has a hard time when people question or call bullshit on her claims, which no one ever does, besides me.\n\nOkay, back to the title: she believes that penis length is related to the gender of the child. She believes the longer the penis, the more likelihood of the child being a male, because “the penis is closer to the cervix during ejaculation and the semen is hotter when it hits the cervix that close and hotter sperm means a male baby will happen”.\n\nI say bullshit, show me the research. It better be peer reviewed, show it’s funding sources and who conducted the “study”. She sends me a link to some random website (it was through Snapchat so I don’t have the link anymore). The website was extremely shitty, there was no date on it, no evidence that it was peer reviewed, nor did it say who conducted the study and who funded it. \n\nAnd then she says the last part of my title. “Female babies are usually mistakes”. This...this I have no words for. How..how would you even conduct a study like that? Is there a genetic marker that says “MISTAKE” in flashing lights? Do you just go around asking parents with daughters if the condom broke? She believes this is legitimate science. She wouldn’t send me a link for this one, but claims she learned both of these things during her schooling.\n\nI just need someone to explain this shit to me, and tell me I’m not the crazy one here. If there’s another subreddit I can put this in please tell me.",
        "created_utc": 1535952203,
        "upvote_ratio": ""
    },
    {
        "title": "If the average human eye were a camera, what would be its specs?",
        "author": "western_shipps",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cigeu/if_the_average_human_eye_were_a_camera_what_would/",
        "text": "",
        "created_utc": 1535949142,
        "upvote_ratio": ""
    },
    {
        "title": "What would the long-term effects be if the ozone layer disappeared and didn't come back?",
        "author": "Conspiracy_23",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9chj6q/what_would_the_longterm_effects_be_if_the_ozone/",
        "text": "I'm thinking hundreds of thousands of years. I don't care how, but in this hypothetical situation, somehow it's unable to reform. What would happen to the atmosphere, the life, the oceans, etc? Any speculation or insight is welcome and appreciated.",
        "created_utc": 1535940149,
        "upvote_ratio": ""
    },
    {
        "title": "Where do Hermit Crab shells come from?",
        "author": "Ceasar_Rex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ch76k/where_do_hermit_crab_shells_come_from/",
        "text": "Do they make them and then share them or does another animal make them?",
        "created_utc": 1535936951,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to have a 100ft tall giant.",
        "author": "ForcedRonin",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cgy2x/is_it_possible_to_have_a_100ft_tall_giant/",
        "text": "Obviously, we’ve had some giants living in the past (dinosaurs). I’ve heard, increased levels of oxygen will allow for living organisms to grow larger. I know gravity plays a role as well. Given an ideal environment, (whatever that may be) could a living organism grow that large? ",
        "created_utc": 1535934563,
        "upvote_ratio": ""
    },
    {
        "title": "Would keeping ice in my freezer reduce the time for new water in the freezer to cool?",
        "author": "zzomtceo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cgwqh/would_keeping_ice_in_my_freezer_reduce_the_time/",
        "text": "I have a not-very-powerful freezer in my dorm room and I try to use it to cool hot tea into iced tea, but of course this is very inefficient and takes a while. I would very much prefer this process to be faster, so I was wondering: would the thermal mass of a large amount of ice in the freezer cause the liquid I put in to cool significantly faster? I know once it gets heated by the tea going in it would have less capacity to absorb heat until it froze again but I don't think that should be an issue because the water could be getting chilled all day when there is no tea in there and the cooling powers are just being wasted, plus the temp of the stored water would never be higher than the water that gets put in and the water that gets put in is quite hot so at worst it seems like the effect after excessively heating the cache of water/ice should be neutral. ",
        "created_utc": 1535934213,
        "upvote_ratio": ""
    },
    {
        "title": "Sustoining life on another planet without water",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cgh23/sustoining_life_on_another_planet_without_water/",
        "text": "[deleted]",
        "created_utc": 1535930231,
        "upvote_ratio": ""
    },
    {
        "title": "Do volts or amps matter if they multiply to the same wattage?",
        "author": "Sengial",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cgcv7/do_volts_or_amps_matter_if_they_multiply_to_the/",
        "text": "If you have 5A and 2V, they create 10W. What is the difference to 10V and 1A?",
        "created_utc": 1535929233,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any real-time online chat communities dedicated to Science?",
        "author": "NateBroChill",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cg6ob/are_there_any_realtime_online_chat_communities/",
        "text": "Are there any real-time online chat communities dedicated to Science? For example, on a platform such as Slack, Discord, Zulip, etcetera. Preferably it would also be local to help facilitate get-togethers and such.",
        "created_utc": 1535927723,
        "upvote_ratio": ""
    },
    {
        "title": "Have genes from bio-engineered foods shown up in unexpected pants/animals?",
        "author": "WanderingTapir",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cfnzf/have_genes_from_bioengineered_foods_shown_up_in/",
        "text": "TY  - JOUR\nAU  - Marvier, Michelle\nAU  - Van Acker, Rene C.\nTI  - Can crop transgenes be kept on a leash?\nJO  - Frontiers in Ecology and the Environment\nVL  - 3\nIS  - 2\nSN  - 1540-9295\nUR  - https://doi.org/10.1890/1540-9295(2005)003[0093:CCTBKO]2.0.CO;2\nDO  - doi:10.1890/1540-9295(2005)003[0093:CCTBKO]2.0.CO;2\nSP  - 93\nEP  - 100\nPY  - 2005\nAB  - Debates about the benefits and risks of genetically modified (GM) crops need to acknowledge two realities: (1) the movement of transgenes beyond their intended destinations is a virtual certainty; and (2) it is unlikely that transgenes can be retracted once they have escaped. Transgenes escape via the movement of pollen and seeds, and this movement is facilitated by the growing number of incidents involving human error. Re-examination of our risk management policies and our assumptions about containment is essential as genes coding for pharmaceutical and industrial proteins are being inserted into the second generation of GM food crops. Even the best designed risk management can be foiled by human error, a reality that is underestimated by most GM crop-risk analyses. Thus, our evaluation of risk should assume that whatever transgene is being examined has a good chance of escaping.\nER  -\n\n[GM genes found in human gut bacteria](http://www.ask-force.org/web/debate/Guardian20020717.pdf)\n\n[Artificial DNA Base Pair Expands Life's Vocabulary - D-brief](http://blogs.discovermagazine.com/d-brief/2017/11/30/dna-base-pair-codon-artificial/)",
        "created_utc": 1535923408,
        "upvote_ratio": ""
    },
    {
        "title": "Have insects evolved because of human activity, and if so in what ways? For example, natural selection and pesticides used in agriculture.",
        "author": "WanderingTapir",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cfjao/have_insects_evolved_because_of_human_activity/",
        "text": "Have insects evolved because of human activity, and if so in what ways? For example, natural selection and pesticides used in agriculture. It seems like according to the theory of evolution and the fast breeding rate of insects that there would be some micro-changes in insects biology. Are some insects now immune to certain insecticides?",
        "created_utc": 1535922370,
        "upvote_ratio": ""
    },
    {
        "title": "Why has nothing like humans ever evolved elsewhere?",
        "author": "SummerAndTinkles",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cfau6/why_has_nothing_like_humans_ever_evolved_elsewhere/",
        "text": "Most biologists are familiar with the concept of convergent evolution, where different unrelated species will evolve a similar body type or niche either in a different time period or a different location. A classic example is sharks, dolphins, and ichthyosaurs, but there's many, many, MANY others. Too many to list, in fact.\n\nSo, that makes me wonder why humans are the odd one out. Why haven't any animals independently evolved into human-like forms? \n\nIt's not like the human niche/body type is an unsuccessful one, quite the opposite in fact. Humans are probably the most successful and adaptable creatures on the whole planet, and you'd think at least one other life form on the planet would want to copy them. (Not consciously, obviously. Most animals are unaware of their own evolution.)\n",
        "created_utc": 1535920474,
        "upvote_ratio": ""
    },
    {
        "title": "Because climate change causes sea levels to rise, does it also cause lakes, such as the Great Lakes of North America, to flood as well? If not, do lakeside communities have a completely different host of problems to deal with, in regards to climate change?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cemgy/because_climate_change_causes_sea_levels_to_rise/",
        "text": "What kinds of problems does climate change bring up for lakeside communities, such as those bordering the Great Lakes?",
        "created_utc": 1535915261,
        "upvote_ratio": ""
    },
    {
        "title": "What if a blue bomb for hackers could be programmed to capture the source?",
        "author": "Redditjwg2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cdn1g/what_if_a_blue_bomb_for_hackers_could_be/",
        "text": "[removed]",
        "created_utc": 1535907916,
        "upvote_ratio": ""
    },
    {
        "title": "Can nanotechnology increase intelligence of adults ? And would it be as effective and efficient as when modified during embryonic development ??",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cbxat/can_nanotechnology_increase_intelligence_of/",
        "text": "[deleted]",
        "created_utc": 1535893798,
        "upvote_ratio": ""
    },
    {
        "title": "Where are our memories physically stored in our central nervous system?",
        "author": "zekeflintstone",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cbvjd/where_are_our_memories_physically_stored_in_our/",
        "text": "How is it possible that every memory is physically stored in cells?  I've had experiences with meditation and hypnosis where I went back deep into my past, and with incredible sensory detail I've recalled people places and situations I had not thought about in over 30 years.  These experiences are sometimes so vivid, I wonder if seemingly simple contemplations such as this are evidence of other dimensions or an afterlife or a multiverse etc..",
        "created_utc": 1535893307,
        "upvote_ratio": ""
    },
    {
        "title": "Instantaneous Rate",
        "author": "alondra816",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cbriy/instantaneous_rate/",
        "text": "What is the formula in getting instantaneous rate of reaction?",
        "created_utc": 1535892107,
        "upvote_ratio": ""
    },
    {
        "title": "Would an artificially grown human brain have a consciousness?",
        "author": "DarwinApprentice",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cb4sy/would_an_artificially_grown_human_brain_have_a/",
        "text": "",
        "created_utc": 1535883976,
        "upvote_ratio": ""
    },
    {
        "title": "Is it feasible to simply dilute nuclear waste to the point where it's about as radioactive as normal waste?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cayra/is_it_feasible_to_simply_dilute_nuclear_waste_to/",
        "text": "[deleted]",
        "created_utc": 1535881532,
        "upvote_ratio": ""
    },
    {
        "title": "Can we access ancestral memory?",
        "author": "Immortal_Scholar",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cavd3/can_we_access_ancestral_memory/",
        "text": "It's been theorized that our DNA holds the exact memories of all of our ancestors. If this is so, then it would definitely be an endeavor of the future to create technology that can show us these memories. But if it's already within our genes, is there some way that we ourselves could somehow \"remember\" these memories on our own?",
        "created_utc": 1535880108,
        "upvote_ratio": ""
    },
    {
        "title": "Can our cells communicate with cells of somebody else?",
        "author": "Immortal_Scholar",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9catvy/can_our_cells_communicate_with_cells_of_somebody/",
        "text": "&amp;#x200B;",
        "created_utc": 1535879510,
        "upvote_ratio": ""
    },
    {
        "title": "Is the amount of quantum superposition in the universe increasing, decreasing or staying the same?",
        "author": "barnabyg2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9cao44/is_the_amount_of_quantum_superposition_in_the/",
        "text": "&amp;#x200B;",
        "created_utc": 1535877202,
        "upvote_ratio": ""
    },
    {
        "title": "Are there comets whose orbits don't reach beyond Neptune's that can still display tails?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c8igb/are_there_comets_whose_orbits_dont_reach_beyond/",
        "text": "It seems likely that such trips would ensure they fall in ~6% of extinct comets that have had their ices depleted from their time in the inner system.  \n\nIf any such knowledgeable gods walk among us like centaurs through the lands of giants: I'm also interested in the ratio of Kuiper Belt comets to Oort Could comets. How many of the them get to flash their tails each year and comparatively what's their average mass &amp; speed?  \n\nThanks and stay frosty.",
        "created_utc": 1535852671,
        "upvote_ratio": ""
    },
    {
        "title": "If teleportation were to be invented, would we die when teleporting?",
        "author": "cckcamel",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c6zcs/if_teleportation_were_to_be_invented_would_we_die/",
        "text": "Hello. I’ll try to explain the title better.\nLet’s say we have a teleport that scans your body, destroys it, transmits it to another teleport and then recreates it perfectly (even the current electrical signals going through the brain), would the person coming out of it be the same person that entered?\n\nThe answer is yes, I think. If everything is preserved the person coming out should act, feel and think like the one who entered. \n\nNow, please, look around, touch something. ‘You’ are experiencing all of this using your body and brain. You then teleport, successfully. Now, are we sure that the one who is experiencing life now, is still ‘you’, and not a copy?\n\nAt this point the title should make more sense. Would ‘we’ die when teleporting, only to be replaced by an identical copy?",
        "created_utc": 1535839182,
        "upvote_ratio": ""
    },
    {
        "title": "Without modern medicine how would immunity spread most safely through a naive population?",
        "author": "Getnoisy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c6xbn/without_modern_medicine_how_would_immunity_spread/",
        "text": "Specifically I am thinking about the grand tragedy of the spread of diseases from Europe to the new world. Obviously there were horrendously malevolent acts of purposeful spreading of diseases such as small pox. However, would there have been a way for Europeans (or the First Nations of the Americas) to significantly reduce the amount of active infection resulting in death, ending up with similar levels of immunity to diseases in the First Nations and European populations? To my understanding, simply not purposefully trying to infect the native populations would be insufficient. \n\nI am guessing that given multiple vectors of transmission (e.g. human-human, animal-human) and different levels of infectivity/lethality of diseases there would not be single answer to this.",
        "created_utc": 1535838700,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone who knows his thermodynamics and is a fan of My hero academia? What's the math behind Shouto's quirk?",
        "author": "Arthur_Penfox",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c6kp9/anyone_who_knows_his_thermodynamics_and_is_a_fan/",
        "text": "What would happen when Todoroki Shouto activates both sides Ice/Flames? How would air behave in his proximity? And what if he spins?",
        "created_utc": 1535835982,
        "upvote_ratio": ""
    },
    {
        "title": "What if we used Machine Learning to study brain activity while practicing physical skills, and used magnetic/electrical impulses to retrigger the same brain activity, or even fine tune it?",
        "author": "CaptainJonHarvey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c5ybk/what_if_we_used_machine_learning_to_study_brain/",
        "text": "How about an even deeper thing. Say like if a machine is rigged to analyze your brain activity and eyesight, and muscles, and all of that, while throwing darts, and analyzed what your brain and body did as it got closer to hitting its mark, and then sent calculated electrical or magnetic impulses to get you to do it better and better?\n\nDo any of the top machine learning research facilities think about that kind of stuff? Are we gonna be able to test that theory out in the next decade or two? Any government agents reading my post wanna take me in as an intern? Because I'll bust my ass to study that and research it if I get accepted :p.\n\nImagine if we could do that, to train people how to be expert construction workers, heavy machine operators, welders, musicians, artists, programmers, doctors... \n\nI guess just getting it to stimulate motor skills is insanely difficult enough. To stimulate the brain to conceptualize high level math and solve large equations on the fly, design complicated software and processors,  understand entire schools of philosophy, definitely a pipe dream.\n\nBut just imagining how one day in the future, we will without a doubt find out how to do that at some point. Everything the brain can do, we can make a computer do it, and we can make a computer train the brain how to do it. It's just a matter of time and discovery, but one day we'll get there.",
        "created_utc": 1535831125,
        "upvote_ratio": ""
    },
    {
        "title": "Can a bald person have dandruff?",
        "author": "TittsburghFeelers17",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c4x8b/can_a_bald_person_have_dandruff/",
        "text": "",
        "created_utc": 1535823294,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for a single individual with $500k in assets and no specialized training to deliberately take some action that would cause the death of at least 1 billion humans?",
        "author": "EnlightenedSeeker667",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c4ve8/is_it_possible_for_a_single_individual_with_500k/",
        "text": "[removed]",
        "created_utc": 1535822901,
        "upvote_ratio": ""
    },
    {
        "title": "How to plug a Cyberwar leak?",
        "author": "Redditjwg2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c4nx3/how_to_plug_a_cyberwar_leak/",
        "text": "What technology would be best used to plug a cyberwar leak? How can a leak be detected?",
        "created_utc": 1535821365,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to get a Solar system with a planet at it's centre?",
        "author": "Calmgirl",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c4kuq/is_it_possible_to_get_a_solar_system_with_a/",
        "text": "Just wondering. 🤗",
        "created_utc": 1535820752,
        "upvote_ratio": ""
    },
    {
        "title": "If we were to make a rotating habitat in orbit, either near a planet or in the asteroid belt, could we make soil from asteroids? Or would we need to take soil from Earth and/or Mars?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c4ktr/if_we_were_to_make_a_rotating_habitat_in_orbit/",
        "text": "Can we make our own soil for agriculture in space, or would we need soil from one of the two outermost rocky planets?",
        "created_utc": 1535820745,
        "upvote_ratio": ""
    },
    {
        "title": "is there a possibility for a fatal kind pf influenza virus to come to existence, spread worldwide and wipe the population?!",
        "author": "Kamytmts",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c4alw/is_there_a_possibility_for_a_fatal_kind_pf/",
        "text": "",
        "created_utc": 1535818663,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if you went significantly over the usual dose of a vaccine?",
        "author": "GocoZwei",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c0zpd/what_would_happen_if_you_went_significantly_over/",
        "text": "I tried to research this question online but instead, I received a bunch of articles refuting anti-vaxxers. I'm not an anti-vaxxer at all, but I was curious about what the effects would be if you gave someone the same vaccine five, ten, maybe even a hundred times at once, ignoring potential arm damage.",
        "created_utc": 1535783328,
        "upvote_ratio": ""
    },
    {
        "title": "I Need Help With Portraying This Mental Illness",
        "author": "ForerunnerAI10",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9c0k86/i_need_help_with_portraying_this_mental_illness/",
        "text": "What mental illness makes you think you're something you're not? Is it Dysphoria? I'm writing a series, and I've got a reptilian who at times thinks she's human and will do whatever it takes to become human. And I can use help. What is this comparable to? What behaviors end up stemming from this? Does it take a strain on mental health? Tell me!",
        "created_utc": 1535778284,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most violently reactive element, and what causes that reaction?",
        "author": "Arithen",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bzhzc/what_is_the_most_violently_reactive_element_and/",
        "text": "Hello there. I’m trying to do some research on a fictional story I’m writing and I wanted to include some more science-based facts within it.\n\nUnfortunately, my knowledge of chemistry is very minimal, so I was wondering if some one you chemistry-literate folk could point me in the right direction.\n\nEssentially, I want to have a character be able to excrete these orbs from their skin which could be used as explosive weapons.\n\nWhat kind of elements should I take a closer look at which I may be able to incorporate into this character’s detailed abilities?",
        "created_utc": 1535767519,
        "upvote_ratio": ""
    },
    {
        "title": "So would aliens in a different galaxy be unusual to us compared to aliens in a nearby star system to Earth?",
        "author": "feelmysoul01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bzf5l/so_would_aliens_in_a_different_galaxy_be_unusual/",
        "text": "",
        "created_utc": 1535766737,
        "upvote_ratio": ""
    },
    {
        "title": "What fields in science are highly employable with just a bachelor's?",
        "author": "ANumberAtUofT",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9byebj/what_fields_in_science_are_highly_employable_with/",
        "text": "Just did a quick look around some subreddits and it seems like many of the sciences (biology, physics, chemistry) aren't very employable with just an undergrad degree.\n\nAs a humanities grad at the butt of many jokes, it came as a complete shock to me since the sciences are lumped in with STEM, which is lauded nowadays as so employable etc. ",
        "created_utc": 1535757330,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most greenhouse gas causing activities per capita that I could cut out?",
        "author": "InvisibleElves",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bwovn/what_are_the_most_greenhouse_gas_causing/",
        "text": "Assuming my power comes from coal, heat from natural gas, I eat all meat and dairy at a normal rate, I drive, and use plentiful recyclable and non-recyclable plastics.   \n\nWorldwide, I understand fossil fuels, meat, and dairy to be the biggest impact, but I’m not sure if it’s the same per person, or for each meat, or if there’s something I’m not thinking of that many of us do.  \n\n&amp;nbsp;  \n\nEdit: My end game is to get my household off of as much of this as possible, but trying to prioritize because everyone has something they don’t want to do without.",
        "created_utc": 1535744153,
        "upvote_ratio": ""
    },
    {
        "title": "Assuming santa was real, how fast would he have to go on his sleigh to reach every house in the world? Disregard the \"coal in the bad kid's stocking\" and just look at visiting good kid houses (probably about half of the world populous).",
        "author": "RuvinWolf",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bvl48/assuming_santa_was_real_how_fast_would_he_have_to/",
        "text": "",
        "created_utc": 1535736439,
        "upvote_ratio": ""
    },
    {
        "title": "Degenerate Bose-Einsteinian Condensate?",
        "author": "recipriversexcluson",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bu95x/degenerate_boseeinsteinian_condensate/",
        "text": "Relating to another current question:\n\nCould we - slowly and in orbit - assemble the equivalent of a glob of degenerate matter using BEC's?\n\nToday's techniques use minuscule amounts, but is there an engineering limit?",
        "created_utc": 1535727052,
        "upvote_ratio": ""
    },
    {
        "title": "how much battery do i need to equal to electricity",
        "author": "mohamed61",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bty3s/how_much_battery_do_i_need_to_equal_to_electricity/",
        "text": "[removed]",
        "created_utc": 1535724764,
        "upvote_ratio": ""
    },
    {
        "title": "What are some promising edible wild plants that could be commercialized and made delicious through artificial selection?",
        "author": "NoahFable",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bt13g/what_are_some_promising_edible_wild_plants_that/",
        "text": "As I understand it, almost all fruits and vegetables that humans eat today have become significantly more nutritious/tasty/sizeable then they used to be thousands, hundreds or even decades ago (corn is a well-known example). \n\nI'm just wondering if there are any wild plants that we should start \"evolving\" because they have great potential to become nutritional staples of future society. \n\nAlso: \nAs gene editing technology improves we could start to combine plants and create frankenplants or even create our own entirely new plants to feed the world. How plausibly far away from this are we? ",
        "created_utc": 1535717163,
        "upvote_ratio": ""
    },
    {
        "title": "With our current, publicly disclosed tech, could a computer be creating all of my online interactions? Tricking me into believing I’m grtting news and interacting with humans?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bshg8/with_our_current_publicly_disclosed_tech_could_a/",
        "text": "[deleted]",
        "created_utc": 1535711594,
        "upvote_ratio": ""
    },
    {
        "title": "Are 4D beings watching me wank to BBW porn?",
        "author": "Shrubchucker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bsa1r/are_4d_beings_watching_me_wank_to_bbw_porn/",
        "text": "[removed]",
        "created_utc": 1535709286,
        "upvote_ratio": ""
    },
    {
        "title": "What will happen if I drop a vial of degenerate matter?",
        "author": "WeirdSymmetry",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9brz02/what_will_happen_if_i_drop_a_vial_of_degenerate/",
        "text": "&amp;#x200B;",
        "created_utc": 1535705554,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think that science is all about playing God?",
        "author": "applesnbluebird",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9brwg0/do_you_think_that_science_is_all_about_playing_god/",
        "text": "[removed]",
        "created_utc": 1535704614,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for humanity to use all of a natural resource i.e. water, oil, or precious metals?",
        "author": "dragonlord133",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bpwnr/is_it_possible_for_humanity_to_use_all_of_a/",
        "text": "",
        "created_utc": 1535683386,
        "upvote_ratio": ""
    },
    {
        "title": "Do hospitals ever inject anything warm?",
        "author": "freshthrowaway1138",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bpw9j/do_hospitals_ever_inject_anything_warm/",
        "text": "This might sound strange but I'm curious. I've had saline and anesthesia, not to mention when I donate blood cells and they inject it back into you; everything is cold. Is anything ever warm when it hits your veins? ",
        "created_utc": 1535683286,
        "upvote_ratio": ""
    },
    {
        "title": "What would likely happen if the entire world had a climate like the Northeastern/Midwestern United States?",
        "author": "Backanalia",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bpv5j/what_would_likely_happen_if_the_entire_world_had/",
        "text": "I know seasons are decided by the tilt of the globe, but let's say through a miracle of geoengineering that whatever it feels like and looks like temperature-wise in the Northeastern/Midwestern United States, that's where it looks everywhere. Basically, when the Northern Hemisphere has winter, so does the Southern Hemisphere. \n\n&amp;#x200B;\n\nAnd it's not the usual kind of winter the Southern Hemisphere has either, I know their winters are comparatively warmer. I mean however snowy it is for Pennsylvania, that's how snowy it is for Brazil and Australia. And not just the Southern Hemisphere either, the warmer US states too. Everyone gets the cold weather at the same time. \n\n&amp;#x200B;\n\nI don't need complex calculations about whether or not this would result in a bunch of storms like in The Day After Tomorrow. Unless you know that? What I'm mostly after here is, does the world need half winter and half summer? If the whole world had winter at the same time would it freeze? If the whole world had summer at the same time would it burn?",
        "created_utc": 1535683010,
        "upvote_ratio": ""
    },
    {
        "title": "Electrostatic artificial gravity to contain a gasous atmoshpere within a spinning ring open to vaccum?",
        "author": "xaxys",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bp7yd/electrostatic_artificial_gravity_to_contain_a/",
        "text": "Imagine a ringworld much smaller than the ones in Halo or Larry Nivens books, within about 10-100 kilometers in diameter and spinning at a rate to provide 1 g. The gravity is fine for people and moderately sized objects, but an atmoshpere is harder to contain especially without massive walks that take up half the diameter of the ring. what if the atmosphere was charged at a high voltage and an opposingly charged ring was below the ring floor and properly insulated, possibly in a self contained vaccum chamber to take advantage of being in space. Could this method help contain the gas? Would it even be powerful enough to supplement the need to spin the ring as much for 1 g? Could flora and fauna be effected by constantly being in a charged atmosphere? Lets assume the atmosphere is 80% oxygen 19% nitrogen and 1% argon and carbon dioxide, so there is less gas needed for resperating. I know a glass ceiling would be better but I'm not interested in that. In another senario imagine this as a method to increace subjective \"gravity\" and help retain atmospheres on large astetoids, bassicly terraforming an asteroid to be a mock mini planet.",
        "created_utc": 1535677526,
        "upvote_ratio": ""
    },
    {
        "title": "If the t-rex hadn't gone extinct, would it have eventually grown fully functional and useful arms or would they have gone away?",
        "author": "CoolestDudeOne",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bojg1/if_the_trex_hadnt_gone_extinct_would_it_have/",
        "text": "",
        "created_utc": 1535671839,
        "upvote_ratio": ""
    },
    {
        "title": "Evolution of Gut Flora in Animals",
        "author": "Dtoobig45",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9boc64/evolution_of_gut_flora_in_animals/",
        "text": "Do we know when/where this relationship between animals and bacteria began? Interested in knowing the earliest example where this mechanism existed in animals and if it’s function has changed over time. \n\n",
        "created_utc": 1535670312,
        "upvote_ratio": ""
    },
    {
        "title": "Could sensors in a particle accelerator be used in a telescope to detect photons from distant objects in space?",
        "author": "The_CancerousAss",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bo179/could_sensors_in_a_particle_accelerator_be_used/",
        "text": "I was brainstorming about how i could create a telescope that could see far, dark, and small objects in space.\n\nA particle accelerator can track and detect even the smallest particles after a collision . Could this technology be repurposed to track and detect photons coming from distant bodies in space? ",
        "created_utc": 1535667731,
        "upvote_ratio": ""
    },
    {
        "title": "Deliberate cigarette butt littering on the mainland vs disposal in landfills?",
        "author": "GUMBYtheOG",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bni5y/deliberate_cigarette_butt_littering_on_the/",
        "text": "This strictly hypothetical- I am not advocating that we start throwing butts in the woods as opposed to the trash - we should just stop smoking. \n\n\nHowever, after hearing recently that cigarette butts cause more pollution to our oceans than plastic straws; I presume this would be from trash dumps and transportation of trash near bodies of water like oceans or rivers that empty into the ocean. Would an even distribution of cigarette buts across the mainland cause more harm than a (relatively) few concentrated locations of all cigarette butts in landfills that have potential to be ‘accidentally’ lost in the sea or rivers? I would assume cigarette butts would decompose quicker than straws and around the same time they reached a point in the earth where wells would be - plus, by then hopefully alternatives would be forced.\n\nTLDR - even disbursement of cigarette butts in the environment  is better than concentrated locations of compromised disposal sites where they end up in the ocean?",
        "created_utc": 1535662922,
        "upvote_ratio": ""
    },
    {
        "title": "How can we create hard light constructs",
        "author": "Jokengonzo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bna99/how_can_we_create_hard_light_constructs/",
        "text": "So is there any way we can create hard light constructs? For example like the light bridges in halo or green lanterns ring projections?",
        "created_utc": 1535661220,
        "upvote_ratio": ""
    },
    {
        "title": "The ISS has reported a leak onboard. What could happen if it isn't fixed?",
        "author": "fancyshmants",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bmqyj/the_iss_has_reported_a_leak_onboard_what_could/",
        "text": "So I'm wondering if the leak would just slowly let the air out in the contained unit and that would be all? Could the pressure difference actually cause the crack to increase in size and cause the unit to crush itself under the pressure difference and increased vacuum effect?",
        "created_utc": 1535657491,
        "upvote_ratio": ""
    },
    {
        "title": "What if the extinction event that caused the dinosaurs never happened and they still existed now. Would we be living with them as we are now with other creatures? Would dinosaurs be in our place as the technologically advanced species?",
        "author": "Soporatus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bmnlb/what_if_the_extinction_event_that_caused_the/",
        "text": "A friend and I had this conversation at work the other day. It didn’t lead anywhere but to further our curiosity. I did believe that the competition of having the dinosaurs still around would drive the evolutionary path that got us here. ",
        "created_utc": 1535656815,
        "upvote_ratio": ""
    },
    {
        "title": "If we were to recreate the calendar with modern science; how would it be designed?",
        "author": "o-rka",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bman1/if_we_were_to_recreate_the_calendar_with_modern/",
        "text": "Would it be based on the moon? Would it be based on a combination of moon and sun orbits? I'm curious how we would retake this problem knowing what we know now.",
        "created_utc": 1535654347,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone know any National Physics Laboratories in Ontario, Canada?",
        "author": "SudatK",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bm8l7/anyone_know_any_national_physics_laboratories_in/",
        "text": "",
        "created_utc": 1535653947,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think are the end-game limitations of nanorobotics",
        "author": "Topdown-",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bkfmb/what_do_you_think_are_the_endgame_limitations_of/",
        "text": " Okay after submitting this question to r/AskScience,  I was told this subreddit would be the best to post this question to.  If you think there's a better one, please tell me.\n\n&amp;#x200B;\n\nSo, I'm writing a futuristic, hard sci-fi world (meaning the science is completely, or mostly correct in universe). Of course, stuff smaller than nanorobotics (is it \"picorobotics\"?) is pretty impossible to make do complex tasks if it ever exists.\n\n&amp;#x200B;\n\nBut nanorobotics is an emerging field and I really want to know what people think it could peak out at. What is the most it could possibly do? In structural engineering, cybernetics or any other field, where is the line of impossible drawn if you imagine you have all the time and money in the  world?\n\n​\n\nAgain sorry if this is the wrong place to post it, do tell me if it is and where might be better.",
        "created_utc": 1535641713,
        "upvote_ratio": ""
    },
    {
        "title": "If we split the human race in half until they were two distinct separate species, no interaction, how long would it take?",
        "author": "Overtaker40",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bkfld/if_we_split_the_human_race_in_half_until_they/",
        "text": "&amp;#x200B;",
        "created_utc": 1535641708,
        "upvote_ratio": ""
    },
    {
        "title": "Does dark matter really exist?",
        "author": "qozett",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bkbf5/does_dark_matter_really_exist/",
        "text": "According to the general relativity, gravity is a spacetime curvature.  This fact leads me to the idea to compare the form of the Earth and form of the universe:\n\nThe surface of Earth is \"globally\" sphere (in fact, there are more precise models, but for simplicity, I just use spheric model) but there are mountains on Earth which means that Earth has \"not perfect\" form. So, maybe the universe also have something similar: the universe is \"globally\" \"flat\" Euclidean (WMAP experiment here: [https://map.gsfc.nasa.gov](https://map.gsfc.nasa.gov)) but there is \"relief\" which cause effects that scientists explain with dark matter.\n\n&amp;#x200B;\n\nIn short: could it be that there is no dark matter and known effects of it are because of  \"relief\" of the universe?\n\n&amp;#x200B;\n\nP.S. This is a quite simple idea so probably somebody already considers it. I will be happy if somebody gives a link to the critical consideration of this idea (or even proof why this idea is wrong).",
        "created_utc": 1535640909,
        "upvote_ratio": ""
    },
    {
        "title": "What would humans be like had we evolved to be nocturnal?",
        "author": "SaintDiabolus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bkarn/what_would_humans_be_like_had_we_evolved_to_be/",
        "text": "I'm asking because of a fantasy story I'm conceptualising, and even though it's fantasy, I like to have my facts at least somewhat straight. Besides, I'm curious.\n\nSo, let's imagine a nocturnal human.\n\nLarger eyes? Colourblindness? Or [would we](http://catsplace.org/wp-content/uploads/2014/05/color-vision.jpg) [see like cats](https://amp.businessinsider.com/images/525e9e64eab8ead141928c02-750-375.jpg), with a few colours, but none of the shades and vibrancy that we know? Only blue, yellow and grey?\n\nWhat about our diet, would we need to get Vitamin D from our diets, or would we have evolved to produce it ourselves?\n\nWould we all be fair-skinned because of the lack of sunlight?\n\nWould we be smaller, thanks to the cold of the night?\n\nOr would we mostly be the same except for a change in the number of rods and cones we have?",
        "created_utc": 1535640778,
        "upvote_ratio": ""
    },
    {
        "title": "Cryopreservation and Mind Uploading",
        "author": "HeartofAthena",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bjzrz/cryopreservation_and_mind_uploading/",
        "text": "This caught my attention. Apparently,  Cryopreservation or perserving the dead body thru freezing is already happening in some countries. I was surprised to learn that there are even three famous companies in this field:\n\n\" [**Alcor Life Extension Foundation**](http://alcor.org/), Cryonics Institute and [**KrioRus**](http://kriorus.ru/) – offer various cryopreservation packages ranging from $28,000 to $200,000 that can be funded through a life-insurance policy with the selected company as the designated beneficiary. Far from being a mere fantasy, cryopreservation penetrates contemporary culture and is becoming a real business. \"\n\n[https://medicalxpress.com/news/2018-06-cryopreservationthe-field-possibilities.html](https://medicalxpress.com/news/2018-06-cryopreservationthe-field-possibilities.html)\n\nOn the other hand, I also see articles pertaining to experiments on mind uploading. This gets me thinking, should mind uploading becomes successful, will the brain of these ice preserved bodies still qualify? Will they still function? What do you think?\n\n# ",
        "created_utc": 1535638569,
        "upvote_ratio": ""
    },
    {
        "title": "Could an Oracle-style AI Superintelligence still be dangerous to mankind?",
        "author": "NotSoBadBrad",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bjrxs/could_an_oraclestyle_ai_superintelligence_still/",
        "text": "I had a writing professor who was really big on AI and we had tons of class discussions and papers on the ethics of technology. One of the types of AI we talked about was an oracle; one that simply compliled information and answered questions and ran simulations. \n\nWithout a directive of somekind that could be misinterpreted by the AI, how could this style pose a threat to humanity? Does it all come down to mistakes in the development of the AI?",
        "created_utc": 1535636938,
        "upvote_ratio": ""
    },
    {
        "title": "Hypothetical: 1-Inch Diameter Star",
        "author": "RelevantToNothing",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bj9us/hypothetical_1inch_diameter_star/",
        "text": "This could also be a question about any tiny super-hot object.\n\nMy science muscle is weak enough that my googling has been fruitless so far.\n\n&amp;#x200B;\n\nSay you have a star that has a diameter of 1 inch. How far does the heat travel from a \\~10K Fahrenheit object of that size? Can it heat a room or is it going to incinerate that room?",
        "created_utc": 1535632873,
        "upvote_ratio": ""
    },
    {
        "title": "What if the entire world were made of water?",
        "author": "MrMooseQ",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bir28/what_if_the_entire_world_were_made_of_water/",
        "text": "What would the core of the earth be like under such pressure?",
        "created_utc": 1535628136,
        "upvote_ratio": ""
    },
    {
        "title": "What gives an orgasm that \"drug like\" feeling in your genitals?",
        "author": "femmejean",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bi4n8/what_gives_an_orgasm_that_drug_like_feeling_in/",
        "text": "It's different to something that is very good like eating chocolate cake or the breeze on a warm sunny day, it feels like throbbing pleasure comparable to opiates. ",
        "created_utc": 1535621432,
        "upvote_ratio": ""
    },
    {
        "title": "Which battery has most lots of voltage",
        "author": "mohamed61",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bhndz/which_battery_has_most_lots_of_voltage/",
        "text": "[removed]",
        "created_utc": 1535615482,
        "upvote_ratio": ""
    },
    {
        "title": "What in the brain makes feelings exist? Is this structure/mechanism able to be replicated and implemented into robots or computers?",
        "author": "Lightningwaves",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bhks6/what_in_the_brain_makes_feelings_exist_is_this/",
        "text": "Would it ever be possible to make computers or robots that could feel emotions and/or have consciousness?",
        "created_utc": 1535614580,
        "upvote_ratio": ""
    },
    {
        "title": "Science and Technology Integration for Virtual Immortality -can it be done?",
        "author": "Dimorphotheca",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bguuq/science_and_technology_integration_for_virtual/",
        "text": "So, I found this article about immortality  and the author claims there's a discussion about it here in Reddit. I  opened it but it has already been archived. I want to open a discussion  about it again to see the possibilities of it coming from different  perspective. Besides, there seem to be a lot of discussion about it that  I have been reading here lately (not necessarily about this article but  about virtual immortality) and there seems to be a lot of experiments  also going on for this pursuit that even google has one so I figured,  it's a good topic for a discussion.\n\nHere  he said that immortality and VR (Virtual Reality) will go hand in hand.  I'm thinking, since humans are involved here, can it be done just by  pure technology or should Science be integrated with it?\n\nWhat are your thoughts?\n\n[https://medium.com/@AlexJupiter/immortality-and-vr-will-go-hand-in-hand-cb83759b7278](https://medium.com/@AlexJupiter/immortality-and-vr-will-go-hand-in-hand-cb83759b7278)",
        "created_utc": 1535606524,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think it's possible that some animal with human-comparable behaviour and intelligence existed in the past, and that evidence for it has disappeared?",
        "author": "Tarnmanner",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bfn9o/do_you_think_its_possible_that_some_animal_with/",
        "text": "Note I'm not asking whether you think it's true, just whether it's possible; a recentish Trey the explainer video got me thinking about this. I'd always assumed it was impossible, because anything like what we have would still leave telltale signs; plastics, metal objects, presumably a lot of building material. But if a species existed and only got to a sort of iron-age level, or a palaeolithic level, in terms of technology, would we be able to tell? Would stone structures remain in any way recognisable, as those built in the last ten thousand years by modern humans are? After all, we know about such a small percentage of animal life on earth. \n\nEdit: as an add-on, if they made something comparable to flint hand-axes, let's say sixty or eighty or a hundred million years ago, is there any reason why these would have disappeared in the interim, or would they still be clearly findable? \n\nEdit 2: changed 'thousand' to 'million'. ",
        "created_utc": 1535595467,
        "upvote_ratio": ""
    },
    {
        "title": "Could I cool a room by adding electricity?",
        "author": "naxpouse",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bel9a/could_i_cool_a_room_by_adding_electricity/",
        "text": "If I had a perfectly efficient compressor could I cool a room with no outlet?\n\nBasically, I've been hung up on the idea of using a compressor to generate a heat differential in a closed system and a Peltier plate to draw energy out of that and cool the system as a whole. I don't think this is a perpetual motion as you need to add electricity as an input to make the compressor function, so I think it should be feasible if the compressor doesn't generate too much waste heat. I think there is probably some flaw in my reasoning as the idea is so simple that I think it would have been executed if it was possible, but I can't figure out what it is. Thanks in advance to anyone who can better explain this for me.",
        "created_utc": 1535586775,
        "upvote_ratio": ""
    },
    {
        "title": "Are we seeking a trend of conservation movements increasingly looking askance at hunting, especially trophy hunting? If so, is this an issue for the science of conservation?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9beexr/are_we_seeking_a_trend_of_conservation_movements/",
        "text": "The trend particularly appears to be arising with endangered species protection.\n\nThe origins of conservation ideology are linked to hunting. Think Teddy Roosevelt. Conservation has long been defined as *wise use* of resources (including animals). As opposed to *no use,* which is preservation.\n\nPro-hunting concepts seem to be running headlong into this sentiment: *We are trying to protect these animals. And you want to shoot them? This is not helping. And it doesn't look good.*\n\nAnd is animal rights activism entering the field of conservation?",
        "created_utc": 1535585402,
        "upvote_ratio": ""
    },
    {
        "title": "If an adult were to be reverted to their 3-year-old body, but got to keep all current knowledge and memories they'd possesed, would their smaller brain be capable of storing all of it?",
        "author": "Elleden",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9be55x/if_an_adult_were_to_be_reverted_to_their_3yearold/",
        "text": "",
        "created_utc": 1535583234,
        "upvote_ratio": ""
    },
    {
        "title": "Redditors that review manuscripts for academic journals... How often do you reject an article?",
        "author": "interwebchatter",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bcxwo/redditors_that_review_manuscripts_for_academic/",
        "text": "",
        "created_utc": 1535574531,
        "upvote_ratio": ""
    },
    {
        "title": "Lately, I've been looking at AR software and tracking, and a lot of it is almost perfect. I know that the software is getting better everyday, but how far are we from having really great hardware aswell? Are there any other usages for AR technology, besides the obvious?",
        "author": "ZiggySaurusRex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9bcol0/lately_ive_been_looking_at_ar_software_and/",
        "text": "",
        "created_utc": 1535572809,
        "upvote_ratio": ""
    },
    {
        "title": "Why do radio stations sometimes \"skip.\" when playing music like CDs used to?",
        "author": "Derpherpderpdeederp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b8t2d/why_do_radio_stations_sometimes_skip_when_playing/",
        "text": "",
        "created_utc": 1535545432,
        "upvote_ratio": ""
    },
    {
        "title": "Since soil on Earth is called 'earth', what would soil on other planets be called?",
        "author": "hulk6418",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b7eei/since_soil_on_earth_is_called_earth_what_would/",
        "text": "",
        "created_utc": 1535530980,
        "upvote_ratio": ""
    }
]