[
    {
        "title": "Does robots can be called as Biology Object and will robots have feelings?",
        "author": "TravorSpartakas",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b77dn/does_robots_can_be_called_as_biology_object_and/",
        "text": "Long story short,\n I was discussing with my friend about robots that has consciousness, and we get to the point that robots could be called as Biology objects as they can replicate themself, they are able to evolve. Nevertheless, we also started to ask ourself about possibility to copy ourselfs into robot in the future, so the question was, would we have emotions as this is an instrument in society that helps people to understand each other better. So will our robotic copies produce emotions and block the whole robotic possibilities in order of 100% coping the original (human).",
        "created_utc": 1535528589,
        "upvote_ratio": ""
    },
    {
        "title": "Best book or source of information to improve your analysis of research methods?",
        "author": "tolstoy1212",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b764w/best_book_or_source_of_information_to_improve/",
        "text": "I've been a research assistant for a few years, but struggle with critically evaluating the work of others. I want to get better at sniffing out bad methodology, e.g. \"p-hacking,\" bad statistics in general, or anything related.\n\n​\n\nWhat resources can I access to get me better at this? I'm willing to read books/improve my statistic skills (to a certain point... e.g. I've taken calculus 1, and realistically being a math wiz who speaks calc 3 is just not going to happen). Thanks!\n\n&amp;#x200B;\n\nEDIT: I research topics related to healthcare (e.g. any article you may find in NEJM, JAMA, etc)",
        "created_utc": 1535528196,
        "upvote_ratio": ""
    },
    {
        "title": "What's the most massive contiguous calcium carbonate section of the Great Barrier Reef?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b5kjd/whats_the_most_massive_contiguous_calcium/",
        "text": "I'm specifically interested in an educated estimation of how much the largest reef weighs. But I'd also be appreciative if you have source for the total weight of the 2900+ reefs handy. Thanks and good surfing to you.",
        "created_utc": 1535511875,
        "upvote_ratio": ""
    },
    {
        "title": "If you try to move faster inside a black hole you reach the singularity faster, if you try to move faster outside a black hole you will reach the future faster; is that just a coincidence?",
        "author": "TiagoTiagoT",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b4nu6/if_you_try_to_move_faster_inside_a_black_hole_you/",
        "text": "What would be different if the whole Universe was falling towards the singularity of a Universe-sized black hole?",
        "created_utc": 1535504468,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen to our solar system if the Sun just disappeared?",
        "author": "dahdoc",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b4ax1/what_would_happen_to_our_solar_system_if_the_sun/",
        "text": "[removed]",
        "created_utc": 1535501532,
        "upvote_ratio": ""
    },
    {
        "title": "Can habituation affect the way organisms interact with a similar but stronger stimulus?",
        "author": "eddiel01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b3a7o/can_habituation_affect_the_way_organisms_interact/",
        "text": "I realize this question is quite specific but after researching a bit about habituation, especially those in less complex organisms I've been wondering about whether a habituated stimulus affect the organism in the way above. For example, let's say I habituate a millipede to no longer curl up when in exposed to a low energy vibration. I then expose the same millipede to the same frequency of vibration but at a much larger volume. Will the millipede react differently than one that has never been habituated to the low energy vibration?\n\n",
        "created_utc": 1535493759,
        "upvote_ratio": ""
    },
    {
        "title": "When would an electric-heated Brayton cycle be an economical means of electrical propulsion? Only at supersonic speeds? Or at all?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b2yk7/when_would_an_electricheated_brayton_cycle_be_an/",
        "text": "[deleted]",
        "created_utc": 1535491408,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for humans to have much more neuroglobin?",
        "author": "DankmasterFl3x",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b2mde/is_it_possible_for_humans_to_have_much_more/",
        "text": "Neuroglobin is a protein bound with iron that helps your brain and nerves take up oxygen from your blood, and store oxygen as well.  Its sort of like myoglobin, that your muscles use.\n\nSome creatures like whales and ant-arctic seals have much more neuroglobin than we humans do, and this allows them to stay underwater much longer without blacking out.  Even when their blood oxygen drops, their brain maintains oxygen. \n\n&amp;#x200B;\n\nWould it be possible for our human brains to have just as much neuroglobin concentrated as an antarctic fur seal?\n\nI read before our brain wouldn't be able to hold as much oxygen as other mammals because our brain is so dense and there wouldn't be enough space left for things like a high concentration of neuroglobin. ",
        "created_utc": 1535489087,
        "upvote_ratio": ""
    },
    {
        "title": "Do we ever build QFT-like models whose fields are representations of properties rather than fundamental particles?",
        "author": "50millionfeetofearth",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b1pnx/do_we_ever_build_qftlike_models_whose_fields_are/",
        "text": "This will probably sound ridiculous and stupid, so I apologize in advance.\n\nI'm wondering whether instead of modelling matter and force fields representing the various fundamental particles, a quantum field theory could be constructed that treated various quantum numbers or properties as the fields and describe particles and their interactions in those terms. Does this make any sense at all?\n\nTo try and clarify a little, I'm talking about a field theory where the fields described would be things like \"isospin field\", \"electric-charge field\", \"weak-isospin field\", \"[insert quark here]ness field\", basically properties that are conserved (or not) during certain interactions.\n\nI only wonder this because I often ponder how to actually put a face to the word \"particle\" and recently I was wondering whether it's really \"just\" the intersection of a specific set of property values.\n\nI'm a layman who just happens to have a great interest but a VERY SHALLOW cursory knowledge of particle physics, so hopefully I'll be able to learn something new when someone educated explains **why** what I'm proposing makes no sense at all. Thanks in advance!",
        "created_utc": 1535482889,
        "upvote_ratio": ""
    },
    {
        "title": "Why do some sciences get more recognition (and sometimes more respect) than other sciences?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b1cav/why_do_some_sciences_get_more_recognition_and/",
        "text": "I am mostly referring to authentic sciences, not scientific disciplines that claimed to be actual science but were later discarded as pseudo-science or their findings were flawed and later advanced to more refined sciences (like from phrenology to neuropsychology or from alchemy to chemistry)\n\nDespite that I have been an admirer of science in general for all of my life, I noticed that some scientific disciplines get more recognition than others (particularly physics and astronomy. And I mean *they get a LOT of respect* as if it is they are the only true sciences that are out there, probably after Einstein got a lot of media recognition after his achievements in physics even though there were certain phenomena in physics that he claimed were later discarded) and the scientists are often regarded as the heroes of the story (in fact, most superhero characters in comic book universes are mostly scientists of some kind even though the scientific discipline is incredibly complicated, mysterious, and even prone to making mistakes as well as there were many things that at one point were thought were true but were later discarded)\n\nI mostly noticed this lack of recognition also towards the more social sciences like psychology, sociology or political science and often regarded as \"fake science\" because their inability to replicate studies and achieve the same results every time or the fact that different social science disciplines have different approaches that often contradict each other.\n\nAnd what about other scientific disciplines that do not get that much recognition like paleontology, computer science, sciences focused on nutrition and physique and so on?\n\n",
        "created_utc": 1535480306,
        "upvote_ratio": ""
    },
    {
        "title": "Could we solve world hunger by making deserts arable?",
        "author": "Cwardw",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b0ua0/could_we_solve_world_hunger_by_making_deserts/",
        "text": "So, I was reading an article about how the Amazon rain forest was possible artificially expanded by native people over generations by controlled burning and soil fertilization. I'm wondering if the same could be done to, say, the Sahara desert?\n\nCould we build several Ras Al Khair style desalination plants along the coasts of Africa and pump enough water to the Sahara over generations to turn it into the breadbasket of the world? Could we fertilize it? Would we need to?",
        "created_utc": 1535476852,
        "upvote_ratio": ""
    },
    {
        "title": "If we send a spaceship from Earth which can travel 0.5 speed of light to a star, which is 4 lightyears",
        "author": "Cezium133",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b0ej8/if_we_send_a_spaceship_from_earth_which_can/",
        "text": "If we send a spaceship from Earth to a star, which is 4 lightyears away from us, and lets say that this spaceship can travel 0.5 speed of light(for simplicity he can get from 0 to 0.5c in an instant) So would this journey to the star take 8 years ? If yes, then would 8 years pass for the person inside the spaceship or the people on Earth ?",
        "created_utc": 1535473831,
        "upvote_ratio": ""
    },
    {
        "title": "Could a pendulum-like device be used as a power source?",
        "author": "SirBackspace",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b0dx0/could_a_pendulumlike_device_be_used_as_a_power/",
        "text": "So I just watched [this minutephysics video](https://www.youtube.com/watch?v=ft3vTaYbkdE) on how to keep a structure from swaying back and forth, and they compared it to a pendulum. Once it begins swaying, the two objects begin giving energy back and forth, maybe through a spring or something. So theoretically, could we somehow harness the swaying of a building due to wind or earthquakes for a power source? How much power would this give us?",
        "created_utc": 1535473709,
        "upvote_ratio": ""
    },
    {
        "title": "Why did emotions become such an important aspect of our being?",
        "author": "visdalal",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9b03we/why_did_emotions_become_such_an_important_aspect/",
        "text": "We’re all mostly driven by emotions, or so I think! How is it that emotions are so personally/professionally important that they developed in an evolutionary way? Would we have been a more efficient and survivable species if we didn’t have any emotions such as love/anger/spite/vengeance which make us do irrational things. Wouldn’t we be a more efficient/productive/survivable species if we didn’t have emotions? Is it sensible today to be less/more emotional on today’s earth considering the importance of EQ in professional world? Does being less emotional or being in better control of your emotions(which sounds phenomenally ironic) lead you to do better in professional (I have no proof of this) and personal(this either) lives? Whereas love which is an amazingly uncontrolled and irrational emotion is so coveted\nContext: I’m a very emotionally driven person and while I have gained professional success, I have not had so much success in personal relationships",
        "created_utc": 1535471782,
        "upvote_ratio": ""
    },
    {
        "title": "Are mamals discendants of reptiles? Do we have intermediate fosils?",
        "author": "anadampapadam",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9az102/are_mamals_discendants_of_reptiles_do_we_have/",
        "text": "&amp;#x200B;",
        "created_utc": 1535463814,
        "upvote_ratio": ""
    },
    {
        "title": "Global Warming",
        "author": "MoralBrigade",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ayylc/global_warming/",
        "text": "What is global warming, exactly? and how real it is ?",
        "created_utc": 1535463280,
        "upvote_ratio": ""
    },
    {
        "title": "Historical examples of bias in hard sciences?",
        "author": "hitlerallyliteral",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ayebb/historical_examples_of_bias_in_hard_sciences/",
        "text": "It's well known that historically unconscious bias has caused some bad science-'scientific' racism and eugenics, hysteria, phrenology-and that modern scientists need to be aware of their own biases. However, these examples are all from the scientific study of humans, so my question is are their any historical examples of bias in chemistry, physics or math?     \n      \nmaybe this is more history of science than science but r/historyofscience is dead\n",
        "created_utc": 1535458560,
        "upvote_ratio": ""
    },
    {
        "title": "Could we be living in a black hole? And if so, could the black holes in our universe serve as wormholes to parallel universes?",
        "author": "FrankyKong",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ay7n7/could_we_be_living_in_a_black_hole_and_if_so/",
        "text": "",
        "created_utc": 1535456930,
        "upvote_ratio": ""
    },
    {
        "title": "Does robots can be called as Biology Object and will robots will have feelings?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9axzy9/does_robots_can_be_called_as_biology_object_and/",
        "text": "[removed]",
        "created_utc": 1535454842,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a possibility for humans to \"breath\" underwater?",
        "author": "SirKudo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9axc1l/is_there_a_possibility_for_humans_to_breath/",
        "text": "Without scuba diver equipment, no oxygen bottles, etc. I am aware of the lower oxygen amount in the water in comparison to the air. But is there, i don't know, some kind of membran we could put on our bodies. Or a bubble which gets the oxygen from the water in gaseous oxygen for us to breath . Some kind of water electrolysis reaction ???",
        "created_utc": 1535447240,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a scientific reason why beam-propulsion can't hybridize beam-pushed (direct impulse) and beam-powered (electric or direct)?",
        "author": "Katylar",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aww26/is_there_a_scientific_reason_why_beampropulsion/",
        "text": "So I've been reading up on different proposed propulsion systems for spacecraft, and I got interested in Beam-Powered Propulsion.\n\nThe contextualize everything, this is how I understand it:\n\nA 'traditional' Beam-Powered Propulsion system uses energy from lasers or microwaves that are beamed directly at the spacecraft to heat up its propellant (working mass). Therefore, saving the spacecraft the necessity of massive reactors or fuel.\n\nAn alternative is an 'electric' version of a Beam-powered Propulsion system, wherein instead of directly heating the propellant using the lasers or microwaves, the EMR is captured (either using Photovoltaic cells or a Rectenna, respectively) and converted to electricity on the spacecraft. Said electricity is then what is used to power the engine/reactor of the ship (and other systems too, like life-support).\n\nLastly, we have Beam-pushed Propulsion (i.e. Direct Impulse), wherein the spacecraft has a 'sail' which the laser or microwave hits and pushes the spacecraft.\n\n-----------------\n\nHope I got everything down correctly.\n\nNow my question is this: is there any reason why these systems are always presented (or at least on the online resources I've found) as being largely mutually exclusive? Is there a reason why I haven't seen a proposed system wherein the 'sail', aside from being used as a surface to be 'pushed' by the photons, is also photovoltaic and therefore is able to use those photos to generate on-board electricity as well? \n\nThanks!\n",
        "created_utc": 1535441567,
        "upvote_ratio": ""
    },
    {
        "title": "If size and shape aren’t factors is it possible to shape a beer glass or beer mug so that you can pour a headless beer without tilting the glass to the side?",
        "author": "Grande_Latte_Enema",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9awqd2/if_size_and_shape_arent_factors_is_it_possible_to/",
        "text": "the only stipulation is that the vessel needs to be capable of holding at least a pint of beer and also be somewhat comfortably drinkable with 1 hand",
        "created_utc": 1535439709,
        "upvote_ratio": ""
    },
    {
        "title": "Could a malicious program gather information about a computer by abusing its random/pseudorandom number generator?",
        "author": "ApprehensiveBowler",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9awhzc/could_a_malicious_program_gather_information/",
        "text": "Let's say we have a malicious program with minimal system access whose goal is to gather as much information about the computer it's running on as possible. One of the few resources it can access is the operating system's random and pseudorandom number generators. Since random numbers require a seed that is usually in the form of data about the user, like mouse movements or sensor data, could abusing a computer's random/pseudorandom number generator theoretically allow the malicious program to determine the seed and the data which created it? Would this be possible with a modern operating system or are there mitigations against it?\n\nFor example, since mobile phones typically use sensors like the accelerometer to create the seed, and accelerometer data can be used to determine whether the person using the phone is moving or standing still, could a spyware that normally wouldn't be able to read accelerometer data use the random or pseudorandom number generator to figure out the accelerometer data and determine whether the user is moving? Using this method, would the program get a somewhat continuous stream of accelerometer data or only a few individual values?",
        "created_utc": 1535436955,
        "upvote_ratio": ""
    },
    {
        "title": "Would the One-Electron Universe theory be fulfilled by a Big Crunch scenario?",
        "author": "Zapotec_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9awh2z/would_the_oneelectron_universe_theory_be/",
        "text": "I was learning about the one-electron universe theory, and it was mentioned that one of the main issues with the theory was that there was a glaring lack of antimatter in the universe. A thought came to my mind.\n\n1. Antimatter can be matter that is charge shifted or running the opposite direction in time.\n2. Space and time are the same thing.\n3. Assuming Dr. Richard Mueller's dt=dx/c is true\n\nIf the universe ends in a Big Crunch scenario, the moment space stops expanding and starts contracting, due to  dt=dx/c, time will start running backwards. You have your one-electron universe's worth of antimatter. What are any issues with what I am  thinking here?",
        "created_utc": 1535436664,
        "upvote_ratio": ""
    },
    {
        "title": "What Would Happen If We Somehow Found A Way To Use Cryoprotective Dehydration?",
        "author": "DMPWhovian28",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aw1zp/what_would_happen_if_we_somehow_found_a_way_to/",
        "text": "[removed]",
        "created_utc": 1535431960,
        "upvote_ratio": ""
    },
    {
        "title": "Does gravity restrict terrestrial planets from gaining mass?",
        "author": "ForcedRonin",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9av612/does_gravity_restrict_terrestrial_planets_from/",
        "text": "I’ve researched the largest stars in the universe. I can’t help but to wonder if those stars have solar systems. If they do, what is the scale of those planets orbiting them? ",
        "created_utc": 1535423607,
        "upvote_ratio": ""
    },
    {
        "title": "Could there be more particles that exist outside the standard model that we cannot observe and therefore can never know about?",
        "author": "mrwong420",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9au03u/could_there_be_more_particles_that_exist_outside/",
        "text": "All the fundamental particles have been discovered through their interactions with other particles we can already observe. We also know that particles have varying degrees of interactions with each other. Is it possible then for there to be far more fundamental particles then we have found in the standard model? Perhaps wholly self contained system of particles that can only interact with each other but with none of the particles in the standard model?\n\nNeutrinos are the closest thing to what I am suggesting. But because they still interact ever so weakly we can conclude their existence. But perhaps there exists a particle or even several particles like the neutrino but with no interactions with the particles we can observe.\n\nCould it be possible then for a whole 'universe' to exist, alongside us, parallel to us but also unobservable to us? I know this endeavour is wholly unscientific as science relies on observation and it is impossible to pose serious scientific questions on the unobservable. But this is just a thought I had.\n\nBtw my understanding of particle physics is extremely limited so feel free to correct me on anything.",
        "created_utc": 1535413506,
        "upvote_ratio": ""
    },
    {
        "title": "Will a human extinction affect Earth's ecology in any undesirable way?",
        "author": "Sheikhspiere",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9at5n2/will_a_human_extinction_affect_earths_ecology_in/",
        "text": "",
        "created_utc": 1535406674,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the water molecule the only non-protein allergen/immunogen?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9at400/why_is_the_water_molecule_the_only_nonprotein/",
        "text": "[removed]",
        "created_utc": 1535406326,
        "upvote_ratio": ""
    },
    {
        "title": "a car automatic run opposite to earth gravity with out changing the design of road",
        "author": "tanboy123",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9at279/a_car_automatic_run_opposite_to_earth_gravity/",
        "text": "[removed]",
        "created_utc": 1535405946,
        "upvote_ratio": ""
    },
    {
        "title": "So will the rest of the virgo supercluster be reachable in billions of years due to universal expansion or something?",
        "author": "feelmysoul01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9asorf/so_will_the_rest_of_the_virgo_supercluster_be/",
        "text": "Or are we confined to our local group only actually? Is it possible to actually explore galaxies like the sombrero galaxy or something?",
        "created_utc": 1535403171,
        "upvote_ratio": ""
    },
    {
        "title": "Desalination of seawater in steam turbine power plants?",
        "author": "pbmonster",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9asdmf/desalination_of_seawater_in_steam_turbine_power/",
        "text": "As water shortage worldwide in general and in California in particular increases, I was wondering why we don't use steam turbine power plants - which need to boil water to create steam anyway - to thermally desalinate sea water.\n\nCalifornia in particular has tens of gigawatts of thermal power plants (nuclear, coal, natural gas, concentrated solar thermal, ect.). And since a 1 GW (electrical output) nuclear reactor actually has a thermal output close to 3 GW (thermal power plants are inefficient), all that heat could desalinate pretty large amounts of sea water by distillation.\n\nWhy isn't this being done? Are the technical details of dealing with the salt/brine in the system to complex? Couldn't the plants use their normal water/steam cycles, and run the desalination on heat exchangers after the turbines?\n\nWould it decrease the overall efficiency of the electricity generation?",
        "created_utc": 1535400932,
        "upvote_ratio": ""
    },
    {
        "title": "What happened if someone mix with electric battery, fire and water",
        "author": "mohamed61",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9arykm/what_happened_if_someone_mix_with_electric/",
        "text": "The instruction are\n1. Put water bowel in floor\n2. Get battery can have electric shock (it mean have lots of voltage)\n3. Then burn battery with fire then drop battery in water bowl.\n4. What will happen?",
        "created_utc": 1535397962,
        "upvote_ratio": ""
    },
    {
        "title": "What (non-nuclear) types of spacecraft engines can achieve high specific impulse and high thrust if provided with large amounts of electricity.",
        "author": "TheNameOf7",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9arxk8/what_nonnuclear_types_of_spacecraft_engines_can/",
        "text": "I'm working on a semi-hard science fiction setting and have a forward spotter and interceptor that uses a rectenna to allow it to use beamed power instead of an onboard reactor.\n\nI'm looking for a type of engine that can take advantage of this excess of electricity to be able to avoid missiles and ordinance. \n\nMost engines I have been able to look up either have high isp but low thrust (ion drives, and resistojets) , high thrust but low isp (chemical rockets), or are nuclear powered.",
        "created_utc": 1535397762,
        "upvote_ratio": ""
    },
    {
        "title": "How seriously are the ideas of Geoffry West taken?",
        "author": "UyhAEqbnp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9arq3a/how_seriously_are_the_ideas_of_geoffry_west_taken/",
        "text": "He is a scientist and claims to be speaking from scientific authority, so this seemed like the place to ask. His book, scale, draws on research to imply that cities follow power laws roughly commenserate to metabolism. What I find somewhat dubious is the assertion that, following this idea, there comes an inevitable timespan in the life of the \"organism\" where it must flatline and collapse. Not by any obvious reason either, but simply due to the scale as I understand it. \n\nAre these ideas taken seriously?",
        "created_utc": 1535396318,
        "upvote_ratio": ""
    },
    {
        "title": "Would building walls at beaches help cope with the inevitable coastal flooding from global warming?",
        "author": "majestic_failure",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9arkds/would_building_walls_at_beaches_help_cope_with/",
        "text": "",
        "created_utc": 1535395172,
        "upvote_ratio": ""
    },
    {
        "title": "What's the science (if any) behind the SCIO Biofeedback Device?",
        "author": "Sizzlin_Sausage",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ariqs/whats_the_science_if_any_behind_the_scio/",
        "text": "I went for a session done by a coworker who swears by this device. She put straps around my head, wrists, and ankles. Then she used an SCIO biofeedback device to scan my \"energy waves\". I sat there as it scanned me for 5 minutes.\n\nThis device spit out stuff it should have no way of knowing. Family history of schizophrenia, my own diabetes, autism that for years I've thought I had, seafood allergies, trouble connecting with people, fatigue, hypothyroidism. The one thing that sold me is that it said I have very strong \"gender identity issues\". I've never told anybody that I'm FTM trans and not to toot my own horn but I pass really well. The info it gave sounds way too specific to be a fluke. And I haven't shared any of that info with my coworker.\n\nThen she \"flipped the negative energy to positive\" to cure my back pain. Which I haven't had any trouble with since. Mind you, she tried to cure my diabetes and that did nothing, not to my surprise.\n\nIs there any science behind this at all? Is it some sort of weird placebo? Idk it's bizarre shit man",
        "created_utc": 1535394815,
        "upvote_ratio": ""
    },
    {
        "title": "Since gravity is lower the closer an object is to the earth's core, there would be some time dilation relative to the surface. Would this affect the rate at which radioactive materials decay near the earth's core, relative to the surface? Would this affect radiometric dating?",
        "author": "SomeGuy_tor78",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aq7fb/since_gravity_is_lower_the_closer_an_object_is_to/",
        "text": "&amp;#x200B;",
        "created_utc": 1535385833,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for a air to be held down with body of water?",
        "author": "svidakjammi",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9apu9z/is_it_possible_for_a_air_to_be_held_down_with/",
        "text": "Is it possible for a body of air(a large 'bubble') to be held down with the weight of water? Let me elaborate and separate for clarification:\n\n1) If I would release a single air bubble, or even a large one, at the bottom of the Marianas trench, would it float straight up? \n2.a) If yes; would it do so at the same speed or with the same ease as with lesser depths?\n2 .b) If no; how big could the body of air be without separating itself into smaller units?\n3) Could we apply some method to actively hinder the air from floating at extreme depths? 'containing' it within a finely woven net for example. A net on its own shouldn't have any affect, but coupled with extreme pressure it could be different.\n\nI realise that those depths are basically unattainable, but it works as a reference point. And sorry for the lengthy questions, I hope it isn't a problem :) ",
        "created_utc": 1535383320,
        "upvote_ratio": ""
    },
    {
        "title": "What are some ways an individual can accelerate global warming?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9apsqq/what_are_some_ways_an_individual_can_accelerate/",
        "text": "[deleted]",
        "created_utc": 1535383064,
        "upvote_ratio": ""
    },
    {
        "title": "What if you made a computer cluster out of all the unused machines in the world?",
        "author": "HenryWu001",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9apqp3/what_if_you_made_a_computer_cluster_out_of_all/",
        "text": "If you took all the unused computers, games consoles and laptops that are sitting in rooms or in garbage dumps and used them to build a cluster, or a number of clusters, would the result be a computing cluster of any practical use? The saying goes \"Reduce, Reuse, Recycle\", so presumably the aim should be to reuse computers until they are completely dead and then recycle materials. But would a cluster composed of unused machines be so outdated and weak and energy inefficient that skipping the Reuse stage and just Recycling the raw materials straight away would be make more sense? ",
        "created_utc": 1535382689,
        "upvote_ratio": ""
    },
    {
        "title": "What would have happened is Buzz Aldrin had fallen and torn his space suit while on the moon?",
        "author": "shaggy1452",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ap5da/what_would_have_happened_is_buzz_aldrin_had/",
        "text": "So in 1969 we send some people up to the moon, and they bring back video of them jumping around and moonwalking and playing on it like it’s a god damn playground. What would have happened if they tripped and fell and tore the space suit? Or was the suit durable enough and not enough gravity for it to even be an issue? Is there a plan B where they could have just patched it up really quickly before it becomes a fatal situation or is it pretty much insta death and your head explodes from being in a vacuum with compromised pressure control?",
        "created_utc": 1535378291,
        "upvote_ratio": ""
    },
    {
        "title": "Can a person with Down syndrome be gifted?",
        "author": "Vicara12",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aowwe/can_a_person_with_down_syndrome_be_gifted/",
        "text": "It may seem like a silly question, but if a person who would have an high IQ developed the Down syndrome mutation, would it be noticeable?\n\nEdit: As some of you pointed out, a person can't develop DS after being born. When I said \"developed Down syndrome\" I meant during gestation.",
        "created_utc": 1535376417,
        "upvote_ratio": ""
    },
    {
        "title": "What are the chances that i found a radioactive quarter and is that possible?",
        "author": "I_R_WEEZY",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aow5i/what_are_the_chances_that_i_found_a_radioactive/",
        "text": "[removed]",
        "created_utc": 1535376228,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if the vacuum of space was filled with Oxygen?",
        "author": "cboehm7",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9anyp2/what_would_happen_if_the_vacuum_of_space_was/",
        "text": "I know practically nothing about space. I think it would be really loud from stars exploding, but would we be able to hear it on Earth? Would the planets start moving towards the sun, since they slow down from air resistance?",
        "created_utc": 1535367579,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if all micro organisms in the world (viruses, bacteria etc.) were to disappear simultaneously?",
        "author": "gshan11138",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9amtu5/what_would_happen_if_all_micro_organisms_in_the/",
        "text": "[removed]",
        "created_utc": 1535353484,
        "upvote_ratio": ""
    },
    {
        "title": "How to create a home-made Hydrophobic liquid?",
        "author": "sidass",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9amokq/how_to_create_a_homemade_hydrophobic_liquid/",
        "text": "I'm curious to create an home-made hydrophobic liquid to apply on shoes/sneakers to help in the indian monsoons! :) ",
        "created_utc": 1535351654,
        "upvote_ratio": ""
    },
    {
        "title": "Ideas on how to get a planet to have the north pole in total night and the south pole in total daylight without killing everything in a blaze of glory!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9amnxn/ideas_on_how_to_get_a_planet_to_have_the_north/",
        "text": "[removed]",
        "created_utc": 1535351433,
        "upvote_ratio": ""
    },
    {
        "title": "What is Spacetime?",
        "author": "MoralBrigade",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9al53h/what_is_spacetime/",
        "text": "I've read a lot about it but simply couldn't grasp the concept. Could you guys make me understand the concept of spacetime?",
        "created_utc": 1535335934,
        "upvote_ratio": ""
    },
    {
        "title": "What was the atmospheric pressure of the hydrogen and helium environment during the first few millions of years after the Big Bang?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9akyar/what_was_the_atmospheric_pressure_of_the_hydrogen/",
        "text": "Approximately speaking, 380,000-400,000 after the Big Bang atoms formed up and the universe became transparent. 5 million years after the Big Bang that light had dimmed to relative darkness. 10 million years after the Big Bang the universe had cooled to 100 °C. 17 million years after the Big Bang it was 0 °C.   \n\nIf anyone knows how to find the atmospheric pressure anywhere during this period I'd appreciate a heads up. I'd also be interested in knowing when the gasses reached 1atm.  \n\nThanks for your time.",
        "created_utc": 1535334264,
        "upvote_ratio": ""
    },
    {
        "title": "Could you redirect an electric current by moving a heated piece of iron towards it?",
        "author": "TheWorldConqueror",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aknho/could_you_redirect_an_electric_current_by_moving/",
        "text": "Since metals are actually a bunch of nuclei huddled together and surrounded by a \"sea\" of electrons, and iron happens to be ferromagnetic, it would make sense that adding thermal energy would cause those electrons to flow faster. As such, I'd expect them to repel outside electrons from entering the metal.\n\nAs a follow-up question: why don't the electrons in the sea repel each other in nonheated metals?",
        "created_utc": 1535331639,
        "upvote_ratio": ""
    },
    {
        "title": "If FTL was possible how bright would FTL particles glow ? Or would they be unseeable",
        "author": "Mewto1k",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aklb1/if_ftl_was_possible_how_bright_would_ftl/",
        "text": "Would tachyons have a glow in them",
        "created_utc": 1535331093,
        "upvote_ratio": ""
    },
    {
        "title": "If a human colony was to settle on another planet, would we still be able to define its offspring as \"human\"?",
        "author": "-Satchmo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ak1az/if_a_human_colony_was_to_settle_on_another_planet/",
        "text": "",
        "created_utc": 1535326272,
        "upvote_ratio": ""
    },
    {
        "title": "With the two moon hoax circulating again, I would like to know what would the effect be on our planet if Mars were suddenly orbiting closely enough to appear the same size as the moon?",
        "author": "samstokes80",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ajpnp/with_the_two_moon_hoax_circulating_again_i_would/",
        "text": "&amp;#x200B;",
        "created_utc": 1535323447,
        "upvote_ratio": ""
    },
    {
        "title": "If the expansion rate of the universe is increasing why is it now ~ a hundred trillionth of a hundred trillionth of what it was when the universe was a trillionth of a second old?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ajfs4/if_the_expansion_rate_of_the_universe_is/",
        "text": "If [inflation ended in a fraction of a second](https://en.wikipedia.org/wiki/Inflationary_epoch) with the 93 billion light-year space of today's observable universe being somewhere between the size of a golf ball and a beach ball, how was it able to be a 100 light-years worth of room a second later and [200,000 light-years across 3 years after that](https://www.forbes.com/sites/startswithabang/2017/03/24/how-big-was-the-universe-at-the-moment-of-its-creation/#660082284cea) if the rate of space's expansion is increasing and today is just under [half a cm/s per light-year](https://www.jpl.nasa.gov/news/news.php?release=2013-109&amp;rn=news.xml&amp;rst=3739)?",
        "created_utc": 1535321140,
        "upvote_ratio": ""
    },
    {
        "title": "Possibly a dumb question?",
        "author": "bredksdjevjsbdodvedj",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ajavk/possibly_a_dumb_question/",
        "text": "[removed]",
        "created_utc": 1535320030,
        "upvote_ratio": ""
    },
    {
        "title": "Space anomoly in 1990",
        "author": "Talindred",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aj5ou/space_anomoly_in_1990/",
        "text": "In 1990, I was in high school in Kansas.  Marching band started at 7am and ran until 9am.  One morning, I think it was in the fall, there was a bright object in the sky.  It was very bright and tracked with the earth's rotation.  I remember it disappearing when it passed by (in front of or behind, not sure) the sun and coming out the other side.  \n \nIt looked like a circle with a bright flare on one side, like a diamond ring.  It was about a quarter the size of the moon and clearly visible during the day.\n \nEveryone at my high school saw it but I can't seem to find anything about it on Google.  I heard weather balloon but it lasted a long time.  I also heard super nova as a potential source.\n \nDid anyone else see this and can anyone find any information on it?",
        "created_utc": 1535318878,
        "upvote_ratio": ""
    },
    {
        "title": "How would our biology or even genetic makeup be different if red blood cells had mitochondria and did not need to rely on glucose as much?",
        "author": "manatrees",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aiygk/how_would_our_biology_or_even_genetic_makeup_be/",
        "text": "",
        "created_utc": 1535317262,
        "upvote_ratio": ""
    },
    {
        "title": "Are inertial forces really 'fictitious'",
        "author": "amindwandering",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aieim/are_inertial_forces_really_fictitious/",
        "text": "I'm making my way through Sciama's *The Unity of the Universe* and find his take on the the origin of inertia an intriguing one.  In brief, he suggests that, just as relatively accelerating electrical charges interact via magnetic forces in addition to the electric force interaction between stationary charges, accelerating gravitational charges (i.e. masses) should interact not only via the conventional sense but also via a gravitational analogue of magnetism.\n\nFrom here, he notes that – as with magnetism – the magnitude of the acceleratinal-induced, 'magnetic' component of gravity will decrease in direct proportion to separation distance rather than in proportion to the square of distance, which implies that the strongest influence of this 'gravitational magnetism' on an accelerating mass will come from very distant matter.\n\nBased on this, Sciama (very roughly) sketches out a simplification of the mathematics implied and claims, in defense of [Mach's principle](https://en.wikipedia.org/wiki/Mach%27s_principle), that it constitutes an actual physical mechanism in support of that controversial principle.\n\nIn other words, inertial motion, rather than being an intrinsic property of mass, is moreso a byproduct of the approximate homogeneity of the universe at large scale leading to the gravitational influence of very distant matter canceling out.  Whereas the so-called \"[fictitious](https://en.wikipedia.org/wiki/Fictitious_force)\" inertial forces, rather than being fictitious at all, literally become the bulk of the rest of the universe resisting the relative accelerations induced by local forces.\n\n&amp;nbsp;  \n\nWhat is the status of this line of thinking?  I can't remember having heard of the notion prior to this, and looking around briefly, it very definitely does not appear to be anything like a consesus position.\n\nDespite this, I haven't found anything lay accessible that refutes the notion directly, and Sciama invokes a seemingly compelling geometric analogy to a co-rotating system of electric charges that make the notion seem pretty plausible from a lay perspective: he notes that the electric component of electromagnetic action in such a system is of the same form as that of centripetal forces, and the same is true of Coriolis forces when compared to its magnetic interactions.\n\nAll that said, Sciama's account was definitely a broad strokes account.  Do his ideas have any key flaws that have led to it being rejected?",
        "created_utc": 1535312983,
        "upvote_ratio": ""
    },
    {
        "title": "Are we conscious when we are asleep? Are plants conscious?",
        "author": "niceassets89",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ahuwx/are_we_conscious_when_we_are_asleep_are_plants/",
        "text": "",
        "created_utc": 1535308917,
        "upvote_ratio": ""
    },
    {
        "title": "What are legit dangers of vaccines?",
        "author": "Maggotmaine",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aht7f/what_are_legit_dangers_of_vaccines/",
        "text": "I ask this question, because those anti-vaccinations brainfarts are so obnoxious that this is a question almost impossible to ask. I think to remember there were some problematic vaccines in the past and once the who recommended emergency bird flue shots there was some rumble that this might be more of a moneymaking scheme than real concern (evaluation by some scientist). So can we blindly trust each and every vaccination recommended to us in this day and age?\n\nPlease don't simply discard this question due to the overwhelming stupidity of a few sad vocal individuals, but keep in mind that maybe it fits someones agenda to make a discourse about the topic unviable, for each and every behavior there needs to be a reason and BS like vaccines cause autism is so out worldly stupid, this needs to be some next level marketing (make criticism impossible) a political agenda (set people so far apart from the main stream they blindly follow you; maybe comparable to the Donald cultist) or the conspiracy believes address a inner personal need I can't quite put my finger on.\n\nIf you can enlighten me on the topic I would be very grateful (I'm too scared to digg through the mountains of garbage those anti vaccines folks clogged the internet with to search on my own)",
        "created_utc": 1535308572,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Oxygen Generation System on the ISS sustainable?",
        "author": "MontyPanesar666",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aha0l/is_the_oxygen_generation_system_on_the_iss/",
        "text": " \n\nAs I understand it, the Oxygen Generation  System on the International Space Station zaps water molecules with  several volts, splitting H20 in Hydrogen and Oxygen. Am I right in  assuming that this hydrogen and oxygen is then regulated, such that the  right ratio of each (is anything else added?) is then pumped into the  cabins of the station (because pure oxygen is poisonous to humans?) for  the astronauts to breathe?\n\nMy main  question, however, is this: with a fixed initial supply of H20, and  ignoring machine degradation, can such a system infinitely provide  breathable air? As I understand it, an astronaut's urine is turned back  into water and then into air. But surely you get less water from the  urine than has entered the body (if so, what's the science behind why  this is?)? Thus, is there a gradual loss of H2O for the OGS to use and  so convert to O2?",
        "created_utc": 1535304557,
        "upvote_ratio": ""
    },
    {
        "title": "A man with the density of a super massive planet is fighting someone with the mass of 100kg. Pretend they're both invincible and can't be crushed by gravity. Since they are both inside the same gravity well, same size, standing together, do they experience time differently than each other?",
        "author": "CaptainMcSpankFace",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ah8e9/a_man_with_the_density_of_a_super_massive_planet/",
        "text": "Or do they experience it pretty much the same? With no air resistance and they both have the ability to swing at the same speeds mechanically... Are their reaction times the same?\n\nI was thinking of Goku and Broly fighting, or say Ichigo vs Kenpachi for the first time where it was clear that intense spiritual pressure = gravity around them increases 10s of times, causing weaker people to collapse and stuff, signifying their gravity wells were basically getting more dense.\n\nSo hypothetically in those made up worlds, with those given things, agreeing that it effects their gravity wells, I was wondering if the flow of time changes between each other as they fight face to face vs when one of them is 100 feet or 1000ft away.\n\nAt their sizes, is that far enough for the smaller person to get out and experience time moving differently, or would that person have to be many more miles away to be unaffected by the time compression?",
        "created_utc": 1535304200,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent should we dismiss industry funded studies?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ah11a/to_what_extent_should_we_dismiss_industry_funded/",
        "text": "[deleted]",
        "created_utc": 1535302676,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion about SYNESTHESIA being one of the predominant factor of many Ghost sighting?",
        "author": "Morpheus1992",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9agb7r/what_is_your_opinion_about_synesthesia_being_one/",
        "text": "",
        "created_utc": 1535297064,
        "upvote_ratio": ""
    },
    {
        "title": "Living vs. alive?",
        "author": "MrPancake101",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aeic7/living_vs_alive/",
        "text": "Biologically, is there any difference between an organism being alive vs. living?",
        "created_utc": 1535277651,
        "upvote_ratio": ""
    },
    {
        "title": "How efficient are artificial hearts ?and what are the morality rates ?",
        "author": "Mewto1k",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aedgm/how_efficient_are_artificial_hearts_and_what_are/",
        "text": "Do they have any side effects ? How long can a person with an artificial heart live ?",
        "created_utc": 1535275654,
        "upvote_ratio": ""
    },
    {
        "title": "How does high sugar intake increase the formation of adipose tissues? What's the mechanism?",
        "author": "BaidDSB",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9adwwp/how_does_high_sugar_intake_increase_the_formation/",
        "text": "Let's say a person cuts back on saturated fatty acids and only increase carbohydrate intake. Does that person become obese?",
        "created_utc": 1535268828,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the process behind how a zygote’s cleavages are activated?",
        "author": "MrPancake101",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ad57q/whats_the_process_behind_how_a_zygotes_cleavages/",
        "text": "I know that this ultimately comes down to the DNA being what causes a zygote’s cleavages to start, but what’s the process behind *how* the DNA causes this? I assume signalling pathways and other mechanisms are involved....",
        "created_utc": 1535258850,
        "upvote_ratio": ""
    },
    {
        "title": "Is a zygote considered an embryo?",
        "author": "MrPancake101",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ad2g2/is_a_zygote_considered_an_embryo/",
        "text": "Or is “zygote” itself categorized as a whole different stage of development, like “fetus”?",
        "created_utc": 1535257974,
        "upvote_ratio": ""
    },
    {
        "title": "How tall/large can a plateau/butte/mesa conceivably get?",
        "author": "VoltaireBud",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aczs1/how_talllarge_can_a_plateaubuttemesa_conceivably/",
        "text": "I'm currently worldbuilding and want to concoct a continental landform that would be completely hypothetical yet scientifically accurate. The image in my head is of a mist shrouded plateau roughly the size of Maine (or much larger if possible) skirted on all sides by 15,000 ft. tall (again, larger if possible) sheer cliffs. \n\nObviously this is heavily inspired by the gargantuan shield volcanoes of Mars such as Olympus Mons. Such an influence becomes more apparent when considering that the top should resemble an almost Moon-like world.\n\nMy question is to what extent is this possible on an Earth analog and under what conditions? \n\nI'm concerned that the sheer mass (no pun intended) would cause too much subsidence in the crust and make it sink to not-so-epic proportions. I'm also unsure what process best explains it. A stacked up lava field of basalt? Could a plate remain stationary over the necessary magma plume long enough? Would I have to forego tectonic activity altogether, like on Mars?\n\nI want to avoid erosion because I can't imagine it carving out something of such proportions. Am I right about that? I mean if I have to settle for a much smaller scale, there's always the [tepuis of the Guiana Highlands](https://en.wikipedia.org/wiki/Tepui) I can model if after, which were formed by erosion. In that case, though, how big could a tepui conceivably get? \n\nThe only other scenario that came at somebody else's suggestion would be something like a miniature continental plate beneath which all surrounding plates subduct because of its relative lightness, thereby lifting it to great heights, and perchance resulting in some cool lavafalls (?). However, I am far and away anything but a geologist; I don't even know if subduction occurs on land. It all sounds rather impossible. Still, if it were possible, this would be the ideal (see: coolest) scenario.\n\nAny well-informed input would be greatly appreciated.",
        "created_utc": 1535257186,
        "upvote_ratio": ""
    },
    {
        "title": "Could I buy a gigantic rock and attach it to a gravitaional pulley attached to a generator toake power as a \"battery\"",
        "author": "Zeno_3NHO",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9acwjf/could_i_buy_a_gigantic_rock_and_attach_it_to_a/",
        "text": "Similar to the \"gravity light\"\n\nCould I attach solar panels to the generator and during the day use excess energy to pull the rock up an inch or so and on a rainy day let the rock soon up the generator.\n\n.... And if this isn't the right subreddit let me know.\n",
        "created_utc": 1535256238,
        "upvote_ratio": ""
    },
    {
        "title": "How would the Earth, and our time on it, have been different if we didn't have the Moon?",
        "author": "onaJet27",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9abxb8/how_would_the_earth_and_our_time_on_it_have_been/",
        "text": "",
        "created_utc": 1535246711,
        "upvote_ratio": ""
    },
    {
        "title": "So Werewolves. What's the best way to deal with them given modern weaponry? Would Silver be the only real way to affect them? What would science say about these creatures?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9abuzm/so_werewolves_whats_the_best_way_to_deal_with/",
        "text": "[removed]",
        "created_utc": 1535246103,
        "upvote_ratio": ""
    },
    {
        "title": "How have climatologist dealt with political bias?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ab7dh/how_have_climatologist_dealt_with_political_bias/",
        "text": "[removed]",
        "created_utc": 1535240120,
        "upvote_ratio": ""
    },
    {
        "title": "Does nuclear stand a chance of becoming the primary source of energy in democracies?",
        "author": "ScienceDevo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aazuf/does_nuclear_stand_a_chance_of_becoming_the/",
        "text": "Please discuss independantly of your own opinion about nuclear power. I'm interested in the social dynamics.\n\nMany western countries try to gradually pull out of nuclear energy. The general population is not favourable to this energy source. Most wouldn't want a new reactor to be built anywhere near their home, no matter how (supposedly) safe. Politicians know that supporting nuclear energy will cost them votes. \n\nIs there any way to change people's minds about this? To make them distinguish between generation II, gen III and gen IV (whether it be thorium or whatever) reactors? Or is this a lost cause, in spite of its potential to change the world for the better?\n\nMight it help to call new generation reactors by a different name, i.e. to not talk about nuclear energy (even though, the term would scientifically be just as appropriate as it used to be)? \n\nWhat could persuade the general population of nuclear power after 2 (preventable) disasters? Bear in mind that energy, to most people, is a boring topic, however important. It is not as spectacular as rockets or super-cars.",
        "created_utc": 1535238235,
        "upvote_ratio": ""
    },
    {
        "title": "The Moon and daytime",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aaz8p/the_moon_and_daytime/",
        "text": "[deleted]",
        "created_utc": 1535238089,
        "upvote_ratio": ""
    },
    {
        "title": "Birds are the closest living relatives of dinosaurs, and there is evidence that raptors had feathers. Is the same true of dinosaurs that don't look like birds, like stegosaurus and apatosaurus?",
        "author": "thecorndogmaker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aatkp/birds_are_the_closest_living_relatives_of/",
        "text": "Did four legged dinosaurs like triceratops, stegosaurus, apatosaurus, etc. have feathers? Did they have any anatomy similar to birds? Are these dinosaurs more closely related to birds or crocodiles?",
        "created_utc": 1535236730,
        "upvote_ratio": ""
    },
    {
        "title": "How would a galactic calendar work?",
        "author": "DreadedL1GHT",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aari9/how_would_a_galactic_calendar_work/",
        "text": "Long story short, I'm creating a scifi world for a D&amp;D campaign, and I'm currently stuck with having a galactic calendar. How would a calendar work without basing it off of a single planet's day/night cycle?\n\nI'm basically trying to get a calendar that most empires could agree on, without having it based on a single planet that could be taken over or something. Any help would be appreciated.",
        "created_utc": 1535236222,
        "upvote_ratio": ""
    },
    {
        "title": "How much mass did the Late Heavy Bombardment add to Earth?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aarf1/how_much_mass_did_the_late_heavy_bombardment_add/",
        "text": "I'm also interested in how that compares to the mass of material delivered by asteroids and other objects between the formation of the Moon and the end of the LHB. \n\nAs well, if anyone knows of information about the ratio of compounds delivered by such sources or the LHB I'd appreciate it.  \n\nThanks.",
        "created_utc": 1535236200,
        "upvote_ratio": ""
    },
    {
        "title": "If you had to remove one organelle from all of one type of animal cell (neuron, muscle cell, etc.), which one's removal would allow for survival of the organism?",
        "author": "12349753",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aaik1/if_you_had_to_remove_one_organelle_from_all_of/",
        "text": "[removed]",
        "created_utc": 1535234164,
        "upvote_ratio": ""
    },
    {
        "title": "As CPUs get smaller and AI gets better, could AI humans deep in the future be created at nanosized levels to help study subatomic physics and other useful stuff?",
        "author": "CaptainJonHarvey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9aa1r0/as_cpus_get_smaller_and_ai_gets_better_could_ai/",
        "text": "Seriously imagine one day when we make machines that can print fully functional Human AI on to molecules or something. An intelligent consciousness that exists at the atomic level.\n\nOr going the other way, one day a solar system or galaxy sized conscious AI. \n\nWith all the stuff going on with AI, I wonder how many places considered the size these beings could be.\n\nedit: Okay how about this. A supercluster computer, as powerful as today's most powerful supercomputer, that could fit around the head of an ant? Are there any possibilities of that in the next few or more decades?\n\nOr the possibility of combining the processing power of several planet sized superclusters?\n\nDon't focus on the specific scales I'm listing, but the overall idea I'm asking, if today's computer scientists are considering the future of making roughly nano sized and roughly planet sized computers and human intelligent AIs and stuff.",
        "created_utc": 1535230271,
        "upvote_ratio": ""
    },
    {
        "title": "Is dark matter part of a higher dimension we can't see or something?",
        "author": "feelmysoul01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a8at7/is_dark_matter_part_of_a_higher_dimension_we_cant/",
        "text": "",
        "created_utc": 1535216668,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be too simple to say that a decent amount of scientific discovery/research/ is common sense?",
        "author": "TheAuth0r",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a7ycd/would_it_be_too_simple_to_say_that_a_decent/",
        "text": "The caveat I'll add is that when you get into the more quantitative and abstract sciences, this idea of mine becomes less and less applicable; but common sense is most definitely not the right phrase, but it's the best phrase I could think to capture the connotations I want to put into your head if you read this. What I really mean is ok, maybe you don't know the scientific nomenclature or the technical cogs behind the mechanism, but if you're someone who observes/analyzes, can put 2 and 2 together etc... a lot of them you could have thought about or figured out yourself, obviously just more rudimentary compared to the technically proficient.\n\nFor example, I remember a while back when a scientific studies would come out and it was like a revelation for the wews, it was just telling you that a baby's health isn't just dependent on the mother like previously thought, the father's lifestyle and diet etc... also play a huge role, isn't that common sense?\n\n\nAnd maybe you will think this example is too far fetched because of the anachronistic nature of the discovery but, I also feel like Germ Theory wasn't the hardest conclusion to come to. \n\n\n(This is not a value or character judgement)Or research telling us that women are \"evolutionary gold diggers\", if you just look around you, no matter what time period you lived in, it's clearly obvious that women used their sexuality and men's desire of it as a tool of survival. You don't need science to tell you that. \n\n\nI apologize, I had a couple more examples, but for some reason, now that when I'm put on the spot, I'm drawing blanks but I feel like a decent sector of Science is making simple things complex to try and make then simple again. It's very similar to philosophy in that way specifically.\n\n\n",
        "created_utc": 1535213916,
        "upvote_ratio": ""
    },
    {
        "title": "What if the sun rose 50 minutes later every day like the moon?",
        "author": "tetral",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a6lc9/what_if_the_sun_rose_50_minutes_later_every_day/",
        "text": "",
        "created_utc": 1535201889,
        "upvote_ratio": ""
    },
    {
        "title": "What are some interesting cerebral events or symptoms that we lack brain scans of ?",
        "author": "Juncoril",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a6do6/what_are_some_interesting_cerebral_events_or/",
        "text": "First of all, english is not my native language and I apologize for any error. Please tell me if I could have phrased anything better !\n\nBrain scans with MRIs seems a rather bothersome thing. I wondered if there are some things we do not have any imagery of because we cannot predict or induce them ? Like hallucinations for example, or other delusions.",
        "created_utc": 1535199532,
        "upvote_ratio": ""
    },
    {
        "title": "What does the space program hope to accomplish?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a657j/what_does_the_space_program_hope_to_accomplish/",
        "text": "[deleted]",
        "created_utc": 1535196772,
        "upvote_ratio": ""
    },
    {
        "title": "What is the current scientific consenus on the carrying capacity of Earth?",
        "author": "Deat_h",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a5ezh/what_is_the_current_scientific_consenus_on_the/",
        "text": "",
        "created_utc": 1535186663,
        "upvote_ratio": ""
    },
    {
        "title": "Would Adolf Hitler be a different person (Better/Worse) if he had a different childhood (a loving, supportive and caring childhood)?",
        "author": "abusedadolf",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a58rt/would_adolf_hitler_be_a_different_person/",
        "text": "[removed]",
        "created_utc": 1535184196,
        "upvote_ratio": ""
    },
    {
        "title": "With the cheapening of space travel, will it become viable to get rid of trash in space?",
        "author": "Alteredracoon",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a4py8/with_the_cheapening_of_space_travel_will_it/",
        "text": "",
        "created_utc": 1535177296,
        "upvote_ratio": ""
    },
    {
        "title": "How long will it be until the Great Attractor collides with or takes a corner around the Shapley Attractor?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a30cg/how_long_will_it_be_until_the_great_attractor/",
        "text": "[pic for context](https://assets4.bigthink.com/system/tinymce_assets/8886/original/Shapley_Attractor_1.jpg)",
        "created_utc": 1535159854,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to make a truth serum/potion?",
        "author": "ChillDude4763",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a2n8w/is_it_possible_to_make_a_truth_serumpotion/",
        "text": "Basically anything that forces you to tell the truth. Like, the potion they used in Harry Potter (I think it was the fourth book). Also, how would you go about making this potion? Is it in any way possible?\n\nThanks in advance for you reply!",
        "created_utc": 1535156582,
        "upvote_ratio": ""
    },
    {
        "title": "Is my Monoverse correct?",
        "author": "shayan012",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a2mo5/is_my_monoverse_correct/",
        "text": "Ok so I thought of this: There's the Multiverse theory that says that there are infinite universes which would mean that everything we can imagine has happened and is happening in some other universe as long as it's in accordance with the laws of physics (correct me if I'm wrong). So, if our universe is infinitely big doesn't that mean that everything would happen here too? I'm most probably missing something which makes that illogical but I wanna know what that is. \nThis doesn't mean I think the Multiverse theory is wrong or anything I was just wondering ;)",
        "created_utc": 1535156450,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think there will be a science renaissance?",
        "author": "darkseadrake",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a2ewv/do_you_think_there_will_be_a_science_renaissance/",
        "text": "A period in our lifetimes where it’s constant scientific discovery after scientific discovery that things go so advanced in our lifestyles.  Do you think such a period will arrive? If so when?",
        "created_utc": 1535154526,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen when a black hole made of matter and a black hole make of antimatter collide?",
        "author": "ddotquantum",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a1wr8/what_would_happen_when_a_black_hole_made_of/",
        "text": "I’ve heard that there’s no way to distinguish between anti &amp; normal matter black holes.  So if they were to collide, would anything different happen than a collision between black holes of the same type of matter?",
        "created_utc": 1535150276,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between biology and natural history?",
        "author": "LordBrighton",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a16zo/what_is_the_difference_between_biology_and/",
        "text": "Going to post here since r/AskScience has not yet approved my question.\n\nCan someone explain the difference between the two? Are they both distinct? Is natural history a subset of biology? Is a practioner of natural history called a naturalist? If so what do they do differently from biologists?\n\nI myself am more interested in plants and animals, all the different species, where they live, their behaviours etc. Would that make me lean towards biology or natural history?\n",
        "created_utc": 1535144777,
        "upvote_ratio": ""
    },
    {
        "title": "How much larger would it have appeared when the surface of the Moon was only ~16,000km from ours?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a13e3/how_much_larger_would_it_have_appeared_when_the/",
        "text": "It's [been suggested](http://science.sciencemag.org/content/338/6110/1052.long) that 4.5 billion years ago the Moon formed 3.8 R⊕ away. I'm curious how that would have looked compared to its apparent size today.  \n\nI've seen some work [from 1986](https://www.nature.com/articles/320600a0) saying that by 2.5 billion years ago it was 52 R⊕ out. If anyone knows of any suggested distances between its formation and then I'd appreciate it. \n\nI'm also interested in how bright a full moon would have been when it was first formed if the different atmospheric composition and a [Sun that was only 70% as bright](http://faculty.wcas.northwestern.edu/~infocom/The%20Website/evolution.html) are taken into account.  \n\nThanks.",
        "created_utc": 1535144048,
        "upvote_ratio": ""
    },
    {
        "title": "For a novel I'm writing - In 1998, would it be normal for a person suffering the simptoms of IBS to have a bowel MRI? Or were MRI scans not common at the time?",
        "author": "Nemarar26",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a0wgm/for_a_novel_im_writing_in_1998_would_it_be_normal/",
        "text": "Bonus question: could Buscopan also possibly be injected? Or was that substance only starting to be used for bowel scans in modern times?",
        "created_utc": 1535142599,
        "upvote_ratio": ""
    },
    {
        "title": "Could the US or Russia wreck the planet without firing a shot at another country?",
        "author": "catomi01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a0edx/could_the_us_or_russia_wreck_the_planet_without/",
        "text": "I was advised over at r/askscience that this type of question might fit better here:\n\n&amp;#x200B;\n\nI feel the need to start this question with a disclaimer that I am not a  lunatic or a terrorist, but I'll leave that judgement to others.  One  of the predicted outcomes of a large-scale exchange of nuclear weapons  is a Nuclear Winter due to the resultant dust and debris.  My question  is, if the US or Russia launched its own missiles at its own territory,  could they effectively wreck the world?  Or would the damage and  fall-out be too localized?  If not, would it have been possible when  each superpower's nuclear stockpile was at its peak during the Cold War? ",
        "created_utc": 1535138873,
        "upvote_ratio": ""
    },
    {
        "title": "What will replace electricity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9a0cgk/what_will_replace_electricity/",
        "text": "[deleted]",
        "created_utc": 1535138471,
        "upvote_ratio": ""
    }
]