[
    {
        "title": "How many non-academics people would believe in critical race theory?",
        "author": "xunkuang",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yrn9dp/how_many_nonacademics_people_would_believe_in/",
        "text": "",
        "created_utc": 1668104149,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does “objectification” work on character selection based video game characters?",
        "author": "DefinitelyAlphamale",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yqtd11/how_does_objectification_work_on_character/",
        "text": "I understand objectification in real life or even movies. I am aware of different definitions of the word (all by Martha C. Nussbaum). Objectification can be when X doesnt have agency or safe space of their own, is treated as a commodity, is “like all the other X-s”, is not considered as having feelings. \n\nI guess fictional movies and books should follow the same logic then as video games but i dont know how (or WHAT definition) to apply with “objectification” to a female human videogame character. \n\nI guess the simplest one is their looks: they can be sexualized. But this alone says not much. \n\nWhen i think about movies and books i use the definition of male gaze and the fact that a woman is the passive and she is looked at and dominated by a man: she is an object. But in games where you have male and female characters that you have to choose from, where is this domination?\n\nBut in a video game where all characters are equal in the isolated game space (they have to be equal in power otherwise the game would be unbalanced, broken, unplayable, bad), i dont know how i can find the objectification in their agency, treatment etc.\n\nA separate thing is representation/presentation (like when a female would go and play this character) but thats not what im asking right now.",
        "created_utc": 1668023109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know of any ways to prevent people from becoming abusive?",
        "author": "crack__head",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yqnemu/do_you_know_of_any_ways_to_prevent_people_from/",
        "text": "There are plenty of effective methods to prevent sexual assault in terms of empowering victims. I think that is highly important, but I am curious if anyone here knows of any literature on how to prevent abusers from committing these acts to begin with. I have been curious about this for a while but have struggled to find any relevant literature. \n\nThank you, and I hope I do not offend anyone with my post. I am pro-victim 100%. I just think if it is possible to prevent people from committing these acts that would be important too.",
        "created_utc": 1668010474,
        "upvote_ratio": 1.0
    },
    {
        "title": "The The quantum physicists and astrophysicists seem to be telling us that what we perceive as reality, does not exist. So, do we; A) ignore the science?, B) accept it but understand that it does not apply to practical reality?, C) develop a new and more robust notion of reality?, D) Abandon reality?",
        "author": "shagminer",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yql7vv/the_the_quantum_physicists_and_astrophysicists/",
        "text": "",
        "created_utc": 1668005777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are Asian countries more culturally conservative than Western countries?",
        "author": "MaxMaxMax_05",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yqkup6/why_are_asian_countries_more_culturally/",
        "text": "Asian countries include Middle-Eastern countries, Indian subcontinent countries, Southeast Asian countries, East Asian countries, and Central Asian countries.\n\nThere is a heavy emphasis on maintaining tradition in these countries while in the West, they try to break free from uncomfortable traditions. This isn't to say that Asian countries don't attempt to break free from uncomfortable traditions, it is just that they are less occurring than Western countries.\n\nMany Westerners travel to Asia to experience \"tradition\" while many Asians travel to Western countries to experience \"beauty.\" \n\nI feel like even the most liberal Asian \"country\" (Taiwan) is more socially conservative than the most conservative Western country (Poland). \n\nWhat political or social developments make Asian countries more culturally conservative than Western countries?",
        "created_utc": 1668004921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Literature on Disability Kinship and Gender",
        "author": "Mission_Plantain_764",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yqgx7b/looking_for_literature_on_disability_kinship_and/",
        "text": "Hi! looking for any literature on Disability Kinship and Gender. Please let me know about the same if y'all know about anything. It would be really helpful. Thanks!",
        "created_utc": 1667995178,
        "upvote_ratio": 1.0
    },
    {
        "title": "A survey about stereotypes (English speakers)",
        "author": "AlexandraLitvi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yqfyna/a_survey_about_stereotypes_english_speakers/",
        "text": "[removed]",
        "created_utc": 1667992602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do revenge fantasies and feelings of wanting revenge occur?",
        "author": "Serious-Ball9247",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yqfmw4/why_do_revenge_fantasies_and_feelings_of_wanting/",
        "text": "It feels to me like revenge fantasies are a relatively common thing. From a situation as simple as person A insults person B then person B thinks of a witty returned insult hours later that makes them feel better. (Or at least imagining the situation where they used this new insult response.) Then there’s situations where person A physically harms someone person B knows. There may be revenge fantasies on person A. \n\nI guess I don’t understand why humans seem to have this inclination. Were humans 10s of thousands of years ago also having thoughts/desires of revenge? Are these feelings driven by biology, society, something else? \n\nI think there’s the flip side to this as well, that fulfilling a revenge fantasy doesn’t necessarily make the harmed party feel better. So maybe it’s just the thought of revenge is a coping mechanism?\n\nI’d be interested if there are research papers about this, what area of study I should look into to learn more about this, or if anyone has good insight into this.",
        "created_utc": 1667991727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory Wednesday | November 09, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yq2tmc/theory_wednesday_november_09_2022/",
        "text": "Theory Wednesday topics include:\n\n\\* Social science in academia\n\n\\* Famous debates\n\n\\* Questions about methods and data sources\n\n\\* Philosophy of social science\n\n\\* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.",
        "created_utc": 1667952011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are non-English place names really four or five word descriptions in the native language?",
        "author": "jaker9319",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/ypqc99/are_nonenglish_place_names_really_four_or_five/",
        "text": " \n\nSo I'm not sure if I am asking this question correctly but I don't know how else to ask it.\n\nFor context, I am an American who only speaks English.\n\nWhen reading an English language Wikipedia article or another source about a place in another country alot of times they will say the name means \"X\" in another language. For example - Mbombela in South Africa means \" many people together in a small space\" in Siswati.\n\n**My question is - are native Siswati speakers really saying \"many people together in a small space\" everytime they say the name?** Or any other situation like this? Like it seems funny to me if it were a direct translation in English, and I said oh I live in \"many people together in a small space\". Not funny in a bad way, more that I feel like its not really case but don't understand any other way it could be.\n\nI guess my confusion stems from two parts - the English translation is often times like 4 or 5 words and it seems like the names usually \"mean\" something in the local language (rather than another language). That second part makes sense, it is just unusual for me as an American because (at least in my state) many place names are either based on the Native American name, a French name, or some game of telephone Native American name \"translated\" to French. And to go back to the 4 or 5 words part, even when names are English words it is almost never more than 2 words and often times the format is \\_\\_\\_ City or Port \\_\\_\\_\\_. So there is never a situation where I say \"I am going to \"the trees whisper softly\" or \"many people together in a small space\" \" or anything like that. Right now my hunch is that it is the translation that makes the name seem longer than it is. Like in my state there is a city Grand Rapids. And my theory is that maybe in another language when explaining the name they are writing the equivalent to \"the place where very large water flows quickly over the rocks\". Like breaking down the definition of each word. So that is why the names are so long when written out, but in reality (going back to my original example) when a native speaker of Siswati is aying Mbombela they are really just saying \"crowded place\".\n\nDon't know if that made any sense, but am just really curious and finally had some time to ask.",
        "created_utc": 1667923057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books exploring the idea that humans have always been the same?",
        "author": "YahyaBinIlyas",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/ypbe4m/books_exploring_the_idea_that_humans_have_always/",
        "text": "Any books that expound on the idea that humans have always been the same, in terms of their social behaviours and ways to cope?\n\nFor example, I think there's not much difference in how humans experience different emotions now as compared to any other time in history. It's just that we have different outlets due to technology.\n\nWanting to emulate the popular culture is the same, whether it was teens forming bands in the 70s or teens having beauty channels on youtube now\n\nThe anxieties someone has when in employment of someone are relatable to a medieval farmer just as much as a modern white-collar worker. \n\nOr like how the rich committing tax fraud can have a similae rationalization as a worker manipulating a performance perimeter to evade a deduction in their salary. \n\nThere is always inter-generational tension due to newer generations being perceived as having it easy or being spoiled but suffering for everyone entails the same experiences really.\n\nThis idea of human emotions being similar but manifesting in different ways at different times and under different cultures and systems.\n\nIs there any book that goes to town on this?",
        "created_utc": 1667882603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is price stickiness/flexibility another term for low/high elasticity?",
        "author": "dcsafergthjyuhrge",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yp6jpv/is_price_stickinessflexibility_another_term_for/",
        "text": "[removed]",
        "created_utc": 1667868846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Third party crime reporting",
        "author": "my_research_account",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yp2mvx/third_party_crime_reporting/",
        "text": "I am almost certain I remember seeing a summary done on a study of how often various crimes were known to 3rd parties, but the 3rd party did not report the crime. It has probably been a few years, I'll admit, but I can't seem to find it. I keep getting results regarding failure to report crimes by the victims, but that's not relevant to the discussion at hand except as a comparison to the 3rd party rates. Between that and paywalls, I've been getting rather frustrated.\n\nIn particular, I was looking for rape vs assault vs theft and how the failure to report by 3rd parties compared against the failure to report by victims. Relationship to the perpetrator would be especially helpful, but that may be asking too much.\n\nI'm not really sure where would be the best place to ask about this, so I thought I'd start with social science.",
        "created_utc": 1667859739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I find the opinion of social scientists (political scientists, economists, etc.) on candidates and political issues?",
        "author": "timnru",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yove7k/where_can_i_find_the_opinion_of_social_scientists/",
        "text": "It would help me vote.\n\nAlso, I've been thinking about this: do social scientists support any candidate or policy? Usually candidates are not social scientists, nor are their policies based on social science. Do social scientists look at the available candidates and the issues and decide to not vote?",
        "created_utc": 1667845103,
        "upvote_ratio": 1.0
    },
    {
        "title": "In terms of our collective behavior in society where do we draw the line of what is and is not considered conformity?",
        "author": "jimson91",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yos00n/in_terms_of_our_collective_behavior_in_society/",
        "text": "According to the [Wikipedia](https://en.wikipedia.org/wiki/Conformity#Varieties) page, Conformity is the act of matching attitudes, beliefs and behaviors to group norms, politics or being like-minded. According to the page, there are two main reasons for conformity: informational social influence and normative social influence. Individuals display conformity in response to informational influence when they believe the group is better informed, or in response to normative influence when they are afraid of rejection. When the advocated norm could be correct, the informational influence is more important than the normative influence, while otherwise the normative influence dominates.\n\nThere are however conventional behaviors and standards that are common in society which are NOT the result of normative or informational social influence. For example, driving on the conventionally-approved side of the road may be seen as conformity, and perhaps it is conformity by definition. However the social influence achieving conformity in this case is different. Nobody is driving on the conventional side of the road for social approval but rather for reasons of survival. If an individual decides to drive on the other side of the road he will be driving onto incoming traffic and could possibly lose his life. There is also a threat of punishment involved if the rules are not obeyed.\n\nTake for instance having a job, which billions of people all around the world must have in order to survive. Would having a job be considered conformity? Having a job is a convention but is also a requirement so I would regard the primary influencing factors in this case to be economic dependency and survival. \n\nShould following a behavior that is common be classified as conformity if the influencing factor is driven by survival or economic dependency?",
        "created_utc": 1667838269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help defining important places for a fictional setting with high correspondence to the real world?",
        "author": "ArtMnd",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yod3zu/help_defining_important_places_for_a_fictional/",
        "text": "Hey, Reddit! I'm writing a fictional setting for some RPG campaigns as well as writing for possible future books, and one element of that setting is as follows:\n\n^(Cursed Lands - Places in which a large amount of human negative emotion is gathered, creating a funnel of spiritual energy from large parts of a region, country or even the Earth, for similar energies. Oftentimes, suicide hotspots where too many people kill themselves in the same place will gather feelings of work or education related stress, or alienation from a whole nation or even group of nations in one area. This entire area will be ridden with evil specters, and the surrounding areas will be a hotspot for haunted terrains (haunted houses, hospitals and other buildings and areas) and even interdimensional rifts (hell rifts and the like). Examples are the Aokigahara Forest in Japan, the Auschwitz death camp in Germany and the Golden Gate Bridge in the United States.)\n\nSo, this doesn't actually need to be suicide hotspots or anything. Could even be infamous historical places like Auschwitz, and other important areas filled with negativity for one reason or another. Any reason, provided there's a lot of negativity surrounding that place.\n\n^(Cursed Lands are very important in this setting as they can make entire cities (or, in the case of the Golden Gate bridge in California, an entire circle around it swallowing a couple counties and parts of counties across a chunk of the 1st district of California) places where adventures can get especially hot, which unusually high concentrations of paranormal activity and all the stuff that makes the story happen in this world. I'd really appreciate suggestions of all kinds of cursed lands. It's an Urban Fantasy setting with a Masquerade, so from the perspective of people without supernatural powers and who aren't in the government or very influential families or corporations/organizations, the world's history looks almost the same as that from IRL.)\n\nSo it leads to my question: is this even a Social Science related question, this specific writer's research? Should I be asking in Anthropology or History instead? \n\nAnd also, what kinds of places would you all suggest for my fictional setting's Cursed Lands and why?",
        "created_utc": 1667796795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I major in Philosophy, sociology, or anthropology? will either three be a good career major?",
        "author": "AverygreatSpoon",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yoc7fl/should_i_major_in_philosophy_sociology_or/",
        "text": "TL;DR: I absolutely enjoy commentary and video analysis essyas that delve into the behavior of people, what they've done, and why it happened/the concerns of it. Not in a psychology way however. I'm unsure what degree best fits my desires in discussing these topics and interacting with others.\n\n\n\nI have quite some time to pick a major as I'm in 11th grade, however I believe I mad some changes in what I degree I wanted to pursue. I originally wanted to major in communications and minor in journalism, but I noticed how I have a keen taste for commentary and analysis essays in regards to concerning phenomenons that take place omg societies. For example, I watched a video on collective trauma as a generation and how that plays out, and how the video mentioned the \"spectacle\" in which people are more focused on what could conform to it (such as wanting representation in the media more than being focused on what could help with agriculture in the world). The person in the video said this, but I started to realize how often this takes place now. (I'll love to go into more detail, but I get carried away with writing lol) Anyways, it made me begin to rethink what I want to pursue as a degree, and what could compliment me the most. I enjoy asking questions and socializing, however I love analysis and understanding topics in regards to how people function based on what the topic is. Carl Jung deeply interested me because of my favorite boy band implementing ideologies into their music. Which led to me question if his takes are sociology, or philosophy. I want to intergrate either one with communications, as I aspire to be a journalist; or something similar to one. I know what I'm seeking out in a degree, but not sure what degree has what I'm looking for in the future. I'm intrigued by Carl Jung's theories on dreams as well, but not sure if that's sociology or philosophy either. I like watching those videos, or see something online that could seek to be controversial or a touchy opinion, and begin to ask peers, family, or others online what their stance is on it and why. Why do people have the tendency to gravitate to someone harmful for them? Why is it hard to understand how dreams work? The relations in the subconscious and unconscious? How does this affect the functionality of people? Etc. I want to turn it into a career path, something to pursue. But I don't know what name to put to it. I mad an essay on why is it hard to be ethical online too. I can't just simply tell if sociology or philosophy is the name, or if they go hand in hand. Heck, if I can do both in college whole still minoring in communications. I'm unsure if either will be able to help me have a stable career future as well.",
        "created_utc": 1667793980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monday Reading and Research | November 07, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yo70if/monday_reading_and_research_november_07_2022/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\n&amp;#x200B;\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!",
        "created_utc": 1667779211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for articles that deal with epistemology and fake news or epistemology and social networks",
        "author": "hi_sigh_bye",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yo2piz/looking_for_articles_that_deal_with_epistemology/",
        "text": "I want to understand how epistemology is shaped in the eye of social networks or fake news environments. Any help would be greatly appreciated",
        "created_utc": 1667768641,
        "upvote_ratio": 1.0
    },
    {
        "title": "How accurate and reliable is the claim that African-Americans commit more crime than other races?",
        "author": "EnvironmentalTap6314",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/ynsee8/how_accurate_and_reliable_is_the_claim_that/",
        "text": "Hi.  Ok so don't most believe that African-Americans commit more crimes than other races because of socioeconomic factors? But do African-Americans even commit more crimes?\n\nWhat data proves that? The American criminal justice system is extremely racist and biased against African-Americans. African-Americans are constantly unfairly targeted and arrested. That is why the FBI crime statistics and \"African-Americans are 13% of America and makeup 50% of murders\" are not reliable.\n\nThe American police system also has many white supremacists and nazis.",
        "created_utc": 1667747269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I read The WEIRDest People in the World: How the West Became Psychologically Peculiar and Particularly Prosperous by Joseph Heinrich?",
        "author": "Pyropeace",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/yn2akv/should_i_read_the_weirdest_people_in_the_world/",
        "text": " It was recommended to me by another person on r/AskHistorians as a more reliable alternative to Jared Diamond's works, but the wikipedia article says it's similarly a work of \"big history\", which isn't always looked favorably upon. Is it worth the read?",
        "created_utc": 1667673349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is bonding with children you're taking care of and raising a human instinct or does it take conscious effort and need to be learned?",
        "author": "Loud-Candle-3692",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/ym3zoa/is_bonding_with_children_youre_taking_care_of_and/",
        "text": "",
        "created_utc": 1667580614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello👋 Dear Colleagues, Have a good day. Today our Research Topic👩‍🏫:",
        "author": "readjournal00",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/ylpwpx/hello_dear_colleagues_have_a_good_day_today_our/",
        "text": "[removed]",
        "created_utc": 1667539921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any datasets that in the social sciences literature that can be used to practice RCTs?",
        "author": "VastDragonfruit847",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/ylpucl/are_there_any_datasets_that_in_the_social/",
        "text": "I am looking for non-medical data. Preferably data sets from social and behavioral sciences perhaps?",
        "created_utc": 1667539701,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would someone send a picture of them self to another person they don't know over then internet, and then delete it?",
        "author": "Tactical_L",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9k4tkr/why_would_someone_send_a_picture_of_them_self_to/",
        "text": "[removed]",
        "created_utc": 1538297290,
        "upvote_ratio": ""
    },
    {
        "title": "Do vaccination percentages differ for pets (dogs/cats) versus children in those who believe in vaccinations versus those who do not believe in vaccinations?",
        "author": "ChemMPH",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9k0wgd/do_vaccination_percentages_differ_for_pets/",
        "text": "In other words, do those who believe vaccinations cause autism believe their dog will get autism if their dog gets vaccinated? Are they less likely to get their dog vaccinated because they believe their dog will be harmed by the vaccine? \n\n&amp;#x200B;\n\nUnder this hypothesis, it follows this first scenario. The category of people who believe vaccinations equally cause harm to children AND pets will have lower percentages of vaccinating their children AND pets. A second scenario is if they believe only children are harmed and pets are not harmed, then the percentages will differ. We would expect a higher percentages of pets getting vaccinated compared to children. The logic being, \"who cares if a dog gets autism?\" The table below shows the different categories of actions and beliefs.\n\n&amp;#x200B;\n\n||Does not vaccinate pet|Vaccinates pet|\n|:-|:-|:-|\n|Person believes vaccines cause autism|a|b|\n|Person believes vaccines do not cause autism|c|d|\n\n&amp;#x200B;\n\nThe third and fourth scenario are less interesting to discuss. Respectively, if pets are more harmed by vaccinations than children and if children and pets are not harmed by vaccinations.\n\n&amp;#x200B;\n\nI was unable to find a similar question on this subreddit. I was unable to find research looking at veterinary vaccination percentages. I am also no much into the immunology field, so I'm not aware of social perceptions of vaccinations. Just to be clear, I believe in vaccinations. I've taken a human immunology class, understand odds ratios/regressions used in vaccination studies, and understand the difference between correlation regression and causal analysis. My intent is a playful thought experiment in asking if a person who believes vaccines cause autism - believes a dog or cat can get autism.",
        "created_utc": 1538258038,
        "upvote_ratio": ""
    },
    {
        "title": "Why does US have fewer per capita doctors as compared to Western Europe even though their income is higher in US than Europe? Shouldn't that attract more people to the profession?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jye90/why_does_us_have_fewer_per_capita_doctors_as/",
        "text": "",
        "created_utc": 1538239077,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion on this video trying to disprove the use of Power plus Privilege?",
        "author": "SOMUCHNOPE123",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jvxx2/what_is_your_opinion_on_this_video_trying_to/",
        "text": "[removed]",
        "created_utc": 1538221388,
        "upvote_ratio": ""
    },
    {
        "title": "Did Spanish-speaking immigrants in the US affect in speech of African-Americans?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jvbmq/did_spanishspeaking_immigrants_in_the_us_affect/",
        "text": "[deleted]",
        "created_utc": 1538214512,
        "upvote_ratio": ""
    },
    {
        "title": "Would a large engine feel hotter than a smaller engine if they are both running at the same temperature?",
        "author": "slnova",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jq22n/would_a_large_engine_feel_hotter_than_a_smaller/",
        "text": "[removed]",
        "created_utc": 1538163234,
        "upvote_ratio": ""
    },
    {
        "title": "You have imperialist countries. Is there a general term for the country being imperialized upon?",
        "author": "anonoman925",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jnzga/you_have_imperialist_countries_is_there_a_general/",
        "text": "",
        "created_utc": 1538148882,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | September 28, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jn8lm/friday_freeforall_september_28_2018/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1538143552,
        "upvote_ratio": ""
    },
    {
        "title": "What methods should be used when comparing actual historical social structures to what they may have been under slightly different circumstances?",
        "author": "kripkencula",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jjy5a/what_methods_should_be_used_when_comparing_actual/",
        "text": "Take the United States for example - how can we compare the effect of Trumps America to what might have occurred if Hilary Clinton had won. Or take for example China. People in various political schools of thought will argue about the Dengist reforms that shaped the political-economic structure of China in the late 70's and 80's. Perhaps millions were lifted from poverty. Perhaps millions more would have been if China had continued with the policies of the Gang of Four/Mao or whoever. Perhaps this would have instead resulted in millions of more deaths.\n\nThe question: how should we go about comparing what actually occurred to what could have occurred if certain policies or social structures had been different?\n\nIm less interested in this particular example (China), and more interested in the 2nd order question - how should we go about comparing these things. What methods should we use?\n\nIm very interested in reading recommendations also.",
        "created_utc": 1538109130,
        "upvote_ratio": ""
    },
    {
        "title": "Ethnic Group with \"no culture\"?",
        "author": "obsama1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jj5i1/ethnic_group_with_no_culture/",
        "text": "I remember reading a TIL a while back about some ethnic group that supposedly had, in a very literal sense, \"no culture\" and was considered even by anthropologists to be \"boring.\" Totally forgot the name of it, but if anybody knows what they're called, I'd appreciate it!",
        "created_utc": 1538101918,
        "upvote_ratio": ""
    },
    {
        "title": "Do dreams regarding PTSD have to be related to the trauma, or will any nightmare (even though not related) do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jj0h8/do_dreams_regarding_ptsd_have_to_be_related_to/",
        "text": "[deleted]",
        "created_utc": 1538100702,
        "upvote_ratio": ""
    },
    {
        "title": "Do African-American children who don't adopt black \"ghetto\" cultural values have better test scores?",
        "author": "BlackSiliconValley",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jg0do/do_africanamerican_children_who_dont_adopt_black/",
        "text": "[removed]",
        "created_utc": 1538077280,
        "upvote_ratio": ""
    },
    {
        "title": "Any social science researchers using drone-based imagery (remote sensing) in the field?",
        "author": "akeeton25",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jefft/any_social_science_researchers_using_dronebased/",
        "text": "[removed]",
        "created_utc": 1538066288,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any studies/statistics on domestic violence and if there is an increased risk if the woman is a housewife versus if she was a working woman?",
        "author": "BradBrady",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9jef88/is_there_any_studiesstatistics_on_domestic/",
        "text": "Basically what I’m asking is there any thing that shows a “more likely”\n\nLike evidence that shows “a woman who is a housewife is more likely to be abused by her husband versus if she was a working woman” \n\nOr vice versa.\n\nThank you!!",
        "created_utc": 1538066248,
        "upvote_ratio": ""
    },
    {
        "title": "Why are rural areas of the U.S more likely to be conservative and urban areas more liberal?",
        "author": "MrSecretpolice",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9je59n/why_are_rural_areas_of_the_us_more_likely_to_be/",
        "text": "",
        "created_utc": 1538064265,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | September 26, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9j2soa/theory_wednesday_september_26_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1537970771,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone ever tried studying why the French are so tolerant of adultery?",
        "author": "Apiperofhades",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ixtwv/has_anyone_ever_tried_studying_why_the_french_are/",
        "text": "http://www.pewresearch.org/fact-tank/2014/01/14/french-more-accepting-of-infidelity-than-people-in-other-countries/\n\nI’ve known about this for a while. I’ve talked to my French friends about it. Has anyone tried studying why this is the case? ",
        "created_utc": 1537923087,
        "upvote_ratio": ""
    },
    {
        "title": "Why are the Abrahamic Religions considered different religions even if they have the same prophet?",
        "author": "Poes_Ting",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ix827/why_are_the_abrahamic_religions_considered/",
        "text": "Why are Judaism and Christianity considered different religions even though they worship the same god? Why are Mormons sometimes not considered Christian? What about Islam?",
        "created_utc": 1537918070,
        "upvote_ratio": ""
    },
    {
        "title": "Can sociopaths be rehabilitated?",
        "author": "Mjjjokes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9iwsqo/can_sociopaths_be_rehabilitated/",
        "text": "",
        "created_utc": 1537914718,
        "upvote_ratio": ""
    },
    {
        "title": "Request: Introductory reading material on art and social identity.",
        "author": "Extra_Ears",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ithgw/request_introductory_reading_material_on_art_and/",
        "text": "Hi,\n\nI'm looking for introductory reading material that discusses how art influences culture and thereby influences how individuals construct the social identities which they act out. I need some introductory material to reference and to further my understanding of the mechanisms at play.\n\n&amp;#x200B;\n\nSorry If I've not been clear in my request, I've not studied sociology before so I may be confusing concepts, I'm happy to clarify if needs be.\n\n&amp;#x200B;\n\nThanks.",
        "created_utc": 1537891830,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people bully other people on Reddit?",
        "author": "PenguinPigeonHybrid",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ispnu/why_do_people_bully_other_people_on_reddit/",
        "text": "[removed]",
        "created_utc": 1537886497,
        "upvote_ratio": ""
    },
    {
        "title": "Question while reading Foucault",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ippx9/question_while_reading_foucault/",
        "text": "I'm reading Discipline and Punish on my own free time, outside of any academic institutions. I'm trying to make clear my conception of what Foucault thinks of\n\nThe body\nVS\nThe soul\n\nHe seems to argue that punishment has moved from the body to the soul, which I usually take to be the mind, be he argues that the soul is different from the religious conception of the soul and is more of the result of power relations, but what does that really mean? Is he just talking about how psychology and the criminal justice system and sociology define norms and what deviates from these norms?\n\nHow does lack of liability due to madness differ from simply deviating?\n\nWhat does Foucault mean by the body? Some of his first arguments are about the body being very physical but then he talks about the body in relationship between knowledge and political economy, but my intuition is to think of that as a matter of the soul not the body. How does he differentiate this? How can a corporeal body be knowledge?",
        "created_utc": 1537856183,
        "upvote_ratio": ""
    },
    {
        "title": "What parts of the US fit the following criteria OR somewhat close to: population 2 million, 20% of total population in poverty?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ilyi3/what_parts_of_the_us_fit_the_following_criteria/",
        "text": "[deleted]",
        "created_utc": 1537823852,
        "upvote_ratio": ""
    },
    {
        "title": "What's a metric for assessing similarity or differentness between EEG recordings?",
        "author": "popeldo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ikvze/whats_a_metric_for_assessing_similarity_or/",
        "text": "[removed]",
        "created_utc": 1537816488,
        "upvote_ratio": ""
    },
    {
        "title": "Any interesting currency crises?",
        "author": "freekydeekyshit420",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ijgxz/any_interesting_currency_crises/",
        "text": "I need to do a project on a major currency crisis from before 2008. Any that you think are interesting that I should consider?",
        "created_utc": 1537806954,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | September 24, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ii6ze/monday_reading_and_research_september_24_2018/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1537797933,
        "upvote_ratio": ""
    },
    {
        "title": "A psychologist suggests that we can’t think very much about the future because we are tied to the hear and now. How accurate does this sound?",
        "author": "bluesilver1234",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9idag2/a_psychologist_suggests_that_we_cant_think_very/",
        "text": "(Typo in title I phone autocorrected)\n\nThe study done by Elinor Amit and collegues suggests that when ppl think about the future they tend to use language to think abstractly rather than imagery.. BUT states that in a new study it’s almost always the case of intruding visual imagery when deliberately trying to think in language that occurs which in turn means we can’t think very much into the future because visual thinking according to Amit and another study is tied to thinking of the head and now.. or very near future.\n\nI read this off of this article. Anyone have counter evidence suggesting we can think far out? \n\nEverything below is taken from the article \n\nvvv                     \n\nGoing forward, Amit said, the study poses intriguing questions about whether humans must be tied to the here and now.\n\nIn earlier research, Amit and colleagues found that people tend to think visually about things that are close to them (temporally, socially, or geographically), but use inner speech when contemplating far-off things.\n\n“So if you think about Harvard Square versus San Francisco, you’re probably visualizing the former, but thinking verbally about the latter,” Amit said. “The same goes for whether you think about yourself or someone else, or in-group versus outgroup, or tomorrow versus 10 years from now.”\n\nHer new study, however, finds that even when people consciously attempt to think verbally, visual thinking nearly always intrudes, suggesting that people are grounded in the present even when they try to use a mode of thinking typically reserved for the future.\n\n“This suggests that we can’t really go beyond the here and now and think in abstract ways about other people, places, or times,” Amit said. “This is the way our brains are wired, and there may be an evolutionary reason for this [because] we haven’t always been verbalizers. For a long time, we understood our world visually, so maybe language is an add-on.\n\n“That has important implications because if we are truly grounded in the here and now, what does that mean about how we develop public policy?” she added. “Do we need to help people overcome their bias to focusing on the here and now? This is something we may need to be aware of.”\n\nhttps://news.harvard.edu/gazette/story/2017/05/visual-images-often-intrude-on-verbal-thinking-study-says/",
        "created_utc": 1537747680,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone made a contemporary look at mental health from a \"pro\"-Confucian perspective?",
        "author": "xunkuang",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9icn9s/has_anyone_made_a_contemporary_look_at_mental/",
        "text": "I'm wondering if there is an approach to psychology that could be called Confucian, and what influence Confucianism could have in dealing with mental illness and mental health in general.\n\nFor example, how exactly does harmony, moral-self cultivation, thinking more in terms of relationships than the self, and such, help one deal with mental illness, or at least develop into a more healthy individual.",
        "created_utc": 1537742275,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to remove Supreme Court Justices?",
        "author": "sbands1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ibaqh/is_there_a_way_to_remove_supreme_court_justices/",
        "text": "In the U.S. at least, Supreme Court justices are appointed for “life.” Is there a Constitutional or otherwise legal way to remove them? Something similar to impeachment, assuming it’s proven that they’ve done something highly illegal or unconstitutional. ",
        "created_utc": 1537732115,
        "upvote_ratio": ""
    },
    {
        "title": "Causes for population decline/growth?",
        "author": "outrageously_smart",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9iavex/causes_for_population_declinegrowth/",
        "text": "Hello everyone,\nI'm doing research on population development and while I'm familiar with most common determinants, I'm having trouble coming up with scientific sources. Can r/asksocialscience help me out?",
        "created_utc": 1537729027,
        "upvote_ratio": ""
    },
    {
        "title": "What is your opinion (and are there any studies) on the possibility that educated people with a high level of awareness are less wealthy than the majority of the citizens?",
        "author": "lollercoastermtl",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9i2ujs/what_is_your_opinion_and_are_there_any_studies_on/",
        "text": "",
        "created_utc": 1537648486,
        "upvote_ratio": ""
    },
    {
        "title": "Why do people troll other people on Reddit for fun?",
        "author": "PenguinPigeonHybrid",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9huph9/why_do_people_troll_other_people_on_reddit_for_fun/",
        "text": "",
        "created_utc": 1537569085,
        "upvote_ratio": ""
    },
    {
        "title": "Articles raising some issues.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9huond/articles_raising_some_issues/",
        "text": "[removed]",
        "created_utc": 1537568919,
        "upvote_ratio": ""
    },
    {
        "title": "How significant for the study of social sciences would be the reunification or opening of North Korea?",
        "author": "RiseofBubblez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hslyo/how_significant_for_the_study_of_social_sciences/",
        "text": "[removed]",
        "created_utc": 1537553646,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | September 21, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hq83a/friday_freeforall_september_21_2018/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1537538746,
        "upvote_ratio": ""
    },
    {
        "title": "ATLAS.ti 6.2 file corruption fiasco",
        "author": "revolting_techdeath",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hm2ym/atlasti_62_file_corruption_fiasco/",
        "text": "Hey, I was wondering if anyone can help me with a weird issue i'm facing while accessing primary docs that I had already coded on ATLAS.ti. Apparently the primary docs had been altered outside of ATLAS.ti and as a result the software is not accepting them back/letting me access them. However, the files were in no way altered as such. Support team says they can't help me because i'm running an old version. If anyone has any tricks or tips i can try to restore my coded files, please help. I've lost 22 files this way and that's a lot of work lost :/ TIA",
        "created_utc": 1537503358,
        "upvote_ratio": ""
    },
    {
        "title": "What 1s cr1t1cal analys1s?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hl7ys/what_1s_cr1t1cal_analys1s/",
        "text": "[removed]",
        "created_utc": 1537495579,
        "upvote_ratio": ""
    },
    {
        "title": "It seems like most economists oppose rent control, and yet many governments around the world have rent control or offer to allow enacting them (Prop 10 in California now for example). Should we follow the economic consensus and oppose these rent control initiatives?",
        "author": "Moontouch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hl2f6/it_seems_like_most_economists_oppose_rent_control/",
        "text": "",
        "created_utc": 1537494239,
        "upvote_ratio": ""
    },
    {
        "title": "It seems like most economists oppose rent control, and yet many governments around the world have rent control or offer to enact them through a democratic vote (Prop 10 in California now for example). Should we follow the economic consensus and oppose these initiatives?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hl1mi/it_seems_like_most_economists_oppose_rent_control/",
        "text": "[deleted]",
        "created_utc": 1537494058,
        "upvote_ratio": ""
    },
    {
        "title": "Best instrument to collect address data from people?",
        "author": "Halostar",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hhxcw/best_instrument_to_collect_address_data_from/",
        "text": "Hi everyone.\n\n&amp;#x200B;\n\nI'm doing some work for a large organization that is looking to map out all of their community volunteering that they are doing/have done in the recent past. Right now, the coordinator of the initiative is just sending out excel template sheets with questions like:\n\n* hours spent\n* organization partnered with\n* addresss of partnering org\n\netc.\n\nThe spreadsheets they are receiving in response are horrible and it's going to take hours upon hours of data cleaning. I'd like to streamline this process better.\n\nI looked into Google Forms to see if they had a question type that asked for an address (this is the biggest issue) but I didn't see one. Other things like numerical validation can be done with Google Forms or Qualtrics (which we have access to), but neither ask about addresses specifically and can validate addresses. On the other hand, some departments are submitting as many as 20 points and it would be really tough to expect them to fill out that many forms at once, so the Excel spreadsheet is nice in that way.\n\n&amp;#x200B;\n\nAny advice on this? Any other subreddits that might be helpful to ask?\n\n&amp;#x200B;",
        "created_utc": 1537469887,
        "upvote_ratio": ""
    },
    {
        "title": "is cellphone usage addiction going to truly harm us one day?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hcjrg/is_cellphone_usage_addiction_going_to_truly_harm/",
        "text": "[removed]",
        "created_utc": 1537420616,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for literature reccommendations on types of propaganda and how they work",
        "author": "Pleonastic",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9hav4q/looking_for_literature_reccommendations_on_types/",
        "text": "Hi social scientists!\n\n&amp;#x200B;\n\nI'm writing a thesis regarding an anti-vaccine movement in my country. In the group description, they state clearly that they do not accept members with differing view; they will not accept critique; any content that can be considered not-anti vaccine is not allowed and violations of the above-mentioned will lead to having the post/comment/reply deleted and, not uncommonly, the user banned.\n\n&amp;#x200B;\n\nIn addition to this, they will question facebook users that wish to join the group, in order to make sure that potential members support the cause. In other words, the group is closed to the public and memberships must be approved by an administrator.\n\n&amp;#x200B;\n\nBased on my current findings, their approach within the field is, so far as I understand the term, propaganda. I am, however, not aware of the various ways in which propaganda is used and takes form.\n\n&amp;#x200B;\n\nI would be very grateful for any reading reccommendatioins, especially if they are from well established sources. And in particular if these sources are available online. \n\nThat said, I *am* grateful that you've taken the time to read this!",
        "created_utc": 1537405272,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any negatives to having a high IQ score?",
        "author": "Mattcwu",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9ha2mr/are_there_any_negatives_to_having_a_high_iq_score/",
        "text": "Two points of clarification.  \nI realize this is a subjective question. But, anything that is data-driven that you view as negative is fine with me.  \n\nAlso, please note the first rule of this sub,   \n\n&gt;1. All claims in top level comments must be supported by citations to relevant social science sources. No lay speculation.",
        "created_utc": 1537398778,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be a good idea to create a platform like Kaggle for increasing public involvement in Local Governance?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9h9sm1/would_it_be_a_good_idea_to_create_a_platform_like/",
        "text": "[removed]",
        "created_utc": 1537396573,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best book to read for Pierre Bourdieu when first getting introduced to him and his work?",
        "author": "867-Jenny-5309",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9h8mnw/what_is_the_best_book_to_read_for_pierre_bourdieu/",
        "text": "",
        "created_utc": 1537388068,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | September 19, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9h5fxt/theory_wednesday_september_19_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1537365991,
        "upvote_ratio": ""
    },
    {
        "title": "Is narcissism a biological trait, byproduct of our modern society, political system?",
        "author": "cartmichael",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9h1csr/is_narcissism_a_biological_trait_byproduct_of_our/",
        "text": "",
        "created_utc": 1537324755,
        "upvote_ratio": ""
    },
    {
        "title": "How could the US government regulate the housing market?",
        "author": "BowserTattoo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gzx9d/how_could_the_us_government_regulate_the_housing/",
        "text": "Everyone argues that the housing market Should Not be regulated. But, if we take for granted, at least hypothetically, that we need significant regulation of housing in order to ensure everybody can afford housing in the place they work and live, (with less emphasis on protecting the capital of landowners, but still without facilitating economic collapse), what are some possible or proposed ideas for practical regulation? Whether this is from the perspective of the USA, the state, city, or county level, or another nation entirely (so long as it’s in the same neoliberal capitalist environment, like where I live), is unimportant.",
        "created_utc": 1537313116,
        "upvote_ratio": ""
    },
    {
        "title": "What name should be given to the first two decades of the 2000s?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gzrh4/what_name_should_be_given_to_the_first_two/",
        "text": "[deleted]",
        "created_utc": 1537311916,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best proven policy pathways to increase social mobility at a local level?",
        "author": "mariquitis",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gysty/what_are_the_best_proven_policy_pathways_to/",
        "text": "What policies that can be implemented by local governments have immediate and direct consequences on social mobility? Is education a better mechanism than access to public health, or maybe increased security in impoverished neighborhoods leads to more small entrepreneurship and thus less inequality?",
        "created_utc": 1537304868,
        "upvote_ratio": ""
    },
    {
        "title": "Are there clues that autobiographic memory is correlated with history knowledge?",
        "author": "sku-sku",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gvmnr/are_there_clues_that_autobiographic_memory_is/",
        "text": "I'm kind of assuming that there is some kind of 'Chronological intelligence' or 'Temporal intelligence'. Is there such a thing?",
        "created_utc": 1537283185,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | September 17, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gkl53/monday_reading_and_research_september_17_2018/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1537193138,
        "upvote_ratio": ""
    },
    {
        "title": "About \"Winners Take All\" How a big difference in reward, of the order of a factor of 10 to 20, is justified between the first and the second in any sort of a competition.",
        "author": "fays_unKle",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gjcak/about_winners_take_all_how_a_big_difference_in/",
        "text": "[removed]",
        "created_utc": 1537182178,
        "upvote_ratio": ""
    },
    {
        "title": "Coding different groups of participants",
        "author": "SneakyNightman",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9giwa9/coding_different_groups_of_participants/",
        "text": "Hi everyone,\n\n&amp;#x200B;\n\nSo I probably have a super basic question. I'm new to qualitative research and I'm just about ready to do my coding. I'm doing a realist evaluation of an intervention for which I have interviewed three different groups of participants, namely: practitioners, external practitioners and clients. I'm using Nvivo to do my coding, should I code all participants in the same file or should I use multiple files for the different groups and compare afterwards?\n\n&amp;#x200B;\n\nCheers,  \nSteven",
        "created_utc": 1537177295,
        "upvote_ratio": ""
    },
    {
        "title": "\"The welfare state of the 21st century\" - Macron| Are there detailed reports on these reforms?",
        "author": "oldandgreat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9giifa/the_welfare_state_of_the_21st_century_macron_are/",
        "text": "Macron plans to reform the *revenu solidarité active* (current welfare payment in France) to a modern *revenu universel d’activité*, universal basic income with an activity clause (as far as I understood it). But even here I might have a shallow understanding.\n\nEven french reports on this proposal/s are welcome, as is literature on the welfare state in France. I only recently began to dive into the history and system of welfare states, this seems to be a new turning point in its development.",
        "created_utc": 1537172431,
        "upvote_ratio": ""
    },
    {
        "title": "How are export processing zones set up?",
        "author": "armsraisedhigh",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gg551/how_are_export_processing_zones_set_up/",
        "text": "Hi everybody! I hope this is the right place to ask this question.\n\nI know export processing zones are defined as \"areas within developing countries that offer incentives and a barrier-free environment to promote economic growth by attracting foreign investment for export-oriented production.\" But how are they actually set up?\n\n&amp;#x200B;\n\nAre certain sections of a country designated as EPZs and then those zones are solely comprised of factories/manufacturing centers?\n\n&amp;#x200B;\n\nOr are they more seamlessly mixed in near residential areas and are simply designated as EPZs because there are more factories/manufacturing centers than in other areas of the country?\n\n&amp;#x200B;\n\nOr is it something else?\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1537148170,
        "upvote_ratio": ""
    },
    {
        "title": "How attitudes towards same-sex couples may influence emotional appraisals of affectionate behaviour (males &amp; females 18-65 years).",
        "author": "kellysofia",
        "url": "https://www.reddit.com/r/SampleSize/comments/9gg0s6/academic_how_attitudes_towards_samesex_couples/",
        "text": "",
        "created_utc": 1537147844,
        "upvote_ratio": ""
    },
    {
        "title": "Are you born with empathy or is it learned?",
        "author": "Pitchylee",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gez94/are_you_born_with_empathy_or_is_it_learned/",
        "text": "",
        "created_utc": 1537138249,
        "upvote_ratio": ""
    },
    {
        "title": "What would you classify this type of person as based on these attributes?",
        "author": "-FunnyHow-",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gec53/what_would_you_classify_this_type_of_person_as/",
        "text": "[removed]",
        "created_utc": 1537133153,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a correlation between wealth/ income / social status and morality?",
        "author": "Chalupa_Bigote",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gd7k7/is_there_a_correlation_between_wealth_income/",
        "text": "Any studies are welcome. Thank you ",
        "created_utc": 1537124939,
        "upvote_ratio": ""
    },
    {
        "title": "Curious on human condition and group mentality when in crisis.",
        "author": "ElderChiroptera",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9gbu6h/curious_on_human_condition_and_group_mentality/",
        "text": "I'm curious as to what happens in riots, chaos, hysteria, etc. sociologically. Using the example of the L.A. riots, what happened and why did people do what they did? How long would things have gone on if the government hasn't stepped in and stopped them?",
        "created_utc": 1537115029,
        "upvote_ratio": ""
    },
    {
        "title": "On the US Census website, why do the FactFinder and QuickFacts sections list different results for the same statistics?",
        "author": "PablomentFanquedelic",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9g83ar/on_the_us_census_website_why_do_the_factfinder/",
        "text": "",
        "created_utc": 1537073832,
        "upvote_ratio": ""
    },
    {
        "title": "Approximately when did the \"OK\" hand symbol start being used to represent white supremacy?",
        "author": "Mattcwu",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9g5y59/approximately_when_did_the_ok_hand_symbol_start/",
        "text": "[ABC News covered this story recently](https://www.nbcnews.com/news/us-news/coast-guard-member-flashes-white-power-hand-signal-tv-n909856) where the OK hand symbol was being used to represent white supremacy. I have my opinions on it, but it's hard to find many facts on this. I don't think the OK hand symbol was *always* used to represent white supremacy, so when did it start? Is is strictly trolling and have never represented anything racist? Are there examples of actual racist groups using it besides this one? Is this the first time?",
        "created_utc": 1537053670,
        "upvote_ratio": ""
    },
    {
        "title": "What are the predictors of the way people will speak in the future? What are the trends?",
        "author": "MonoWill2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9g4kct/what_are_the_predictors_of_the_way_people_will/",
        "text": "(I asked a question of how you speculate people will talk in fifty years, but speculative answers are not allowed and it was removed. So, I have reworded the question to be about things that are more scientific and measurable, and I still just wanted to have this question out there)",
        "created_utc": 1537042348,
        "upvote_ratio": ""
    },
    {
        "title": "How do you predict the different manner in which people will talk, 50 years from now?",
        "author": "MonoWill2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9g3o5z/how_do_you_predict_the_different_manner_in_which/",
        "text": "[removed]",
        "created_utc": 1537035459,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a complete list and explanation of consumer behavior / psychology factors like priming and anchoring?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9g0xk7/is_there_a_complete_list_and_explanation_of/",
        "text": "[deleted]",
        "created_utc": 1537012793,
        "upvote_ratio": ""
    },
    {
        "title": "Sociological Interview",
        "author": "sameerski32",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fy8yy/sociological_interview/",
        "text": "Looking for someone with expertise and knowledge who would not mind doing a small interview for a school research paper in regards to prison population growth",
        "created_utc": 1536980405,
        "upvote_ratio": ""
    },
    {
        "title": "Toxicity in online gaming: Are people more upset when it's versus a player than an AI?",
        "author": "BlueSky1877",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fxibv/toxicity_in_online_gaming_are_people_more_upset/",
        "text": "Anecdotally, I've noticed in cooperative group video games, people seem to be more upset about a loss when it's against another team of people than another team of AI or bots. Even I feel worse when it sinks in that I lost to a person than losing to thousands of lines of computer code.\n\nAny idea why we feel more upset to a loss to a person than a program?\n\nOr studies where people played against a computer and lost, but the computer was actually people?",
        "created_utc": 1536973384,
        "upvote_ratio": ""
    },
    {
        "title": "How much does behavioral intention predict actual behavior?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fxfjf/how_much_does_behavioral_intention_predict_actual/",
        "text": "[deleted]",
        "created_utc": 1536972627,
        "upvote_ratio": ""
    },
    {
        "title": "In Africa, ethnic and national boundaries generally don't overlap. Millions of words have been written about ethnic divisions within African countries, but what kind of ethnic solidarity exists ACROSS African countries?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fxe1a/in_africa_ethnic_and_national_boundaries/",
        "text": "Are Yoruba, Hausa, Somali, etc meaningful ethnic affinities in a trans-national context? To what extent does a Fula community in Nigeria identify with or even resemble another Fula community hundreds of miles away in Senegal? Does international ethnic solidarity, or the fear of this solidarity, play any significant role in national or international African politics?",
        "created_utc": 1536972234,
        "upvote_ratio": ""
    },
    {
        "title": "Novel Research!!!",
        "author": "ElderChiroptera",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fwkgq/novel_research/",
        "text": "[removed]",
        "created_utc": 1536964961,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly do Think Tanks produce?",
        "author": "ezspie",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fw7sx/what_exactly_do_think_tanks_produce/",
        "text": "[removed]",
        "created_utc": 1536962108,
        "upvote_ratio": ""
    },
    {
        "title": "Does an increase in minimum wage lead to 'transfer' of workers from smaller to larger Enterprises? Is there any change in distribution of workers based on Enterprise size?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fw2k2/does_an_increase_in_minimum_wage_lead_to_transfer/",
        "text": "",
        "created_utc": 1536960961,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | September 14, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9fs9x6/friday_freeforall_september_14_2018/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1536933948,
        "upvote_ratio": ""
    },
    {
        "title": "With social and political issues being emotionally debated on the internet, what kind of armchair social scientists annoy you the most?",
        "author": "outrageously_smart",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/9frr4d/with_social_and_political_issues_being/",
        "text": "[removed]",
        "created_utc": 1536929714,
        "upvote_ratio": ""
    }
]