[
    {
        "title": "What is collective consciousness?",
        "author": "absolute-trash",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xj89f/what_is_collective_consciousness/",
        "text": "I have a general idea but I don't know a lot of the details. Is it something that happens all the time or for short periods?",
        "created_utc": 1488662547,
        "upvote_ratio": ""
    },
    {
        "title": "What effect does investment in elite sport have on public health?",
        "author": "yoosanaim",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xiqip/what_effect_does_investment_in_elite_sport_have/",
        "text": "In the lead up to the London Olympics, it was repeatedly stated that investment in facilities and patience with disruption would be rewarded with improved health in the general population and a new generation of top tier athletes. At the time, I heard experts on the radio say that there is no evidence that public health is helped by the Olympics but it seems the UK punched above it's weight at Rio, at least.  \nDo we know if 2012 improved Londoners' health? Is there a more general evidence of health benefit in the UK or elsewhere?",
        "created_utc": 1488656799,
        "upvote_ratio": ""
    },
    {
        "title": "Is The_Donald an example of a Cult of Personality?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xi5c7/is_the_donald_an_example_of_a_cult_of_personality/",
        "text": "[removed]",
        "created_utc": 1488650365,
        "upvote_ratio": ""
    },
    {
        "title": "Applying for Auditing/analysts jobs at a large company....any tips on what I should know to impress someone? Any good links to help with this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xhkx1/applying_for_auditinganalysts_jobs_at_a_large/",
        "text": "[removed]",
        "created_utc": 1488643905,
        "upvote_ratio": ""
    },
    {
        "title": "What does one generation of kids getting abused seem to usually cause to happen to the next generation and the next few generations?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xfc0u/what_does_one_generation_of_kids_getting_abused/",
        "text": "[deleted]",
        "created_utc": 1488603786,
        "upvote_ratio": ""
    },
    {
        "title": "Where is the failure in the claim that society in Africa is what blacks achieve when left to their own devices?",
        "author": "MyAnusYourAdventure",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xfb1e/where_is_the_failure_in_the_claim_that_society_in/",
        "text": "They contrast this with american society, which is predominately white because it's a white founded, cultured &amp; civilized nation. This is where white nationalists say it must be protected from such decay.",
        "created_utc": 1488603375,
        "upvote_ratio": ""
    },
    {
        "title": "Why are social psychologists and psychologists likely to discriminate against someone based on their political beliefs?",
        "author": "PM_ME_FREE_FOOD",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xeika/why_are_social_psychologists_and_psychologists/",
        "text": "From [this](http://yoelinbar.net/papers/political_diversity.pdf) paper\n\n&gt;\"A lack of political diversity in psychology is said to lead to a number of pernicious outcomes, including biased research\nand active discrimination against conservatives. The authors of this study surveyed a large number (combined N = 800) of\nsocial and personality psychologists and discovered several interesting facts. First, although only 6% described themselves\nas conservative “overall,” there was more diversity of political opinion on economic issues and foreign policy. Second,\nrespondents significantly underestimated the proportion of conservatives among their colleagues. Third, conservatives fear\nnegative consequences of revealing their political beliefs to their colleagues. Finally, they are right to do so: In decisions\nranging from paper reviews to hiring, many social and personality psychologists said that they would discriminate against\nopenly conservative colleagues. One in six respondents said that she or he would\nbe somewhat (or more) inclined to discriminate against conservatives\nin inviting them for symposia or reviewing their work. One in four would discriminate in reviewing their grant\napplications. More than one in three (37.5%) would discriminate\nagainst them when making hiring decisions. The more liberal respondents were, the more they said they would discriminate.\" ",
        "created_utc": 1488592182,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | March 03, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5xahg4/friday_freeforall_march_03_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1488549768,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a \"normal course\" of political/economical change in a country after a revolution?",
        "author": "awantagy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x9416/is_there_a_normal_course_of_politicaleconomical/",
        "text": "a while back I read a facebook post saying that the profile owner read an article detailing the events after revolutions overthrowing military dictatorships. \n\nIt said that anarchists are the first to take control, followed by a dictator that will ruin the economy, then a leader that takes interest in human right (but won't do much to the economy) and then finally a leader that will propel the economic situation ahead. I live in Egypt and it seams that we already had the first 2.\n\nIs that analysis correct? Is there a normal course? sadly I can't remember where I read that post and can't reach the profile owner",
        "created_utc": 1488526699,
        "upvote_ratio": ""
    },
    {
        "title": "will the major \"modern\" religions (abrahamic esp) eventually die out and be replaced with new major religions led by new prophets?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x7ty1/will_the_major_modern_religions_abrahamic_esp/",
        "text": "[deleted]",
        "created_utc": 1488508990,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a study I read at one point",
        "author": "freeatlastforforever",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x69zj/looking_for_a_study_i_read_at_one_point/",
        "text": "There is an academic study that read at some point that I am unable to find again. In the study they provided groups of students with a large database of music. The music that became popular in each group was random. The researchers determined that once a certain level of quality was reached that the music that became popular was random/based on social fads of peers.\n\nCan anyone point me in the right direction?",
        "created_utc": 1488491815,
        "upvote_ratio": ""
    },
    {
        "title": "Connections between marijuana reform and non-marijuana drug addiction?",
        "author": "Synyster1337",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x4l5m/connections_between_marijuana_reform_and/",
        "text": "Hello all, senior Political Science student here. I'm taking senior capstone this semester for Political Science, and I'm looking for a topic for my term paper. I'm thinking, as indicated by the title, about studying the effects that marijuana reform has on hard drug addiction.\n\nI live in West Virginia, and we have a massive opiate addiction crisis on our hands. We are also experiencing critical budgetary problems at the state level. I suspect that marijuana reform (similar to Amendment 64 in Colorado in the sense that it creates an industry as opposed to just decriminlization) would be a source of relief to the state budget, but I am concerned with any negative implications it could have on our opiate addiction crisis, which brings me to my questions:\n\n1) Are there any good studies that anyone would recommend? I don't have access to the best databases at my university, so I'm at a disadvantage when it comes to narrowing the scope of my research. \n\n2) Are there any other ideas you all have about drug policy? I've also been considering writing about mandatory minimums, I'm just having a hard time coming up with a concise thesis to research. ",
        "created_utc": 1488475864,
        "upvote_ratio": ""
    },
    {
        "title": "which political theory provides a better answer?",
        "author": "daisy20167",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x33f9/which_political_theory_provides_a_better_answer/",
        "text": "[removed]",
        "created_utc": 1488460114,
        "upvote_ratio": ""
    },
    {
        "title": "Where does the pressure to succeed come from and where is it most dominate, prevalent?",
        "author": "Screamingmoon",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x2ovl/where_does_the_pressure_to_succeed_come_from_and/",
        "text": "[removed]",
        "created_utc": 1488453864,
        "upvote_ratio": ""
    },
    {
        "title": "Do US Senator's votes on average better represent state interests or the interests of a state's population",
        "author": "Mentalpopcorn",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x11ak/do_us_senators_votes_on_average_better_represent/",
        "text": "By \"state interests\" I mean as expressed by state government, and by a population's interests I mean the sum of democratic opinion.\n\nPut another way, is a state government's desired policy outcome a better or worse predictor of a Senator's vote than a population's desired policy outcome?\n\n",
        "created_utc": 1488427178,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the theories as to why the crime rate drastically rose in the 1960s?",
        "author": "333th",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x0hne/what_are_some_of_the_theories_as_to_why_the_crime/",
        "text": "If you look at [this chart](http://c1.nrostatic.com/sites/default/files/Huffpost%20charts%202.png), you can see the crime rate clearly spiked during the sixties and continued for quite some time.\n\nOne of my professors claimed that this is because the baby boomers became teenagers around the mid sixties and with teenagers being the ones most likely to participate in crime, the rise in crime was natural.\n\nI've also read that many blame the rise on crime on the Warren Court with Supreme Court cases like *Mapp v. Ohio* (1961), *Escobedo v. Illinois* (1964) and *Miranda v. Arizona* (1966) as they were seen as \"letting criminals run free.\"\n\nAre there any thoughts on this, any data, or anything on this matter? I'm curious what other suggestions are out there.",
        "created_utc": 1488420712,
        "upvote_ratio": ""
    },
    {
        "title": "I'm doing a content analysis using Chomsky and Herman's Propaganda Model to analyze Fox News' \"The O'Reilly Factor\"",
        "author": "C_A_Throwaway1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5x070f/im_doing_a_content_analysis_using_chomsky_and/",
        "text": "[removed]",
        "created_utc": 1488417284,
        "upvote_ratio": ""
    },
    {
        "title": "It seems to me that traits and world views that often correlate with political progressiveness make one unhappy in a hierarchy and vice versa for political conservatives, leading to the institutional struggles of progressives and vice versa. Is there a name for this idea/has it been studied?",
        "author": "82364",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wzmqz/it_seems_to_me_that_traits_and_world_views_that/",
        "text": "Let me know if that needs clarification - hit the character limit.",
        "created_utc": 1488411242,
        "upvote_ratio": ""
    },
    {
        "title": "What research on group projects in education (specifically highschool and college) has been done?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wyf68/what_research_on_group_projects_in_education/",
        "text": "[deleted]",
        "created_utc": 1488399370,
        "upvote_ratio": ""
    },
    {
        "title": "water heater",
        "author": "eixan",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wy6jr/water_heater/",
        "text": "[removed]",
        "created_utc": 1488397104,
        "upvote_ratio": ""
    },
    {
        "title": "Why do Jewish people end up as a target during times of unrest, given their relatively small numbers?",
        "author": "lodunali",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wxfpq/why_do_jewish_people_end_up_as_a_target_during/",
        "text": "It seems like Jewish people are always a big target when there is unrest around the world, including the recent reports of anti-Semitic violence/hate crimes.  Is there any good information on why they tend to be a target in times of uncertainty?\n\n[One Source](https://www.bloomberg.com/politics/articles/2017-02-24/nypd-links-hate-crimes-increase-to-2016-presidential-campaign) (Not sure how verified it is though)",
        "created_utc": 1488390155,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | March 01, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wvz0y/theory_wednesday_march_01_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1488376994,
        "upvote_ratio": ""
    },
    {
        "title": "To what degree is violence accepted by various political ideologies, and how is this changing in recent years?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wuaf5/to_what_degree_is_violence_accepted_by_various/",
        "text": "To what degree is violence accepted by various political ideologies, and how is this changing in recent years? \n\nAlso, how effective is violence at effecting political change?\n",
        "created_utc": 1488356224,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Social Construction of Sexuality",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wr68o/eli5_social_construction_of_sexuality/",
        "text": "[deleted]",
        "created_utc": 1488323187,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the need for cognition so prominent?",
        "author": "TheyAllLikeCarmen",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wquqe/why_is_the_need_for_cognition_so_prominent/",
        "text": "I am trying to research \"curiosity\" in the vaguest way possible (although I think I want to tie it back to experts in their respective fields of study) and it looks like the only measure is a need for cognition. Are there any studies or scientific articles that talk about curiosity being measured in a different way?",
        "created_utc": 1488320511,
        "upvote_ratio": ""
    },
    {
        "title": "What are the best works of political theory and philosophy?",
        "author": "MartinusBracarensis",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wq0t0/what_are_the_best_works_of_political_theory_and/",
        "text": "This is a purely opinion based question, I'm just curious!\n\n\nHere's a list if mine, in no meaningful order \n\n\n\n\n\nCarl Schmitt, *The Crisis of Parliamentary Democracy* and *Political Theology* \n\nGaetano Mosca *The Rulling Class*\n\n\nKonstantin Pobedonostsev *Reflections of a Russian Statesman*\n\n\nOswald Spengler *Prussianism and Socialism*\n\n\nBackground, I'm a student of History with a particular interest in Russia. I read Pobedonostsev to get a better understanding of Russian statesmanship. I saw a lot of mirror images of the inner workings of the Imperial Russian state to the what I knew about the inner workings of the Kingdom of Prussia and my interest in conservative Prussian politics led me to Schmitt and Spengler.",
        "created_utc": 1488311213,
        "upvote_ratio": ""
    },
    {
        "title": "What is the difference between Social Liberalism and Social Democracy?",
        "author": "PeppyHare66",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wpmew/what_is_the_difference_between_social_liberalism/",
        "text": "The best I can tell, they each pursue social and economic equality within the framework of a market economy. What exactly is the distinction?",
        "created_utc": 1488305980,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any disadvantages to relying solely on pigouvian taxation to deal with systemic risk?",
        "author": "neoliberalQuestions",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wp34b/are_there_any_disadvantages_to_relying_solely_on/",
        "text": "Recently read [this old article](https://www.bloomberg.com/view/articles/2014-08-27/lending-club-can-be-a-better-bank-than-the-banks) from Matt Levine talking about Lending Club as a full equity bank, and was inspired to go back and reread \"[Toward's a run-free financial system](http://faculty.chicagobooth.edu/john.cochrane/research/papers/run_free.pdf)\" by John Cochrane.\n\nThough Cochrane's broader point is about the merits of a full-equity banking system, his specific proposal is to levy a pigouvian tax on debt in proportion to its systemic risk. This tax is meant to be paid by any institution that takes on this debt, not just banks.\n\nAnother point he made was that financial regulators have taken an increasing large role in limiting the amount of risk banking institutions are allowed to assume. This is mostly meant to reduce the problems of moral hazard arising from deposit insurance while still retaining the benefits of the insurance. He asserts that his proposed pigouvian tax on short term debt would be a good substitute for FDIC, with benefits to systemic stability and less need for risk regulation. In a system without deposit insurance, are net benefits to risk regulation in finance? Is it difficult or impossible to efficiently price in risk in these situations?\n\n***\n\nAsked [this](https://www.reddit.com/r/AskEconomics/comments/5w69un/are_there_any_disadvantages_to_relying_solely_on/) over on /r/AskEconomics, but also wanted to see if anyone here had some info.",
        "created_utc": 1488300513,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain why elections are \"called\" in certain countries? Who decides? Why isn't the US set up like this?",
        "author": "1okcthrow1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wod43/can_someone_explain_why_elections_are_called_in/",
        "text": "Am doing some research into Canadian policy for work, and being from the US (and shaky on my past polisci knowledge) I'm not understanding how countries could just \"call\" elections. What affect does this have on the political system?",
        "created_utc": 1488293238,
        "upvote_ratio": ""
    },
    {
        "title": "Is normalization in society actually a thing and if it is, is it automatically a bad thing?",
        "author": "Echo-42",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wo2on/is_normalization_in_society_actually_a_thing_and/",
        "text": "After catching up on the whole [Pewdiepie] (https://www.theguardian.com/technology/2017/feb/16/pewdiepie-antisemitic-video-media-wall-street-journal) vs [WSJ] (https://www.youtube.com/watch?v=lwk1DogcPmU) with an extra [slice] (https://twitter.com/jk_rowling/status/831514821174648833) of [J.K. Rowling] (https://www.youtube.com/watch?v=sTCDfE_sKnM) thingy it got me thinking. And it's something I've thought about before too and it's just as the label says. Is normalization actually a thing?\n\nYou hear the word thrown around everywhere mostly in the context of some undesireable opinion like far right or anti-feminism where the idea is that by using anything that can be associated in bad way with said context, it's normalizing the undesireable. Which, in this theory, would utlimately lead to people being more prone to share and agree with these opinions thus spreading the undersireable making it normal. It's something we all know about and it makes a lot of sense, but so does the gate-way theory.\n\nBecause what makes me react to this whole thing is that I personally don't get affected by it. And that's the normal \"well you can't base things off of yourself\" which is true, but then I also have to realize that I'm most likely a completely normal person in a sea full of people just like me. And of course people will have different opinions and there's a point, since people have different opinions from me I can't assume they will react the same way to the same information. However we also know that peoples opinions are really really hard to change, which should mean that unless someone already agrees with what they see then their opinion of it should be as hard to change as mine is. And the general concencus regarding things like antisemitism and racism is that it's bad, unless you think it's good period.\n\nSo to me it seems the only thing normalization actually does is just to make a subject more common, more normal to talk about, joke about, reflect about while the way you do it really won't affect peoples opinion of it. Unless it's propaganda.\n\nI'm absolutely sure there's loads of things I've missed which is why I'm asking you guys for help. And also if you know any research about it I'd love to see that! It's so often used as an argument against something but it seems like things that have been in danger of \"normalization\" i.e. Death metal, violent games etc have not in the end been an evidence for normalization but rather the opposite. But then you have the muslim hatred that's spreading, because that's a kind of normalization with great help from media representation, failing governments, politicans and Facebook. Because you really can't call that propaganda while in a way it gets the same result.\n\nI'm sorry it all looks like a mess, but that's my mind I guess. I hope maybe someone can understand at least a little bit of it! \n\nEdit: Links\n\nEdit2: Rowling is arguing that Pewdiepie is normalizing facism by using it as a tool to ridicule and make fun jokes out of, which I think we all can agree won't really do much positive for facism no matter how unfit the joke in itself was. (Let it be added though that I don't think anyone actually thought the boys would do that especially not Felix but now that they did it actually just proved the point of the video.) While of course she won't agree that you should be able to joke about everything that still doesn't prove her point of it normalizing facism in a bad way. She's actually using the exact same tool when in her own books the absolute core proof of someone being a true member of the good guys was to utter Voldemorts name in a way of resisting him and in extension normalizing a word that in itself has no power. \n\nThe point is in which way you normalize things I think. And I think it's obvious Felix does not support any of the things he's being accused of, and with that knowledge one should be able to understand that when a person makes a tasteless joke about a subject. Then it's not in support of it. \nI'm not here to spread the word of Pewdiepie but the example was what got me thinking and it fit really well.",
        "created_utc": 1488289890,
        "upvote_ratio": ""
    },
    {
        "title": "Does research find that high school is important?",
        "author": "blackcrumble",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wlso5/does_research_find_that_high_school_is_important/",
        "text": "I’m minoring in sociology in college. In a class I took last semester in a unit on education, the professor said that in her belief we (in the United States) don’t need high school. That a better alternative to high school would be public service/apprenticeship programs (she’s also a conflict theorist).\n\nHer comments piqued my interest in investigating this subject further. In general I’m very interested in schools from a sociological perspective. Is there much sociological research on this?",
        "created_utc": 1488254675,
        "upvote_ratio": ""
    },
    {
        "title": "If we suddenly adopt an socialist system, would an today economics degree still be worth and valid?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wlav1/if_we_suddenly_adopt_an_socialist_system_would_an/",
        "text": "[deleted]",
        "created_utc": 1488248890,
        "upvote_ratio": ""
    },
    {
        "title": "to deflect or to not deflect?",
        "author": "boundarydissolver",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wkcte/to_deflect_or_to_not_deflect/",
        "text": "[removed]",
        "created_utc": 1488238692,
        "upvote_ratio": ""
    },
    {
        "title": "Can different definitions of racism be summarized as differences in scope?",
        "author": "legidous",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wjaku/can_different_definitions_of_racism_be_summarized/",
        "text": "I'm in a introductory sociology course in my college, and today we were discussing reverse racism and how based on someone's definition of racism, minorities can't be racist against whites because of historical and institutionalized racism by whites against said minorities. \n\nCan the perspective in regards to racism simply be a matter of scope? For example, let me create a hypothetical example. Because of preconceived notions and bias towards the idea of race right now, let's say there are two races in the world: race A and race B. An individual of race A owns a business and denies service to someone of race B, simply because of his race. Now, if we looked at this situation simply in the current context, without any additional information, could we say that the person of race A is being racist? What if I add that race B had been racist towards race A several generations ago? Some would now change the situation from a 1-on-1 context of one race discriminating another, to making the individual of race A and B be representative of their race's respective historical roles, leading to the conclusion that the person of race A is not racist because the race he identifies with a race that was subjugated before (or even continues to be). \n\nIs this a fair description of the way racism is being defined in today's society? Where some look at a situation in a 1-on-1 context, others would broaden the situation and view it under the backdrop of past tensions between the two races? Which would then be more correct? Viewing the situation from the narrow context or the board context?\n\n It seems to me that this is where the confusion lies between the definition of racism. Whites seem to view a situation in the narrow context, vs minorities who would view it amid historical tensions.",
        "created_utc": 1488228488,
        "upvote_ratio": ""
    },
    {
        "title": "How are the US and Russian militaries as close to each other as they are despite the US spending over 7 times more on their military budget?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wiyxl/how_are_the_us_and_russian_militaries_as_close_to/",
        "text": "[removed]",
        "created_utc": 1488225453,
        "upvote_ratio": ""
    },
    {
        "title": "Effectiveness of taking months to analyze a book in middle-school?",
        "author": "M4053946",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wiau8/effectiveness_of_taking_months_to_analyze_a_book/",
        "text": "Anecdotally, it seems that it's common for middle-school students to spend 6-8 weeks covering a single book. In this time, they will read perhaps a chapter per week, and will take regular quizzes and will do various assignments as part of the studying the book. Also anecdotally, it seems like this approach frustrates a lot of kids. Is there a research-backed reason why schools teach literature this way? For example, my sixth-grade daughter will read a total of only 4 books during the year as part of her classes. Is there any reason to believe that this approach will result in better learning outcomes to perhaps reading a higher number of books, but with fewer quizzes and projects per book? ",
        "created_utc": 1488219077,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | February 27, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wgvvu/monday_reading_and_research_february_27_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1488204339,
        "upvote_ratio": ""
    },
    {
        "title": "Could the US ever adopt the idea of autonomous communities, i.e. Spain?",
        "author": "hospitalhaircuts",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wga9m/could_the_us_ever_adopt_the_idea_of_autonomous/",
        "text": "I have posted the same question in the /ask_political_science, this is a repost. \n\nThis community seems a little larger and might be able to address some of the social issues this questions brings up. Just interested in seeing what people's opinions are on this. I am not in favor or against the idea, just curious.\n\nI am an American living in Spain and have become very interested with the concept of their autonomous communities: Basques, Galicians, Catalonians, etc...\n\nCould a system like this even be in the realm of possibilities for the US? When you look at electoral maps it seems as if our political division is also a physical division as well, and it seems that these splits in ideology are drawn along cultural lines as much as they are drawn upon any other kind of dividing factor you might consider.\n\nWhat kind of changes would be in store if we put the emphasis on regions and communities instead of states?\n\nThis would obviously require some kind of rewrite of the constitution and America has its own brand of multiculturalism that could lead to problems, but I find it to be a fairly intriguing question.\n\nI am more interested in seeing if people who actually know what they are talking about could see this happening in the future.\n\nI am 100% talking out of my ass over here so please don't tear me apart if this is obviously a stupid question.\n\nCould we go to the United States to the \"Kinda United States\"?\n\nEdited: Andorra is a country.\n",
        "created_utc": 1488195787,
        "upvote_ratio": ""
    },
    {
        "title": "One-minute survey about your mobile gaming experience",
        "author": "AnnPlt",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wg860/oneminute_survey_about_your_mobile_gaming/",
        "text": "[removed]",
        "created_utc": 1488194782,
        "upvote_ratio": ""
    },
    {
        "title": "To what degree is politics a zero sum game?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5weplq/to_what_degree_is_politics_a_zero_sum_game/",
        "text": "[removed]",
        "created_utc": 1488169739,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of inciting event could potentially trigger a war between the United States and Russia?",
        "author": "omnichronkappa",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wegzs/what_kind_of_inciting_event_could_potentially/",
        "text": "[removed]",
        "created_utc": 1488166577,
        "upvote_ratio": ""
    },
    {
        "title": "School Burnout Inventory SBI (Salmela Aro et al) How to Interpret score",
        "author": "ShinSakura",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wdq5g/school_burnout_inventory_sbi_salmela_aro_et_al/",
        "text": "Hi, I am currently stuck on a project, I wanted to use a different questionnaire to measure burnout levels apart from MBI-SS on students, but I have a problem finding any score interpretation, that even includes the MBI-SS. I wanted to ask if anybody knows the interpretation tables for the scores. Being a poor bachelor student, I cannot afford MBI-SS services.\na pdf http://s3.amazonaws.com/academia.edu.documents/46424318/School_Burnout_Inventory_SBI_Reliabili20160612-2808-rkrn92.pdf?AWSAccessKeyId=AKIAIWOWYYGZ2Y53UL3A&amp;Expires=1488159252&amp;Signature=uMvHGYj5s8pCgCD2DQVC84xRX6E%3D&amp;response-content-disposition=inline%3B%20filename%3DSchool_Burnout_Inventory_SBI_Reliability.pdf\n\nEdit 1: Hope this is right sub to ask in.",
        "created_utc": 1488157518,
        "upvote_ratio": ""
    },
    {
        "title": "How did Neoliberalism get implemented in Iraq?",
        "author": "ohanakawaii",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wbv7d/how_did_neoliberalism_get_implemented_in_iraq/",
        "text": "Hi all!\n\nI'm trying to understand implementation and impacts of neoliberalism in Iraq, and would like to argue that the Iraq war was more based on protecting US interests within the middle east and to spread neoliberal ideology into a country rich with oil. I'm struggling a bit on trying to see if the reasons why neoliberalism got implemented in Iraq, and linking it to the iraq war. \nThank you so much\n\n\n",
        "created_utc": 1488137328,
        "upvote_ratio": ""
    },
    {
        "title": "Sexual Assault Perp Motivations",
        "author": "ocamlmycaml",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wbji9/sexual_assault_perp_motivations/",
        "text": "**What does the current research say about the motivations or predictors of sexual assault perpetrators?**\n\n----\n\nMotivation: We were going through sexual assault training in my grad program, and I noticed that the emphasis was either on victims or bystanders rather than on perpetrators. I talked to the Title IX guy at my school but he didn't offer many references.",
        "created_utc": 1488133914,
        "upvote_ratio": ""
    },
    {
        "title": "How variations in social solidarity can affect other areas of social life, such as criminal behavior and political protest?",
        "author": "casperlomard",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5wa9zg/how_variations_in_social_solidarity_can_affect/",
        "text": "",
        "created_utc": 1488118840,
        "upvote_ratio": ""
    },
    {
        "title": "How would America compare to the rest of the world in terms of gross GDP and/or GDP per capita if military spending were cut back significantly?",
        "author": "Swibblestein",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w9z50/how_would_america_compare_to_the_rest_of_the/",
        "text": "I was thinking about this the other day. America spends far more on the military overall than any other country. That sort of spending is bound to have an impact on GDP, since things are being produced and all that.\n\nSo I wonder if, assuming our military spending were cut back to be more in line with the next closest countries, we would see a different picture regarding America's status economically than we do now, compared to other countries, or if the shift wouldn't ultimately be that large.\n\nNote: If there's some metric that would better answer this question than GDP, feel free to use that instead. I'm no economist, I don't know these things, obviously, since I'm here asking.",
        "created_utc": 1488113779,
        "upvote_ratio": ""
    },
    {
        "title": "Why has sex become such a central part of determining \"faithfulness\"?",
        "author": "MrOaiki",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w9xdi/why_has_sex_become_such_a_central_part_of/",
        "text": "I'm not sure how else to put the question. Why is it ok to talk to someone else than your partner, work with someone else, hang out with someone else, but when it comes to sexual intercourse it's a big no-no in most societies. How did monogamous sex become such an essential part of human society?",
        "created_utc": 1488112769,
        "upvote_ratio": ""
    },
    {
        "title": "Why did suicide rates spike in the early 90s?",
        "author": "andychase0009",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w6xgq/why_did_suicide_rates_spike_in_the_early_90s/",
        "text": "Graph: https://www.statista.com/statistics/187478/death-rate-from-suicide-in-the-us-by-gender-since-1950/\n\nI'm curious if its related to divorce rates?\n\n&gt; \"It is interesting that being a parent of a young child appeared to explain the apparent protective effect of marriage for women in the Danish study rather than married status per se, whereas in men marriage appeared to be a protective factor in its own right (or single status a risk factor)\" \n\nSex and suicide\nKEITH HAWTON\nThe British Journal of Psychiatry Dec 2000, 177 (6) 484-485; DOI: 10.1192/bjp.177.6.484\n\nDivorce graph: https://www.papermasters.com/divorce-rate.html\n\nIs there studies that have looked into why this happened?",
        "created_utc": 1488063514,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly is Walter Benjamin arguing in \"Theses on the Philosophy of History\"?",
        "author": "UmamiSalami",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w5bo0/what_exactly_is_walter_benjamin_arguing_in_theses/",
        "text": "I see on Wikipedia that Scholem thought it was a decisive critique of historical materialism. But nothing about competing views, and I can't find any scholarly sources which are readable online.",
        "created_utc": 1488045604,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we have nation states?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w4ce5/why_do_we_have_nation_states/",
        "text": "A lot of the answers to this seem to be normative or historical. But nation states also seem to be very successful as a government at doing certain things and accomplishing certain tasks. \n\nWhere should I go for literature asking this question?",
        "created_utc": 1488033768,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it easier for races to coexist in a female prison vs. a male prison?",
        "author": "youramazing",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w3h9g/why_is_it_easier_for_races_to_coexist_in_a_female/",
        "text": "I just got done binge watching the two Lockup series on Netflix. One focuses on female jails/prison and the other on male. The one thing that stuck out to me the most was how in male prisons everything is according to race. Where you eat, who you associate with, where you hang out in the yard, who protects you, ect. Some prisoners said that if you don't join one of your race's gangs the second you enter prison (and don't request protective custody which is basically a single cell 23 hours a day) then you will not survive. All the footage I watched you saw the clear divide with whites, blacks and hispanics all mingling amongst themselves. Not too many examples of co-mingling except in smaller dorms with common rooms and that was because they had no choice but to coexists and get along but there was still an understanding that if a, for example, white person took a seat from a black person that there would be a fight.\n\nContrast that with female prisons, I didn't see any of what I mentioned above. It was all races getting along. I saw whites, blacks and hispanics all getting along well in the yard and in the dorms. There were no gangs. And maybe the answer is as simple as that. Whereas in male prisons it's the hierarchy of the gangs that run the yard/dorms in female prisons its the alpa females that run those settings. And these alpa females will have underlings of various races following their orders. \n\nDoes anyone know why that is or know of any studies that have been done on this? Hope I am posting in the right place. \n\nedit: found one study on females I'll read tomorrow: http://journals.sagepub.com/doi/abs/10.1177/001112878302900406?journalCode=cadb",
        "created_utc": 1488017861,
        "upvote_ratio": ""
    },
    {
        "title": "If a poor person decides they want to dedicate the rest of their life to making rich people exponentially more wealthy how should they do it?",
        "author": "seagullhunter",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5w1ffp/if_a_poor_person_decides_they_want_to_dedicate/",
        "text": "[removed]",
        "created_utc": 1487984827,
        "upvote_ratio": ""
    },
    {
        "title": "No Taxation without Representation| What would happen if the people of Washington DC didn't have to pay Federal Tax?",
        "author": "NomadFire",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vxv2p/no_taxation_without_representation_what_would/",
        "text": "[removed]",
        "created_utc": 1487948108,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | February 24, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vxll7/friday_freeforall_february_24_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1487945101,
        "upvote_ratio": ""
    },
    {
        "title": "How variations in the social solidarities of Durkheim can affect other areas of social, life like criminal behavior and political manifestation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vwqno/how_variations_in_the_social_solidarities_of/",
        "text": "[removed]",
        "created_utc": 1487931245,
        "upvote_ratio": ""
    },
    {
        "title": "More than two decades after the Bosnian War ended, what do the low-level perpetrators of ethnic cleansing think or feel about what was done at the time?",
        "author": "meidogeometry",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vwcww/more_than_two_decades_after_the_bosnian_war_ended/",
        "text": "I actually wasn't sure whether I should've asked /r/AskSocialScience, /r/AskPolitics, or /r/AskHistorians, but...\n\nWhile re-watching BBC's \"Death of Yugoslavia\", it occurred to me that while much has been written about the victims of the Bosnian War and the ongoing pursuit of justice for the war crimes committed therein, there has been considerably less exploration of what the low-level perpetrators - grunts and footsoldiers, many of whom never actually faced justice - now feel about the ethnic cleansing more than two decades later. Unlike the Holocaust that involved military and police forces committing violence on Jew strangers, much of the violence committed upon its victims - particularly the Bosniaks - were done by the neighbors and colleagues of said victims, people who knew each other. Now that twenty-plus years have passed, now that they're no longer \"caught up in the moment\", and now that the Bosnian War is something we can look back at with the benefit of hindsight, is there much in the way of conversation in former Yugoslavia about what was done on a person-to-person level, and are there any particularly pronounced sentiments among those involved at the time, such as regret or \"we did what we had to do\"?",
        "created_utc": 1487923809,
        "upvote_ratio": ""
    },
    {
        "title": "How does social policy manage interdependencies?",
        "author": "xxSullyxxx",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vvwev/how_does_social_policy_manage_interdependencies/",
        "text": "[removed]",
        "created_utc": 1487915975,
        "upvote_ratio": ""
    },
    {
        "title": "Does stock price have any effect on a business's success?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vv08v/does_stock_price_have_any_effect_on_a_businesss/",
        "text": "[deleted]",
        "created_utc": 1487904389,
        "upvote_ratio": ""
    },
    {
        "title": "Not entirely sure if this is the right place to put this, but if the US, China, and the EU were to declare war illegal, and that anyone who disobeys could face their combined might, would war end?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vuivx/not_entirely_sure_if_this_is_the_right_place_to/",
        "text": "[removed]",
        "created_utc": 1487898756,
        "upvote_ratio": ""
    },
    {
        "title": "Are two income households a self-fulfilling prophecy? Has the cost of living risen proportionally alongside family incomes since the days when most families lived on a single income?",
        "author": "PetsArentChildren",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vtgus/are_two_income_households_a_selffulfilling/",
        "text": "",
        "created_utc": 1487887515,
        "upvote_ratio": ""
    },
    {
        "title": "Do giveaways by dentist's offices or similar situations lead to behavioral change?",
        "author": "fishsticks40",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vs8ai/do_giveaways_by_dentists_offices_or_similar/",
        "text": "I'm thinking specifically of the little tiny floss packages, which comes to mind because I just ran out of regular floss and used one of those for a few days. \n\nMy instinct is that to get someone to change a habit like not flossing would require more than a few days of practice; that if an intervention like this works at all, it would work far better if you gave a full package of floss that would allow someone to establish the habit for a couple of months before they had to decide to go out and purchase it on their own. The toothbrush giveaway is a little different, as most people who go to the dentist will be regular brushers, and that could encourage them to replace their brushes on a regular basis. \n\nHas anyone studied these types of interventions to measure their efficacy?",
        "created_utc": 1487875690,
        "upvote_ratio": ""
    },
    {
        "title": "I've heard it claimed that African American communities are both over-policed and under-policed. What does this mean and why?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vrpvd/ive_heard_it_claimed_that_african_american/",
        "text": "[removed]",
        "created_utc": 1487870857,
        "upvote_ratio": ""
    },
    {
        "title": "How is it that they say our brain is lazy in thinking and fast in judging?",
        "author": "Farhadsharifi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vpk4f/how_is_it_that_they_say_our_brain_is_lazy_in/",
        "text": "this came to my mind after I read Thinking fast and Slow, is that so? that our brain is lazy in active thinking? ",
        "created_utc": 1487843180,
        "upvote_ratio": ""
    },
    {
        "title": "Why would a mother let her son sleep over at the school principal's house?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vnfaq/why_would_a_mother_let_her_son_sleep_over_at_the/",
        "text": "[deleted]",
        "created_utc": 1487816450,
        "upvote_ratio": ""
    },
    {
        "title": "What's the historical evidence for violent vs. nonviolent means of resistance to political extremism?",
        "author": "incredulitor",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vmdco/whats_the_historical_evidence_for_violent_vs/",
        "text": "Pretty self-explanatory.  I would prefer 20th and 21st century examples since they seem intuitively more relevant to the modern day, but I'm open to others if you can point to how they're more relevant than more recent examples.  Thanks.",
        "created_utc": 1487806773,
        "upvote_ratio": ""
    },
    {
        "title": "Are there reliable cross-country rape statistics?",
        "author": "RickAndMorty101Years",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vm0my/are_there_reliable_crosscountry_rape_statistics/",
        "text": "I've heard a lot of discussion the past few days about why Sweden's rape statistics are so high. Anti-refugee people seem to be saying that it is due to immigration. Pro-refugee people seem to be arguing it's because Sweden's definition of \"rape\" is much broader and more highly enforced than other countries.\n\nSo is there some human rights watch group that uses the same standard to count rapes and sexual assaults?",
        "created_utc": 1487803567,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence that a person's level of attractiveness affects how they're treated by other people?",
        "author": "tereddits",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vlgz0/is_there_any_evidence_that_a_persons_level_of/",
        "text": "I'm having an argument with my friend. My side is that how attractive a person is can have an effect on how they're treated by other people, and my friend's position is that that is not so. Is there any evidence that points to either of us being right?",
        "created_utc": 1487798200,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any neurological or psychological differences between learning different languages and learning different dialects?",
        "author": "egaleco",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vkhw5/are_there_any_neurological_or_psychological/",
        "text": "I consume a lot of English media and have friends from England. Some of my American friends have said they can't understand what my English friends at all. I can understand most UK accents and can speak in the Queen's English a little bit.\n\nSo that got me thinking; would there be any similar neurological or psychological changes from understanding and speaking starting from AAVE to MLE compared to from English to Spanish? \n\n",
        "created_utc": 1487788958,
        "upvote_ratio": ""
    },
    {
        "title": "Do online communities such as /r/suicidewatch worsen the situation for people with depression?",
        "author": "Schmitty422",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vjjf3/do_online_communities_such_as_rsuicidewatch/",
        "text": "I'm part of an online community and one of our members recently killed themselves. This has led to talk of creating some kind of depression support group. We're pretty split on the idea, and whether or not it is more harmful than good. Some people have brought up that people may view it as an adequate substitute for real help, and just leave them wallowing in depression. Others have said that if they refuse to get real help, having some kind of support group online is better than nothing.\n\nIf such a group were clear that they were not professionals and in no way a substitute for real help, and just listened to people, encouraged them to get real help, and provided emotional support, would that community be harming the situation? \n\nThanks",
        "created_utc": 1487779946,
        "upvote_ratio": ""
    },
    {
        "title": "Why do South Koreans spend so little on healthcare, yet live so long?",
        "author": "Qwernakus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vizpl/why_do_south_koreans_spend_so_little_on/",
        "text": "So, I was [comparing my life in Denmark with what it would be in Korea](https://www.ifitweremyhome.com/compare/DK/KR). Us danes usually consider ourselves pretty lucky with out healthcare (looking at [OECD](http://www.oecd-ilibrary.org/docserver/download/8115071e.pdf?expires=1487772732&amp;id=id&amp;accname=guest&amp;checksum=32AB157DAE84AE5313921DFF20B8A46D), we're only just below average) but Koreans seem to have us beat pretty squarely. They not only live slightly longer, they do it as a third of the healthcare cost! This figure is an aggregate of both public and private spending. How do they do this?\n\nI cant find any glaring cultural issues. Denmark ranks 10 in obesity on the OECD, Korea at 2 - definitely better, but not overwhelmingly so. [Alcohol consumption](https://en.wikipedia.org/wiki/List_of_countries_by_alcohol_consumption_per_capita) is about the same. Koreans [smoke less](https://en.wikipedia.org/wiki/List_of_countries_by_cigarette_consumption_per_capita) than danes. Korea has a much, much higher suicide rate than Denmark, so it's probably not mental health either.\n\nAnd after all, the difference in cost is massive, it certainly cant be explained entirely by culture. So, why is the South Korean healthcare system so efficient?",
        "created_utc": 1487774262,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | February 22, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vitu7/theory_wednesday_february_22_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1487772347,
        "upvote_ratio": ""
    },
    {
        "title": "What are the main academic papers showing the impact of social media on society?",
        "author": "Valeron21",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vetmx/what_are_the_main_academic_papers_showing_the/",
        "text": "A lot of people seem to suggest social media has had a huge impact on society. \n\nGenerally, the people who say this seem unqualified, however. It's usually social commentary on television programmes, celebrities, or people in the working environment with a vested interest in this being true.\n\nWhilst I don't doubt social media has had some impact on society, I'm struggling to trust the general consensus. \n\nReferencing my question, which are the more notorious papers on the impact of social media? Are there any? How do we know the impact of society? \n\nIn regards to advertising, increased profit for businesses, or the way corporations use social media, is there any research in this field? Or more broadly, what about the work on how we digest information, how that impacts of politics? \n\nBasically looking for anything credible demonstrating the impact of social media on society in a meaningful way. Work, culture, anything - go crazy.",
        "created_utc": 1487717514,
        "upvote_ratio": ""
    },
    {
        "title": "Why do most for-profit colleges deliver such poor outcomes?",
        "author": "feartrich",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5veayf/why_do_most_forprofit_colleges_deliver_such_poor/",
        "text": "On the face of it, profit motive isn't inherently bad for education. Some for-profit colleges are good and a few, like Digipen, even have some degree of renown.\n\nMost, however, are middling, and many are just bad. Some have even been shut down due to allegations of predatory practices and defrauding the American student loan system. Many are unaccredited and don't seem to provide any meaningful value to the consumer at all (diploma mills). Others are accredited, but laughed at and have poor reputations.\n\nAre there any theories on why for-profit colleges are of such poor quality?",
        "created_utc": 1487712368,
        "upvote_ratio": ""
    },
    {
        "title": "How sustainable is a politically divided society?",
        "author": "ignoculture",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vczo8/how_sustainable_is_a_politically_divided_society/",
        "text": "In [this](https://www.reddit.com/r/AskSocialScience/comments/5vbwhe/is_there_a_big_increase_in_political_partisanship/) /r/AskSocialScience thread answers argue that political divisiveness, polarization in USA has been increasing. I have following questions:\n\n * Can we extrapolate this polarization will keep increasing?\n * If we assume it will keep increasing until a major event occurs, what would happen? How would a divided society continue to live in the same country?\n * Could election in such a heterogeneous country possibly be democratic?",
        "created_utc": 1487700037,
        "upvote_ratio": ""
    },
    {
        "title": "Do LGBTQ individuals have staggered narrative identities?",
        "author": "zgarbas",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vckrm/do_lgbtq_individuals_have_staggered_narrative/",
        "text": "I was reading about narrative identities and how individuals begin shaping their narrative in adolescence, which is when certain elements become key parts of their identity. ([Started from McAdams&amp;McLean 2013](http://journals.sagepub.com/doi/abs/10.1177/0963721413475622) and rabbitholed from there)\n\nThough the Internet has changed things a bit for the young'uns, most people I know in the LGBTQ community have a common coming-of-age story of not thinking about/being in denial about their identity as queer during adolescence due to their environment, usually developing that aspect of their narrative well into young adulthood or mid-adulthood( when the Generations Theory would dictate that it would not really stick). I'm curious if there's been work done on this, or at least what you think about it. \n\nI think that maybe this can explain the discrepancy between cultures where the gay lib happened more than a generation ago (like the US and some European countries), and cultures where the gay lib has yet to become a mainstream phenomenon. We see LGBTQ individuals who clearly separate their orientation/gender from their identity in places like Japan, which would be quite unfathomable to contemporary Westerners. Do you think that a lack of exposure to these ideas and communities staggers their narrative identity from this perspective? \n\nIf you also take into account that many queers tend to become recluse or avoid socialisation in their adolescence due to bullying of fear of being found out (for lack of a better term), would that have an impact on their ability to narrate their identity as a whole?\n",
        "created_utc": 1487696063,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a big increase in political partisanship in the US nowadays or has there always been a big left/right divide?",
        "author": "balkanizeparadise",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5vbwhe/is_there_a_big_increase_in_political_partisanship/",
        "text": "",
        "created_utc": 1487689034,
        "upvote_ratio": ""
    },
    {
        "title": "Do all societies frame the political struggle of equality-inequality as left versus right, or do other naming schemes exist?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v88rx/do_all_societies_frame_the_political_struggle_of/",
        "text": "I am not asking if any cultures operate by a different political framework, but if any societies use different language to refer to this specific struggle.",
        "created_utc": 1487635753,
        "upvote_ratio": ""
    },
    {
        "title": "Is ADHD an actual medical condition or can it be attributed mainly to medicalization from several different forces (teachers, pediatricians, pharmaceutical companies, etc.)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v7wbo/is_adhd_an_actual_medical_condition_or_can_it_be/",
        "text": "[deleted]",
        "created_utc": 1487632109,
        "upvote_ratio": ""
    },
    {
        "title": "[University Languages] Humor studies, help me please?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v7cn9/university_languages_humor_studies_help_me_please/",
        "text": "[removed]",
        "created_utc": 1487626443,
        "upvote_ratio": ""
    },
    {
        "title": "What is the consensus on resume bias studies?",
        "author": "RickAndMorty101Years",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v57q1/what_is_the_consensus_on_resume_bias_studies/",
        "text": "There are some studies that show that sending in resumes with male vs female names shows more responses with male names in certain fields. There's also similar studies with black names/white names and white people get more call backs. How solid is this research? Is there maybe a meta-analysis on the studies? Has this been shown to play a part in income gaps between groups?",
        "created_utc": 1487605618,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | February 20, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v4olt/monday_reading_and_research_february_20_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1487599469,
        "upvote_ratio": ""
    },
    {
        "title": "Phenomenon of community division?",
        "author": "quantum_metaphysics",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v4m4p/phenomenon_of_community_division/",
        "text": "So I know, at least anecdotally, that there is a phenomenon in which as a given community gets larger, it eventually will split apart. Like, two people get in a fight over something, people pick sides, and then one group becomes two. It seems kinda related to the Dunbar Number, but I feel like there has to be a more specific name for this phenomenon. Has this been formalized in any way, with empirical research?",
        "created_utc": 1487598538,
        "upvote_ratio": ""
    },
    {
        "title": "Are there Nativist movements in China, like the BJP and Hindutva in India?",
        "author": "Shlammi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5v2mx4/are_there_nativist_movements_in_china_like_the/",
        "text": "Is there any kind of nativist, either religious (Buddhist or Daoist) religious revival or nativist conservatism against Western influences in China? Basically, like the Hindutva movement in India or something comparable?",
        "created_utc": 1487565685,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking sources about the social psychology of trauma survivors, how \"in\" groups affect recovery and how to establish trust.",
        "author": "MrSpaceman",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uzmvm/seeking_sources_about_the_social_psychology_of/",
        "text": "(Just found this sub. This is an x-post from /r/Social_Psychology earlier today.)\n\nI have spent the past 4 years interviewing people on topics related to health and sexuality for the purpose of creating content and services for those. I've been using a new recruitment method, that emphasizes diversity of participants. The data from these diverse interviews will be used to design a poll of statistical relevance to understand incidence of various behaviors in a larger population (US).\n\nThe interviews themselves are going well, however I've been running across a lot more people than expected who have suffered from some sort of trauma, and I'm wondering if there are any existing analysis of percentage of people in US who have long term effects from trauma (e.g. PTSD, anxiety attacks) that may help speed up my understanding.\n\nI'm particularly interested if any segmentation models describe how trauma affects social interactions, particularly issues related to establishing trust, and the formation of \"in\" friend groups, and which types of groups may make recovering from long term effects of trauma more or less likely.\n\nSo far, the data from my interviews suggests that people trust others \"who have been through what I've been through\". The hypothesis I'm evaluating is that people who have suffered from trauma may flock together, and that post-trauma, recovered alphas may be beneficial to break people out of negatively self-reinforcing behaviors of their \"in\" groups.\n\nI'm also wondering how often people who suffer from long term effects of trauma are able to form close bonds with people who have not have had any severely negative social experiences in their past.\n\nBased on the focus of my research, the type of trauma I'm most likely to encounter is childhood or adult verbal abuse, physical abuse, sexual abuse or abuse of people based on their non-binary gender.\n\nHoping this makes sense. Suggestions for books, studies or articles are welcome.",
        "created_utc": 1487529154,
        "upvote_ratio": ""
    },
    {
        "title": "How did the general consensus of 'self acceptance' and a backlash against 'identity rejection' become so prominent in the Western World compared to half a century ago?",
        "author": "femmejean",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uza60/how_did_the_general_consensus_of_self_acceptance/",
        "text": "Sorry for the awkwardly worded title but here it goes...\n\nFrom reading/watching a bit about 20th century history along with interacting with various individuals today, there seems to have been a massive shift in mentality regarding identity corncerning biological aspects like race and gender and superficial aspects such as facial and body aesthetics. \n\nScientists and social planners were experimenting with the end goal of improving humans. [Racial Whitening](https://en.wikipedia.org/wiki/Racial_whitening#People_who_have_made_reference_to_whitening_in_Brazil) was common across many countries, sexual reassignment surgery was experimented with, castrations were performed on men for singing.\n\nNow all of that has obviously been made illegal to perform by any government or kept under strict regulation by doctors. However even those who self- elect to modify their body in any way are looked at with a certain amount of disdain. An example would be Africans looking to lighten their skin. They would be frequently criticized by not just black people but whites as well. A common message would be 'just accept yourself the way you are'. Even when  effective methods of achieving physical modifications exist, there is a high resistance among many people.\n\nI wonder am I wrong about attitudes among the general population towards these modifications pre-1960s. Were things like  plastic surgery considered 'vain and shallow' like they are today?\n\n\n\n\n",
        "created_utc": 1487525088,
        "upvote_ratio": ""
    },
    {
        "title": "On Real Time this weekend, one guest said transgender people are “vastly disproportionately involved with sex crimes.” Is this true? What was he referring to?",
        "author": "throwaway95624",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uyr83/on_real_time_this_weekend_one_guest_said/",
        "text": "Here's the [video.](https://www.youtube.com/watch?v=3cDLflyQ8TA)\n\nI found a few articles discussing how there are almost no cases of sexual assault as a result of transgender bathroom policies. I also found articles discussing how trans people are much more likely to be victims of sexual violence. But is there any truth to trans people being more likely to be perpetrators?\n\nEdit: I get that trans people are victimized at a higher rate. I am looking for the stat of how many sex crimes are committed by trans people. I don't want this coming up in a future debate without having read the data.",
        "created_utc": 1487518752,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Spain, especially compared to the rest of Europe, so relatively ok with homosexuality?",
        "author": "polishprocessors",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uyba9/why_is_spain_especially_compared_to_the_rest_of/",
        "text": "Particularly given Spain's historic and continued connection with the Catholic Church, why had Spain become so much more tolerant of homosexuality/gay marriage/etc than other places that may traditionally have been seen as less conservative than Spain?",
        "created_utc": 1487512259,
        "upvote_ratio": ""
    },
    {
        "title": "Sociological Imagination",
        "author": "uchiha_madara10",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uwq6w/sociological_imagination/",
        "text": "[removed]",
        "created_utc": 1487480068,
        "upvote_ratio": ""
    },
    {
        "title": "Statistics on Scientist/Academic immigration patterns",
        "author": "saltyladytron",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uty2l/statistics_on_scientistacademic_immigration/",
        "text": "Hope this is the right place to ask this:\n\nDoes anyone have, or know where to find the immigration patterns of academics, or \"[academic population](http://data.uis.unesco.org/Index.aspx?DataSetCode=SCN_DS&amp;popupcustomise=true&amp;lang=en)\"?",
        "created_utc": 1487444012,
        "upvote_ratio": ""
    },
    {
        "title": "Sociology research survey",
        "author": "redhwksky",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5utlko/sociology_research_survey/",
        "text": "[removed]",
        "created_utc": 1487440065,
        "upvote_ratio": ""
    },
    {
        "title": "Has any research been done on the efficacy of sexual consent classes?",
        "author": "Pastorality",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5utgth/has_any_research_been_done_on_the_efficacy_of/",
        "text": "I'm wondering if we have any information on the outcomes of classes like [these](https://www.theguardian.com/education/2014/oct/28/what-i-learned-in-a-sexual-consent-class-at-oxford). All I can find on Google are anecdotes and opinion pieces",
        "created_utc": 1487438554,
        "upvote_ratio": ""
    },
    {
        "title": "Phenomena of the Brain",
        "author": "Spencer_Art_0214",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uq76v/phenomena_of_the_brain/",
        "text": "I'll be on a noisy bus or at a gathering where there's a lot of noisy chatter, but it's more or less white noise that I tune out while on my phone and don't notice it after a while. For whatever reason, I've forgotten that the people around me even exist while drifting off in the land of Facebook, but every now and then out of the chatter, I'll hear something like \"butt plug\" and I just look up, confused as hell, and wondering who said that. Does anyone know what that effect is called where certain words in pointless chatter catch your ear? I've been looking for it and can't find it. And does this happen to anyone else?",
        "created_utc": 1487383515,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone recommend a good general survey on Florida state politics?",
        "author": "Jierdan_Firkraag",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5up4xe/can_anyone_recommend_a_good_general_survey_on/",
        "text": "Florida is such an important state in federal politics, but I realized recently that I know very little about state level politics there. Any Floridians or Political nerds (and I count myself among that nerddom's illustrious number) able to give a fellow nerd a hand?",
        "created_utc": 1487370514,
        "upvote_ratio": ""
    },
    {
        "title": "Is the \"Don't come to school tomorrow\" text a myth or did it actually happen at some point?",
        "author": "uhuhuhu",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uon5h/is_the_dont_come_to_school_tomorrow_text_a_myth/",
        "text": "School shooters sending warning texts to other students who were nice to them is a popular meme. Did this ever happen in real life?  \nDo mass shooters in general warn specific people they care about about their planned attack, or is that just a myth?",
        "created_utc": 1487365221,
        "upvote_ratio": ""
    },
    {
        "title": "Can any conclusions be drawn about the relative successes of individualist vs. collectivist societies historically?",
        "author": "beelzebubs_avocado",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5undyp/can_any_conclusions_be_drawn_about_the_relative/",
        "text": "And are any differences found causal or contingent on other correlated factors or historical accidents?\n\nThis question was raised for me based on a discussion elsewhere where another user wrote:\n\n&gt;societies that favor individual over group responsibility are powerful prosperous and good places to live in. \n\nand \n\n&gt;Republics with a lot of individualistic traits frequently were powerhouses, definitely much more often than collectivist societies who completely underperformed.",
        "created_utc": 1487352413,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | February 17, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5um9gs/friday_freeforall_february_17_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1487340277,
        "upvote_ratio": ""
    },
    {
        "title": "Will China's rise cause some developed country to drop down to developing countries?",
        "author": "nfc_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5um5sw/will_chinas_rise_cause_some_developed_country_to/",
        "text": "I've read some answer's on Zhihu (Chinese Quora) that suggests some tier-2 developed countries (Korea, Taiwan, Southern Europe) could be dragged down to middle-income status in the next 15 years due to China moving up the industrial value chain. US will be okay due to the scale and depth of it's economy.\n\nIn the past, developed countries and China had a very complementary relationship. Rich countries provided the technology and design while China provide cheap labor; they did not compete directly. However, gradually Chinese manufacturing has increased in sophistication so less foreign technology and known how is needed. In some cases (ex. steel, electronics, smartphone supply chain), China has mastered the technology and is now competing directly with rich, developed countries; stealing the rice bowl as it is known in Chinese - 抢饭碗.\n\nConcerns about the growing trend of direct Chinese industrial competition has been raised by Germany's Merkel, Taiwan's Tsai and Korea's Park in the last year. Lots of smaller developed countries are actually supported only by a few pillar industries that depend heavily on exports to international markets.\n\nFor example, the market cap of Samsung Electronics and TSMC are almost 20% of the Korean and Taiwanese economy. Both companies rely on semiconductor technology that China does not yet have and rely heavily on exports to China. At over $100B, China imported more semiconductor than oil last year. \n\nChina's next 5 year plan is highly focused on improving the country's semiconductor technology. 5 year plans targeting specific industries have been pretty effective in the past like in shipbuilding. So if successful, Taiwan and Korea could be challenged in one of their pillar industries.\n\nThe auto industry supporting Germany and Japan could also be challenged if Electric Vehicles (BEV) and autonomy take off and China owns all the core technology, production and supply chain. This is not far-fetched as China is currently the world leader in BEV and on-par with US in Machine Learning research.\n\nThe economic stagnation in Southern Europe and midwest US are warning signals. They relied on relatively lower tech manufacturing and had their rice bowl stolen from them already. If trends continue, this could happen to even more countries with even greater economic loss.\n\nMy question is: how plausible is this theory? Is it inevitable that China will master existing technology that it does not yet have? Are developed countries that vulnerable where losing a core industry will drag entire economy down? Has there been historical precedent where this happened to an industrialized country?\n",
        "created_utc": 1487338927,
        "upvote_ratio": ""
    },
    {
        "title": "Why do states act through international organisations?",
        "author": "mercurialmurray66",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ulaae/why_do_states_act_through_international/",
        "text": "",
        "created_utc": 1487324096,
        "upvote_ratio": ""
    },
    {
        "title": "Any Suggested Political Economy Textbook?",
        "author": "DReicht",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uj39m/any_suggested_political_economy_textbook/",
        "text": "Of the ilk of Acemoglu and Robinson?",
        "created_utc": 1487291526,
        "upvote_ratio": ""
    },
    {
        "title": "Pew Research Center's most recent polling put Trump's approval rating at 39% (1500 polled, 95% confidence). Rasmussen Reports's polling puts his approval rating at 55% (1500 polled, 95% confidence). How are they so far apart?",
        "author": "deliciousnightmares",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5uif9w/pew_research_centers_most_recent_polling_put/",
        "text": "",
        "created_utc": 1487284723,
        "upvote_ratio": ""
    }
]