[
    {
        "title": "Why are there so few megafauna that live on the surface of the ocean?",
        "author": "chunkylubber54",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11tib3c/why_are_there_so_few_megafauna_that_live_on_the/",
        "text": "To be clear, I mean animals which live most of their lives floating above the water. There's obviously a number of smaller organisms as well as large-ish ones that live in freshwater like waterbirds, but almost nothing in the way of living ships and barges. I could hazard a guess that the mix of violent weather and the disadvandages of not being as mobile in 3-dimensions would play a role, but I'm surprised there's not really anything human-sized or larger",
        "created_utc": 1679031513,
        "upvote_ratio": 1.0
    },
    {
        "title": "The scifi boom of the 50s and 60s inspired many to love science and maths. What are some new discoveries in science that could make an innovative plot line for a show, today?",
        "author": "jaybestnz",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11the5i/the_scifi_boom_of_the_50s_and_60s_inspired_many/",
        "text": "Multiverse, UAPs, AI, quantum computing, These are all fairly standard plots, but are there really unique things not commonly known?",
        "created_utc": 1679028519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do our eyes constantly refresh new cells and ditch the old ones, like our skin, into dust? If so - where do the old cells go?",
        "author": "RockBandDood",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11te59e/do_our_eyes_constantly_refresh_new_cells_and/",
        "text": "Hey everyone,\n\nJust random biology question.  Skin is constantly renewing on our bodies and shedding off as skin flakes/dust.  Does a similar process happen with our eyes?  And if it does - how do our eyes get rid of the excess? \n\nThanks for your time",
        "created_utc": 1679019068,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does body fat induce type 2 diabetes?",
        "author": "redzeusky",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11tbk7z/how_does_body_fat_induce_type_2_diabetes/",
        "text": "A study from the University of New Castle noted that people who lost 35 pounds could again achieve a1C scores below the diabetic level 6.5 - without medication. What is it about body fat that interferes with the production of insulin and/or the mentalization of sugar?",
        "created_utc": 1679012736,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen to surface temperatures on the moon if it gained a small atmosphere of pure CO2? Would hot regions get hotter or colder?",
        "author": "IgnoranceFlaunted",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11t6yjk/what_would_happen_to_surface_temperatures_on_the/",
        "text": "",
        "created_utc": 1679002353,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the properties of the electroweak interaction? Does it still occur anywhere in the universe naturally? How does it interact with matter and the other two forces?",
        "author": "William_Wisenheimer",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11t3tvt/what_are_the_properties_of_the_electroweak/",
        "text": "",
        "created_utc": 1678995122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would Zeppelins be possible in Mars's atmosphere?",
        "author": "dashboardcomics",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11t3d36/would_zeppelins_be_possible_in_marss_atmosphere/",
        "text": "A few months ago I asked if conventional planes would work under Mars's thinner atmosphere, and the TLDR answer I got was... not really.\n\nSo I'm curiouse if the same reasons why airplanes wouldn't work would be the same/similar reasons why blimps, zeppelins and other large balloons may/May not work in a Martian atmosphere. \n\nAsking as a sci-fi writer.",
        "created_utc": 1678994025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Geocentric epicycles produced more accurate results when compared to heliocentric orbit models in the beginning. Are there other examples for wrong models being better in application than later, more correct models?",
        "author": "platypodus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11syt7b/geocentric_epicycles_produced_more_accurate/",
        "text": "\"Claudius Ptolemy refined the deferent-and-epicycle concept and introduced the equant as a mechanism that accounts for velocity variations in the motions of the planets. The empirical methodology he developed proved to be extraordinarily accurate for its day and was still in use at the time of Copernicus and Kepler. It is important to clarify that a heliocentric model is not necessarily more accurate as a system to track and predict the movements of celestial bodies than a geocentric one when considering strictly circular orbits. A heliocentric system would require more intricate systems to compensate for the shift in reference point. It was not until Kepler's proposal of elliptical orbits that such a system became increasingly more accurate than a mere epicyclical geocentric model.[9]\" [Source](https://en.wikipedia.org/wiki/Deferent_and_epicycle)",
        "created_utc": 1678983960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Species scientific name",
        "author": "Warm-Pudding4883",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11sx000/species_scientific_name/",
        "text": "\n\nHi can I ask for a suggestion about a scientific name for may own animal. My animal is Marmadillon (mammoth, armadillo and bison)",
        "created_utc": 1678979870,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do woodpeckers not get concussed?",
        "author": "fewzar",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ssbqh/how_do_woodpeckers_not_get_concussed/",
        "text": "",
        "created_utc": 1678968654,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is theoretically the best fuel for fusion reactions that we know of?",
        "author": "SNRNXS",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11slsy0/what_is_theoretically_the_best_fuel_for_fusion/",
        "text": "Right now, given our current technology and abilities, the best fuel for a nuclear fusion reactor would be Deuterium-Tritium fuel, at least according to Google. I also understand that aneutronic fusion is important, but much more challenging to achieve.\n\nBarring technical challenges and costs in sustaining this reaction to begin with, the fusion reaction that produces the most energy output while still being aneutronic would be the best fuel for a fusion reactor, no?\n\nDo we know what that fuel would be? Or otherwise, the best fuel we know of?",
        "created_utc": 1678946618,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if nobody wanted to be a doctor anymore?",
        "author": "peebyc",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11se08y/what_would_happen_if_nobody_wanted_to_be_a_doctor/",
        "text": "[removed]",
        "created_utc": 1678925205,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if during day light savings, clocks went forward 2 hours instead of 1. how does that effect society. What if clocks went 2 hours back instead of 1 in november?",
        "author": "Bigticekt21",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11sd8z6/what_would_happen_if_during_day_light_savings/",
        "text": "",
        "created_utc": 1678923345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we build a god? If so, can that god act?",
        "author": "Krosis1234",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11s9fax/can_we_build_a_god_if_so_can_that_god_act/",
        "text": "Hello I am Krosis an average guy who likes to write stories. \n\nI have come up with an idea for a scientific experiment. I will try to lay this out in a scientific manner.\n\nQuestion: Can the faith of one or more people have a measurable, tangible effect on the world, not through the direct actions of the faithful, I.E. Can faith make miracles?\n\nResearch topic: The effects of human belief on the physical world.\n\nHypothesis: A sufficient number of sufficiently sapient beings, in this case humans, believing in, in this instance a god, will give that idea life.\n\nExperiment/test: Design a god, gather a test group and a control group. Both groups are given the information about the idea/god.  \nGroup A is asked to put thought and faith towards the idea, this is the test group.   \nGroup B, is merely given the information but not asked to anything with the information.\n\nIs this an ethical idea? Could this experiment be run? What would the ramifications be for its disproval or its confirmation?",
        "created_utc": 1678914695,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI proposed scientific synthesis",
        "author": "Dudenostahp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11s4sle/ai_proposed_scientific_synthesis/",
        "text": "I asked GPT4 to synthesize something from existing scientific papers which is supported by evidence but not explicitly stated by the authors. GPT3 was very difficult to coerce into generating this information but GPT4 did so readily. \n\nHow do you think this will impact scientific advancement and education? It certainly would seem to help me ideate research projects.",
        "created_utc": 1678904831,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://t.snapchat.com/wQvWOSV3",
        "author": "graceameliaq",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ruyag/httpstsnapchatcomwqvwosv3/",
        "text": "",
        "created_utc": 1678883384,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just got an awesome analogy from chatGPT about fields and quantum theory. Thing is, how can I validate it to be correct?",
        "author": "tigerjerusalem",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ruvyo/i_just_got_an_awesome_analogy_from_chatgpt_about/",
        "text": "I'm a drsigner but I love reading about crazy science stuff like quantum theory. I just got an analogy that to my lack of knowledge of quantum theory helped me visualize fields, protons and the Higgs field better than anything I read. Thing is, I want to be sure this makes sense but have no idea how, and I feel that this question would be deleted on r/askscience. Any ideas on how to validate this answer?\n\n**What is a field?**\n\nIn quantum mechanics, particles are described by wave functions, which are mathematical functions that provide information about the probability of finding a particle at a particular location in space. This is where the concept of a \"field\" comes in. In quantum field theory (QFT), which is a more advanced framework that combines quantum mechanics and special relativity, particles are viewed as excitations or vibrations in fields that permeate all of space.\n\nTo help visualize this, imagine a rubber sheet that represents a field. When this sheet is flat and undisturbed, it is said to be in its ground state or vacuum state. If you were to create a small vibration or ripple in the sheet, that would represent an excitation in the field, and this excitation corresponds to a particle.\n\n**What is a proton?**\n\nIt's reasonable to think of a proton as an intersection of the \"rubber  sheets\" representing the up quark and down quark fields, where there are  two excitations in the up quark field and one excitation in the down  quark field. These excitations (quarks) are bound together by the strong  nuclear force, mediated by the exchange of gluons.\n\n**What is Higgs?**\n\nIn our rubber sheet analogy, you can think of the Higgs field as another \"sheet\" that permeates all of spacetime. Unlike the other fields we discussed earlier, the Higgs field has a unique property: it has a non-zero value even when it is in its ground state or vacuum state. This means that the Higgs field is \"always on\" and has a constant background value throughout the universe.\n\nWhen other particles, such as the quarks or the W and Z bosons (which mediate the weak nuclear force), interact with the Higgs field, they acquire mass. The more strongly a particle interacts with the Higgs field, the more mass it gains. In this analogy, you can imagine the particles as moving through the Higgs \"sheet\" and experiencing a kind of \"resistance\" or \"drag\" that manifests as mass.",
        "created_utc": 1678883208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tiny little hard rubin/blood Crystal apparence things coming off from my scalp, how are they formed?",
        "author": "randomusername11222",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rtlh2/tiny_little_hard_rubinblood_crystal_apparence/",
        "text": "I am NOT asking for medical consulting, but I am just curious about how such things could have been formed \n\nSometimes when I scratch my head (not because I feel any itching, but because it's relaxing), I can feel some irregularities so to say, hard like rocks, and I can take them out\n\nThen when I take them off, they have this aspect\n\nhttps://i.imgur.com/xp4Yp7J.jpg\n\nI would say that they are from some wound, like microcuts or whatever I am not a biological expert, but, I have never seen such formations in other parts of the body, so I was a little curious about how they do create",
        "created_utc": 1678879657,
        "upvote_ratio": 1.0
    },
    {
        "title": "what branch of scientists do you think are most likely to be religious and why?",
        "author": "According-Salary3149",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rqgp4/what_branch_of_scientists_do_you_think_are_most/",
        "text": "",
        "created_utc": 1678869497,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a warp engine was feasible, wouldn't we expect to see evidence of its use by aliens in form of gravity waves or energy bursts?",
        "author": "ScaleBananaz",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rptc8/if_a_warp_engine_was_feasible_wouldnt_we_expect/",
        "text": "",
        "created_utc": 1678867233,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between actual passing speed of time and human time perception?One hour can feel short and long base on our activity,but in reality how slow or fast does an hour or a second passing?",
        "author": "PrestigiousClient655",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rmo2r/what_is_the_difference_between_actual_passing/",
        "text": "\n\n Since we perceive time how slow or fast completely base on emotions and memory, few hours feel like only half an hour when having fun, but when we bored for half an hour feel like few hours.So in reality how fast or how slow does an hour or maybe even a second passing? Because so many chemical reactions in atomic size can happen in just under a second.",
        "created_utc": 1678856517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we have measures for Speed through space but not Speed through time?",
        "author": "That_Car_Dude_Aus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rm8kb/why_do_we_have_measures_for_speed_through_space/",
        "text": "So we have measure such as km/h or m/s.\n\nBut given that the faster that you go in space, the slower you move in time.\n\nShouldn't that mean you also have a speed through time?\n\nAs you go faster in space, you go slower through time.",
        "created_utc": 1678855160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the Brain Process 2 Completely Different Images from the Left and Right eyes (via 3D lenses)?",
        "author": "MrMcdillard",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rltj2/can_the_brain_process_2_completely_different/",
        "text": "Regarding Eye Dominance, Brain Visual Processing, &amp; 3D Tech:\n\nI was thinking about the brain’s ability to instantaneously stitch 2 images together (left eye + right eye) and interpret that info it into a single image instead of a blurry mess— even though you are literally seeing  two separate images at any given time— which led me to eye dominance. \n\nIf you’re right eye dominant, you’re really only paying attention to the perspective of the right eye at any given time, but the left eye is still being used to provide information and depth perception.\n\nFinally (my question): Considering 3D technology in film/TV is also showing two different images at once to our left and right eyes) what would happen if the screen (or lenses) showed two completely different images or movies to each eye?\n\nWould we only notice a 2D image from our dominant eye? Would the dominant image be distorted or obscured by the image being shown to the other eye? Would it just be a mess of information?\n\nWhat if the 2 videos/images were similar but altered in more subtle ways to play with depth or passage of time or other visual effects? \n\nAnd more cynically, what if your non-dominant eye is fed more subtle, subliminal images/information? \n\nI can’t help but assume this has been tested, but I can’t find any info anywhere. Thanks!",
        "created_utc": 1678853882,
        "upvote_ratio": 1.0
    },
    {
        "title": "What ancient technology has been lost and hasn't been rediscovered (yet)?",
        "author": "Night_Runner",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11rkyzd/what_ancient_technology_has_been_lost_and_hasnt/",
        "text": "I'm reading the excellent \"How to invent everything: a survival guide for the stranded time traveler\" by Ryan North, and one of the recurring themes is how often some useful technology got forgotten, then rediscovered, then forgotten again, etc. For example, he claims the whole citrus-scurvy cure got independently discovered (and forgotten) at least 7 different times\n\nRoman concrete technology became lost for about a thousand years. Primitive Roman female-inserted contraception barriers became lost technology for a millennium as well. The concept of molds as antibacterial medicine was rediscovered time and again since the 1600s, and before that, molds were used for wound treatment in ancient India, Greece, China, the Americas, and Egypt around 3000 BCE. (Granted, they didn't have the scientific method, they only knew the stuff worked somehow.)\n\nGiven all this, I think there are 3 types of lost technology: things we know we don't know (like the Greek Fire - it existed, but it definitely wasn't like our napalm), things we suspect we don't know (like the engineering hacks Egyptians used to build pyramids, or the way some prehistoric megastructures were constructed, etc), and completely lost knowledge aka things we don't know we don't know. Maybe some prehistoric cavemen discovered the ultimate meditation method; maybe some very precise skull surgery could induce highly unusual mental states; maybe an extremely specific biochemical compound could turn average men into unstoppable killing machines (like Viking raiders but more so) to the point where modern militaries can't even match it. \n\nBarring time travel, we'll probably never learn about that totally-forgotten lost technology, but what about the first two types? What ancient technology have we not rediscovered? Or strongly suspect it existed but we haven't been able to reproduce? :)",
        "created_utc": 1678851441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it that some people have no reaction to opiods or corticosteroids?",
        "author": "hereizabraincell",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11radx4/why_is_it_that_some_people_have_no_reaction_to/",
        "text": "Throughout the years, my family has dealt with a lot of medical issues. They have all taken steroid pills like medrol ,and opiods like codeine and tramadol. Most of them are fine with them, but some get really bad side effects. The weird thing is, im currently suffering from hernias, and so far ive been given nsaids, opiods and medrol. They all did nothing  for my pain. The opiods actually caused my heart to beat super fast, instead of calming me down. The corticosteroids did absolutely nothing, and it was a high dose. I also have broken fingers, and they didnt help for that pain either, so its not that they didnt work for the neck. But for nothing. its like i never took the drugs. What is the reason for this? Is it dna related? Is it the metabolism? Its really a bad thing to have, cos nothing helps with the pain, but im very curious as to why those heavy drugs do not have any effect on me.",
        "created_utc": 1678810291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the reward system the only thing that drives human behavior?",
        "author": "onelaughterplease",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ra6k4/is_the_reward_system_the_only_thing_that_drives/",
        "text": "I recently read this article that states this: \n\n\"Two things drive human actions: necessities — food, sleep, avoidance of pain; and rewards. Any object, event, or activity can be a reward if it motivates us, causes us to learn, or elicits pleasurable feelings. But how do our brains compute the value of a reward and how is that translated into action? The answer lies in the brain circuitry known as the “reward system.”\"\n\nhttps://www.brainfacts.org/thinking-sensing-and-behaving/learning-and-memory/2018/motivation-why-you-do-the-things-you-do-082818\n\nIs this a simplistic way of conceptualizing human motivation, and are there ways in which humans behave that are independent of rewards, fulfilling needs and avoiding pain? \n\n(Also side question, but if what the article states is true would this mean that the philosophy of psychological egoism, the belief that all humans act in their own self interest whether consciously or not, is correct?)",
        "created_utc": 1678809857,
        "upvote_ratio": 1.0
    },
    {
        "title": "A few questions about examining drop offs in starlight (by spectroscopy) to identify elements in stars and to gauge expansion of universe",
        "author": "OpenPlex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11r5vkj/a_few_questions_about_examining_drop_offs_in/",
        "text": "Starting at 2:07 in [this video](https://youtu.be/hmkyF1tNFc4&amp;t=127) (by Dr Becky) is a great explanation of how spectroscopy works in starlight. \n\nI'm confused about some parts and wanna confirm what they mean. \n\nSo it seems that an electron in hydrogen will absorb some light of a certain wavelength, and we spot that as a drop off in the that part of light. \n\n1) Does that make the electron leave the atom, and an ion remains? \n\nI had thought it would instead only excite the electron, and it'd go back to normal by emitting light. But Dr Becky made it sound like the electron had entirely escaped the atom leaving only an ion. \n\n2) For identifying what a star is made of, is the light from the core unreliable? \n\nShe made it sound like the drop off in light that identifies atoms would happen only in the star's atmosphere. But then I fail to see how we know what's at the star's core then. \n\n3) If the light had passed multiple types of atoms, would any of their separate drop offs overlap in the light, or does each type of atom leave a clearly unique drop off? \n\n4) Does a hotter star cause more drop offs or fewer? \n\nWas hard for me to tell which she had meant. \n\n5) For identifying atoms, how can we tell if the drop off had happened in the star itself or if the drop off had instead happened outside the star somewhere along the way to here?",
        "created_utc": 1678799895,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think will the future of plastics be?",
        "author": "OrcaConnoisseur",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11r4qiq/what_do_you_think_will_the_future_of_plastics_be/",
        "text": "Plastic is notoriously unsustainable not only because it is made by using petroleum but also because lots of it lands in the ocean where it gets eaten by fish who in turn get eaten by us. It can take ages for it to biodegrade and even then it is only getting turned into micro- and even nanoplastics. For me it seems inevitable that we're going to do something against plastics in the near future but what exactly I don't know.\n\nI've read about biodegradable plastics made out of algae being researched and styrofoam from mycelium being made.\n\nBut another solution could be to just keep track of all the plastics we're producing and feed them to plastic eating larvae/bacteria for recycling.\n\nWhat do you think is the future of plastics? Will we be able to successfully replace all plastics with biodegradable alternatives?\n\nAlso, do plastics made from algae/biodegradable plastics in general still have PFAS in them?",
        "created_utc": 1678796746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speculating Citizen Scientist has idea: 9 Dimensions- Dark Matter Hypothesis",
        "author": "TheWindUpBirdMan4",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11qzoqh/speculating_citizen_scientist_has_idea_9/",
        "text": "[removed]",
        "created_utc": 1678778810,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there people who born without a tongue or lost their tongue completely? and did it effected their teeth?",
        "author": "Aviv352",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11qnyhf/are_there_people_who_born_without_a_tongue_or/",
        "text": "Im trying to find out if it ever happened that someone ever born or lost their tongue completely unfortunately, and did it effected their teeth?",
        "created_utc": 1678746294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is meat an essential source of nutrients for our diets?",
        "author": "TryMe100timesss",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11qm3kh/is_meat_an_essential_source_of_nutrients_for_our/",
        "text": "",
        "created_utc": 1678742324,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would a place with no gravity and no velocity be like? Yes, it's impossible, but hypothetically, if you could do it, what would it do to things like time dialation?",
        "author": "CTH2004",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11qgdsl/what_would_a_place_with_no_gravity_and_no/",
        "text": "First off, this is a *thought experiment*. Such a scenario isn't possible with our understanding but is possible to think on.\n\nI asked in r/physics, but I was basically called an idiot because such a thing isn't possible. So, I'm asking here. Maybe here I will be treated as a human.\n\n&amp;#x200B;\n\nSo, here's the concept. We have a box. It is moving 0 m/s. Not 0 m/s *realitive too* something, but where litterally, if you accelerate in any direction, you have to increase your velocity by exactly c to reach the speed of light. There is no velocity here.\n\nNow, then we have no gravity. Absolutley none. Somehow even the incomprehinsibly weak gravitational field of other galixies at this range have been disabled.\n\nThis chamber therefore has absolutley no time dialiation, either velocity-based or gravity based.\n\nIN said chamber, here are some questions:\n\n1. how much faster/ slower is time than on earth?\n2. how much faster/ slower is time than when we calculate it with the Cosmic Microwave Background (CMB)?\n3. How much faster/ slower is the expations compared to calculating it with the CMB?\n4. how old/ young is the universe compared to calculating it with the CMB?\n5. how is the CMB different than when measured on earth?\n\n&amp;#x200B;\n\ncan any of those be calculated (or guesed in the case of 5), or would we need such a chamber to do said math?\n\nand, for the ones that are calculateable, could you show how?\n\nThanks!",
        "created_utc": 1678729811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isotropic Antenna",
        "author": "Significant_Rush_653",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11qceha/isotropic_antenna/",
        "text": "I understand that an Isotropic Antenna is theoretical at best, but has anyone tried making a moving antenna that spins or moves in a way that would allow for for equal omnidirectional coverage? Or do radio waves decay slow enough that by the time the antenna passes the same space again and again it would be over saturated?",
        "created_utc": 1678720498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why many mammals have very light, almost white fur around the anus?",
        "author": "Everything_Is_Koan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11q78vh/why_many_mammals_have_very_light_almost_white_fur/",
        "text": "For example, many dogs have a human shaped spot on their behind, but what perplexes me the most is the very white coloration of fur on the behind of deer and other herbivores. One would suspect they want to stay undetected, but white makes them very clearly visible.",
        "created_utc": 1678707344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a Sean Raymond-style co-orbital system of stars work?",
        "author": "JohnWarrenDailey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pz0f8/can_a_sean_raymondstyle_coorbital_system_of_stars/",
        "text": "For clarification, astrophysicist Sean Raymond has made a name of himself in the blog \"Planetplanet\" by imagining multiple times the possibility of solar systems in which planets share the same orbits from their suns.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[The Ultimate Engineered Solar System](https://planetplanet.net/2017/05/03/the-ultimate-engineered-solar-system/)\n\n[The Ultimate Retrograde Solar System](https://planetplanet.net/2017/05/01/the-ultimate-retrograde-solar-system/)\n\n[The Million Earth Solar System](https://planetplanet.net/2018/06/01/the-million-earth-solar-system/)\n\n&amp;#x200B;\n\nThe list continues on from here.  But the question is:  Can this same sort of organization, naturally or artificially, also apply to stars?  Specifically:  A four ring orbit (inner prograde, inner retrograde, outer prograde and outer retrograde) of stars (specifically, K5 orange-dwarf stars, which are 74% as wide, 69% as massive and only 16% as bright as our sun and projected to have a lifespan of 34 billion years).",
        "created_utc": 1678678608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would an obese human have meat similar to Wagyu?",
        "author": "Turbulent_Aioli854",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pw0l0/would_an_obese_human_have_meat_similar_to_wagyu/",
        "text": "I just watched a video on [Wagyu being cooked at a Japanese restaurant](https://www.reddit.com/r/interestingasfuck/comments/11ponkh/how_wagyu_beef_is_cooked_at_a_japanese_restaurant/?utm_source=share&amp;utm_medium=web2x&amp;context=3). It has a lot of fat.\n\nConsidering that obesity in humans is often linked to lack of physical activity, would the flesh of an obese person have fat intertwined with their meat like in Wagyu? Or will the fat be a separate layer like in pork?",
        "created_utc": 1678670375,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think of MDPI? Is it a predatory Journal?",
        "author": "Quirky-Entertainer57",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pvfi7/what_do_you_think_of_mdpi_is_it_a_predatory/",
        "text": "",
        "created_utc": 1678668844,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do summer undergraduate research interns actually do?",
        "author": "Better_Lab9869",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pumi6/what_do_summer_undergraduate_research_interns/",
        "text": "I gather that there is some level of working as an assistant to a professor as well as working independently on a personal research project, but I am not sure about the details, and I'd appreciate the info from someone who has been involved in one of these in some way before",
        "created_utc": 1678666688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a tourniquet be enough for a missing arm?",
        "author": "Jordankelly69420",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pql7z/would_a_tourniquet_be_enough_for_a_missing_arm/",
        "text": "Writing a novel and a character has their arm cut off at the shoulder. They cauterise it but it opens up a second time, would a Tourniquet be enough for a such a large wound?",
        "created_utc": 1678656912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navigation through outer space",
        "author": "Pipepro96",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pocgd/navigation_through_outer_space/",
        "text": "How? I guess would be my general question. We travel over earth using a magnetic compass or a gyro compass. We can travel to a specific spot through GPS. How do we travel through space and know where we are going. Please help, it affects my sleep.",
        "created_utc": 1678651612,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if you filled one of the Moon's craters with water?",
        "author": "dmomo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pnfcr/what_would_happen_if_you_filled_one_of_the_moons/",
        "text": "",
        "created_utc": 1678649443,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you explain what 'discourse' in linguistics is to a non-specialist?",
        "author": "fightmegnomech",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pn901/how_do_you_explain_what_discourse_in_linguistics/",
        "text": "[removed]",
        "created_utc": 1678649037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn't science seek to understand the limits of the mind before using it to explain reality?",
        "author": "BallKey7607",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pkl7s/why_doesnt_science_seek_to_understand_the_limits/",
        "text": "We practice science and see the universe through the lens of our mind and thefore everything we find has to fall in line with the nature of our minds. If you had a telescope you would want to know the nature of the lens before you started making assumptions about the nature of the objects you were looking at. Does the lens tint everything a certain colour? Only let in certain wavelengths of light? Magnify? Magnify certain wavelengths but not others? Our minds are a significantly more complex lens so there could be much more complex limitations and distortions going on so why doesn't science spend more time trying to understand what they are before assuming that whatever science is done through the lens of the mind can be taken to be a fair reflection on reality?",
        "created_utc": 1678642879,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you experience enhanced cognitive function after taking armodafinil (which has been found to have little to no effect on non-sleep-deprived people), would it be prudent to assume you're suffering from sleep deprivation?",
        "author": "BigBootyBear",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pjuhv/if_you_experience_enhanced_cognitive_function/",
        "text": "I know that \"you are a sample size of n=1\" so its sketchy to interpret our individual experiences based on what we read in the literature. However, is there any merit to making such conclusions? \n\nLike I've said in the title, modafinil has little to no effect of cognitive enhancement on non-sleep-deprived patients. This suggests it's positive effect is not so much a nootropic as it is a neutralizer of bad health. So if you take it and you experience cognitive enhancement, is it sound to assume you're suffering from sleep deprivation (considering you are not also narcoleptic)?",
        "created_utc": 1678641146,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the origin of the lymphatic system? When and how did it evolve? What is the most basal group of animals that have it?",
        "author": "Global_Lavishness_88",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pilz6/what_is_the_origin_of_the_lymphatic_system_when/",
        "text": "",
        "created_utc": 1678638268,
        "upvote_ratio": 1.0
    },
    {
        "title": "If ketosis only occurs after extended low/no carb intake, and ketosis is the mechanism for turning fat to energy, where does energy come from in a calorie deficit but not in ketosis?",
        "author": "tylerchu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pi48g/if_ketosis_only_occurs_after_extended_lowno_carb/",
        "text": "Is it then muscle tissue? That can’t possibly be right though if a person is still active enough to keep muscle from wasting?",
        "created_utc": 1678637099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding the hypothetical features of a life-supporting rogue planet",
        "author": "ygrasdil",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pgtvt/understanding_the_hypothetical_features_of_a/",
        "text": "[removed]",
        "created_utc": 1678633927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it inevitable that the universe will die and Life/civilization along with it is also going to be extinct forever permanently?",
        "author": "000genshin000",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pfji1/is_it_inevitable_that_the_universe_will_die_and/",
        "text": "[Title]",
        "created_utc": 1678630555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would Allan Turing pass chatGPT in a Turing test if chatGPT was learned to identify as a human instead of an AI?",
        "author": "Letholdrus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pbddm/would_allan_turing_pass_chatgpt_in_a_turing_test/",
        "text": "If we could travel back in time and present Turing with a terminal connected to chatGPT, without Turing knowing anything else about computers or the future, would he pass chatGPT in a Turing test as it is now?",
        "created_utc": 1678617028,
        "upvote_ratio": 1.0
    },
    {
        "title": "If one were to cut their finger, put the wound in their mouth, and blow, could one give themselves an embolism?",
        "author": "Deribus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11pa28k/if_one_were_to_cut_their_finger_put_the_wound_in/",
        "text": "",
        "created_utc": 1678612261,
        "upvote_ratio": 1.0
    },
    {
        "title": "if I built a space that is hermetically sealed, can I suck the air out into space?",
        "author": "CurrentPenalty8916",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11p7ex4/if_i_built_a_space_that_is_hermetically_sealed/",
        "text": "so, if I have a huge area say a tunnel 127 miles long that I want to be a vacuum could I theoretically build a structure up to space and let the vacuum up there suck the air out?",
        "created_utc": 1678602411,
        "upvote_ratio": 1.0
    },
    {
        "title": "If building a 'generation' ship was possible now, what would the interior design realistically look like considering cost of carrying more weight into/out of atmosphere and gravity wells.",
        "author": "Weekly-Rabbit-3108",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11p2nlc/if_building_a_generation_ship_was_possible_now/",
        "text": "More specifically, in hard sci-fi - pop culture tends to imagine 'maintenance corridors' or shafts for HVAC, plumbing and electrical for Generation Ships or Colony Ships. But considering the cost of carrying more weight into and out of planets' gravity wells and atmosphere, I can't imagine 'maintenance corridors' would be practical or efficient. \n\n1. Would the design of HVAC, electrical and plumbing on a Generation Ship look relatively exposed kind of like the ISS? Or would there indeed need to be corridors or sectioned off spaces for HVAC, Electrical, and plumbing?\n2.  If like the ISS, wouldn't that have a psychological impact on the passengers considering not being 'aesthetically pleasing' especially for a long term voyage? Or if designed with corridors and sectioned off spaces, how do you justify using extra 'material' just to build hidden spaces from view considering the extra resource costs like manufacturing, construction, fuel/energy cost due to weight?\n\nBasically what would the interiors look like for these crucially important QoL and Life Support systems look like in a realistically designed Generation ship or Colony ship?",
        "created_utc": 1678587955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it inevitable that the universe will and life/civilization along with it is going to be permanently extinct forever?",
        "author": "000genshin000",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ouu2y/is_it_inevitable_that_the_universe_will_and/",
        "text": "[Title]",
        "created_utc": 1678568104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Private Lab for Unknown Poisons Testing",
        "author": "Hour-Necessary-2149",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11osqoa/private_lab_for_unknown_poisons_testing/",
        "text": "[removed]",
        "created_utc": 1678562936,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the happen if all genetically female humans suddenly died?",
        "author": "alikander99",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11oskqk/what_would_the_happen_if_all_genetically_female/",
        "text": "This is a purely hypothetical question and I mean no disrespect to anyone.\n   \nWhat if all genetically female humans suddenly and inexplicable died? \n\nA quick Google search tells me that roughly corresponds to 49.6% of the global population. This would be a catastrophe of inimaginable proportions. What's left of humanity would be riddled with a metric ton of problems.\n\nI'm however interested in questions especifically related to reproduction, so this question goes to medical scientists.\n\n1) Would It be posible, with current technology, to conceive a new human in such a situation?",
        "created_utc": 1678562538,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the medical response be if all women suddenly died?",
        "author": "alikander99",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11orei9/what_would_the_medical_response_be_if_all_women/",
        "text": "Ok, so this is a hypothetical, It's for a story, just curiosity I swear. What would happen if all women suddenly died? in this apocalypse what would medical science have to offer? Would It be scientifically feasible to continue the human species?\n   \nFrom this point onwards I'll be abandoning the concept of morality, given that what follows has no moral basis **at all**.  Here are some questions:\n   \nIS It posible to harvest eggs post mortem? For how long?What methods are there? What's the viability of said eggs?\n  \nIS conception in an artificial womb posible? If not, \nWhat research would be done?",
        "created_utc": 1678559732,
        "upvote_ratio": 1.0
    },
    {
        "title": "When will i see the moon \"flip\", when moving from North to South pole?",
        "author": "PeeOnChurchillsGrave",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11oqw4o/when_will_i_see_the_moon_flip_when_moving_from/",
        "text": "Say i start at North pole. the features of the moon are what i see.\n\nnow i keep moving to the south pole. \n\nAt what point does the features of the moon \"flip\"? \n\nWhat do i see from the equator? What do i DO and DONT see from the equator that i CAN and CANNOT see from the poles?",
        "created_utc": 1678558492,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are non-pathogen-related sources of inflammation? (I removed a part that had to do with medical advice; I'm not requesting medical advice.)",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11onwuq/what_are_nonpathogenrelated_sources_of/",
        "text": "I've always assumed that my own brain is constantly being inflamed because of stress. It's only when a certain medication (guanfacine) is working in fact that I feel calm and quiet and then recognize just how stressed and noisy my default state is. So I've always imagined that my PFC (the front part of the brain) is under constant bombardment.\n\nI talked to someone who said that this \"NAC\" drug (https://medicine.yale.edu/news-article/potential-new-treatment-for-brain-fog-in-long-covid-patients/) isn't likely to be useful for many ADHD patients because it's relevant in a context where the person had an illness (like Covid) that caused inflammation in their brain. I'm very curious about inflammation, though. See here: https://en.wikipedia.org/wiki/Allostatic_load. And see here:\n\nhttps://www.nature.com/articles/s41398-022-02122-6\n\n&gt;Energy dysregulation has been recognized as a core deficit in BD along several lines of evidence. At the macroscopic level, significant shifts in circadian rhythm, rest, and activity strongly indicate a dysregulation of energy generation and expenditure [3, 4]. At the microscopic level, growing evidence for mitochondrial dysfunction indicates disruption of energy production in the cell [5]. Concurrently, metabolic dysfunction characterized by insulin resistance (IR) and abnormal glucose metabolism are becoming increasingly recognized as important in the pathophysiology of bipolar disorder [6, 7]. Significant dietary and lifestyle changes over the past century have led to increased allostatic load on human physiology and a global epidemic of metabolic syndrome.\n\n&gt;...\n\n&gt;The significant acceleration in the increase in burden of disease from BD in recent decades may require an explanation which extends beyond genetic causes and takes into account increasing allostatic load from environmental stressors [83]. Significant shifts in behavior related to diet and physical activity over the past 100 years have led to a global epidemic of insulin resistance-related conditions [84]. The effects on peripheral tissues of the body are apparent with increasing prevalence of metabolic syndrome and type 2 diabetes. However, the effects of insulin resistance as a chronic stressor on the brain and central nervous system are only beginning to be understood.\n\nI guess my questions would be: \n\n- What are all the top sources of inflammation (other than the sources related to pathogens like Covid)? \n\n- Is my understanding correct that someone who's never gotten sick (from a pathogen) except for getting a cold here and there could nevertheless have a high level of chronic inflammation in their brain that might have something to do with their ADHD? \n\n- How do you find out how inflamed your body and brain are?",
        "created_utc": 1678551033,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are non-pathogen-related sources of inflammation?",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11olffx/what_are_nonpathogenrelated_sources_of/",
        "text": "I've always assumed that my own brain is constantly being inflamed because of stress. It's only when a certain medication (guanfacine) is working in fact that I feel calm and quiet and then recognize just how stressed and noisy my default state is. So I've always imagined that my PFC (the front part of the brain) is under constant bombardment.\n\nI talked to someone who said that this \"NAC\" drug (https://medicine.yale.edu/news-article/potential-new-treatment-for-brain-fog-in-long-covid-patients/) isn't likely to be useful for many ADHD patients because it's relevant in a context where the person had an illness (like Covid) that caused inflammation in their brain. I'm very curious about inflammation, though. See here: https://en.wikipedia.org/wiki/Allostatic_load. And see here:\n\nhttps://www.nature.com/articles/s41398-022-02122-6\n\n&gt;Energy dysregulation has been recognized as a core deficit in BD along several lines of evidence. At the macroscopic level, significant shifts in circadian rhythm, rest, and activity strongly indicate a dysregulation of energy generation and expenditure [3, 4]. At the microscopic level, growing evidence for mitochondrial dysfunction indicates disruption of energy production in the cell [5]. Concurrently, metabolic dysfunction characterized by insulin resistance (IR) and abnormal glucose metabolism are becoming increasingly recognized as important in the pathophysiology of bipolar disorder [6, 7]. Significant dietary and lifestyle changes over the past century have led to increased allostatic load on human physiology and a global epidemic of metabolic syndrome.\n\n&gt;...\n\n&gt;The significant acceleration in the increase in burden of disease from BD in recent decades may require an explanation which extends beyond genetic causes and takes into account increasing allostatic load from environmental stressors [83]. Significant shifts in behavior related to diet and physical activity over the past 100 years have led to a global epidemic of insulin resistance-related conditions [84]. The effects on peripheral tissues of the body are apparent with increasing prevalence of metabolic syndrome and type 2 diabetes. However, the effects of insulin resistance as a chronic stressor on the brain and central nervous system are only beginning to be understood.\n\nI wonder what all the top sources of inflammation are (other than the sources related to pathogens like Covid). How do you find out how inflamed your body and brain are? How do you construct some sort of \"action plan\" in order to minimize inflammation in your brain and body if indeed it's a problem for you?",
        "created_utc": 1678544618,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible UFO's use a sort of Laidenfrost effect to travel at such high speed?",
        "author": "Neckzilla",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ohq29/is_it_possible_ufos_use_a_sort_of_laidenfrost/",
        "text": "Alright sit back and relax. (I'm not a UFO nut just something I thought of a while ago, never saw anything on google.)\n\nI was thinking about this for a while, years even. \n\nUFO's seem to not be bothered by water or air resistance. Which reminded me of how droplets behave on a hot surface. There's much less friction on the liquid droplet on hot surface.\n\nis it possible that the UFO's are super cooled OR superheated to the point where water and even air molecules can't come in contact with the object because they're instantly vaporized in a constant layer that forms around the object?\n\nIf I remember right, [UFO's are even shaped like a droplet on a hot surface](https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Leidenfrost_droplet.svg/1920px-Leidenfrost_droplet.svg.png)\n\nObviously I'm no scientist obviously but that *could* explain how UFOs are able to \"enter and leave\" the ocean in such high velocity without being affected. \n\nalso if you're not rolling your eyes by now this clip will certainly do it..\n\n[tucker carlson](https://youtu.be/kAaFEOCHE4I?t=4609) mentions a heat signature coming from the object. and the heat was coming only from the bottom of the object\n\nmuch like how the diagram shows vapor coming off the bottom of the liquid which keeps it suspended.\n\nI guess this is what leads me to believe the UFO would have to be super chilled so that all other temperatures appear extreme in comparison and could boil off vapor like liquid nitrogen. \n\n\nThat's all I can really remember off the top of my head. basically this only explains in-atmosphere travel. the rest is out of my head.\n\nnow tell me how wrong I am.",
        "created_utc": 1678533684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any chance that Life in the universe will sustain forever? Or a new universe can spawn after heat death? although heat death/big freeze theory States universe will be an empty space devoid of life forever permanently with no activity.",
        "author": "000genshin000",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11of4e1/is_there_any_chance_that_life_in_the_universe/",
        "text": "What about life being permanently sustainable in the universe??\n\nCan life be sustainable after heat death/big freeze of the universe?",
        "created_utc": 1678524337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be beneficial if we humans evolved ball-and-socket joints between each and every one of our 33 vertebrae?",
        "author": "JohnWarrenDailey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11oc43r/would_it_be_beneficial_if_we_humans_evolved/",
        "text": "",
        "created_utc": 1678513679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could an AI be developed to create movie reviews à la Roger Ebert?",
        "author": "imtherealmellowone",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o8tsk/could_an_ai_be_developed_to_create_movie_reviews/",
        "text": "I’ll often find a review for a current movie attributed to RogerEbert.com which is clearly just written by a staff reviewer. Couldn’t a databases be created using all of Ebert’s actual reviews during the course of his career, that captures the nuances of each review and somehow quantizes them?  That way reviews of current films could be generated which closely reflect how Ebert might actually have reviewed those movies. \n\nOr is ChatGPT already capable of this?",
        "created_utc": 1678503188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that research published in renowned scientific journals can often not be trusted?",
        "author": "Terradubia",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o4piu/is_it_true_that_research_published_in_renowned/",
        "text": "Is it true that a lot of results from scientific studies published in journals can often not be replicated, also known as the replication crisis? That this undermines the credibility of scientific studies in fields such as psychology and medicine?",
        "created_utc": 1678491761,
        "upvote_ratio": 1.0
    },
    {
        "title": "What systems/tools are you using to organise your research/knowledge?",
        "author": "Szedu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o300x/what_systemstools_are_you_using_to_organise_your/",
        "text": "",
        "created_utc": 1678487500,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is it possible to test a psychiatric drug against placebo?",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o2h0z/how_is_it_possible_to_test_a_psychiatric_drug/",
        "text": "Suppose someone gives you a pill (it's a clinical trial) and you take it. Won't you know if the pill is acting on your brain? I personally have taken probably over 30 (I guess?) psychiatric drugs in my life and I can feel that the drug is doing something when I take it. So if I felt nothing then that would be a dead giveaway to me that I received a placebo.",
        "created_utc": 1678486245,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard that our ears are what make us breathe and hearing damage is a cause of sudden death. Is this true?",
        "author": "throwaway23432432342",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o22d3/i_heard_that_our_ears_are_what_make_us_breathe/",
        "text": " \n\nRemember seeing a group of scientists like fifteen years ago come up with the idea that hearing damage is a cause of sudden death because the sound detecting cells inside the cochlea are (quote) ''chemoreceptors'' (special cells which allow us to breathe automatically). They noticed that several people who suddenly died had a history of hearing loss in one ear. These scientists then did studies on mice which proved their hypothesis. In subsequent press releases where they were interviewed, they said that hearing damage is a cause of sudden death. The only literature I could find on ear sound cells making us breathe is from the same group of scientists and it seems like the only thing this group of scientists has ever published is stuff about hearing damage causing sudden death because our ears are somehow important for breathing.\n\nA meta study done a few years ago (by a different group of scientists) says there is no association between hearing damage and sudden death. Wikipedia says that the sound detecting cells inside the ears are mechanoreceptors. It didn't say anything about them being chemoreceptors so I'm sorta confused.",
        "created_utc": 1678485289,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a nuke exploded right next to you, could forensic teams find any remains at all?",
        "author": "zaxqs",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o1s37/if_a_nuke_exploded_right_next_to_you_could/",
        "text": "How total would the destruction of your body be? What would be the largest remaining piece of your corpse? How far away from a typical nuke would you have to be before there would be any visible remains to find?",
        "created_utc": 1678484594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a mechanical reason we don't just use the Ocean Current for Energy around the USA? Or is it purely a logistics/political issue?",
        "author": "RockBandDood",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11o0ah1/is_there_a_mechanical_reason_we_dont_just_use_the/",
        "text": "So, from the perspective of North America and South America, we have currents on both coasts, east and west.  Asia and Europe are a bit more limited in this regard.\n\nJust for a quick look, here is where the currents are around the world\n\n[https://upload.wikimedia.org/wikipedia/commons/9/9b/Corrientes-oceanicas.png](https://upload.wikimedia.org/wikipedia/commons/9/9b/Corrientes-oceanicas.png)\n\nSo, just speaking for the East Coast, the Gulf Stream varies from 4 mph to 5.6 mph.  \n\nThese currents are not hundreds and hundreds of miles from our coast, depending on circumstances they can be 10-15 miles out, up to around 150 miles out.  \n\nSo, the Ocean currents, while not man made obviously, are effectively a Perpetual Motion Machine.  They are there constant, their locations and speed have variables, but this is not going to go away unless something catastrophic happens.\n\nWater weighs a lot, the energy output should be exponential compared to Windmills. \n\nWe built the first Transatlantic Cables from North America to Europe (I think Portugal) in the 1800s.  This cable connected the two continents and was about 2200 miles long - And built in the 1800s. \n\nSo - we have the currents, a constant motion, with a heavy weight; Water.  That will come and go with some variables, we'd have to build it with that in mind, and oversee it daily to 'follow' the current that a particular Turbine is supposed to harvest power from.\n\nWe could easily create cables that go from these currents and turbines and connect them to coastal grids, effectively making energy cost nothing; outside of production of it and maintenance; and of course, military support defending them with submarines up and down the coast lines.  \n\nI know Wind Mills have been hugely successful in some, smaller countries.  I doubt we will ever be able to supply enough Wind Power for the whole of North America.  \n\nIs this even part of the discussion in terms of Energy Independence?  Is there any reason for it to be impossible to do?  We could effectively power the entire East and West coasts, along with states further in, with a constant, unrelenting and predictable force.   States in the center of the North America would likely need to continue building up Wind Turbines; but those also happen to be the least populated States, so we may see success with that like we do in Europe's smaller countries.\n\nSo, I was just wondering - is there any reason this can't be done?  If it can be done; why have I not seen anyone discussing this strategy to get us off oil and natural gas and energy being -free-, after the construction?\n\nThanks for your time.",
        "created_utc": 1678481033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should humanities goal be to leave Earth and colonize other planets before an extinction level event?",
        "author": "BluThunderboltz",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11nzg9f/should_humanities_goal_be_to_leave_earth_and/",
        "text": "I know eventually the sun will swallow Earth, do scientists ever think about this? Even though its a billion years away.",
        "created_utc": 1678479066,
        "upvote_ratio": 1.0
    },
    {
        "title": "The PVC vinyl (records) are made of is apparently toxic, and vinyl contains lead that this dangerous for the human brain? Is this true?",
        "author": "TheBlev6969",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11nxpjy/the_pvc_vinyl_records_are_made_of_is_apparently/",
        "text": " I saw a 15 minute video on YouTube discussing the danger of vinyl. I don’t really care about the environmental effects, because everything contains plastic, and having records isn’t going to change that, I’m more concerned about the health effects. Lead is unbelievably dangerous, and apparently PVC is bad too! I care about my health, and even have an air purifier on 24/7 in the same room as my vinyl (for dust), but I don’t know if I can keep my collection (something I deeply care about), if there’s fucking lead fumes in the same room I sleep in. Someone please enlighten me and tell me this is all bs, or don’t, I’d rather the truth .",
        "created_utc": 1678475021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a laser be developed that created a beam of magnetism instead of light? I assume not, but please explain the differences and why.",
        "author": "bigbabytdot",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11nt7nz/could_a_laser_be_developed_that_created_a_beam_of/",
        "text": "I know magnetism and light are two entirely different things, but light is a wave in the electromagnetic spectrum. Do lasers generate a magnetic field? If so, how strong is it? And would you be able to increase the magnetic properties of such a laser while keeping it relatively inconsequential in terms of traditional laser power and damage?",
        "created_utc": 1678464619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could an intelligent species like us that evolved on a planet with no fossil fuels have a realistic chance of becoming spacefaring? What would their industrial/technological revolution look like compared to ours?",
        "author": "Nw5gooner",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11npty9/could_an_intelligent_species_like_us_that_evolved/",
        "text": "",
        "created_utc": 1678456427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can high enough blood pressure break through cauterised flesh?",
        "author": "Bobster76865",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11nmwkx/can_high_enough_blood_pressure_break_through/",
        "text": "I’m writing a novel in which a character loses and arm at the shoulder and it is cauterised (I know that this may be a jump but it’s too cool to not include). However this girl injects herself with a double dose of a fictional drug that is known to skyrocket blood pressure. \nSo to get to my question, could high enough blood pressure cause blood to break through the cauterised flesh leading to a geyser of blood erupting out through her stump?",
        "created_utc": 1678448678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to store more energy than something can contain? Will we ever be able to store a giant battery, a battery the size of a a cars worth of energy into a regular normal sized battery?",
        "author": "ryderofthestorm",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11nlcpp/is_it_possible_to_store_more_energy_than/",
        "text": "Is it possible to store more energy than something can contain? Will we ever be able to store a giant battery, a battery the size of a a cars worth of energy into a regular normal sized battery?",
        "created_utc": 1678443756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Solar fuels replace fossil fuels ?",
        "author": "General_Riju",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11njqxo/can_solar_fuels_replace_fossil_fuels/",
        "text": "Will Solar fuels produced by companies like [Synhelion](https://synhelion.com/) replace fossil fuels in the near future ?",
        "created_utc": 1678438390,
        "upvote_ratio": 0.99
    },
    {
        "title": "Is there any evidence not being superstitious is related to antisocial tendencies?",
        "author": "William_Wisenheimer",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ni670/is_there_any_evidence_not_being_superstitious_is/",
        "text": "I ask because I was wondering if someone is not interested in a common but logically unsound belief that most others in their community believe, it might be correlated with such a person not being closely knit with the rest of the communities' cares and value systems.",
        "created_utc": 1678433070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can astronauts on the ISS bring handheld gaming systems as personal items?",
        "author": "CIsForCorn",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11nh7hd/can_astronauts_on_the_iss_bring_handheld_gaming/",
        "text": "Was redirected to this subreddit from r/AskScience, totally understandable but the curiosity remains. As a personal item could an astronaut bring a Switch or a Steam Deck loaded with games on an SD as a personal item and play them despite radiation or other challenges?",
        "created_utc": 1678430037,
        "upvote_ratio": 1.0
    },
    {
        "title": "A systematic review was published in the journal Psychophysicalogy which looked at studies of how the human brain changed as it ages. The results suggest that this leads to less flexible thinking, lower response inhibition &amp; reduce verbal &amp; numerical reasoning.",
        "author": "BigBlueMountainStar",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ngs5e/a_systematic_review_was_published_in_the_journal/",
        "text": "Could this be proof that people become more conservative as they get older?",
        "created_utc": 1678428766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could quantum mechanics (wave) solve a maze?",
        "author": "CrypticXSystem",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11negor/could_quantum_mechanics_wave_solve_a_maze/",
        "text": "I am no expert in this field, but I stumbled upon a short video online. https://youtu.be/SvWSo1FlNj0.\n\nThe video demonstrates what I assume is a wave function traveling through a maze. My intuition tells me that the wave would stop \"permeating\" at some point and reach zero probability. But like I said, I have no knowledge on the subject. I just wanted to see if something like this could actually be real.",
        "created_utc": 1678421993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't any of the medical textbooks in my college mention that the cells inside the cochlea which pick up sound are chemoreceptors that are really important for breathing?",
        "author": "Weak-Sand9779",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ndh66/why_dont_any_of_the_medical_textbooks_in_my/",
        "text": " Scientists have said that hearing damage is a cause of sudden death, since the inner ear cochlea sound cells are chemoreceptors that regulate autonomic breathing.  The same group of scientists noticed that people who died suddenly had hearing loss in one ear. They then patented a device in 2007 to measure vital signs of  people with hearing damage as they sleep. They subsequently did studies on mice which proved their hypothesis that inner ear sound cells are chemoreceptors.",
        "created_utc": 1678419265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the only source saying that ear sound cells are chemoreceptors important for breathing is just one team of scientists every time? Why aren't more scientists talking about how hearing loss is a cause of sudden death, and why don't medical textbooks say that the ears are chemoreceptors?",
        "author": "Weak-Sand9779",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ncrjf/why_is_the_only_source_saying_that_ear_sound/",
        "text": "Everytime there's a study about inner ear sound cells being important for breathing and damage to these sound cells causing life threatening breathing problems, it's the same group of scientists. They first noticed that several people who suddenly died had hearing loss in their right ear. They created a patent in 2007 which measures the vital signs of deaf or hearing impaired people as they sleep. They concluded in the patent that cochlear sound cells which pick up sound are chemoreceptors. A few years later they did studies on mice which proved their hypothesis, the mice with damaged hearing had virtually no chemoreceptor functionality. In subsequent press releases in which these scientists were interviewed, they said that hearing damage is a cause of sudden death since the ears are what tell the lungs to breathe.\n\nMy friend has tried looking in various medical textbooks and not a single one of them mention that hearing damage is a cause of sudden death, and all sources she could find (which aren't from these scientists or from articles which quote them) say that the respiratory chemoreceptors are located in the medulla and aorta, not the ears.",
        "created_utc": 1678417386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would antimatter molecules and compounds have any properties that matter lacks?",
        "author": "Veridically_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11n90u8/would_antimatter_molecules_and_compounds_have_any/",
        "text": "I always hear about people using antimatter in exotic ways in sci-fi to do things ordinary matter cannot, but I don't see why antimolecules should be any different from standard molecules. Are antimolecules even possible?",
        "created_utc": 1678407855,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the sound detecting cells in the ear are important 'chemoreceptors' that are 'pivotal' for autonomic breathing, and hearing loss is associated with sudden death, why don't we see musicians suddenly dying much more than the average population? Most of them have ear damage.",
        "author": "Weak-Sand9779",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11n5gr0/if_the_sound_detecting_cells_in_the_ear_are/",
        "text": "",
        "created_utc": 1678399726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there and effort to preserve all human-generated knowledge?",
        "author": "jrdubbleu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11n5den/is_there_and_effort_to_preserve_all/",
        "text": "Are there archives being built/maintained that contain everything we've ever learned? In same vein as the Svalbard seed repository, if there is a disaster of some sort, we won't have to start over and learn it all again?",
        "created_utc": 1678399524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given what we know about what IQ measures, what would someone with 500 or 1000 IQ be capable of?",
        "author": "pondtransitauthority",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11n1al2/given_what_we_know_about_what_iq_measures_what/",
        "text": "Assuming that their brain does not explode and they do not suffer from any debilitating mental illnesses, what could they theoretically be capable of?\n\n(I know that IQ tests cannot measure that high, and even if they could, the chance of someone having that IQ is astronomically rare. Just curious if any reasonable speculations about their capabilities can be made.)",
        "created_utc": 1678390207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why isn't healthy food as tasty as high calorie food?",
        "author": "avicci6",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11n0hqg/why_isnt_healthy_food_as_tasty_as_high_calorie/",
        "text": "It's probably anecdotal but I don't know anyone who eats low-salt, low-sugar or low-fat foods for the taste but more for the health implications of consuming junk food frequently. Why is the food that most people enjoy bad for the body?",
        "created_utc": 1678388395,
        "upvote_ratio": 1.0
    },
    {
        "title": "if the sound-detecting cells inside the ear (cochlea) are what makes the body breathe, and damage to these cells will cause death from respiratory failure, how come people with hearing loss/damaged hearing aren't dropping dead or having breathing problems?",
        "author": "ThrowRA2432432432324",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11mzxo4/if_the_sounddetecting_cells_inside_the_ear/",
        "text": "An audiology website says that in addition to detecting sound, these little sound detecting cells in the ears are also respiratory chemoreceptors and studies in mice showed that once their ears were damaged they lost virtually all of their respiratory chemosensitivity. The authors of that study then went on to conclude that damage to these sound detecting cells inside the cochlea will cause death, since they are ''pivotal'' for making the body breathe. The authors of the study were so concerned that they patented a device that measures oxygen and carbon dioxide levels of children with hearing loss as they sleep (a few years before they did the studies on mice, which proved their hypothesis to a T). Before they patented the device, they noticed that 31 children who had suddenly died during sleep had hearing loss in their right ear. The team of scientists concluded (in the patent and the press releases in which this team of scientists were interviewed, not the study by itself) that these sound detecting cells are vital for life and ear damage will cause death from asphyxiation during sleep.\n\nIf the sound detecting cells inside the cochlea are so important for breathing and damage to them causes people to stop breathing and die why are only a single team of scientists talking about it, and why did it take until 2007 for them to realize this?",
        "created_utc": 1678387105,
        "upvote_ratio": 1.0
    },
    {
        "title": "How realistic is The Last of Us?",
        "author": "StormTrooper950",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11mwq09/how_realistic_is_the_last_of_us/",
        "text": " \n\nI'm no biology expert but I have a few questions about the Last of Us realistic accuracy. I'm still on episode 2, so might be missing a bit.\n\nSPOILERS:\n\n1. Aren't spores usually much bigger than viruses so can't we just make special masks to prevent the spread? The \"professor\" said there's no way to contain it. Can't they just quarantine Indonesia and stop all flights and announce a state of emergency to the world?\n2. If the people turn into zombies, they can't do much thinking so why do they not become cannibals and eat each other for nutrients?\n3. How realistic is the web things that connect underground?\n4. Do fungi spores reproduce in living beings like viruses? Even if they did, wouldn't it be incredibly slow compared to viruses?",
        "created_utc": 1678379644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips and Info for Future Astronomer?",
        "author": "the-bloopy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11mq6tt/tips_and_info_for_future_astronomer/",
        "text": "Hello, all! My daughter is 11, almost 12. She has a couple of ideas for future careers she's interested in, but her #1 right now is astronomy. She obviously has quite some time until she would be going to college or working as an astronomer, but I would like to share any tips or ideas with her from those who are in the field. How easy or hard is it to actually start a career in astronomy? Also, consider that she will be a woman... I have heard it tends to be harder for women to get into the field than for men. Are there any women astronomers who would like to share their stories (when did you become interested in astronomy, how did you cultivate and grow your interest, what schooling you went through, what degrees you earned, how you got a job in astronomy, what the job is like and any stories you'd like to share from the job)? Thanks!!! ❤️",
        "created_utc": 1678362578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gluten?",
        "author": "firstofsix",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11mm6vr/gluten/",
        "text": "Is there any legitimate reason to ask if a non-consumable contains gluten?  Like makeup?  Clothing?  (I am not making those two up, and I’m sure there are more questions sitting elsewhere!)  I know that a true wheat allergy can be triggered by inhaling wheat dust, that’s not my question.",
        "created_utc": 1678347665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is blood really a nutritious source of food?",
        "author": "JohnWarrenDailey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11mhxfx/is_blood_really_a_nutritious_source_of_food/",
        "text": "I'm asking this out of concern for both the vampire bat and the vampire finch, both of which are significantly larger than flies or fleas.",
        "created_utc": 1678334020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does using fabric softener or dryer sheets affect the ability for towels to absorb moisture?",
        "author": "jrdubbleu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11ma8qh/does_using_fabric_softener_or_dryer_sheets_affect/",
        "text": "",
        "created_utc": 1678314374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric motor to power electric generator? Superconductivity question.",
        "author": "kufsi",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11m932a/electric_motor_to_power_electric_generator/",
        "text": "\nYes I know the immediate reaction is automatically “conservation of energy”, or \"no such thing as fee energy\". \n\nI understand the law, but I’m still asking anyways.\n\nLet’s say that in theory we used a charged superconductive wire submerged in a liquid nitrogen vacuum, then used that to power an electric motor, which we then used to power an electric generator, then recycled a portion of the generated electricity back into the superconductor to maintain the flow of current. \n\nWould the loss of current be greater than energy produced, despite the lack of resistance based loss, assuming that every possible component was made with superconductive material?\n\nI may have a fundamental misunderstanding, if so please let me know.",
        "created_utc": 1678311685,
        "upvote_ratio": 1.0
    },
    {
        "title": "We eat dead cows at McDonalds. So how come we aren't called \"saprophytes\" like fungi?",
        "author": "Miss_Understands_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11m2qzf/we_eat_dead_cows_at_mcdonalds_so_how_come_we/",
        "text": " I like the Big Mac with dead potatoes.\n\nYUMMY DEAD STUFF!",
        "created_utc": 1678297342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about black holes and who actually experiences burning up at the event horizon?",
        "author": "HumanSeeing",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11m2dse/question_about_black_holes_and_who_actually/",
        "text": "Hey! So talking about black holes.   \nWhen we talk about observers Alice and Bob, we usually talk about bob falling into a black hole and experiencing falling into the black hole through the event horizon.\n\nBut then we say that also from Alices point of view, she saw bob burn up near the event horizon and bob never passed through it. And we can say that both of these are accurately true.\n\nI mean maybe i don't get it, but my question is.  \nWhen we always talk about bobs experiences being, him just falling through the event horizon. If then there is Alice who sees bob burn up, but we always say that bob passes through the event horizon unharmed in his own frame of reference. \n\nWho then, or what version of bob experiences actually being burned up in the event horizon. Because if Alice sees it happen and its real then it needs to be a subjective experience for some version of bob too?\n\nI know it is important to keep in mind about whos frame of reference we are thinking about. But if indeed the ionized or burnt bob is also a valid thing that actually happens. Then there has to be some form of bob that experiences this?   \nBut yet we say that bob just falls through and never experiences being burnt up.\n\nI would love a response if what i say made any sense at all. Thank you!",
        "created_utc": 1678296529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terraforming Planets &amp; Moons",
        "author": "bjdocherty",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11m0b1w/terraforming_planets_moons/",
        "text": "Hello, I hope someone can help. I’m writing a sci-fi story in which creating an atmosphere and magnetosphere is entirely possible so Mars has been terraformed. My question is if terraforming is possible would terraforming the moons of Jupiter and Saturn potentially be viable for human life and what would that most probably look like? Would they all just be cold ice planets? I realise this is all a lot of what ifs and maybes and that terraforming a moon or planet would probably be even more complicated than just getting a magnetosphere and atmosphere but as I mentioned before it’s for a sci-fi story so it’s really just the broad strokes I’m looking to get right. Thanks!",
        "created_utc": 1678291825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to know something about hairloss",
        "author": "Mention-Quirky",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11lnf4m/just_wanted_to_know_something_about_hairloss/",
        "text": "My mother is loosing her hair at 43 although her father has no hair loss. She is generally sick for like 5 years or 10 years maybe . Is her sickness a reason for her hairloss . Will her hairloss be passed on to me not not?",
        "created_utc": 1678253182,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could take two measurements of the position of a quantum particle only 1 Planck time apart, would the second position necessarily be \"near\" the first position, or is there a probability that the particle could have \"teleported\" elsewhere among all possible positions its waveform predicts?",
        "author": "hi_wassup",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11lmsvg/if_you_could_take_two_measurements_of_the/",
        "text": "My understanding is that a quantum object's waveform represents all possible positions at which the quantum object could be found within a certain range, with the amplitude of the waveform being the probability of finding the quantum object at that position when 'observed' (or 'interacted with'). \n\nAlthough most sources I could find have been unclear, I also assume that a quantum object instantly resumes being described by its waveform the moment it stops being observed; said another way, the position we observe is only true for the exact instant of observation. \n\nHowever, this would imply that two measurements taken the absolute minimum time apart (Planck time) could theoretically return results that show FTL travel on the part of a quantum object.  If the quantum object is first observed to be located at a position, but then stops being observed for 1 Planck time, it returns to its waveform and has a \"probability\" of being found completely elsewhere by the second observation. \n\nI presume I am misunderstanding one or more of these quantum concepts, but am not sure which. Thank you for your time and feedback!",
        "created_utc": 1678251374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could nuclear fusion occur at room temperature, if the pressure was great enough?",
        "author": "77gamerman",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/11llkvo/could_nuclear_fusion_occur_at_room_temperature_if/",
        "text": "Fusion generally occurs in extremely hot and extremely pressurized places, like the core of a star. But does fusion have a minimum temperature, or could you get something to undergo nuclear fusion at room temperature, or even colder than that, if you got the pressure high enough?\n\nConversely, could something undergo fusion at any pressure, for example the atmospheric pressure of earth, if it was hot enough? Or is there a minimum pressure for fusion?",
        "created_utc": 1678247925,
        "upvote_ratio": 1.0
    }
]