[
    {
        "title": "What would history look like if Phorusrhacids (terror birds) never went extinct?",
        "author": "Dinoboy225",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbmre8/what_would_history_look_like_if_phorusrhacids/",
        "text": "Besides humans making them extinct anyway because that seems like a generic answer, what would history, myths, and legends look like if terror birds never went extinct?",
        "created_utc": 1670091708,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if! other dimension",
        "author": "T0yzzz",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbmg7t/what_if_other_dimension/",
        "text": "Powerfull title I know.. before you judge me, please be repectfull... I have loved science books/documentaries for as long as I could remember. At the same time I have allways been open minded about everything as long as a new theory about anything cant be DISproven without actually doing alot of studying and experiments.\nSo everyone know that to travell in space takes waaay to much time with our technology and the physical limits, speed of light being as slow as a snail walking around the earth.. \nnow Im coming to my point!\nOkey so there has come more and more up around some specifics psychedelics being like a door into another realm/dimension in our own world. This would mean that to reach another state of dimension you would have to do it through the mind, could this in the long run be used to travel distances? could this be the key to outer space and far away galaxies? ...\nCall me mad, I just dont think we as humans should think we have figured everything out yet, every possibility should be worth paying attention to.\nNeil degrasse tyson and other scientists have for a long time talked about the possibility being other dimensions and/or multiverse, he has NOT talked about psychedelics around this subject, just to clarify! \nAny thoughts around this?",
        "created_utc": 1670090916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please tell me about safety standards for various medicines and vaccines.",
        "author": "Nouble01",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbm8iu/please_tell_me_about_safety_standards_for_various/",
        "text": "As far as i can hear,\n &gt;For safety confirmation of things like the title, we have only tested a few species other than humans, such as the list below.    \n\n Is this true?    \n　　    \n\n list    \n &gt;・Dog,    \n・Rats,    \n・rabbit,    \n・ etc.",
        "created_utc": 1670090404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird question: How is it even POSSIBLE for a mongoose to fight a cobra when mongooses don't even have depth perception? Also, why are mongooses one of the very few predators without frontward facing eyes for depth perception?",
        "author": "AntiochKnifeSharpen",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zblubk/weird_question_how_is_it_even_possible_for_a/",
        "text": "",
        "created_utc": 1670089390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to put some piezoelectric material between the tectonic plates to generate electricity?",
        "author": "hobo_couture",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbkwrj/is_it_possible_to_put_some_piezoelectric_material/",
        "text": "[removed]",
        "created_utc": 1670086993,
        "upvote_ratio": 0.5
    },
    {
        "title": "How long would it take to reach the current level of technological progress if all current knowledge of humanity was sent back in time?",
        "author": "L4Deader",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbjieq/how_long_would_it_take_to_reach_the_current_level/",
        "text": "Now, hear me out. I know this sounds like a writing prompt to a fantasy/sci-fi setting, but it's just a question I've been interested in for a long time. A lot of people seem to claim, for example, that if the humanity'd had less religious oppression of science, we would've been an advanced spacefaring species by now. Extrapolating from that, I came up with a specific situation. While it is unrealistic at its core, in the end what I'm interested in is still based on scientific calculations or estimations that could theoretically be performed by a specialist. So, imagine a person containing all knowledge of humanity as of writing is sent back to the time Homo Sapiens had invented language and got used to it as a means of communication. For the sake of this undertaking, we also have to suppose that this person is immortal and invulnerable, otherwise the entire thing falls apart pretty fast. So, if the time traveller has the goal to restore humanity to its current level of technological progress worldwide, how quickly do you think they could accomplish this task? We are, of course, discounting the possible timelines in which they utterly fail to learn the proto-language (I guess it's the easiest part of this entire undertaking) or to convince/force the people to work for them (this is harder to achieve, but I doubt there is 0% probability of the time traveller becoming the leader of a local tribe, even if it may be more difficult to take over the world - hopefully via peaceful means - eventually).",
        "created_utc": 1670083180,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we know that Endogenous Retroviruses point to a common ancestor?",
        "author": "meitsirk",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbja1b/how_do_we_know_that_endogenous_retroviruses_point/",
        "text": "*Previously posted on the AskScience subreddit, as well.*\n\nI know this seems like a very broad question, but I didn’t know how to summarize my question adequately for the title.\n\nI’ve been trying to understand the different evidences of common ancestry, and one topic that has been brought up is the discovery of endogenous retroviruses and their presence in the human genome and other animals, which points to a common ancestor.\n\nTo clarify, my question is how do we know the retroviruses found in our DNA and the DNA of other species are from a virus infecting a common ancestor, and not a result of a prevalent virus in the past that infected multiple species around the same time, resulting in an alteration of the genomes of different species but occurring around the same time? If that makes sense.\n\nI don’t necessarily believe that, but growing up in a very conservative, 6-day creationist, Christian household, I think that it’s a thought that could pop up in response to the REV findings, so I am interested in what the rebuttal would be. I am not knowledgeable at all in these areas, and so I’m grateful to anyone who can help me understand and learn this in a simpler way, if possible. Thanks!",
        "created_utc": 1670082554,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much does our sun light up the solar system? How far away before you’re in total darkness and do distant stars provide enough light to see?",
        "author": "Call-me-Maverick",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbhy56/how_much_does_our_sun_light_up_the_solar_system/",
        "text": "If I were to go into space above the Earth, I should be able to see myself or objects near me without artificial sources of light, right? I assume if I was in direct sunlight (I.e., not in the shadow of the Earth), then I would be illuminated. \n\nAssuming I was not in shadow, how far out does sufficient illumination extend from the sun to be able to, for example, see something 10 feet away, or to be able to see my own hands?\n\nLooking at the sun would of course be blinding from Earth distance. Does that mean you’d be illuminated the same as if you were in full daylight on Earth? More because no atmosphere? \n\nAnd what about further out? We can see more distant planets in our solar system because they reflect light from the sun. That seems pretty bright despite the distance. Ignoring atmosphere, is a day on Neptune as bright as on Earth or does the light from the sun become diffuse enough at that distance to be much darker? \n\nHow bright is it really in open space within our solar system? Is space only dark between the stars? How far do you have to go to be in total darkness or are you never in total darkness unless you are in shadow? How much illumination do distant stars provide? Would it be like a night on Earth with no moon but in the mountains with zero light pollution or cloud cover? How bright even is that? \n\nIn short, is space mostly pretty well illuminated within our galaxy and it’s just the absence of matter and light sources that make areas of it appear black to look at?\n\nEdit: In short, not I’m short haha",
        "created_utc": 1670078903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about time",
        "author": "hshshe8eiwishsj",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zbggpc/question_about_time/",
        "text": "Is time the measurement of the movement of energy and particles through space in relation to the movement of other energy and particles through space?\n\nIf so, time travel is theoretically possible, to some extent, as long as we can control the movement of energy and particles through space. Freezing something significantly slows the movement of energy and particles through space so freezing something is a way to slow time for something. Different environments will change the speed at which something moves through time. Theoretically we could cut up bits of space, if we knew where particles and energy exactly once were, or exactly are going to be and we could control their movements, we could make the energy and particles in that bit of space revert back to an older formation, an older place in time, or a future place in time, but probably an AI would be the only thing intelligent enough to see into the exact past or future enough to exactly travel back or forwards, and the only thing able to manufacture and control the technology to manipulate energy and particles each individually on an exact level to control them enough to be able to travel through time effectively and accurately. I am unsure if changing the time of the entire universe, rather than only bits and pieces is possible.",
        "created_utc": 1670074562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found on weather.gov, isn't this incorrect?",
        "author": "ashjeagermainssuck",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zb95m2/found_on_weathergov_isnt_this_incorrect/",
        "text": "here is the [link](https://www.weather.gov/jetstream/layers)\n\n\" \n\nBecause of this absorption, the temperature increases with height. From as low as -184°F (-120°C) at the bottom of this layer, temperatures can reach as high as 3,600°F (2,000°C) near the top.\n\nHowever, despite the high temperature, this layer of the atmosphere would still feel very cold to our skin due to the very thin atmosphere. The high temperature indicates the amount of the energy absorbed by the molecules but with so few in this layer, the total number of molecules is not enough to heat our skin.\"\n\nthe outside temp wouldn't affect your temperature as much, but it wouldn't feel \"cold\", it wouldn't feel like much at all, right?",
        "created_utc": 1670047060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for the Laws of Physics to be undescribable by Axiomatic Math?",
        "author": "Lightfire228",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zb705d/is_it_possible_for_the_laws_of_physics_to_be/",
        "text": "",
        "created_utc": 1670039885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a geostationary satellite be in a stable orbit?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zb6y08/can_a_geostationary_satellite_be_in_a_stable_orbit/",
        "text": "Not sure exactly what these things mean. Geostationary means it looks like it's always at the same point on the ground? A stable orbit means that the thing will stay in orbit even without additionally applied forces. So can an object just remain in the sky without moving, while simultaneously not requiring any further acceleration? \n\nAre these two states mutually exclusive for a given satellite?",
        "created_utc": 1670039692,
        "upvote_ratio": 1.0
    },
    {
        "title": "EV car batteries",
        "author": "qdf3433",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zb0ut0/ev_car_batteries/",
        "text": "Hope this is an appropriate forum to ask this question\n\nSo the current limiting factor in EV battery size is the cost per kWh of batteries, due to the cost per kg of lithium.  I'm wondering if there are plans in the pipeline to ramp up the production of lithium, or if there are batteries on the horizon that use materials that are cheaper than lithium.   Thanks",
        "created_utc": 1670022080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resource: Youtube channel for chemistry, physics, biology, and MCAT prep",
        "author": "ProfEman925",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zaxl13/resource_youtube_channel_for_chemistry_physics/",
        "text": "Hi! My name is Eman, and I am a Ph.D. student studying physical chemistry. I started a YouTube channel in Feb. Since then, I have made videos covering O Chem 1 and 2, Gen Chem 1 and 2, Physics, Thermodynamics, and MCAT prep. I have over 150 videos (in like ten months)!! Every video comes with free notes and a transcript. I have grown to over 1900 subscribers. I just want to share my channel in case anyone is taking those courses or knows someone in these courses and needs help! I just want to make education accessible, and I am willing to help anyone who needs it!! This is my passion, so here it is, and if you like what you see, please share &lt;333 [https://www.youtube.com/channel/UCMzm4J0gp-z8Jmmf2xf1h1Q](https://www.youtube.com/channel/UCMzm4J0gp-z8Jmmf2xf1h1Q)",
        "created_utc": 1670015056,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can we photograph exoplanets in the future?",
        "author": "Wide-Escape-5618",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zasvwj/how_can_we_photograph_exoplanets_in_the_future/",
        "text": "My understanding is the main limiting factor of building a telescope powerful enough to image the nearest exoplanet is the telescope size itself.  A recently saw a physicist work out that we would need a 1km to wide telescope to image the closest exoplanet, even with terrible quality.  This is not too realistic for us at the moment.  However, what if we made a telescope that used multiple spacecrafts spaced miles apart?  This would effectively create a huge telescope.  Could this work?\n\nOr is the only way to image an exoplanet to actually travel to it?",
        "created_utc": 1670004225,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a newly minted Climate Policy Specialist and I am looking for resources and staying very up to date on climate science.",
        "author": "dantetrifone",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zard36/i_am_a_newly_minted_climate_policy_specialist_and/",
        "text": "I am a newly minted Climate policy specialist for Multnomah County in Oregon. My work will center on how the County can adapt and in particular how we can improve health outcomes in the face of a changing climate. An example of initial projects is working on a Heat Vulnerability Index and also how best we can support residents in heat emergencies through sheltering but also getting AC units to residents and creating permanent misting stations in parks etc. \n\nI am wondering what are some recommended journal or listservs to stay incredibly current with climate change in general but also more specifically the intersection climate and health. \n\nAlso, any individuals that you think might be helpful to follow on various social media platforms. Also, generally readings or video/youtube channels you might recommend. Anyway, thank you for any assistance.",
        "created_utc": 1670000607,
        "upvote_ratio": 1.0
    },
    {
        "title": "A straw in space to remove all the water from the oceans",
        "author": "Bolkaniche",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zaqlrb/a_straw_in_space_to_remove_all_the_water_from_the/",
        "text": "9 years ago, Vsauce uploaded a video called \"a straw in space\" and at the beginning of that video he explained that if we created an empty straw that reached into space and put the other end in the oceans, the water would only rise 10.3 meters inside the straw, but if a planet had, for example, 100,000 atmospheres of pressure and was smaller than Earth and was at 350º Celsius (just the temperature necessary for water to exist at those pressures) then theoretically it could get the water from that planet with a straw in space? And could there be a planet with the necessary conditions for that?",
        "created_utc": 1669998753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would humanoid robots with artificial muscles need shock/impact absorbers/dampers?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zapebq/would_humanoid_robots_with_artificial_muscles/",
        "text": "I know this question is really generic and hard to say a plain yes or no, but...\n\nOf course, I'm assuming these robots are human-sized and they can walk, run and jump.\n\nI ask that because the human body has some techniques for shock absorbing, like using its own muscles for a spring effect when jumping and running.\n\nI could only find [shock absorption studies](https://www.researchgate.net/publication/224373516_Study_of_an_External_Passive_Shock-absorbing_Mechanism_for_Walking_Robots) on the subject about conventional \"hard\" robots that uses electric motors and/or pneumatic/hydraulic cylinders.",
        "created_utc": 1669995718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that because the universe is so large/ infinite, that every particle is actually quantum entangled to another particle somewhere?",
        "author": "chancellortobyiii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zanq66/is_it_possible_that_because_the_universe_is_so/",
        "text": "If these particles are entangled, does that mean that the state at the collapse of its wave function during a measurement was already predetermined by the collapse of it's partner?",
        "created_utc": 1669991432,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if i place a black hole next to a slightly stronger magnatar?",
        "author": "RomanReignsGOAT",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zan9j5/what_would_happen_if_i_place_a_black_hole_next_to/",
        "text": "So the Magnatar has more gravitational effect than the black hole, and they interact the second i let them to.\n\nDistance is 10 km",
        "created_utc": 1669990198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you consider Pluto a planet?",
        "author": "Dinoboy225",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zacp6d/would_you_consider_pluto_a_planet/",
        "text": "Forget the ‘official’ definition of planet, and just tell me, would you personally consider Pluto a planet?",
        "created_utc": 1669958894,
        "upvote_ratio": 1.0
    },
    {
        "title": "If human reproduction was limited (by whatever means) to old age, would average human lifespans increase over time?",
        "author": "botany_fairweather",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/zaa6u2/if_human_reproduction_was_limited_by_whatever/",
        "text": "To clarify, our bodies suck at handling old age diseases partially because by that point, we’ve already gone through our reproductive prime. If we were only allowed to reproduce at the average cancer patient’s age (for example) would traits that evade cancer eventually be selected for among the population? Or would the tradeoff of having children at such an old age cause even worse conditions that cancel out these potential immunities?\n\nI’m sure population numbers may drastically decrease in this scenario, but could the surviving population outlive the current (real) one?",
        "created_utc": 1669952284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could an anti radiation suit be made with some form of manuverable metal (ie:mercury) a camera with a screen for sight and recording, all on an exoskeleton with motion detectors programmed to move the metal suit akin to the human body?",
        "author": "Ill-Application-4380",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/za8u0e/could_an_anti_radiation_suit_be_made_with_some/",
        "text": "[removed]",
        "created_utc": 1669948974,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best mechanical advantage for a Stewart Platform/Parallel Manipulator? A lever that is vertically or horizontally placed on the center of the moving platform?",
        "author": "KalyanDipak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/za46u0/what_is_the_best_mechanical_advantage_for_a/",
        "text": "Well, the title is the question by itself.\n\nJust imagine a stewart platform with the end point of a bar/lever attached to it horizontally and thus extending outwards from the platform and vertically from its center.",
        "created_utc": 1669938141,
        "upvote_ratio": 1.0
    },
    {
        "title": "There is a theory or ideology I read by some German or Austrian (maybe) that indicated a beautiful relationship between Math(maybe science) and something like art/literature through history. I can’t remember the name. Does anyone know it??",
        "author": "BobbyJones12344",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/za2x7e/there_is_a_theory_or_ideology_i_read_by_some/",
        "text": "I need it for a very important assignment, I keep going back to linnenberg or something like that but I’m not sure. I was reading an article on Wikipedia abt our it. Please please help me.",
        "created_utc": 1669935346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for an asteroid to hit the earth hard enough to slow down its rotation, by say, 30Min/day, while also not completely destroying civilization?",
        "author": "V1ncentAdultman",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9smwd/is_it_possible_for_an_asteroid_to_hit_the_earth/",
        "text": "I would imagine this is not possible and the velocity and size of an asteroid to slow down the earth by that much would be too great to create a cataclysmic event. But perhaps I'm off on this.",
        "created_utc": 1669913143,
        "upvote_ratio": 1.0
    },
    {
        "title": "which sector will be devastated today of smart phones disappear immediately?",
        "author": "raspush212",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9ryd3/which_sector_will_be_devastated_today_of_smart/",
        "text": "",
        "created_utc": 1669911475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bending light from leds",
        "author": "sllikk12",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9rgel/bending_light_from_leds/",
        "text": "Background: \nI'm a professional driver, I wear strong corrective lenses(things are blurry about 10 inches and further) and my glasses are progressive cut.\n\nThe part I get:\nI've noticed that led lit traffic lights with or without lens covers seem to shift side to side if I turn my head a bit.\n\nI'm sure it's the progressive cut of my glasses as the effect only happens sideways and not up/down.\n\nThe part I don't get:\nThe red light shifts left when I turn my head right but the green one shifts right with the same head movement.\n\nAlso I know progressive lenses loose clarity towards the edge but this is distinct movement of the lit part and works with any red and green LEDs. \n\nYou all have any ideas? My ophthalmologist was stumped.",
        "created_utc": 1669910306,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the current state of the debate on Nature vs. Nurture",
        "author": "spacemanofthezone",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9q4nn/what_is_the_current_state_of_the_debate_on_nature/",
        "text": "Hey!  \n\n\nI'm looking to get more in-depth answers than \"it's both\". Rarely in life is everything exactly 50/50. However, I'm not looking for a specific answer, more about the types of studies and research that has been conducted on the topic and the conclusions drawn by scientists.\n\nI'm specifically interested in the influence of genes vs environment on:\n\n1. Personality\n2. Cognitive ability\n3. Health and Well Being  \n\n\nThank you!",
        "created_utc": 1669907102,
        "upvote_ratio": 1.0
    },
    {
        "title": "How small can I make glitter before it stops glittering?",
        "author": "pbmonster",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9l9f2/how_small_can_i_make_glitter_before_it_stops/",
        "text": "[removed]",
        "created_utc": 1669893352,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you never took off a full-body suit, with just your eyes and genital openings exposed, and simply showered with it on, what would happen?",
        "author": "Squeaky-Fox49",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9fd8r/if_you_never_took_off_a_fullbody_suit_with_just/",
        "text": "",
        "created_utc": 1669871982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can quantum teleportation be used to wirelessly charge a battery?",
        "author": "MarshyBarsh",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9ere9/can_quantum_teleportation_be_used_to_wirelessly/",
        "text": "",
        "created_utc": 1669870315,
        "upvote_ratio": 0.5
    },
    {
        "title": "Substance composed of many different chemical elements",
        "author": "swehner",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z99vfa/substance_composed_of_many_different_chemical/",
        "text": "[removed]",
        "created_utc": 1669857743,
        "upvote_ratio": 0.75
    },
    {
        "title": "Would the piezoelectric effect make an extremely large piece of quartz visibly move when struck by a high voltage lightning bolt?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z98c6l/would_the_piezoelectric_effect_make_an_extremely/",
        "text": "I'm just reading his about piezoelectricity and wondering if it can reliably occur on large objects like very large quartz crystals that have been found to exist in nature. Thank you!",
        "created_utc": 1669853909,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the actual state of the plastic island(s) that is/are twice if the size of Texas, in 2022?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z984x2/whats_the_actual_state_of_the_plastic_islands/",
        "text": "[removed]",
        "created_utc": 1669853428,
        "upvote_ratio": 0.33
    },
    {
        "title": "If there are more permutations of a deck of 52 cards than there are atoms in the galaxy, can a specific arrangement encode a book? Is there a way to calculate how much data could be represented by the order of a deck of cards?",
        "author": "pakled_guy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z97xxp/if_there_are_more_permutations_of_a_deck_of_52/",
        "text": "",
        "created_utc": 1669852969,
        "upvote_ratio": 0.91
    },
    {
        "title": "Can a variant of nuclear pasta made of Carbon instead of iron exist?",
        "author": "TechnoMan69420",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z966w2/can_a_variant_of_nuclear_pasta_made_of_carbon/",
        "text": "",
        "created_utc": 1669848871,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if we arranged Carbon atoms in a Cube?",
        "author": "TechnoMan69420",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z9635l/what_would_happen_if_we_arranged_carbon_atoms_in/",
        "text": "We know graphene as a sheet carbon nanotubes as a cylinder and I think it’s called Telene on what I think is a hexagonal prism but what about cube?",
        "created_utc": 1669848637,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would need to happen to a humans composition for them to become a primary attractor to lightning?",
        "author": "trampaboline",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z91rju/what_would_need_to_happen_to_a_humans_composition/",
        "text": "Hi all! Very ascientific screenwriter here. I’m doing research for a project and I was curious as to what needs to happen to a human body to draw lightning to it over surrounding objects or the ground. From what I understand through the rest of my research, the electrons in lightning are searching for the protons in the ground.m, but will settle for a body if it’s closer. Is there anything that can change in a body’s composition that would draw lightning to ignore higher structures and go right for a body? Thanks!",
        "created_utc": 1669839023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it theoretically possible to detect brain activity from a distance and extract meaningful information from it, or modify that detected brain activity from the same distance?",
        "author": "Retroidhooman",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z90bgk/is_it_theoretically_possible_to_detect_brain/",
        "text": "I posted this on r/askscience too since I couldn't determine whether it fit there or here based on the rules, so I'm just copypasting here in case this sub is more appropriate for it.\n\nA common conspiracy theory you hear, particularly in the \"targeted individual\" community, is that military/intelligence agencies have the technology to secretly detect brain activity from a distance and extract meaningful information from it and even modify said brain activity without any conspicuous or invasive device. Basically remote mind reading and mind control.\n\nThey often cite patents such as these as proof this technology exists or has been worked on:\n\nhttps://patents.google.com/patent/US3951134A/en\n\nhttps://patents.google.com/patent/US6017302A/en\n\nI was arguing with someone who believes this and it got me wondering about the technical feasibility of this concept. I couldn't argue against it on that ground since I don't know enough about neuroimaging and EEG to properly debate whether this could be done or not.",
        "created_utc": 1669835793,
        "upvote_ratio": 1.0
    },
    {
        "title": "What holds a hurricane together? Do its air molecules keep returning to the massive rotation, and if so, why aren't they flung away from it?",
        "author": "OpenPlex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8za0q/what_holds_a_hurricane_together_do_its_air/",
        "text": "Guess that same question sort of applies to tornados too, and to any rotating body of air.",
        "created_utc": 1669833584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could an asteroid strike suddenly kill millions tomorrow?",
        "author": "LDG192",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8y61c/could_an_asteroid_strike_suddenly_kill_millions/",
        "text": "I was watching a video the other day on the means of detection of NEOs and something that stood out to me is how harder it is to find asteroids which orbits towards the sun from\nEarth since our star's glare just conceals them. I also remember in 2013 when they said that the Cheliabinsk meteor wasn't detected because it came from that region. \n\nThat being said, could there be, like, a city-killer approaching Earth right now without us having a clue?",
        "created_utc": 1669831148,
        "upvote_ratio": 1.0
    },
    {
        "title": "If gravity were slightly more powerful, what would happen to the universe?",
        "author": "Negative-Handle-2550",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8ux2h/if_gravity_were_slightly_more_powerful_what_would/",
        "text": "",
        "created_utc": 1669823480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Increasing/decrease space but not size, allowing for larger things to exist in smaller things, take 2",
        "author": "TheCommunistDJ",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8lrkn/increasingdecrease_space_but_not_size_allowing/",
        "text": "You can expand the present into past, present and future.  The present, represents a single strand in dimension. You can then have two strands of perfectly even energy, for two dimensional thinking. Past and future. You can have a third dimension, allowing for past, present and future thinking (or in other words, three dimensional thinking). You can then expand a single strand of being (which contains everything in the present) and expand into so that it is large in gauge and width. You can then decrease the gauge and width of the two dimensional part and future, and fit it into the present. This allows for the past, present and future to collide with themselves, creating for fourth dimensional thinking, or being, which allows the user to think and be on all three planes of existence simultaneously. This expresses the state of being for fourth dimensional entities. Fifth dimensional entities can experience extra dimensions, that mixes 1-4D.",
        "created_utc": 1669795942,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I just discovered a new scientific principle",
        "author": "TheCommunistDJ",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8l3qq/i_think_i_just_discovered_a_new_scientific/",
        "text": "I learned recently, through psychedelics, that I can make a larger word fit inside a smaller word, verbally. By slowing down the smaller word and speeding up the bigger word. I can then say both words at once, simultaneously, with both of them appearing the be the same size and length. I can then apply this to singing two songs at once. I can sing a song, and have that song follow the pitch of another song, giving the illusion of singing two songs simultaneously. But I’m not even sure if you would call that an illusion, because I can do both. I’ll have to record myself doing it sometime.\n\nYou can fit smaller things into bigger things by expanding the smaller thing with energy. Atoms, for instance, don’t touch. There is an energy between them. Take this principle, of between energy, and apply it to the difference between smaller words and bigger words. Think of it like a spectrum. On one side of the spectrum is big words and on the other side of the spectrum is little words. By expanding the space between the little word, you can increase its size. By compressing the space between a bigger word, you can decrease its size. Don’t get this confused with reducing the size of the big word. No, the big word must maintain its size and the space between the big word must decrease. Then, you must expand the space between the little word. You must not expand the size of the little word, which you may find yourself doing. The small word must maintain its size, but the space between the small word must increase in distance. Notice how I talk about increasing the distance of this space. Think of this as width. Now take the gauge of the other word. Decrease the width and increase the gauge. By going so, you can give the illusion of making a larger thing fit inside a smaller thing. Because the receiver of this information cannot discern the difference between width and distance, because of the perspective being given to them. Because of this perspective, they then receive the illusion of a bigger word fitting inside a smaller word. You can achieve this by taking a small word and slowing it down, increasing the time (measurement of distance in time) and giving the illusion of increasing the space between the word, without expanding its size in width. You then take a larger word, and speed it up. This doesn’t decrease the size of the larger word, but decreased the space between the word (decrease in space. In otherwords, you decrease the gauge). You then intersect space and time, by joining the small word and bigger word onto a spectrum point. A spectrum point is the middle point between two ends of a spectrum. On one side is time (the small word) and on the other side is space (the big word). You can then move the spectrum point around, or move the space or time point around, to increase or decrease the length and pitch of space and time, without increasing or decreasing either of them in size. You can then increase or decrease either or in size, to change the frequency or loudness/quietness of the sound. \n\nI wonder if you can apply this to physics, to manipulate space time. Weeeird.",
        "created_utc": 1669793812,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we were able to make a space elevator all the way to the moon, connecting it to the earth with a giant rail and a few giant ball joints, assuming it doesn't fall apart, how fast would the rail be moving in relation to the earth?",
        "author": "Desert_Tortoise_20",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8iph4/if_we_were_able_to_make_a_space_elevator_all_the/",
        "text": "I was just watching [this video](https://youtu.be/MST-0jsOTN0?t=497) and they joked about the idea in this post's title, and I was wondering how fast that would be.\n\n&amp;#x200B;\n\nAlso, would it be fast enough for you to be noticeably affected by the Centrifugal Effect if you were inside it, just above Earth's surface?",
        "created_utc": 1669786714,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen to the average non compromised person’s immune system if they have not been around people for a couple years and then started being around people again?",
        "author": "aonui",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8ftnh/what_would_happen_to_the_average_non_compromised/",
        "text": "What would happen to the average non compromised person’s immune system if they have not been around people for a couple years and then started being around people again?  I thought of this when thinking about the almost last 3 years of COVID. What if you had an average person who didn’t have a compromised immune system who at the start of COVID stopped being around people at all or always wore an n95 mask around people. They didn’t get sick (or have any symptoms if they did) for the last 3 years), and now they started going around people again and maskless? I’m aware they could still have gotten sick from bacteria or viruses in nature, but I’m primarily asking how would their immune system react to other people’s viruses and bacteria. Assuming this person is COVID or flu vaccinated.",
        "created_utc": 1669778832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any science comparing visual scares to audio scares?",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z8ej9a/is_there_any_science_comparing_visual_scares_to/",
        "text": "Suppose you walk into a basement and you think that you're completely alone and your friend yells \"BAAAH!\" at you out of nowhere in order to play a trick on you. You would have a startle response of course. That would be a visual scare. \n\nBut suppose your friend instead just stood still behind you until you turned and saw them. That would be a visual scare (not an audio scare). \n\nWhich of the two above scares would be more intense? Have scientists looked into this? And have scientists hypothesized why one is more intense than the other (if indeed one does tend to be more intense)?",
        "created_utc": 1669775598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Computer Modeling for Superheavy Elements",
        "author": "Microwave_on_HIGH",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z88hw5/computer_modeling_for_superheavy_elements/",
        "text": "Is there supercomputer modeling for elements past 118, to see if there are truly islands of stability, and what some of the features and uses of those elements might be?\n\nIf not, or not accurately enough, then why isn't it computable?  Isn't quantum theory comprehensive enough to model it?  Do nuclei get too complicated to simulate?",
        "created_utc": 1669761328,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Maastrichtian plants and animals could be domesticated?",
        "author": "The_Saurian",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z883lp/what_maastrichtian_plants_and_animals_could_be/",
        "text": "If a civilisation (of troodontid descent) were to have hypothetically arisen during the Maastricthian, what sort of organisms would they have been able to domesticate, and for what purposes? Like staple crops, beasts of burden, livestock, etc\n\nAsking because I'm working on a worldbuilding project involving that sort of civilisation.",
        "created_utc": 1669760425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it too late for me to study cience?",
        "author": "EruTatsuno",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z80268/is_it_too_late_for_me_to_study_cience/",
        "text": "  \nHow can i know what field to follow?\n\ni like to read about astronomy, but im bad at math.\n\nalso i like a lot about biology",
        "created_utc": 1669742505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the mind-body debate quackery?",
        "author": "Keeganator11",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7zwkw/is_the_mindbody_debate_quackery/",
        "text": "I’ve been doing some reading on the philosophical debate on mind versus body.\n\nThe debate is around whether the mind is made up of a different substance than the body. \n\nFrom a scientific perspective, I was wondering whether this debate is long dead? I’ve not read anything convincing to suggest that the mind is anything but physical. \n\nAs such, should other theories be treated as quackery or pseudoscience? Or is there more to it?",
        "created_utc": 1669742157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would humans/animals survive on this supercontinent?",
        "author": "GigaChadxxUltimate",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7ypkq/would_humansanimals_survive_on_this_supercontinent/",
        "text": "I've been told to post here instead of AskScience.\n\nBasically I played around with the continents and \"crushed them together\" to create a new supercontinent of sorts. [Here it is](https://imgur.com/a/jYgwk1W). So, I could be wrong, but where the continents/countries clashed together (the colorful overlap in the other image), there must be huge mountains, right?\n\nWhat do you think would the climate look like in the different places? I figure the Northern + Central part of Africa would dry out even more because there is almost no water around it at all? Is this correct? Where would people/animals have the best chances of survival on this map?\n\nIs it also true that there are way more natural catastrophes (vulcano eruption, earthquakes) on a supercontinent? Do you think that would be the case here, too?  \nSuppose you could make this world more \"ideal\", what would you have to change? For example, would it be favorable if there were huge lakes or something in certain places? If so, where?\n\nAny additional thoughts are greatly appreciated. Please don't be mean, me dumb dumb. Thanks!",
        "created_utc": 1669739420,
        "upvote_ratio": 1.0
    },
    {
        "title": "By what mechanism does cold water affect the human body?",
        "author": "LinguisticsTurtle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7yamq/by_what_mechanism_does_cold_water_affect_the/",
        "text": "1: Cold water does all these things to the human body that seem (to me) to be very remarkable. See here: \n\nhttps://www.sleepfoundation.org/sleep-hygiene/shower-before-bed\n\n&gt;Cold showers might not improve sleep because of cold water’s stimulating properties. Cold water immersion raises levels of cortisol and norepinephrine9. Cortisol is involved in boosting alertness levels, and consequently, cortisol levels10 in the body usually fall in preparation for sleep. In one study, participants compared the energy boost of a cold shower to the effects of drinking caffeine.\n\n&gt;That said, bathing in cold water might provide benefits unrelated to sleep. Athletes sometimes use cold water in an attempt to reduce muscle soreness and fatigue. Anecdotally, people claim cold showers11 boost mood and optimize blood flow for healthier skin and hair, though not all of these benefits have been scientifically demonstrated.\n\n&gt;Cold water immersion is also associated with improved metabolism and a stronger immune system. One study found that incorporating even just one minute of cold water into the end of a shower routine reduces the number of sick days a person takes by around one-third during flu season.\n\n2: What's the evolutionary logic (probably speculative, but that's OK) of why cold water induces these responses? \n\n3: There's something called the diving reflex and I'm not sure why it has to be cold temperature (instead of warm) that induces it: \n\nhttps://en.wikipedia.org/wiki/Diving_reflex\n\n&gt;The diving reflex is triggered specifically by chilling and wetting the nostrils and face while breath-holding,[2][8][9] and is sustained via neural processing originating in the carotid chemoreceptors. The most noticeable effects are on the cardiovascular system, which displays peripheral vasoconstriction, slowed heart rate, redirection of blood to the vital organs to conserve oxygen, release of red blood cells stored in the spleen, and, in humans, heart rhythm irregularities.[2] Although aquatic animals have evolved profound physiological adaptations to conserve oxygen during submersion, the apnea and its duration, bradycardia, vasoconstriction, and redistribution of cardiac output occur also in terrestrial animals as a neural response, but the effects are more profound in natural divers.[1][3]",
        "created_utc": 1669738470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arthropods",
        "author": "Rare-Ad-4526",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7vgz1/arthropods/",
        "text": "If you will become an arthropod, what will it be and why?",
        "created_utc": 1669731841,
        "upvote_ratio": 1.0
    },
    {
        "title": "ARTHROPODS",
        "author": "Rare-Ad-4526",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7vfvz/arthropods/",
        "text": "[removed]",
        "created_utc": 1669731763,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my understanding of the Fermi paradox wrong?",
        "author": "oguzs",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7t17c/is_my_understanding_of_the_fermi_paradox_wrong/",
        "text": "This post was rejected on /askscience. Hope it’s more suitable here :\n\n\nI understand there  are possibly billions of habitable planets in the universe, which leads to the thought that there are most likely other intelligent civilisation building aliens out there…..\n\nBut why must it be likely\n\nWe only have evidence of 1. So how can we conclude any sort of probability?\n\nWhat if the probability of life evolving towards an intelligent civilisation building life form is extremely remote.\n\nWhat if the probability is 1/X and X being larger than the number of habitable plants in the universe?\n\nUltimately, how do the proponents of Fermi paradox know how likely civilisation building life forms are when there is one known example?\n\nSorry if I’ve missed something obvious",
        "created_utc": 1669725779,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a 26 y/o Male, and just found out I was born with an extra Marker X chromosome. A lot of questions and concerns.",
        "author": "darkrap",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z7ego5/im_a_26_yo_male_and_just_found_out_i_was_born/",
        "text": "*My pare*nts always told me I was wired differently and have struggled with bad ADHD, enough to have my 2012 Psych Evaluation to have me at a GAF of 55 and an IQ of 79. Just below the low average.\n\nI stumbled upon this evaluation, and in there is a statement from my father mentioning being born with a Marker X. The day after I was delivered, I returned to the hospital with severe Jaundice, and that is when this was discovered. I've been kept in the dark about this my whole life, but just with what I've researched tonight, so many things make sense.\n\nI wet the bed until I was 16, I had incredibly low self esteem at an unusually young age, behavioral and decision making problems. Problems with organization and planning. At times I struggle with balance and coordination, and struggle with identifying things nearby that people point out. I have questions. Where to start? \n\nIt seems this is medically defined as [Klinefelter Syndrome](https://www.mayoclinic.org/diseases-conditions/klinefelter-syndrome/symptoms-causes/syc-20353949), which I'm not enjoying learning about...\n\nI also stumbled upon [Williams Syndrome](https://en.wikipedia.org/wiki/Williams_syndrome), where the correlations made my jaw drop. Everything from unusual lack of body hair to a more feminine physique. \n\n&amp;#x200B;\n\nI do incredibly well socially and I'm very empathetic, friendly and outgoing. I'm not even sure where to go from here, but I'll be discussing this with my folks. I'd be happy to add in any additional information; just not entirely sure what is relevant and what isn't. By far my biggest concern is sterility. My only goal in life is to settle down and start a family. \n\n&amp;#x200B;\n\nI appreciate any guidance more than you know. Thank you. \n\n&amp;#x200B;\n\n[Many but not all of these symptoms are present](https://rarediseases.info.nih.gov/diseases/6464/fragile-x-syndrome)",
        "created_utc": 1669683034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists of Reddit, what is the update on the deaging process?",
        "author": "AkfurAshkenzic",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z79a24/scientists_of_reddit_what_is_the_update_on_the/",
        "text": "So as I have read, I believe we are closer right? Im not too educated in the matter as all science sometimes leaks out of my brain with the only science I really pay attention to being forensic science, but I want to know, are we closer to a Neal Shusterman Scythe world, or are we going more towards a world of just deaging for the rich?",
        "created_utc": 1669671190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for participants for 5 minute online social/political science survey…",
        "author": "NGBPFsurvey",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6w4xb/looking_for_participants_for_5_minute_online/",
        "text": "I’m not sure if this is the right community for this but I am a high school senior conducting a social/political psychology research project and I am currently looking for participants. It should only take a few minutes so please answer honestly. Must be 18 or older to participate. Let me know if you have difficulty opening the link too, there’s been some technical issues.\n\nhttps://nimble.li/om77w5m3",
        "created_utc": 1669640869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be possible to create in a lab a hybrid of two very different species, e.g. a snail and a mouse?",
        "author": "MinuteSolid8821",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6uyvi/would_it_be_possible_to_create_in_a_lab_a_hybrid/",
        "text": "How hard would it be compared to creating artificially a hybrid of two more related species, e.g mixing human and a chimp DNA into one?",
        "created_utc": 1669637562,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do u think is there gone be a cure or at least a treatment to put gum disease in remission?",
        "author": "crazyanxietybebii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6s5ej/what_do_u_think_is_there_gone_be_a_cure_or_at/",
        "text": "I saw some articles that they are working in some [vaccines](https://www.bitemagazine.com.au/professor-eric-reynolds-the-irrepressible-innovator/) and stuffs but since its the 6th disease in the word and its now associated with other health issues why no one is trying to cure it ,we can say they have no need but that isn’t the case because the countries are lossing billion a year for periodontits treatment",
        "created_utc": 1669627916,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is source of gravitation?",
        "author": "Careless_Disaster_40",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6pj01/what_is_source_of_gravitation/",
        "text": "",
        "created_utc": 1669618582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help a biologist out with a chemistry question!",
        "author": "Sensitive_Data2857",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6eqrn/help_a_biologist_out_with_a_chemistry_question/",
        "text": "Hi all\n\nI am a microbiologist. Part of what I do ( as I am sure many of us do ) is use scientific journals to help drive my methods forward. However what scares the bajeezus out of me is how exactly you would know if chemical A would react with chemical B in a dangerous way (e.g explode). As a microbiologist we throw together these checmials sometimes without a clue of how they may react.\n\nTIA",
        "created_utc": 1669588121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the offspring of chimeric humans prone to any genetic abnormalities or confusion?",
        "author": "pakled_guy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6eq5m/are_the_offspring_of_chimeric_humans_prone_to_any/",
        "text": "",
        "created_utc": 1669588082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does moonlight play a role in sustaining life on Earth? How would life be different without it?",
        "author": "CircleBox2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6e951/does_moonlight_play_a_role_in_sustaining_life_on/",
        "text": "",
        "created_utc": 1669586990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a strong consensus among psychologists on when to bring up adult concepts to children, for example, death?",
        "author": "Chalky_Pockets",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6cxl1/is_there_a_strong_consensus_among_psychologists/",
        "text": "",
        "created_utc": 1669583950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a person have a large tissue expander balloon implanted that could be inflated/deflated at home?",
        "author": "Squeaky-Fox49",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z6bmgn/could_a_person_have_a_large_tissue_expander/",
        "text": "For example, on the stomach or butt, wrapping around the torso or thighs, maybe even one large balloon that’s under everything but the neck, head, hands, feet, and genitals?\n\nI promise I’m not going to do anything medically questionable.",
        "created_utc": 1669580846,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the smallest possible scale within which a civilization similar in complexity to ours could form?",
        "author": "justjake274",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z68n4v/whats_the_smallest_possible_scale_within_which_a/",
        "text": "Immensely large organisms would have to deal with the square-cube law, and the speed of light being the ultimate speed limit. But what sorts of challenges would small organisms have to deal with?\n\n&amp;#x200B;\n\nCould there be ant-sized organisms with exotic ultra-dense brains? What problems would they run into manipulating their environment to form society? What about amoeba sized? Would the size of atoms, molecules, etc. prevent them from creating similarly technology?\n\n&amp;#x200B;\n\nThink about computers. We are reaching a point where transistors are as small as they can get. If we were amoeba-sized, they would be comparatively huge, with no way to shrink them further.",
        "created_utc": 1669573864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Periodontitis cure or vaccine do u think in future 10-15year we gone have something big since i read that US spends 3.6billion in periodontisti for a year and europe same.and they have profs that its connected to other health problems .english isn’t my language so sorry for my mistakes",
        "author": "crazyanxietybebii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z66nut/periodontitis_cure_or_vaccine_do_u_think_in/",
        "text": "",
        "created_utc": 1669569251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-Invasive Methods to Restore Scarred Tissue?",
        "author": "Saito720",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z64kn6/noninvasive_methods_to_restore_scarred_tissue/",
        "text": "Hey guys, so as you can likely tell by the title, I'm curious about regenerative medicine's potential for restoring scar tissue to normal tissue. The reason why I am curious is because it would be vastly more difficult to restore an area of the body that has scarred over after an injury. It's much easier to help tissue regenerate in the first stages of an injury because the body releases certain biomarkers that make it possible for other cells to address the site of the injury and repair it. After an injury has been repaired by the body, in this case with scar tissue, the body sees it no differently than if it were regular tissue.\n\nLet's say an individual receives an injury to their retina, brain, or liver. If this injury isn't addressed immediately and it forms a scar, is there any non-invasive way that you could promote regeneration of this scarred region? I know that there are developments being made where doctors use a scaffold of sorts to replace the scarred area so new cells can populate it. But are there any proposed methods, as of present, that don't involve invasive surgery to repair the scar?",
        "created_utc": 1669564385,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some examples or instances of interference patterns of light that don't involve the two slit experiment?",
        "author": "OpenPlex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z645fy/what_are_some_examples_or_instances_of/",
        "text": "Trying to get a sense of where we would see natural cases of interference effecs or intentionally create them in experiments.",
        "created_utc": 1669563367,
        "upvote_ratio": 1.0
    },
    {
        "title": "If nuclear technology didn't have radiation how different the world would be?",
        "author": "KevinSupreme2505_PH",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z614bw/if_nuclear_technology_didnt_have_radiation_how/",
        "text": "Will humanity be more technologically advanced now if this was the case?\nWill world war 3 happen?\nAre nukes gonna be commonly used in war?\nWill climate change have little effect since the technology was environment friendly?",
        "created_utc": 1669555349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something I don’t understand about relative humidity and humidity.",
        "author": "leo-g",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5x1rh/something_i_dont_understand_about_relative/",
        "text": "I am based in Singapore where it’s humid AF, I am trying to bring the humidity down to 60% or lower in my cupboard. I have 6 of those passive desiccant tubs with 650ml water capacity. (Not tiny packets that comes with food!)\n\nI can’t seem to bring down the humidity. The cupboard is by no means airtight but I expected it to seem like it’s working.\n\nDoes it have to do with the humidity calculation used by Aqara sensors that they are based on temperature? Am I getting the current actual humidity in the cupboard? The Aqara humidity sensors use relative humidity not actual humidity.",
        "created_utc": 1669542042,
        "upvote_ratio": 1.0
    },
    {
        "title": "How aware are people?",
        "author": "throwdisishaway123",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5ww5l/how_aware_are_people/",
        "text": "I understand there are specific levels of awareness. I would describe it as noticing your tendencies and anticipating, or even changing them. But there is also a level of awareness that extends beyond your own actions, where you are observant of other peoples actions and how they are potentially predictable. Then there is awareness of physics and how things tend to be.. physically lol. And then there are general conceptual trend that act in similar behaviors, overlap with one another and interact. Are the last two examples even awareness? Do some people not take note of their actions? What do you think the average person is aware of? Whenever someone has talked about awareness I have always questioned what they truly meant.",
        "created_utc": 1669541492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are commonly available drugs like Paracetamol sold with different dosage recommendations in different countries?",
        "author": "Rhamni",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5ui7p/why_are_commonly_available_drugs_like_paracetamol/",
        "text": "I'm from Sweden, currently in the Philippines. I bought some Paracetamol today, and can't help but be a little surprised that dosage recommendations are so different frtom what I'm used to in Sweden/Europe. Back home, pills are usually 200mg/pill, up to two pills at a time 3-4 times a day. However, here in the Philippines, the pills I bought come in 500mg/pill, up to two pills at a time, \"no more than five times daily.\" Over the counter, no prescriptions involved.\n\nSo the max recommendeed dose here is over 300% of the max recommended daily dose back home. This seems somewhat dubious to me. \n\nI'm not asking for medical advice here, as obviously I will be sticking to the lower dosages I'm used to, but I'm surprised and curious. Is this higher dosage safe for general consumption? Are dosage recommendations excessively restrictive in Europe just to be extra safe and leave room for the occasional mistake? Or are pharmaceuticals simply less well regulated in the Philippines and so companies are able to give recommendations that are harmful in the long term?",
        "created_utc": 1669532991,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I wanted to cook up some trilobites, what parts would be most edible?",
        "author": "thunder-bug-",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5omv1/if_i_wanted_to_cook_up_some_trilobites_what_parts/",
        "text": "Would it even be worth it to bust out the crab crackers and garlic butter or would there not be enough meat to bother?",
        "created_utc": 1669514732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something I don't understand about the event horizon.",
        "author": "Bolkaniche",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5k7nj/something_i_dont_understand_about_the_event/",
        "text": "if an object falls into a black hole, it appears to \"stop\" at the event horizon due to time dilation, but if from the point of view of the object falling into the black hole time \"accelerates\" then the emission of particles from the black hole by Hawking radiation should also see it \"accelerated\" to the point that when it was Planck lengths from the event horizon, it would start to see it recede (due to the evaporation of the black hole) and would never fall, moving forward in fast motion towards the end of the black hole's life.\n\nDoes what I just said make sense?\n\nIn fact, I see another problem with falling to the event horizon, although it only affects you if you are bigger than a proton, and that is that the time dilation in one part of your body would be stronger than in another and you would be flattened in the horizon of events.\n\nIs this how time dilation works when there is a lot of gravity?\n\nDoes it tend to infinity at the event horizon of a black hole?",
        "created_utc": 1669502561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a plasma shield protect someone from a nuke?",
        "author": "RoofRevolutionary148",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5j1va/could_a_plasma_shield_protect_someone_from_a_nuke/",
        "text": "So, let’s say we have a machine that can generate a magnetic field, and redirect the superheated plasma, keeping it away from you.  You are also right next to the nuke when it detonates, could you survive it with the plasma shield I proposed?  The magnets that are used are the same strength as the ones used in the Tomahawk fusion reactor.",
        "created_utc": 1669499554,
        "upvote_ratio": 1.0
    },
    {
        "title": "What consequences would there be if the Earth's magnetic poles flipped?",
        "author": "IGottaHandItToMe",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5h4tr/what_consequences_would_there_be_if_the_earths/",
        "text": "Are any of our systems dependent on North being North or would this be no big deal?",
        "created_utc": 1669494658,
        "upvote_ratio": 1.0
    },
    {
        "title": "two objects at more than 50% of the speed of light",
        "author": "Bolkaniche",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5ekix/two_objects_at_more_than_50_of_the_speed_of_light/",
        "text": "If an object at 60% the speed of light is heading towards another object at 60% the speed of light head-on, at what speed would they be seen to be approaching?",
        "created_utc": 1669487977,
        "upvote_ratio": 1.0
    },
    {
        "title": "What problems would I have before I managed to cook a pizza with neutrinos?",
        "author": "Bolkaniche",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5e7m6/what_problems_would_i_have_before_i_managed_to/",
        "text": "I read on reddit that you can technically cook a pizza if it's the right distance from a nuclear explosion (which is actually false, since the heat wouldn't last long enough) so after thinking that I couldn't do it in the sun, I thought of a supernova, and that I read that if you managed to avoid the heat and pressure of a supernova, you could still die from the neutrinos emitted in the formation of the neutron star if you were at 2.4 AU, so So, if it is possible to get poisoned by neutrinos in a supernova, would neutrinos (generated in a supernova or in a particle collider) be the ultimate way to cook pizza? How much trouble would you have collecting all those neutrinos before making what I said possible?",
        "created_utc": 1669487053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don’t we naturally adapt to like healthy foods or water",
        "author": "TrinitySlashAnime",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5dtjc/why_dont_we_naturally_adapt_to_like_healthy_foods/",
        "text": "Title. Also why Do we smell things how would that have been helpful",
        "created_utc": 1669486049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can I smell when the heating/iron is on?",
        "author": "PassiveChemistry",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5bd1n/why_can_i_smell_when_the_heatingiron_is_on/",
        "text": "Whenever someone's ironing or sometimes when the radiators come on, I find I can smell it, even from the next room sometimes.  What exactly might I actually be smelling?",
        "created_utc": 1669479773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a kinetosynthetic organism theoretically possible on Earth?",
        "author": "bookmaxxing",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5ajud/is_a_kinetosynthetic_organism_theoretically/",
        "text": "Learning about deep-sea chemosynthetic organisms has me wondering whether there is any biological mechanism for kinetosynthesis to occur. I imagine a sessile, commensalistic organism akin to a floppy barnacle, or perhaps a plant of some kind? Magnetotatic bacteria seem like an interesting starting place as the basis of an organic generator-analogue, but I am about as lay- as a layperson can be. Would love any insight!",
        "created_utc": 1669477647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dopamine, Oxytocin, Serotonin, Endorphine are making us happy. Can't they be synthesised?",
        "author": "ElvenNeko",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z59mln/dopamine_oxytocin_serotonin_endorphine_are_making/",
        "text": "I am curious why don't we have pills of happiness yet. \n\nOr, maybe, not only pills, but some brain implants that will trigger needed connections on demand.",
        "created_utc": 1669475185,
        "upvote_ratio": 1.0
    },
    {
        "title": "If extremely large animals existed would they move in slow-motion like movies portray?",
        "author": "Nidken",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z5817b/if_extremely_large_animals_existed_would_they/",
        "text": "",
        "created_utc": 1669470693,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come scientists/the public are so interested in asteroid mining when the moon is so much closer?",
        "author": "Loaf4prez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z57li7/how_come_scientiststhe_public_are_so_interested/",
        "text": "The moon is covered in craters, which means plenty of asteroids and meteors to mine in our backyard rather than having to cross half the solar system to get it. This seems like a more feasible option to me. Is the something I'm missing?",
        "created_utc": 1669469369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do dogs understand each other's barks?",
        "author": "Brilliant-Ok",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z56ct9/do_dogs_understand_each_others_barks/",
        "text": "",
        "created_utc": 1669465531,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking at this guy's response on climate change (he's a denier), is he just posting random jargon?",
        "author": "strik3r2k8",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z4m1fq/looking_at_this_guys_response_on_climate_change/",
        "text": "[removed]",
        "created_utc": 1669404906,
        "upvote_ratio": 1.0
    },
    {
        "title": "need opinions",
        "author": "hakurient",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z4kivh/need_opinions/",
        "text": "[removed]",
        "created_utc": 1669401164,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEED OPINIONS",
        "author": "hakurient",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z4khxz/need_opinions/",
        "text": "[removed]",
        "created_utc": 1669401096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we grow vegetables and fruits without wasting time to grow leaves and steam?",
        "author": "abhirajpm",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z4k1pc/can_we_grow_vegetables_and_fruits_without_wasting/",
        "text": "Have scientist been  able to achieve this level of technology by either genetically modified or just accurate calculation of what goes into making a plants their fruit, so that we could bypass whole time taking process of naturally growing leaves , steams and then useful fruits/vegetables. Or is it not possible to do so.",
        "created_utc": 1669399984,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the stats of a peak human?",
        "author": "Orphus_1230",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z4erhi/what_are_the_stats_of_a_peak_human/",
        "text": "And I don't mean like the world records or anything like that.\n\nTheoretically, if human biology is pushed to it's limits, what can be achieved.\n\nWhat is the strongest a human cam physically be? the fastest? things like that.",
        "created_utc": 1669386707,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is cooking not dangerous?",
        "author": "dummmrandomquestions",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z42ois/how_is_cooking_not_dangerous/",
        "text": "[removed]",
        "created_utc": 1669346990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would there be odd weather/climate affects in a binary planet system?",
        "author": "UltraStallion",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z3oljh/would_there_be_odd_weatherclimate_affects_in_a/",
        "text": " Hypothetically, let's say that this system exists:\n\n* There are two planets orbiting around each other\n* Each planet is approximately one Earth mass\n* The barycenter lies 1 AU from the host star, which is sun-like\n* The planets are distant enough from each other that they do not tidal lock to each other\n\nIf one of these planets develops a life-supporting climate like the Earth has, and has the same axial tilt, would the climate be wonky from constantly moving closer to and moving away from the star while moving along the orbital path?\n\nWould there be a mini winter while in the middle of a summer while furthest away from the star, and a mini summer in the middle of a winter when moved closer in?  \nOr would the moving closer to and away from the star have negligible effect?",
        "created_utc": 1669308104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could shooting nuclear waste into the sun destroy the sun, possibly by interrupting its fusion with heavy metals?",
        "author": "Belaerys",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z3o63d/could_shooting_nuclear_waste_into_the_sun_destroy/",
        "text": "I know all the reasons shooting our nuclear waste into the sun isn't feasible (expense, malfunctioning rockets etc. ...), but I don't think it would do anything if we did. You might as well just sneeze in the sun's general direction.\n\nBut ... am I wrong and it could damage the sun?\n\nIt would be great if you could provide a scientifically correct explanation as to why it could or could not damage the sun AND had a degree in astrophysics.",
        "created_utc": 1669307045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help me with validating a biomarker?",
        "author": "memmme",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z3icaf/can_anyone_help_me_with_validating_a_biomarker/",
        "text": "",
        "created_utc": 1669291800,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do cable networks work in America? Each company (Comcast, Disney, NBS, etc.) puts their own network wire ? Or the wire is only one connection different as the Internet?",
        "author": "UltronAge",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z3hw2w/how_do_cable_networks_work_in_america_each/",
        "text": "How do cable networks work in America? Each company (Comcast, Disney, NBS, etc.) puts their own network wire ? Or the wire is only one connection different as the Internet?",
        "created_utc": 1669290336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is a neutrino reference frame more valid than a photons?",
        "author": "TheDornerMourner",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/z3gdqs/why_is_a_neutrino_reference_frame_more_valid_than/",
        "text": "The speed of neutrinos is mind blowing to me, reading they could travel alongside photons for the age of the universe and be like, a fraction of the size of an atom behind. I get that mathematically these neutrinos have mass, are represented in more dimensions, and that’s why they have reference frames… \n\nBut in the real world does this math really make any significant difference? If they take light years to separate I’m not really seeing why one has a valid reference frame and the other doesn’t.  \n\nTbh I don’t see in general why photons don’t get frames. Just say the reference frame moves at c? Sure nothing moves at c but reference frames are ‘massless’?",
        "created_utc": 1669285058,
        "upvote_ratio": 1.0
    }
]