[
    {
        "title": "Describe Your Emotions.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ixrkx/describe_your_emotions/",
        "text": "[deleted]",
        "created_utc": 1482023213,
        "upvote_ratio": ""
    },
    {
        "title": "Any recommended books or other sources for the theories of Ferdinand Tönnies?",
        "author": "BernieD2607",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ixi47/any_recommended_books_or_other_sources_for_the/",
        "text": "Hello all, hoping I can get some friendly advice here. Just finished a class, where I wrote a paper around Ferdinand Tönnies' ideas of Gemeinschaft and Gesellschaft, looking at local societies and communities. Class is over, but my instructor suggested that if I get free time, I would enjoy looking into the depth of the theories, versus just scratching the surface as many intro texts do. A brief hunt has found only the same general information. Could anyone recommend books or other sources for more in depth information on his theories? I don't want to invest in something, only to find out it is dross. If no books or other sources, even suggestions as to other key words I can use to find more information on his theories and ideas. Thanks in advance!",
        "created_utc": 1482019820,
        "upvote_ratio": ""
    },
    {
        "title": "Did the people born and raised in the 19th century have a bias against the people born in the 20th century?",
        "author": "SynisterSilence",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ixd12/did_the_people_born_and_raised_in_the_19th/",
        "text": "Was there bias against them and the new ways of living? Also did they have an often derogatory term like \"Millennial\" to describe the next generation?",
        "created_utc": 1482017940,
        "upvote_ratio": ""
    },
    {
        "title": "Why are racist tendencies greater in the South even though whites in the South have had greater interaction with African-Americans?",
        "author": "insafian",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ix1ec/why_are_racist_tendencies_greater_in_the_south/",
        "text": "One of the reasons for racism is usually said to be the lack of contact between people of different communities. However, there are many African-Americans and Hispanics in the South as well, then why have racist tendencies historically been prevalent there? For example, a lily-white state like Vermont is liberal but South Carolina isn't.",
        "created_utc": 1482013907,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there different ages for age of consent around the world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ivyt1/why_are_there_different_ages_for_age_of_consent/",
        "text": "Is it cultural? ",
        "created_utc": 1482001130,
        "upvote_ratio": ""
    },
    {
        "title": "Help to dichotomize \"Physical Health Self Evaluation\" into two categories?",
        "author": "ariezee",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5iv32k/help_to_dichotomize_physical_health_self/",
        "text": "So the dataset has Physical Health Self Evaluation categorized into 1,2,3,4,5.  1=excellent, 2=very good, 3=good, 4=fair, 5=poor\n\nHow should I do it?  and why?\n\n1=excelent,very good, good; 2=fair, poor\nor\n1=excellent, verygood,  2=good,fair,poor",
        "created_utc": 1481990614,
        "upvote_ratio": ""
    },
    {
        "title": "Any book or paper suggestions relating pos-upanishads (7th century BCE) thought in India with modern (15th century CE) thought in Europe?",
        "author": "PM_ME_YOUR_THEORY",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5iufss/any_book_or_paper_suggestions_relating/",
        "text": "",
        "created_utc": 1481980986,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we bury the dead?",
        "author": "the_panda0704",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5iruo9/why_do_we_bury_the_dead/",
        "text": "Cremating seems so much more efficient, and are there any cultures that don't bury their dead? What do they do?",
        "created_utc": 1481935848,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] Why do cat lovers have a \"crazy\" stereotype yet dog lovers do not?",
        "author": "TaylorSwift2015",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5iq1ox/serious_why_do_cat_lovers_have_a_crazy_stereotype/",
        "text": "There are crazy cat individuals yet no crazy dog individuals. A person living alone with 2 dogs has a totally different connotation than a person living alone with 2 cats. Why is that?",
        "created_utc": 1481915086,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | December 16, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ioe80/friday_freeforall_december_16_2016/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1481896980,
        "upvote_ratio": ""
    },
    {
        "title": "Are the IMF and the World Bank actually contributing to Global Development?",
        "author": "ohanakawaii",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5inasf/are_the_imf_and_the_world_bank_actually/",
        "text": "I understand that these institutions were set up to rebuilding the economies post WW2, but I see that debt is being used as an instrument to implement neoliberal policies that act in the favour of the West, and it almost feels like they are neo-colonialists.  ",
        "created_utc": 1481878564,
        "upvote_ratio": ""
    },
    {
        "title": "Is it fair that a genocide cannot be commited against a social-economic class or political group?",
        "author": "slopeclimber",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5imf1s/is_it_fair_that_a_genocide_cannot_be_commited/",
        "text": "The geneva convention talks only about a national, ethnical, racial or religious group\n\nEdit: Messed up the title. Should be \"Is it fair TO SAY that a genocide....\"****",
        "created_utc": 1481863588,
        "upvote_ratio": ""
    },
    {
        "title": "Why did American Blacks that had moved north until the 80s start moving back south in the 90s?",
        "author": "Gaethan",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5il064/why_did_american_blacks_that_had_moved_north/",
        "text": "I was reading Gottdiener, M., Hutchinson, R.. (2011) *The New Urban Sociology*. Boulder, Colorado: Westview Press. pp. 185-186 for school and a bit caught my interest:\n\n&gt; Until the twentieth century, the overwhelming majority of blacks, more than 90 percent, lived in the South, and most were located in rural areas. Since the turn of the last century until the 1980s, there was a steady movement of African Americans to the North in general and to cities in particular. In the 1990s, however, some of this movement was actually reversed as black people with the means and the education returned voluntarily to the South in significant numbers as part of a more general trend of the Sun Belt relocation. In fact, the movement south outscored net gains of black migrants from all three of the other regions of the United States during the late 1990s, reversing a thirty-five-year trend according to recent census reports. Of the ten states that suffered the greatest net loss of blacks between 1965 and 1970, five ranked among the top ten states for attracting blacks between 1995 and 2000. Southern metropolitan areas, particularly Atlanta, led the way in attracting black migrants in the late 1990s. In contrast, the major metropolitan areas of New York, Chicago, Los Angeles, and San Francisco experienced the greatest out-migration of blacks during the same period. Among all ethnic or racial groups, African Americans with the means to do so were more likely than any other to move to the South. Furthermore, college-educated individuals led this new black migration back to the South in the 1990s. Georgia, Texas and Maryland attracted the most black college graduates from 1995 to 2000, while New York suffered the largest net loss.\n\nThen the authors go on to other topics, leaving the question why unanswered. Has there been any studies into why blacks moved back south in the 90s?",
        "created_utc": 1481845721,
        "upvote_ratio": ""
    },
    {
        "title": "Converting Nvivo older version to Nvivo 11",
        "author": "apophis2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5iifyi/converting_nvivo_older_version_to_nvivo_11/",
        "text": "Hello,\n\nCould anyone help me out?\nI have a nvivo file of an older nvivo version. But everytime I try to convert, I get errors. I've tried everything, nothing seems to be working. Anyone here got nvivo 11 and can help me out? (I send the file, you convert it to nvivo 11 and send me back.) It would be a huge help!\n(It's for a paper at the university and I'm using the trial version, maybe that's why the conversion isn't working)\n\nThanks in advance",
        "created_utc": 1481819357,
        "upvote_ratio": ""
    },
    {
        "title": "Reading Max Weber: Suggestions for Beginners",
        "author": "Zaenema",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ihocs/reading_max_weber_suggestions_for_beginners/",
        "text": "I'm doing a pre-master in Public Administration in the Netherlands. Weber is obviously one of the most influential writers in the field, and we have covered a good deal of his theories in class discussion (esp. politics, bureaucracy, rationalization). I think I have a good grip on his ideas and I'm considering a dive into his primary sources. Not articles and books written about Weber, but some of his actual work. What would good starting points be for someone in my case?\n\nBonus question. I'm fluent in Dutch. Considering he was a German writer, would you say I should try to stay as close as possible to the source material by reading him in Dutch as opposed to English?\n\nThanks!",
        "created_utc": 1481810796,
        "upvote_ratio": ""
    },
    {
        "title": "Good books and information on culture and religion of the ancient Americas?",
        "author": "RopeJoke",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ihjei/good_books_and_information_on_culture_and/",
        "text": "Looking for some books on the study of ancient cultures, especially religion, of the peoples in America before Columbus's arrival. I've read books on the Incas, Aztecs(Mexica), Toltecs, etc and Mann's 1491 but I wanted to see what research was out there about time periods before that, such as Clovis and PreClovis eras.\n\n\nAs a bonus question, has anyone read The Great Paleolithic War by David Meltzer? Can't seem to find any reviews on it and just wanted some thoughts on his work, thanks!",
        "created_utc": 1481809019,
        "upvote_ratio": ""
    },
    {
        "title": "The theory that a single important person can change the whole course of history has been long outdated. But why do people keep fixated with that belief?",
        "author": "diporasidi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ih8t9/the_theory_that_a_single_important_person_can/",
        "text": "Look at how people thought how Constantine changed Roman Empire, Colombus changed the way we see our world, Galileo revolutionized science, Napoleon changed the course of modern warfare, Hitler makes the 20th century a disaster, etc. Heck, just a few decades ago there were Michael Hart's [book on that](https://en.wikipedia.org/wiki/Michael_H._Hart#/media/File:The_100_Cover.jpg).\n\nHerbet Spencer has debunked this a century ago, saying \"the genesis of a great man depends on the long series of complex influences\". Why do we keep believing it?",
        "created_utc": 1481804888,
        "upvote_ratio": ""
    },
    {
        "title": "What should comparative studies of welfare state investigate in the new century? What are the gaps that we should fill with courage?",
        "author": "roll_thedice",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ienr0/what_should_comparative_studies_of_welfare_state/",
        "text": "What is the sense of studying comparative public policies if we do not criticize the reality around us? it seems a lack of sense and a mistake because we won't be able to re-write our culture and mindset for generating new policies. And the today it is required! Climate change and its negative impacts, robotization of the society &amp; rising unemployment, financialization of the economy and less importance of the private consumption as the engine of the growth, the failure of the New Liberal ideology and its policies that have shaped the last decades. It is important to engage heavily those issues for attempting to find out a way and transform our societies. But I do not see a \"énal vital\" in Europe, for at least in my little experience, in this direction and an interest to teach to the students new models or show up clearly the mistakes made in the past, the current mistakes like the stupid austerity, and a push toward \"open fields\". Am I heretical? It is important to look at the facts going beyond the ideologies but is not an ideology to believe that the ideologies are dead in the same moment of acceptance of the status quo (conservative/liberal)?\n\nI would like to spend these 2 years of the MA to focus on 1 or more gaps in the academia for giving a sense to the thesis. What are the new trends in the comparative studies that can be stimulating? Next semester I will be lucky to study the labor market policies and I wish to know more about the \"precariat\", how was implemented, and how is possible to limit its damages.\nDo you have thoughts and ideas that you would like to share with me?\n\nI am a MA student (comparative public policy) and I am also a sponge interested to ideas and thoughts which can be an input or an incitement. I think that Self-motivation is all and I wouldn't like to loose it after 1 semester. ",
        "created_utc": 1481765449,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research on how entertainment companies and caregivers should handle children actors so they are more likely to grow up well adjusted?",
        "author": "dresdnhope",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5id3u3/is_there_any_research_on_how_entertainment/",
        "text": "Especially those that become particularly famous. It appears at least anecdotally that many child actors haven't fared well after their shows ended.",
        "created_utc": 1481748718,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | December 14, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5iapxu/theory_wednesday_december_14_2016/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1481724215,
        "upvote_ratio": ""
    },
    {
        "title": "Nations like Japan and Germany are concerned about their declining population, but in what ways is a falling population bad?",
        "author": "Moontouch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ia0ej/nations_like_japan_and_germany_are_concerned/",
        "text": "",
        "created_utc": 1481713452,
        "upvote_ratio": ""
    },
    {
        "title": "What caused the post war economic expansion?",
        "author": "Dawson2089",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i9n85/what_caused_the_post_war_economic_expansion/",
        "text": "",
        "created_utc": 1481706743,
        "upvote_ratio": ""
    },
    {
        "title": "Why are so many comments being removed? What the hell is going on in this sub?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i8o1k/why_are_so_many_comments_being_removed_what_the/",
        "text": "[deleted]",
        "created_utc": 1481690882,
        "upvote_ratio": ""
    },
    {
        "title": "How will the new technologies (e.g. AI, VR) affect people in developing countries?",
        "author": "karakitap",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i7ejk/how_will_the_new_technologies_eg_ai_vr_affect/",
        "text": "[removed]",
        "created_utc": 1481675753,
        "upvote_ratio": ""
    },
    {
        "title": "Is having an intense sex drive pre-puberty necessarily abnormal or indicative of abuse?",
        "author": "talkradiozz",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i71vl/is_having_an_intense_sex_drive_prepuberty/",
        "text": "[removed]",
        "created_utc": 1481671889,
        "upvote_ratio": ""
    },
    {
        "title": "How do religions spread?",
        "author": "Flying_Rainbows",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i6fdr/how_do_religions_spread/",
        "text": "In general people seem to dislike and fight people with different religions. So how do people just take over other people's religion?",
        "created_utc": 1481665479,
        "upvote_ratio": ""
    },
    {
        "title": "Good online courses to learn how to conduct social science research using online surveys?",
        "author": "ireallyhateplants",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i5qlu/good_online_courses_to_learn_how_to_conduct/",
        "text": "I recently did a survey and got 300+ respondents of the demographic I wanted, but I realized I didn't quite know what I was doing when it comes to phrasing questions and interpreting the results.\n\nWhat are some good, relatively introductory, online resources that would help me become a bit more proficient in this area? (I don't have a math or stats background, unfortunately)\n\nThanks!",
        "created_utc": 1481658710,
        "upvote_ratio": ""
    },
    {
        "title": "Help quantifying the positivity/negativity of newspaper articles",
        "author": "moobsofsteel",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i5k3n/help_quantifying_the_positivitynegativity_of/",
        "text": "Hi, I am a biology student in the Uk and my dissertation project requires me to determine how positive or negative newspaper articles are, but I cannot find any relevant methods in the papers I have looked at.\n\nDoes anyone here know how I could find a paper with a method that I could use as a template? My idea at the moment is to read through each article, giving a +1 for any positive language and -1 for any negative language with emotive pictures getting a +/-3 for either. I could use some critical feedback on how to improve my method as it seems very rudimentary, but as I said at the start I am not a sociology student.\n\nAny help is welcome, cheers.",
        "created_utc": 1481656970,
        "upvote_ratio": ""
    },
    {
        "title": "Do these regions have a lasting Protestant imprint on their cultures?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5i5foc/do_these_regions_have_a_lasting_protestant/",
        "text": "[deleted]",
        "created_utc": 1481655780,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a policy mechanism that would result in people without social relations getting friendships?",
        "author": "scithion",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hzugj/is_there_a_policy_mechanism_that_would_result_in/",
        "text": "The authors of the study [discussed in this article](http://www.bbc.com/news/uk-38285223) \"demanded 'a new role from the state'\", presumably towards implementation of their finding that social relations can play a pivotal role in happiness.\n\nIs there a policy mechanism (presumably, not an economic measure) that would do result in people without social relations -in particular, affluent such people- getting friendships?",
        "created_utc": 1481582787,
        "upvote_ratio": ""
    },
    {
        "title": "Black Student Union and White Student Union",
        "author": "Pudnite",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hzccp/black_student_union_and_white_student_union/",
        "text": "Hi! So at my college we have a Black Student Union. The thought occurred to me if there was a White Student Union it would probably be considered a hate group. I googled White Student Union and discovered there's such thing and basically just because of its name, it's considered a white supremacist group. I'm curious... why does only \"white groups\" get labeled as such racist groups but other organizations such as \"black student union\" and other race based organizations do not? It seems a bit biased in my opinion and I'm curious why it's this way... ",
        "created_utc": 1481577774,
        "upvote_ratio": ""
    },
    {
        "title": "At the end of his time in Iraq was Ruhollah Khomeini really tricked onto an airplane that was forced to county hop until finally being allowed to land in France?",
        "author": "Loktharion",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hyuzg/at_the_end_of_his_time_in_iraq_was_ruhollah/",
        "text": "I've made friends with an Iraqi expat who runs the liquor store near me, he tells a lot of interesting stories about Iraq, some of them are off historically but they're fascinating tales and I never correct him. \n\nAccording to liquor store friend the shah of Iran threatened to invade Iraq if they did not hand over Khomeini, fearing a civil war if they did the Iraqis tricked Khomeini onto a plane and forced the pilot at gunpoint to \"get out of Iraq with him and never return\". The pilot apparently tried landing in Egypt, Lebanon, basically everywhere in the Middle East, each country essentially said if you land here we're going to blow up the plane (apparently they did let them land but only for fuel). Eventually the plane landed in France and they let him chill for a bit until the Iranian revolution and his return. \n\nIf so it's a fascinating glimpse into middle eastern politics as well as a genius move by the Iraqis but I can not find any source.",
        "created_utc": 1481573052,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any societal benefits to racism/xenophobia?",
        "author": "sorry_for_itself",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hypbr/are_there_any_societal_benefits_to/",
        "text": "I just saw an announcement from Twitch.tv stating they are introducing an AutoMod in order to:\n\n&gt; more accurately block hateful or inappropriate content\n\nNow, I do not like censorship 99% of the time (I realize there are situations where censorship is useful), but when looking at this, I can't form any argument against this other than an emotional plea for freedom of expression. I'm of the mindset that anyone should be able to express their opinions, because at the end of the day their opinion is either appealing and will spread, or their opinion is disgusting, and the faults will hopefully be outlined through dialogue.\n\nSo I guess the crux of my question is this: does banning/censoring this type of discussion have any sort of negative impact on society/culture aside from the obvious censorship aspect? Have these thoughts and discussions in the past led to any positives?\n\n",
        "created_utc": 1481571556,
        "upvote_ratio": ""
    },
    {
        "title": "Why is \"Jew\" a socially acceptable term when \"Jap\" is not despite that both have historically been used as slurs?",
        "author": "8lbs6ozBebeJesus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hwvw1/why_is_jew_a_socially_acceptable_term_when_jap_is/",
        "text": "[removed]",
        "created_utc": 1481553159,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | December 12, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hwqoq/monday_reading_and_research_december_12_2016/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1481551368,
        "upvote_ratio": ""
    },
    {
        "title": "Why are a disproportionate amount of the most successful comedians liberal atheists?",
        "author": "Sweanix",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hvul3/why_are_a_disproportionate_amount_of_the_most/",
        "text": "(it could just be that I'm not exposed to others) but it seems of the top people in comedy are more offten than not liberal atheists are over represented. Is there something about them that makes them more universally funny?\nUpdate. Thanks for the responses I'm curious as to why these people seem to be at the levels they are how much it is the individual (liberal atheists is just the best personality for humour) and how much a society of people not of that demographic just accept secular left humour more than that of another faith or their own political standpoint.",
        "created_utc": 1481536828,
        "upvote_ratio": ""
    },
    {
        "title": "How would you explain the budgeting process and how it could be improved ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hunu1/how_would_you_explain_the_budgeting_process_and/",
        "text": "[removed]",
        "created_utc": 1481517152,
        "upvote_ratio": ""
    },
    {
        "title": "Are we being set up to live in grave poverty via unpayable debt?",
        "author": "rumdiary",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hrhw9/are_we_being_set_up_to_live_in_grave_poverty_via/",
        "text": "It's becoming impossible to live without vast amounts of personal debt.  See: Health and Education costs.\n\nWhat are the chances the Establishment is doing this on purpose, not just to tie us to \"The System\" but also so they can one day pull the rug from under everyone in the 99% bracket, forcing them into poverty and dependence?\n\nAsking because I'm extremely hesitant to buy a home because it's a lifetime of debt.  If avg national salary dips or house prices plummet I'd be doomed.",
        "created_utc": 1481480913,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any truth to the meme that American women are more selective in relationships than men are? If so, how widespread is this across cultures?",
        "author": "19djafoij02",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hrcf0/is_there_any_truth_to_the_meme_that_american/",
        "text": "",
        "created_utc": 1481479323,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a standard measure of representativeness",
        "author": "karmaceutical",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hpvft/is_there_a_standard_measure_of_representativeness/",
        "text": "I was thinking it would be interesting if we measured the likelihood that a randomly selected voting age individual would claim their US Rep, Senators and Pres conform to their interests. Is there anything like that?",
        "created_utc": 1481459507,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any differences between the Chinese concept of \"face\" and the western idea of \"image\"?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hp82f/are_there_any_differences_between_the_chinese/",
        "text": "",
        "created_utc": 1481445477,
        "upvote_ratio": ""
    },
    {
        "title": "How do you feel about being a part of society? (Poll)",
        "author": "sashimibe4salami",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hmm1o/how_do_you_feel_about_being_a_part_of_society_poll/",
        "text": "[removed]",
        "created_utc": 1481407302,
        "upvote_ratio": ""
    },
    {
        "title": "Who runs Change.org? Have the petitions been successful in influencing any government organization to make a significant change?",
        "author": "niviness",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hm4g5/who_runs_changeorg_have_the_petitions_been/",
        "text": "[removed]",
        "created_utc": 1481401586,
        "upvote_ratio": ""
    },
    {
        "title": "Researcher for an interview about sentiment analysis",
        "author": "Marvin91",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hlijt/researcher_for_an_interview_about_sentiment/",
        "text": "Hi everyone,\n\nI'm working on a graduation thesis, about sentiment analysis. I'm using a methodological approach and I'm looking to interview some researchers who studied and use this technique. I basically need two: one who works for a public institution and one who works for a private enterprise. Do you guys know some \"famous\" researcher who use sentiment analysis?\n\nThanks!",
        "created_utc": 1481394658,
        "upvote_ratio": ""
    },
    {
        "title": "Is Islamic terrorism solely caused by imperialism?",
        "author": "malatester",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hl1a8/is_islamic_terrorism_solely_caused_by_imperialism/",
        "text": "[removed]",
        "created_utc": 1481389145,
        "upvote_ratio": ""
    },
    {
        "title": "How does our vague understanding of reality and consciousness limit how we understand the world?",
        "author": "stalematedizzy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hjok4/how_does_our_vague_understanding_of_reality_and/",
        "text": "[removed]",
        "created_utc": 1481368127,
        "upvote_ratio": ""
    },
    {
        "title": "What is the vickrey-clarke-groves mechanism?",
        "author": "faguzzi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hg1i1/what_is_the_vickreyclarkegroves_mechanism/",
        "text": "",
        "created_utc": 1481314631,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | December 09, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5hdw9p/friday_freeforall_december_09_2016/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1481292180,
        "upvote_ratio": ""
    },
    {
        "title": "Survey: trust and social motives in the sharing economy (AirBnB)",
        "author": "oguzhan61",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ha4tg/survey_trust_and_social_motives_in_the_sharing/",
        "text": "[removed]",
        "created_utc": 1481237326,
        "upvote_ratio": ""
    },
    {
        "title": "Can we trace \"social outcasts\" family trees back hundreds of years? Details inside...",
        "author": "secondnameIA",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h92ho/can_we_trace_social_outcasts_family_trees_back/",
        "text": "If you are from a small town you often know of \"that family\" that has all the bad children.  Their parents are often trouble makers before them.  And the grandparents before them, too.\n\nHow far back can we trace this type of behavior?  Do problem families all trace back to one clan 1,000 years ago?  ",
        "created_utc": 1481226642,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for books and/or academics on democratization/social movement. Want to transition from history to sociology for PhD.",
        "author": "Angiras",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h8kgi/looking_for_books_andor_academics_on/",
        "text": "Hi, I'm looking for a general list or suggestion on scholars, books, and articles that one deems as relevant to the field of social movement and/or democratization. \n\nI'm originally from a history background for my BA and MA so I'm unfamiliar with the relevant journals, persons and even specific subfields except for a scant few. \n\nI am considering a jump into a sociology PhD program so I'd like to look at the scholarship beforehand to see if it would suit me or just go back to history. \n\nDo I just jump into Habermas and Tilly for democratization? If so, what about for social movement? Should I just look at the Blackwells guide on social movement and go through the excerpts?\n\nI have university library access available so I've just been picking out articles that interest me from journals like the American Sociological Review and the Annual Review of Sociology. Knowing the absolute hogwash I've seen on some history journals back in my day I feel like I'm reading potential landmines and would appreciate some guidance. \n\nA syllabus from your courses or  general name drops would be splendid. \n\nI tried looking at the book lists on the side bar but I came up with blank pages. Also, I would like more recent literature if possible.\n\nEdit: Thanks for the words of advice everyone.",
        "created_utc": 1481221746,
        "upvote_ratio": ""
    },
    {
        "title": "Books and persons in social movement/labor and/or democratization.?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h8hfj/books_and_persons_in_social_movementlabor_andor/",
        "text": "[deleted]",
        "created_utc": 1481220915,
        "upvote_ratio": ""
    },
    {
        "title": "Comparing product price/quality/amount with executive compensation?",
        "author": "random_number_string",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h7zq3/comparing_product_pricequalityamount_with/",
        "text": "Has anyone ever tracked a product's price/quality/amount versus the company's executive compensation?\n\nIn other words, over time some companies provide the same product but raise prices, others keep the prices about the same and lower the quality of the product, and others do both.\n\nIs there any correlation with these different strategies and the amount of a company's executive compensation?",
        "created_utc": 1481216047,
        "upvote_ratio": ""
    },
    {
        "title": "Political knowledge is positively correlated with being or leaning Republican and negative correlated with being or leaning Democrat. Do you think that datum is explained by the social-conservative or by the economically-conservative wing of the Republican party?",
        "author": "shockingdevelopment",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h74mr/political_knowledge_is_positively_correlated_with/",
        "text": "(See the citations in n. 42 ch. 2 of Brennan, _Against Democracy_.) ",
        "created_utc": 1481206634,
        "upvote_ratio": ""
    },
    {
        "title": "MaxQDA woes!",
        "author": "Poepopdestoep",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h6wji/maxqda_woes/",
        "text": "Hi all.\n\nI've spent hours coding transcripts (open coding) and now I want to axially code them, by combining the codes that I've made. \n\nNow, if I want to merge two codes, I have to right click, select move, right click on the other code, select move again. Wait for a pop up menu, click yes and then wait for the two codes to be combined. You'd think that dragging and dropping would work, or that I'd AT LEAST be able to bypass the confirmation pop up.\n\nI searched but couldn't find another way. Did this app even get tested?\nPlease tell me there's another way. There is right?",
        "created_utc": 1481203810,
        "upvote_ratio": ""
    },
    {
        "title": "How common is it for a leader of a country to publicly single out a single citizen in some kind of personal attack?",
        "author": "tolos",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h6kag/how_common_is_it_for_a_leader_of_a_country_to/",
        "text": "Specifically, not an official government position, and aimed at an individual, not a community, business, organization, etc. If you need a timeframe, assume 20th century.  \n\nThis is a politically motivated question, but I have no idea if this was common in other 1st world countries, democracies, dictatorships, etc",
        "created_utc": 1481198757,
        "upvote_ratio": ""
    },
    {
        "title": "[Econ] Why would printing less money cause deflation in the modern world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h5de3/econ_why_would_printing_less_money_cause/",
        "text": "I understand that if you lower the money supply, then each bill is more valuable, so inflation goes down (you can buy more goods with the same bill). However, a lot of society is cashless, so printing less money won't actually reduce anything since our money are just numbers on a screen. It's not like you are reducing the number of times that banks can write \"$1\" in their computers. \n\nI understand that some people still remain unbanked, but assume a society in which everyone only carries 20$ and pays for 99% of transactions with a credit card. Will money printing actually affect inflation? If so, what's the mechanism.\n\nThanks",
        "created_utc": 1481177430,
        "upvote_ratio": ""
    },
    {
        "title": "Gender dysphoria among the blind.",
        "author": "Abadoobie",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h50ge/gender_dysphoria_among_the_blind/",
        "text": "This may sound daft but is there any difference in the prevalence of gender dysphoria among the blind? Is there any difference in how that dysphoria is satisfied?",
        "created_utc": 1481172375,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any culture that does not place ego transcendence in high regard?",
        "author": "Josent",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h4hdk/is_there_any_culture_that_does_not_place_ego/",
        "text": "",
        "created_utc": 1481165764,
        "upvote_ratio": ""
    },
    {
        "title": "How does the estimated illegal immigrant population of the USA compare to G20/OECD country estimates, on a per capita basis?",
        "author": "HunkaHunka",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h3qrd/how_does_the_estimated_illegal_immigrant/",
        "text": "Estimates of legal migrant populations are [easy enough to find](http://www.politifact.com/florida/statements/2015/may/13/marco-rubio/does-united-states-have-highest-number-immigrants-/), but for obvious reasons estimates of illegal populations are more problematic. \n\nI'm curious to know whether the US phenomenon of illegal migrants is broadly comparable to other wealthy nations, including the EU generally, on a per capita basis, or if the US is dealing with something unique. \n\nEDIT: A summary of US statistics can be found [here](http://www.csmonitor.com/2006/0516/p01s02-ussc.html), and one of the EU is at http://www.europarl.europa.eu/RegData/etudes/BRIE/2015/554202/EPRS_BRI(2015)554202_EN.pdf. I have yet to find an international treatment, and the [Wiki entry for illegal immigration](https://en.wikipedia.org/wiki/Illegal_immigration) is not particularly helpful. ",
        "created_utc": 1481157198,
        "upvote_ratio": ""
    },
    {
        "title": "How would a \"Bretton woods system 2\" Effect the world economy?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h31dt/how_would_a_bretton_woods_system_2_effect_the/",
        "text": "[removed]",
        "created_utc": 1481149707,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think it is possible for one person to create social change?",
        "author": "vnford",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h2130/do_you_think_it_is_possible_for_one_person_to/",
        "text": "[removed]",
        "created_utc": 1481139852,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | December 07, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5h012z/theory_wednesday_december_07_2016/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1481119407,
        "upvote_ratio": ""
    },
    {
        "title": "How would you increase high-education, high-income fertility rates?",
        "author": "vaticidalprophet",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gzuvp/how_would_you_increase_higheducation_highincome/",
        "text": "Childbearing incentives (e.g. baby bonus) tend to be disproportionately embraced by the low-income population due to being more significant for them. If a Western low-fertility government wanted to increase birth rates amongst the upper classes and the highly educated, what incentives could they create to do so? A long time ago I read about tax breaks being used in this context, but I can't find anything about that now.",
        "created_utc": 1481117171,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence that the transition in to adulthood is a particularly critical developmental period?",
        "author": "Sytadel",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gzgim/is_there_any_evidence_that_the_transition_in_to/",
        "text": "Background: I used to manage a service learning centre at my state University and one of our frequent communications tools/arguments for more resources was what I called the \"second critical period,\" arguing that 0-4yrs is the most critical developmental period growing up but that, paradoxically, 16-18yrs was a close second-- albeit for cultural reasons.\n\nIn this period a typical young person's geography expands hugely, they likely start travelling independently by car/PT, drugs, sex, independent learning all happen, first jobs happen, drinking alcohol happens (at least in Australia), independent holidays and long-distance travel, the shattering of old friendship circles and the formation of new ones. It's a cataclysmic time. \n\nFor me, it was my first girlfriend, losing my virginity, a WoW addiction, flunked studies, and delivering pizzas in my old Mazda 626. My life hit some new highs but then got derailed hugely and sent me in to a melancholy that would last years. Just a year before all this, my world was very small-- walking to and from school and the most excitement I got was making out in drama class.\n\nI'm sure I read it somewhere, but it became something I repeated so much that I lost the source material. I'm now in a not hugely dissimilar role working with youth aged 15-18, though now in a very different cultural context (East Africa).\n\nJust wondering if there's any evidence to support this claim.",
        "created_utc": 1481111176,
        "upvote_ratio": ""
    },
    {
        "title": "How come on the FBIs most wanted list some suspects who are clearly not white, are considered white under their race?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gw3dy/how_come_on_the_fbis_most_wanted_list_some/",
        "text": "[deleted]",
        "created_utc": 1481064406,
        "upvote_ratio": ""
    },
    {
        "title": "How do we learn and pass down ideas of shame?",
        "author": "bonbear",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gvs48/how_do_we_learn_and_pass_down_ideas_of_shame/",
        "text": "Is it different from culture to culture and between time periods? Examples and case studies appreciated and other recommended reading appreciated. Thanks so much in advance!",
        "created_utc": 1481061315,
        "upvote_ratio": ""
    },
    {
        "title": "Is gender entirely a social construct? Are there certain realities about gender that arise out of biology?",
        "author": "bitterbatterbutter",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gvlsq/is_gender_entirely_a_social_construct_are_there/",
        "text": "",
        "created_utc": 1481059591,
        "upvote_ratio": ""
    },
    {
        "title": "Why are American prisons awful and why is there backlash against reform?",
        "author": "Aurora_Kronos",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gvaj1/why_are_american_prisons_awful_and_why_is_there/",
        "text": "I'm looking for context surrounding American prisons. What caused them to get as bad as they have? Why is it that many Americans share a strong desire for capital punishment? What prevents reform from taking place?",
        "created_utc": 1481056581,
        "upvote_ratio": ""
    },
    {
        "title": "What are the seminal sociological/anthropological texts on \"Urban Appalachia\"?",
        "author": "shitpostmodern",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gv6tw/what_are_the_seminal_sociologicalanthropological/",
        "text": "",
        "created_utc": 1481055583,
        "upvote_ratio": ""
    },
    {
        "title": "Terms for imperialist tactics.",
        "author": "anonoman925",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gu7km/terms_for_imperialist_tactics/",
        "text": "I can only describe the phenomenon, but I don't know if there's a term for them. \n\nLike using the threat of force without threatening force is hegemony. \n\n- what is it when an imperializing force favors one group over another in order to create proxy control?\n\n- what is it where you create a famine then say \"look, they're underdeveloped\". We need to help them. \n\n- where you abuse a trade relationship to where you create violence on their side then play the victimized guest. ",
        "created_utc": 1481045920,
        "upvote_ratio": ""
    },
    {
        "title": "What is the relationship between Islam and violence in the context of the Middle East? Is Islam conducive to violence?",
        "author": "Seanp50",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gtjt4/what_is_the_relationship_between_islam_and/",
        "text": "Any texts appreciated.",
        "created_utc": 1481039363,
        "upvote_ratio": ""
    },
    {
        "title": "How would you define \"Politics\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gszmp/how_would_you_define_politics/",
        "text": "[deleted]",
        "created_utc": 1481032995,
        "upvote_ratio": ""
    },
    {
        "title": "What will historical fiction of the future get wrong?",
        "author": "blevster",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gswat/what_will_historical_fiction_of_the_future_get/",
        "text": "[removed]",
        "created_utc": 1481031787,
        "upvote_ratio": ""
    },
    {
        "title": "Has the Electoral College ever been challenged in the courts?",
        "author": "blindscience",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gr7nb/has_the_electoral_college_ever_been_challenged_in/",
        "text": "It seems like there have been a lot constitutional amendments and rulings about the concept of \"One man one vote\". Have any of these been used to challenge the Electoral College in court?",
        "created_utc": 1481003029,
        "upvote_ratio": ""
    },
    {
        "title": "Are exchange rates elastic?",
        "author": "No_Kids_for_Dads",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gr27p/are_exchange_rates_elastic/",
        "text": "I'm not really sure 'elastic' is the right word, but here's something I don't understand about exchange rates:\n\nthe exchange rate between the US and say, New Zealand is 1.5 (1 usd=1.5 nzd), and a gallon of milk is about 3 nzd/usd in both places\n\nthe exchange rate between the US and zimbabwe is 400, but a gallon of milk sure as hell is more than 4 zimbabwean dollars\n\nSo it seems like value is inelastic to the exchange rate? or at least that exchange rate alone should not be enough to determine strength of one currency compared to another\n\nI'm familiar with 'the big mac index', would it be right to say that it's a measure of how 'inelastic' the relationship is?\n\nwhat causes the discrepancy of purchasing power between currencies?",
        "created_utc": 1481000891,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] How would election results be different if polls were open for a week, and people could see the results throughout the week?",
        "author": "shazbots",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gpqug/question_how_would_election_results_be_different/",
        "text": "I'm not sure if this is the correct subreddit for this question, but this is more of a theory based question. How would election results change if polls were longer than a day long? Let's say 2 days, up to a week, and people could see the cumulative results throughout the week. How could that affect voter turnout, and the results? Would it encourage more people to vote? (Maybe from the \"losing side?\") Would it just encourage more people to procrastinate on voting?",
        "created_utc": 1480984930,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Why are there still electors from multiple parties for the electoral college. (Ex: Red wins NJ, 14 GOP electors, but in wiki, there are 14 electors from 800 parties. Who goes to the state capitol.)",
        "author": "KellinQuinn__",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gpowl/eli5_why_are_there_still_electors_from_multiple/",
        "text": "Edit:  Sorry about attaching ELI5.  Just realized.  :P",
        "created_utc": 1480984313,
        "upvote_ratio": ""
    },
    {
        "title": "Is Scandinavian society superior to the US?",
        "author": "usscan",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5govkb/is_scandinavian_society_superior_to_the_us/",
        "text": "[removed]",
        "created_utc": 1480975650,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it that (when written in English) Japanese names are written given name first, family name last, but Korean and Chinese names are written family name first, given name last?",
        "author": "kturtle17",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5goucf/why_is_it_that_when_written_in_english_japanese/",
        "text": "I'm not sure if this is the right place to post this question but this seemed like the best fit for this question from what I found. To clarify my question: Japanese names are written with the family name first(often called \"last name\") and the given name(\"first name\") last. This is also true for Korean and Chinese names. However when written in English, Japanese names are written out given name, then family name. A few quick examples:\nThe Prime Minister of Japan is referred to as [Shinzo Abe](https://www.washingtonpost.com/world/japanese-prime-minister-to-visit-pearl-harbor/2016/12/05/290c6a64-bad6-11e6-91ee-1adddfe36cbe_story.html) instead of Abe Shinzo as he would be called in Japanese. But the Korean president is called [Park Geunhye](http://www.cnn.com/2016/12/03/asia/south-korea-impeach-park/) which is the correct name order in Korean as well. And then there's [Xi Jinping](http://www.theatlantic.com/international/archive/2015/04/xi-jinping-china-corruption-political-culture/389787/) of China. I could post a lot of other examples of Japanese/Korean/Chinese names but my main point is that: Only the Japanese name is \"reversed\" when written in English. My question is why is that? Why are Japanese names reversed? Why doesn't English reverse Korean or Chinese names?",
        "created_utc": 1480975311,
        "upvote_ratio": ""
    },
    {
        "title": "(USA) Are Republican voters wealthier or poorer than Democrats?",
        "author": "cranialflux",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5goind/usa_are_republican_voters_wealthier_or_poorer/",
        "text": "In the USA for the most recent presidential and congressional elections for which data is available, is there a correlation between wealth and party affiliation? It seems to be a commonly accepted fact that the very poor and very rich vote for the Republican Party, and the middle class votes for the Democratic Party. However I've read [this piece](http://fivethirtyeight.com/features/the-mythology-of-trumps-working-class-support/) which challenges this perception in regards to the working class.\n\nSubquestion: Is it the case that in red states the wealthier people vote Republican while the poorer people vote Democrat?",
        "created_utc": 1480972081,
        "upvote_ratio": ""
    },
    {
        "title": "Why did the preference for economic liberalisation policies re-emerge in the post-1990 period?",
        "author": "ohanakawaii",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gnht3/why_did_the_preference_for_economic/",
        "text": "What led to the historical dynamics that led to a fundamental questioning of the role of the state in economic development? How has neo-liberalism succeeded in reviving this after hte 1990 period? ",
        "created_utc": 1480962103,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think police officers using too much force is something new or is it easier to catch because of the wide availiablity of cellphone cameras?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gmxsj/do_you_think_police_officers_using_too_much_force/",
        "text": "[deleted]",
        "created_utc": 1480956691,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | December 05, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gm1d1/monday_reading_and_research_december_05_2016/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1480946569,
        "upvote_ratio": ""
    },
    {
        "title": "How are prices 'corrected' to reach their true value?",
        "author": "ds1749320",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5glq1v/how_are_prices_corrected_to_reach_their_true_value/",
        "text": "I've never fully understood how prices reach their inherent value. If the majority of investors are using an 'incorrect' means of valuation, wouldn't that by default become the 'right' one? Stemming from the Keynes beauty contest idea of markets (https://en.wikipedia.org/wiki/Keynesian_beauty_contest), if people on the whole overvalue an asset, the price would be bid up regardless of the fact that it is not 'worth' that amount. ",
        "created_utc": 1480942077,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a depression/suicide epidemic in the western world? Or are these things just becoming more visible?",
        "author": "doublementh",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gje7t/is_there_a_depressionsuicide_epidemic_in_the/",
        "text": "",
        "created_utc": 1480905004,
        "upvote_ratio": ""
    },
    {
        "title": "How does EcoTourism in Costa Rica affect the native people in a negative way? Please provide statistics.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gi6mj/how_does_ecotourism_in_costa_rica_affect_the/",
        "text": "[deleted]",
        "created_utc": 1480890768,
        "upvote_ratio": ""
    },
    {
        "title": "Studies show that belgium, turkey, and sweden have the highest voter turnout in the world. Why is this?",
        "author": "Mr-internet",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gi06z/studies_show_that_belgium_turkey_and_sweden_have/",
        "text": "[source](http://www.pewresearch.org/fact-tank/2016/08/02/u-s-voter-turnout-trails-most-developed-countries/)",
        "created_utc": 1480888796,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if more men learned pick up techniques to get women?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ghlt1/what_would_happen_if_more_men_learned_pick_up/",
        "text": "[removed]",
        "created_utc": 1480884521,
        "upvote_ratio": ""
    },
    {
        "title": "Comparison on Postmodern theory and functionalist theory",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ggx97/comparison_on_postmodern_theory_and_functionalist/",
        "text": "[deleted]",
        "created_utc": 1480877237,
        "upvote_ratio": ""
    },
    {
        "title": "Strauss-Howe Generational Theory",
        "author": "quantum_metaphysics",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ggogo/strausshowe_generational_theory/",
        "text": "I've recently become very interested in the Strauss-Howe generational theory, and I'm wondering which of Strauss and Howe's books I should read. Normally I would prefer to read the original that laid out the theory, but I also feel like it might be better to read the most recent, since it will be the most topical, and it is because of recent events that I am especially interested in the theory.\nFor reference, I am a graduate student in cognitive neuroscience, so I generally prefer empirical research, and I've heard that one of the criticisms of the Strauss-Howe books is that they do not do enough to empirically ground the theory. However, I was very interested in philosophy and sociology as an undergrad, so I can appreciate a good theory in its own right.",
        "created_utc": 1480874610,
        "upvote_ratio": ""
    },
    {
        "title": "How can patents in the drugs industry lead to total monopoly? Where are antitrust laws to prevent exploitation?",
        "author": "phambach",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gepjz/how_can_patents_in_the_drugs_industry_lead_to/",
        "text": "http://www.nytimes.com/2015/09/21/business/a-huge-overnight-increase-in-a-drugs-price-raises-protests.html\n\n\"The drug, called Daraprim, was acquired in August by Turing Pharmaceuticals, a start-up run by a former hedge fund manager. Turing immediately raised the price to $750 a tablet from $13.50, bringing the annual cost of treatment for some patients to hundreds of thousands of dollars.\"\n\n\"Cycloserine, a drug used to treat dangerous multidrug-resistant tuberculosis, was just increased in price to $10,800 for 30 pills from $500 after its acquisition by Rodelis Therapeutics.\"\n\n\"Valeant Pharmaceuticals acquired two heart drugs, Isuprel and Nitropress, from Marathon Pharmaceuticals and promptly raised their prices by 525 percent and 212 percent respectively.\"\n\n\"Doxycycline, an antibiotic, went from $20 a bottle in October 2013 to $1,849 by April 2014, according to the two lawmakers.\"\n\nI'm not familiar with US laws so pls ELI5. Is it true that the cost of mass producing a rare type of drug like Daparim can be multiple times higher than that of creating only a single tabloid? If yes, where does the money go to?",
        "created_utc": 1480843318,
        "upvote_ratio": ""
    },
    {
        "title": "Bourdieu: Where to start?",
        "author": "fefe93",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5geo2j/bourdieu_where_to_start/",
        "text": "Dear all,\n\nI'm an economics student and recently got very interested in Bourdieu's thoughts. Since he wrote a ton of books, I'd like to know whether it makes sense to start reading one of his books (ideally one that includes a lot of his most interesting thoughts) or if it makes more sense to read a summary-book?\n\nThank you in advance ;)",
        "created_utc": 1480842338,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Indigenous ancestry a source of pride in the United States but a source of shame in Latin America?",
        "author": "AlphaDog85",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gdrla/why_is_indigenous_ancestry_a_source_of_pride_in/",
        "text": "After watching Spanish-language soap operas and then visiting Latin America, I noticed that dark skin and other indigenous characteristics are viewed as undesirable and associated with lower socio-economic status. My first-generation Mexican American friend tells me her parents constantly pressure her to marry a *güero* (white person) in order to *mejorar la raza*, meaning bless her posterity with more desirable features. \n\nIn the US, by contrast, many people claim to have indigenous ancestry and wear it as a badge of pride. Even if it's something as insignificant as being 1/16th Cherokee, people will flaunt it. So I'm wondering, given the history of racism against Native Americans throughout this continent, what accounts for these differences in attitude?\n",
        "created_utc": 1480825779,
        "upvote_ratio": ""
    },
    {
        "title": "What's the difference between fake news and propaganda?",
        "author": "delitomatoes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gd6cm/whats_the_difference_between_fake_news_and/",
        "text": "",
        "created_utc": 1480817211,
        "upvote_ratio": ""
    },
    {
        "title": "How prevalent are secular/Atheist Conservatives? What are the reasons underlying their political persuasion?",
        "author": "ChocoCroc",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gc2pj/how_prevalent_are_secularatheist_conservatives/",
        "text": "[removed]",
        "created_utc": 1480803130,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most common reasons for couples to break up?",
        "author": "ToughAsGrapes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5gasb9/what_are_the_most_common_reasons_for_couples_to/",
        "text": "",
        "created_utc": 1480788302,
        "upvote_ratio": ""
    },
    {
        "title": "Why do many people feel the need to give others a complete tour of their home when they visit for the first time?",
        "author": "jasenlee",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ga7tp/why_do_many_people_feel_the_need_to_give_others_a/",
        "text": "This might seem like an odd question but I've always wondered why when I visit people for the first time that they need to show me all the rooms in their house and explain things to me about each one of them. \n\nI'm really only interested in your company, conversation and knowing where the bathroom and kitchen are. Maybe a few other things but I don't need a complete guided tour of your home. \n\nThoughts?",
        "created_utc": 1480781504,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for primary sources about white and black experiences with the GI Bill in the 1950s",
        "author": "firstconsul",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5g8yo2/looking_for_primary_sources_about_white_and_black/",
        "text": "Anyone got any leads? I want to design a lesson plan for high school about whether you can regard the GI Bill as \"white affirmative action\"",
        "created_utc": 1480759858,
        "upvote_ratio": ""
    }
]