[
    {
        "title": "Are there any contemporary works about the American worker as a disposable, replaceable commodity?",
        "author": "tereddits",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fp1tx/are_there_any_contemporary_works_about_the/",
        "text": "I feel like I can hear people chuckling as they read the title of this post, I know this covers a lot. I'm interested in all professions, from office worker to aspiring actor or actress, full-time employee to seasonal part-time. Broadly, I'm interested in learning about the extent to which we exist in a culture of disposable and easily replaceable labor. ",
        "created_utc": 1511723982,
        "upvote_ratio": ""
    },
    {
        "title": "Studies on the relationship between transfer payments and the poverty rate in the US?",
        "author": "LightsOut75",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7foogs/studies_on_the_relationship_between_transfer/",
        "text": "I am interested in researching the effect transfer payments and tax expenditures have on the poverty rate, and I am curious as to what the current literature says. What factors seem to matter the most in driving the poverty rate? ",
        "created_utc": 1511720772,
        "upvote_ratio": ""
    },
    {
        "title": "Why has the #metoo discussion/exposure of sexual abusers started to happen recently.",
        "author": "sceptic_tank",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fo86j/why_has_the_metoo_discussionexposure_of_sexual/",
        "text": "Rumours about a lot of the abusers have been around for years and sexual abuse is nothing new. Has anything changed recently in society that allowed the discussion to take such a huge shape. ",
        "created_utc": 1511716748,
        "upvote_ratio": ""
    },
    {
        "title": "Why has language developed as it has?",
        "author": "BuildBetterWorld",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fmmms/why_has_language_developed_as_it_has/",
        "text": "[removed]",
        "created_utc": 1511699531,
        "upvote_ratio": ""
    },
    {
        "title": "What do the terms right wing and left wing mean or signify? Is there a set of widely accepted criteria?",
        "author": "Gh0stthedirew0lf2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7flxaw/what_do_the_terms_right_wing_and_left_wing_mean/",
        "text": "",
        "created_utc": 1511688281,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for the American Government to do to Russia what Russia is currently doing to the American public?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fl33h/is_it_possible_for_the_american_government_to_do/",
        "text": "[deleted]",
        "created_utc": 1511676118,
        "upvote_ratio": ""
    },
    {
        "title": "Which theory and methodology should I use to study the Alt-Right?",
        "author": "ShicklgruberDude",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fhzds/which_theory_and_methodology_should_i_use_to/",
        "text": "[removed]",
        "created_utc": 1511643839,
        "upvote_ratio": ""
    },
    {
        "title": "Who are the interesting Marxist anthropologists, historians, or sociologists being publisher today?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fhy6a/who_are_the_interesting_marxist_anthropologists/",
        "text": "How may I access their material?",
        "created_utc": 1511643540,
        "upvote_ratio": ""
    },
    {
        "title": "Modern Slavery",
        "author": "snuckss",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fhhe7/modern_slavery/",
        "text": "[removed]",
        "created_utc": 1511639165,
        "upvote_ratio": ""
    },
    {
        "title": "Is perception truly more important than reality? Is reality truly subjective based on our perceptions?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ff9xo/is_perception_truly_more_important_than_reality/",
        "text": "There is a quote by Ivanka Trump saying: \n\n*\"Perception is more important than reality. If someone perceives something to be true, it is more important than if it is in fact true.\"*\n\nPersonally, I do believe that perception is more important than reality because it influences us how we view reality.\n\nThis has been a question that many philosophers often questioned and this goes through the field of epistemology, ontology and other forms of metaphysics\n\nNot only this was proven by Einstein's theory of relativity with regards to perception when it comes to time, but I think our perceptions of reality are constantly being influenced everyday in a variety of ways.\n\nWe have social norms and social values that may influence us how we perceive our ingroup members and our outgroup members.\n\nWe have influences by the media through the use of gatekeeping and sensationalism to influence how we view certain phenomena such as expressing shock or fear or perhaps even excitement or happiness.\n\nWe have politicians influencing our attitudes with subtle tricks such as body language or their choice of words of how they choose to direct their audience or how they choose to depict their opponents.\n\nWe have adverts influencing how we view one product from another like using adverts such cues that make the product appear welcoming and unique like for example, having a cigarette means that you are more macho than someone who is not *(for example)*\n\nIt's quite interesting that reality exists but reality is often very subjective because it is often influenced by a variety of factors, whether they are social, psychological, or maybe even biological.\n\nLike for example - we are influenced on how we view the reality of a certain phenomenon based on what we see on the news or any kind of media like newspapers, TV or the internet. Or we are influenced based on our modelling of our favoured politicians *(based on Bandura's Social Cognitive Theory through modelling)* or how our social influences affect our attitudes which will further influence our behaviours and even perceptions of reality.\n\nOr we are influenced how we act based on social factors like for example social stereotypes. They are the most simple but recognizable mental representations of particular individuals or groups and unless you are not exposed or familiar to that individual/group, you are more likely to view that phenomenon in a certain way *(like for example, if you believe the stereotype of black people as dangerous or hooligans, you may respond with fear or aggression towards them)*\n\nBut then again, this is coming from someone who does not study a social science",
        "created_utc": 1511617526,
        "upvote_ratio": ""
    },
    {
        "title": "Is music a universal human cultural invention?",
        "author": "MRRoberts",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7fc5rv/is_music_a_universal_human_cultural_invention/",
        "text": "Are there places on earth where music was notably not developed? It seems like anywhere you go you can find local music traditions; I'm curious if there are well-known exceptions.",
        "created_utc": 1511575403,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a book that provides a broad overview of human migration and the development of various ethnic groups? What about linguistic families?",
        "author": "8lbs6ozBebeJesus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7f9dmm/is_there_a_book_that_provides_a_broad_overview_of/",
        "text": "I've recently become interested in learning more about how humans have moved around the world and developed into different ethnicities (for example, my dad's side of the family is Indian but he recently did a 23 and Me test and found that our heritage can likely be traced back to what is now Iran.) Is there a fairly readable (IE not too academic) book that gives an overview of the major patterns that have occurred in human migration? Obviously it doesn't have to cover *every* aspect of it, it's just something I'd like to learn more about. \n\nSimilarly I'd like to learn more about how languages have developed. In [this video](https://youtu.be/Km9-DiFaxpU?t=380) the subject says \"you can see in any language the entire history of a people and its interactions with others,\" and that really piqued my interest in how languages develop. \n\nI'd imagine the two topics overlap a fair amount, but am okay with separate book recommendations for each. Thanks in advance!",
        "created_utc": 1511548642,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | November 24, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7f7nxj/friday_freeforall_november_24_2017/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1511532354,
        "upvote_ratio": ""
    },
    {
        "title": "When and Why Did Age Gaps Between Couples Become Perceived as Disgusting?",
        "author": "ImCuddlyGoddammit",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7f24of/when_and_why_did_age_gaps_between_couples_become/",
        "text": "Throughout history, people didn’t really care about age gaps between couples (at least, when the man was older), but now, it’s *such* a big deal. Why do people perceive, say, a twenty and sixty-year-old dating nearly as disgusting as a ten and thirty-year-old doing the same? And what societal changes caused relationships like this to be seen as unacceptable?\n\n**Edit:** As I learnt with the help of /u/pbntm’s comment, age gaps between couples in the past (in Western countries) weren’t all that common. But that raises the question: why are they more accepted in some *cultures* than others?",
        "created_utc": 1511467212,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate is Emile Durkheim's Theory of Solidarity?",
        "author": "JoeStanTheIV",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7f22ok/how_accurate_is_emile_durkheims_theory_of/",
        "text": "[Mechanical vs Organic Solidarity](https://en.wikipedia.org/wiki/Mechanical_and_organic_solidarity)\n\nIt essentially argues that lesser advanced societies typically depend on common beliefs and values to work in cohesion (mechanical) while more advanced societies rely on the division of labor (organic). How accurate is this theory? Is it an accepted theory amongst sociologists? If not, what other research or theories refute it? I'm looking for educated answers supported by evidence and research, rather than blind anecdotal opinion. Thank you.",
        "created_utc": 1511466704,
        "upvote_ratio": ""
    },
    {
        "title": "Sexual freedom in societies?",
        "author": "tacforall",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7ezjjo/sexual_freedom_in_societies/",
        "text": "",
        "created_utc": 1511444602,
        "upvote_ratio": ""
    },
    {
        "title": "NVivo Assessment Due 8th of December - But Never Used It Before?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ez5r9/nvivo_assessment_due_8th_of_december_but_never/",
        "text": "[removed]",
        "created_utc": 1511437965,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have 10 min to help advance communication science?",
        "author": "peng_peng_penguin",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7eyhsu/do_you_have_10_min_to_help_advance_communication/",
        "text": "[removed]",
        "created_utc": 1511429148,
        "upvote_ratio": ""
    },
    {
        "title": "[Political Science] Is there a term for the study of the flow of information within organizations and bureaucracies?",
        "author": "polyscipheno",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7es5ex/political_science_is_there_a_term_for_the_study/",
        "text": "I have in mind the bureaucracy of the UN, for example. Is there a study of how information is transmitted between members of the bureaucracy, or other organizations (domestic or international)?\n\nThanks in advance. ",
        "created_utc": 1511367981,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] In your opinion, what are the main causes of violence? What practical steps can be taken to reduce violence?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7erwg3/serious_in_your_opinion_what_are_the_main_causes/",
        "text": "[deleted]",
        "created_utc": 1511366031,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | November 22, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7er5kp/theory_wednesday_november_22_2017/",
        "text": "[removed]",
        "created_utc": 1511359576,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the older generation always generally think that the younger generation is ruining society?",
        "author": "son_of_heracles",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7enkeu/why_does_the_older_generation_always_generally/",
        "text": "It just seems odd considering how people lived 500 years ago it seems as if we are doing pretty well.",
        "created_utc": 1511318977,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a name for this phenomenon?",
        "author": "fhayde",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7enipy/is_there_a_name_for_this_phenomenon/",
        "text": "I posted [this](https://www.reddit.com/r/askphilosophy/comments/7el1yk/is_there_a_name_for_this_phenomenon/) over on /r/askphilosophy and it was suggested that this might be a better place to ask this question. I've looked through a number of threads on this sub trying to find a name for this pattern of behavior but I haven't found anything yet (I might not be searching for the right thing!). \n\nI've been around the internet for a decent amount of time now, since the early 90s, and I've seen this particular pattern of behavior manifest over and over again on forums, different social sites, really anywhere there's social activity, but particularly where there are rules to be followed and moderation. Some examples I can think of off the top of my head would be SA, YTMND, Fark, Digg, Reddit, a lot of smaller forums, and many open source technology projects.\n\nWhat I've seen happen is that at first, the service is either new or just starting to grow in popularity and there's a positive momentum starting to build. People are sharing the service, talking about it, and there's a culture starting to form. At this stage things are pretty positive overall and moderation of the service isn't difficult. It's around this growth period that you generally see the moderators taking part in the discussions and their presence is even elevated to some degree, being treated with a sort of celebrity status.\n\nAt some point, whether it's during the later part of this growth phase or around an apex of growth, something happens. A minority group of dissenters starts to grow and participate at an accelerated rate. Strong egos, contradicting perspectives, and contrarian ideologies form a counter culture. Communities start to fracture and the need for more moderation ramps up. The celebrity status of the moderators often turns them into targets and their actions turn into a magnet for these participants.\n\nIt's at this point that most communities try to respond to the behavior because it's starting to threaten the service as a whole. The most common response has been banning users or prohibiting certain discussions or topics. The negative minority focus their efforts and a genuine interest in undermining the community begins. Sometimes that has taken the form of posting illegal content on the site, trying to spread negative content, disrupt the service, or often impede the other users using in the community. The resulting attrition usually ends with stricter rules and reactionary measures that serve the suggestive tone that the moderation being done is clandestine and oppressive to minority opinions.\n\nThis is where a lot of sites have faltered and either the majority of users left and went elsewhere, e.g., when the DeCSS stuff happened with Digg. The remaining group of negative participants decide to start using the rules against the service itself. They start intentionally misinterpreting the rules so that content that contributes to a healthy a community becomes controversial. If the content or users they target are removed, they feel successful of dismantling the community and are emboldened. If they're ignored or the content or users in question become a point of contention, even if temporarily, they also feel successful as it becomes a false example of the hypocritical nature of the service.\n\nEventually, more moderation is again needed, and over a period of time the contrarian perspective is folded into the community and results in a sort of fracture line that makes the whole thing a little more fragile. If the community is able to survive through this, it seems like the whole cycle starts all over again. Each time this happens, because of the remnants of the previous issue remain, it becomes easier for it to happen again, and the overall quality of the service diminishes until an event happens that is great enough to cause those fractured pieces to splinter and only a fraction of the community remains.\n\nWhat really throws me for a loop every time I see this happen is how something like participation inequality plays into all of this. I don't know what the ratio of user engagement is for all of the popular services that have risen and fallen over the decades, but I can imagine it's not anywhere close to a majority of users. That so few can affect so many is both fascinating and terrifying imo.\n\nI know this also extends into history and offline communities and there's likely a long list of examples where this happens, but history was a really weak spot for me in school, so I welcome any lists as well!\n\nWhat I'd really like to know is if there's a name for this cycle.\n\nWhere communities become popular, negative sentiment grows, moderation increases, and eventually the communities deflate as a result of the toxicity. I want to know more about why this happens and find the research that has been done on the subject. I'd love to know what factors play into this, e.g., is there a cycle or trend in the age or sex of the users? Does geographical influence contribute? What about the methods of moderation or how the moderators interact with the users, etc...\n\nThanks for any suggestions!\n",
        "created_utc": 1511318538,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a name for this phenomenon?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/askphilosophy/comments/7el1yk/is_there_a_name_for_this_phenomenon/",
        "text": "[deleted]",
        "created_utc": 1511317895,
        "upvote_ratio": ""
    },
    {
        "title": "If gender is a social construct, is body dysphoria a psychological issue created by society?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7emw8l/if_gender_is_a_social_construct_is_body_dysphoria/",
        "text": "[deleted]",
        "created_utc": 1511312722,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we have swear words?",
        "author": "tereddits",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7emf3v/why_do_we_have_swear_words/",
        "text": "Why have words that we've all decided are bad to say? What function do they serve?",
        "created_utc": 1511308484,
        "upvote_ratio": ""
    },
    {
        "title": "Differences between working habits among cultures, especially Middle East",
        "author": "kyrgyzstanec",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7einr4/differences_between_working_habits_among_cultures/",
        "text": "Czech politics keep talking about \"differences in working habits\" between Arabs and Europeans, by which they mean that incoming Arabs would (barely any are in Czechia) only drain our social system. Can you please recommend me any descriptive studies on the topic? I can't believe we are any more avid workers.",
        "created_utc": 1511278601,
        "upvote_ratio": ""
    },
    {
        "title": "Why are people so militaristic about their opinions and beliefs?",
        "author": "Nasallynothings",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ei21p/why_are_people_so_militaristic_about_their/",
        "text": "",
        "created_utc": 1511273232,
        "upvote_ratio": ""
    },
    {
        "title": "Are people from more developed countries more sexually open?",
        "author": "kyrgyzstanec",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7eh9h1/are_people_from_more_developed_countries_more/",
        "text": "Does individualism lead towards greater sexual openness when it comes to open talk about sexual preferences? Is there a difference among Western and Eastern Europeans when it comes to this topic? It sure feels like it to me when I watch American shows but I'd love to see any data. Thank you!",
        "created_utc": 1511264659,
        "upvote_ratio": ""
    },
    {
        "title": "Social construction of facts",
        "author": "Getreckless",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ef7cc/social_construction_of_facts/",
        "text": "I have to demonstrate how facts are socially constructed or how they are “framed” to further the narrative of a person.\n\nEx if I want to argue the legalization of marijuana, \n\nShould I frame the stat: \n\n70% believe it shouldn’t have criminal sanctions or\n30% believe it should \n\nAnd why does one of the two framing above support legalization? \n\n",
        "created_utc": 1511238839,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think Ronald Inglehart's 'Silent Revolution' thesis has proved correct? Are successive generations more post-materialist?",
        "author": "idealist-realist",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7eewst/do_you_think_ronald_ingleharts_silent_revolution/",
        "text": "And, if so, do you think that his Silent Revolution in Reverse (that post-Recession material insecurity) is an adequate explanation of the rise of authoritarianism and xenophobia?\n\n[The Silent Revolution (1971)](https://s3.amazonaws.com/academia.edu.documents/30747637/inglehart1971.pdf?AWSAccessKeyId=AKIAIWOWYYGZ2Y53UL3A&amp;Expires=1511239545&amp;Signature=gXidT0JeyKNkthJWHIRYP607Mhc%3D&amp;response-content-disposition=inline%3B%20filename%3DThe_Silent_Revolution_in_Europe_Integrat.pdf) \n\n[The Silent Revolution in Reverse (2017)](https://www.cambridge.org/core/journals/perspectives-on-politics/article/trump-and-the-populist-authoritarian-parties-the-silent-revolution-in-reverse/FE06E514F88A13C8DBFD41984D12D88D) ",
        "created_utc": 1511235885,
        "upvote_ratio": ""
    },
    {
        "title": "How long before a tragedy becomes irrelevant?",
        "author": "EyeMAdam",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7edzk0/how_long_before_a_tragedy_becomes_irrelevant/",
        "text": "Eg. We all agree that the Holocaust is a horrible thing and it's still being brought up but King Leopold II's Congo is completely irrelevant. So how many years does it take before an event becomes irrelevant?",
        "created_utc": 1511227157,
        "upvote_ratio": ""
    },
    {
        "title": "I'm just an exhausted student who really needs help with my research project which looks into racial diversity in advertising, pls help me and fill out my survey xo",
        "author": "researchdesignerrrr",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7edegh/im_just_an_exhausted_student_who_really_needs/",
        "text": "[removed]",
        "created_utc": 1511222000,
        "upvote_ratio": ""
    },
    {
        "title": "What are central differences and similarities of Rosa's acceleration society and Honneths recognition society?",
        "author": "totrorinone",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ebp11/what_are_central_differences_and_similarities_of/",
        "text": "[removed]",
        "created_utc": 1511208240,
        "upvote_ratio": ""
    },
    {
        "title": "The irony of violence in the media - video games vs film/TV?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ebbd6/the_irony_of_violence_in_the_media_video_games_vs/",
        "text": "There is an irony here. \n\nWhen it comes to violence or the fear that children *(or adults)* will be prone to violence is mostly targetted to video games *(which makes sense according to Bandura's Social Learning Theory but it is obviously much more complicated than that)*.\n\nIt is not unusual that many politicians and journalists often use video games as a scapegoat for violence and other forms of crime given that the gaming industry is constantly increasing in popularity and is a billion dollar industry.\n\nBut the irony is this - as much as there are some forms of violence and explicit imagery in some video games, you rarely find anyone blaming violent films for violent crimes considering that film and TV have existed much earlier before the video gaming industry even started around the 60s and 70s.\n\nSo why is this? Why are there often so much debate on censorship when it comes to violence in video games or even laws about whether these games should be available to the public when you rarely find people doing the same for films or TV that show these violent scenes?",
        "created_utc": 1511205338,
        "upvote_ratio": ""
    },
    {
        "title": "Is the USA culture fixated with the idea of proving yourself?",
        "author": "haentes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ea1i4/is_the_usa_culture_fixated_with_the_idea_of/",
        "text": "I don't know if this is an accurate assessment since I don't live in the US, so in all fairness I'm judging just by the media.\n\nI've noticed for some time that in many USA movies and TV shows (specially reality TV) the idea of \"proving yourself\" pops up. Just now I was watching some cooking TV show, and the phrase \"I want to prove myself\" seems recurrent, sometimes almost like \"if you don't know what to say, just say you want to prove yourself\".\n\nI don't think I've ever heard anyone in my country (even on TV) saying something like that, so that makes me think it's a cultural issue. \n\nIs that an accurate assessment? If so, why is that the case?\n\nThanks!",
        "created_utc": 1511195403,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | November 20, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e929t/monday_reading_and_research_november_20_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1511186731,
        "upvote_ratio": ""
    },
    {
        "title": "In 2016 elections, Hillary Clinton talked about retraining workers who lost jobs in declining Industries. Are there any examples of such programs currently in existence in any country? If yes, how effective are they in reducing unemployment and helping workers to switch jobs?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e8yo2/in_2016_elections_hillary_clinton_talked_about/",
        "text": "",
        "created_utc": 1511185713,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for international polls on global leaders",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e8p8a/looking_for_international_polls_on_global_leaders/",
        "text": "[deleted]",
        "created_utc": 1511182924,
        "upvote_ratio": ""
    },
    {
        "title": "I want to start studying the importance of ritual and tradition in society, and how it gives meaning to one relationship with others in the community. Any help?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e498a/i_want_to_start_studying_the_importance_of_ritual/",
        "text": "The quick of it: It seems that ritual behavior, not given the proper context, can go wrong. I would like to argue this is because of the disregard for how certain ritual behavior came to be (tradition). Has there been any studies about the link between disregard for traditions and the corruption of ritual and therefore corruption of government and businesses?\n\n____________________________________________________________\n\nSo here's the thinking that lead to the question, just in case that helps:\n\nI've been focused on Confucianism and communitarianism academically, which seems to be more traditionalist than not. Philosophically, rather than in terms of purely scientifically, I want to argue that it is traditions that give meaning to ritual.\n\nFor example, in America one wears white to a wedding, black at a funeral, and shakes hands, while in China one wears red to a wedding, white to a funeral, and bows. This is because in America white traditionally represents purity, black represents death, and shaking hands is traditionally used to signify peaceful intentions, while in China one represents happiness, white represents death, and bowing is a sign of respect and defference.\n\nThese are all very small rituals, but still the reason they are done is because of tradition, that is tradition gives meaning to ritual. The tradition of red to represent happiness in China means that it would be proper to use red in a wedding (wishing the couple happiness). However, if one were to change history so that red would represent bad luck, it would be odd to have a red wedding in China.\n\nHowever, let us take another traditional behavior, such as guanxi. Guanxi is generally implemented in order to form tight social bonds with one another, and is generally reciprocal. It can be said that, even for a Confucian, the contemporary use of Guanxi results and influences corruption in government and society. \n\nI would argue that the worst case of using guanxi is during the Sichuan earthquake that killed thousands, especially affecting schools in Wenchuan. Due to government contractors favoring businesses that had built up guanxi with them, faulty cement was used to build schools, which in turn led to the destruction of schools and the lose of life of many teachers and students. \n\nHowever, to use guanxi in this way is to disregard why Chinese culture has guanxi in the first place. While it is true that guanxi itself is inherently disagreeable in the west, the need to form strong social bonds (especially between family and certain friends) is inherent to Confucianism. But the role is not the benefit and be reciprocal, rather it is to behave in such a way that gives moral guidance and substance to that relationship. This famously corrupt case of guanxi would be because Confucianism has become dead in China, and the ritual's meaning is missing.\n\nGuanxi can be used in ways that benefit both society and those in the the ritual, however. Take the case of Emperor Shun and the appointment of his morally bankrupt brother, Xiang, as a minister. This was not because Shun wanted to simply give benefit to Xiang at the expense of the people under Xiang's rule, but because it would be better to have Xiang be wealthy than for Shun to be wealthy and Xiang to remain a commoner. The purpose of this was not to give Xiang power, rather there were measures in place that made Xiang effectively powerless, but to ensure that Shun could utilize his moral standing in order to effectively make Xiang more moral (through Shun's influence).\n\nWhile this is just a short explanation of a much more complicated story and philosophical dialogue, it stands to point out the traditional meaning of guanxi: forming strong social bonds in order to ensure moral development. At least for Confucians, to cast out one's brother rather than treat him kindly would be immoral, as well as blocking out said brother from being able to cultivate himself (Xiang eventually did reform). But for contemporary Chinese using the Confucian ritual, the disregard for the traditional meaning of the ritual, leads to not moral cultivation, but financial gain and mutual benefit and the cost of others. Thus, when tradition is disregarded ritual becomes free of meaning, which in turn leads to corruption.\n\nProvided this argument, are there any studies that would indicate this is the case? How far can social science go when studying the effect of ritual and tradition to a certain society?",
        "created_utc": 1511132204,
        "upvote_ratio": ""
    },
    {
        "title": "Question about a friend I had in middle school",
        "author": "talkthattalktome",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e3ao3/question_about_a_friend_i_had_in_middle_school/",
        "text": "She told me she was in a relationship with a 34 year old man over the Internet. They would send nude pictures back and forth. This made me wonder, is she considered a victim even though she willfully participated? Could he have gone to jail for this? Would she be considered a victim of child sexual abuse or assault? If you had to put a label on this situation (assuming she’s considered a victim at the age of 13) how would you say she was victimized? What would She be considered a victim of? \nAlso, is anyone able to give me some information based on why these little girls who take part in this stuff are considered victims? I don’t disagree. I’m just looking for some science behind it. ",
        "created_utc": 1511123933,
        "upvote_ratio": ""
    },
    {
        "title": "Casualty estimates",
        "author": "ghostofmishima",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e1byi/casualty_estimates/",
        "text": "[removed]",
        "created_utc": 1511106591,
        "upvote_ratio": ""
    },
    {
        "title": "HELP! (sociology essay question about service sector work and inequality)",
        "author": "Stickylemonsuperhero",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7e0rn2/help_sociology_essay_question_about_service/",
        "text": "[removed]",
        "created_utc": 1511100376,
        "upvote_ratio": ""
    },
    {
        "title": "Have there ever been any studies on how racism functions, in the minds of those in between the extreme and moderate?",
        "author": "Vostochis",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dzvpx/have_there_ever_been_any_studies_on_how_racism/",
        "text": "I've been fascinated by this ever since I've been diving deep into civil rights-era primary sources over the past few weeks. I've noticed that there's a trend amongst whites of the time to always portray civil rights as \"agitation\" or just causing trouble, or to express very racist things, but not consider them racist because of cloaking them in more polite language. Are there any papers or books written on how this \"silent majority\" of racism functions?",
        "created_utc": 1511088085,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any psychological studies on people who have trouble finding a partner?",
        "author": "RedRain2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dz8nt/are_there_any_psychological_studies_on_people_who/",
        "text": "[removed]",
        "created_utc": 1511077767,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any psychological studies on people who have difficulty finding a partner?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dz6yo/are_there_any_psychological_studies_on_people_who/",
        "text": "[removed]",
        "created_utc": 1511077051,
        "upvote_ratio": ""
    },
    {
        "title": "Where is cousin marriage common in Spain?",
        "author": "strangeduty",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dr38x/where_is_cousin_marriage_common_in_spain/",
        "text": "",
        "created_utc": 1510985025,
        "upvote_ratio": ""
    },
    {
        "title": "Legalize or decriminalize marijuana",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7docw0/legalize_or_decriminalize_marijuana/",
        "text": "[removed]",
        "created_utc": 1510956310,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | November 17, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dl52l/friday_freeforall_november_17_2017/",
        "text": "[removed]",
        "created_utc": 1510927555,
        "upvote_ratio": ""
    },
    {
        "title": "Is it even reasonable to make colleges tuition free? In my country it has been common sense for decades that even higher education should be available for everyone. Is there a \"social scientific\" standpoint on this? Is there a downside to free colleges?",
        "author": "marius3297",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7djqng/is_it_even_reasonable_to_make_colleges_tuition/",
        "text": "",
        "created_utc": 1510910854,
        "upvote_ratio": ""
    },
    {
        "title": "Accuracy of Polls?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dfuwb/accuracy_of_polls/",
        "text": "[deleted]",
        "created_utc": 1510869241,
        "upvote_ratio": ""
    },
    {
        "title": "Exploring \"friends with benefits\" relationships",
        "author": "yulia_ever",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dewoq/exploring_friends_with_benefits_relationships/",
        "text": "[removed]",
        "created_utc": 1510861406,
        "upvote_ratio": ""
    },
    {
        "title": "The methodological implications of sociomateriality",
        "author": "Pornboost",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ddjei/the_methodological_implications_of/",
        "text": "[removed]",
        "created_utc": 1510849996,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any papers or books that explain the rise of political polarization in different countries in the last few years?",
        "author": "theblackfresh",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dcly3/are_there_any_papers_or_books_that_explain_the/",
        "text": "",
        "created_utc": 1510841393,
        "upvote_ratio": ""
    },
    {
        "title": "Do protests actually do anything?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7dc0jc/do_protests_actually_do_anything/",
        "text": "I often look at protests as not just a way for someone to express criticism in a very demanding and angry manner but I mostly see it as a pointless thing\n\n\nI see it that the only thing that protests do is to get attention, similar to how a loud stimulus gets more attention than a quiet one.\n\nBut that is how I often see it - just attention instead of pressuring the people who are being protested to do that protestors desire becuase protests happen a lot and they are not always addressed thoroughly \n\nBut then again, I could be wrong here",
        "created_utc": 1510834700,
        "upvote_ratio": ""
    },
    {
        "title": "Studies regarding Collective Selective Memory",
        "author": "Zhainu94",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7db5f2/studies_regarding_collective_selective_memory/",
        "text": "Hi everyone. I'm looking for some case studies regarding Selective Memory, in particular on this cases of collective Selective Memory. It would be best if it's related to history and mass media.\nI'm writing my PhD paper regarding Fake News and the concept of \"History written by the Winners\". I'd like to implement the notion of Selective Memory in my research.\nMany thanks to all that could help me! ",
        "created_utc": 1510821879,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a theoretical maximum to the degree to which commerce increases productivity?",
        "author": "Cullen_Ingus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7da8tx/is_there_a_theoretical_maximum_to_the_degree_to/",
        "text": "I'm thinking along the lines that the more participants there are in an economy, the more every person benefits from participating (and that may be an overgeneralization, so feel free to inform me if it is). But it seems intuitively plausible that this growth would approach an asymptote somewhere. If this simply doesn't happen in a dynamic economy that's still benefiting from technological and other advances, then would such a limit hold if we were to fix some variables?\n\nWhat other plausibilities are there for the growth curve reflecting a change in the average benefit per participants with respect to the number of participants? Might it be (contrary to my intuition) linear, or exponential, for example? Or are there too many adventitious factors to make any credible statements about this?",
        "created_utc": 1510809441,
        "upvote_ratio": ""
    },
    {
        "title": "Sociology texts",
        "author": "regi_zteel",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d8whc/sociology_texts/",
        "text": "Your resource link is broken, at least for mobile, so I wanted to know where I could get sociological texts preferably on Class, power &amp; authority, role &amp; status, conflict theory and intersectionality. \n",
        "created_utc": 1510795218,
        "upvote_ratio": ""
    },
    {
        "title": "Social scientific foundations explaining desire for power?",
        "author": "goingtobegreat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d6e7e/social_scientific_foundations_explaining_desire/",
        "text": "What sort of academic treatment has been given for the desire or preference for power? I come from a political science and economics background and models of politics typically assume that actors (usually politicians or elites) have preferences to maximize power or influence. This is a fairly self-evident assumption.\n\nBut why is this the case? Is it even the case? What are the neurological and psychological foundations?\n\nEdit: I'd also be interested in what explains variations in the political ambition and desire for power at the individual level. ",
        "created_utc": 1510773023,
        "upvote_ratio": ""
    },
    {
        "title": "Erol On Targeted Individuals",
        "author": "CheChe2017",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d5pci/erol_on_targeted_individuals/",
        "text": "[removed]",
        "created_utc": 1510767381,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure if I'm understanding Anomic Suicide correctly",
        "author": "PuddingOfEarl",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d4ynf/not_sure_if_im_understanding_anomic_suicide/",
        "text": "I'm conducting individual research into suicide for a project, so far I think I'm understanding the various forms of suicide outlined by Durkheim. Egoistic, Altruistic and Fatalistic are all straightforward, I may be overthinking Anomic. \n\nWould an example of this be something like, military personnel finding it hard to reintegrate into society?",
        "created_utc": 1510761020,
        "upvote_ratio": ""
    },
    {
        "title": "Grabbed by the headlines: it seems like men who are into underage women are old, creepy, rejects, but the women who get into the headlines for relationships with their underage students are reasonably attractive and twenty-somethings. Is there data supporting this appearance?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d4ojm/grabbed_by_the_headlines_it_seems_like_men_who/",
        "text": "[deleted]",
        "created_utc": 1510758494,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | November 15, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d4al9/theory_wednesday_november_15_2017/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1510754790,
        "upvote_ratio": ""
    },
    {
        "title": "Understanding Hannah Arendt: looking for good articles and papers",
        "author": "Rushdie1",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d3nzu/understanding_hannah_arendt_looking_for_good/",
        "text": "Hello there, I am new to this sub and political philosophy isn't my area of specialisation. That said, I need to understand Arendt's thoughts and her contemporary relevance in the shortest time possible, so I was looking for articles like this one here. \n\nhttp://www.nybooks.com/articles/2007/03/15/what-would-hannah-say/\n\nSadly, i don't have the subscription to nybooks, would anyone be kind to copy the material here as well as recommend other long form essays and reads?  Thank You",
        "created_utc": 1510747625,
        "upvote_ratio": ""
    },
    {
        "title": "Why is women's fashion so sexual but men's fashion is not?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7d1nyn/why_is_womens_fashion_so_sexual_but_mens_fashion/",
        "text": "[deleted]",
        "created_utc": 1510720355,
        "upvote_ratio": ""
    },
    {
        "title": "Honestly, what's the difference between economic and sociological research?",
        "author": "BuildBetterWorld",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cywbh/honestly_whats_the_difference_between_economic/",
        "text": "I know that both disciplines have different theoretical foundations. First of all, (neoclassical) economics is concerned with choice, while sociology is concerned with the systematic study of society. Similarly, economic theory is usually derived or expressed mathematically, while sociological theory rarely is. Even so, there's a lot of subject and methodology overlap. If a hypothetical academic conducted mixed-methods research on rural poverty, would it be considered economics or sociology? Another example is Nicholas Christakis' research, which he describes as medical sociology, but could just as easily be health economics. In grey areas where consumption and production aren't explicitly involved, is the destination more-or-less arbitrary?",
        "created_utc": 1510694406,
        "upvote_ratio": ""
    },
    {
        "title": "Comte as a normative theorist?",
        "author": "khuzdum",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cyw2o/comte_as_a_normative_theorist/",
        "text": "Hi!\n\nI posted this question on /r/askphilosophy a few days ago, but didn't receive any answers to it there, so I figured I'd try giving it a shot here. Thank you in advance.\n\nConsidering his place in the history of sociology and philosophy, and the positive social methodology he formulated with model reference to physics, I've always had Comte filed away as a sort of uncontroversially positivist thinker. If viewed through the lens of the debate about the methods of social sciences found in the Positivist Dispute, I suppose that while neither the critical theory nor the critical rationalist crowds represented there actually conform to any meaningful notion of 'positivism' we might imagine, it would seem that by the lights of both, say, Adorno and Popper, Comte ought be considered *very much* a positivist.\n\nBut lately I've been hearing talk among fellow students as well as two of my professors that Comte's project is actually to be considered pretty thorough-goingly normative, even if he wouldn't admit to it. There main line of thinking seems to be that Comte has missed the fact that he's operating on strong (and implicit) normative motivations in his conceptions about what social science (\"sociology\") ought to do with society (the development of \"Humanity\"), and why physics gives us the best methods to carry out this program.\n\nI'm still not very sure what to make of this, though; his staunch preoccupation with the \"how\" of the organization of social systems, his 'third stage' of the Course, his notion that any aspiring sociologist must first be well versed in biology (!), that social problems or disruptions are to be solved by the technocratic savant, and so on, seems to me to indicate that surely Comte is a positivist.\n\nAs I'm seeing it right now, the fact that one might find normative \"slip-ups\" in his thinking could probably better be explained with reference to the naïvety of this relatively early program of phil. of science and social methodology, rather than they being indicative of Comte having formulated a normative program without noticing it, or something like this.\n\nI'm sure I'm missing something, though. Can anyone perhaps clarify what such a notion of Comte-as-normative might mean, and/or perhaps redirect me to some literature that deals with the matter?\n\nThank you.",
        "created_utc": 1510694349,
        "upvote_ratio": ""
    },
    {
        "title": "Did George W. Bush's \"Freedom Agenda\" pave way for the Arab Uprisings?",
        "author": "rovnrev",
        "url": "https://www.reddit.com/r/geopolitics/comments/7cykvp/did_george_w_bushs_freedom_agenda_pave_way_for/",
        "text": "",
        "created_utc": 1510692494,
        "upvote_ratio": ""
    },
    {
        "title": "Why is inbreeding so prevalent in the Middle East and Northern Africa?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cycje/why_is_inbreeding_so_prevalent_in_the_middle_east/",
        "text": "[deleted]",
        "created_utc": 1510689949,
        "upvote_ratio": ""
    },
    {
        "title": "At what percentage is a sample truly \"representative\"?",
        "author": "MinnesotaPower",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cx27a/at_what_percentage_is_a_sample_truly/",
        "text": "Hi all,\n\nI recently conducted a mail-out survey to random households.  I’m trying to figure out whether the results are representative of the overall population.  Using Census data for the same geography, there are a number of demographics that are too close for me to tell whether they’re representative or over/under represented.  Can anybody weigh in?  Here are the results:\n\n* White, Census: 85.2%, Survey 90.9%\n* Black, Census 9.2%, Survey 5.0%\n* Asian, Census 1.7%, Survey 0.9%\n* Two or more races, Census 2.2%, Survey 1.5%\n* Hispanic or Latino, Census 4.0%, Survey 3.2%\n* 75+ years old, Census 8.9%, Survey 11.4%\n* No vehicle available, Census 2.4%, Survey 3.2%\n* One vehicle available, Census 18.7%, Survey 24.4%\n* Two vehicles available, Census 43.9%, Survey 49.4%\n \nPerhaps a better question is, is there a measurement that definitively determines whether a sample is representative or not?  Or is it totally fluid/up to interpretation?  It seems like whole numbers and percentages are both flawed.  A whole number difference between 1% and 4% seems very different from a difference between 81% and 84%.  Likewise, a percent difference between 2% and 3% seems inherently different than 20% vs 30%.  Any advice is much appreciated. Thanks.",
        "created_utc": 1510679565,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking demographic info on trans and non-binary people.",
        "author": "Eumemicist",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cx05h/seeking_demographic_info_on_trans_and_nonbinary/",
        "text": "Are these numbers out there?\nWhat percentage of transgender people were born male and now identify as female?\nWhat percentage of transgender people were born female and now identify as male?\nWhat percentage of non-binary people were born male?\nWhat percentage of non-binary people were born female?",
        "created_utc": 1510679103,
        "upvote_ratio": ""
    },
    {
        "title": "Will the early users of the Internet have a disproportionately large impact on broader culture, similar to that of the traditions of English nobility?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cu0hk/will_the_early_users_of_the_internet_have_a/",
        "text": "Will the early users of the Internet have a disproportionately large impact on broader culture, similar to that of the traditions of English nobility? \n\nI notice certain social conventions, such as /s originated in a group of people much smaller than that which now uses it. ",
        "created_utc": 1510644033,
        "upvote_ratio": ""
    },
    {
        "title": "If we don't strive for minimizing the achievement gaps in professional sports, then why should we strive for minimizing the achievement gaps in education?",
        "author": "Ask_Everything",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cskwb/if_we_dont_strive_for_minimizing_the_achievement/",
        "text": "[removed]",
        "created_utc": 1510627703,
        "upvote_ratio": ""
    },
    {
        "title": "Pink Laundromat in Highland Park, Los Angeles",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7csk8x/pink_laundromat_in_highland_park_los_angeles/",
        "text": "[deleted]",
        "created_utc": 1510627520,
        "upvote_ratio": ""
    },
    {
        "title": "Help me test a hypothesis and tell me \"who is hipper\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cro1u/help_me_test_a_hypothesis_and_tell_me_who_is/",
        "text": "[removed]",
        "created_utc": 1510618962,
        "upvote_ratio": ""
    },
    {
        "title": "Are the differences in IQ among the races because of genetic causes?",
        "author": "MTGTCG",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7crjyg/are_the_differences_in_iq_among_the_races_because/",
        "text": "[removed]",
        "created_utc": 1510617990,
        "upvote_ratio": ""
    },
    {
        "title": "Does the division of labor count as a form of social stratification?",
        "author": "regi_zteel",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7crifo/does_the_division_of_labor_count_as_a_form_of/",
        "text": "Even before the rise of the state, commodity production and social classes through the neolithic revolution we had a division of labor enforced by a patriarchy, orontocracy and warrior-society. Would this count as social stratification? ",
        "created_utc": 1510617579,
        "upvote_ratio": ""
    },
    {
        "title": "I heard of some concept, maybe sociological, which says that when people say something, they implicitly think it is worth saying. What is it and where can I read more about it?",
        "author": "IAmNotAPerson6",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cpsrh/i_heard_of_some_concept_maybe_sociological_which/",
        "text": "",
        "created_utc": 1510603262,
        "upvote_ratio": ""
    },
    {
        "title": "What are sociological effects of capital punishment?",
        "author": "sparticus2-0",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7co716/what_are_sociological_effects_of_capital/",
        "text": "",
        "created_utc": 1510590248,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the new generation of America seem a lot more ignorant, brain-washed and spoonfed as compared to that of the rest of the world?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cnos5/why_does_the_new_generation_of_america_seem_a_lot/",
        "text": "[removed]",
        "created_utc": 1510585965,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | November 13, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cn9m1/monday_reading_and_research_november_13_2017/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1510581936,
        "upvote_ratio": ""
    },
    {
        "title": "In what circumstances does the gap between rich and poor slink?",
        "author": "popcornwillglow",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cmmd2/in_what_circumstances_does_the_gap_between_rich/",
        "text": "It seems that whenever you hear about new research on the gap between rich and poor the gap keeps growing. Obviously, this can not go on indefinitely, so there must be circumstances where the gap actually slinks. When does this happen generally and are there some good examples in history?",
        "created_utc": 1510574294,
        "upvote_ratio": ""
    },
    {
        "title": "Are there social benefits to mandatory military service?",
        "author": "TanktopSamurai",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cmjy4/are_there_social_benefits_to_mandatory_military/",
        "text": "",
        "created_utc": 1510573323,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a term for people who don't know how to talk about whats on their mind?",
        "author": "R34CTz",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ckn9o/is_there_a_term_for_people_who_dont_know_how_to/",
        "text": "For example, someone comes to you and asks what you're thinking about, or what's bothering you, and when you're confronted with that question it seems like all of a sudden you're bombarded with thoughts and you can't pinpoint where to start. Is that a thing that's been studied somehow or what??",
        "created_utc": 1510546400,
        "upvote_ratio": ""
    },
    {
        "title": "Thoughts on gender roles and identity in the distant future? What will they look like, will they play a big role in society, like they do now?",
        "author": "Musicpenguin",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ckif5/thoughts_on_gender_roles_and_identity_in_the/",
        "text": "[removed]",
        "created_utc": 1510544865,
        "upvote_ratio": ""
    },
    {
        "title": "Why do poor people in developing countries usually value education more than poor people in the U.S.?",
        "author": "DrShephard",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cjn8h/why_do_poor_people_in_developing_countries/",
        "text": "In my experience of teaching in both a developing country and in the U.S., low-income students and their families in the developing country greatly valued education while low-income students and their families in the U.S. often do not value education.  Is there data to back up my anecdotal evidence, and are there explanations proposed for this?",
        "created_utc": 1510535516,
        "upvote_ratio": ""
    },
    {
        "title": "Why do poor people in developing countries usually value education more than poop people in the U.S.?",
        "author": "DrShephard",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cjffs/why_do_poor_people_in_developing_countries/",
        "text": "[removed]",
        "created_utc": 1510533269,
        "upvote_ratio": ""
    },
    {
        "title": "When do refugees go back?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cfn22/when_do_refugees_go_back/",
        "text": "[deleted]",
        "created_utc": 1510496750,
        "upvote_ratio": ""
    },
    {
        "title": "Is institutional racism an example of structural violence??",
        "author": "sesame_snapss",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cept3/is_institutional_racism_an_example_of_structural/",
        "text": "",
        "created_utc": 1510482247,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any countries that have chosen economic growth before democracy? If so, how did that work out? Is economic growth a factor in successful democracy at all?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7cep4x/are_there_any_countries_that_have_chosen_economic/",
        "text": "[deleted]",
        "created_utc": 1510481912,
        "upvote_ratio": ""
    },
    {
        "title": "As A Black Woman I refuse To Claim \" Black History\" As My Own Is This Rational?",
        "author": "Scorpio962016",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c9ria/as_a_black_woman_i_refuse_to_claim_black_history/",
        "text": "[removed]",
        "created_utc": 1510422134,
        "upvote_ratio": ""
    },
    {
        "title": "Language question, ED = Impotence?",
        "author": "KungFuKittyA",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c7lpp/language_question_ed_impotence/",
        "text": "[removed]",
        "created_utc": 1510393652,
        "upvote_ratio": ""
    },
    {
        "title": "Coup",
        "author": "qcern",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c2k83/coup/",
        "text": "How do a small group of people manage to take over an entire country in a coup? Logically does this mean there are weak points in the structure of the administration/rule? If so, is it possible to ascribe a \"coup number\" to every govt/rule that shows the minimum number and type of people/posts that must defect for a successful coup?",
        "created_utc": 1510335031,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking academically-sound 1989 Cold-War political map .KML/.KMZ file",
        "author": "ClevelandAcademic",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c2h3a/seeking_academicallysound_1989_coldwar_political/",
        "text": "Hello. I am attempting to locate a historically accurate visual representation of 1989's political map, visually showing the divide of the former first and second Worlds in .KML or .KMZ file form.\nThe task has proven difficult through my own research, and thus (lacking time to create or dig) I'm turning to the collective crowd. This thread will be X-posted, but replies with viable x-post suggestions are equally useful!\n\nFor the sake of transparency, my positionality is that I am a graduating senior of Cleveland State University's History/Social Sciences program. My personal Historical focus is 20th Century World history through the contextual lens of Gender analysis (disparity), and I have particular interests in the topics of Housing, Poverty, and Geography. My curation project's position: a deep analysis of the 4/11/1989 Alexanderplatz Demonstration subsequent to the 9/11/1989 collapse of the Berlin Wall.\n\nBeing a firm adherent to making the digital humanities public, I would like to enable exhibit visitors here in Cleveland or anywhere connect via-web to see, touch, and feel while exploring the space and place of the 1989 Germany Democratic Republic.\n\nContributors would, of course, gain footnote recognition!! \nThanks. Peace, Rob.",
        "created_utc": 1510334251,
        "upvote_ratio": ""
    },
    {
        "title": "Classic Experiments involving suggested status and level of trust?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c28ta/classic_experiments_involving_suggested_status/",
        "text": "[removed]",
        "created_utc": 1510332224,
        "upvote_ratio": ""
    },
    {
        "title": "As a non-American, how did your political environment get so hostile?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c1xq0/as_a_nonamerican_how_did_your_political/",
        "text": "[deleted]",
        "created_utc": 1510329440,
        "upvote_ratio": ""
    },
    {
        "title": "Cognitive Abilities vs. Social Background",
        "author": "Silverfox1984",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c1qe1/cognitive_abilities_vs_social_background/",
        "text": "In his 2013 book, [Education, Social\nBackground and Cognitive Ability: The Decline of the Social](https://www.amazon.com/Education-Social-Background-Cognitive-Ability/dp/0415842468), Gary N. Marks's argues that educational, occupational and economic achievements are primarily determined by individual , i.e. genetic, cognitive ability, as opposed to one's social upbringing which Mark's contests has a negligible impact overall. To quote from a [review](https://www.researchgate.net/publication/304308423_Review_of_Gary_Neil_Marks_2013_Education_Social_Background_and_Cognitive_Ability_The_Decline_of_the_Social) by Artur Pokropek on educational achievement:\n\n&gt;Marks continues to demonstrate that socio-economic inequalities in education are not as strong as often assumed by reproduction theory.\nThe relationship between an individual’s socio-economic background and test scores is typically small. The correlations are between 0.3 and 0.4, which is directly counter to the claims of reproduction theories that stipulate that socio-economic background is the most crucial (if not the only) factor that determines test scores.\n\nI would like to enquire if there is any consensus in the sociological literature concerning which of these two factors, socio-economic upbringing and cognitive ability, plays the predominant role pertaining to the aforementioned outcomes?\n\nEDIT: The original text linked to a review of Mark's book. This was fixed to link to the actual book. ",
        "created_utc": 1510327479,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone direct me to some good papers about conflict analysis with particular cases studies on South Africa??",
        "author": "sesame_snapss",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c1pal/can_anyone_direct_me_to_some_good_papers_about/",
        "text": "",
        "created_utc": 1510327174,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | November 10, 2017",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7c19rf/friday_freeforall_november_10_2017/",
        "text": "[removed]",
        "created_utc": 1510322754,
        "upvote_ratio": ""
    }
]