[
    {
        "title": "If any two members of a species shares 99% of their genes why is kin selection usually limited to direct family members?",
        "author": "googolplexbyte",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92v9ly/if_any_two_members_of_a_species_shares_99_of/",
        "text": "Usually when inclusive fitness is described, helping your children makes sense because you share half your genes. But isn't that half of the 1% of genes not common to all members of your species.\n\nHelping any member of your species still benefits a supermajority of your genes.\n\nHeck, helping a banana plant survive should be 50% benefit of helping another person since you share half your genetic code.",
        "created_utc": 1532875828,
        "upvote_ratio": ""
    },
    {
        "title": "help me Reddit to grow some scientists",
        "author": "shankasur",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92v8cj/help_me_reddit_to_grow_some_scientists/",
        "text": "hello reddit i know this is not a question but hear me out i am trying to build a club of undergrad students in my college to promote and essentially to learn how to do scientific research \n    scientist aren't born but nurtured and trained and i need your help for it suggest me some activities for my club which will help us to grow a broader scientific mindset and skills to do research \npls",
        "created_utc": 1532875512,
        "upvote_ratio": ""
    },
    {
        "title": "Lactobacillales sensitivity to gastric and bilde acid",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92v6y9/lactobacillales_sensitivity_to_gastric_and_bilde/",
        "text": "[deleted]",
        "created_utc": 1532875156,
        "upvote_ratio": ""
    },
    {
        "title": "What books would you recommend for learning the general theory of relativity?",
        "author": "-Rampage-",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92v6br/what_books_would_you_recommend_for_learning_the/",
        "text": "I'm looking for some books to learn the general theory of relativity, especially something that would explain the thought processes which the theory was derived from. I do understand special theory of relativity perfectly fine, and the logic behind it, but I feel like there arent enough explanations and thought processes behind general relativity for me to understand it in the fullest, at least not in the original Einstein's book.",
        "created_utc": 1532874986,
        "upvote_ratio": ""
    },
    {
        "title": "Life on Venus?",
        "author": "RomeoDog3d",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92v1uz/life_on_venus/",
        "text": "Isn't it much more likely that there is life on Venus, a planet with no water but the atmosphere and many chemical variations and reactions? \n\nYes its hot as hell there, but we also found life in volcanos on earth and under the sea. ",
        "created_utc": 1532873863,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a goldfish. How do I prove light behaves differently outside my bowl?",
        "author": "Kancho_Ninja",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92udhe/im_a_goldfish_how_do_i_prove_light_behaves/",
        "text": "Assume the bowl is completely sealed and filled with water.",
        "created_utc": 1532866580,
        "upvote_ratio": ""
    },
    {
        "title": "Can a person go deaf if they break the sound barrier?",
        "author": "GokuFrost",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92uc2t/can_a_person_go_deaf_if_they_break_the_sound/",
        "text": "I know that sonic booms are created after the sound barrier is broken, but if a person in a car breaks the sound barrier (example: F1 racer) would the person go deaf, or just have impaired hearing temporarily?",
        "created_utc": 1532866124,
        "upvote_ratio": ""
    },
    {
        "title": "Which area of science receives more money for research?",
        "author": "Pavancurt",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92tcez/which_area_of_science_receives_more_money_for/",
        "text": "Which area of science receives more money for research? What about the other ones? ",
        "created_utc": 1532851942,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if you surrounded a light source in a perfect mirror?",
        "author": "Njumkiyy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92sy6i/what_would_happen_if_you_surrounded_a_light/",
        "text": "[removed]",
        "created_utc": 1532846419,
        "upvote_ratio": ""
    },
    {
        "title": "If we're approaching a biodiversity collapse and the lack diversity led species to die off, while smaller species kept on and one led to us humans. Could birds evolve back into dinosaurs if humans can't handle warmer earth and die off?",
        "author": "humandronebot00100",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92sujy/if_were_approaching_a_biodiversity_collapse_and/",
        "text": "I seen in a kids show that birds are dinosaur, could they evolve to at least become the most  dominant on earth again? Or maybe there won't be repetitions and a new species or current species we wouldn't imagine taking the world over. ",
        "created_utc": 1532845088,
        "upvote_ratio": ""
    },
    {
        "title": "If space was negatively curved, how would planets and spacecraft move? Could solar systems exist?",
        "author": "curiousscribbler",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92rstq/if_space_was_negatively_curved_how_would_planets/",
        "text": "",
        "created_utc": 1532833451,
        "upvote_ratio": ""
    },
    {
        "title": "How different would our sky look if light traveled infinitely fast?",
        "author": "cjreeder42",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92rrza/how_different_would_our_sky_look_if_light/",
        "text": "[removed]",
        "created_utc": 1532833234,
        "upvote_ratio": ""
    },
    {
        "title": "Fermi Paradox: Are we the first?",
        "author": "curiously_clueless",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92r6wi/fermi_paradox_are_we_the_first/",
        "text": "Where are we in the overall timeline of possible life in the universe?\n\nWhat I mean by this, is I'm assuming there's a point, before which intelligent life would not be possible, due to the fact that heavier elements hadn't been formed and dispersed by earlier stars.\n\nLikewise, I'm assuming at some point, hydrogen will become less and less available to produce new stars, and the existing number of long lasting stable stars which are ideal to support life will dwindle.\n\nSo where are we on that timeline? If we're early, is it possible that we're so early that other intelligent life hasn't arisen?\n\nAlso, where can I read more about this?\n\nThanks!\n",
        "created_utc": 1532827306,
        "upvote_ratio": ""
    },
    {
        "title": "What would it feel like for an astronaut to burn up during re-entry into Earth's atmosphere only equipped with an EVA suit?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92qr7l/what_would_it_feel_like_for_an_astronaut_to_burn/",
        "text": "",
        "created_utc": 1532823180,
        "upvote_ratio": ""
    },
    {
        "title": "What are the possibilities of a fusion reactor?",
        "author": "Techtatious",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92pqg1/what_are_the_possibilities_of_a_fusion_reactor/",
        "text": "Let's say a fully functional fusion reactor is built tomorrow, what are the possible outcomes that will result from this? (I.E. clean energy, new technologies, new way of life?, etc.)",
        "created_utc": 1532814329,
        "upvote_ratio": ""
    },
    {
        "title": "Is using naturally occurring x-rays for imaging possible?",
        "author": "QWERTY_REVEALED",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92ppkj/is_using_naturally_occurring_xrays_for_imaging/",
        "text": "All joking about Superman's x-ray vision aside, I have been thinking about the possibility of visualizing the world around us with x-rays. I know about using a portable x-ray imager via back-scatter: [https://www.heuresistech.com/hbi120](https://www.heuresistech.com/hbi120) But what about visualization of naturally occurring x-rays?\n\nHere are some thoughts and facts I have gathered :\n\n* The average exposure to background radiation in the US is 3.0 mSv/yr. This is .0082 mSv/day. A standard chest Xray (CXR) exposes one to 0.1 mSv, thus background radiation gives a person the equivalent of 0.082 CXR's/day, or 1 CXR every 12.2 days. (source: [http://www.xrayrisk.com/faq.php#q13](http://www.xrayrisk.com/faq.php#q13)) \n* And a 7-hr airplane ride leads to 0.02 mSv exposure, which would be a daily rate of 0.034 mSv/day or 1 CXR every 2.9 days. (source: [http://www.xrayrisk.com/faq.php#q13](http://www.xrayrisk.com/faq.php#q13))\n* The amount of radiation energy needed to produce a CXR or other x-ray imaging is now much better than it used to be in the past, due to improved digital sensors. I assume the sensitivity of sensors will continue to improve. ([https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8003260](https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8003260))\n* Visible light photos have a wavelength of about 10-6 m and x-ray photons are about 10-9 m. Detection of x-ray photons can be achieved by interaction with phosphorus (used for traditional x-ray film imaging), or now with charged-coupled devices (CCD's). ([http://www.flexenable.com/Blog/the-future-of-x-ray-technology/](http://www.flexenable.com/Blog/the-future-of-x-ray-technology/))\n* A traditional camera takes photons and focuses the light to an understandable image with lenses. Because x-rays are more energetic, they tend to just go right through the lens and not interact with it very much. But X-rays *can* be focused, and the field of study is called x-ray optics. Stacked columns of refractive lenses can be used for focusing. ([https://en.wikipedia.org/wiki/X-ray\\_optics](https://en.wikipedia.org/wiki/X-ray_optics)). \n* Even without focusing photons into a coherent image, one could obtain a silhouette of an object against the sun using either a raster scan of a single-photon detector, or by using an array of CCD's. This would be roughly analogous to muon-tomography used to image pyramids in Egypt. ([https://en.wikipedia.org/wiki/Muon\\_tomography](https://en.wikipedia.org/wiki/Muon_tomography))\n\nSo ultimately, this comes down to the current ability of x-ray sensors to detect the small amounts of naturally occurring x-rays.\n\nQuestion:\n\n* Does anyone think this is currently do-able? \n* If not now, then what would be a reasonable timeline to reach the needed level of sensitivity?\n* Any gotcha's I'm not considering?  \n ",
        "created_utc": 1532814127,
        "upvote_ratio": ""
    },
    {
        "title": "Is this the Scientific Method?",
        "author": "Redditjwg2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92poop/is_this_the_scientific_method/",
        "text": "1) Review data\n2) Make Hypotheses \n3) mathematically derive conclusions \n4) If the conclusions match experimental data then the hypotheses are correct.\nIs the theory correct?",
        "created_utc": 1532813920,
        "upvote_ratio": ""
    },
    {
        "title": "What would be required for x-ray vision? (serious)",
        "author": "QWERTY_REVEALED",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92pmrv/what_would_be_required_for_xray_vision_serious/",
        "text": "[removed]",
        "created_utc": 1532813473,
        "upvote_ratio": ""
    },
    {
        "title": "If the Earth were to explode the same way it does in movies/video games, how would the explosion itself affect other celestial bodies?",
        "author": "JeffHwinger",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92pcjd/if_the_earth_were_to_explode_the_same_way_it_does/",
        "text": "I was watching the ending of Super Metroid (spoiler alert), and when Norfair exploded it got me thinking. If a planet such as the Earth were to explode in a way similar to putting a firecracker in an apple, how would that effect the other parts of the solar system? Would the only threat be flying debris due to the vacuum of space? Or could an explosion of this scale cause some sort of anomaly on nearby planets/stars? ",
        "created_utc": 1532811124,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't I find any cases of anaphylaxis after drinking water (H2O) in medical literature?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92oi0a/why_cant_i_find_any_cases_of_anaphylaxis_after/",
        "text": "[removed]",
        "created_utc": 1532804233,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the effect if we were to somehow bring a massive amount of ice from Mars to Earth in an effort to counteract global warming?",
        "author": "detect0r",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92nvu0/what_would_be_the_effect_if_we_were_to_somehow/",
        "text": "I saw a comment on a recent story about the record high temperatures experienced so far in 2018 that suggested this idea. I know that this is far-fetched and would probably only act as a band-aid if effective at all, but it got me wondering. Would there be other consequences apart from temperature change? How effective would it be? Would dropping it through the atmosphere produce some kind of fallout?",
        "created_utc": 1532799395,
        "upvote_ratio": ""
    },
    {
        "title": "Alcubierre York Time Equation",
        "author": "MitBalkens",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92muos/alcubierre_york_time_equation/",
        "text": "In the context of Miguel Alcubierre's proposed warp drive, there is an equation that measures the expansion / contraction of space. This is called York Time and is defined as theta=v(x/r) f'(r). What is theta supposed to be in units? It doesn't seem to ascribe any particular unit to it. Also, x seems to not be defined as anything. Thanks for any help you can provide. Below are links to Warp Field Mechanics 101/2.\n\n[https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20110015936.pdf](https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20110015936.pdf)\n\n[https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20130011213.pdf](https://ntrs.nasa.gov/archive/nasa/casi.ntrs.nasa.gov/20130011213.pdf)",
        "created_utc": 1532791143,
        "upvote_ratio": ""
    },
    {
        "title": "Are insects conscious or are they little robots?",
        "author": "Torin_3",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92mfdf/are_insects_conscious_or_are_they_little_robots/",
        "text": "",
        "created_utc": 1532787406,
        "upvote_ratio": ""
    },
    {
        "title": "Some questions about a setting for a science fiction series.",
        "author": "harx-SERIOUSBUSINESS",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92l7u0/some_questions_about_a_setting_for_a_science/",
        "text": "Hey, so as to not spam the subreddit, I have made just one post with multiple questions.\n\nThe first question is, is it possible to create a small black hole, for example, one with a event horizon diametre of three centimetres. I did some research and while wiki defines a micro black hole as possible, since the lower limit is 22micrograms, I got a little lost with the technical terms.\n\nSecondly, if it is possible to have a black hole that small, what kind of energy would go into/be used to create it? \n\nThird question -  Alcubierre drive/Warped space. While doing some research for 'inspiration', I learnt about this. My actual question is, instead of travelling vast distances very, very quickly, could it instead be used to move something incredibly heavy, eg, a black hole, a very small distance. \n\nFourth question - Is it possible to build a black hole generator, a-la the kurzgesagt video, which could be sustained by a micro black hole. \n\nThis all comes together in a final question.\n\nIs it theoritical possible to;\n\na) make a micro black hole\n\nb) build a black hole generotor around it\n\nc) warp space around said black hole and black hole generator\n\nd) allowing the black hole to move in sync with a planet while providing energy.\n\nOr would it explode and kill everything? \n\nThank you for reading through my rambling, if there is anything I have not explained sufficently, I will reply as soon as I can.\n\nThanks in advance!",
        "created_utc": 1532774118,
        "upvote_ratio": ""
    },
    {
        "title": "How might the concept of TIME be different if life evolved on a different planet?",
        "author": "thenaturalstate",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92ka6j/how_might_the_concept_of_time_be_different_if/",
        "text": "How might the concept of time difference if life evolved on a different planet? Would any of the theories or laws of physics be different?",
        "created_utc": 1532761468,
        "upvote_ratio": ""
    },
    {
        "title": "What psedosicientific claims in computer science have been falsified?",
        "author": "Oflameo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92jxtc/what_psedosicientific_claims_in_computer_science/",
        "text": "",
        "created_utc": 1532757451,
        "upvote_ratio": ""
    },
    {
        "title": "How stretchy are arteries?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92j13i/how_stretchy_are_arteries/",
        "text": "[deleted]",
        "created_utc": 1532748047,
        "upvote_ratio": ""
    },
    {
        "title": "Do other nearby planets and celestial bodies' gravitational energy have any affect on our tectonic plates?",
        "author": "gud4bad248",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92ixbj/do_other_nearby_planets_and_celestial_bodies/",
        "text": "With all of the recent news surrounding Teton and Yellowstone, I was curious to see if the Moon position, and other planet locations had any affect gravitationally on the movement of our tectonic plates. Moreover, does the specific lining up of planets increase gravitational strain on our planet?",
        "created_utc": 1532747054,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be possible, given a long enough time frame, to erase the desire to reproduce.",
        "author": "Savassan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92g5jc/would_it_be_possible_given_a_long_enough_time/",
        "text": "This has been the scenario in several fantasy shows i have watched. I tend to watch a lot of shows and seen a lot of crazy plots, and i am normally not bothered with strange plotlines. I like to kinda think of how/if it could ever be remotely possible.\n\nBut one plot line that has always bugged me is in shows where a society has developed to the point that the main/only source of new life is threw artificial means with 0 natural births. And then has characters who simply dont have the need/want and typically lack sexual urges. I know its possible to change certain traits/desires/instincts but the natural instinct to reproduce just seems like something that would never be able to be suppressed. But is that simply because no other species could get to the point of being able to sustain a population without natural reproduction?",
        "created_utc": 1532724018,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of planet would the stereotypical alien evolve on?",
        "author": "Baldurrr",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92ftzm/what_kind_of_planet_would_the_stereotypical_alien/",
        "text": "That is to say, the classic little gray/green men. Large eyes and heads, short, sometimes w/o mouths or noses, skinny, hairless, etc. Regardless of whether or not they exist - what sort of environment would such a creature potentially evolve in?",
        "created_utc": 1532721706,
        "upvote_ratio": ""
    },
    {
        "title": "When water evaporates indoors where does it go?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92fjl9/when_water_evaporates_indoors_where_does_it_go/",
        "text": "",
        "created_utc": 1532719604,
        "upvote_ratio": ""
    },
    {
        "title": "Research on head coverings?",
        "author": "bort186",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92fbhi/research_on_head_coverings/",
        "text": "Warm climates around the world have sparked a huge variety of protective and cooling hats both new and old. Opinions welcome, but anyone can debate or opine.  Well-designed scientific research about which ones provide the best cooling and sun protection would offer the most.  ",
        "created_utc": 1532718017,
        "upvote_ratio": ""
    },
    {
        "title": "How many Gs of force could an unmanned spacecraft withstand? Also, how fast (and how far in advance) would an unmanned spacecraft need to accelerate to escape Betelgeuse becoming a supernova while in the same system, assuming a thruster capable of constant acceleration is used?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92faug/how_many_gs_of_force_could_an_unmanned_spacecraft/",
        "text": "Sorry for the double question. I'm writing a science fiction novel, and in one part, an unmanned (except for AI) science vessel is forced to flee the Betelgeuse system using relativistic travel just as Betelgeuse itself is about to go supernova. How far in advance would such a craft need to start moving in order to escape destruction in that scenario?",
        "created_utc": 1532717895,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any hope for FTL travel?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92etmq/is_there_any_hope_for_ftl_travel/",
        "text": "[removed]",
        "created_utc": 1532714571,
        "upvote_ratio": ""
    },
    {
        "title": "When we start a new colony in space, can we leave some diseases behind or are we bound to them by our DNA?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92eloq/when_we_start_a_new_colony_in_space_can_we_leave/",
        "text": "[deleted]",
        "created_utc": 1532713082,
        "upvote_ratio": ""
    },
    {
        "title": "Indivisible particle orbiting the event horizon.",
        "author": "MarYuReddit427",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92e2tj/indivisible_particle_orbiting_the_event_horizon/",
        "text": "What would happen when a fundamental and indivisible particle orbited a black hole with one half of it inside the event horizon and the other half outside the event horizon. We will assume the particle will remain in stable circular orbit no matter what, like an external imaginary force of propulsion.",
        "created_utc": 1532709489,
        "upvote_ratio": ""
    },
    {
        "title": "Would an object striking the Earth with sufficient energy to expose the upper mantel be an extinction level event? What would the short and long term environmental effects be?",
        "author": "FnordBear",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92cjr7/would_an_object_striking_the_earth_with/",
        "text": "Further variables:\n\nOcean impact effects.\nLand impact effects.\n\n[](/twieek)",
        "created_utc": 1532698428,
        "upvote_ratio": ""
    },
    {
        "title": "Which race is hairier, Indians (south Asians) or whites?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92c41l/which_race_is_hairier_indians_south_asians_or/",
        "text": "[deleted]",
        "created_utc": 1532694804,
        "upvote_ratio": ""
    },
    {
        "title": "Could you achieve FTL communication with a really long stick?",
        "author": "Sophia_Forever",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92bgrz/could_you_achieve_ftl_communication_with_a_really/",
        "text": "Say you had a rod of superhard material (diamond or lonsdaleite or whatever the lest compressible material we know of is) that was 1' in diameter and 1 lightyear long. You would then be able to speak in binary to the person on the other end of the stick by pushing and pulling the stick back and forth. My question is, wouldn't this be a near-instant form of communication with the person on the other side of the rod or would the material still compress enough to not have the end of the rod move quickly enough?",
        "created_utc": 1532688430,
        "upvote_ratio": ""
    },
    {
        "title": "Would a \"layered\" LCD/OLED display with discreet RGB panels be able to produce higher pixel density? Why isn't this done?",
        "author": "misterchief117",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92azos/would_a_layered_lcdoled_display_with_discreet_rgb/",
        "text": "As it stands, display tech is limited by how small we can make each pixel and sub pixel while still being cost effective to produce and sell.\n\nWith VR and other head-mounted displays (HMD) becoming more popular, a ton of R&amp;D is going into making smaller pixels and reducing the distance between each pixel to remove the screen door effect.\n\nI'm trying to determine why a completely different approach hasn't been done when it's pretty obvious: Stacked panels where each only has one color pixel.\n\nGreen would be in the back, blue in the middle, and red being in the front. Each pixel would line up with one another and will still be able to produce different colors because that's how additive color works. \n\nI specify this RGB order because the human eye is the most sensitive to green which means that the green pixels are allowed to suffer more loss in luminosity from going through two other panels while not really being too noticeable. Blue light has more energy than red and shouldnt have much of a problem shining through. Red being the front because it's the lowest energy.\n\nAnyways, this method should in theory allow for each panel to have individual pixels to be the same size, if not smaller, than each discreet sub pixel on current displays. This would allow for insane pixel density (at least 3 times more) and should also have the benefits of almost completely removing the screen door effect for HMD.\n\nThe overall cost and production process shouldn't change too much compared to how current displays are produced; I would imagine very little re-tooling would be needed.\n\nIs there any reason that this hasn't taken off or is my idea just fundamentally flawed?\n\nEDIT: These are all really good answers so far! I really appreciate it!",
        "created_utc": 1532682932,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if humanity perfected agelessness and birth control in the near future?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92a687/what_would_happen_if_humanity_perfected/",
        "text": "[deleted]",
        "created_utc": 1532673215,
        "upvote_ratio": ""
    },
    {
        "title": "What sport would be the easiest in .5G?",
        "author": "I_Am_Slightly_Evil",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/929t5d/what_sport_would_be_the_easiest_in_5g/",
        "text": "Which would become the most difficult?\n\n",
        "created_utc": 1532669397,
        "upvote_ratio": ""
    },
    {
        "title": "If a group of astronauts played baseball on the Moon, would a home run b sufficient to cause the ball to achieve escape velocity? If not, how far would it be possible to hit the ball?",
        "author": "Chicken_Spanker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/929pj0/if_a_group_of_astronauts_played_baseball_on_the/",
        "text": "",
        "created_utc": 1532668376,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for someone get pneumonia from breathing too much water/mist in the air during an extremely heavy rain storm?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/929830/is_it_possible_for_someone_get_pneumonia_from/",
        "text": "[removed]",
        "created_utc": 1532663761,
        "upvote_ratio": ""
    },
    {
        "title": "If the Moon were to Suddenly Disappear would earths gravity increase?",
        "author": "13alamugunth",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/928lfg/if_the_moon_were_to_suddenly_disappear_would/",
        "text": "[removed]",
        "created_utc": 1532657979,
        "upvote_ratio": ""
    },
    {
        "title": "Stem cell cornea regeneration?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9282su/stem_cell_cornea_regeneration/",
        "text": "[deleted]",
        "created_utc": 1532653602,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if the oceans were dry - not if the oceans DRIED UP, but if there were no water in them to begin with? Could we walk down?",
        "author": "TiredFlower3",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/928049/what_would_happen_if_the_oceans_were_dry_not_if/",
        "text": "I saw answers on Google to the question \"what would happen if the oceans disappeared/dried up\", but that's actually not my question. I was wondering, if the oceans were dry, could we walk down into them? Like could we explore the Mariana Trench like we'd explore a cave? Right now we can only go so far down because of \"pressure\" - but the pressure is because of the water, right? So, if the water were gone, and you went to a beach, you could just - keep going, and your ears would not pop, correct? That is my question. Like if we'd be able to literally walk into what is now the ocean and explore it on foot like we explore caves. Thanks!",
        "created_utc": 1532653002,
        "upvote_ratio": ""
    },
    {
        "title": "Hi, how would someone take a flower (for example), then break it down and analyze the organic molecules in it?",
        "author": "Mr_Goodnite",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/927ssy/hi_how_would_someone_take_a_flower_for_example/",
        "text": "I’m halfway through an undergrad in molecular and Cellular Biology, and I’m sure this topic will be researched more in a later course. But, I live in the woods of WV and I’m really interested in all the molecules around me. Also, is there any way to do it at home? I couldn’t find much on google.",
        "created_utc": 1532651315,
        "upvote_ratio": ""
    },
    {
        "title": "Is it reasonable to say, the real hurdle in the evolution of intelligent species, is the step from single cell to multi cell?",
        "author": "BorisGuzo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/927s11/is_it_reasonable_to_say_the_real_hurdle_in_the/",
        "text": "I know there's no consensus on the exact timeline, but most sources I've read ([eg](https://en.wikipedia.org/wiki/Timeline_of_the_evolutionary_history_of_life)) roughly average around the same:\n\nEarth forms around 4.5 billion yeas ago\n\nTakes a few hundred million year to cool down, and it can have liquid water\n\nAnd in another few hundred years (almost instantly in geological time scale) single cell organisms show up\n\nThen, it takes roughly 3 billion years to go from single cell to multi cellular life\n\nAnd it takes only 1 billion years to go from first multi cellular life to homo sapiens\n\nI know evolution doesn't necessarily favor intelligence. But I'm awed that the seemingly simple step forward from single cell to multi cell took 3 times as long, compared to the seemingly huge step from multi cell to homo sapiens.\n\nAre there any theories that try to explain this? Could you point me to some related reading?\n\nThanks, and sorry for my English.\n\n\n\n",
        "created_utc": 1532651129,
        "upvote_ratio": ""
    },
    {
        "title": "Can sound make fruit explode or change?",
        "author": "GokuFrost",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/927hep/can_sound_make_fruit_explode_or_change/",
        "text": "I watched Game Theory on the MK scream finisher and I wanted to know if sound can actually cause fruit to explode. I know that sound ca break glass, but would a change in decibels or frequency affect fruit or veg? Please tell me your thoughts on this. \nLink to Game Theory video here: \nhttps://www.youtube.com/watch?v=hmiCMZ9uFiQ",
        "created_utc": 1532648734,
        "upvote_ratio": ""
    },
    {
        "title": "Similar to the code on the Voyager Golden Record - what cosmically decipherable code could you use to indicate a location on planet earth, and its age?",
        "author": "DanSeale",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/927b0g/similar_to_the_code_on_the_voyager_golden_record/",
        "text": "I really like the way the Pioneer Plaque and the Voyager Golden Record is able to convey information with a code that could be understood by intelligent life.\n\nI wondered if there would be a way to achieve the same level of cryptic and elegant code that could describe a location on planet earth, and its age?\n\nThe idea being that an extraterrestrial could, without any knowledge of our cartography or calendars, eventually decipher the information.",
        "created_utc": 1532647319,
        "upvote_ratio": ""
    },
    {
        "title": "What fluid dynamics principle is causing this to happen (image link in text)?",
        "author": "NotSoMagicalTrevor",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9273fe/what_fluid_dynamics_principle_is_causing_this_to/",
        "text": "Any idea what's going on in [this image](https://i.imgur.com/fPDN6Wd.jpg)? It's some home-made hot sauce that has been sitting for a while, and the vinegar (clear) has separated out from the spicy (red)... but there's a raised column in the center that matches the neck of the bottle. Violates my understanding of fluid dynamics because I would have assumed that the heavier stuff (red) would be flat and not effected by the layer on top.  This configuration was stable -- it was like this for many weeks. ",
        "created_utc": 1532645713,
        "upvote_ratio": ""
    },
    {
        "title": "Are all pancomputationalist models for the universe compatible with informational realism?",
        "author": "vmaggio",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/92707x/are_all_pancomputationalist_models_for_the/",
        "text": "[removed]",
        "created_utc": 1532645028,
        "upvote_ratio": ""
    },
    {
        "title": "Traditional science publishing is broken",
        "author": "FRLara",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/926y39/traditional_science_publishing_is_broken/",
        "text": "[removed]",
        "created_utc": 1532644566,
        "upvote_ratio": ""
    },
    {
        "title": "How much anti-matter would it take to power humanity for a day?",
        "author": "SenatorHune",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9262fm/how_much_antimatter_would_it_take_to_power/",
        "text": "",
        "created_utc": 1532638215,
        "upvote_ratio": ""
    },
    {
        "title": "Would fruit explode if sent into space?",
        "author": "GokuFrost",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9261ed/would_fruit_explode_if_sent_into_space/",
        "text": "From what I know, space is a huge vacuum of nothingness. I know that humans would probably choke or even have their lungs explode from the strength of the vacuum and lack of oxygen. Would fruits retain their shape while floating in space, or would they pop or explode like human organs would? I find this an interesting subject. Anyone who has any thoughts, please let me know.",
        "created_utc": 1532638023,
        "upvote_ratio": ""
    },
    {
        "title": "What would we need to get a 99.99% accurate read on the beginning of our universe?",
        "author": "jefemartinez",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/925sfr/what_would_we_need_to_get_a_9999_accurate_read_on/",
        "text": "I was trying to think of a universally-acceptable “stardate” that could be used, so I figured the best point of reference would be from the beginning of of universe. From a brief search, it looks like we’re about 13.8ish billion years into the ride, but there’s an uncertainty range of a few dozen million years.\n\nWhat technology (or solution) would we need to get a basically perfect read on this?",
        "created_utc": 1532636297,
        "upvote_ratio": ""
    },
    {
        "title": "As we know so far, nothing can exceed speed of light. So if a long train that travel at speed of light with a kid inside. The kid started to run from one end of a train to another, would she be in slow motion or freeze relative to the observer?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/925lo9/as_we_know_so_far_nothing_can_exceed_speed_of/",
        "text": "[removed]",
        "created_utc": 1532635036,
        "upvote_ratio": ""
    },
    {
        "title": "Could we teraform Mars to be suitable for us to live?",
        "author": "ExCanMan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9255ki/could_we_teraform_mars_to_be_suitable_for_us_to/",
        "text": "I wonder if we could somehow change and stabilize the atmosphere and after making all the ice melt plant trees and breed wildlife to adapt to the atmosphere? How long would it take if traveling from earth wouldn't be a problem anymore?",
        "created_utc": 1532631914,
        "upvote_ratio": ""
    },
    {
        "title": "Could a star collapsing into a black hole leave surrounding planets mostly not effected?",
        "author": "JapaMala",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/924s04/could_a_star_collapsing_into_a_black_hole_leave/",
        "text": "A web comic I was reading had that as a plot point, where the residents of a planet watched their sun turn into a black hole, and the only effect was that their climate just got colder and colder.\nI would assume such an even would accompany a nova of some sort, blasting the planet clean. Am I wrong? Is this possible? ",
        "created_utc": 1532629352,
        "upvote_ratio": ""
    },
    {
        "title": "Which of the GAS and ICE giants is it easiest for a manned mission?",
        "author": "88880",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/924nqt/which_of_the_gas_and_ice_giants_is_it_easiest_for/",
        "text": "With the immense fuel requirement for a transfer fast enough to be manned, which other factors count in to make a mission to any of the four outer planets relatively easier?\n\nHow do the required infrastructure and the delta-v requirements actually compare? Would there be a huge gap between the durations of the four missions anyways?",
        "created_utc": 1532628545,
        "upvote_ratio": ""
    },
    {
        "title": "does our orbiting speed around the galaxy affect our perception of time dilation?",
        "author": "BHPhreak",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/924gds/does_our_orbiting_speed_around_the_galaxy_affect/",
        "text": "our earth rotates at a certain speed, we orbit the sun, our sun orbits the galaxy center...\n\nim wondering how much speed is built up through all that, and if it has effect on our perception of time dilation\n\nif we could hypothetically throw an anchor out and stop the earths motion and watch as the sun and other planets went flying away, would time slow or speed up for us, relative to say someone we left on mars still orbiting the sun around the galaxy?",
        "created_utc": 1532627170,
        "upvote_ratio": ""
    },
    {
        "title": "Why aren't we going to the moon more often?",
        "author": "mcmanybucks",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9242kg/why_arent_we_going_to_the_moon_more_often/",
        "text": "We've obviously proven that we can so why not do it again as a new milestone? put up something visible too for the non-believers.\n",
        "created_utc": 1532624602,
        "upvote_ratio": ""
    },
    {
        "title": "The Contradiction between the Jungian Collective Unconcious and Darwins Theory of Natural Selection",
        "author": "itsCat",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9240cx/the_contradiction_between_the_jungian_collective/",
        "text": "This is a question regarding the Jungian theory of the collective unconcious. Which is essentially the proposition that there’s a certain amount of unconcious operations that are more or less homogenous between all human beings.\n\nThe theory of the collective unconcious actually strictly contradicts natural selection. Since natural selection only implies that men with more favorable traits reproduce. But why is it then, that archetypal symbols like for example the snake, is a conspicious part of the unconcious mind. How would —",
        "created_utc": 1532624200,
        "upvote_ratio": ""
    },
    {
        "title": "When people get old, do they loose the ability to control their emotions like children?",
        "author": "SophieSnuggleBug",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/923gj3/when_people_get_old_do_they_loose_the_ability_to/",
        "text": " Maybe I'm just now noticing, but my grandparents(I live with them) seem to lose their temper easily. They get red mad when someone says something that offends them, and are very hypocritical. Like, if I do something and they call it childish, I have to take it, but if they're doing the *exact same thing*, and I say \"I'm going to be the adult and walk away\" they get FURIOUS yelling that they're the adults, and I'm just **crazy**.\n\nYeah, I am diagnosed bipolar, depressive, anxious, and I think paranoia but that one isn't diagnosed.\n\nIs that really a reason to berate me by saying I'm crazy? Because I said I'm going to be the adult?\n\nSo I want to know, when people get old(They are 60 and 65) do they lose control of their emotions? Or have they always probably been this way and I'm just now seeing it because I'm finally being an adult(I'm 20)?",
        "created_utc": 1532620484,
        "upvote_ratio": ""
    },
    {
        "title": "Could we recreate the pyramids today?",
        "author": "88880",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/923dgm/could_we_recreate_the_pyramids_today/",
        "text": "If we attempted to duplicate Egyptian pyramids with current technology and infrastructure, would it be plausible?\n\nWhat sort of power would it take? For what time? How would we source the immense amount of material? What is keeping us from doing it right now?",
        "created_utc": 1532619895,
        "upvote_ratio": ""
    },
    {
        "title": "How well would you be able to see a spaceship in interstellar space?",
        "author": "MrDrProfTimeLord",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/921qj1/how_well_would_you_be_able_to_see_a_spaceship_in/",
        "text": "In just about every scifi show ever, when ships are flying through interstellar space, they look far brighter than the surrounding starlight suggests it should be. But does this mean you wouldn't be able to see a ship in interstellar space at all? Would the space it occupies just look like a 3-D spaceship-shaped shadow? Or would real spaceships have to use lights the way boats do?\n\nEDIT: It is possible that the combined visible light of all the stars coming in from all sides would be enough to see reasonably well? Could the light of the Milky Way itself contribute to visibility? After all, we do have that huge glowing band in the sky above our planet. In an environment where all this is coming in from all sides with no atmospheric interference, could this work?",
        "created_utc": 1532607353,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if a black hole and an antimatter black hole collided?",
        "author": "NerdyPug123",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/920zkn/what_would_happen_if_a_black_hole_and_an/",
        "text": "",
        "created_utc": 1532599725,
        "upvote_ratio": ""
    },
    {
        "title": "Does a spherical universe break the physics?",
        "author": "MartinKardis",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/920w25/does_a_spherical_universe_break_the_physics/",
        "text": "Here's a thought experiment I thought of:\n\nConsider the twins, living in an early spherical universe, small enough not to expand faster than the speed of light (actually, to keep things simple, let's make it not expand at all). Let's say that one of them leaves the Earth in a high-speed rocket. Each sibling should see the other one age slower. \n\nNow usually, the paradox is resolved by the fact that to compare their clocks, the travelling twin has to turn back, breaking the symmetry by accelerating. However, in a spherical universe, the twin could go around and back to the Earth without accelerating. \n\nIt would seem that from each twin's point of view, the other one should age slower. Yet when they meet, only one result may be true. What's the solution to this paradox?",
        "created_utc": 1532598666,
        "upvote_ratio": ""
    },
    {
        "title": "Could birds fly in a rotating habitat (O'Neill Cylinder)?",
        "author": "MartinKardis",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/920rja/could_birds_fly_in_a_rotating_habitat_oneill/",
        "text": "Also, would it be possible to have different sections of the habitat rotate with different speeds?",
        "created_utc": 1532597197,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of small life forms are in water? Are they found in filtered sources like bottled water?",
        "author": "AutomaticPunches",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91ydvy/what_kind_of_small_life_forms_are_in_water_are/",
        "text": "I saw a picture on Twitter that is supposedly “water under a microscope”. Does it look real? And if anyone could tell me what the small shrimp like things are that would be awesome. https://imgur.com/gallery/3TwKt3P",
        "created_utc": 1532572386,
        "upvote_ratio": ""
    },
    {
        "title": "Using known materials and engineering methods, is it possible to send a manned spacecraft to Proxima Centuri?",
        "author": "Jay_B_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91y694/using_known_materials_and_engineering_methods_is/",
        "text": "Just curious if we could do it, given unlimited resources (materials, budget, etc.). Is it possible to build a ship which could support a habitat for people, and send it to the next-closest star?",
        "created_utc": 1532570590,
        "upvote_ratio": ""
    },
    {
        "title": "is time a real thing?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91y0z7/is_time_a_real_thing/",
        "text": "[removed]",
        "created_utc": 1532569348,
        "upvote_ratio": ""
    },
    {
        "title": "Attempting to do some research on supervolcanoes for a novel I'm currently working on.",
        "author": "KiiNGKiiLL",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91xctz/attempting_to_do_some_research_on_supervolcanoes/",
        "text": "Before I get started, I'd like to apologize for accidentally posting this to r/AskScience rather than here as what we're about to discuss is hypothetical and a work of fiction. I need to pay attention to what I'm doing when I decide to post a thread.\n\nWith that said, let's begin with why I'm even here in the first place. The novel that I'm writing is a post-apocalyptic scenario that was caused by the eruptions of multiple, if not every, supervolcano on the planet. The more I think about it, the more I start to worry whether or not it's even a plausible scenario, regardless of being fiction or not. At first, I was planning on every SV erupting at the same time, but there's no way we would survive that; so now I'm thinking multiple eruptions over a certain period of time. Here are the questions...\n\n1. Would humans survive multiple eruptions if those unaffected by the initial blasts retreated beneath the surface?\n2. How quickly would the resulting ash clouds from each eruption take to swallow the planet?\n3. How long would humans have to remain beneath the surface before the air quality up top became tolerable again?\n4. How quickly would the planet be plunged into an ice age?\n5. Would the force of these volcanoes be able to crack the planet's mantle?\n6. Would humans be able to revive the planet over time?\n7. What would happen to the planet after the ash settles? \n\nI'm fairly certain I had more questions than this, but these are all I can think of right now. I appreciate anyone who takes the time to answer these and help me out to create a plausible scenario that I'm about to put my characters through. ",
        "created_utc": 1532563946,
        "upvote_ratio": ""
    },
    {
        "title": "Simulated universe hypothesis and its implications vis-à-vis cognitive sciences.",
        "author": "HenryWu001",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91waen/simulated_universe_hypothesis_and_its/",
        "text": "In recent years the hypothesis that the universe we currently reside in lies within a computer simulation designed by either a superintelligence or some natural process has become somewhat popular. It has been argued, by Nick Bostrom for one, that the probability that we live in such a simulation is significant to high. As such one should at least consider it as a possibility. So taking the SUH as at least a possible truth,\n\nDoes it not make our attempts to delve into the human mind and explain consciousness possibly fruitless. After all if our minds our run on a different medium to the \"physical world\" being simulated then consciousness may be unexplainable with the physics, chemistry and biology that explains the \"physical\" world around us. \n\nWithin philosophy the idea of dualism, that the conscious mind is distinct from and separate to the physical world, has lost significance, but if we are to take seriously a SUH (which is of course questionable) then should we not also take seriously the possibility dualism could in fact be true afterall? ",
        "created_utc": 1532555835,
        "upvote_ratio": ""
    },
    {
        "title": "Could a viable human embryo be created from 46 chromosomes each coming from a different individual. AKA could an embryo be created with 46 genetic 'parents'?",
        "author": "Immoral_jellyfish",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91w17y/could_a_viable_human_embryo_be_created_from_46/",
        "text": "",
        "created_utc": 1532554022,
        "upvote_ratio": ""
    },
    {
        "title": "Is time dilation assisted interstellar communication possible?",
        "author": "king_of_finite_space",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91w0li/is_time_dilation_assisted_interstellar/",
        "text": "Suppose two societies orbited distantly separated black holes above their photospheres but close enough to their event horizons to experience dramatic time dilation. Is it possible then that communication signals sent between them, though taking years to transmit across that distance, could be sent and received in a perceived instant by the two societies? Could they also communicate with computers orbiting their own black holes farther out from their gravity wells to get more perceived calculations per second from their collective computing hardware? Has anyone given any analysis of this notion as a possible solution to the Fermi Paradox?",
        "created_utc": 1532553896,
        "upvote_ratio": ""
    },
    {
        "title": "What are the chances that billions of years ago Mars was an earth-like planet and inhabited by intelligent life, but the intelligent life exhausted the planet of its resources and destroyed most of the atmosphere and that's why it looks that way it does now?",
        "author": "Ndemco",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91vzpu/what_are_the_chances_that_billions_of_years_ago/",
        "text": "",
        "created_utc": 1532553730,
        "upvote_ratio": ""
    },
    {
        "title": "If the Electroweak Epoch had lasted longer, could anything analogous to chemistry been possible?",
        "author": "Siarles",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91vmlr/if_the_electroweak_epoch_had_lasted_longer_could/",
        "text": "I have the same question about the Grand Unification and Planck epochs, but I understand that an accurate answer is not possible without a working GUT or a theory of quantum gravity.",
        "created_utc": 1532551192,
        "upvote_ratio": ""
    },
    {
        "title": "Is European and USA approach to engineering somehow different than Japan's approach?",
        "author": "tambyra",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91vmht/is_european_and_usa_approach_to_engineering/",
        "text": "While I was studying a few years ago in a country in Eastern Europe (Electrical Engineering, Automation Control and Robotics) I came across some of the Japanese literature on Engineering. I was amazed by the fact that I didn't understand anything related to the field I was studying. The letters, the constants and the variables were somehow weird. The approach, or something else was just, let's say \"different\".\n\nHowever, I could perfectly understand same literature from USA, and Russia as well.",
        "created_utc": 1532551170,
        "upvote_ratio": ""
    },
    {
        "title": "Could a bullet ever only bump into you?",
        "author": "88880",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91ur2v/could_a_bullet_ever_only_bump_into_you/",
        "text": "Considering a perfect ballistic path, wind conditions, and appropriate position of the firearm and the target, would it be physically possible that the projectile of a bullet would slow down enough to only bump onto the target and fall down?",
        "created_utc": 1532545366,
        "upvote_ratio": ""
    },
    {
        "title": "If we went down to the molecular level, would we be able to point out with precision where I begin and end?",
        "author": "natantantan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91ukaa/if_we_went_down_to_the_molecular_level_would_we/",
        "text": "Would we be able to point at one molecule and say this is the first molecule of my skin or hair and thus that is where I begin and my environment ends? ",
        "created_utc": 1532544110,
        "upvote_ratio": ""
    },
    {
        "title": "If we could line up two earths with similar magnetic poles aligned, would they attract or repel.",
        "author": "carpaltunnelofcarp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91u91i/if_we_could_line_up_two_earths_with_similar/",
        "text": "Would the magnetic force overpower gravity or vice versa?",
        "created_utc": 1532542068,
        "upvote_ratio": ""
    },
    {
        "title": "What is the weirdest feature humans have evolved?",
        "author": "VerifiedMadgod",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91u68l/what_is_the_weirdest_feature_humans_have_evolved/",
        "text": "",
        "created_utc": 1532541573,
        "upvote_ratio": ""
    },
    {
        "title": "If a cubic city block of ground and atmosphere in Manhattan were suddenly replaced with an equivalent cube of the lunar surface and atmosphere, what would be the consequences for the surrounding structures and people?",
        "author": "NMW",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91tpqy/if_a_cubic_city_block_of_ground_and_atmosphere_in/",
        "text": "First, please accept my apologies for the title gore; it turns out that this is really hard to explain in a single sentence!\n\nBasically: Say you have a big chunk of city that is, along with an arbitrary amount of its atmosphere, magically transported to the moon. Say as well that the equivalent amount of ground and atmosphere is somehow transported back to the vacated spot in the same instant. I assume that the Earth's own atmosphere is going to rush in to replace or dilute whatever turns up, but are there going to be dangerous consequences for structures or people nearby? Are they going to get sucked in? Are there elements in the lunar atmosphere (such as it is) that would react badly to those in Earth's? What might happen to the surrounding ground?\n\nFull disclosure: I am working on a story in which something very much like this happens. While the actual mechanism of it is more or less magic, I still want the results to be plausible-ish if they can. This seemed like far too whimsical a question for /r/askscience proper, anyway, but please forgive me if it isn't appropriate for here either.",
        "created_utc": 1532538544,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most bizarre fuels for chemical (rocket) engines?",
        "author": "88880",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91tahb/what_are_the_most_bizarre_fuels_for_chemical/",
        "text": "What are some of the most bizarre 1: real life, or 2: theoretical candidates for the fuels and oxidizers for chemical rocket engines?\n\nAre there any situations where such unusual fuels may be considered for any unusual reasons?",
        "created_utc": 1532535708,
        "upvote_ratio": ""
    },
    {
        "title": "Should we worry more about (1) biological attack through reverse engineering made more accessible or (2) old microorganisms unfreezing through global warming?",
        "author": "emanu3ll3",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91sw6c/should_we_worry_more_about_1_biological_attack/",
        "text": "",
        "created_utc": 1532533024,
        "upvote_ratio": ""
    },
    {
        "title": "Which chemicals could potentially rid the human body of all gas / flatulence problems?",
        "author": "cartoonartist",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91stkv/which_chemicals_could_potentially_rid_the_human/",
        "text": "Let's say that hypothetically the human body could emit any substance to its digestive system. In that case, which chemicals/enzymes would help the body get rid of all gas problems (no more belching, flatulence)\n\nNote: If this is impossible (even hypothetically), and/or the question is stupid, then apologies in advance, but in that case I'd appreciate an explanation why it's impossible.)\n",
        "created_utc": 1532532529,
        "upvote_ratio": ""
    },
    {
        "title": "Would the Moon survive in the event of the Earth blowing up, or would it be destroyed by it's matter?",
        "author": "Shaggy0291",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91sqkw/would_the_moon_survive_in_the_event_of_the_earth/",
        "text": "Would the moon be more or less intact in the event of the Earth exploding into pieces or would the force necessary to expel the Earth's matter more or less assure it would also be destroyed?\n\nHypothetically speaking, if you were stood on the dark side of the moon and the Earth exploded, would the moon shield you from the resulting debris of asteroids and other matter?",
        "created_utc": 1532531935,
        "upvote_ratio": ""
    },
    {
        "title": "Could a space station exist, in a stable orbit, in the rings of a planet?",
        "author": "Supermagicalcookie",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91sdxl/could_a_space_station_exist_in_a_stable_orbit_in/",
        "text": "The reason I ask is because I was playing elite dangerous and found a station just above a gas giants rings. Now I’m ED rings are comprised of asteroids (and cops). [Here’s](https://imgur.com/a/qieZRwr) a pic I took of it.",
        "created_utc": 1532529463,
        "upvote_ratio": ""
    },
    {
        "title": "What does science say about contents of dreams?",
        "author": "eggfood",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91s1up/what_does_science_say_about_contents_of_dreams/",
        "text": "Is what we dream collection of random bits stored in our brain or is there more to it, such as epiphanies, premonition, etc?",
        "created_utc": 1532527067,
        "upvote_ratio": ""
    },
    {
        "title": "Generally, when working towards solutions for problems in their respective fields - how do you stop yourselves from making flawed assumptions which roadblock your progress?",
        "author": "idk12397",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91rihw/generally_when_working_towards_solutions_for/",
        "text": "I've recently begun studying for my GMAT exam and have focused on the quant side of the material. I've noticed recoccurringly that when looking at problems my intuition tends to make me draw assumptions which make sense in the context I've phrased the problem in myself.  Based on the detail of the problem I'd reinforce assumptions in my head that they must be true and then proceed to try and work from there.  However these assumptions are often incorrect and prevent me of course from objectivily approaching the problem. \n\nPersonally I hate this inate habit and pattern I'm exhibiting and want to hear some STEM individuals perspectives on this. I would like to and learn on how to not make these mistakes and change the way I think and approach general problem solving. ",
        "created_utc": 1532522798,
        "upvote_ratio": ""
    },
    {
        "title": "Scientists discovered a new species of shark.",
        "author": "scien-technews",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91rggc/scientists_discovered_a_new_species_of_shark/",
        "text": "[removed]",
        "created_utc": 1532522321,
        "upvote_ratio": ""
    },
    {
        "title": "Can Iceland's blue lagoon be recreated somewhere else?",
        "author": "Foxodroid",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91r5mv/can_icelands_blue_lagoon_be_recreated_somewhere/",
        "text": "Recently read that it was formed from the wastewater of a nearby  geothermal energy plant, the silica and algea in it being responsable  for the color. Can the phenomenon be realistically recreated somewhere  else? As a tourist attraction basically",
        "created_utc": 1532519642,
        "upvote_ratio": ""
    },
    {
        "title": "Why no vaccines against HHV 6 and other viruses and why no bacteriophages as antibiotics alternative ?",
        "author": "uffno",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91qy9g/why_no_vaccines_against_hhv_6_and_other_viruses/",
        "text": "There are vaccines against polio, hepatitis a/b, rabies, mumps, measles, tuberculosis, hpv, influenza and so on\n\nBut why not against HIV, EBV, HHV 6 and other HPV variants? Especially all these hpv/ hhv 6 variants and EBV. There are a plaque, cancerous and it seems that they have something to do with other diseases like multiple sclerosis. I know that the HIV mutate constantly but influenza too and every or every second year there is a new vaccine against new influenza type. Why not HIV and especially HHV 6, EBV and others ?\n\nAnd why there is still no big distribution of bacteriophages ? Especially in times where more and more antibiotics don't help anymore.\n\nI tried to ask this at first in askscience but I don't understand this flagship or whatever it is. These overregulations in some reddits sucks - like my english. You wrote, wrote and wrote and then it is something wrong for the automod/ mod and post is not visible for everybody.",
        "created_utc": 1532517618,
        "upvote_ratio": ""
    },
    {
        "title": "How realistic is jury-rigging space-shuttles to become WMDs?",
        "author": "Katylar",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91qt21/how_realistic_is_juryrigging_spaceshuttles_to/",
        "text": "Hi! I'm currently writing about a sci-fi setting where a fringe group decide to cobble-together some old shuttles/supply-craft to travel fast enough that they can cause significant amounts of destruction if they were to hit a city on a planet.\n\nMy setting is more on the hard-ish scale of scifi, set in a human-only solar-system with no interstellar travel or whatever. However, I am willing to accept that we might have super-strong metal hulls or more advanced explosives/nukes in the future.\n\nHow fast would a ship need to travel before it becomes a genuine WMD if it were to hit a city? Not necessarily hiroshima, just large enough to be comparably to a nuke? Imagine roughly the same size (and I guess, mass) as our space-shuttles today. Is this type of speed possible with our current and theoretical (but non-fantastical) propulsion systems?\n\nI'm thinking that these kamikaze ships would not need life-support and the like, since the pilots would be suicide-bombers and could wear a vac-suit for the duration of their trip. Once the acceleration kicks in the pilots are dead, so they're only there to position the ships then aim. If the propulsion ends up something like Project Orion (i.e. blowing up nukes behind the ship) then the pilots get fatal radiation exposure.\n\nThoughts?\n\nEDIT: For the sake of clarification, here's more information on what I'm trying to do:\n\nThe solar system is basically split between two colonial empires: Mars and Earth. Both have numerous colonies on other moons and asteroids. Tech-level is very advanced in comparison to ours, but no true revolutionary technology like FTL or whatever. Material science has marched on, however--especially with the introduction of exotic elements found on the moons and asteroids.\n\nA decade ago, an all-out shooting war has erupted the two. So far, all the fighting has been confined to space engagements between fleets of ships (shooting railguns, shaped nuclear charges, lasers, and torpedoes at each other).\n\nSick and tired of being made to fight for their colonial masters, a backwater colony on a Jovian moon decide to take matters into their own hands by basically pointing a gun at both colonial empires' heads and telling them to sign and armistice or else.\n\nSo I've been trying to come up with that 'gun', and trying to justify why it's so effective and how could a backwater colony (albeit one that might have updated defensive munitions installed there by Mars to repel a possible attack by Earth) do it.\n\nI've also been interested in exploring how in sci-fi total war scenarios, why haven't people just rammed their super-fast spacecraft at each others planets? In softer sci-fi settings especially, as those have fractional-c or even FTL spacecraft. \n\nSo I was trying to hit two birds with one stone by coming up with a scenario wherein both superpowers were still fighting using 'conventional warfare doctrines' and didn't even think (or couldn't get into the mindset) of doing this type of attack. And then some well-intentioned but extreme hicks decide to do it and everyone is caught off-guard by the hitherto unthinkable tactic. The aftermath of the gambit would be a truce and a treaty forbidding such weaponization of spacecraft.\n\nSo far, based on the comments:\n\n* These 'shuttles' aren't really hi-jacked antiques. More akin to repurposed long-haul trucks. I'm envisioning that these are the shuttles used to ferry goods/people down to the moon's surface from any freighters stationed in orbit.\n\n* The moon itself doesn't have much gravity or an atmosphere, so that helps. I do admit that Jupiter's gravity is an issue, though.\n\n* If I go the 'cargo full of tungsten' route, this is doable. I can just state that the backwater colony is a tungsten mine. Or they mine/refine some other metal that's comparable to tungsten in the properties that matter.\n\n* The threat of mass destruction is required. If at most the kamikaze ships can only destroy a building or two (or a bunker), it doesn't really carry enough shock-and-awe to accomplish the desired effect.\n\n* Planetary defenses are the reason why I thought of smaller shuttles. They're so small and not really intended for interplanetary travel (at most, orbit-to-surface). So Earth and Mars can't really detect them or intercept them in time (I'm picturing hundreds of these speeding towards their targets all at once).\n\n* I've decided that they be piloted for 2 reasons: 1.) dramatic effect. 2.) because the entire gambit relies on catching the superpowers off-guard, communications (such as remote-control) would be bad as they can propagate and/or be detected.\n\n---------------\n\nWith all that being said, I might go with the idea that the backwater hicks repurpose their equipment and docked shuttles to act like tug-boats for the various meteors/asteroids in the belt, and keep pushing them until they're fast enough (as to how fast that would be, I'm not sure yet).\n\nIf hundreds/thousands of rocks suddenly hurtle towards Earth or Mars at a fast enough speed (constantly accelerating) can conceivably catch planetary defenses off guard by the sheer numbers. And even if they're destroyed, if they're near enough they could still pelt the planet's surface and/or destroy space-stations/satellites.\n\nWhat do you think? Would this stretch the suspension of your disbelief too much?\n",
        "created_utc": 1532516174,
        "upvote_ratio": ""
    },
    {
        "title": "What would a Venus-resistant rover look like?",
        "author": "CalibanDrive",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91qait/what_would_a_venusresistant_rover_look_like/",
        "text": "What sorts of technologies (current or proximal) would be needed to make a robotic rover that could resist the extreme environmental conditions on the surface of Venus?",
        "created_utc": 1532510369,
        "upvote_ratio": ""
    },
    {
        "title": "Could electricty speed plant growth? An idea I had on hydroponics, looking for critique.",
        "author": "mcafc",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91ptrl/could_electricty_speed_plant_growth_an_idea_i_had/",
        "text": "[removed]",
        "created_utc": 1532504880,
        "upvote_ratio": ""
    },
    {
        "title": "Big bang theory doesnt make sense to me.",
        "author": "_morten_",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91mzyq/big_bang_theory_doesnt_make_sense_to_me/",
        "text": "Okay, so i dont have a master degree in astronomy or anything, so obviously, there are people out there who knows more about this than me, but i do understand a fair bit about astronomy, but i cant wrap my head around the big bang.\n\n\nSo, the theory says that before the expansion, all the mass/matter was packed into a very dense area, then everything started expanding, somehow.\n\nBut the problem is, gravity exist, so a) all of the matter should have collapsed into a black hole, or b) gravity would have been strong enough to keep the matter from expanding/driftng away.\n\n\nI mean, even now, even with the expanding universe, some galaxies are still bound together by gravty, look no further than the local group, which we are apart of. If all the matter really was so tightly packed at the start, it should have been hold together by mutual gravity forever.",
        "created_utc": 1532478497,
        "upvote_ratio": ""
    },
    {
        "title": "Would healthy people on a deserted island ever get sick?",
        "author": "Del_Tree",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/91mzpb/would_healthy_people_on_a_deserted_island_ever/",
        "text": "Let's say a group of 20 or so healthy people moved to a deserted island. Somehow, this island had plenty of clean food, water &amp; shelter.\n\nWould any of them ever contract communicable diseases such as influenza?",
        "created_utc": 1532478442,
        "upvote_ratio": ""
    }
]