[
    {
        "title": "Was the Rust Belt Swinging Red unexpected or part of a general trend?",
        "author": "mrregmonkey",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5djyln/was_the_rust_belt_swinging_red_unexpected_or_part/",
        "text": "I have been doing some reading on the Rust Belt swinging red (PA, Michigan, and Wisconsin in particular).\n\nI am curious if them swinging red this election is part of a trend or not? I found a newspaper article showing that many Republican primary candidates went to Michigan (notably Jeb!) hoping this year would be \"the\" year it swung red.\n\nWell it was, but not for Jeb. Was this at all predictable? My prior is that the Rust Belt has been heading this way, but it wasn't expected to happen just yet.",
        "created_utc": 1479435266,
        "upvote_ratio": ""
    },
    {
        "title": "Why has it taken so long for economists to accept endogenous money?",
        "author": "TubbyBud",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5djxis/why_has_it_taken_so_long_for_economists_to_accept/",
        "text": "With numerous central banks like the Bank of England accepting that this explains money supply realistically, why is exogenous money still taught? Why has it taken so long to recognise horizontalism?",
        "created_utc": 1479434868,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a reason why someone prefers one set of non-binary pronouns over another (e.g. Ze, ve, they, ey)? Or is it all just personal choice?",
        "author": "Fibonacci35813",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5djg71/is_there_a_reason_why_someone_prefers_one_set_of/",
        "text": "",
        "created_utc": 1479428939,
        "upvote_ratio": ""
    },
    {
        "title": "Has there ever been a study that examined what happens when a jury is instructed to disregard something in a trial(testimony, statement, evidence, etc)? Are people really capable of not factoring that stuff in to their judgement?",
        "author": "nepc88",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5djco9/has_there_ever_been_a_study_that_examined_what/",
        "text": "I have no idea how this would be studies, but then again I'm not a social scientist. My instinct would tell me that, as a lawyer, it would make sense to elicit a statement or something from a witness even if I knew it wasn't admissible, so as to influence a jury of every day humans. Then again, I'm not a lawyer either. Apologies in advance if I've misused any of these terms as well.",
        "created_utc": 1479427831,
        "upvote_ratio": ""
    },
    {
        "title": "How does a highly-developed country like Germany still have a substantial manufacturing economy?",
        "author": "read-it-on-reddit",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5diqdt/how_does_a_highlydeveloped_country_like_germany/",
        "text": "So it's my understanding most economists are in agreement that bringing manufacturing jobs back to the US is a futile effort. The logic is that if the US placed high tariffs on imports, manufacturing might return to the US, but it would be highly automated due to the high cost of US labor.\n\nWhat about Germany? Germany is highly-developed nation with high wages. A little less than 20% of German workers are employed in manufacturing (this is apparently declining though), while 9% of US workers are employed in manufacturing. What accounts for this difference?",
        "created_utc": 1479420915,
        "upvote_ratio": ""
    },
    {
        "title": "Help with IS-LM Matrix Question",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5dhu9e/help_with_islm_matrix_question/",
        "text": "[removed]",
        "created_utc": 1479411708,
        "upvote_ratio": ""
    },
    {
        "title": "If the United States all became independent states, how would the next year, five years, decade out?",
        "author": "RichardBreecher",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5dfsxg/if_the_united_states_all_became_independent/",
        "text": "[removed]",
        "created_utc": 1479389554,
        "upvote_ratio": ""
    },
    {
        "title": "What is the sociological term for disillusionment from rapidly changing culture and cultural values?",
        "author": "bacon2010",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ddrzx/what_is_the_sociological_term_for_disillusionment/",
        "text": "I remember hearing the term before, I think it might be a french term but I'm not certain. It's a term for the disillusionment people tend to feel from rapidly shifting societal values. It was published in an essay I read about at one point but the name escapes me. Does anyone know the term, author, or name of the essay it's from? Any help would be much appreciated!",
        "created_utc": 1479354823,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a social worker, and the company I work for has a Neurofeedback Therapy machine. I want to learn all about this and its uses.",
        "author": "MMonReddit",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5dbvah/im_a_social_worker_and_the_company_i_work_for_has/",
        "text": "I have an undergraduate degree in Sociology and Philosophy and a Master's in Sociology (and I was about a class away from a minor in Psychology), so I think I'm probably all right with understanding the principles of the scientific research behind this stuff, although it is a bit outside of what I've studied. I would like to spend some time researching this and making sure that it is something that has proven clinical efficacy prior to recommending it to my recipients. If you are familiar with the research on this, can you please let me know a few things? \n\n1. What systematic way could I go about studying this? I was thinking that I might work from disorder to disorder, or from cognitive area to cognitive area reviewing the research. So for example, anxiety is a big problem among many of my recipients. I would first learn what is happening in the brain when someone experiences anxiety and calmness (its opposite, presumably?), and I would find and read the research on neurofeedback's effect on anxiety and the empirical evidence that has been found determining its efficacy or lack of efficacy. After I've found, spent time (and presumably money) on reading up on this, I would put together a bit of a literature review section on the topic to condense my understanding and put it into words. \n\n2. Does anyone know of any free resources I can use for this? I am currently exploring this page: (http://braincoretherapy.com/neurofeedback-training-research/) and will likely have to buy many of the studies listed in this (http://braincoretherapy.com/wp-content/uploads/2014/01/Critical-Validation-Studies-of-Neurofeedback.pdf) because I don't trust the word of people who are trying to sell a product to relay the info in these studies entirely fairly, but if these studies are as costly as things like this normally are, it's already getting expensive. \n\n3. Any advice for me on how to approach this? Any specific journals that you'd advise using? \n\n\nReally, any advice is welcome. Thank you",
        "created_utc": 1479331897,
        "upvote_ratio": ""
    },
    {
        "title": "What percentage of Trump voters are facing serious economic distress?",
        "author": "OptionK",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5daip7/what_percentage_of_trump_voters_are_facing/",
        "text": "I've heard that many people voted for Trump because they are in serious economic distress due to some combination of free trade, automation, and illegal immigration. So I'm curious: what percentage of Trump voters are currently facing serious economic distress? What percentage of Trump voters are actually in very poor situations with no likelihood of improvement any time soon without some dramatic change?\n\nI've been going over exit polls and census data, but my math isn't strong enough to even come up with a rough estimate, which is all I'm really looking for. If anyone could come up with one and explain how they did so, that would be great. I really think it's important not just to recognize that this was a factor in the election, but also to understand how big of a factor it was.",
        "created_utc": 1479318020,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | November 16, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d9bsf/theory_wednesday_november_16_2016/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1479305006,
        "upvote_ratio": ""
    },
    {
        "title": "Are American school shootings the social equivalent of honour killings in North Asia?",
        "author": "delitomatoes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d8pxr/are_american_school_shootings_the_social/",
        "text": "[removed]",
        "created_utc": 1479295804,
        "upvote_ratio": ""
    },
    {
        "title": "Found this passage today about French migrants, how accurate of a prediction was this?",
        "author": "josistats",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d6ag0/found_this_passage_today_about_french_migrants/",
        "text": "http://imgur.com/fLVyMas",
        "created_utc": 1479257427,
        "upvote_ratio": ""
    },
    {
        "title": "Which principles establish how many cases of suicide/abuse go unreported for example?",
        "author": "PCP_Tornado",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d5n1p/which_principles_establish_how_many_cases_of/",
        "text": "I live in Quebec, Canada. Over here we have a serious problem with forced institutionalization of physically disabled people. When some demand too many hours of care at home, they are forced to enter long-term care facilities with old and dying people. Some in their 20s are pushed in these environments.\n\nOver the last 3 years, I found at least 4 stories in the media of people who decided to commit suicide instead of entering in such places.\n\nThose are just the stories that made it into the media, I suspect there is a greater number of people who decide to end it but their stories go unreported.\n\nIs there some kind of conservative model that can be used to extrapolate how many cases like this happen over the years?\n\nSome studies sometimes claim that, for example, 70% of domestic abuse cases go unreported. How do they work this out?\n\nThanks!\n",
        "created_utc": 1479250013,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most instrumental factors/policies in mitigating income and wealth inequality?",
        "author": "LightsOut75",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d53is/what_are_the_most_instrumental_factorspolicies_in/",
        "text": "Scandinavian countries seem to have much more equitable distributions of wealth than the US. What are the most instrumental factors/policies that cause that? Are there any studies that look at this? If you were creating a model that tried to predict wealth distribution, what variables might be important to include?",
        "created_utc": 1479244319,
        "upvote_ratio": ""
    },
    {
        "title": "Differences between Left Parties?",
        "author": "AriaLittlhous",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d2tki/differences_between_left_parties/",
        "text": "I feel like there's some bit of leftist ideology that I'm missing--I know there are left parties that eschew all electoral politics, but what about the others? Maine has passed ranked choice voting; the masses are pissed about the Electoral College; the historical moment is here--if we work together, there could be viable left candidates on the ballot next year. Butt, from what I can see, all the parties are just cutting and pasting the usual stuff. Someone enlighten me. (I'm a member of the DSA (for now) and fairly well versed in Marxism, but not, obviously, in the reasons behind the positions of various parties.) Thanks.",
        "created_utc": 1479220808,
        "upvote_ratio": ""
    },
    {
        "title": "What are the examples of cities with predominantly black populations that have low crime rates?",
        "author": "BawseDawg",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d254c/what_are_the_examples_of_cities_with/",
        "text": "[removed]",
        "created_utc": 1479211344,
        "upvote_ratio": ""
    },
    {
        "title": "How are borders actually defined?",
        "author": "JebediahKerman42",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d06jw/how_are_borders_actually_defined/",
        "text": "[removed]",
        "created_utc": 1479177994,
        "upvote_ratio": ""
    },
    {
        "title": "Have incidents of racism, sexism, and homophobia increased this past week or is it the reporting of such incidents that has increased?",
        "author": "Hiciao",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5d02ic/have_incidents_of_racism_sexism_and_homophobia/",
        "text": "[removed]",
        "created_utc": 1479176598,
        "upvote_ratio": ""
    },
    {
        "title": "In what ways has history affirmed/rebuked the theory that negotiation and trade make war less likely?",
        "author": "Drobnick",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5czg2a/in_what_ways_has_history_affirmedrebuked_the/",
        "text": "I've frequently heard about \"peace through trade\" and understand it in the abstract. I would love to discuss some grounding examples of the extent to which this claim is valid. Thanks, All!",
        "created_utc": 1479169037,
        "upvote_ratio": ""
    },
    {
        "title": "We are aware of many global issues, yet we as a society rarely work towards improvement, why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cz79m/we_are_aware_of_many_global_issues_yet_we_as_a/",
        "text": "[removed]",
        "created_utc": 1479166244,
        "upvote_ratio": ""
    },
    {
        "title": "How does economics model things that people will pay to avoid, that are essentially the opposite of goods?",
        "author": "skurvecchio",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cy7yn/how_does_economics_model_things_that_people_will/",
        "text": "",
        "created_utc": 1479155692,
        "upvote_ratio": ""
    },
    {
        "title": "Currently investigating this topic: Social platforms allow for a reinterpretation of what brings people together by rejecting the principle that communities are mostly geospatial constructs.",
        "author": "Murderous_squirrel",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cx4ez/currently_investigating_this_topic_social/",
        "text": "[removed]",
        "created_utc": 1479144339,
        "upvote_ratio": ""
    },
    {
        "title": "Why did western society become so casual?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cwtgt/why_did_western_society_become_so_casual/",
        "text": "[deleted]",
        "created_utc": 1479141073,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | November 14, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cw2sp/monday_reading_and_research_november_14_2016/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1479132178,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a term for prejudice towards people based on rural background? Something like \"urban-centrism\", and are there any good resources on the subject?",
        "author": "Kakofoni",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cvnxv/is_there_a_term_for_prejudice_towards_people/",
        "text": "Hi, lately I've been a bit preoccupied thinking about the divide between cities and countryside. As someone who grew up in a small community and started going to school in a more central region, I'm seeing how the increase in centralization in my country is really an existential threat to the local communities, but there's little room or interest to discuss these matters. There's quite a tension here, and I can't believe there isn't a term for this. I'm sure the Trump/Clinton-chaos has at least something to do with prejudice towards rural communities (and vice-versa), too. How does rural-urban tensions divide people around the world? Is there any good resources or terms for the issues I'm talking about?",
        "created_utc": 1479126090,
        "upvote_ratio": ""
    },
    {
        "title": "Articles about conserving natural resources?",
        "author": "1412bunny",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ctthz/articles_about_conserving_natural_resources/",
        "text": "[removed]",
        "created_utc": 1479093024,
        "upvote_ratio": ""
    },
    {
        "title": "Do people other than the presidential family live in the White House?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ctjtp/do_people_other_than_the_presidential_family_live/",
        "text": "[removed]",
        "created_utc": 1479089405,
        "upvote_ratio": ""
    },
    {
        "title": "Can victims of a violent crime be compensated for their medical expenses from the state?",
        "author": "kluh100",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ctjei/can_victims_of_a_violent_crime_be_compensated_for/",
        "text": "[removed]",
        "created_utc": 1479089255,
        "upvote_ratio": ""
    },
    {
        "title": "Are women really more emotional than men?",
        "author": "adbJ114",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5csr0j/are_women_really_more_emotional_than_men/",
        "text": "I feel crazy for even asking this, but I got into a reddit argument with people recently about this and googled for scientific studies and all I found was an article on women reacting differently to pictures of gore. Not more powerfully, just differently.\n\nI also know that men are encouraged to hide their emotions, so this plays a role too. I guess what I am asking is, is there scientific evidence to support the argument either way?",
        "created_utc": 1479079119,
        "upvote_ratio": ""
    },
    {
        "title": "How would a rational choice theorist explain Trump's election?",
        "author": "spideoga",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cr0p7/how_would_a_rational_choice_theorist_explain/",
        "text": "",
        "created_utc": 1479058962,
        "upvote_ratio": ""
    },
    {
        "title": "In Chinese society, the inhabitants are all in the same boat.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cqwm5/in_chinese_society_the_inhabitants_are_all_in_the/",
        "text": "[removed]",
        "created_utc": 1479057611,
        "upvote_ratio": ""
    },
    {
        "title": "Is Karl Marx’ theory of class conflict relevant for understanding contemporary Chinese society?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cqs6w/is_karl_marx_theory_of_class_conflict_relevant/",
        "text": "[removed]",
        "created_utc": 1479056161,
        "upvote_ratio": ""
    },
    {
        "title": "Would ethnic / racial diversity contribute to political divide?",
        "author": "BannedFromIslam",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5coyoi/would_ethnic_racial_diversity_contribute_to/",
        "text": "**WARNING: LONG!**\n\n**TL;DR**: I don't think ethnic / racial diversity contributes to political divide per se, and it's more about the level of economic / educational integration that matters. But there are study and articles that suggest otherwise. Which is more plausible?\n\n-------\nThis is a question in light of recent election debacles. I was browsing [a question about political divide](https://www.reddit.com/r/NeutralPolitics/comments/5btzwu/what_are_the_contributing_factors_to_what_feels/) in /r/NeutralPolitics and found that there are several researches that show heightened tensions and lessened social cohesion in ethnically / racially diverse society. One of the theory suggested behind this is \"conflict theory\": \n\n&gt;but I think it is fair to say that most (though not all) empirical studies have tended instead to support the so-called ‘conflict theory’, which suggests that, for various reasons – but above all, contention over limited resources – diversity fosters out-group distrust and in-group solidarity. On this theory, the more we are brought into physical proximity with people of another race or ethnic background, the more we stick to ‘our own’ and the less we trust the ‘other’.\n\nI'm giving you some of the examples of the study that finds ethnic diversity contributing to social tension [here by Robert Putnam](http://bjp.rcpsych.org/content/201/4/282.full).\n\n&gt;• Across workgroups in the United States, as well as in Europe, internal heterogeneity (in terms of age, professional background, ethnicity, tenure and other factors) is generally associated with lower group cohesion, lower satisfaction and higher turnover (Jackson et al. 1991; Cohen &amp; Bailey 1997; Keller 2001; Webber &amp; Donahue 2001).\n\n&gt;• Across countries, greater ethnic heterogeneity seems to be associated with lower social trust (Newton &amp; Delhey 2005; Anderson &amp; Paskeviciute 2006; but see also Hooghe et al. 2006).\n\n&gt;• Among Peruvian micro-credit cooperatives, ethnic heterogeneity is associated with higher default rates; across Kenyan school districts ethnolinguistic diversity is associated with less voluntary fundraising; and in Himalayan Pakistan, clan, religious, and political diversity are linked with failure of collective infrastructure maintenance (Karlan 2002; Miguel &amp; Gugerty 2005; Khwaja 2006).\n\n&gt;• Across American census tracts, greater ethnic heterogeneity is associated with lower rates of car-pooling, a social practice that embodies trust and reciprocity (Charles &amp; Kline 2002).\n\n&gt;• Within experimental game settings such as prisoners-dilemma or ultimatum games, players who are more different from one another (regardless of whether or not they actually know one another) are more likely to defect (or ‘cheat’). Such results have been reported in many countries, from Uganda to the United States (Glaeser et al. 2000; Fershtman &amp; Gneezy 2001; Eckel &amp; Grossman 2001; Willinger et al. 2003; Bouckaert &amp; Dhaene 2004; Johansson-Stenman et al. 2005; Gil-White 2004; Habyarimana et al. 2006).\n\n&gt;• Within the Union (northern) Army in the American Civil War, the casualty rate was very high and the risks of punishment for desertion were very low, so the only powerful force inhibiting the rational response of desertion was loyalty to one’s fellow soldiers, virtually all of whom were other white males. Across companies in the Union Army, the greater the internal heterogeneity (in terms of age, hometown, occupation, etc.), the higher the desertion rate (Costa &amp; Kahn 2003a).\n\nAlso there are several articles that provide evidence for  [homogeneity correlates with strong democracy](https://www.washingtonpost.com/news/worldviews/wp/2013/05/16/a-revealing-map-of-the-worlds-most-and-least-ethnically-diverse-countries/), [genetic diversity causes societal conflict](https://www.nber.org/papers/w21079), [ethnic diversity causally decreases social cohesion](http://m.esr.oxfordjournals.org/content/early/2015/08/20/esr.jcv081.full), and [diversity increases social adversity](http://bjp.rcpsych.org/content/201/4/282.full).\n\nThen however, someone asked how do the theory explains that Canada is ethnically diverse yet they have democratic societyً. The answer given is that Canada is implementing aggressively discriminatory policy toward immigrants. [Here is the explanation](https://www.reddit.com/r/NeutralPolitics/comments/5btzwu/what_are_the_contributing_factors_to_what_feels/d9twv6b/):\n\n&gt;A strong reason for this is Canada’s aggressively discriminatory immigration policy. Many countries’ including the US, have relied upon permanent immigration for low skill labour. Canada has done the exact opposite. We emphasize trying to attract strictly top-tier talent and fill as much of our immigration quotas as we can through high-skill English speaking young professionals. This means the demographics of our immigrants are far, far different from those in the US and elsewhere.\n\n&gt;There are three main methods by which the Canadian government aggressively forces economic assimilation, to weed out images of ‘lazy immigrants’ in Canada.\n\n&gt;•Discriminate using a points system for those in professions and trades who can easily integrate into the economy with minimal effort. This ensures our permanent immigrants are generally less likely to use welfare than our natural born citizens.\n\n&gt;•Cheap labour is acquired through Temporary Foreign Worker Program (TFW) and is one of the most controversial aspects of Canada’s immigration system at the moment. And most probable catalyst for any populist trump/Brexit like rallying in Canada’s future.\n\n&gt;•Limit access of direct social transfers (except health care) to immigrants for a period of years (this is not the unusual part) AND have private sponsors take on this burden in lieu of the state. SO, if you are the spouse of an immigrant sponsored to come to Canada, you are ineligible for welfare or other social transfers for 4-10 years, while the sponsor signs an agreement with the state taking on that role for the sponsee.\n\n&gt;•Integrate refugees into the economy through temporary work permits. So even a typically contentious group of immigrants begin the integration process (economically, and because of this socially)\n\n&gt;The difference in our immigration policy means our immigrants are both predisposed to economic integration, and more effectively railroaded into it. Economic integration is an integral strategy to ensure that natural born citizens are predisposed to on the face of it be accepting of immigrants, because they do not feel that immigrants are ‘taking our jobs’ or ‘stealing our tax dollars’ instead they are contributing members of society from day one, or they are the responsibility of a contributing member of society.\n\nHowever this raises a question; isn't the policy discriminates people based on talent or prospect of economic integration, which reflects people's educational or economic background more than ethnicity or race per se? Of course it can be \"de facto\" discrimination toward certain low developed states where majority of its migrants aren't high skilled. However its still isn't the evidence of ethnicity or race per se being what contribute to political divide (in other words, those are correlated but not causal), I think this gives a room for interpretation that Canada is a success story of the diversity and able to nullify the aforementioned articles or the study, or the \"conflict theory\". It gave me an impression that economic homogeneity matters more for political cohesion than ethnic / racial homogeneity. How should I think about this? Thanks for your answer in advance!\n\n*EDIT 1 wordings, some addition",
        "created_utc": 1479022140,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most unusual temperament test results you have seen?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cnyq3/what_are_the_most_unusual_temperament_test/",
        "text": "[removed]",
        "created_utc": 1479004943,
        "upvote_ratio": ""
    },
    {
        "title": "To whom does the US Electoral College give an advantage in a presidential election? Does it restrict the influence of urban areas, and is this its intended purpose?",
        "author": "Feezec",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ckn35/to_whom_does_the_us_electoral_college_give_an/",
        "text": "https://youtu.be/G3wLQz-LgrM\n\nThe Electoral College confuses me. This video explains some critiques against it but does not answer all my questions.\n\n1) Does the US Electoral College restrict the influence of urban areas in elections?\n\n2) Is this its intended purpose? If not, what is the purpose of the Electoral College?\n\n3) What happens to the Electoral College if First Past the Post voting rules are removed at the state level? e.g. a state's electoral votes are divided according to the state's popular vote, rather than cast as a block. Does this render the Electoral College defunct and/or undermine its raison d'etre? Does it make the presidential election more similar to a national FPP popular vote?\n\n4) Do I correctly understand the linked video? I believe the video asserts that the Electoral College does NOT ensure that the President is elected by a broad consensus among the states. Rather, the Electoral College gives preference to highly populated states. On the surface this means that states with densely populated urban areas have more electoral power. In actuality that power can be involuntarily transferred to rural areas due to FPP, provided they win a slim majority and there are no Faithless Electors. Which somehow makes cities simultaneously more powerful but also less powerful?\n\n5) What point is the meme at 1:30 trying to convey and does the video directly address it?\n\n6) To whom does the Electoral College give an advantage in an election? This is my ultimate underlying confusion. Who is more powerful in the current system? Rural voters? Urban voters? Swing state voters regardless of demography? At this point I'd be satisfied to learn that the Electoral College is deliberately engineered to empower slave-owners, just so long as I finally know who is running the show.",
        "created_utc": 1478961519,
        "upvote_ratio": ""
    },
    {
        "title": "I would like to investigate the following question: Controlling for all external factors, is there a difference between black and white rates of crime in America?",
        "author": "ZeroRacer",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cjnn2/i_would_like_to_investigate_the_following/",
        "text": "As this is such a charged topic, finding neutral data and analysis may be almost impossible but I'd like to try. \n\nMany years ago I recall a citation from a user that claimed that controlling for as many factors as possible(especially urban/rural living situations) it was proven that blacks committed crimes at rates near identical. I would like to track down any information about this claim and whether it is an academically accepted position or a point of contention. Any data or analysis must be generally regarded as reputable from an academic standpoint.",
        "created_utc": 1478940927,
        "upvote_ratio": ""
    },
    {
        "title": "Why do secular governments use religious beliefs as a basis for law?",
        "author": "delitomatoes",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ciwjg/why_do_secular_governments_use_religious_beliefs/",
        "text": "",
        "created_utc": 1478925522,
        "upvote_ratio": ""
    },
    {
        "title": "JS Mill view on distribution of wealth?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5chz7o/js_mill_view_on_distribution_of_wealth/",
        "text": "[removed]",
        "created_utc": 1478911315,
        "upvote_ratio": ""
    },
    {
        "title": "Do prejudiced leaders encourage citizens to be prejudiced or vice versa?",
        "author": "wordscorrespondent",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5chp00/do_prejudiced_leaders_encourage_citizens_to_be/",
        "text": "I came across this quote warning about hate crimes under a Trump presidency: \"When candidates who demonstrate hate are elected, they give similarly-minded people the permission to act on that hate.\"\n\nI'd be interested to find data to sort out this chicken-and-egg problem. Is there any?",
        "created_utc": 1478907656,
        "upvote_ratio": ""
    },
    {
        "title": "Which principles establish how many cases of suicide/abuse go unreported for example?",
        "author": "PCP_Tornado",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5chjor/which_principles_establish_how_many_cases_of/",
        "text": "I live in Quebec, Canada. Over here we have a serious problem with forced institutionalization of physically disabled people. When some demand too many hours of care at home, they are forced to enter long-term care facilities with old and dying people. Some in their 20s are pushed in these environments.\n\nOver the last 3 years, I found at least 4 stories in the media of people who decided to commit suicide instead of entering in such places.\n\nThose are just the stories that made it into the media, I suspect there is a greater number of people who decide to end it but their stories go unreported.\n\nIs there some kind of conservative model that can be used to extrapolate how many cases like this happen over the years?\n\nThanks!\n",
        "created_utc": 1478905872,
        "upvote_ratio": ""
    },
    {
        "title": "Economists agree for the most part that free trade is best because of specialization. What if other countries don't need as much of what your country specializes in?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cgir8/economists_agree_for_the_most_part_that_free/",
        "text": "[deleted]",
        "created_utc": 1478894227,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a culture that doesn't thank others?",
        "author": "knifebaum",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cg7t4/is_there_a_culture_that_doesnt_thank_others/",
        "text": "[removed]",
        "created_utc": 1478890886,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | November 11, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5cem8y/friday_freeforall_november_11_2016/",
        "text": "[removed]",
        "created_utc": 1478872976,
        "upvote_ratio": ""
    },
    {
        "title": "I was a child during Y2K: I remember there being fear of it, but how did the educated folks approach it or see it?",
        "author": "SalsaDeliversTVs",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5ccy9q/i_was_a_child_during_y2k_i_remember_there_being/",
        "text": "[removed]",
        "created_utc": 1478843664,
        "upvote_ratio": ""
    },
    {
        "title": "What were the benefits of the NATO intervention in Kosovo?",
        "author": "Alfgamer7",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c9art/what_were_the_benefits_of_the_nato_intervention/",
        "text": "",
        "created_utc": 1478801178,
        "upvote_ratio": ""
    },
    {
        "title": "Do people respond differently to someone directly taking polling data?",
        "author": "jokul",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c8rq5/do_people_respond_differently_to_someone_directly/",
        "text": "I'm wondering two things:\n\n1. How were polls for the US 2016 election so wildly off from the actual results?\n\n2. What methodologies in polling can cause these sorts of gaps?\n\nOne hypothesis I've heard is that Trump supporters felt shamed by media, and so were reluctant to admit to another person that they supported Trump. If polling is done totally anonymously (equivalent to another ballot), do people tend to reply differently? Do people still fear judgment by some sort of force even when voting anonymously? For example, fear of God, their conscience, or some other subconscious belief?",
        "created_utc": 1478795741,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research into the validity of online survey data using clickworkers (Amazon Mechanical Turk etc.)?",
        "author": "onlineSurveyResearch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c8rn7/is_there_any_research_into_the_validity_of_online/",
        "text": "I am currently deducting a survey using the clickworking site Amazon Mechanical Turk. To answer some of the questions the participants are encouraged to use google.\n\nSome questions are not easily answered which is intended by design. Since the survey uses multiple choice questions the participants have to click an answer even if they do not find out the correct answer. I am running into the problem that most people then just choose the first answer. Now my first question is if there are any research papers that look at the problem of people just choosing the first answer in an (online) survey question if they do not know the answer.\n\nAlso are there studys correclating the amount paid per expected time to the quality of the answers on clickworking sites?\n\nThe papers I found are \"Validity of Responses to Survey Questions\" (1950) which seems to be horribly out of date and obviously does not take clickworking or online surveys into account and \"Amazon’s Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data?\" as well as \"Running experiments on Amazon Mechanical Turk\" which do not really answer my questions.\n\nAnother thing I was wondering about is how many participants a study needs to calculate legitimate standard deviation and variance.\n\nI would be very glad if any of you could help me.",
        "created_utc": 1478795717,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a word for the feeling of being personally attacked or offended when someone expresses an opinion that opposes your own without insulting you?",
        "author": "JagoKestral",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c8e4u/is_there_a_word_for_the_feeling_of_being/",
        "text": "I see it every day, someone expresses an opinion, someone (initially) opposes it respectfully, and the first person feels as though they have been insulted. It happens so often I wondered if the was a word for it. ",
        "created_utc": 1478791735,
        "upvote_ratio": ""
    },
    {
        "title": "It seems obvious to me that different cultural values will tend to lead to different results, and therefore positions in society. Is there a flaw in my reasoning?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c6sqy/it_seems_obvious_to_me_that_different_cultural/",
        "text": "[removed]",
        "created_utc": 1478765838,
        "upvote_ratio": ""
    },
    {
        "title": "What can we learn from the recent failure of polling?",
        "author": "mako123456",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c60kk/what_can_we_learn_from_the_recent_failure_of/",
        "text": "[removed]",
        "created_utc": 1478752837,
        "upvote_ratio": ""
    },
    {
        "title": "What should i read to get a sense of political constraints/opportunities of united government e.g. GOP in 2016 or dems in 2008?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c5snu/what_should_i_read_to_get_a_sense_of_political/",
        "text": "[deleted]",
        "created_utc": 1478749813,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to bridge the gap of the polarization of American politics?",
        "author": "haloshade",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c47yq/is_it_possible_to_bridge_the_gap_of_the/",
        "text": "I understand tribalism is an essential quirk of human behavior, but according to this [Pew Research article](http://www.people-press.org/2016/06/22/partisanship-and-political-animosity-in-2016/), more americans are afraid of the \"other\" winning. I feel like the near 50/50 split of the election is further proof of this. Hell, I was even a part of this, I voted Hillary because I feared what Trump could do. I'm pretty sure plenty of Republicans did the same as I did because they were afraid of Hillary.\n\nWe're always going to have tribalism, but are there ways to mitigate the fears of the \"other\" through things as simple as education to more extreme measures like gutting the two-party system for more a multiparty one? (how we can do this I have no idea, but let's pretend we can do it).",
        "created_utc": 1478730776,
        "upvote_ratio": ""
    },
    {
        "title": "What is \"meme magic\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c3vzp/what_is_meme_magic/",
        "text": "[removed]",
        "created_utc": 1478727288,
        "upvote_ratio": ""
    },
    {
        "title": "Will moving to swing states (USA) post-election cause gentrification?",
        "author": "diporasidi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c2pd2/will_moving_to_swing_states_usa_postelection/",
        "text": "http://www.slate.com/blogs/the_slatest/2016/11/09/don_t_move_to_canada_liberals_move_to_a_swing_state.html\n\nI'm not an American so I'm not familiar with the situation there. But the first I thought when I read that article is precisely that. Isn't moving to poorer areas create gentrification?",
        "created_utc": 1478715415,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | November 09, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c18qn/theory_wednesday_november_09_2016/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1478700218,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any signs in the current US political climate that may indicate that the big parties will split?",
        "author": "fourmyle",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c15gp/are_there_any_signs_in_the_current_us_political/",
        "text": "I am a layperson when it comes to US political analysis, but my impression is that the GOP, and the people who would vote for their candidates, in recent years have become more and more divided between what I could call a \"moderate\"/\"establishment\" and a \"populist\" faction. Of course, this year's presidential campaign and before that, the primaries, have strengthened this view for me. To some extent, I can see the same thing for the Democrats but maybe not as much.\n\nI understand that large parties such as these must have some internal disagreement and that factions over time will arise in one way or the other, but am I correct in thinking that the polarization - particularly within the GOP - is stronger today than it has been for a long time? By \"strong polarization\" I mean in this context the case where a party is split into two or more factions where one faction's adherents very \"cleanly\" identifies with the view of one faction, i.e. there are not many instances where a given adherent agrees with the views of one faction on some issues and the views of another faction on some other issues.\n\nSupposing that I am right in thinking that the polarization within the GOP (and to a lesser extent the Democrats) is strong today, is there a reasonable chance that either party may fraction into two or more smaller parties? What are the historical indicators that a party is about to fraction? Apart from the polarization itself, are there other indicators that may tip the balance in favor of or against fractioning?",
        "created_utc": 1478699103,
        "upvote_ratio": ""
    },
    {
        "title": "Stewie Griffin and Freudian Theory",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5c0zqw/stewie_griffin_and_freudian_theory/",
        "text": "[removed]",
        "created_utc": 1478697068,
        "upvote_ratio": ""
    },
    {
        "title": "[Politics] Why USA depicts Left as Blue and Right as Red when almost all the rest of the world has the colors the other way around?",
        "author": "guustavooo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bwsw6/politics_why_usa_depicts_left_as_blue_and_right/",
        "text": "",
        "created_utc": 1478647853,
        "upvote_ratio": ""
    },
    {
        "title": "Does what is considered \"Social Science\" differ much across languages and countries? is there any universal canon? are there theorists greatly respected in the one national academy but not even known to the other?",
        "author": "republic_of_salo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bwpth/does_what_is_considered_social_science_differ/",
        "text": "",
        "created_utc": 1478646916,
        "upvote_ratio": ""
    },
    {
        "title": "more than two Genders in ancient Societies/Civs?",
        "author": "ariariariarizona",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bwc8u/more_than_two_genders_in_ancient_societiescivs/",
        "text": "Hi! I originally posted this in /r/AskHistorians and they pointed me here as more people may have answers or sources for me to look at. I appreciate any and all help. Thank you\n\n\nI'm writing a research paper on the History of Gender and Gender identity. I have found some great sources for \"Two-Spirits\" in Native American culture but aside from that I'm having trouble locating primary sources from any other society or civilization in which there were more than two genders. Can anyone help point me in a good direction for research?",
        "created_utc": 1478643064,
        "upvote_ratio": ""
    },
    {
        "title": "Strange contradiction...",
        "author": "jvolly104",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bvuha/strange_contradiction/",
        "text": "It struck me as strange that a lot of talk and suspicion we have about each other has to deal with having your own agenda, considering their own interests(which i assume is short hand for considering their own interests at the expense of others), when it's completely in line with the culture that America preaches about competitiveness and individuals rising above everyone else. How we're the greatest country, have the greatest military etc.. Not to mention whenever anyone suggests working together people respond with a sickly grimace because it's so cliche to have that thought and so naive.\nHow is that we're completely shocked that people don't care about the community as a whole when we celebrate the exact opposite? Is there a nuance i'm missing here?",
        "created_utc": 1478638157,
        "upvote_ratio": ""
    },
    {
        "title": "How to incentivise a community?",
        "author": "Alt532169",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bvljr/how_to_incentivise_a_community/",
        "text": "[removed]",
        "created_utc": 1478635737,
        "upvote_ratio": ""
    },
    {
        "title": "Help explain VoteCastr?",
        "author": "NomNomNomChompsky",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bv2wy/help_explain_votecastr/",
        "text": "I hope I am following sub guidelines here- but basically I am trying to explain the very newly popularized VoteCastr to a friend, but social science research methods has been quite a few years ago now for me. This election update service uses a high number of very (demographically) homogenous election precincts as a substitute for individual level data so they can real-time forecast turnout rates for key demographics. For the life of me, (and almost an hour googling) I cannot remember the name of this statistical methodology. Please help! Thanks.",
        "created_utc": 1478630780,
        "upvote_ratio": ""
    },
    {
        "title": "Search for Sources from non-sociologist",
        "author": "ModernContradiction",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5buux1/search_for_sources_from_nonsociologist/",
        "text": "Hello everybody, \n\nMy studies are generally literary in nature, but in something I'm writing I have found a need for a specific approach from what I believe to be a sociological direction. \n\nThat is, I'm searching for people who have theorized a sort of 'third space' that is created when two individuals communicate; an abstract space which is similar to that formulated by the likes of Bhabha in postcolonial studies and Soja in political geography or whatever you'd call him, but more specifically on the micro scale of one to one or group human interaction. Like, that essential thing we do everytime we interact with others; indeed, that thing which is fundamental to being human (one might argue). If you can direct me to anything key in this area, whatever seems most relevant, I'd be glad to check it out. Thanks in advance. ",
        "created_utc": 1478628681,
        "upvote_ratio": ""
    },
    {
        "title": "How is Hong Kong number 1 in Economic Freedom but also number 1 in the Crony Capitalism Index?",
        "author": "carlosortegap",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5busmn/how_is_hong_kong_number_1_in_economic_freedom_but/",
        "text": "According to [Heritage](http://www.heritage.org/index/) Hong Kong has the freest economy in the world but according to the Economist it is the highest in the \"crony capitalism\" economy in the world. How can this be wouldn't cronyism cancel out economic freedom?",
        "created_utc": 1478628141,
        "upvote_ratio": ""
    },
    {
        "title": "Does crime pay, based on the evidence, for regular folk? For instance: Do criminals tend to pay in bribes and such what they don’t in taxes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bsyta/does_crime_pay_based_on_the_evidence_for_regular/",
        "text": "",
        "created_utc": 1478608916,
        "upvote_ratio": ""
    },
    {
        "title": "When do philosophers and students of philosophy change their behavior upon reading moral arguments?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5brqjt/when_do_philosophers_and_students_of_philosophy/",
        "text": "[deleted]",
        "created_utc": 1478586900,
        "upvote_ratio": ""
    },
    {
        "title": "How do men and women interact in the workplace and how is feminism impacting this relationship?",
        "author": "NeedSerotonin",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5brbss/how_do_men_and_women_interact_in_the_workplace/",
        "text": "[removed]",
        "created_utc": 1478580889,
        "upvote_ratio": ""
    },
    {
        "title": "Is the study of economics past the intermediate undergraduate level worth the time for a layperson?",
        "author": "AnnaFromCT",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5br1im/is_the_study_of_economics_past_the_intermediate/",
        "text": "I have been reading through the first 2 years of textbooks in the Econ recommended list. In preparation to decide whether to pursue the next round (advanced undergraduate) I see what amounts to the same topics, but more in depth.\n\nDoes anyone with experience in the field believe it to be worthwhile for someone who is not working in the field (and just trying to get a better understanding of economics) to pursue further?\n\nThanks in advance.",
        "created_utc": 1478577059,
        "upvote_ratio": ""
    },
    {
        "title": "Are Charrúas truly extinct? If so why are there so many people who identify as being Charrúa these days?",
        "author": "PM_4_free_mamography",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bq4yh/are_charrúas_truly_extinct_if_so_why_are_there_so/",
        "text": "",
        "created_utc": 1478566280,
        "upvote_ratio": ""
    },
    {
        "title": "Should I Retake the GRE?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bovpr/should_i_retake_the_gre/",
        "text": "[removed]",
        "created_utc": 1478553132,
        "upvote_ratio": ""
    },
    {
        "title": "Questions on VSL and PPP (Economics)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bokt4/questions_on_vsl_and_ppp_economics/",
        "text": "[deleted]",
        "created_utc": 1478550286,
        "upvote_ratio": ""
    },
    {
        "title": "Is the book \"Clinical Versus Statistical Prediction\" Still relevant.",
        "author": "chheden",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bn887/is_the_book_clinical_versus_statistical/",
        "text": "Not sure if this is the correct subreddit but I thought I'd give it shot.\n\nI have been reading \"Thinking, Fast and Slow\" By Daniel Kahneman and in that book he talks about the book \"Clinical Versus Statistical Prediction\". The book was first published in 1954 and a lot has happened since then. So there for I want to ask if the book is still relevant (or is it outdated)?\n\nAre there any other books you would recommend about the same topic?",
        "created_utc": 1478537457,
        "upvote_ratio": ""
    },
    {
        "title": "What caused the large increase in violent crime per capita from 1960s to the late 90s?",
        "author": "meoxu8",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bmwr1/what_caused_the_large_increase_in_violent_crime/",
        "text": "http://imgur.com/a/TiEC1\n\nPic related, I have heard theories relating to lead exposure to the dissolution of the traditional family and morals. However, as crime is negatively correlated with increase in income, surely this trend should have reversed over the period 1960-2000. Yet we see the complete opposite. Why?\n\n\n\n",
        "created_utc": 1478534316,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | November 07, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bmaf6/monday_reading_and_research_november_07_2016/",
        "text": "MONDAY RESEARCH AND READING: Monday Reading and Research will focus on exactly that: the history you have been reading this week and the research you've been working on. It's also the prime thread for requesting books or articles on a particular subject. As with all our weekly features (Theory Wednesdays and Friday Free-For-Alls are the others), this thread will be lightly moderated.\n\nSo, encountered an recently that changed article recently that changed how you thought about nationalism? Or pricing? Or anxiety? Cross-cultural communication? Did you have to read a horrendous piece of mumbo-jumbo that snuck through peer-review and want to tell us about how bad it was? Need help finding the literature on topic Y and don't even know how where to start? Is there some new trend in the literature that you're noticing and want to talk about? Then this is the thread for you!\n",
        "created_utc": 1478527379,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been a study of the rhetoric of racism across cultures? Or can we otherwise prove or disprove the existence of universal patterns to the language of racism?",
        "author": "earanhart",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bm9e3/has_there_been_a_study_of_the_rhetoric_of_racism/",
        "text": "By this I mean does every culture talk about their racism targets the same way. \"Lazy xxx,\" \"thieving yyy,\" \"child-stealing zzz\" and similar phrases, as well as depictions of the racism targets as uneducatable, immoral, and other specific messages. Do all racisms across the globe discuss their targets as needing the handouts from the respected society? Do they all consider the young irreparably \"stained\" by their parentage, or do some cultures reserve some of the negative commentary until a certain age has been reached?\n\nI'm not so much interested in \"does everyone talk about xxx people with the same slurs\" as \"does every culture have the same messages in their slurs?\" For example, I'm not asking if everyone depicts Jewish people with big noses, so much as does everyone have someone they consider identifyable by big noses?",
        "created_utc": 1478527031,
        "upvote_ratio": ""
    },
    {
        "title": "Why are persons with higher levels of educational attainment more likely to be employed in Australia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5blorm/why_are_persons_with_higher_levels_of_educational/",
        "text": "[deleted]",
        "created_utc": 1478518692,
        "upvote_ratio": ""
    },
    {
        "title": "General (text)book on politics.",
        "author": "dreckschweinhund",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5blm1s/general_textbook_on_politics/",
        "text": "I want to read an unbiased, general, introductory book about politics. Not necessarily nation dependent or actua. The broad idea's. Is there such a book?",
        "created_utc": 1478517312,
        "upvote_ratio": ""
    },
    {
        "title": "Research on whether the effects of long-term internet addiction during development are permanent?",
        "author": "delayed654",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bkuz4/research_on_whether_the_effects_of_longterm/",
        "text": "Is there any research looking into whether the effects of internet addiction are permanent?\n\nTake for example an individual in his or her mid 20s. They have been addicted to the internet their whole life and avoided almost all social experiences. Never left their room. They were completely normal developmentally before the internet addiction.\n\nThere was recently an article out that said that exposure to new stimuli keeps the brain active and helps with risk-assessment and delaying gratification. It helps with dealing with stress. Do individuals who are addicted to the internet during their development permanently destroy their potential when it comes to these parts of cognition?\n\nThere are sensitive periods for a lot of things, does a severe internet addiction during development mean that an individual can never fully catch up?",
        "created_utc": 1478502436,
        "upvote_ratio": ""
    },
    {
        "title": "Research on whether effects of long-term internet addiction during development is permanent?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bkt6k/research_on_whether_effects_of_longterm_internet/",
        "text": "[removed]",
        "created_utc": 1478501589,
        "upvote_ratio": ""
    },
    {
        "title": "How could you use conflict theory to analyze high school student councils?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bk8j7/how_could_you_use_conflict_theory_to_analyze_high/",
        "text": "[deleted]",
        "created_utc": 1478492510,
        "upvote_ratio": ""
    },
    {
        "title": "Does the labor participation rate include retirees?",
        "author": "chinmakes5",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bhgee/does_the_labor_participation_rate_include_retirees/",
        "text": "I have seen conflicting answers on that.  If so, how can people say that is the definitive statistic?  Boomers are retiring at an ever increasing amount.  ",
        "created_utc": 1478459884,
        "upvote_ratio": ""
    },
    {
        "title": "Is a government without sanctioned secrets possible?",
        "author": "undercover_redditor",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bgmoz/is_a_government_without_sanctioned_secrets/",
        "text": "[removed]",
        "created_utc": 1478450699,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the most informative peer reviewed articles on social science research you read?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bgeqi/what_are_some_of_the_most_informative_peer/",
        "text": "[deleted]",
        "created_utc": 1478448179,
        "upvote_ratio": ""
    },
    {
        "title": "What is Europeanization in political science? What happens when a country \"europeanizes\" or goes through a \"europeanization process\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bf9yt/what_is_europeanization_in_political_science_what/",
        "text": "[removed]",
        "created_utc": 1478430696,
        "upvote_ratio": ""
    },
    {
        "title": "How does religious belief come about?",
        "author": "luigi2yoshi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bdm73/how_does_religious_belief_come_about/",
        "text": "What leads people to believe in a God? Is it a result of personal experience, like psychological conditioning, or some profound otherworldly power?\n\nHow do we explain the differences between people (that some believe in God and others don't) and how are the two sides able to acknowledge one another's beliefs?",
        "created_utc": 1478398366,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research into what it takes to move a country away from a First Past the Post system?",
        "author": "SketchyHippopotamus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bcfi0/is_there_any_research_into_what_it_takes_to_move/",
        "text": "This election has had an enormous impact on my anxiety and what really gets me is that if we had an alternative vote system I could vote for Bernie Sanders and not spoil clinton, and republicans could vote for jeb and leave Trump in the dust. But no one even knows this solution exists. \n\nWhen other countries have done away with FPTP how did they do it? and is that research applicable in the US?",
        "created_utc": 1478383289,
        "upvote_ratio": ""
    },
    {
        "title": "How to define Sociology/What is Sociology?",
        "author": "Dawnemperor",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5bcbba/how_to_define_sociologywhat_is_sociology/",
        "text": "So I have a few interrelated questions in regards to defining sociology. I've already asked this in the r/sociology so I wanted to get some input in the larger Social Science Community \n\n1) What is Sociology? How do you personally define it?\n\n2) What exactly is the difference between \"Sociology\" and \"Social Science\"?\n\n3) What is Sociology's relationship to the other social sciences?\n\nTo clarify some of my questions, sometimes I'm not certain whether sociology encompasses all the other social sciences, whether it's just another branch of social science, whether it takes a little bit from each social science and so on. Again, some of the questions are interrelated so they can probably be answered together.",
        "created_utc": 1478381864,
        "upvote_ratio": ""
    },
    {
        "title": "IQ of John Von Neumann?",
        "author": "kuqadk3",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b9zgt/iq_of_john_von_neumann/",
        "text": "[removed]",
        "created_utc": 1478353965,
        "upvote_ratio": ""
    },
    {
        "title": "How do we prevent people from polluting?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b802v/how_do_we_prevent_people_from_polluting/",
        "text": "I am not talking about environmentalism in general. I am just curios, how do we stop people from throwing garbage on the floor in public? I just went to India and this is so rampant. How can we counter this? I'm looking for links to academic articles. Thanks",
        "created_utc": 1478315549,
        "upvote_ratio": ""
    },
    {
        "title": "In what ways are sociologists, anthropologists, and historians critical of the methodology of economics?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b6tmp/in_what_ways_are_sociologists_anthropologists_and/",
        "text": "[deleted]",
        "created_utc": 1478300158,
        "upvote_ratio": ""
    },
    {
        "title": "Participate in Harvard social science research— Can the allocation of investments reflect how much importance ordinary citizens place on the type of influence companies have around the world?",
        "author": "yodahera",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b4of2/participate_in_harvard_social_science_research/",
        "text": "[removed]",
        "created_utc": 1478278191,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if the US treasury was in the same place as the rest of the government?",
        "author": "Dooze_",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b493b/what_would_happen_if_the_us_treasury_was_in_the/",
        "text": "[removed]",
        "created_utc": 1478273881,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | November 04, 2016",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b3po6/friday_freeforall_november_04_2016/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1478268184,
        "upvote_ratio": ""
    },
    {
        "title": "Research regarding the idea of \"you get it or you don't\" in education?",
        "author": "halcyon950",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5b3106/research_regarding_the_idea_of_you_get_it_or_you/",
        "text": "I was reading about a few people describing course work as a student, or evaluating as a teacher. They said they could tell who was intelligent or would stick with a major based on a few concepts that people either \"get it or they don't.\"\n\nI was wondering if there's any research if this is an actual phenomenon. I would think it isn't, and that between any 2 people of similar intelligence, upbringing and genetics, whether or not someone \"gets it\" is a product of time.",
        "created_utc": 1478259181,
        "upvote_ratio": ""
    },
    {
        "title": "What is causing the proliferation of right-wing conspiracy theories? What are the principles of this movement?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5azqep/what_is_causing_the_proliferation_of_rightwing/",
        "text": "[deleted]",
        "created_utc": 1478210308,
        "upvote_ratio": ""
    },
    {
        "title": "In an article in Nautilus, it is argued that the media portraying presidential races as being close contributes to the actual results being close. How?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5aygfm/in_an_article_in_nautilus_it_is_argued_that_the/",
        "text": "[deleted]",
        "created_utc": 1478197746,
        "upvote_ratio": ""
    },
    {
        "title": "What is your personal opinion on the #FightFor15 (Make minimum wage $15/Hour) cause?",
        "author": "Arrentwan",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5axunh/what_is_your_personal_opinion_on_the_fightfor15/",
        "text": "[removed]",
        "created_utc": 1478191907,
        "upvote_ratio": ""
    },
    {
        "title": "Can Health Care be All or Nothing in US?",
        "author": "das_w00t",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/5awrif/can_health_care_be_all_or_nothing_in_us/",
        "text": "[removed]",
        "created_utc": 1478180536,
        "upvote_ratio": ""
    }
]