[
    {
        "title": "Assumptions rejected: ANOVA",
        "author": "aanonhun",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkx2wr/assumptions_rejected_anova/",
        "text": "What do you do if: \n\na levenes test for homogeneity is significant \n\nOr \n\nA Shapiro-Will Test for normality is significant\n-\nWould you correct / transform the data? (If so, how) \n\nOr\n\nDo a different test? (If so, which one) \n\nTest is two-way anova.",
        "created_utc": 1670941730,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to test these two hypothesis from this data?",
        "author": "GogaReborn",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkssrq/is_it_possible_to_test_these_two_hypothesis_from/",
        "text": "So in a study we collected 90 dental brackets from a manufacturer as a sample. The manufacturer claims them to be 0.022 inches.\n\nAll the 90 dental brackets slots were measured by 2 operators so we have two readings for each.\n\nOne objective is to determine if the slot sizes differ significantly from the manufacturer claimed size of 0.022. That can be done with a simple one sample-test. (Or is some other method suggested?)\n\nThe other objective is to see which operator measured the slots more accurately or better? Is that possible to be tested? (Given we don't already know the \"true reading\" each operator is measuring) Which readings should be taken for the above objective? The mean of the two?\n\nThanks in advance",
        "created_utc": 1670928581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you explain why x is multiplied by n?",
        "author": "Losthostell1",
        "url": "https://i.redd.it/tqtzmjpo8n5a1.png",
        "text": "",
        "created_utc": 1670927817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain why my professor is telling me that the answer here is false? I thought if the p-value was less than the level of sig. the null hypothesis was to be rejected.",
        "author": "fjrjfjjckdo",
        "url": "https://i.redd.it/67eciz4szn5a1.jpg",
        "text": "",
        "created_utc": 1670918904,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the points are perfectly linear then which of the following is True?",
        "author": "Reasonably_Named",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkpnkb/if_the_points_are_perfectly_linear_then_which_of/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/zkpnkb)",
        "created_utc": 1670916284,
        "upvote_ratio": 1.0
    },
    {
        "title": "what grade do i need on final to pass?",
        "author": "SeaworthinessOk102",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zknvjf/what_grade_do_i_need_on_final_to_pass/",
        "text": "hi guys my current grade is 93.6% the final is worth 20% of our grade. The test is 30 questions, (5 points worth each question)..so it’s out of 150 points…What grade do i need to pass? \n💕",
        "created_utc": 1670910469,
        "upvote_ratio": 1.0
    },
    {
        "title": "What causes statistics between different organizations studying the same thing to vary so widely? How can I know which, if any, study or survey to believe.",
        "author": "LeSasqwatch",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkjhhp/what_causes_statistics_between_different/",
        "text": "Mind you these are online articles with accompanying infographics. One states that 21% of Americans believe in X, and in another on the same subject, states that only 11% of Americans believe in X. I have now background in stats and would appreciate any incite.",
        "created_utc": 1670898023,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone help me make a map of Peru that reflects the population?",
        "author": "RexAdPortas",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkh9tr/can_someone_help_me_make_a_map_of_peru_that/",
        "text": "There is a lot of discussion on r/PERU now that we are going through some internal conflict, there is political unrest after a fail coup on the side of the corrupt president. The congress is dirty, so many parts of the country are protesting. There is a trope that people are ignorant because they think that the capitals opinions are more important than the rest of the country, but 1/3rd of the population does live in the capital. One of those maps that shrinks or grows depending on the population would be very helpful for people to get a better idea on what people's actual opinions are on the current political situation. I want to post it on the subreddit and spread it on social media just so people can make up thier own minds on what the situation is.\n\nPersonally, corrupt congress will have to share power and hold elections, a corrupt president can keep power for decades.",
        "created_utc": 1670892289,
        "upvote_ratio": 1.0
    },
    {
        "title": "1 IV (2 levels) and 3 DV (continuous). Statistical analysis?",
        "author": "Low-Butterscotch",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkgwqe/1_iv_2_levels_and_3_dv_continuous_statistical/",
        "text": "What staistical analysis is more appropriate in this case? Can i use one way MANOVA? or an ANOVA?",
        "created_utc": 1670891375,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I derive the formula for the expected value for the hypergeometric distribution",
        "author": "Jacques_Ulait",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkgnho/how_do_i_derive_the_formula_for_the_expected/",
        "text": "",
        "created_utc": 1670890705,
        "upvote_ratio": 1.0
    },
    {
        "title": "how many times does 13 go into 12 million ?",
        "author": "murple-brooks",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkg9vk/how_many_times_does_13_go_into_12_million/",
        "text": "how many times does 13 go into 12 million ?",
        "created_utc": 1670889786,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to log transform the dependent variable?",
        "author": "Silent-Thund3r",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkbm85/when_to_log_transform_the_dependent_variable/",
        "text": "Hi, I'm doing statistical analysis surrounding the relationship between unemployment rates and different health outcomes like Infant Mortality Rate. Should I log transform (base e) my unemployment rate, which would be the Y variable.\n\nThe dataset I'm working with is Panel as there's multiple years and multiple subjects (multiple countries I'm focusing on).",
        "created_utc": 1670879480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do non-stationary series errors tend to have no autocorrelation?",
        "author": "Just_Comfort_125",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zkagi0/do_nonstationary_series_errors_tend_to_have_no/",
        "text": "If a variable is non stationary (has no unit root), would it’s errors no longer be auto correlated compared to variables with unit root?",
        "created_utc": 1670877011,
        "upvote_ratio": 1.0
    },
    {
        "title": "ELI5 logistic regression odds ratio interpretation",
        "author": "AgileNetwork7",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk9rcu/eli5_logistic_regression_odds_ratio_interpretation/",
        "text": "Okay, so I run some logistic regressions in Stata on continuous independent variables and I get odds ratios for each of my predictor.\n\nLets say that wage rate one of my dependent variable. It’s odds ratio is 1.398. \n\nNow I’m trying to understand by what factor will my odds ratio on wage rate change if it increase by 10? 100? 500?\n\nThanks!",
        "created_utc": 1670875465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chi-squared test returning a p-value of 1 in Rstudio",
        "author": "Amaculatum",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk9ljs/chisquared_test_returning_a_pvalue_of_1_in_rstudio/",
        "text": "Hi, I am new to this sub so I hope I get my formatting right. I am looking at the proportion of points among different landcover types compared to the proportion of each type in the study area. One of my landcover types is far higher in both proportion of points and the proportion of the area, and I think it may be throwing off my results. So for example, 85% of points are in Shrub/scrub, and 86% of the study area is Shrub/scrub, while all other types vary between 1 and 3% for both presence and points. \n\nI am working in R studio, and I am using this code for the test, where PV is proportion of points for each type and PR is the proportion in the study area for each type:\n\nchisq.test(wcomp$PV, p = wcomp$PR) \n\n&amp;#x200B;\n\nWould the uneven distribution cause the p-value of 1? would I be able to use logged values?\n\n&amp;#x200B;\n\nThank you for any advice you can offer!",
        "created_utc": 1670875137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Credible vs. Confidence Intervals",
        "author": "rasdfghj02",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk81rn/credible_vs_confidence_intervals/",
        "text": "Can someone explain the difference between credible and confidence intervals like I'm 5? I've never taken a statistics course before.",
        "created_utc": 1670871772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analyzing a multiway frequency table (non independent observations)",
        "author": "nirvana5b",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk7x9a/analyzing_a_multiway_frequency_table_non/",
        "text": "Hi all,\n\nI have a 9x9 contingency table (emotions x faces). Both faces and emotions can be nested into 3 categories: 3 faces/emotions are positive, 3 are negative and 3 are neutral (based on previous studies).\n\nI asked participants to associate them, resulting in the contingency table.\n\nI'd like to aggregate the data into a 3x3 table (positive, negative and neutral) to analyze the differences between the expected data and the observed ones comparing each category with the other. I thought of using log-linear analysis but if I aggregate the data the observations will not be independent anymore, each participant will have contributed 3 times.\n\nAre there any alternative for this analysis?\n\nThanks in advance!",
        "created_utc": 1670871514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Way to Learn About Statistics?",
        "author": "-cassper-",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk7epv/best_way_to_learn_about_statistics/",
        "text": "TLDR: College stats didn’t teach me much, so I want to try to learn on my own. Any recommendations on where to start?\n\n\nI’m not 100% sure if this is the correct place to ask this, but I think it is within the community guidelines. Apologies if not.\n\nI have taken a college level statistics class and gotten an A in it, but felt that I walked away with almost zero understanding of the subject. The entire course was just learning how to copy the steps our instructor used and there was no real explanation of why or how anything worked or applied to reality.\n\nI am in a science major other than stats and don’t have much room in my course schedule to add in more statistics classes, but I know how important an understanding of this subject is in any career, particularly a research oriented one, which is my goal.\n\nSo, does anyone have any recommendations on how to learn statistics outside of a classroom? Any books or other resources would be welcomed.",
        "created_utc": 1670870462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the Maximum Likelihood Estimator a better estimator of the variance than the bootstrap?",
        "author": "Various_Ad_1067d",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk4v69/is_the_maximum_likelihood_estimator_a_better/",
        "text": "",
        "created_utc": 1670864997,
        "upvote_ratio": 1.0
    },
    {
        "title": "why can Pearson's r be weak but a strong Kendall's Tau",
        "author": "TackleHour6470",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk4kzh/why_can_pearsons_r_be_weak_but_a_strong_kendalls/",
        "text": "Hi, I am trying to do some stats work for my psychology degree and have to understand why it is possible that a Pearson's r can be weak with a strong Kendall's Tau? I got asked the reverse question (how you can have a weak Kendall's tau with a strong Pearson's) and I said that it is because of the sensitivity to outliers that can drag a Pearson's result into a strong coefficient when the general data set is weak, which wouldn't influence the kendall's because it is about the average movement of the relationships and not influenced by outliers. But I am really not sure in what instance and why you may get a weak pearson's with a strong Kendall's tau... is it something to do with Z scores? ... I'm confused..\n\nwould really appreciate any help!!",
        "created_utc": 1670864377,
        "upvote_ratio": 1.0
    },
    {
        "title": "SPSS Chi Square Weight Cases",
        "author": "vnsshllm",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk1ban/spss_chi_square_weight_cases/",
        "text": "Hello! I am currently running a chi square test on two sets of data with 7 and 5 categories. Why is it that everytime I turn on weight cases my sample sizes move up to 828 when my actual sample size is only 259? How do I fix this and is there a way that I can opt not to use the weight cases option? Thank you!",
        "created_utc": 1670857063,
        "upvote_ratio": 1.0
    },
    {
        "title": "What comparison/Chi Square to use",
        "author": "sayyahtodaupeh",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zk0u74/what_comparisonchi_square_to_use/",
        "text": "Hi r/AskStatistics\n\nI have a dumb question for a project I'm working on. Not asking how to compute or calculate anything, but more of which test I need. \n\n**Background:**\n\nWe have collected data between two experimental conditions (A and B) where participants ask for help. \n\nIn both conditions A and B, we have coded types of help people ask for into 4 different categories.\n\nFor any given participant, they could ask for one type of help, or all 4, in a given interaction. \n\n**WHERE I'M STUCK:**\n\nTrying to compare condition A and B on what type of help people need, and unsure which test to use. Sample sizes are approximately equal between conditions and participants were randomly assigned to each condition.  \n\nWould we run 4 chi squares for each type of help category? I.e., condition A and B \\* category 1, \\* category 2, and repeat. Etc. \n\nOr is there another chi-square (or other comparison test between our nominal conditions and categories)  we need to use that accounts for potential additive error? \n\nIn other words, I am feeling lost on how to compare whether participants between conditions A and B asked for different types of hep depending on the condition to which they were assigned.  \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1670855941,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m struggling to figure out how to solve this - I know I need to use binomial distribution, but my results do not match the solutions. Maybe I’m getting the numbers wrong? For A, I’m assuming I have to compute P(x=8) given that n is 500 and p is 0,03.",
        "author": "eleeesa",
        "url": "https://i.redd.it/tzt4q9mjqi5a1.jpg",
        "text": "",
        "created_utc": 1670855264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 23-year-old an adult or a child?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/zjycpm)",
        "created_utc": 1670849865,
        "upvote_ratio": 1.0
    },
    {
        "title": "In need of help",
        "author": "STW1999rox",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjuogz/in_need_of_help/",
        "text": "Hello,\n\nI'm currently really struggling to figure out what \n stats test to use, my study has 3 between subject  conditions ( treatment a, b and control) (the independent variable) and I am measuring the effects of treatment using 4 scales (the dependent variables) . I have took two measurements, at baseline and at the end of the treatment and wanted to see how effective treatment is (within subjects element if the research comparing to baseline scores). Overall I wanted to see which was the most effective treatment on a range of measures/ scales used \n\nInitially I thought I could do a manova to compare the treatment conditions using the scales but a manova doesn't account for the two different times used.\n\nI then figured a mixed factor analysis would be beneficial to see how the participants progressed and how the treatment differs, but as such test is a omnibus test it doesn't tell you which treatment is better , and you can only use one scale as a dependent variables.\n\n\nAny advice on what to do next would be greatly appreciated",
        "created_utc": 1670839732,
        "upvote_ratio": 1.0
    },
    {
        "title": "likert scale analysis",
        "author": "mydeerling",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjuapf/likert_scale_analysis/",
        "text": "Hello, I have a Likert Scale that has 7-point response options. \n\nThen my statements all are adapted from the VOC attitude scale (Bulatao,1981) \n\nFor ex. \n\nIm trying to find what parents value mostly in a child.\n\nSo statements are\n\nHaving a child completes a couple's marriage.\nHaving a child adds joy to the family.\n\nAnd they're regarding the socio-cultural and economic dimensions of the advantages of having children\n\n\n\nSo I am confused on how I should analyze it. I dont know if I should use Pimentel's (2010) interpretation.\n\nOr what?? \n\nIf my goal or aim is to see what parents value the most \n\nthen I want to rank these responses.",
        "created_utc": 1670838621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain why this is an impossible scenario? Since the events are independent, isn’t P(A|B) = P(A)?",
        "author": "eleeesa",
        "url": "https://i.redd.it/zds6df6q9h5a1.jpg",
        "text": "",
        "created_utc": 1670837501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Detection power",
        "author": "BrahmTheImpaler",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjlusd/detection_power/",
        "text": "I have 2 bags of M&amp;Ms. One is all green and the other is mixed with 25% red and 75% green.\n\nNow I pull M&amp;Ms out of one bag and need to determine which bag I have. How many do I need to pull to look for reds before I am some percent sure that I don't have the mixed bag?\n\n(This is actually a genetics question but is the easiest way I can describe it. Ultimately I have a fixed number of pulls from the bag determined in advance - so I would need to say something like let's pull 50 and if we don't see any reds, we are 99.999% sure (or 10 to be 90% sure etc.) that we do not have the mixed bag.)",
        "created_utc": 1670816606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does survey sampling weight matter if respondent count is low?",
        "author": "partoe5",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjllb1/does_survey_sampling_weight_matter_if_respondent/",
        "text": "When looking at survey data, if there 1 or 2 entries for a particular group, or maybe a handful, but the \"weight\" is thousands or hundreds, should you still keep the entries as representative of the group in question because of the weight or disregard it as representative of the group since there are only a couple respondents for that category?",
        "created_utc": 1670816026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it make sense to use the average/mean of a bunch of means?",
        "author": "PachuliKing",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjir2c/does_it_make_sense_to_use_the_averagemean_of_a/",
        "text": "Hi! So I wanted to know if it's a good idea to use the mean of means as an indicator of something.\n\nWe need to know an aproximation of how many people are supporting some politics, so my idea is that we can use some media polls to have an idea of the quantity we want. For example, lets say massive media 1 made a poll that projected 5 millions, massive media 2 estimated 6 millions, massive media 3 calculated 4 millions... in that case all of them would be estimations using inferencial statistics with some small error percentages, but in this case, seeing that those polls are around 5 millions, my intuition tells me that it would make titak sense to use 5 millions as my quantity (of course this is only a, I'd be actually using 12-18 poll results).\n\nI know media is tricky and politized. That's a factor I'm considerng to select which polls I could use. In fact those 12-18 massive media companies are the most impartial.\n\nThanks a lot! Shavua tov :)",
        "created_utc": 1670809909,
        "upvote_ratio": 1.0
    },
    {
        "title": "basic regression Q",
        "author": "dmacmet29",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjil0a/basic_regression_q/",
        "text": "I have a very basic question about regression and summary statistics.\n\nLet's say we are interested in testing if the percent of teachers who have a masters degree in a school district (IV) impacts the percent of students who scored above average in a math exam in a district...including controls like percent of students in poverty, district enrollment, etc.\n\nsummary stats: mean of percent teachers who have a masters is 60%\n\nregression: beta coefficient on percent teachers masters 1.09\n\nI know interpretation of the beta is...a one unit increase in percent of teachers who have a masters is associated with a 1.09 increase in students who scored above average in math exam.\n\nBut...my question is...can this be extrapolated to summary statistics. Can I say increasing the mean percent of teachers who have a masters from 60%-65% (5 unit increase) would increase the DV by (1.09X5).\n\nThanks so so much!",
        "created_utc": 1670809544,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to use a paired t-test but the distribution of pair-differences is extremely asymmetrical. Can I still use the paired t-test?",
        "author": "utilizadordoreddit",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zji4i8/i_want_to_use_a_paired_ttest_but_the_distribution/",
        "text": "**I have a sample of 90 participants, and I measured the heart rate while they saw cute photos and disgusting photos. I want to use a paired t-test to examine if the mean difference is significantly different between conditions. But the distribution of pair-differences is extremely asymmetrical. Can I still use a paired t-test due to the central limit theorem? Or should I use another test?**",
        "created_utc": 1670808585,
        "upvote_ratio": 1.0
    },
    {
        "title": "basic regression Q",
        "author": "dmacmet29",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjhzqb/basic_regression_q/",
        "text": "I have a very basic question about regression and summary statistics. \n\nLet's say we are interested in testing if the percent of teachers who have a masters degree in a school district (IV) impacts the percent of students who scored above average in a math exam in a district...including controls like percent of students in poverty, district enrollment, etc.  \n\nsummary stats: mean of percent teachers who have a masters is 60%\n\nregression: beta coefficient on percent teachers masters 1.09\n\nI know interpretation of the beta is...a one unit increase in percent of teachers who have a masters is associated with a 1.09 increase in students who scored above average in math exam. \n\nBut...my question is...can this be extrapolated to summary statistics. Can I say increasing the mean percent of teachers who have a masters from 60%-65% (5 unit increase) would increase the DV by (1.09X5). \n\nThanks so so much!",
        "created_utc": 1670808304,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about regression and negative log-likelihood",
        "author": "ilrazziatore",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjheru/question_about_regression_and_negative/",
        "text": "hi guys, i would like to ask a question about how to evaluate a fit with the method of  minimizing the negative log-likelihood\n\n&amp;#x200B;\n\nsuppose i have  2 models that gives me  :  \n\n\nmodel 1 NLL = 0.200\n\nmodel 2 NLL = -0.400\n\n&amp;#x200B;\n\nwhich one is the best one? the first one because the NLL is closer to zero or the second one because the NLL is smaller? In other words, should i consider the absolute value or the value with its sign? ",
        "created_utc": 1670807073,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to fit a curve on increasing BMI that tapers off at a maximum limit?",
        "author": "democracysocamp",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjggjb/how_to_fit_a_curve_on_increasing_bmi_that_tapers/",
        "text": "Would anyone know how to do this in SAS or be able to point me in the right direction?",
        "created_utc": 1670805120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Protocol for repeated measures and varying cronbach’s alphas",
        "author": "hello1397",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjfq7a/protocol_for_repeated_measures_and_varying/",
        "text": "I have a repeated measures study design (pre, mid, post) and was calculating Cronbach’s alphas for my survey measures. For one survey measure, the pre cronbach’s alpha is very low (0.1) while the mid and post are acceptable ie &gt;.7. For cronbach’s alpha that is poor (0.1) it’s suggesting to remove two items. Should I remove these items just for the pre-test results? Or should I do it to all three for consistency, even though mid and post were acceptable? Or should I ignore it? Very confused and would appreciate any insight!",
        "created_utc": 1670803697,
        "upvote_ratio": 1.0
    },
    {
        "title": "logistic regression question",
        "author": "Relative_Credit",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjbt5p/logistic_regression_question/",
        "text": "I'm new to logistic regression and stats in general, so apologies if this doesn't make any sense. I have a dataset of blood markers in patients who either died or survived from a disease. I am trying to use a logistic regression to predict outcome (survived/died) using some of these markers.\n\nOne question I had was the difference in how these blood markers are correlated to each other in the different groups. I performed pearson correlation tests on all my markers between the groups, did a fishers z transformation and found several correlations that are higher in the deceased group than the survived group.\n\nWhat I am wondering is - does it make sense to include an interaction term between two of the differentially correlated blood markers in my logistic regression.\n\nI know that we don't want independent variables to be correlated in a regression, but I guess my thought was that if these two markers are interacting differently between the two groups, they might be able to be used to predict them?\n\nAppreciate any help.",
        "created_utc": 1670797025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my interpretation correct? (Linear regression in Stata)",
        "author": "thedissapointedwife",
        "url": "https://i.redd.it/f5nncwm4xd5a1.jpg",
        "text": "",
        "created_utc": 1670796946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discord",
        "author": "Accomplished-Pay-693",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjb1qg/discord/",
        "text": "Hi guys,\n\nDo you know if there are any active discord servers discussing stata?\n\nThanks!",
        "created_utc": 1670795912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improving Estimation of the Mean Using Two Tests or More",
        "author": "Cintronology",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjazo9/improving_estimation_of_the_mean_using_two_tests/",
        "text": "In my book, it says that a confidence interval is basically a range where there is a chance that the interval will capture the true mean of the population.\n\nIf I were to create confidence intervals based on previous data, and then do a test with it's own confidence interval trying to find the same population mean (i.e. recreating the earlier test), would it be a valid assumption that the true mean of the population is most likely in the parts of the confidence intervals that are overlapping?",
        "created_utc": 1670795818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any popular methods for Mixture/Latent Variable Model designed for repeatedly measured binary response?",
        "author": "-soggy_peanut",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zjafln/are_there_any_popular_methods_for_mixturelatent/",
        "text": "Suppose I have data like this (using only 1 person to demonstrate): \n\n|ID|person\\_*i*|person\\_*i*|person\\_*i*|person\\_*i*|person\\_*i*|person\\_*i*|\n|:-|:-|:-|:-|:-|:-|:-|\n|T|1|2|3|4|5|6|\n|response|0|1|1|0|1|0|\n\nThen, say I have i = 1, ..., **N**. I want to cluster these **N** people according to their response variable over time. \n\nAre there any method to perform this analysis? I am not sure what keywords to even search. \n\nBut please recommend me some approach to tackle this!\n\nThanks",
        "created_utc": 1670794962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Statistical significance of difference in classification model",
        "author": "YourWelcomeOrMine",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zj343o/statistical_significance_of_difference_in/",
        "text": "Is it possible to assign a p-value to the mean performance difference in two classification models. The models use the same data and use 10-fold cross validation. Model A has a mean F1 score of 0.70 with a standard error of 0.05, and Model B has a mean F1 score of 0.75 with a standard error of 0.03.\n\nCan I derive a p-value to measure whether this is a significant improvement?",
        "created_utc": 1670783687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help with understanding the linear algebra behind multiple regression?",
        "author": "shakeitupshakeituupp",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zj1twx/can_anyone_help_with_understanding_the_linear/",
        "text": "I’d love to see any good resources related to how multiple regression is broken down into matrix equations related to least squares. \n\nI have a good grasp on the solution to least squares for one predictor variable, but don’t quite get it for multiple. \n\nAlso, I’m trying to get a feel for any ways that R squared/ adjusted R squared can be communicated in matrix form(if any?). \n\nThanks for any help/resources!",
        "created_utc": 1670781636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you tell if an NFL player is good if you don't have previous data?",
        "author": "Surimimimi",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zizxey/can_you_tell_if_an_nfl_player_is_good_if_you_dont/",
        "text": "Is there a way to know the probability of something without data?",
        "created_utc": 1670778503,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to I best interpret these results? (First time using stata)",
        "author": "thedissapointedwife",
        "url": "https://i.redd.it/aj9iowacqa5a1.jpg",
        "text": "",
        "created_utc": 1670776344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this correct?",
        "author": "Ok_Bet_8450",
        "url": "https://www.reddit.com/r/AskStatistics/comments/ziq1he/is_this_correct/",
        "text": "Q. The IQ of family members is 108, 112, 127, 118 and 113. Find the range. \n\nAnswer: maximum value - minimum value\n127 - 108\n19 range answer.",
        "created_utc": 1670761640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two-stage mixed-effects model literature and interpretation",
        "author": "sqrminus1",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zip6r0/twostage_mixedeffects_model_literature_and/",
        "text": "For a study, a scalar outcome is measured after 12 months of exposure (metric scale 0-100). Exposure is documented once a month as grams/day (resulting in 12 measurements for esch participant). I was thinking of analyzing this outcome via a two-stage mixed effects model (mixed model for exposure over time for each participant, extract intercept and slope for each participant and use them [among other time-invariant covariates] for a mixed-effects model on the scalar outcome). Unfortunately after long searches I am still unable to find literature to back up this approach as well as to aid interpretation.\nBoth intercept and slope are significant with a positive value, wherefore I would interpretate the final model as that the total exposure over 12 months is significantly associated with better scores on the scalar outcome. \nCould anyone be so kind and let me know if they have some literature describing similar problems/approaches? \nDoes my interpretation make sense, or should it be worded differently?\nThank you very much!\n\nP.s.: survival models (ie cox ph with time varying covariates is not an option in this case as all participants reach the endpoint at the exact same time)",
        "created_utc": 1670759701,
        "upvote_ratio": 0.99
    },
    {
        "title": "[Q] When is df n-1 and when is it n-number of parameters? Thank you!",
        "author": "Tiniest_ATINY",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zilool/q_when_is_df_n1_and_when_is_it_nnumber_of/",
        "text": "When is df n-1 and when is it n-number of parameters? Thank you!",
        "created_utc": 1670749887,
        "upvote_ratio": 1.0
    },
    {
        "title": "In multiple linear regression, if predictors account for some of the same variation in the outcome, how is that predictive power \"split\" between them?",
        "author": "gaywhatwhat",
        "url": "https://www.reddit.com/r/AskStatistics/comments/ziikqw/in_multiple_linear_regression_if_predictors/",
        "text": "This is something I remember thinking about when I first learned about multiple linear regression.\n\nSay you have two or more (m predictors) that all account for some of the same part of the variation in the outcome.\n\nFor instance, say variable 1 explains 50% of the variation in the outcome when modeled on its own and variable 2 explains 40%. However 20% of the variation that each predictor explains in the outcome is also explained by the other variable, such that we could in theory explain 70% of the variation in the outcome using all of the information contained in the two predictors.\n\nHow would a typical multiple linear regression \"split\" that predictive capacity between the two variables? Would you expect them to evenly split it? I.e. each \"gets\" 10% so that varible 1 is now essentially covering 40% and variable 2 is covering 30%?\n\nIs this also true for GLMs that don't have a closed form solution the way that OLS/a Gausssian-GLM does, or do the optimization algorithms for this not tend to behave similarly?",
        "created_utc": 1670741023,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about whats the best test",
        "author": "boredshell",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zifblr/a_question_about_whats_the_best_test/",
        "text": "Hello everyone! Hope I am in the right spot. I have not been able to find the right answer to this so I am hoping to seek some insight here. \n\nI am curious about what the correct test to use in my hypothesis on SPSS. \n\nIf I am exploring the relationship between states’ legislative party control and strict voter laws, and the effect it ,may or may not have voter turnout rates. I have 7 variables at the moment other than my string being the name of each state. \n\nThey are : 1) legislative control coded as Republican or democrat 2) Election Day registration by state coded as a yes or no 3) online registration by state coded as yes or no 4) in person absentee voting by state coded as yes or no 5) vote by mail by state coded as yes or no 6)voter id required by state coded as yes or no and lastly 7) the voter turnout rates by state\n\nAll are nominal except 7 being scale. \n\n\nNot sure if I operationalized correctly but I am hopeful that I did. Any help  is much appreciated !",
        "created_utc": 1670733980,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Question] Any suggestions or recommendations about what to focus on for the SAS Certification Exam",
        "author": "pmorri",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zibeas/question_any_suggestions_or_recommendations_about/",
        "text": "I have the SAS Base Programing Cert coming up, has anyone take this recently, if so do you have any suggestion as to what I should focus on studying?",
        "created_utc": 1670725383,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about linear regression",
        "author": "Gendobus99",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi9zry/a_question_about_linear_regression/",
        "text": "Hi everyone, \nI'm doing a statistical research for my course in statistcs applied to economics. We have collected our data and we have done some tests on the mean, the variance and ecc. \nNow we have to do a regression but there isn't a strong correlation between the variables that are normally distributed, i tried to do some regressions on gretl but I get beta's p-values that are very high.\nSo I tried to use a dicotomic variable as the dependent variable and surprisingly there are two variables (the type of master degree and the comittment in their master degree) that are quite correlated and I get a decent R^2 using them as indipendent variables\nNow my question is if i can use the dicotomic variable as the dependent variable (specifically this variable is the stress of the students) and two other dicotomic variable (the type of master degree and the comittment in their master degree) as indipendent variable. The professor has never explained us this kind of regression so i'm not really sure if it is correct or not.\n\nThanks to everyone",
        "created_utc": 1670722401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't all those with PhD Statistics know SQL?",
        "author": "Various_Ad_1067d",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi93t2/why_dont_all_those_with_phd_statistics_know_sql/",
        "text": "",
        "created_utc": 1670720127,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Q] Should I aggregate my data in SPSS?",
        "author": "_CrunchyCrunch",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi6u37/q_should_i_aggregate_my_data_in_spss/",
        "text": "I have 50 participants, each has an average of 7 days of recordings for baseline and also follow up. The 50 participants is divided into 4 groups so around 10-15 people each. \n\nGroups:\nPill A + S\nPill A + no S\nPlacebo + S\nPlacebo + no S\n\n1. I want to know whether Pill A would be better with S; is Group 4 (Pill A + S) than group 2 (Pill A + no S)? \n2. Also if Pill A’s effect significantly differ from the effect of placebo? \n3. I want to know whether there are differences with baseline and follow up measures of sleep (X,Y,Z) between S and control subjects; The placebo group, and “no S” groups are used as control groups, to test the effectiveness of the treatments against the effect of placebo on X,Y and Z.\n\n\nI haven’t really dealt with data like this in SPSS where I have a lot of rows for each participant, measuring sleep across a varying number of days (but an average of 7 days)in baseline and also follow up and so i thought maybe i should aggregate each participants baseline recordings and follow up recordings and then maybe ANOVA to compare to compare 4 groups but im very uncertain whether this is the best analysis to use? Can someone please suggest what i can do?",
        "created_utc": 1670714162,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find the \"optimal\" minimum dBm value - aka help me optimize my home wifi",
        "author": "jsalas1",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi6qd7/how_to_find_the_optimal_minimum_dbm_value_aka/",
        "text": "I have a two wireless access points, one in my basement and another on the 2nd floor. I would like to find the \"optimal\" minimum dBm value for each access point so that it boots my roaming clients from the slower AP to the better one.\n\nThere are 2 types of wireless clients, \"roaming\" and \"static\". \"Front\" is a static client, \"Jonathans-MBP-2\" is a roaming client.\n\nOptimum: The minimum RSSI can't ever be low enough to boot a static client. For roaming clients,  should have a balance between TX Rate and minimizing switching between access points. There should be overlap zone so that clients on the first floor aren't booted for negligible TX rate gains.\n\nI have 30 days worth of data at a 15min resolution. I have simplified this problem down to 2 clients, but there are closer to 20 at any point. \n\n&amp;#x200B;\n\n2nd Floor Access Point\n\n[ Stronger\\/newer access point](https://preview.redd.it/zg2wiaoyh55a1.png?width=1352&amp;format=png&amp;auto=webp&amp;s=fecdf13a4fbc0f44942cc241ce1f27288b2f5c0a)\n\nBasement Access Point\n\n[ older gen access point](https://preview.redd.it/vwryqo4zh55a1.png?width=1376&amp;format=png&amp;auto=webp&amp;s=99b940e73562cb6c9dc6a98c0b33cb8920c7df88)\n\nData:\n\nhttps://preview.redd.it/ljh7yspzh55a1.png?width=1436&amp;format=png&amp;auto=webp&amp;s=ec8c85a4a86a9847ed703f7ffae1473ce5101c31",
        "created_utc": 1670713904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defining probability without a distribution: is it possible?",
        "author": "hansn",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi6czv/defining_probability_without_a_distribution_is_it/",
        "text": "I recently picked up a Dover book (Challenging mathematical problems with elementary solutions) which has a section on probability. It has a lot of questions like \"find the probability an integer, chosen at random, ends in a 1 when squared.\"\n\nThe answer they clearly want is 1/5, because an integer squared ends in 1 iff it ends in 1 or 9. But my observation is the problem is ill-posed, since there's no way to choose an integer with equal probability.\n\nBut this got me thinking; is there a way to make this a well-defined problem? Is this something that has been done before?",
        "created_utc": 1670712996,
        "upvote_ratio": 1.0
    },
    {
        "title": "dumb question: penalty score probability. Can I compute the probability of scoring a penalty starting from gk save % and kicker score %?",
        "author": "MysteriousWealth2423",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi43qi/dumb_question_penalty_score_probability_can_i/",
        "text": "",
        "created_utc": 1670707663,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I communicate an observations place in a distribution of data?",
        "author": "TheTarkovskyParadigm",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi3cri/how_can_i_communicate_an_observations_place_in_a/",
        "text": "I am new to data analytics and I have a question for my first real project. This is written in python + pandas + seaborn/matplotlib\n\n**background:** Where I work, we operate machinery that sorts packages. When a package label is not read by our camera system, it is called a \"no read\" reject. We run our system about 4 hours at a time in what we call \"sorts\". Each sort will have x number of \"no read\" rejects, among other kinds of rejects. We usually think of rejects as a percentage of all package volume. I.e 3% of packages were \"no read\" rejects for this sort. \n\n**question:** Let's say we have a sort on tuesday morning where we had 6% rejects. Let's say that's a high number that we should be concerned about. How can I communicate this finding to people who know nothing about data analytics in a single number (which includes me)? How should I think of this finding? In terms of it's relation to the mean (100% more than 3% mean)? or in terms of it's place in a distribution? OR something else that I would love to learn! \n\n**my project:** I am creating a \"weekly recap\" to give a quick and easy to understand overview of our machineries performance over the last week. It's a heat map that is meant to alert you to negative trends. For the math I used a ratio of the 75th percentile of reject percentage. For example, on Wednesday there was 5.6 times the 75th percentile of \"No Read\" rejects percent. This visualization does point us to days that we should have a look at, but I have no idea what I'm doing mathematically, which is what I want help with. \n\n[Heat map visualization, it shows multiple different types of rejects for every sort for every day. ](https://preview.redd.it/57auofn8u45a1.png?width=3652&amp;format=png&amp;auto=webp&amp;s=6dd232819e1c09e12ef16d3bc278ec2b35e86ce1)\n\n[Distribution of \\\\\"No read\\\\\" rejects as a percentage of volume ](https://preview.redd.it/p0zul56xs45a1.png?width=374&amp;format=png&amp;auto=webp&amp;s=cb5922fc89970d9f460a05e8daf53f2c54838fbd)\n\n[Distribution of rejects in absolute value](https://preview.redd.it/lsy4pf2xt45a1.png?width=385&amp;format=png&amp;auto=webp&amp;s=2ecbd8031492214d6a42357bffa7a46fd9badb4d)",
        "created_utc": 1670705949,
        "upvote_ratio": 1.0
    },
    {
        "title": "interpreting goodness of fitness test",
        "author": "Mundane_Friend6490",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zi2mxx/interpreting_goodness_of_fitness_test/",
        "text": " \n\nquestion: A research ran a Chi-squared goodness-of-fit test on a data set with independent  \nobservations to test the null hypothesis that the probabilities of three categories a, b, and c  \nof a variable were equal. The output of the goodnessOfFitTest() are shown below. What can  \nbe said about the results of this test?\n\n...\n\nHypotheses:  \nnull: true probabilities are as specified  \nalternative: true probabilities differ from those specified\n\nTest results:  \nX-squared statistic: 7.182  \ndegrees of freedom: 2  \np-value: 0.028\n\n( results are from R )\n\n...  \nthe answer is: 'The goodness-of-fit test indicates that the null hypothesis can be rejected and the  \nassumptions of the test are not violated'\n\nquestion: the p value is small so we reject null hyphothesis, but for the second half of the sentence, are not the assumptions also violated when p value is small?\n\narent the assumptions for every chi test the null hypothesis?\n\nif not, what are assumptions of each chi test?\n\nthanks for help",
        "created_utc": 1670704178,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the correlation for this scatter plot?",
        "author": "GroupFrosty4776",
        "url": "https://i.redd.it/q0vkj9ng445a1.png",
        "text": "",
        "created_utc": 1670696343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which test should I do?",
        "author": "BWMartell",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhwvr4/which_test_should_i_do/",
        "text": "Hi! Having some issues with statistics (as per usual) and I would greatly appreciate some help/opinions on a few things.\n\nSo my research question in an assignment is this: \"Do books on biology have a higher page count and height compared to books on law or language\". \n\nI've measured height and page count on an equal number of books per subject (30 books in total, 10 per subject). Quite a small sample but in this assignment that's okey.\n\nNow am I correct in thinking that the subject i.e. biology, law and language is the independent as well as the categorical variable, and the height and the page count are the dependent/continuous variables?\n\nAm I right in thinking that I could test this research question by doing a One-Way ANOVA? Or should it be a two-way or ANCOVA? Can I test both for the height and the page count at the same time in the same test or do I need to run whatever test I do twice with those variables separated?\n\nCan I even choose a test before I have checked normality?\n\nThank you so much for any help, stats is one of those things that I will forever struggle with.",
        "created_utc": 1670690190,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I analyse 7 days of data to compare baseline and follow up in 4 groups?",
        "author": "_CrunchyCrunch",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhwkar/how_do_i_analyse_7_days_of_data_to_compare/",
        "text": "(I’m a beginner but have access to spss and r studio. I am willing to learn but i need help to with analysis that i need to do. if anyone can help me with what analysis to use and suggestions on how to do this please I would appreciate any help! Even links online resources would help as well thank you!!)\n\n\n\n\nI have 4 Groups:\n1. Placebo\n2. Treatment \n3.Placebo+holistic intervention\n4.Treatment+holistic intervention\n\n..with around 10-15 people each. for each subject I have an average of 7 days of data for baseline and another set for follow up.\n\nHowever there are some participants without follow up data at all. \n\nHow do I compare the baseline and follow up for 4 groups? \n\nDo I average the data across 7 days for both baseline and follow up and compare them? What statistical analysis should i use to know whether placebo or treatment had an effect?",
        "created_utc": 1670689387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Control group in cross sectional study",
        "author": "Emotional_Accident62",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhlxwl/control_group_in_cross_sectional_study/",
        "text": "Hi!\n\nIn a cross-sectional study with a control and experimental group, I will collect pre and post data in the EG but do i need to collect data twice in CG as well for statistical tests?\n\nIf yes, what would be the time interval between the collection of both the data in CG?\n\nThanks in advance!",
        "created_utc": 1670656900,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do you mean by degrees of freedom?",
        "author": "cityboyonbed",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhlhzw/what_do_you_mean_by_degrees_of_freedom/",
        "text": "",
        "created_utc": 1670655303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it random sampling if I collected the entire population data??",
        "author": "hortata",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhku78/is_it_random_sampling_if_i_collected_the_entire/",
        "text": "Have to comment whether I satisfied the classic OLS linear regression assumptions. Number 2 is random sampling. \n\nIf I did my project on say the 2021 NFL football season and collected the data of every game, is that random sampling? Cause I just went and got the entire population of what i needed, so i dont technically need to “random” sample right?",
        "created_utc": 1670652963,
        "upvote_ratio": 1.0
    },
    {
        "title": "To do or not to do a master? I have serious doubt with my career... Help :c",
        "author": "JSmith121998",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhg6u5/to_do_or_not_to_do_a_master_i_have_serious_doubt/",
        "text": "I am thinking right now if it is something that could be worthwhile. I know it is a very personal decision and of course, there are lot of factors that can affect the decision. So, I will give some context and some specific questions. \n\n&amp;#x200B;\n\n1) Not from the 'first world'. I am from Colombia, and that's an important point to be told. why? Because of the cost. A master, it is usually very expensive. But here, they are quite expensive in contrast with the average income. It is what it is, so, if I start a master, I will have to take a long-term credit to pay it. \n\n&amp;#x200B;\n\n2) Not planning to stay in Colombia. I do not know when, how. But I will go out of LATAM. It is simple, I understand that I can get a good job here BUUUT still, not good enough compared with all the effort I’m putting in this. I will never be equally well paid here, then; let’s say, a 'a first world country'. If you are from LATAM, you'll understand what I’m saying.\n\n&amp;#x200B;\n\n3) Here, I am almost done with my Statistics career. True be told, I have learned a lot of statistics concepts BUT, in general; ML, Deep learning and so on, are terms that I have 'heard' about them but are not something that I had studied. Neither my academic 'career' (Degree. It is not the same here than in US, for example) or personal studies. So, ii have two options that are quite possible. \n\nI can enroll myself in a master and, somehow; there i will learn about... ML(?) Become a better candidate to a foreign company(?) I mean, i guess there is a potential that I’m not seeing in taking a master... But I suppose that, if I’m planning to live outside my country, i guess a master is an advantage. Not clear how. I’m just guessing...\n\n&amp;#x200B;\n\nOr... I can prepare myself with online courses such as, Coursera, Platzi and other online platforms where I can actually learn in a low-cost mode. I am thinking to take this path but, I lack a person who can actually guide me and give me a 'wise' advice. Is it correct to do this? \n\n&amp;#x200B;\n\nNow, about my profile... As I said, I am enrolled in a University in Colombia, I am finishing my career (less than a year to graduate) and hopefully, I will get my studies done. What studies? Well, I have studies lot of mats and algebra concepts, statistics concepts; that why I could understand almost ay topic with linear algebra and, if I need it to; I could understand how to manipulate data, fit a model, predict, etc. etc. So, could be better my profile? Yes. That´s why I am asking.  How can i make it better?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nFinally, regarding my 'programming skills', I am R-Studio dependent. I know in some point I will have to learn python, SQL, AZURE, Etc. Let’s say, I have 'the logic' to understand a language, but I haven’t work with any other language. Plus, I feel very comfortable in R and not very fond with python. \n\n&amp;#x200B;\n\nSo, what should I do? I would like to read some advice of some persons who actually have experience in the industry. What should I expect regarding my profile? Will it be better with a master or not? Should I be working instead, in learning on my own? Any useful advice? What to study?  Where to start?\n\n&amp;#x200B;\n\nPD: Obviously, English is not my first language. Sorry c:\n\n&amp;#x200B;",
        "created_utc": 1670638734,
        "upvote_ratio": 1.0
    },
    {
        "title": "For Rstudio users: how to perform t-test between two groups from a variable that contains multiple groups?",
        "author": "Nuclease-free_man",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhe7r5/for_rstudio_users_how_to_perform_ttest_between/",
        "text": "Hi y’all, a random pharmacy student here. I’m kinda baffled at actually performing basic stats by myself, so here me out.\n\nE.g., In a dataframe, variable “flavor” contains multiple value like ‘chocolate’, ‘vanilla’, ‘strawberry’, …\n\nIn this dataframe, I want to perform a simple test to see if there is a mean difference between group ‘chocolate’ and group ‘strawberry.’\n\nHow should I do this? I thought of creating a new dataset that only contains these two groups by using subset function and then perform t.test(), but I thought you guys may have a better way to do it.\n\nThanks in advance!",
        "created_utc": 1670633323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for time series forecasting multiple KPI's with slightly different patterns",
        "author": "incognito_modeX3",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhe01f/advice_for_time_series_forecasting_multiple_kpis/",
        "text": "I have \\~10 metrics I need to forecast. The stated objective is to forecast out 60 months, but realistically my goal is to produce an accurate 3 month forecast. The forecast will also be revised monthly.\n\nEach metric is non-stationary with some degree of seasonality (most have strong trend, some are linear but with clear regression discontinuities, some are heavily skewed by holidays, some are skewed more so by end/beginning of the month periods, and some are impacted by clear exogenous shocks). \n\nSo far I've started with just one metric. The main models I've so far had the most success with based on out of time validation for this metric are ARIMA and Prophet. The forecasts so far are mostly univariate auto-regressions as I haven't added many intervention variables yet. \n\nOne area where I'm getting stuck - on certain windows for back testing, forecasting at a daily level with Prophet is more accurate than forecasting with ARIMA on a monthly level, whereas on other windows it's slightly better to forecast with ARIMA on a monthly level than Prophet on a daily level. Overall my MAPE is usually between 5% and 10%.\n\nI'm trying to figure out where I can simplify and what is best practice. Should I develop and test a new model for every single KPI and decide by KPI whether to forecast at a daily/monthly level based on performance over each window? It seems like a lot of work...\n\nI've also started looking into Multiple Aggregation Prediction Algorithms and recurrent neural networks but before I head down this track I wanted to get the community's thoughts...",
        "created_utc": 1670632735,
        "upvote_ratio": 1.0
    },
    {
        "title": "I would love some help understanding the math in this study and what exactly it is they measured and are claiming.",
        "author": "JansTurnipDealer",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhdlmv/i_would_love_some_help_understanding_the_math_in/",
        "text": "I am a teacher, not a statistician. That said, every teacher across the nation is embroyled in discussions over what works in education and I want to know what I'm talking about. When they talk about growth and standardized assessment scores what is it that they're measuring?  I get the idea of defining, for example, a mean proficiency rating and then standard deviations above and below that proficiency rating and then comparing year to year whether the result is more deviant from the mean in a positive direction. For example, in one year 3rd grade reading scores may be .1 standard deviations above the mean and in another year they may be .2 standard deviations with the next group of 3rd graders.  By that measure, one could argue that the next group of 3rd graders was more prepared in this district compared with the average student overall and look for a trend. Is that what they did?\n\nFull disclosure:  I think the Denver reforms were a disaster but math is math and I want to understand what the math says.\n\nStudy and technical report:  https://publicaffairs.ucdenver.edu/research-and-impact/research-centers/center-for-education-policy-analysis",
        "created_utc": 1670631645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Type 1 Error Question",
        "author": "kingjamesthe94th",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhdfq9/type_1_error_question/",
        "text": "\n\nI had an issue come up today on a statistics quiz given by a business professor and was looking for some guidance....the question asks:\n\n\"True or false the p-value indicates the risk of making a type 1 error if the researcher rejects HO\"\n\nI answered false thinking the question should say “alpha-level” instead of “p-value”\n\nWhat are everyone’s thoughts?",
        "created_utc": 1670631213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who Swears more?",
        "author": "ProfessorUto",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhddmu/who_swears_more/",
        "text": "Hello I have a google form for my Satiscitcs class where I wish to collect data and see whether younger people (18-34 years old's) or older people  (35-40+ years old's) swear more I need a total of 30 responses for each age group \n\n\\*(please note that I do not think you are old if you are anywhere in your thirties) \n\nThank you for your participation if you do agree to participate it is greatly appreciated \n\nhere's the link to the google form below\n\n[https://docs.google.com/forms/d/e/1FAIpQLScSbDqpUZXc1GJKxmhRHGk-0jbawYIIwBZTufUySylbmxZwIw/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLScSbDqpUZXc1GJKxmhRHGk-0jbawYIIwBZTufUySylbmxZwIw/viewform?usp=sf_link)",
        "created_utc": 1670631062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding linear regression t confidence intervals on Casio",
        "author": "UnregisteredFirearm2",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhc0cq/finding_linear_regression_t_confidence_intervals/",
        "text": "I have a Casio fx-9750GIII. Does anybody know how I can find a confidence interval for a linear regression? On a TI-84 it is a menu called LinRegTint.",
        "created_utc": 1670627738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is the correct set of test hypotheses?",
        "author": "srogue",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zhahtb/which_is_the_correct_set_of_test_hypotheses/",
        "text": " \n\nIf you conducted a test to determine whether the average amount dispensed by machine A is significantly more than the average amount dispensed by Machine B, the appropriate set of hypotheses is\n\na. Ho: µB - µA ≤ 0 versus Ha: µB - µA &gt; 0.\n\nb. Ho: µA - µB = 0 versus Ha: µA - µB ≠ 0.\n\nc. Ho: µA - µB ≥ 0 versus Ha: µA - µB &lt; 0.\n\nd. Ho: µA - µB ≤ 0 versus Ha: µA - µB &gt; 0.\n\n&amp;#x200B;\n\nI believe that the answer is C, am I correct, except that shouldn't it be µA - µB &gt; 0 (Since it is asking for a difference of more than 0?)",
        "created_utc": 1670624258,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Test(s) to use?",
        "author": "SCE-Sheol",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zh8a5c/what_tests_to_use/",
        "text": "Hello all,\n\nI’m not a statistician by any means so bear with me please.\n\nMy current research focuses on three insect species and the spore content found on their surface and within their digestive system. The aim is to compare external with internal and see if there are any similarities within each species, and then compare between species. \n\nI’m also comparing external content with a given space to determine if transfer occurs, so comparing external to surface for another experiment.\n\nThe extent of my stat knowledge is ANOVA and Linear Regression. Any suggestions or recommendations on what tests I should run would be greatly appreciated.\n\nThank you.",
        "created_utc": 1670618874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey guys, I was wondering whether horsepower would be considered as ordinal or interval data?",
        "author": "tartarmartas",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zh6pcm/hey_guys_i_was_wondering_whether_horsepower_would/",
        "text": "",
        "created_utc": 1670615146,
        "upvote_ratio": 1.0
    },
    {
        "title": "What statistical test should I use?",
        "author": "Majestic_Plantain355",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zh27c6/what_statistical_test_should_i_use/",
        "text": "\nThis is my research question: \n\nIs there a linear relationship between marsh “plant cubed root total mass” and “total height”, and does this depend on different levels of CO2?\n\nCan’t find any answers online, Any help would be appreciated!",
        "created_utc": 1670604667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spss regression literature t-test",
        "author": "PitifulAd814",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zh0ory/spss_regression_literature_ttest/",
        "text": "Hi all, I'm using SPSS to run a multiple regression, however as far as I've read, the coefficient t-test in regressions with spss are always two-sided tests.\n\nI have one-sided hypotheses and would like to cite a source as to why I would then divide the p-value by two in order to accept or reject my alternative hypothesis.\n\nDoes anyone know where I can find that mentioned in literature?\n\nHighly appreciate it.",
        "created_utc": 1670600936,
        "upvote_ratio": 1.0
    },
    {
        "title": "POLL, Who is sexually abused more under 18, boys or girls?",
        "author": "Uygtor_5565",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgzjbj/poll_who_is_sexually_abused_more_under_18_boys_or/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/zgzjbj)",
        "created_utc": 1670598082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is sexually abused more under 18, boys or girls?",
        "author": "No_Actuator_5565",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgz9pr/who_is_sexually_abused_more_under_18_boys_or_girls/",
        "text": "What is your opinion?\n\n[View Poll](https://www.reddit.com/poll/zgz9pr)",
        "created_utc": 1670597426,
        "upvote_ratio": 1.0
    },
    {
        "title": "outlier detection for non-normal data",
        "author": "Reasonable_Cut_2477",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgyq5o/outlier_detection_for_nonnormal_data/",
        "text": "What are some popular methods for outlier detection when data distribution is not normal. Normality test is failing.",
        "created_utc": 1670596055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Covariance",
        "author": "r3luct4nt",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgxr1l/question_about_covariance/",
        "text": "If I have a negative standardized covariance between two constructs of -0.030 what does it mean? Specifically, are they the least correlated constructs OR just negatively correlated? \n\nSorry in advance, it might be a really dumb question but I barely attended the class.",
        "created_utc": 1670593541,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the mathematical model of two - proportion Z test ?",
        "author": "Rich-Western917",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zguzbm/what_is_the_mathematical_model_of_two_proportion/",
        "text": "I couldn't find any info about the mathematical model of two proportion Z test. Is there anyone to help me ?",
        "created_utc": 1670585888,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do the numbers in the third column mean? This table is meant to explain the concept of mode, but I don’t get what the third and fourth columns are supposed to be",
        "author": "eleeesa",
        "url": "https://i.redd.it/hq0oieq71w4a1.jpg",
        "text": "",
        "created_utc": 1670580395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is sexually abused more under 18, boys or girls?",
        "author": "Enough_Dentist_5330",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgswnq/who_is_sexually_abused_more_under_18_boys_or_girls/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/zgswnq)",
        "created_utc": 1670579616,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to pronunce this math notation (non-native speaker)?",
        "author": "norfkens2",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgsu2f/how_to_pronunce_this_math_notation_nonnative/",
        "text": "I'm not a native English speaker, so I don't fully understand how to correctly \"say out\" math formulas. Could you maybe help me with these probability formulas, especially the 'pipe operator'?\n\np_k(x) = Pr(Y=k | X=x), k = 1, 2, ..., K\n\nC(x) = j if p_j(x) = max{p_1(x), p_2(x), ..., p_K(x)}\n\nMany thanks!",
        "created_utc": 1670579390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is sexually abused more under 18, boys or girls?",
        "author": "Affectionate_Lock832",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgrghv/who_is_sexually_abused_more_under_18_boys_or_girls/",
        "text": "Vote for your opinion!\n\n[View Poll](https://www.reddit.com/poll/zgrghv)",
        "created_utc": 1670574906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is sexually abused more under 18, boys or girls?",
        "author": "Ill-Complaint-8151",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgr71d/who_is_sexually_abused_more_under_18_boys_or_girls/",
        "text": "What is your opinion?\n\n[View Poll](https://www.reddit.com/poll/zgr71d)",
        "created_utc": 1670573968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to test the difference of mean of measurements from a specified value, the best measuring method and the inter-operator reliability at the same time?",
        "author": "GogaReborn",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgnt5b/is_it_possible_to_test_the_difference_of_mean_of/",
        "text": "Hi, in a research about slot sizes of dental brackets. Where 15 dental brackets each from 6 different manufacturers were sampled i.e total 90. (Each claimed to be 0.022 inches by the manufacturers)\nThe dental brackets were measured in the lab by 3 methods, 3D Mesial, 3D Distal and 2D Mesial method and by 2 operators each.\n\nNow, one of the objectives of the study is to find a statistically significant difference of the each manufacturers' slot sizes from the advertised size i.e 0.022 inches which can be done by one sample t-test. But the problem is which methods' reading and which operator's readings do we opt for?\n\nThe second objective is to compare the three methods of measurements? What would be the ideal comparison? Do we have to accept one of the methods as a standard and compare the others to it? Is this the same as inter-rater reliability? Bland-Altman Plots? Intra-class correlation coefficient? How do we do this if we don't know the \"true\" value that is being measured i.e the measurement itself is also an objective.\n\nAnd thirdly, which operator's readings are to be considered? Inter-rater reliability calculated? Mean of the two values or one operators' measurement discarded? Which one? How do we do this if we don't know the \"true\" value each operator is measuring i.e the measurement itself is also an objective.\n\nI tried to simplify the question, sorry if it lacks some necessary detail.",
        "created_utc": 1670563111,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to compare the skewness and kurtosis of two independent samples?",
        "author": "Tyranitarian",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgmyjc/how_to_compare_the_skewness_and_kurtosis_of_two/",
        "text": "Hello folks, I'm new to the sub, so I'm sorry if my post is misguided at all. \nAnyway, I'm a psychology grad student, and I recently conducted a study that was a replication of another study. My advisor asked that I compare the skewness and kurtosis of some of the variables between the two samples. He wants to make sure there was no significant difference between the skewness and kurtosis of the two samples. \nCan anyone give me guidance for this? Obviously if I were looking for means I would do t-tests, but is there a similar test I can easily do for this scenario? Particularly, if there's anything I can do in SPSS or online would be helpful, because I have no understanding of R at all unfortunately.",
        "created_utc": 1670560535,
        "upvote_ratio": 1.0
    },
    {
        "title": "ANOVA help",
        "author": "CharleneBae",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgly1a/anova_help/",
        "text": "I want to know if there's a significant difference in terms of celebrity worship and sex (male/female)\n\nCan I also know using one way ANOVA who among the male and female have higher level of celebrity worship?",
        "created_utc": 1670557689,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Just curious) How do the formulas for the coefficients and variance work for a linear regression with a single categorical predictor?",
        "author": "Aust-SuggestedName",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zglu0u/just_curious_how_do_the_formulas_for_the/",
        "text": "Say we have\n\nY = B0 + B1X\n\nWhere X is a categorical predictor that takes values of 0 or 1.\n\n\nIn simple linear regression with a continuous predictor,\n\nB0 = (SXY/SXX)*(Sample Mean of X)\n\nB1 = (SXX)/(SYY)\n\nSigma^2 = RSS/(n-2)\n\nWhere\nSXY = SUM[(xi-xmean)(yi-ymean)]\n\nSXX = SUM[(xi-xmean)^2]\n\nRSS = SUM([yi-(B0+B1*Xi)]^2)\n\nSomething isn't clicking for me in terms of how this would apply to a situation where x is a binary outcome.",
        "created_utc": 1670557364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is going for a bachelor's in statistics and data science a good idea?",
        "author": "neshhhh",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zglmpk/is_going_for_a_bachelors_in_statistics_and_data/",
        "text": "Probably too late to ask this question but I can't help but to be a little unsure whether I am going down the right path major wise. I am junior currently. I wanted to get better at math, learn programming, and learn how to handle data so I figure statistics would be a good major for me. I aspire to be a data scientist, something in AI, or quant finance. The problem is that I am surrounded by CS, informatics, business, and engineering majors and I kind of feel a little insecure about my major. I sometimes feel a little nervous to tell people I am a statistics major because no one seems to know what it is. It seems like I don't get the same respect as a CS, business, or engineering major. All I see on LinkedIn for people in the careers I want are have those majors as well. I find it pretty interesting that everyone says how statistics is crucial for data science and then turns out no one is a statistics major? Maybe because it is new major relatively? All of this cemented when I haven't heard anything for internships.  Unfortunately, I feel a little behind compared everyone so is there any advice for me? How do I stay competitive for the future?",
        "created_utc": 1670556776,
        "upvote_ratio": 1.0
    },
    {
        "title": "expected number of swaps for bozo sort algorithm",
        "author": "totallynotcheating1",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgkob2/expected_number_of_swaps_for_bozo_sort_algorithm/",
        "text": "[removed]",
        "created_utc": 1670554070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions on building a stronger application after rejection",
        "author": "223CPAway",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgjddc/suggestions_on_building_a_stronger_application/",
        "text": "So I was recently rejected from an MS in Statistics program. It's a bummer, but all I can do now is try again. I am hoping I can receive advice on strengthening my application to reapply in the near future.\n\nI believe most of my application is fairly strong. I had good LORs from my industry and academia, 3.5 undergrad GPA (unrelated major) 3.5 graduate GPA (related to my undergraduate coursework. I ultimately dropped out to pursue work). Had a strong SOP written (or so I'm told by my proof readers). Also have a bit of coding courses and projects.\n\nMy biggest weakness, and probably the Achilles heel were my math courses. The program I applied to only required Calc I, Calc II, and knowledge of linear algebra (no transcript necessary). My scores were as follows:\n\nCalc I: B\nCalc II: C\nLinear Algebra: A (unconsidered by admissions committee)\n\nI know these grades are not strong, and the 'A' I received in Linear Algebra was not considered due to a severe lag in the transcript being completed unfortunately. \n\nMy main thought is that I was rejected due to my minimal and relatively weak math scores. So to somewhat remedy this my plan is to finish Calc III with an 'A', which I am not worried about achieving.\n\nThe thing is, I am not sure if that will be enough for admissions. I would like to strengthen my application further and hopefully reapply for preferably the summer of 23' or the fall of 23', however, I am not sure what I can do in that time-frame to build my app beyond finishing Calc III strong. The GRE isn't required for this program, and I have heard mixed opinions on how much it is weighed during the review process.\n\nAre there any suggestions to further strengthen my application over the next few months to help me be successfully admitted?",
        "created_utc": 1670550595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deriving power/minimum sample size for two-sided, one sample t Test using central limit theorem.",
        "author": "Ok-Needleworker-6595",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgheb2/deriving_powerminimum_sample_size_for_twosided/",
        "text": "Can anyone explain to me what the basic setup here looks like?\n\nSay we have \"mu1\" as the mean under the null hypothesis and \"mu2\" as the mean we want to our power level to be valid for and we assume the standard deviation is \"a\".\n\nI can only find examples working through this using software.",
        "created_utc": 1670545845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excel function for finding the z score",
        "author": "Dr-MonkeyDLuffy",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgdo4i/excel_function_for_finding_the_z_score/",
        "text": "Hello,\n\nCan anyone please help me to find the excel function for finding the z value for the area under the curve between the mean and z standard deviations above the mean. See this for reference: [https://qph.cf2.quoracdn.net/main-qimg-acde2a1e5b94097e5eefc6466047ec13-pjlq](https://qph.cf2.quoracdn.net/main-qimg-acde2a1e5b94097e5eefc6466047ec13-pjlq)\n\nFor example, if the input for the function is 0.4962 (i.e., 99.24% confidence level), the output should be 2.67\n\nInterestingly I could not find any answer on the internet. Maybe I am using the wrong keywords!\n\nNote: NORM.S.INV(probability) is not the function I am looking for (unless I am missing something).",
        "created_utc": 1670537835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rules when generalising percentages",
        "author": "responsibleandstuff",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgd7ie/rules_when_generalising_percentages/",
        "text": "I can’t find any resources about ways to abstract statistical observations - can anyone suggest anything?\n\nHow much is fair to call a third? 30? 33% 35%? 38?\n\nWhen you say ‘half’, can that entail 49%? 55?\n\nHow much is a ‘notable’ observation? \n\nA ‘significant’ one? 60%?\n\nWhat does ‘mostly’ mean? 80%? 90%?",
        "created_utc": 1670536875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding right analysis method",
        "author": "stateoffame",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zgd44f/finding_right_analysis_method/",
        "text": "I am not sure which method I should apply for my research problem. So far, I have done two-way mixed ANOVA where I have compared groups of people and their attitudes. Next, I would like to get deeper as I have also collected some data on their values (Schwartz value survey). Could I make one Schwartz value factor and add it to my current ANOVA in some reasonable way? I would like to see how people with different attitudes fall into different values.",
        "created_utc": 1670536694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sample size calculation for repeated measure MANOVA, between and within group effects",
        "author": "tchaikswhore",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zg9ykk/sample_size_calculation_for_repeated_measure/",
        "text": "I need to do a sample size calculation. We are doing a study on the following:\n\n-4 groups\n-3 continuous outcomes\n-3 time points\n-both between and within group effects\n\nFrom what I’ve read, I need a method to calculate power estimates for repeated measure MANOVA. Additionally, we want to calculate between AND within group effects. I am yet to find any documentation for a method that considers all of this, they have only had pieces. \n\nAny references for this? I would like to do this in R.",
        "created_utc": 1670530125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assessing inter-coder reliability with percent agreement?",
        "author": "purplebean11",
        "url": "https://www.reddit.com/r/AskStatistics/comments/zg8ms9/assessing_intercoder_reliability_with_percent/",
        "text": "Hello, I'm wondering how to assess inter-coder reliability of two coders who are applying multiple codes to different brief open-ended responses. I though percent agreement but the examples I'm seeing on the internet show using percent agreement when there's only one code being applied to a response.\n\nThank you in advance! Please let me know if I can provide more information.",
        "created_utc": 1670527408,
        "upvote_ratio": 1.0
    }
]