[
    {
        "title": "Would traveling back in time break the first law of thermodynamics?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r4hgv/would_traveling_back_in_time_break_the_first_law/",
        "text": "[deleted]",
        "created_utc": 1529003481,
        "upvote_ratio": ""
    },
    {
        "title": "Do \"Black Holes\" Fill up? (all jokes aside please)",
        "author": "Onekahlil",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r4534/do_black_holes_fill_up_all_jokes_aside_please/",
        "text": "I have heard about the black hole burp and that is cool, but from what I understand, it projects particle outward but not beyond the event horizon. I would like to know more about what happens when a black hole fills up. Can a black hole become a star, or planet without a sun? Will there ever be enough matter in it to be visible \"to the naked eye\" so to speak? If it just condense free floating materials, what happen when it has enough to be large enough to cross it's own event horizon? I am rambling on speculation... Thank you for taking the time ",
        "created_utc": 1529000937,
        "upvote_ratio": ""
    },
    {
        "title": "Where do you get your science news?",
        "author": "zerodefex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r3zcd/where_do_you_get_your_science_news/",
        "text": "Where can a layperson get good science news that's not overly-hyped, clickbaity, etc? (other than reddit, obviously)",
        "created_utc": 1528999132,
        "upvote_ratio": ""
    },
    {
        "title": "(Hypothetical) If a human could live forever baring physical trauma. What would happen at the heat death of the universe? As everything pulls apart would the human eventually pull apart as well?",
        "author": "RegulusImpact1981",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r3vv9/hypothetical_if_a_human_could_live_forever_baring/",
        "text": "[removed]",
        "created_utc": 1528998436,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know that the results of scientific studies apply beyond those observed in the experiment performed?",
        "author": "5i5yphu5",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r2trp/how_do_we_know_that_the_results_of_scientific/",
        "text": "Let's take for instance a study measuring the effects of a drug on a sample from the population. Let's say the drug doesn't work on any of the participants. How do we know that it won't work on anyone who wasn't in the experiment? Is it possible that the drug may work for someone even if it doesn't work for the ones in the sample?",
        "created_utc": 1528990770,
        "upvote_ratio": ""
    },
    {
        "title": "How do hallucinogens \"fix\" depression, as so many articles have claimed? 0",
        "author": "Mecenary020",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r1grr/how_do_hallucinogens_fix_depression_as_so_many/",
        "text": "I have seen many articles on the internet lately about Psylocybin mushrooms, LSD, and acid being potential treatments for depression. How would this work? Are these studies done incorrectly?",
        "created_utc": 1528979492,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true that the WW2 brought with it improvements in medicine and science. If it's so which ones?",
        "author": "Blastdasher",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r17ko/is_it_true_that_the_ww2_brought_with_it/",
        "text": "",
        "created_utc": 1528977007,
        "upvote_ratio": ""
    },
    {
        "title": "At this time, do we have any evidence against relativity?",
        "author": "MrDrProfTimeLord",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r10ri/at_this_time_do_we_have_any_evidence_against/",
        "text": "Are there any phenomena that things like lightspeed, causality, and SR and GR can't account for?\n\nEDIT: If we ever do find something that manages to unify relativity and quantum mechanics, is it possible that the knowledge could lead to something that helps us overcome relativity and FINALLY get FTL?",
        "created_utc": 1528974976,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if Humanity didn't have the means to fight HIV like we had? Would we have been wiped out ?",
        "author": "Skilgannon21",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r0d0g/what_would_happen_if_humanity_didnt_have_the/",
        "text": "Just to be clear I don't think we are done with HIV and I take it very seriously. But we do have some ways to contain it. So If condoms didn't exist or if it were ineffective and if the same applied to HIV therapy, would mankind be in danger ? Regarding its spread speed and devastating effects. ",
        "created_utc": 1528966987,
        "upvote_ratio": ""
    },
    {
        "title": "Whats needed for a star system to have more than 1 habitable planet?",
        "author": "TheBeyonder-616",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r067s/whats_needed_for_a_star_system_to_have_more_than/",
        "text": "So we know that the trappist-1 has most of its planet potentially habitable. So whats allowing this? What made it have more habitable plantets than our solar system?\n\n And at this point im too afraid to ask.",
        "created_utc": 1528964396,
        "upvote_ratio": ""
    },
    {
        "title": "What is the scientific explanation of this?",
        "author": "winter32842",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8r02al/what_is_the_scientific_explanation_of_this/",
        "text": "[removed]",
        "created_utc": 1528962998,
        "upvote_ratio": ""
    },
    {
        "title": "What are the effects on eye saccades after long term usage of mobile screens held at close distances ?",
        "author": "singham",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qzykv/what_are_the_effects_on_eye_saccades_after_long/",
        "text": "",
        "created_utc": 1528961606,
        "upvote_ratio": ""
    },
    {
        "title": "~Scientists who have read Vonnegut's Cat's Cradle, was the importance you gave science deflated after?",
        "author": "lepriccon22",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qziz4/scientists_who_have_read_vonneguts_cats_cradle/",
        "text": "In particular, did the character of the son who is portrayed as dumb besides his scientific knowledge affect you?",
        "created_utc": 1528956421,
        "upvote_ratio": ""
    },
    {
        "title": "What newly founded studies could result in groundbreaking changes in how we view the universe and our very existence?",
        "author": "Tragicalknave",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qzhbv/what_newly_founded_studies_could_result_in/",
        "text": "Ever so sorry for the title; i suck at wording :D\n\nnonetheless onto the more interesting part;\n\ni am wondering but what newly founded science could result in changes to the view concept of how we view the universe?\n\nan example that i can think of personally is the behaviour of atoms, answers do not need to be full blown studies; and can be only a single section of snippet of a study.\n\nto all that answer i thank you in advance!! and i cannot wait to review your responses!!",
        "created_utc": 1528955873,
        "upvote_ratio": ""
    },
    {
        "title": "Is there anyone working today in the fields of astronomy, cosmology, or physics who will or can take up where Stephen Hawking left off?",
        "author": "CallEmAsISeeEm1986",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qylq3/is_there_anyone_working_today_in_the_fields_of/",
        "text": "I am out of my element.\n\nBut here are some brief ramblings that might spur some kind of discussion.\n\nAnd I realize the wording of my question is problematic. What do I mean by “take up” and “left off”? I don’t exactly know...\n\nAnd I further realize that, in a way, I’m basically an outsider cracking the door to a highly competitive and intellectual (and sometimes egoistic) arena and shouting “in a popularity contest, which of you would win?‽”\n\n... that’s part of it. But my intention is not merely to stir the pot.\n\nI think it is important to have science in the public eye. Scientists used to give public lectures and vast throngs would show up like it was a Baptist field\\-meeting in 1899 Ohio...\n\n...not any more.\n\nBut when Hawking made a statement, it would be transmitted to the masses, more or less, by newspapers... he was not confined to scientific journals.\n\nI am not familiar with physics, much less the living “rock stars” of physics...\n\nRutherford Bohr Fermi Einstein Oppenheimer Feynman Hawking\n\nLawrence Krauss...? Roger Penrose...? Neil deGrasse Tyson...?\n\n... I’m just listing a few people I think are associated with the field.\n\n(Tyson is a deliberate popularizer... so I’m not sure he counts? Same with Sagan? Does he, or did Sagan, do work of consequence? Not that there’s anything wrong with fostering scientific literacy among the unwashed masses... I’m all for it. But the fame doesn’t come from their work in the field, so much as from their efforts to make science cool again.)\n\nBasically... What living cosmologist / physicist will join the ranks scientific greats?\n\nWill anyone working today become a household name without a major breakthrough?\n\nMaybe their breakthroughs is exactly why we laymen recognize some of the above names. Maybe the breakthrough is intrinsic...\n\nIn which case, it will not be possible to answer at least one aspect of my question... as the nature of breakthroughs is their inherent unpredictability.\n\nAnyway... look forward to hearing your thoughts, Redditists!!",
        "created_utc": 1528946291,
        "upvote_ratio": ""
    },
    {
        "title": "Could we use the world's nuclear bombs as some sort of a signal to intelligent life elsewhere in the universe?",
        "author": "Longboarding-Is-Life",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qyh0m/could_we_use_the_worlds_nuclear_bombs_as_some/",
        "text": "Edit: I mean setting them off in space. Finding aliens is worthless if we're all dead before they can reply",
        "created_utc": 1528945048,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't Africans have androgenized body hair?",
        "author": "AndeanRebozo",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qxt6c/why_dont_africans_have_androgenized_body_hair/",
        "text": "It is generally assumed body hair grows because of high levels of circulating androgens and/or high androgen receptor sensitivity.\n\nHowever, Africans have the most sensitive androgen receptors, and the most testostrone (and its derivatives-- DHT and estradiol, chief among them relevant to hair growth) adjusted for age and body size. Yet, a quick look at West Africans, East Africans, and South Africans gives the same picture: they have almost no androgenized body hair (other than relatively weak beard growth in some groups).\n\nWhat mechanism is going on that protects Africans from developing terminal hairs on their chest, arms, thighs, etc.?\n\nstudies: (1) androgen receptor sensitivity variation: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2608588/pdf/jnma00357-0023.pdf (2) androgens in black, east asian, white, etc.: https://pdfs.semanticscholar.org/56c7/049634ac87441e8a96afc8fe34c588bdad94.pdf",
        "created_utc": 1528938937,
        "upvote_ratio": ""
    },
    {
        "title": "Possibility of seeing the big bang",
        "author": "songs-of-no-one",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qx0gu/possibility_of_seeing_the_big_bang/",
        "text": "This is pretty far out question but is it possible to see the big bang if we go beyond our universe due to time and relativity.\n\nTime changes due to distance of light travel say if you looked on earth from a fair distance you would be seeing the past. so could we look back in to the past at the starting point of our universe by stepping out of the einstein light cone. Say at the end of our observable universe ? \n\nWhat do you guys think is this plausible? I understand this is a bit fringe but just a thought. ",
        "created_utc": 1528931703,
        "upvote_ratio": ""
    },
    {
        "title": "How discoveries are made...",
        "author": "Microwave_on_HIGH",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qwlf4/how_discoveries_are_made/",
        "text": "In all the STEM fields, there are examples of amazing discoveries and advancements, due either to serendipity (ie penicillin), observation of something comparable (ie Archimedes' eureka moment), or a leap of intuition (ie relativity).\n\nWhat I find most intriguing is the method that the people used to make incredible advancements, *especially* because the solutions are often SO unintuitive or counterintuitive.\n\nAre there any good resources that attempt to discern (and maybe educate us) what is going on in the mind of these people?  I know there are courses in mathematical reasoning, but I'm thinking something more general across STEM fields.",
        "created_utc": 1528928179,
        "upvote_ratio": ""
    },
    {
        "title": "Can casinos track how much money is being cashed out of a machine in real time?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qwb4t/can_casinos_track_how_much_money_is_being_cashed/",
        "text": "[deleted]",
        "created_utc": 1528925918,
        "upvote_ratio": ""
    },
    {
        "title": "What are some cool things that existed in the past but not anymore?",
        "author": "hi_im_nena",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qw3uz/what_are_some_cool_things_that_existed_in_the/",
        "text": "I'll write some things I vaguely know about:\n\nI remember reading about some flower in ancient greece that you could ingest and it acted as a 100% effective male contraptive, but everyone used it so much that it went extinct around the year 1200\n\nAlso apparently dodo birds and their eggs were the most tasty things ever and everyone ate them all and they went extinct too lol\n\nThere was type of banana that tasted much better than today's bananas but they went extinct around 1960 due to a worldwide infection which wiped them out. But banana-flavoured candies, milkshakes etc. still use the flavour of the extinct superior banana which is pretty cool \n\nLead paint, that worked really well and didn't fade/crack/flake off as much as modern paints do, but it pretty much doesn't exist anymore. (because it's toxic to humans, however it did have better properties as a paint) \n\nWhat other \"better\" things were there in the past that we don't have anymore?",
        "created_utc": 1528924344,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a way to determine the time value of an “hour”glass without all the sand on one side?",
        "author": "Mlawless",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qvuio/is_there_a_way_to_determine_the_time_value_of_an/",
        "text": "I’m sitting at my dinner table and notice my wife bought a decorative hourglass from Ross and it was half way through the sand pouring. I was thinking, “I wonder if that is a true hourglass or not. I wonder how long it actually takes to complete”.     \n   \nBut, the hourglass was around 60% through. So I then thought “the easiest way to measure this is to wait until it completes, flip it, and time the complete process”.    \n   \nBut is there a mathematical or scientific shortcut to figure out a reasonable accurate (within a couple minutes) time of the hourglass when it is an indeterminent amount complete? (I didn’t want to wait for it to complete to start the experiment) \n    \nFor the record- it was only a decorative hourglass. It took 1 hour 43 minutes to complete! ",
        "created_utc": 1528922404,
        "upvote_ratio": ""
    },
    {
        "title": "what could be the next BIG THING in science?",
        "author": "R221B",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qujrk/what_could_be_the_next_big_thing_in_science/",
        "text": "",
        "created_utc": 1528912880,
        "upvote_ratio": ""
    },
    {
        "title": "What determines the rotation of a galaxy?",
        "author": "wamceachern",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qug9b/what_determines_the_rotation_of_a_galaxy/",
        "text": "Yes i know the blackhole in the center sucking everything in. But what about it is causing it to spin. You see you have a toilet and flush it,depending what hemisphere you are in, determines the rotation. So what determines the rotation of our galaxy?",
        "created_utc": 1528912184,
        "upvote_ratio": ""
    },
    {
        "title": "WhT determines our galaxy rotation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qtvxv/wht_determines_our_galaxy_rotation/",
        "text": "[deleted]",
        "created_utc": 1528908011,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if the sun were replaced by a black hole?",
        "author": "Kun_Jim_Uong",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qsazt/what_would_happen_if_the_sun_were_replaced_by_a/",
        "text": "This existential doubt arose to me ... What would our galaxy look like?",
        "created_utc": 1528895489,
        "upvote_ratio": ""
    },
    {
        "title": "What is the most energy efficient way to move electricity over transcontinental distances?",
        "author": "barnabyg2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qs2fl/what_is_the_most_energy_efficient_way_to_move/",
        "text": "Say you had wind turbines in the South Atlantic and you wanted to use the electricity generated in Europe or North America.",
        "created_utc": 1528893281,
        "upvote_ratio": ""
    },
    {
        "title": "Under which circumstances could the biggest storm ever occur?",
        "author": "asi_esher",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qs1cc/under_which_circumstances_could_the_biggest_storm/",
        "text": "You probably have heard about the biggest storms in our recorded history but what preconditions that gladly havent mixed together could create such a huge natural disaster?\n\n",
        "created_utc": 1528893000,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been any other species as destructive as homo sapiens?",
        "author": "brizesh",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qru1n/has_there_been_any_other_species_as_destructive/",
        "text": "Reading Sapiens: A Brief History of Humankind, I learned that Homo Sapiens have always been an unparalleled destructive force in nature. Many species of animals and probably plants and trees are extinct thanks to us. I had always assumed that we got this good at destroying nature only after the industrial revolution, but it turns out we have been killing off entire species for many millennia. If humans were such a force to reckon with even before the invention of writing scripts and metal weaponry, were there any other species that came close to our level of domination?\n\nAdditionally, if we are what happens at the later stages of evolution, what are the chances that civilisations on far\\-off planets flickered out before they got a chance to move off\\-planet as a result of destroying/exhausting their natural resources? ",
        "created_utc": 1528891036,
        "upvote_ratio": ""
    },
    {
        "title": "What were the loud booms I heard?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qrh7t/what_were_the_loud_booms_i_heard/",
        "text": "[deleted]",
        "created_utc": 1528887133,
        "upvote_ratio": ""
    },
    {
        "title": "Does the spread of coyotes across the U.S. poses a danger to some animal species?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qrcre/does_the_spread_of_coyotes_across_the_us_poses_a/",
        "text": "https://news.nationalgeographic.com/2016/08/coyote-america-dan-flores-history-science/\n\nCoyotes historically did not live in large areas of land east of the Mississippi.  One reason is that wolves generally killed them on sight.\n\nCoyotes have a much broader diet than wolves, eating a variety of small animals.  Would they poses a danger to the indigo snake, for example, which they can easily catch and kill?  This snake evolved in the absence of coyotes.  Many other small animals did also.\n\nGeneral writings on the spread of this predator have portrayed it as a generally positive or neutral event.  Are there ecological downsides to coyote expansion? -- the animals reproduce rapidly and can dominate their environment.",
        "created_utc": 1528885605,
        "upvote_ratio": ""
    },
    {
        "title": "If you could go back in time but only to sever Julian Jayne's corpus callosum, why would you do it?",
        "author": "citruskeptic1",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qr68o/if_you_could_go_back_in_time_but_only_to_sever/",
        "text": "[removed]",
        "created_utc": 1528883360,
        "upvote_ratio": ""
    },
    {
        "title": "(speculative fiction based) Can we create designer bodies and transplant our brain in them",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qqyiy/speculative_fiction_based_can_we_create_designer/",
        "text": "[deleted]",
        "created_utc": 1528880625,
        "upvote_ratio": ""
    },
    {
        "title": "If Pluto exploded, how long would it take us to notice with and without instrumentation?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qqm07/if_pluto_exploded_how_long_would_it_take_us_to/",
        "text": "[deleted]",
        "created_utc": 1528875853,
        "upvote_ratio": ""
    },
    {
        "title": "If we find a way to \"see\" the quantum state of a particle without altering it, could we use quantum entanglement for communications?",
        "author": "Dimakhaerus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qqifl/if_we_find_a_way_to_see_the_quantum_state_of_a/",
        "text": "Is it because we don't have the technology to do it or is it physically impossible to do that?",
        "created_utc": 1528874598,
        "upvote_ratio": ""
    },
    {
        "title": "Possible? A structure which encircles a planet, but doesn't spin?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qq1uy/possible_a_structure_which_encircles_a_planet_but/",
        "text": "Imagine if, instead of a space station orbiting a planet, or a series of space cities sharing an orbit, space travellers built a single huge structure that completely encircled the planet. Would this structure have to spin to remain stable? Could its inhabitants live in zero gravity?\n",
        "created_utc": 1528869163,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to safely remove permanent implants like pacemakers and artificial hips?",
        "author": "MrDrProfTimeLord",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qp2zo/is_it_possible_to_safely_remove_permanent/",
        "text": "So I'm writing a story where my characters gain both agelessness and regenerative abilities. Problem is, foreign object interfere with their healing powers and end up causing them serious pain where their bodies effectively try to heal into space occupied by something else. Some of my characters are elderly when they power up, and so have things like pacemakers, artificial hips, and other kinds of implants that have to be removed before they can start to heal. Is it possible to safely take these out and for the patient to live without them for a short time? It doesn't have to be long, maybe a few days at the very most while they heal",
        "created_utc": 1528858815,
        "upvote_ratio": ""
    },
    {
        "title": "Why does Halite cost so much when it’s just salt?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qoyvv/why_does_halite_cost_so_much_when_its_just_salt/",
        "text": "[deleted]",
        "created_utc": 1528857714,
        "upvote_ratio": ""
    },
    {
        "title": "According to General Relativity, was the Catholic Church as right and as wrong as Galileo about the Sun orbiting the Earth?",
        "author": "MartinaS90",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qo6nb/according_to_general_relativity_was_the_catholic/",
        "text": "I read that, according to General Relativity, there is no absolute frame of reference. So every object can be considered still from its own point of view and that is as valid as any other frame of reference. There is no asbolute still in space.\n\nSo... does that mean that Galileo wasn't more right than the Catholic Church? Whether it's the Earth orbiting the Sun, or the Sun orbiting the Earth, depends on the frame of reference chosen, and every frame of reference is as valid as any other as I've been told.",
        "created_utc": 1528850433,
        "upvote_ratio": ""
    },
    {
        "title": "If you were to eat only what you needed at the exact time (so you don't \"excess\"), would you poop less in contrast to eating a lot at once?",
        "author": "Ualrus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qnukr/if_you_were_to_eat_only_what_you_needed_at_the/",
        "text": "I'm genuinely curious, by a health issue.., or rather: trying to understand how the body works..",
        "created_utc": 1528847412,
        "upvote_ratio": ""
    },
    {
        "title": "how do we not see the universe is this simple?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qnjyw/how_do_we_not_see_the_universe_is_this_simple/",
        "text": "https://www.youtube.com/watch?v=P56TrUDdUr4",
        "created_utc": 1528844837,
        "upvote_ratio": ""
    },
    {
        "title": "God Must Exist in a Multiverse, Right?",
        "author": "MasterProtoge",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qnjxp/god_must_exist_in_a_multiverse_right/",
        "text": "[removed]",
        "created_utc": 1528844830,
        "upvote_ratio": ""
    },
    {
        "title": "Is the universe infinite or expanding? I've heard both but I know that infinities aren't expanding, they're fully formed, so which is it?",
        "author": "MrMew13",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qn4yu/is_the_universe_infinite_or_expanding_ive_heard/",
        "text": "",
        "created_utc": 1528841309,
        "upvote_ratio": ""
    },
    {
        "title": "Where the rubber hits the road.",
        "author": "bydoe306",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qn0xi/where_the_rubber_hits_the_road/",
        "text": "With the millions upon millions of tires worn down in the world, why is there not a soot build up along the road sides of interstates. ",
        "created_utc": 1528840414,
        "upvote_ratio": ""
    },
    {
        "title": "If a Dyson Sphere existed but not all of its power generation were needed, would there be a mechanism to feed the energy back and prolong the life of the star?",
        "author": "thedailynathan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qlnjg/if_a_dyson_sphere_existed_but_not_all_of_its/",
        "text": "Say if only 1% of the power was needed to be extracted, could the other 99% be fed back to the star somehow?",
        "created_utc": 1528830294,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any limit on the strength of a magnet? Could, for example, a fridge magnet be made powerful enough to attract objects from across a room?",
        "author": "Chicken_Spanker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8ql6l3/is_there_any_limit_on_the_strength_of_a_magnet/",
        "text": "",
        "created_utc": 1528826920,
        "upvote_ratio": ""
    },
    {
        "title": "Sun rises in different location",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qk5i8/sun_rises_in_different_location/",
        "text": "Has a 90 polar shift occurred?",
        "created_utc": 1528819519,
        "upvote_ratio": ""
    },
    {
        "title": "Black Holes as 4D balls?",
        "author": "FlaJeS",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qk4tg/black_holes_as_4d_balls/",
        "text": "Hi, so i've been thinking about black holes recently. (I watched a lot of documentaries) and i have theory/hypothesis(?) that i didn't see anywhere. \nIf black holes get bigger whenever they \"eat\" something,\nIs it possible that they are just four tesseract warehouses?\nYou see, once something enters the black hole, it would enter the inner point (the cube inside the cube, or in this case,balls :D) and it would get trapped there because of the strong outer layer and get condensed into a ball.\nWhat do you think?",
        "created_utc": 1528819398,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if you put a cadaver in a sanitary room for 100,000,000 years?",
        "author": "gc3c",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qjnh1/what_would_happen_if_you_put_a_cadaver_in_a/",
        "text": "",
        "created_utc": 1528815974,
        "upvote_ratio": ""
    },
    {
        "title": "Boredom boners, why?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qj9nx/boredom_boners_why/",
        "text": "[removed]",
        "created_utc": 1528812950,
        "upvote_ratio": ""
    },
    {
        "title": "Could a planet spin fast enough so that standing on the surface the radial forces would cancle gravity out?",
        "author": "WarrantyVoider",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qj4eg/could_a_planet_spin_fast_enough_so_that_standing/",
        "text": "or would the planet explode before that because internal pressure would rip it apart earlier?",
        "created_utc": 1528811785,
        "upvote_ratio": ""
    },
    {
        "title": "Theoretically, if the multiverse theory is true, if you could hop between universes/timelines/etc., how would conservation of matter and energy still hold?",
        "author": "Blitzkrieg0",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qj35k/theoretically_if_the_multiverse_theory_is_true_if/",
        "text": "If you suddenly exited this universe, wouldn’t you be destroying energy and matter, and appearing into another would be creating energy and matter? What would be some theoretical ways around that?",
        "created_utc": 1528811529,
        "upvote_ratio": ""
    },
    {
        "title": "How would earth’s climate change if all land masses were under water?",
        "author": "Cutsprocket",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qj1hu/how_would_earths_climate_change_if_all_land/",
        "text": "If earth or an earth like planet in a similar astrological position had no major land masses above sea level how different would the climate be?",
        "created_utc": 1528811125,
        "upvote_ratio": ""
    },
    {
        "title": "Could a planet be made livable outside a star's Habitable Zone?",
        "author": "MrDrProfTimeLord",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qiut3/could_a_planet_be_made_livable_outside_a_stars/",
        "text": "Setting aside the issue of terraforming technology, is it theoretically possible for a distant planet to have an atmosphere that captures heat very well (like Venus) and helps life survive further out than Earth? Similarly, could a planet closer to a star function if it had something in its atmosphere to obscure sunlight and possibly deflect excess amounts back into space?",
        "created_utc": 1528809478,
        "upvote_ratio": ""
    },
    {
        "title": "stronomyCould a planet spin fast enough so that standing on the surface the radial forces would cancle gravity out?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qiprj/stronomycould_a_planet_spin_fast_enough_so_that/",
        "text": "[deleted]",
        "created_utc": 1528808246,
        "upvote_ratio": ""
    },
    {
        "title": "Will the tank's water rise if more fishes are born?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qil68/will_the_tanks_water_rise_if_more_fishes_are_born/",
        "text": "[deleted]",
        "created_utc": 1528807075,
        "upvote_ratio": ""
    },
    {
        "title": "Is emergence just ignorance?",
        "author": "Pseudoabdul",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qihdd/is_emergence_just_ignorance/",
        "text": "This question came up in my studies and its kinda bugging me. \n\nI'm pretty into holism so this isn't my cup of tea, but I think I can see the reasoning. \n\nWhat does everyone else think?",
        "created_utc": 1528806040,
        "upvote_ratio": ""
    },
    {
        "title": "What's your opinion on J147 drug ? Are we close to rejuvenating, anti aging the brain ?",
        "author": "Mewto1k",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qi78a/whats_your_opinion_on_j147_drug_are_we_close_to/",
        "text": "",
        "created_utc": 1528803137,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find scientific research and papers written by real scientists and engineers?",
        "author": "casualhumanist",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qi1k0/where_can_i_find_scientific_research_and_papers/",
        "text": "",
        "created_utc": 1528801379,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the consequences on the environment of a mass extinction of all mosquitos?",
        "author": "Leyo96",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qhl75/what_would_be_the_consequences_on_the_environment/",
        "text": "",
        "created_utc": 1528795822,
        "upvote_ratio": ""
    },
    {
        "title": "Can stomach acid tear down foods with hard outer layers?",
        "author": "seands",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qhekc/can_stomach_acid_tear_down_foods_with_hard_outer/",
        "text": "Flax is known for not giving up many of its nutrients without grinding. I cooked some flax seeds whole in my slow cooker for 8 hours and they came out soft enough to break by pressing my fingernail on it. \n\nStomach acid is strong so I was curious of you guys though that combination would be enough to break down normally tough foods like whole (but softened) flax?",
        "created_utc": 1528793355,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think Advanced &amp; Intelligent Aliens would look like?",
        "author": "TheBeyonder-616",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qgykx/what_do_you_think_advanced_intelligent_aliens/",
        "text": "Now, I totally agree that animal life on other planet would obviously be different. Their land, sea and flying animals would differ greatly in appearance in contrast to ours and that they would all evolve depending on the required conditions on their planet.\n\nBut what about advanced, intelligent, sentient and sapient aliens, what do you think they would look like? \n\nOf course, im not just talking about intelligence alone, as though we are the smartest on earth, dolphins and whales are also the smartest of the deep.\n\nIm talking about aliens who have also achieved advancement, in technology etc. Being able to use tools and manipuate their environment to create structures and machines which over a thousand years could lead to them also reaching for the stars like we will, and spread to other areas of the galaxy.\n\nThis may just be me but... I think they will look similar to us, IMO. \n\nNow let me explain. I dont mean to say they will look like us totally, but their structure would BE similar to ours. Two legs, two arms with an opposable thumb and they would also have to be predatory in nature.\n\nIf Aliens have technology comparable or more than ours, then they would need production techniques, methods of manufacture, comparable or more than ours. To develop that level of technology they would have to learn how to manipulate matter over generations as our species and earlier human species did over eons. \n\nTo pick up a rock you need one hand, to pick up a tool to hit it with and shape that rock, you need a second hand. To have evolved hands that are free to pick up rocks and tools the species of animal must no longer be using them as a form of locomotion. \n\nTherefore aliens that use tools and develop technologies like ourselves must be bipeds with two dextrous hands and walk and run on two legs. \n\nTo see what they were doing with their tools and be able to gauge depth and accurately determine the dimensions of the object they were shaping with their tools, they would need two eyes in the front of their heads, for binocular vision. \n\nSo it is a near certainty aliens with technology comparable or more advanced than ours would look very much like us. \n\nAgain, I dont think they would look like us totally, but similar. \n\nWhat are your opinions? Feel free to correct me",
        "created_utc": 1528787450,
        "upvote_ratio": ""
    },
    {
        "title": "What methods are currently employed to counter the effects of Antibiotic Pollution in the environment, and what in this specific field is currently being explored?",
        "author": "invertedfractal",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qg03q/what_methods_are_currently_employed_to_counter/",
        "text": "Links to articles and readings would be helpful. Thanks!",
        "created_utc": 1528776698,
        "upvote_ratio": ""
    },
    {
        "title": "Is this space travel tought experiment would allow me to witness the end of the universe?",
        "author": "olivierrt",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qfwjy/is_this_space_travel_tought_experiment_would/",
        "text": "[removed]",
        "created_utc": 1528775701,
        "upvote_ratio": ""
    },
    {
        "title": "If we bioengineered all the trees on earth to have white leaves and trunks, would it help bounce the light away earth and help cool it down?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qfi6h/if_we_bioengineered_all_the_trees_on_earth_to/",
        "text": "I've been reading how some scientists suggest making the ocean foamy and white to bounce sun's rays back from the earth and how some cities are painting their roads white to cool them down. I was wondering if we applied this principle to trees if it could have the same intended effect. Would it even be practical?",
        "created_utc": 1528771954,
        "upvote_ratio": ""
    },
    {
        "title": "Assuming it was possible, would you still scar if you had super healing?",
        "author": "jmwalters",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qezbl/assuming_it_was_possible_would_you_still_scar_if/",
        "text": "[removed]",
        "created_utc": 1528767301,
        "upvote_ratio": ""
    },
    {
        "title": "Is it a good idea to store datacenters underwater like Microsoft recently began testing out?",
        "author": "scomar1221",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qeftf/is_it_a_good_idea_to_store_datacenters_underwater/",
        "text": "Seems like dispersing all that heat in the ocean could contribute to rising ocean temperatures if this becomes the standard, but maybe it's still better than using energy to cool them on land. I know nothing, just curious what y'all think!",
        "created_utc": 1528762579,
        "upvote_ratio": ""
    },
    {
        "title": "If you were to somehow oscillate a black hole along a line at a ridiculously high frequency, would it become a one dimensional object?",
        "author": "LightBadger",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qeck2/if_you_were_to_somehow_oscillate_a_black_hole/",
        "text": "Hypothetically, say you were to oscillate a black hole along a line between points A and B, would it ever stretch into a line, and if so, how would I go about calculating that based on the mass, frequency, and distance from A to B?",
        "created_utc": 1528761767,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be possible to replace the three meal routine in favour of a constant meal?",
        "author": "BionicFire",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qe4qk/would_it_be_possible_to_replace_the_three_meal/",
        "text": "Instead of sitting down and eating a large meal, can one sustain themselves by continually eating small items? Say, eating a bag of nuts, vegetables or the like throughout the day.\n\nWould this be possible or would it cause problems to the person on this hypothetical diet?",
        "created_utc": 1528759853,
        "upvote_ratio": ""
    },
    {
        "title": "Death from a room slowly losing oxygen.",
        "author": "OwlCoffee",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qdxc8/death_from_a_room_slowly_losing_oxygen/",
        "text": "Not sure if this belongs or not, so I thought I'd try.\n\nIn the movies, whenever there's a short supply of oxygen in any environment that lacks it naturally (high altitudes, space, underwater, etc.) characters are always encouraging each other to conserve their oxygen. \n\nThat got me thinking.  What would it be like for a room to slowly lose oxygen?  How would it affect the people inside?  Would it be like the \"frog in a pot\" idea and if it went slowly enough people wouldn't notice until they were dead or passed out?  \n\nI've been tossing around a story idea where a very slow decrease in oxygen leads to the death of a character, but I was having a lot of trouble finding info online about something like this (just how long it would take you to die from going to oxygenated area to area without oxygen). ",
        "created_utc": 1528758051,
        "upvote_ratio": ""
    },
    {
        "title": "If you had to amputate a finger from each hand, what would strategically be the best choice?",
        "author": "maudiestirling",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qdlz2/if_you_had_to_amputate_a_finger_from_each_hand/",
        "text": "Would you, say, choose a different one from each hand so that one can be purposed for gripping and another for intricate work?",
        "created_utc": 1528755440,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if the sun was surrounded by a perfect mirror",
        "author": "r3h4f",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qdfgr/what_would_happen_if_the_sun_was_surrounded_by_a/",
        "text": "This is more of a shower thought than anything. What would happen if the sun, or any other star, was surrounded by a perfect mirror, which could reflect all of the incident photons toward the centre of the sun. \n\nWould it speed up the fusion process?\n\nTIA",
        "created_utc": 1528754007,
        "upvote_ratio": ""
    },
    {
        "title": "Can we create fusion powered rockets?",
        "author": "ZiggySaurusRex",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qdev3/can_we_create_fusion_powered_rockets/",
        "text": "[removed]",
        "created_utc": 1528753878,
        "upvote_ratio": ""
    },
    {
        "title": "How do insects and small animals see the world?",
        "author": "AlfredoOf98",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qcior/how_do_insects_and_small_animals_see_the_world/",
        "text": "This is a compound question. I know it can differ greatly by species, but my aim to get any answer that matches any specific kind of a small animal that has eyes, such as flies, flees, tiny lizards, spiders, mantises, etc..\n\nSo,\n\nDo they experience the unlimited depth-of-view? Are they nearsighted? Do they see small things that we need a microscope to see? Do they have the 3D understanding of the world and have a 'map' in their brains?",
        "created_utc": 1528747301,
        "upvote_ratio": ""
    },
    {
        "title": "If the United States never changes its environmental policies, but the rest of the world works towards rigorous sustainable and environmentally-friendly practices, what would the world be like?",
        "author": "Skydragon222",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qc6xl/if_the_united_states_never_changes_its/",
        "text": "This is a what\\-if question, so I'm posting it here rather than on Ask Science due to it's speculative nature. \n\nPlease forgive my title, my question is a little hard to articulate in a single sentence. I'm from the United States and the rest of the world seems to be taking much stronger steps towards sustainable environmental practices than we are. I know that at our current trajectory, we will do massive and possibly irreparable damage to the Earth's ecosystems, and i know that every country should be making changes to how they treat the environment if we want to keep living on the earth for the next millennium.\n\nI'm curious as to what would happen if the United States is the \\*only\\* country that doesn't update its environmental policy.\n\nAssume that we live in a hypothetical world where every single country on Earth except the USA adopts alternative energy and cuts their greenhouse gas emissions to sustainable levels. Also assume that the USA doesn't change from its current practices ever.\n\nIn this scenario would the United States \"ruin it\" for the rest of the world? Or would the effect of the USA's pollution be negligible? Also, how would it be different living in the United States compared to Australia or Japan or Europe? Would the average person be able to notice the difference in pollution levels and/or air quality?",
        "created_utc": 1528745000,
        "upvote_ratio": ""
    },
    {
        "title": "I think we have passed the Great Filter.",
        "author": "natantantan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qc5cq/i_think_we_have_passed_the_great_filter/",
        "text": "I think that life is not that rare. The universe is probably brimming with life. Imagine every animal that is not a human. They are all, more or less, on the same level of intelligence. Sure a dog is far smarter than a cockroach but they are both just following their animal coding. This is how every single animal is and has been besides humans.\n\nThe main thing that separates us from every other animal are things like art, science, abstraction, language, the concept of the past and the future. Humans are able to break free from their coding in a sense. \nThey are able to choose to not eat even if they are hungry and if there is food available. They are able delay gratification until even after death. No animals can do things like this. \n\nMaybe this is the great filter. Maybe there was was just a rare and coincidental series of random events and mutations that let one species of animal become \"unanimal like\" and do things like travel the stars. I think the universe could be teeming with life but reaching the level of intelligence needed to do things like build rockets was a freak accident. \n\nAre there any theories or ideas that support or disprove my idea? ",
        "created_utc": 1528744688,
        "upvote_ratio": ""
    },
    {
        "title": "What about the human details of a journey to Mars?",
        "author": "Myntrith",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qc13j/what_about_the_human_details_of_a_journey_to_mars/",
        "text": "As far as pop-culture and mass media, everyone seems to think of the challenges of a manned Mars mission as being building a big enough rocket and survivability once we get there. I've heard little to nothing about the complications of the journey itself.\n\nI'm sure people are working on these questions, but we layfolk don't hear about them much.\n\nA one-way journey, with our current propulsion technology, would take about a year, I think. For that journey, the brave astronauts would have to have a sufficient supply of air, food, water and power.\n\nI'm assuming they would also need sufficient room to move and exercise, hygiene supplies, medical supplies and expertise, backup systems and repair modules/tools, and that some of these things become exponentially more complicated with each person you add to the mission.\n\nPutting aside the big rockets and the survivability after landing, how close are we to being able to plan a survivable, one-year journey for a crew of one? For a crew of three or four?",
        "created_utc": 1528743865,
        "upvote_ratio": ""
    },
    {
        "title": "In industrialized societies, we are accumulating deleterious mutations faster than they are removed. What can we do to reverse this trend?",
        "author": "natehanby",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qbwl9/in_industrialized_societies_we_are_accumulating/",
        "text": "I cite this article from PNAS:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2824313/\n\n&gt;Finally, a consideration of the long-term consequences of current human behavior for deleterious-mutation accumulation leads to the conclusion that a substantial reduction in human fitness can be expected over the next few centuries in industrialized societies unless novel means of genetic intervention are developed.\n\n1) Do you agree with the conclusion of this article?\n\n2) If yes, are there any low-tech ways that we can reverse this trend and prevent us from passing so many deleterious mutations to our future descendants in a few hundred years?",
        "created_utc": 1528743033,
        "upvote_ratio": ""
    },
    {
        "title": "How much does it cost to pull CO2 from the oceans?",
        "author": "freshthrowaway1138",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qbnqe/how_much_does_it_cost_to_pull_co2_from_the_oceans/",
        "text": "So there has been quite a bit about the [drop in costs](http://news.trust.org/item/20180607155315-6j9gc/) to pull CO2 from the air, but what about the oceans? \n\nThe rising levels of CO2 in the oceans is causing all sorts of problems to our food chains as well as the impacts of rising sea surface temps on the climate. What technologies are coming out that would solve this issue?\n\n",
        "created_utc": 1528741238,
        "upvote_ratio": ""
    },
    {
        "title": "Would self-replicating nanobots/robots capable of self-improvement and differentiation be considered life forms?",
        "author": "lophophorawilliamsii",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qar24/would_selfreplicating_nanobotsrobots_capable_of/",
        "text": "I've been thinking about this for a little while and how it relates to NASA's definition of life: \"A self-sustaining chemical system capable of undergoing Darwinian evolution.\" Say we develop self-replicating nanobots (God forbid) which are capable of self-improvement, differentiation (speciation?) in order to occupy niches or survival strategies, and competition between different \"species\" of nanobots. I don't see how this wouldn't fit the definition of life, but I wanted to get your opinion since I know rather little about the topics involved.",
        "created_utc": 1528733346,
        "upvote_ratio": ""
    },
    {
        "title": "[Novel help] Is it be possible to stage a global (or at least massive) blackout? How?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qao5e/novel_help_is_it_be_possible_to_stage_a_global_or/",
        "text": "[deleted]",
        "created_utc": 1528732779,
        "upvote_ratio": ""
    },
    {
        "title": "Any light reading recommendations for (mis)adventures in the lab?",
        "author": "Acrolith",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qajph/any_light_reading_recommendations_for/",
        "text": "I've recently been having a grand old time with Derek Lowe's [Things I Won't Work With](http://blogs.sciencemag.org/pipeline/archives/category/things-i-wont-work-with) series, and I'd love some more. Are there any good, fun reads (or podcasts, shows, whatever) about wacky science hijinx? It doesn't have to be chemistry, either, just as long as things are going awry and there are people in labcoats yelling and flailing, I'm happy.",
        "created_utc": 1528731869,
        "upvote_ratio": ""
    },
    {
        "title": "Eugenics question. Let’s say you wanted to breed humans to learn faster and retain more.. What tests would you perform to certify breeding approval?",
        "author": "truckerslife",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8qa4p4/eugenics_question_lets_say_you_wanted_to_breed/",
        "text": "",
        "created_utc": 1528728753,
        "upvote_ratio": ""
    },
    {
        "title": "How can I find an obscure (but specific) paper referenced in Wikipedia?",
        "author": "hyletic",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q9oqk/how_can_i_find_an_obscure_but_specific_paper/",
        "text": "There is no standard unique identifier for it. There is obviously no link to the original paper. It also happens to be in a foreign language (German), from the 1990's, and a \"diploma thesis,\" so it may not have even been published. Yet, someone, somewhere, managed to read it since it is being cited in the Wikipedia page.\n\nSpecifically, it is from here: [https://en.wikipedia.org/wiki/Blockout](https://en.wikipedia.org/wiki/Blockout)\n\nNOSS, A. (1994): Förderung der Raumvorstellung bei 10\\- bis 14\\-Jährigen durch das Computerspiel BLOCKOUT. Diploma thesis, [University of Vienna](https://en.wikipedia.org/wiki/University_of_Vienna).\n\nIf anyone can find this particular paper, that would be awesome, although to keep this question general enough to help others, I am also curious about the general procedure one might go through to track down such a paper.\n\nThank you.",
        "created_utc": 1528725144,
        "upvote_ratio": ""
    },
    {
        "title": "Can a light field display be used as a cloaking device?",
        "author": "dinesh_durgam",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q8vht/can_a_light_field_display_be_used_as_a_cloaking/",
        "text": "I was wondering If a light field display screen emits all directional rays exactly as its background to a observer in front of it, would it just work like a cloaking device?",
        "created_utc": 1528717429,
        "upvote_ratio": ""
    },
    {
        "title": "When do you think Nanomedicine and Bionanotechnology reach fruitition/it's full potential ? What things will be possible with it ?",
        "author": "Designer124K",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q7csw/when_do_you_think_nanomedicine_and/",
        "text": "Do you think it would also be able to do things like consciousness transfer ? ",
        "created_utc": 1528698583,
        "upvote_ratio": ""
    },
    {
        "title": "How fast would float into space if gravity went away?",
        "author": "KissAss2909",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q74gu/how_fast_would_float_into_space_if_gravity_went/",
        "text": "I just read a post here it got me thinking.\n\nHow fast would us float*",
        "created_utc": 1528695840,
        "upvote_ratio": ""
    },
    {
        "title": "Is genetic information only active during early development?",
        "author": "jackson-long",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q6nx9/is_genetic_information_only_active_during_early/",
        "text": "I'm no biologist, so this may be obvious. My basic understanding is that the genome gives proteins instructions to create certain parts of us. Are there any pieces of the genome that are constantly feeding information or is it a one-time thing? Basically, If you changed a certain part of the genome, would it begin to change a feature of you quickly, or would this have to be done during fetus development? ",
        "created_utc": 1528690670,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen if gravity disappeared for a second?",
        "author": "TheTostones",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q6aaf/what_would_happen_if_gravity_disappeared_for_a/",
        "text": "Inspired by a drink-filled game night, what would happen if gravity were to simply cease for a very short time? Say, a second for instance. How would heavenly bodies be physically affected themselves? What if the time gravity was down was extended to several minutes or hours or days? Would anything happen to smaller bodies like our own?\n\nApologies for the format, am on mobile, thank you all for your time.",
        "created_utc": 1528686939,
        "upvote_ratio": ""
    },
    {
        "title": "¿What if there was something like this?",
        "author": "gamedoctor46",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q4oo6/what_if_there_was_something_like_this/",
        "text": "[https://youtu.be/k3Kno520uCE?t=16](https://youtu.be/k3Kno520uCE?t=16)\n\nA creature which has evolved to hide.",
        "created_utc": 1528671671,
        "upvote_ratio": ""
    },
    {
        "title": "What would the tectonic plates of Earth look like after a massive impact?",
        "author": "Canamla",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q47vk/what_would_the_tectonic_plates_of_earth_look_like/",
        "text": "But the planet is still intact.Would they just splinter and fragment, would they be pushed into the mantle? What things would need to be considered?\n\nAsking for a concept planet I'm making that had such an impact long ago, but also curious what would happen to Earth.",
        "created_utc": 1528667628,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen to a kid if they didn't have there reproduction organs?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q3wc7/what_would_happen_to_a_kid_if_they_didnt_have/",
        "text": "[deleted]",
        "created_utc": 1528664919,
        "upvote_ratio": ""
    },
    {
        "title": "the Hidden Figures Book?",
        "author": "m0llu",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q3frr/the_hidden_figures_book/",
        "text": "anyone read? I have the regular (not young readers) edition that I would like to gift to my 10 yo niece. She LOVED the movie, saw it twice!!\n\nIs there material in the regular version of the Hidden Figures book that would be inappropriate for a 10 yo to read?\n\nbreaking the rules ;,( please have mercy on me! Or point me in the right direction for this query.",
        "created_utc": 1528661036,
        "upvote_ratio": ""
    },
    {
        "title": "Why is body detox a myth?",
        "author": "vandalsavagecabbage",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q3c41/why_is_body_detox_a_myth/",
        "text": "What exactly is the logic behind it? While I understand the notion that scientists say that your kidneys already do the detox, but I can't fathom why detoxes are bunk. \n\n\nI mean isn't detoxing \"cleaning your body from the inside\"? Just like we shower from outside using soap and clean ourselves, why can't we do that with some  \"green juices\"? If they make us poop, don't we get more cleaner?\n\n\n\nAlso, suppose if a person is constipated or bloated, wouldn't taking green juice or laxative that stimulates bowel movement \"detox\" the intestines, thus cleansing us and making our immune system stronger?",
        "created_utc": 1528660182,
        "upvote_ratio": ""
    },
    {
        "title": "What is the Taxonomy of our Universe from a Physics perspective?",
        "author": "dukerustfield",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q3763/what_is_the_taxonomy_of_our_universe_from_a/",
        "text": "I'm trying to develop a Taxonomy of Objects that composes our universe. Another way of looking at it is an object oriented programming design one level down from Object.\n\n[Taxonomy example](https://i.imgur.com/7n7snzj.jpg) and [Object Oriented programming example](https://eg1s.files.wordpress.com/2015/03/figure2.gif)\n\nSo at the top level, I want to a list of...things that can build all other things that make up our universe. Based on the images above, I'm at the Kingdom level or whatever is just under Object in the programming level. Right now, I've kind of settled on:\n\n* MATTER (Everything from neutrinos to neutron stars to life forms)\n\n* FORCES (strong/weak nuclear, electromagnetism, etc)\n\nMany objects in the universe will be a combination of higher level objects interacting. Such as a computer processor made of (matter) sending around electronic signals (forces). \n\nI'm not sure if SPACE-TIME is an actual thing that builds other things or is merely a consequence of having Matter/Forces existing. Likewise, there are concepts like Entropy and https://en.wikipedia.org/wiki/Laws_of_science\nThat I want to make sure have some kind of representation. On the most basic level, if something happens or exists in our universe, I'd like to be able to point to where its genesis comes from on the universe taxonomy.\n\nAny assistance would be appreciated. Thanks.",
        "created_utc": 1528659003,
        "upvote_ratio": ""
    },
    {
        "title": "How much could CRISPR (or any other genetic modification methods) theoretically modify the human body? Would there be a limit?",
        "author": "BalisticPenguin",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q2a0o/how_much_could_crispr_or_any_other_genetic/",
        "text": "",
        "created_utc": 1528651240,
        "upvote_ratio": ""
    },
    {
        "title": "If instant messages have a weight (data size technically contain a quantum amount of weight), how is it possible it's instant if things with mass can't travel at the speed of light?",
        "author": "T00LBOX",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q1vcn/if_instant_messages_have_a_weight_data_size/",
        "text": "Hopefully this makes sense what I'm trying to ask. Basically its not being relayed via photons but by actual data...say a normal text message is 1kb, On a quantum scale, technically that message contains a mass even if its like a septillionth of a gram. ",
        "created_utc": 1528647724,
        "upvote_ratio": ""
    },
    {
        "title": "Can data, or a particular value contain it's own hash, like MD5, SHA1, etc?",
        "author": "dmanexe",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q1bgt/can_data_or_a_particular_value_contain_its_own/",
        "text": "Curious to know if a file can contain it's own hash. For example, an MD5 sum is a 128-bit representation, or hash, of a value. My question is two-fold, can a file contain it's own checksum and is there a known example of a 128-bit string that is its own MD5 sum?",
        "created_utc": 1528642703,
        "upvote_ratio": ""
    },
    {
        "title": "Best Educational Audio Subscription?",
        "author": "dobbyisafreelf",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/8q0veg/best_educational_audio_subscription/",
        "text": "Hello- \n\nI’m trying to get a Father’s day gift for my dad who is brilliant but didn’t have the opportunity to go to college.\n\nI’m looking for the best subscription and/or flat fee service for college level courses for him to listen to. I did a free trial of The Great Courses via Amazon to see if it would work for him but it looks like it’s only videos. I need something you can listen to while driving or working out where the phone screen can be off. \n\nHe really likes astronomy and history.\n\nAny recommendations would be greatly appreciated!",
        "created_utc": 1528638276,
        "upvote_ratio": ""
    }
]