[
    {
        "title": "Trying to Understand Louis Dumont's view on Individualistic and Holistic society.",
        "author": "Qd2323",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wxwiv/trying_to_understand_louis_dumonts_view_on/",
        "text": "Hello!\n\nI need help trying to understand what exactly Dumont is trying to say in his Essays of Individualism. Mostly:\n\nWhy are holistic and individualistic ideas of society incompatible?\n\nand\n\nHow did we get from a holistic society to a individualistic one? (is it because we started valuing things more than the relationships we had with each other?)\n\n",
        "created_utc": 1518405539,
        "upvote_ratio": ""
    },
    {
        "title": "\"Stand the test of time\" - where did this meme come from?",
        "author": "simus",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wx59h/stand_the_test_of_time_where_did_this_meme_come/",
        "text": "[removed]",
        "created_utc": 1518397707,
        "upvote_ratio": ""
    },
    {
        "title": "Need Help With My Fantasy Book; Cultural Anthropology and Sociology Question",
        "author": "quirkytink",
        "url": "https://www.reddit.com/r/AskAnthropology/comments/7wwgfs/need_help_with_my_fantasy_book_cultural/",
        "text": "",
        "created_utc": 1518391927,
        "upvote_ratio": ""
    },
    {
        "title": "Dividing peoples into barbarian, tribal, and civilized",
        "author": "TRiG_Ireland",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wvv3i/dividing_peoples_into_barbarian_tribal_and/",
        "text": "One of the *Science of Discworld* books divides peoples (or, at least, their myths, legends, and taboos) into three categories: barbarian (think heroes, and the third son succeeding, and the tales wherein you befriend a helpless animal on your way to your quest, and this helps you on your way back), tribal (think arbitrary rules and a strict enforcement of in-group/out-group boundaries), and civilized (the synthesis of the two).\n\nI'm sure that the authors didn't invent these distinctions themselves. They probably did say where they took the ideas from, but I don't have the book to hand.\n\nSo, a couple of questions:\n\n1. Where does the idea of this three-way division come from?\n2. Is it widely supported in the relevant literature (anthropology, I'm guessing)?",
        "created_utc": 1518385666,
        "upvote_ratio": ""
    },
    {
        "title": "Recently Economist Bryan Caplan published a book that claims that education is largely useless. As a layman how do I gauge if his research is correct? What should I pay attention to?",
        "author": "wordboyhere",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wvikf/recently_economist_bryan_caplan_published_a_book/",
        "text": "Link to the book: https://press.princeton.edu/titles/11225.html And a short interview with the author: http://blog.press.princeton.edu/2018/01/23/bryan-caplan-on-the-case-against-education/\n\nWill a labor or education economist eventually critique his book in an academic publication? What sorts of places should I look, to see how well his book is received by the academics in this field? ",
        "created_utc": 1518382586,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good resources for introducing and explaining the concept of privilege to someone? Something with empirical support that’s accessible to a lay-person?",
        "author": "HerbieHancock19",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wv8qo/what_are_some_good_resources_for_introducing_and/",
        "text": "",
        "created_utc": 1518380216,
        "upvote_ratio": ""
    },
    {
        "title": "Why do i keep reliving embarrassing moments?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wubln/why_do_i_keep_reliving_embarrassing_moments/",
        "text": "[removed]",
        "created_utc": 1518372090,
        "upvote_ratio": ""
    },
    {
        "title": "Why didn't Germans settle much of the South when emigrating to the United States?",
        "author": "llcucf80",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wu529/why_didnt_germans_settle_much_of_the_south_when/",
        "text": "That's not entirely true: Germans did emigrate to areas of Texas between San Antonio and Austin (along modern day I35), and some parts of North and South Carolina, and a few other minor exceptions.\n\nBut for the most part Germans, as they emigrated to the United States, mostly in the mid 19th to early 20th Century, settled in the North and Midwest.  With those few minor exceptions above, they largely eschewed much of the South.\n\nWhy?  There just isn't the German culture, and the abundance of Lutheran Churches, in the South as there is in the North.  As a northern transplant into Florida (who is ancestrally German), it's the only thing about Florida I don't like.  I've always wondered why Germans didn't settle much of this area, and if there's a demographic or cultural reason why I'd appreciate the insight.  Thanks.",
        "created_utc": 1518370486,
        "upvote_ratio": ""
    },
    {
        "title": "Help figuring out my sister’s mental illness",
        "author": "tree_mob",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wtzb7/help_figuring_out_my_sisters_mental_illness/",
        "text": "[removed]",
        "created_utc": 1518369060,
        "upvote_ratio": ""
    },
    {
        "title": "Crime in Norway",
        "author": "NLLumi",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7woo6x/crime_in_norway/",
        "text": "I’ve been wondering: are crime rates in Norway high, compared to what would be expected from a country with its economy, education, and immigration policy? I know that Norway has very low recidivism rates thanks to the way it runs its prisons, but I have no idea about first-time offenders. Do the lenient prisons they have not deter would-be criminals less?",
        "created_utc": 1518301147,
        "upvote_ratio": ""
    },
    {
        "title": "What is life like for women of Myanmar?",
        "author": "cleopatra4president",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7womg1/what_is_life_like_for_women_of_myanmar/",
        "text": "[removed]",
        "created_utc": 1518300660,
        "upvote_ratio": ""
    },
    {
        "title": "Some health professionals have long counseled that anal sex [by people of any sexual orientation] is 1) an unhealthy practice and 2) should be avoided. Have concerns over sensitivity and political correctness compelled some of these professionals to self-suppress their message?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wo05o/some_health_professionals_have_long_counseled/",
        "text": "On *askscience* I asked whether there is disagreement over the health impacts of anal sex (and whether there is contention that the practice is not problematic health wise in any way). Have yet not received an answer.\n\nAllied question:  Some media have reported that many American teens are engaging in anal sex to avoid possible pregnancy. Is this correct?  Is there detailed data on this trend?\n\nIs there information on the prevalence of anal sex by teens in the 1950s and before--an era when teen sex of any kind was more infrequent than is the case today?\n\n* * * *\n\nEdited to add.  From NY Times link below.  *Rather a dramatic change.*\n\n&gt;The percentage of 18-to-24-year-old women who reported trying anal sex rose to 40 percent in 2009 from 16 percent in 1992, according to the largest survey on American sexual behavior in decades, co-authored by Herbenick and published in The Journal of Sexual Medicine.\n\nhttps://www.nytimes.com/2018/02/07/magazine/teenagers-learning-online-porn-literacy-sex-education.html?src=trending&amp;module=Ribbon&amp;version=context&amp;region=Header&amp;action=click&amp;contentCollection=Trending&amp;pgtype=article\n\n",
        "created_utc": 1518294769,
        "upvote_ratio": ""
    },
    {
        "title": "Some health professionals have long argued that anal sex [by people of any sexual orientation] is 1) an unhealthy practice and 2) should be avoided. Is it fair to say that concerns over sensitivity and political correctness are compelling these professionals to self-suppress their message?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wnxa3/some_health_professionals_have_long_argued_that/",
        "text": "[deleted]",
        "created_utc": 1518294017,
        "upvote_ratio": ""
    },
    {
        "title": "Any research on keeping maiden name and divorce rates?",
        "author": "pavloviandogg",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wn702/any_research_on_keeping_maiden_name_and_divorce/",
        "text": "Does anyone know of actual research that looks at divorce rates (or any other marital outcomes) and keeping a maiden name? Many people have very strong opinions on this issue, but I'd be curious to know what the research says.",
        "created_utc": 1518287390,
        "upvote_ratio": ""
    },
    {
        "title": "How come even in atheist or secular societies with loose sexuality, females who do prostitution once universally considered a far worse a girl than having multiple partners?",
        "author": "LaxCalvinist",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wmgce/how_come_even_in_atheist_or_secular_societies/",
        "text": "As we all know religion in general frowns upon sex. But there is one thing I cannot understand. How come all prostitution (including legal sex industry avenues such as porn and even non-penetrative business such as webcam) is considered the ultimate evil? But a woman who had multiple partners is considered not as bad (even if she is outcasted)?\n\nIn particular, why is just selling your body once- especially in times of despair where you are so poor you have no options to put food on the table for your family- often deemed as the irredeemable sin that permanently stains a girl as unclean? While having voluntary pleasureful sex (even if it is frowned upon) isn't considered as dirty? About the only other \"mortal sin\" i can think off that is universally considered unforgivable is getting raped.\n\nI can understand looking down on a girl from say a middle class or rich background with a loving family, doing it because she's too lazy or too greedy to get cash \"morally\". But why just even once to feed the family is considered unforgivable? While say having sex with over 50 men purely out of lust not considered as bad?\n\nThis extends even to atheistic societies such as the Soviet Union so religion alone cannot explain it.I mean its still exists that even in loose society where sex is treated as a recreation that also have rising number of atheists (if not are majority atheists) such as France and the United States, even promiscuous women would be ashamed at the thought of selling themselves. Even merely as a mistress to a single man (even if they find them attractive).",
        "created_utc": 1518280715,
        "upvote_ratio": ""
    },
    {
        "title": "How hard is it to resist mob mentality and groupthink (in particular violence against minorities)? Especially for us living the Western world?",
        "author": "Wrangler29",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wme0a/how_hard_is_it_to_resist_mob_mentality_and/",
        "text": "I recently read Hitler's Willing Executioners by Daniel Goldhagen, finishing it today. I also read Comfort Woman: Slave of Destiny by Rosa Henson.\n\nBecause I was raised not only by a libertarian mother but also because I sincerely believed the \"American Dream\" (or at least pop history's interpretation of it), I could not understand why people can be so blindly tribalistic enough to commit rape, riots, and other violence against industrious (and often loyal) minorities, particularly the Jews of Germany, while people tolerate the bad behavior of the worst of society (even if he's doing terrible crimes against members of the tribe such as raping little children). It was simply making my mind explode that a German with blonde blue eyes and other associated Aryan traits should be placed above the loyal Jewish veterans of WWI just because they were deemed pure Aryans and no other reason.\n\nSince I stopped being libertarian upon meeting my father's side of the family and started the process to move to Kentucky, I am wondering about this. One of the things Americans supposedly take pride in-especially the middle class and the educated intellectuals-is that we Americans value rugged individualism so much that a person's worth is in his work ethic and character. That the American Dream states those who come to our country should reap the fruit of their labors and no one should be judged automatically because of their religion, skin color, ethnicity, former nationality, hobbies, race, political party, social class, wealth, etc. They should only be judged on personal character and that this country is a meritocracy, eg a person doesn't rise to a high position because of his family associations but due to his hard work. Or a Muslim should get the promotion because of his educational qualifications which he earned and not the fellow Baptist.\n\n\nHowever as I explore concepts the American Dream advocates scoff at as barbaric and that intellectuals and individualists hold contempt for, I am wondering about one thing. Whenever you see a discussion about how Germans enthusiastically vented their rage on the Jewish populace, you will always see comments about how German people are beneath Americans because Americans have true freedom and the Germans never had or how the populace of Germany is cowardly, etc especially on the internet from conservative (or nationalists) of American origins, libertarians, SJWs, and the proud intellectuals. Particularly is the contempt at how individual Germans who personally oppose antisemitism would suddenly get a rouse to join in on the violence and start stomping on Jewish kids, rip apart clothes of Jewish girls and rape them, etc. Its just not limited to the Germans, the Japanese gets this criticism too. I remember my gym teacher from years ago criticizing the Japanese mentality of conformity to the group and he theorized the reason why Japanese soldiers did Nanking and such was because they were too conformist and scared to rebel against group actions.\n\nHell take a look at Fox News and other mainstream pro-Western media outlet and you'll see similar criticism on Arabian culture and Islam for people \"cowardly sticking with the group\" (as one reporter stated) rather than \"doing whats right\" whenever we see outraged such as honor killing, violence against Christians in the MidEast, etc.\n\nIndeed looking as an outsider, it seems so strange that someone such as a Japanese man with wife and kids at home would enthusiastically drag a tiny 10 year old Korean girl and rape her just because nearby Japanese soldiers were acting rough and rowdy. Or that a man with plenty of Jewish friends would start gunning them down for fun.\n\nI am curious if we Westerners (especially Americans espousing rugged individualism and capitalism) have lost touch of how easy it is to be influenced by groupthink and mob mentality? For example in one book I read about warcrimes, a Serbian man raised under Western capitalistic lifestyle and who lived for years among Bosnians (in addition to at least receiving a high school education from the supposedly well-balanced schools Tito strived to create) suddenly got a rifle and started killing Bosnians as the Yugoslavian Wars was beginning to take place. In particular many Bosnian victims were heartbroken and outraged because they were his customers at his own bars for years before the war. Some of the victims were even close personal friends with the Serbian. However the Serbian just kept killing and killing and killing. Even more terrifying is how Serbs who were already married participating in the rape camps, particularly an account of a Serbian officer selecting a specific Muslim girl and raping her more than 10X a day for almost six years as the war was being waged for every single day since her captive. Yes the same man (with a wedding ring on his hand and even the victim witnessing him talking to his visiting children happily just before the next rape).\n\nGoldhagen's Hitler's Willing Executioners have many similar accounts of normal German young adults and boys having no personal animosity against Jews but upon wearing a uniform and being ordered to participate in the Holocaust, became zealots about killing Jews. Many of them even turning it into betting games such as awarding winners who had the most kills withing a certain time with a bottle of wine or by tying a Jewish child miles away and than showing off their marksman skills to wind a few cash, etc. In addition Rosa Henson's autobiography describes how a 30 year old officer (with lover at home) enthusiastically joined a rape attempt initiated by lower ranked Japanese soldiers who were trying to tear her clothes off and many of her daily life in a brothel she would see Japanese soldiers talking with each other as close friends, showing off photos of relatives or wedding rings for their fiances, etc. Some of these soldiers weren't even enthusiastic when they entered the room to rape her until other soldiers began to knock on the door and make criticisms (I won't even go to what they said because its terrifying). What were soldiers who were merely there because their friends told them they'd meet at the location suddenly became frenzies rapists who genuinely enjoyed raping Henson (despite having hesitations before their friends told them to hurry up). These guys really had no intense to rape girl who just turned 14 and were even hesitant despite peer pressure initially.\n\n\nLooking at how many normal people (some even well-educated such as the officer who raped Henson), I am wondering if its easy to resist mob mentality and groupthink as many people would often claim in discussions in the manner of \"I would never do that!\" or \"are these people a bunch of weak minded fools?\" that you often see in internet forums and from people proud of their individualism and intellectualism. What makes it that people who are normally nice guys would suddenly develop unbelievable hatred in seconds that they'd sodomize an eight year old just because the people around him hate the eight year old for being a Yazidi?\n\nIs it easy to resist this as many of us in the West would yell out how wrong it is? Is it just wishful thinking to yell out \"I would never rape a girl!\" because there's a Chinese girl and everyone in the building hates Chinese people?\n\nThe American Dream and other similar humanistic ideals and concept makes it so hard for me to believe I would ever get a shotgun and start gunning down a Buddhist child because most American's develop hatred for Buddhist. Nor can I imagine raping a Ukranian because the government tells me Ukranians are subhuman. But I wonder if I would fall for the same thing the aforementioned groups above (especially the Nazis) did and commit such crimes against humanity?\n",
        "created_utc": 1518280068,
        "upvote_ratio": ""
    },
    {
        "title": "How come in many communitarian tribalist cultures (particularly non-Western and \"backwards\" ones) they chant songs of praises when someone sacrifices his life for the cause rather than weep?",
        "author": "SFGroggy",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wmblu/how_come_in_many_communitarian_tribalist_cultures/",
        "text": "Years ago I remember reading about how after a Palestinian young man got into a firefight with Israeli soldiers and got killed from M16 rounds, his family began to shout out in joy how the young man gave his life up for the community and proceeded to have a festival. They were GLAD to see their eldest son DIE!\n\nAt first I thought it was a non-Western mentality because in addition to Middle Eastern terrorists, I remember Japanese mothers rather than weeping were simply calm and happy after the news of their sons death took out an American battleship during World War II. Indeed there are many cases of treating it calmly as Japanese men were dying by the tens of thousands while their wives, mothers, and lovers were simply drinking tea at home and smiling as they invited the mailman, military official, or whoever arrived to send the news to drink tea in the living room.\n\nHowever..... I remember in Gone With the Wind when Scarlett was worried that Ashley was in one of the most dangerous PoW camps that he might die, Melanie responded she was proud to know Ashley will die for the Southern cause. Scarlett who was in love with Ashley could not understand how Melanie-who was Ashley's wife and claims to have loved him with all her heart as a good wife should- is not in terror that he might not come back alive.\n\nIn Medieval literature,a common theme is when knights go off to fight pagans such as in the Song of Roland, rather than being in dread, their fathers and mothers remain calm and stoic at the possibility of death. Once news arrive after a battle that Sir Lancelot had fallen in battle, they begin to prepare a big party for the event of the death of the young knight and the parents begin to sing out a song they just came up in an instant to praise the dead knight. Which as their echoes get heard throughout the castle, other servants from the king's personal generals to a spearman to peasants who clean the latrine, they begin to join on singing the song. The parents who are the lords of this castle actually end the song out with a chant \"he gave his life for the name of defending God!\" or something akin to this. Which has scary parallels towards the Palestinian man who got killed in a firefight and his Muslim family having a grand feast afterwards.\n\nBasically showing this isn't exclusive to Eastern cultures but was once a part of the Western mentality.\n\nBut I am curious why do people not only in \"backwards\" non-Western cultures (pre-WWII Japan and most Arabic countries as examples) but also even in Western cultures before the rise of modern secularism and democracy have this psychology? Of rather than weeping they treat it like its a great thing their sons have died for a cause?\n\nEven the comparatively more civilized Ancient Greeks and Romans (when compared to their Medieval European counterparts) who valued democracy as a basic ideal treated the dying of young men for their city states (in the case of Greece) or the Roman Republic and later Empire as something to take joy in and celebrate about.\n\nWhere as modern cultures starting in the 1700s weeping and sadness is now considered the norm. Anyone who thinks its a great thing to send their son to Vietnam and than appear smiling and boasting in public that Bobby came back in a bodybag especially at the funeral would be seen as cruel, if not outright insane. Even deaths of fellow friends in the modern battlefield of the 21st centuries while guns are shooting and artillery shells are landing around can make even the toughest special forces weep in the middle of battle (even if he still continues to fight despite tears streaming).\n\nI mean to read in the Songs of El Cid about a knight just calmly maintaining formation without either tears oar anger and even stoically being proud he saw his dearest childhood peasant friend get beheaded is just CHILLING and makes me see the knights in this poems as terrorists on the level of Bin Laden in ruthlessness rather than defenders of civilization and freedom.\n\nWhat is the logic behind this mentality? What exactly happened in Western culture that removed this backward savage \"songs of joy\" after the death of a beloved member who sacrificed his life for the cause?\n\nAnd why do many cultures on outside of the West still maintain this mindset despite vast changes in technology and to a degree social structure? As seen in many African and Middle Eastern countries?",
        "created_utc": 1518279395,
        "upvote_ratio": ""
    },
    {
        "title": "\"Universal designated subordinate support roles\" supposedly help productivity. Are there such roles in the course of academic social science?",
        "author": "MonksMoodStabilizer",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wmaor/universal_designated_subordinate_support_roles/",
        "text": "I geometrically think of the status quo of responsibility distribution in a wide number of things as like a bart simpson blob: little peak spikes of centralized responsibility at the top, and a mess interrelated subordination underneath. I think a less messy way is a smoother tall trapezoid with an inverted equilateral triangle within it at the top with the top of the trapezoid representing the base of the triangle. I consider this the relationship of the plateau of the trapezoid to the inner peak of the triangle a smoother distribution of responsibility of leaders with a \"universal designated subordinate support role\", basically a fancy universal helper. This would be a lot less wordy if I could just show you a graph, but it's harder to post picture on mobile.\n\nThis is what I learned from Adam Grant's talk on givers and takers on TED, although to my knowledge the shapes thing is mine. He gave the example of nurse floors where there's was a wide distribution of work, and floors where one nurse was designate to support the others. The nurse floors with the designated support role were more productive.\n\nMy question is, is such a universal designated support role used in the course of academic social science?\n\nContrast a few things. First the idea of students doing this in RA work. I never was an RA, but I don't think the RAs are universal. This is still the bart simpson blob. Contrast also the idea of a leader to whom the researchers defer to for their research. That is just silly and is more like a full on triangle. In terms of the mind, the designated support role is more like a homunculi than the seat of the soul. It handles part of all the work.\n\nI'm curious about this because I love academia and wish I could support the work in a stimulating way, but while I think I could become a researcher if I tried, I have no inclination to do that work. It would be more interesting to me to cooperate on problems and take researcher's problems and find interesting solutions.\n\nMy background is in psychology.",
        "created_utc": 1518279131,
        "upvote_ratio": ""
    },
    {
        "title": "What determines your sense of humor?",
        "author": "Felicia_Svilling",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wlo4w/what_determines_your_sense_of_humor/",
        "text": "More specifically which is more important your parents or your peers?",
        "created_utc": 1518272429,
        "upvote_ratio": ""
    },
    {
        "title": "Sociology: does anyone know of any analysis or graphs that shows what's the correlation between property and/or violent crime to per capita income?",
        "author": "curiousone6151",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wjow7/sociology_does_anyone_know_of_any_analysis_or/",
        "text": "Sociology: does anyone know of any analysis or graphs that shows what's the correlation between property and/or violent crime to per capita income?",
        "created_utc": 1518241679,
        "upvote_ratio": ""
    },
    {
        "title": "Why are all /r/blunderyears submissions by white people?",
        "author": "OhCanDo",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wjk53/why_are_all_rblunderyears_submissions_by_white/",
        "text": "[removed]",
        "created_utc": 1518240021,
        "upvote_ratio": ""
    },
    {
        "title": "Is personal responsibility really the only factor for a unhealthy lifestyle?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wiia4/is_personal_responsibility_really_the_only_factor/",
        "text": "People say that the companies and ads or anything else aren't responsible, only I'm responsible for my unhealthy lifestyle. I accept that but I'm skeptical that my responsibility is the sole factor here.",
        "created_utc": 1518228050,
        "upvote_ratio": ""
    },
    {
        "title": "Why did we agree on the term \"Transgender\"?",
        "author": "The_Magic",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7whrzv/why_did_we_agree_on_the_term_transgender/",
        "text": "So in Sociology I was taught that gender is connected to identity and sex is connected to biology.  So if a trans person always identified as the opposite sex wouldn't the act of transitioning (hormones and genital operations) be more about changing sex than gender?  ",
        "created_utc": 1518220843,
        "upvote_ratio": ""
    },
    {
        "title": "Why is North Korea making friendly overtures toward South Korea all of the sudden, after decades of animosity?",
        "author": "skurvecchio",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wgupq/why_is_north_korea_making_friendly_overtures/",
        "text": "Hopefully this is definite enough for this subreddit, even though it's an open political science question.",
        "created_utc": 1518212392,
        "upvote_ratio": ""
    },
    {
        "title": "Have people always known that a child has one father and one mother? x-post AskAnthropology x-post r/AskHistorians",
        "author": "Randomname64",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wgq5z/have_people_always_known_that_a_child_has_one/",
        "text": "Did people generally know that sex lead to pregnancies? And, if they did, how exactly did they assume the parties were involved with the generative process. \n\nI've heard, for example, that Darwin effectively thought that sperm contained homunculi in each sperm. Although I don't know what he thought ovum contained. And I swear I've heard someone say that Aristotle thought that women were effectively soil for a child to grow in but did not necessarily attribute to them much power over the traits of the children.  \n\nDid people think that both men and women contributed equally to traits and characteristics of the child? Did they think multiple men could (either through intercourse with the mother or through some other process) or did they think that other women could (through co-nursing or something)? \n\nThis is a rather broad question and I assume that it will vary from place to place and time to time.",
        "created_utc": 1518211286,
        "upvote_ratio": ""
    },
    {
        "title": "What to do with the questions asked when writing up a social survey?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wern8/what_to_do_with_the_questions_asked_when_writing/",
        "text": "[deleted]",
        "created_utc": 1518195234,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | February 09, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wdmlm/friday_freeforall_february_09_2018/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1518185157,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research and/or data that demonstrates (or not) that, in Western Europe, Muslims are disproportionately the perpetrators of violence against LGBTQ folks?",
        "author": "iworkwithbirds",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wc5wa/is_there_any_research_andor_data_that/",
        "text": "I honestly don't mean to start any unpleasant discussion; I just want to know the truth!",
        "created_utc": 1518165718,
        "upvote_ratio": ""
    },
    {
        "title": "When someone doesn't grow up on being exposed to advertising, are they genrally more likely to be exploited than those who have more experience with advertising?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7wc26t/when_someone_doesnt_grow_up_on_being_exposed_to/",
        "text": "Let's say Bob grew up without being exposed to advertising, then one day he is exposed to advertisements, does he fall for them easier than Dave who grew up on being exposed to advertising?",
        "created_utc": 1518164099,
        "upvote_ratio": ""
    },
    {
        "title": "The difference between disease, illness and sickness, and the importance of cultural competency?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7w8v23/the_difference_between_disease_illness_and/",
        "text": "[deleted]",
        "created_utc": 1518129848,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research that shows company movement in the wake of Regan's tax reform?",
        "author": "InquisitivePrincess",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7w7nu0/is_there_any_research_that_shows_company_movement/",
        "text": "Similar to this one here: https://finance.yahoo.com/news/81-companies-announce-wage-hikes-bonuses-afterglow-trump-tax-reform-171148283.html",
        "created_utc": 1518120204,
        "upvote_ratio": ""
    },
    {
        "title": "Was there a famous psychologist who shot someone in the face when they were a child?",
        "author": "starsickles",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7w5glv/was_there_a_famous_psychologist_who_shot_someone/",
        "text": "[removed]",
        "created_utc": 1518102976,
        "upvote_ratio": ""
    },
    {
        "title": "Does the Labour Theory of Value conflict with the Subjective Theory of Value?",
        "author": "SuperHans30",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7w4g7k/does_the_labour_theory_of_value_conflict_with_the/",
        "text": "Or they actually coincide with one another?",
        "created_utc": 1518093044,
        "upvote_ratio": ""
    },
    {
        "title": "Is cultural appropriation really the evil it's often made out to be?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vz5hj/is_cultural_appropriation_really_the_evil_its/",
        "text": "[removed]",
        "created_utc": 1518035433,
        "upvote_ratio": ""
    },
    {
        "title": "How long does the average person's bathroom visit last while pooping?",
        "author": "throwawayforpoops2",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vx67e/how_long_does_the_average_persons_bathroom_visit/",
        "text": "[removed]",
        "created_utc": 1518020064,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | February 07, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vwajf/theory_wednesday_february_07_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1518012372,
        "upvote_ratio": ""
    },
    {
        "title": "Age of the Dumb Epiphany",
        "author": "KaikoLeaflock",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vs03z/age_of_the_dumb_epiphany/",
        "text": "I had an armchair thought and wanted direction to explore the idea. I apologize if this is the wrong area. I just wanted to find the correct term and further reading I could do.\n\nIt seems common in the US (at least) that our society is pushed forward by experts in various fields, but that expertise is not valued in the sense that it seems difficult to comprehend summarizing the life's work of every scientist, engineer, etc . . . of every type and field and teach it to the masses.\n\nThus, while we are pushed forward scientifically and technologically, those accomplishments are cherry picked and misunderstood, probably most often through ignorance, in order to make a point - the wrong point or a misconceived point.\n\nExamples would be, something like realizing televised news is bias and therefore using different sources such as various radical talk radios - a dumb epiphany.\n\nAny sort of pseudo-intellectual (like me) coming to a conclusion without fully understanding how to support that view or how that view is illogical through bias.\n\nFlat earthers.\n\nI'm obviously completely out of my element, but if someone could maybe point me into authors who might educate me about what this sort of thing is - if there is a name - or if they have a critique of how I can make what I'm looking for more clear. Maybe I'm having a dumb epiphany myself. Thanks\n\nAnswers:\n\nMassimo Pigliucci's Nonsense on Stilts\n\nTom Nichols’ The Death of Expertise: The Campaign Against Established Knowledge and Why it Matters\n\nFriedrich Hayek's essay The Intellectuals and Socialism\n\n\"epistemology of ignorance\" as described by Charles W. Mills in the book The Racial Contract\n\nThanks for all the great responses!\n\nEdit: added answers from the responses in no particular order",
        "created_utc": 1517962656,
        "upvote_ratio": ""
    },
    {
        "title": "What are the demographic characteristics of people in America who don't reproduce?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vrbxy/what_are_the_demographic_characteristics_of/",
        "text": "[deleted]",
        "created_utc": 1517956839,
        "upvote_ratio": ""
    },
    {
        "title": "How do contemporary developments in technology affect human cultural diversity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vqul4/how_do_contemporary_developments_in_technology/",
        "text": "[removed]",
        "created_utc": 1517953003,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent can a local currency generate economic power to the locality?",
        "author": "VitorMaGon",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7voaj1/to_what_extent_can_a_local_currency_generate/",
        "text": "I'm not sure this is the right /r.\nAnyway, I'm doing a master's project around time banks.\nSo I'd like to know if anybody has tips on literature about this.\nThank you!\nP.s: Its a master's on communication technologies so I'll only touch this subject superficially, if even. Still, personally curious.",
        "created_utc": 1517932966,
        "upvote_ratio": ""
    },
    {
        "title": "Examples of the Thomas Theorem in cyberspace?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vidmu/examples_of_the_thomas_theorem_in_cyberspace/",
        "text": "[deleted]",
        "created_utc": 1517867909,
        "upvote_ratio": ""
    },
    {
        "title": "Health consequences of military service?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vggp1/health_consequences_of_military_service/",
        "text": "[deleted]",
        "created_utc": 1517852743,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | February 05, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vexyt/monday_reading_and_research_february_05_2018/",
        "text": "[removed]",
        "created_utc": 1517839567,
        "upvote_ratio": ""
    },
    {
        "title": "How important is pop culture in changing society, for better or worse?",
        "author": "hr1989",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vd2tz/how_important_is_pop_culture_in_changing_society/",
        "text": "Not sure if this is the right place, but I want to know peoples opinion on how pop culture, whether it be from the movies we see in the cinema, to the music we listen to, to the celebrities that we follow on social media, can affect the society we live in.\n\nFor example, how important are the #Metoo/#timesup campaigns to changing the way we treat women in society. Clearly there are some great organisations who have been advocating for women rights/equality, but does the world need these messages to come out in pop culture for us to take better note of them....",
        "created_utc": 1517813982,
        "upvote_ratio": ""
    },
    {
        "title": "A Couple of Questions Concerning Regression Toward the Mean",
        "author": "mathmare",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7vd2md/a_couple_of_questions_concerning_regression/",
        "text": "Hey guys, I have a question about applying the idea of regression toward the mean. But before I begin, please note that I'm still learning how to statistics, and if I misuse any vocabulary, feel free to correct me.\n\n### Key Notions\n\nLet's just set some basic ideas in stats to make sure we're all on the same page\\*\n\n* An __outcome__ is a result of a probabilistic experiment.\n* A __random variable__ is a quantitative thing that represents the possible outcomes within the set of all outcomes.\n* A __probability distribution__ is a function that maps a random variable to a probability. Its range is always [0, 1]. \n* Finally, __regression toward the mean__ is the notion that, when performing an experiment, if you get an outcome that is extremely far from the expected value of the probability distribution, you will most likely get an outcome closer to the mean on your second experiment.\n\n\\* *like I said: if I misused any terms, please let me know in the comment section*\n\n### Question 1: Can Regression Toward The Mean Be Applied to Individuals?\n\nSo I'm sure that all of us here are aware that randomness plays an important part in what happens in our lives. Test scores are a common example, when a group of students do poorly on a test, plain ol' bad luck usually plays an important role. We then apply some treatment to the failing group, and then their scores \"regress\" towards the mean.\n\n[This article](https://www.socialresearchmethods.net/kb/regrmean.php) (assuming I'm interpreting in correctly) gives an example of regression toward the mean with groups of students and their exams. I want to know if this concept can be applied to individual people.\n\nFor example, suppose I am interested in a students typing ability. Let's call our hypothetical student 'Bob', and I measure Bob's typing ability with [Mavis Beacon](http://www.broderbund.com/c-33-mavis-beacon.aspx) and record a number of interval scores that I can use for modelling purposes.\n\nAssuming a normal distribution, would it be appropriate to calculate a mean and variance (with a sufficient ** *n* ** of course) specifically for Bob, and then work out probabilities (like what's **P(Bob's typing ability &gt;= 60)**), as long as we're just dealing with Bob and no one else?\n\n### Question 2: Is This An Appropriate Example?\n\nOkay, so when I have casual discussions with people, sometimes 'regression toward the mean' comes up. I'm trying to come up with examples to explain it to them*.\n\nHere's one:\n\n&gt; Imagine having a pair of dice with outcomes ranging from 1 - 6. When you cast them, you're most likely going to get a *Lucky 7*. Likewise, you're least likely to roll *snake eyes*. But rolling snake eyes is still possible, but when you roll them again, you're more likely to get an outcome that's closer to the *Lucky 7*. This is \n\nSo, is this a good example? And if not, is there a better one**?\n\n\\* and I also tell them to talk to a stats professor cos' s/he would know more about it than me \n\n\\** if my analogy works, still post yours cos' I like hearing what others come up with ;-)",
        "created_utc": 1517813912,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any data available on how often people get sick?",
        "author": "youcanteatbullets",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v6x2b/is_there_any_data_available_on_how_often_people/",
        "text": "I know there's is lots of prevelance and incidence data for any specific disease; I can look up how many people are affected by the cold, flu, sprained ankle, or whatever each year/lifetime. What I'm wondering about is phrasing this data in a different way: How many days per year does the average person feel \"sick\" (according to any definition)?",
        "created_utc": 1517753566,
        "upvote_ratio": ""
    },
    {
        "title": "Where would NEETs fall in Merton's deviance typology? Conformity? Innovation? Retreatism? Rebellion?",
        "author": "BadShitCrayfish",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v5wik/where_would_neets_fall_in_mertons_deviance/",
        "text": "Here are a group of people who by and large accept the cultural goals, and are often wrestling with themselves over not being able to achieve those goals. \n\nThey accept the cultural goals and the institutionalized means of achieving those goals, most of them are just afraid, either of socializing with others, or of failure.",
        "created_utc": 1517737450,
        "upvote_ratio": ""
    },
    {
        "title": "How accurate are \"World Population\" estimates?",
        "author": "StateofWA",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v5ocw/how_accurate_are_world_population_estimates/",
        "text": "The reason I ask: I took an East Asian History class at Eastern Washington University from Dr. Ed Slack a few years back and he said that the population of China, which I think was about 1.1bn at the time, was more like ~1.5bn because the census in China is apparently very inaccurate.\n\nThis, along with other inaccuracies by states, refugees, war, etc., makes me wonder how many people could there possibly be in the world right now?",
        "created_utc": 1517733300,
        "upvote_ratio": ""
    },
    {
        "title": "Question for a social sciences school assignment",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v2p7l/question_for_a_social_sciences_school_assignment/",
        "text": "[removed]",
        "created_utc": 1517697777,
        "upvote_ratio": ""
    },
    {
        "title": "Veteran suicide rates in the US seem shockingly high. But how do these rates compare to non-veteran men from the same generation?",
        "author": "Vladith",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v2f8t/veteran_suicide_rates_in_the_us_seem_shockingly/",
        "text": "Suicide rates of veterans are [around double](http://www.cnn.com/2013/09/21/us/22-veteran-suicides-a-day/) that of the general public. In addition, there is constant reporting about[ rising suicide rates of older men.](https://www.huffingtonpost.com/lata-k-mcginn/depression-and-suicide-am_b_5699413.html) The US Department of Veterans Affairs reports that 65% of veterans who kill themselves are [over 50.](https://www.va.gov/opa/pressrel/pressrelease.cfm?id=2951)\n\nThis is a difficult question and I do not mean to diminish the tragedy of veteran suicide - but how much of veterans' high suicide rates is explained by the likelihood of veterans to be older men?",
        "created_utc": 1517695122,
        "upvote_ratio": ""
    },
    {
        "title": "If women are responsible for 80% of consumer purchasing and financial decisions, how are they oppressed?",
        "author": "THEnimble_mongoose",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v2eq8/if_women_are_responsible_for_80_of_consumer/",
        "text": "[removed]",
        "created_utc": 1517694981,
        "upvote_ratio": ""
    },
    {
        "title": "Could there be an accurate study for how many convert to a different religion and at what rate?",
        "author": "cronos844",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7v1xdc/could_there_be_an_accurate_study_for_how_many/",
        "text": "Not a specific religion, just religious conversion in general. For example a person who was once Protestant becoming catholic, and an catholic becoming Mormon, and a Mormon becoming Buddhist, and a Buddhist becoming Confucian, would count as a rate of 4 converts to a religion. However a Mormon being excommunicated or leaving the church without picking up another religion would count as a loss to converts to a religion, so that would be a rate of 3. Finally, an atheist becoming catholic would count as a conversion which would bring the total back up to 4.\n\nHas there been any general study such as this? What about in particular (one religion and several regions, one religion and several regions, or one religion and one region)?",
        "created_utc": 1517690347,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any difference between how drug addiction affects the wealthy vs the poor or middle class? Are wealthier people more or less likely to be addicted to substances?",
        "author": "Moontouch",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7uxqk0/is_there_any_difference_between_how_drug/",
        "text": "",
        "created_utc": 1517638932,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any difference between how drug addiction affects the wealthy vs the rich? Are wealthier people more or less likely to be addicted to substances?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7uxl9w/is_there_any_difference_between_how_drug/",
        "text": "[deleted]",
        "created_utc": 1517636939,
        "upvote_ratio": ""
    },
    {
        "title": "Are you aware of any theories which invert realist IR reasoning?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ut1o1/are_you_aware_of_any_theories_which_invert/",
        "text": "[deleted]",
        "created_utc": 1517593608,
        "upvote_ratio": ""
    },
    {
        "title": "We know that developing countries can develop rapidly by “leapfrogging” with modern technology. How can we help them leapfrog culturally?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7usx3b/we_know_that_developing_countries_can_develop/",
        "text": "[removed]",
        "created_utc": 1517592620,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | February 02, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7urhyo/friday_freeforall_february_02_2018/",
        "text": "This is for social science related outpourings that are not necessarily questions. Minor questions that you feel don't need or merit their own threads are welcome too. Discovered a great new book, documentary, article, or blog? Has your Ph.D. application been successful? Did you get published? Have you made an sociological discovery while at the supermarket? Did you find an anecdote about Milton Freedman telling a joke to B. F. Skinner? Tell us all about it.\n\nModeration in this thread will be virtually non-existent -- jokes, anecdotes, and light-hearted banter are welcome.\n\nIt's Friday, Friday. Gotta get down on Friday.",
        "created_utc": 1517580350,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I learn more about k pop and racism?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7upqy7/where_can_i_learn_more_about_k_pop_and_racism/",
        "text": "",
        "created_utc": 1517556844,
        "upvote_ratio": ""
    },
    {
        "title": "Any good articles about religion and identity?",
        "author": "ApproximatelyHuman",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7un18d/any_good_articles_about_religion_and_identity/",
        "text": "Hello, I am looking for a good article on religion and identity. I know there are tons of articles about the intersections of identity and religion but I'd love to know if there is anything that really stood out for you. Thanks!!",
        "created_utc": 1517527664,
        "upvote_ratio": ""
    },
    {
        "title": "An interesting discussion.",
        "author": "CarolStott",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ujgt5/an_interesting_discussion/",
        "text": "[removed]",
        "created_utc": 1517498846,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about deaf individuals and travel/bilingualness",
        "author": "Me_for_President",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7udn21/questions_about_deaf_individuals_and/",
        "text": "Not sure if this is the right sub for this, but I was wondering if anyone has any information on these two questions:\n\n1. Relative to the general population, how common is it for deaf individuals in a wealthy nation like the US to be fluent in the sign language of another country/culture?\n\n2. Similarly, assuming comparable socioeconomic levels as those of their cohorts, do deaf individuals travel more or less? (I guess that could be for both intra- and international travel.)",
        "created_utc": 1517435750,
        "upvote_ratio": ""
    },
    {
        "title": "What serious structural adjustments can raise birth rates in developed countries?",
        "author": "ponchoman275",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7uc7jy/what_serious_structural_adjustments_can_raise/",
        "text": "It seems to be a general rule that the more advanced a country is the lower it's birth rate becomes. In the most developed countries (and even some still developing countries like Iran) this number falls below the replacement level of 2,1 which is the number of children an average woman needs to have for the population be stable. Most developed countries are well below that number with the exception of Ireland and maybe France.\n\nLow birth rates and the greying of the population have far reaching negative effects on the stability of pension systems, the state of the economy, the dynamism of society, the political landscape and even national security.\n\nWhat are some policies that countries can pursue to raise the birth rate to at least replacement level? I'm mainly looking for large structural changes as the usual ''easy'' policies such as benefits, tax cuts, better childcare availability, a few days of paternity leave etc. only seem to improve the birth rate by a very small amount.\n\nMy personal solution would be mandatory splitting up parental leave where the mother and father have to spend the same amount of days with the child. This would share the burden of raising the child equally between the parents and remove the discrimination of women in the workplace since they are currently less attractive workers then men at a certain age since the employer expects them to go on maternity whereas the men currently overwhelmingly don't. This is the only serious structural adjustment that comes to mind, but I fear it might even lead to lower birthrates, at least in the short term as if men don't accept their new responsibility.",
        "created_utc": 1517424660,
        "upvote_ratio": ""
    },
    {
        "title": "Hello, I'm searching some scientific publication about local sexuality in different countries knowing that that behaviour doesn't repeat as the same in every culture, for now i have enough about latinamerica, but northamerica and europe are missing. I'll be thankfull",
        "author": "misslittlecat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ub5k8/hello_im_searching_some_scientific_publication/",
        "text": "",
        "created_utc": 1517416526,
        "upvote_ratio": ""
    },
    {
        "title": "Quick question - Social Psychology",
        "author": "mikcsuli",
        "url": "https://www.reddit.com/r/socialpsychology/comments/7uaawu/quick_question/",
        "text": "",
        "created_utc": 1517410095,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | January 31, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ua3pt/theory_wednesday_january_31_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1517407584,
        "upvote_ratio": ""
    },
    {
        "title": "Has the supposed relation between market price and the Socially necessary labor time (SNLT) for it's production ever been empirically tested?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7u9l64/has_the_supposed_relation_between_market_price/",
        "text": "",
        "created_utc": 1517402232,
        "upvote_ratio": ""
    },
    {
        "title": "When the last medical revolution happened the average per capita GDP of developed countries was $10k. About 6 billion people live in poorer regions. Does that mean an era of medical innovation is certain when the rest of the world crosses this threshold?",
        "author": "wordboyhere",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7u392t/when_the_last_medical_revolution_happened_the/",
        "text": "Most medical advancements like antibiotics and Xrays were developed or refined in western countries 50-70 years ago when the average gdp per capita was 10k. As it stands most of the world makes below this amount. \n\nWhen they catch up, won't that mean an extra 6-8 billion people that will want to buy and research drugs? Does that mean there is another medical revolution in the near future?  ",
        "created_utc": 1517338041,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Mongolia free, when it it surrounded by two non free states?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tzxdl/why_is_mongolia_free_when_it_it_surrounded_by_two/",
        "text": "[removed]",
        "created_utc": 1517305263,
        "upvote_ratio": ""
    },
    {
        "title": "Are Land Trusts Bullshit or Legit?",
        "author": "GreenBlueGirl",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tysxa/are_land_trusts_bullshit_or_legit/",
        "text": "I thought I'd find tons of links online about Portland and California's Land Trusts, but I surprisingly didn't. Please help - trying to evaluate this method specifically as a way to reduce the spike of gentrification (where residents get pushed out/priced out of neighborhoods as new apartments and real estate increase beyond their budget).",
        "created_utc": 1517290105,
        "upvote_ratio": ""
    },
    {
        "title": "SOCIAL SCIENCE PERSPECTIVE",
        "author": "camilo025",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tyc8x/social_science_perspective/",
        "text": "[removed]",
        "created_utc": 1517285049,
        "upvote_ratio": ""
    },
    {
        "title": "What do we know about the perpetrators of rape?",
        "author": "mar_sh23",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tvrqd/what_do_we_know_about_the_perpetrators_of_rape/",
        "text": "In recent years and especially since #MeToo there has been an increase in attention paid to rape and sexual violence. But the talk has been almost exclusively about the victims (at least in the media). But obviously victims can't explain *why* this violence happens. So it seems to me, to understand *why* more attention has to be paid to the perpetrators...\n\nSome aspects that would interest me are:\n\n* Why do men (and occasionally women) rape? Is about lust, aggression,...?\n\n*  Are there \"typical\" rapists/ Are there \"common\" elements in their biographies, like personality disorders or histories of abuse?\n\n\n* Are rapists likely to be serial perpetrators or one-time-offenders?\n\n* What is the prevalence of rapists? In the media there often numbers of 10-20% of women having experienced (attempted) rape. Is the percentage of perpetrators similarly high or lower, because of repeat offenders?\n\n",
        "created_utc": 1517261663,
        "upvote_ratio": ""
    },
    {
        "title": "need some extra insight on this question",
        "author": "Inhaleexhale8828",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tsv2l/need_some_extra_insight_on_this_question/",
        "text": " society is ever-present (no man/woman is an island or truly ever lives “alone”) then why do you think U.S. culture traditionally places such emphasis on “the individual”? Why not community or the society at large?",
        "created_utc": 1517238260,
        "upvote_ratio": ""
    },
    {
        "title": "Monday Reading and Research | January 29, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tsi0o/monday_reading_and_research_january_29_2018/",
        "text": "[removed]",
        "created_utc": 1517234738,
        "upvote_ratio": ""
    },
    {
        "title": "When did Chilli peppers become part of global cuisine?",
        "author": "SoybeanCola1933",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tqk9p/when_did_chilli_peppers_become_part_of_global/",
        "text": "Chilli pepper originates in Central-South America and was only introduced to Europe, Asia and Africa in the last few centuries. Today, Chillis form an integral part of Indian, Chinese, African cuisine. When did this start?",
        "created_utc": 1517208833,
        "upvote_ratio": ""
    },
    {
        "title": "What is the origin of homophobia that was a socially accepted belief that was passed on for generations and how did preserve strongly for so long?",
        "author": "sammyjamez",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tnm9d/what_is_the_origin_of_homophobia_that_was_a/",
        "text": "The socially accepted norm and idea that homosexuality or any other sexuality that did not involve heterosexuality was a dominant mentality that stayed for generations and ironically, there were some eras in history where homosexuality or LGBT sexuality was not really treated with contempt and disgust like in ancient Greece.\n\nDespite the recent yet slow change and awareness of this mentality and slow acceptance of LGBTQIA rights among many people around the world *(and not just by people who were already familiar that being gay and not-hetero was not a deviant behaviour)*, homophobia still exists in some regard and even held strongly in some countries.\n\nMy question is how this mentality originated and how this has been shared and supported generally for many generations and also among many different cultures regardless of their religions/beliefs, nationalities, philosophies and so on",
        "created_utc": 1517178145,
        "upvote_ratio": ""
    },
    {
        "title": "How often do philosophers and social scientists work together/collaborate?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tn1eq/how_often_do_philosophers_and_social_scientists/",
        "text": "[deleted]",
        "created_utc": 1517172983,
        "upvote_ratio": ""
    },
    {
        "title": "To what degree are sociological models and theories falsifiable?",
        "author": "benjaminikuta",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tknlq/to_what_degree_are_sociological_models_and/",
        "text": "[removed]",
        "created_utc": 1517151418,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't everyone treated equally?",
        "author": "HiddenGhost14",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tk714/why_isnt_everyone_treated_equally/",
        "text": "Sorry if this is not the right place to ask this, but I am looking for an answer, and this sub-reddit seemed most related.\n\nWhy are there still racist, sexist, xenophobic, homophobic, and related ideas which still get passed around? I imagine that today's world isn't the first one to try and talk about/answer these questions. But I cannot remember a day where these topics aren't regularly being discussed. It's almost as if nobody really want these problems to be solved, and its better to just talk about then without trying to get to a solution.\n\nSorry if this is unclear, it's just a thought I had, and I'm unsure how to properly express it.",
        "created_utc": 1517145621,
        "upvote_ratio": ""
    },
    {
        "title": "What is the equivalent of SNAP (Food Stamp) in European countries? How do they guarantee food safety for the population?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tjuwi/what_is_the_equivalent_of_snap_food_stamp_in/",
        "text": "",
        "created_utc": 1517140398,
        "upvote_ratio": ""
    },
    {
        "title": "Has this sort of direct democracy ever existed or been studied? What can be expected of it?...",
        "author": "RedHatOfFerrickPat",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tjm4i/has_this_sort_of_direct_democracy_ever_existed_or/",
        "text": "A democracy where the role of the citizens is to vote periodically on issues put to them, and the role of the elected is to select the issues for the citizens to vote on.\n\nI'm having a hard time imagining what the election campaigns would look like. ",
        "created_utc": 1517136246,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone know of texts relating cults with something like Hannah Arendt's banality of evil? How about the effectiveness and method of exit counseling?",
        "author": "zswagz",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7tfc4y/does_anyone_know_of_texts_relating_cults_with/",
        "text": "Sorry if this is too specific. I am also interested in deprogramming and exit counseling in general. Are there any books about 1) entire societies developing cult like behavior and 2) books about the experiences and effectiveness of retraining those leaving a cult? Would Weber be a good place to start? I also apologize if this is naive. I'm more usually found lurking around /r/Askphilosophy.\n\nEdit; entire societies is a bit strong. Large portions (say around 30% *wink*) might be more appropriate. ",
        "created_utc": 1517084833,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to American urban population in 2009?",
        "author": "sign_on_the_window",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7t7srl/what_happened_to_american_urban_population_in_2009/",
        "text": "When I was looking up populations of major american cities I noticed a trend: a consistent dip in population in 2009.\n\n[Atlanta](https://www.google.com/search?q=population+of+atlanta&amp;rlz=1C1CHBF_enUS733US733&amp;oq=population+of+atlanta&amp;aqs=chrome.0.0l6.2919j0j7&amp;sourceid=chrome&amp;ie=UTF-8)\n\n[NYC](https://www.google.com/search?rlz=1C1CHBF_enUS733US733&amp;ei=CZtrWrG4NM7PzwLq14_wBQ&amp;q=population+of+NYC&amp;oq=population+of+NYC&amp;gs_l=psy-ab.3..0i20i263k1l2j0l8.17051.17525.0.17677.3.3.0.0.0.0.135.290.2j1.3.0....0...1c.1.64.psy-ab..0.3.287...0i67k1j0i20i264k1.0.IExzLpkYjng)\n\n[Chicago](https://www.google.com/search?rlz=1C1CHBF_enUS733US733&amp;ei=HJtrWv_aNMXBzgKAkKjwAQ&amp;q=population+of+chicago&amp;oq=population+of+chicago&amp;gs_l=psy-ab.3..0i20i263k1j0j0i20i263k1j0l7.23631.24935.0.25102.7.5.0.2.2.0.119.365.3j1.4.0....0...1c.1.64.psy-ab..1.6.388...0i67k1j0i20i264k1.0.ep8lBtEUH5Q)\n\n[Houston](https://www.google.com/search?rlz=1C1CHBF_enUS733US733&amp;ei=N5trWvevH9HxzgK_vr64Cw&amp;q=population+of+Houston&amp;oq=population+of+Houston&amp;gs_l=psy-ab.3..0j0i20i264k1j0l8.25844.26540.0.26707.7.5.0.2.2.0.157.663.0j5.5.0....0...1c.1.64.psy-ab..1.6.527...0i20i263k1.0.xpaNjigT0q8)\n\n[Dallas](https://www.google.com/search?rlz=1C1CHBF_enUS733US733&amp;ei=U5trWtuEJJLYzgLyzr-oDg&amp;q=population+of+dallas&amp;oq=population+of+dallas&amp;gs_l=psy-ab.3..0l4j0i20i264k1j0l5.18656.19296.0.19423.6.5.0.1.1.0.133.536.2j3.5.0....0...1c.1.64.psy-ab..1.5.410...0i67k1.0.WlrABeBF2fE)\n\n[Boston](https://www.google.com/search?rlz=1C1CHBF_enUS733US733&amp;ei=kZtrWs7yCYGdzwL94Y6YDA&amp;q=population+of+boston&amp;oq=population+of+boston&amp;gs_l=psy-ab.3..0j0i20i264k1j0l8.9614.10135.0.10295.6.5.0.1.1.0.146.547.2j3.5.0....0...1c.1.64.psy-ab..0.6.552...35i39k1j0i20i263i264k1j0i20i263k1.0.wU43SgK3vl4)\n\n[Detroit](https://www.google.com/search?rlz=1C1CHBF_enUS733US733&amp;ei=9JtrWt6pHoOxzwLRgpyAAQ&amp;q=population+of+detroit&amp;oq=population+of+detroit&amp;gs_l=psy-ab.3..0j0i20i264k1j0l8.5687.6474.0.6641.7.3.0.4.4.0.99.263.3.3.0....0...1c.1.64.psy-ab..0.7.321...35i39k1j0i67k1.0.zsuc2IXniX4)\n\nI can go on. I see few cities like LA and Colombus unaffected.\n\nIs this the cause of the financial crisis around that time? How would a financial crisis cause people to move out of big cities?\n\n Thank you",
        "created_utc": 1517001824,
        "upvote_ratio": ""
    },
    {
        "title": "[Academic] REproducible Psychological Science (REPS) Group Study",
        "author": "kat-cary",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7t7hz3/academic_reproducible_psychological_science_reps/",
        "text": "[removed]",
        "created_utc": 1516999330,
        "upvote_ratio": ""
    },
    {
        "title": "Friday Free-for-All | January 26, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7t4p3y/friday_freeforall_january_26_2018/",
        "text": "[removed]",
        "created_utc": 1516975550,
        "upvote_ratio": ""
    },
    {
        "title": "Back in the 1980's we were warned by many experts that violence in movies and games would make kids more violent. Since then the number of violent acts committed by minors has fallen dramatically, yet the youth have beein playing and watching more and more violent games and movies. What gives?",
        "author": "This_is_User",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7t4968/back_in_the_1980s_we_were_warned_by_many_experts/",
        "text": "Statistic: [Number of serious violent crimes committed by youth aged between 12 and 17 years in the U.S. from 1980 to 2015 \\(in 1,000\\)](https://www.statista.com/statistics/477466/number-of-serious-violent-crimes-by-youth-in-the-us/) \n\nI always thought there that was some truth to the opinion that violence in games and movies would have an effect, but these stats shows no such correlation. I am sure there are more stats to both expand on and change the picture,  why is why I am posting here.\n\nDo we have any reasonable data to show whether society overreacted back in the infant days of videogames or if there is some truth to it.\n\nBonus question: Has there been done any research as to whether social presence has changed violence behaviour in youths? I have seen a lot of stuff recently portraying social media, and the related fame, as a catalyst to violent attacks by minors.",
        "created_utc": 1516970520,
        "upvote_ratio": ""
    },
    {
        "title": "Which are more prosperous, nations with high or low populations",
        "author": "SoybeanCola1933",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7t3byp/which_are_more_prosperous_nations_with_high_or/",
        "text": "Going over historical and modern examples/trends, what seems to be the most appropriate case, is a large population a blessing or a burden? By prosperous I mean nations with high literacy, high quality of life, wealth, happiness...",
        "created_utc": 1516956510,
        "upvote_ratio": ""
    },
    {
        "title": "How big is income inequality as a determinant of crime rate?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7t2mfh/how_big_is_income_inequality_as_a_determinant_of/",
        "text": "[deleted]",
        "created_utc": 1516945902,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an equivalent of VoteView/DW-NOMINATE etc. for the UK Parliament?",
        "author": "hodl_donkey",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7szpf8/is_there_an_equivalent_of_voteviewdwnominate_etc/",
        "text": "Hello all,\n\nI'm looking for a spatial model of parliamentary voting (e.g. [Keith Poole's work](https://assets.cambridge.org/97805216/17475/frontmatter/9780521617475_frontmatter.pdf)) for British members of Parliament.\n\nVoteView, DW-NOMINATE are two services that offer this spatial mapping of Senator's voting records in the US... I'm wondering if there's a UK equiv!\n\nThanks!\n\nP.S. in more simple terms; a political compass!",
        "created_utc": 1516917228,
        "upvote_ratio": ""
    },
    {
        "title": "Do individualist cultural influences cause increased suicide rates in collectivist cultures?",
        "author": "Cristal1337",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7swhs7/do_individualist_cultural_influences_cause/",
        "text": "Countries like South-Korea and Japan have very high suicide rates. They are collectivist cultures who are strongly influenced by individualistic cultures. I suspect that the individualistic influences causes a shift in collectivist ideals where more and more individuals consider themselves individualist instead of collectivist. The individualists stand out in society, they feel unaccepted for who they are and this has a negative effect on their mood, causing depression and increasing risks of suicide. \n\nWhat are your thoughts?",
        "created_utc": 1516891398,
        "upvote_ratio": ""
    },
    {
        "title": "Is wealth included when establishing socioeconomic status or is it mostly based on income?",
        "author": "RedHermit1982",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7ssqhx/is_wealth_included_when_establishing/",
        "text": "I was reading an excerpt from psychologist Richard Nisbett's book \"Intelligence and How to Get It\" and he noted that while black income is something in the range of 70 percent of white income, black wealth is only 14 percent, and also further acknowledged that SES doesn't account for the entirety of the black-white IQ gap. I've also elsewhere seen SAT scores presented as evidence that SES has weaker predictive power than race because black test-takers from higher income brackets score only marginally higher than white students from lower brackets. But is this misleading? Would you get a different result if you controlled for wealth instead of income because wealth more accurately represents accumulated social advantage?\n",
        "created_utc": 1516847192,
        "upvote_ratio": ""
    },
    {
        "title": "Ministers of the Crown",
        "author": "lordnelson111",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sqf0k/ministers_of_the_crown/",
        "text": "In the Parliamentary System , does a Minister of the Crown have complete rights in their department to do what they want ? Or do they have to get permission from the PM or Cabinet about bringing in various laws , bills , etc . ",
        "created_utc": 1516828170,
        "upvote_ratio": ""
    },
    {
        "title": "Theory Wednesday | January 24, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sna9e/theory_wednesday_january_24_2018/",
        "text": "Theory Wednesday topics include:\n\n* Social science in academia\n\n* Famous debates\n\n* Questions about methods and data sources\n\n* Philosophy of social science\n\n* and so on.\n\nDo you wonder about choosing a dissertation topic? Finding think tank work? Want to learn about natural language processing? Have a question about the academic applications of Marxian theories or social network analysis? The history of a theory? This is the place!\n\nLike our other feature threads (Monday Reading and Research and Friday Free-For-All), this thread will be lightly moderated as long as it stays broadly on topics tangentially related to academic or professional social science.\n",
        "created_utc": 1516802764,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a consensuses amongst anthropologists regarding the legitimacy of the \"cognitive explosion\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sjkf8/is_there_a_consensuses_amongst_anthropologists/",
        "text": "[deleted]",
        "created_utc": 1516757349,
        "upvote_ratio": ""
    },
    {
        "title": "Classifying generations: a post-industrialization phenomenon?",
        "author": "WolfDogLizardUrchin",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sjdmn/classifying_generations_a_postindustrialization/",
        "text": "For how long have we been grouping generations together &amp; attributing characteristics to them, like in the US with the Silent Generation, the Boomers, Generation X, Millennials, etc.?\n\nI've seen generalized complaints about this younger generation from ancient &amp; medieval commentators, but not sequential generalizations about various different generations. \n",
        "created_utc": 1516755584,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't we hang billionaires by their toes?",
        "author": "Littleslapandpickle",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7silnb/why_dont_we_hang_billionaires_by_their_toes/",
        "text": "[removed]",
        "created_utc": 1516748715,
        "upvote_ratio": ""
    },
    {
        "title": "Need help ⚡️",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7shrvt/need_help/",
        "text": "[removed]",
        "created_utc": 1516741958,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find data on local jail incarceration broken down by offense?",
        "author": "HisNameIs",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7se5uq/where_can_i_find_data_on_local_jail_incarceration/",
        "text": "My main goal is to show trends over the last several decades for violent, non-violent and drug offenses in the U.S. Finding state and federal data has been fine - Uniform Crime Report, Sentencing Project, etc. but stats on local jails is evading me. Any help would be absolutely great! Thanks!",
        "created_utc": 1516711843,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any research into the voting patterns of rich and upper middle income Black and Hispanic voters in the US? Are they more likely to support Republicans than the average Black or Hispanic voter?",
        "author": "Shashank1000",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sd2q1/is_there_any_research_into_the_voting_patterns_of/",
        "text": "",
        "created_utc": 1516696570,
        "upvote_ratio": ""
    },
    {
        "title": "What is the name of the theory",
        "author": "SOMEFUCKINGRANDOM",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sbsty/what_is_the_name_of_the_theory/",
        "text": "&gt;We are raised by our parent(s), who look after us and seem to have a purpose for us.    \nWhen we grow up, we turn to religion to create a delusion that there is someone looking after us and has a purpose for us.\n\nI hope that's enough for someone to recognize it. What is the name of this theory?",
        "created_utc": 1516680477,
        "upvote_ratio": ""
    },
    {
        "title": "What will the period after WWII until now be called in 100 years?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskSocialScience/comments/7sb79r/what_will_the_period_after_wwii_until_now_be/",
        "text": "[deleted]",
        "created_utc": 1516674614,
        "upvote_ratio": ""
    }
]