[
    {
        "title": "What if the universe is not as we observe it to be?",
        "author": "justanotherreaditacc",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ij0zw/what_if_the_universe_is_not_as_we_observe_it_to_be/",
        "text": "My question is mainly related to the apparent fact that everything in the universe is so spread out and practically impossible to physically visit.  It's about the idea that even if there are other civilizations out there, they are too far away to ever discover, even too far away to reasonably communicate with them.  These limitations are all related to distances between objects and our current understanding of the maximum possible speed. Of course, this is a very disappointing and discouraging thought given the human nature to explore and discover.\n\n&amp;#x200B;\n\nHowever, what if the picture we have of the universe is distorted or filtered somehow?  What if, based on our vantage point, objects in the universe only appear to be extremely far away, when in reality, they are much closer together? What if the universal speed limit isn't actually a limit 'out there'?  I ask these questions because all the knowledge and information we have has been gathered from where we are. We have never even exited the solar system, perhaps our observations would be drastically different if we could make them from a drastically different location? I'm imagining something like this: we reach a certain level of technology that allows us to send probes/telescopes outside solar system at a much greater rate than we can now, like dozens every year.  We get our there, start looking around, and hey, that star we look at from earth is only 1 light year away instead of 20. Or, hey, when we reposition one of these probes, our inputs have a much greater affect in actual movement than when we do the same thing inside the solar system.  \n\n&amp;#x200B;\n\nNow, with those questions asked, how could this be? If things are drastically different than we observe them from earth, what would cause it?  One simple idea is that light just simply gets distorted in open space, caused by some unknown process or phenomenon. Maybe dark matter or dark energy? I don't know if that is possible, maybe there's some other 'dark force' at work that could cause that.  Another thought, perhaps purely science fiction, but imagine there are super advanced civilizations out there that, through technology, deliberately envelope primitive beings solar systems to block or distort what they're able to see.  Only until these primitive people got advanced enough to leave this 'bubble', would they be able to see how things really are.  Why would they do that?  Well, maybe it's more of a protective measure? Maybe it's to allow the primitive civilization the time in isolation to advance enough to join the larger community prepared?\n\n&amp;#x200B;\n\nThese are just some thoughts I've been contemplating and was looking for other people's opinions on this.  Wishful thinking, perhaps, but I'd much prefer this idea of 'everything we know is wrong' compared to the bleak 'we are effectively alone' idea.\n\n&amp;#x200B;\n\nTLDR: We live in a bubble and can't see how things really are unless we look from outside the bubble.  Who knows what causes the bubble, maybe aliens?",
        "created_utc": 1537803922,
        "upvote_ratio": ""
    },
    {
        "title": "What would eventually happen to you if you ate something you were slightly allergic to on a regular basis?",
        "author": "SuperKirbzz1234",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9iiy83/what_would_eventually_happen_to_you_if_you_ate/",
        "text": "Would you get sticker and sicker? Would the allergy get worse or better?",
        "created_utc": 1537803369,
        "upvote_ratio": ""
    },
    {
        "title": "Hypothetical: How fast would you have to be spinning about your own axis for your eyes to pop out of their sockets?",
        "author": "liberusmaximus",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9iiwwf/hypothetical_how_fast_would_you_have_to_be/",
        "text": "Just curious.",
        "created_utc": 1537803118,
        "upvote_ratio": ""
    },
    {
        "title": "What would an entire \"mountain range\" of active volcanos be like?",
        "author": "CirkuitBreaker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9iibng/what_would_an_entire_mountain_range_of_active/",
        "text": "I hope this is the right place to submit this. I'm trying to put some hard science into my homebrewed D&amp;D campaign setting. I have an entire \"mountain range\" of active volcanoes and I was wondering how this would affect climate. What would things look like on the windward side? What would things look like on the leeward side? Would all the sulfur cause acid rain? Are there any geological processes that could produce such a range of volcanoes? I can't think of anymore burning questions right now but more information is useful.",
        "created_utc": 1537798910,
        "upvote_ratio": ""
    },
    {
        "title": "Is a self contained device that can change weights with a dial or buttons theoretically possible?",
        "author": "Overtaker40",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ig4jb/is_a_self_contained_device_that_can_change/",
        "text": "",
        "created_utc": 1537776359,
        "upvote_ratio": ""
    },
    {
        "title": "What if you are offered, would you agree to be a passenger for a trip to the moon?",
        "author": "Liemenot",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ig08l/what_if_you_are_offered_would_you_agree_to_be_a/",
        "text": "[removed]",
        "created_utc": 1537774744,
        "upvote_ratio": ""
    },
    {
        "title": "Giant comet / asteroid hits X continent killing a huge percentage of all humans with all the aftereffects. Assume no war took place after the disaster. What changes or technologies do we need in order to protect our planet from future events like this?",
        "author": "maximilious",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9id7pf/giant_comet_asteroid_hits_x_continent_killing_a/",
        "text": " Stationary scanners in space set out far in space in positioned in a way  that detect movement then estimate the objects size and if it hits a  certain threshold then it reports back to certain institutes to take a  look? and if we know it's coming how do we stop it? shoot it? change  it's trajectory somehow? Are we even capable of making some sort of  defense system to protect ourselves from space objects hitting us? ",
        "created_utc": 1537747006,
        "upvote_ratio": ""
    },
    {
        "title": "What really is the correct blade count for a wind turbine? Why there is no reason to trust the most common answer that is 3",
        "author": "herkato5",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9icydq/what_really_is_the_correct_blade_count_for_a_wind/",
        "text": "There are two separate points of view to blade count:\n\n1 How annoying the noise is?\n\n2 Is it most cost efficient to have 3 blades and if so, why?\n\nLess annoying turbine can be closer to habitation. Number of blades affects noise levels, how annoying a noise level is, and other factors of annoyance. But let's assume the turbine is far out at sea or in a desolate place.\n\nWhenever I see answer to this question 2, it is always rewording the original claim, the premise of the question. This question causes worse argumentation than any other ideologically neutral question. One reformulation just says that 4 blades would be less cost efficient than 3. Other \"argument\" is that 4th blade would give only small increase in power. It can give zero increase in power and still it may be cheaper per power, if the blades are shorter. Just cutting length is just one possible alteration that can be done to blades. Even if surface area gets larger, it does not necessarily mean that more material is used and even if more material is used it does not mean that it is more expensive because complexity and length of welding seams matter too.\n\nIt would be wrong to compare different blade counts using the same blade shape and same generator for rotors with different torque. No one seems to know if even this is done wrong. Secondly, if blade shape and generator was different for every blade count when making comparisons, were all variables considered for change? Not just numbers, quantitative properties of the blade shape and generator, but also qualitative properties like can the blade pitch be adjusted for wind speed? Abandoning possibility to change blade angle could make the turbine so much cheaper that it justifies lower efficiency, at least on some blade counts on some places. Too high wind speed requires turning the whole rotor on either side with oblique angle.\n\nThere is no reason to trust that any of this has been considered well enough. There is need to have completely separate independent checking or something beyond checking, starting from scratch, from first principles, and seeing what are the results.\n\nThis is just efficiency. Noise and how bad it sounds is other consideration. 10 to 20 blades spreads the noise in time, causing constant hum. Infrasound can't form.\n\nTurbulence does not ruin the turbine, it is not supposed to be like an airplane. Accepting some turbulence can make it lot simpler and cheaper, so much that it outweighs the reduction in efficiency.\n\nParts of blade can be like a sail, wright brother's plane wing, tent, umbrella or ancient wind mill blade: In this case, nylon or kevlar fabric ( or even graphene or carbon nanotubes ) supported in aluminum frame.\n\nAre there any new, made within 10 years, modern wind turbines with more than 3 blades? What would be a good blade count, either for noise or efficiency or both?\n\nEven if you disagree and think that wind turbines should always have 3 blades, both near and far of people, all the arguments should be known anyway. This is important topic. Renewable energy is important. Wind mill noise is important and can ruin lives.",
        "created_utc": 1537744833,
        "upvote_ratio": ""
    },
    {
        "title": "Compounding Memory Decay? Neuroscience Question.",
        "author": "Sirpeech",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9icq27/compounding_memory_decay_neuroscience_question/",
        "text": "When you recall a memory, it is reconstructed. However the reconstruction is not precise and has a small error. When you remember it again, you’re actually remembering the erroneous reconstruction as well as a newly added error. (The error can be either: wrong information (mutation) or information that goes missing (deletion)) Error compounds with each reconstruction.\n\n&amp;#x200B;\n\nLet’s say the error is a conservative 1% each time. \n\nAfter 68 times (0.99 \\^ 68) = 0.50, only 50% of the memory is without error.\n\n&amp;#x200B;\n\nWhat if the error is 15% each time? Plausible.\n\nAfter 5 times (0.85 \\^ 5 = 0.44), only 44% of the memory is without error.\n\nAfter 29 times, over 99% of the memory is erroneous. \n\n&amp;#x200B;\n\nHave there been any studies done to show how memory decays over time in this fashion?\n\nIs my reasoning wrong?",
        "created_utc": 1537742927,
        "upvote_ratio": ""
    },
    {
        "title": "How to avoid belief-vs-science divergence?",
        "author": "__blerp__",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ibmyh/how_to_avoid_beliefvsscience_divergence/",
        "text": "I find often that there is some topic X where the scientific consensus is Y.\n\nThe scientific consensus in this topic Y is strongly agreed upon as the best possible solution based on our current understanding of the available evidence. This consensus is often based on science that weeds out many factors/biases that we don't even consider.\n\nOften times, however, I find that I will make \"tweaks\" because \"the science isn't bulletproof\" (it never is) and I will end up making blunders that I could have avoided in the first place, mainly because it is so easy to fool ourselves and I didn't realize that the science had already accounted for that same bias.\n\nNowadays, I make sure to take the scientific consensus on any topic very seriously, and if I do decide to make tweaks, I do so very methodically and without disregarding the current scientific consensus.\n\nIs there a term for this \"belief vs. science divergence\" (I heard it referred to as this at the Center for Applied Rationality) where we follow our intuition even though we know the scientific evidence says otherwise. I imagine it is somewhat conflated with special snowflake syndrome and the seductiveness of alternative theories, which often offer \"shortcuts,\" etc. I've also heard to it referred in the book \"How We Know What Isn't So\" but I cannot seem to find the passage, but essentially Thomas talks about how we know something is true such as the lack of evidence for the hot hand fallacy in sports, or that some superstition we have formed Z is not true but we still follow it because maybe, just maybe it is true and we cannot shake that feeling (and then by the nocebo effect continue to reinforce the belief.)\n\nExamples I can think of off the top of my head: eliminating whole grains because of some proposed mechanism/appeal to nature fallacy but missing the benefits of the large epidemiology supporting their moderate intake, not wanting to go on an airplane because of the availability bias of the risk and not being aware of how the statistics actually play out on a large scale and in what magnitude (particularly in comparison to other risks), etc.\n\nHow to avoid this from happening? Is there a specific name for this phenomenon?",
        "created_utc": 1537734530,
        "upvote_ratio": ""
    },
    {
        "title": "How does the Nutrients from the Tea Leaves Transfer from the Leaf to the Water?",
        "author": "Boww17",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9iaakk/how_does_the_nutrients_from_the_tea_leaves/",
        "text": "[removed]",
        "created_utc": 1537724839,
        "upvote_ratio": ""
    },
    {
        "title": "Switching from Roman numerals to Arabic ones made multiplication and division easier; are there any alternate numeral systems that would make higher-order maths easier?",
        "author": "mutant_scum",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i9xs5/switching_from_roman_numerals_to_arabic_ones_made/",
        "text": "",
        "created_utc": 1537722222,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think synthetic muscle like HASEL actuators, biohybrid muscle cell based actuators or something else like wood-hydrogel artificial muscles are most likely to be the future of controlled robot movement via bio-mimicry?",
        "author": "FunkyTikiGod",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i9rg7/do_you_think_synthetic_muscle_like_hasel/",
        "text": "Or do you think robots will stay conventional or advance in some other way?",
        "created_utc": 1537720916,
        "upvote_ratio": ""
    },
    {
        "title": "How close are we to being able to break down garbage into raw elements, storing the atoms, and being able to use the elements in molecular-scale 3D printing?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i99ju/how_close_are_we_to_being_able_to_break_down/",
        "text": "What would it take to make a 3D printer that could break things down into raw elements, and print new objects at the molecular scale from recycled atoms?\n\nAn example of what I have in mind would be disassembling moldy bread, and using the raw elements to print fresh bread. ",
        "created_utc": 1537717128,
        "upvote_ratio": ""
    },
    {
        "title": "Smart Meters and EMF",
        "author": "aMUSICsite",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i8qhh/smart_meters_and_emf/",
        "text": "I've been in a debate recently about whether smart meters cause a potential, or real, heath risk. I believe they don't but it's hard to find hard facts as Google likes to flood the search results with a ton of quaky micro sites with dubious science. So what's your view, especially if you are involved in making, testing or installing these and links to back up results from reliable sources would be good.",
        "created_utc": 1537712821,
        "upvote_ratio": ""
    },
    {
        "title": "Physics in Alternate Reality",
        "author": "SVIKC",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i8bm6/physics_in_alternate_reality/",
        "text": "[removed]",
        "created_utc": 1537708964,
        "upvote_ratio": ""
    },
    {
        "title": "Are there free sources of data for sociological research that include things like values, politics, family situation, sexual orientation, etc?",
        "author": "bigmistakebub",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i7m6v/are_there_free_sources_of_data_for_sociological/",
        "text": "As in if you have theories about where some correlations might lie, can you get free data that lets you test it?\n\nI suppose what I'm after is a huge database with lots of (anonymous) profiles of people, the more the better, that cross reference all this kind of data.\n\nDoes this exist?\n\nThanks",
        "created_utc": 1537700793,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to actually blink Morse code messages?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i7c9d/is_it_possible_to_actually_blink_morse_code/",
        "text": "[removed]",
        "created_utc": 1537696874,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen to the human body if no cosmetic maintenance were done?",
        "author": "lepriccon22",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i6sl5/what_would_happen_to_the_human_body_if_no/",
        "text": "E.g. Finger nails grow out, all hair all over, no washing, etc. Is it unhealthy? Is some sort of human cocoon formed?",
        "created_utc": 1537688953,
        "upvote_ratio": ""
    },
    {
        "title": "Could flying birds have ever carried people?",
        "author": "ZedZeroth",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i65gj/could_flying_birds_have_ever_carried_people/",
        "text": "Some of the largest extinct flying birds lived around the same time as our LCA with chimps. Roughly what wingspan of bird would be able to carry a certain weight on it's shoulders? How big would a bird need to be to carry me (100kg)? What about my daughter (10kg)?\n\nEdit: I'm more interested in theoretical limits than actual birds. I.e. What is the relationship between a bird's mass and the mass it can carry?\n\nEdit 2: I'm reading that the strongest eagles can take off carrying their own body weight. Argentavis weighed 70kg and small adults weigh less than this. ",
        "created_utc": 1537680373,
        "upvote_ratio": ""
    },
    {
        "title": "The human body and computers",
        "author": "playerloaded",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i5ubs/the_human_body_and_computers/",
        "text": "[removed]",
        "created_utc": 1537676722,
        "upvote_ratio": ""
    },
    {
        "title": "What is the absolute largest an insect could grow currently",
        "author": "lemon-man7",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i5i13/what_is_the_absolute_largest_an_insect_could_grow/",
        "text": "",
        "created_utc": 1537673003,
        "upvote_ratio": ""
    },
    {
        "title": "I want to use amnesia in a story, but want to avoid scientific inaccuracy. Could the following theoretically happen?",
        "author": "xSnippy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i5cis/i_want_to_use_amnesia_in_a_story_but_want_to/",
        "text": " Person suffers trauma of some kind, and gets retrograde amnesia. She knows who no one is, including herself. She remembers how to do math, how to read, talk, move, and all other \"skills\". She can still ride a bike, drive a car, and reason. She has only forgotten names, places, faces, and her day to day life. ",
        "created_utc": 1537671388,
        "upvote_ratio": ""
    },
    {
        "title": "How should scientists feel about the lack of evidence for racial equality?",
        "author": "the_fourth_way",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i4o53/how_should_scientists_feel_about_the_lack_of/",
        "text": "[removed]",
        "created_utc": 1537664699,
        "upvote_ratio": ""
    },
    {
        "title": "A second moon (same mass as ours) suddenly appears around Earth's orbit. What happens down here?",
        "author": "orpheus1844",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i4eyg/a_second_moon_same_mass_as_ours_suddenly_appears/",
        "text": "Title. Thanks!",
        "created_utc": 1537662260,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for a magnet to have an unbalanced magnetic field?",
        "author": "Imcamcam2",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i47mf/is_it_possible_for_a_magnet_to_have_an_unbalanced/",
        "text": "I've always had slight trouble understanding the laws of magnets and metals. I've recently started a project and have been running into problems. I understand that no matter what, magnets must have a north and south or a + and -. They cannot be just north or just south (that we know of). However I am wondering if there can be an unbalanced north and south. Ex, north being more powerful than south. If a magnet cannot have an unbalanced field, is it possible for a metal to have a more powerful monofield? Is there a metal that will naturally be repelled rather than attracted by magnets?",
        "created_utc": 1537660301,
        "upvote_ratio": ""
    },
    {
        "title": "How have nuclear reactors improved the field of science?",
        "author": "x4dd3",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i3zza/how_have_nuclear_reactors_improved_the_field_of/",
        "text": "I recently got into nuclear reactors and was reading about them. I was wondering how the discovery of the nuclear reactor in 1942 has improved science. What kind of processes/areas of investigation/fields were improved or discovered?",
        "created_utc": 1537658327,
        "upvote_ratio": ""
    },
    {
        "title": "Can chickens who eat Cane toads lay toxic eggs?",
        "author": "brokenwebsiteuser",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i3y62/can_chickens_who_eat_cane_toads_lay_toxic_eggs/",
        "text": "I know chooks can eat large numbers of cane toads without harm as they process the venom well.\n\nBUT, If a chicken was fed a diet of 10-30% whole minced/chopped cane toad~Rhinella marina(+ grain + greens) would the toxins from the venom glad accumulate in the eggs.\n\nI understand the study would have to be done to give a definitive answer, but since this is hypothetical a best guess/opinion would be very helpful.\n\nP.S. If you know a better place to ask a heads up would be appreciated. Thanks folks!\n",
        "created_utc": 1537657859,
        "upvote_ratio": ""
    },
    {
        "title": "What major experiments are slated to be performed in the coming years?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i3wjy/what_major_experiments_are_slated_to_be_performed/",
        "text": "For example: [PTOLEMY] (https://indico.cern.ch/event/640340/contributions/2680952/attachments/1510022/2354395/TullyPTOLEMYSNOLAB.pdf) is set to capture neutrinos that are relics from the Big Bang, [SuperCDMS](https://phys.org/news/2018-05-world-sensitive-dark.html) is looking for Dark Matter WIMPS, [DESI](https://en.wikipedia.org/wiki/Dark_Energy_Spectroscopic_Instrument) will provide insight into the expansion rate of the early universe, upcoming telescopes like EUCLID / LSST / WFIRST will help us narrow down how dark energy will contribute to the fate of the universe.",
        "created_utc": 1537657454,
        "upvote_ratio": ""
    },
    {
        "title": "If one were to make a light saber, how could it be done?",
        "author": "o-rka",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i3oed/if_one_were_to_make_a_light_saber_how_could_it_be/",
        "text": "",
        "created_utc": 1537655469,
        "upvote_ratio": ""
    },
    {
        "title": "Does space show signs of getting 'thin' or 'taught' as it expands?",
        "author": "Sitervain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i2pr7/does_space_show_signs_of_getting_thin_or_taught/",
        "text": "It's apparently straight as our instruments can measure but what other characteristics does the firmament that provides room have? I'm especially interested in those that have shown the ability to somewhat change.\n\nIs [quantum fluctuation](https://en.wikipedia.org/wiki/Quantum_fluctuation) an intrinsic part of space or is it likely to be more connected to other factors?",
        "created_utc": 1537647393,
        "upvote_ratio": ""
    },
    {
        "title": "Can you make a list in ascending order of which type of fuel/propulsion using car has the best fuel efficiency, plus questions?",
        "author": "fuelefficienthelp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i25cg/can_you_make_a_list_in_ascending_order_of_which/",
        "text": "I'm  thinking about gas, diesel, hybrid, electric. If this subreddit allows  it, then I would be interested in how do methane-driven cars perform  here, and where would a car be placed if it used kerosene or maybe even ethanol.\n\nAnother  thing: Do electric and hybrid car batteries become useless within a few  years just as cell phone and laptop batteries do? Is this a common  problem in their case? How expensive is the change?\n\nAlso, would a methane-propelled car become very dangerous when colliding with another car, because of an explosion?",
        "created_utc": 1537642905,
        "upvote_ratio": ""
    },
    {
        "title": "What is the explanation for synchronicity?",
        "author": "scorpio-19",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i20u1/what_is_the_explanation_for_synchronicity/",
        "text": "[removed]",
        "created_utc": 1537641941,
        "upvote_ratio": ""
    },
    {
        "title": "Does the human l lung have a maximum humidity level, before it's no longer able function properly?",
        "author": "gingerblz",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i201k/does_the_human_l_lung_have_a_maximum_humidity/",
        "text": "",
        "created_utc": 1537641772,
        "upvote_ratio": ""
    },
    {
        "title": "When it is said that a predator population is \"self-regulating,\" does that mean the animals kill each other to the extent the entire population is suppressed, or do the animals primarily disperse?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i1wls/when_it_is_said_that_a_predator_population_is/",
        "text": "Text from an article on wolves.  Predators like wolves, lions, and tigers regularly kill each other.\n\n&gt;With such a rich prey-base that Yellowstone provides, especially elk, one may think that the wolf population would swell exponentially. But since wolves are self-regulating, meaning, because of their low tolerance toward each other and, specifically, other packs, they help to keep their own population in check. And given the fact that the Yellowstone wilderness is not, by a long shot, endless in size (it is surrounded by rangelands) the likelihood of an overabundance of wolves occurring is remote at best.\n\nhttp://www.northlandoutdoors.com/2018/01/29/wolf-population-has-returned-to-yellowstone/\n\n\n",
        "created_utc": 1537641017,
        "upvote_ratio": ""
    },
    {
        "title": "Making the sahara green is often the prime example of terraforming projects we can undertake on earth, what would the actual ecological ramifications of doing this be?",
        "author": "Rancerle",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9i0q3b/making_the_sahara_green_is_often_the_prime/",
        "text": "",
        "created_utc": 1537631871,
        "upvote_ratio": ""
    },
    {
        "title": "[Request] I have access to a Scanning Electron Microscope and am looking for suggestions of things Reddit would like to image!",
        "author": "SEM_Guy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hzwu7/request_i_have_access_to_a_scanning_electron/",
        "text": "[removed]",
        "created_utc": 1537625173,
        "upvote_ratio": ""
    },
    {
        "title": "READ ON HOW YOU CAN GET YOUR LITTLE PENIS ENLARGED WITH THE HELP OF DOCTOR AZIBA CREAM",
        "author": "azibaphillip",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hzcds/read_on_how_you_can_get_your_little_penis/",
        "text": "[removed]",
        "created_utc": 1537619542,
        "upvote_ratio": ""
    },
    {
        "title": "I'm curious, how would the movement of a Star Destroyer at a height of 1,000ft. look like travelling at 40,000km/h compared to its canon top speed of 975km/h? Would it travel at a turtle's pace to the naked eye at both speeds, or would there be a more visible difference?",
        "author": "RPG_Wannabe",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hyv0e/im_curious_how_would_the_movement_of_a_star/",
        "text": "For scaling, an Imperial-class Star Destroyer is 1600 meters long and 975 meters wide at the base.",
        "created_utc": 1537613977,
        "upvote_ratio": ""
    },
    {
        "title": "If you actively prioritize hearing more than you prioritize seeing on a daily basis, can this affect your eyesight over a long period of time?",
        "author": "King_Dur",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hxgej/if_you_actively_prioritize_hearing_more_than_you/",
        "text": "This [thread](https://www.reddit.com/r/todayilearned/comments/9gwa1l/til_turning_down_the_radio_in_your_car_to/) is where I posted the original question.\n\nA good example would be a sound engineer constantly listening to minute details of a song for hours on end daily. Over a long period of time may this affect his vision?\n\n\nThis may be a bad question for a few reasons (one being that eye sight degrades naturally with age) but I thought I'd throw it out there on the off chance that there's an interesting answer.",
        "created_utc": 1537595472,
        "upvote_ratio": ""
    },
    {
        "title": "What If two singularities meet? Would the weaker one be pulled into the event horizon? Would it be expelled out the other end? What would happen if two singularities come in contact?",
        "author": "carnivorous-Vagina",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hx7an/what_if_two_singularities_meet_would_the_weaker/",
        "text": "If two singularities meet would the weaker one be pulled into the event horizon? Would it be expelled out the other end? What would happen if two singularities come in contact?",
        "created_utc": 1537592462,
        "upvote_ratio": ""
    },
    {
        "title": "Do you have any theories of your own on the functions of junk DNA?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hwx31/do_you_have_any_theories_of_your_own_on_the/",
        "text": "[removed]",
        "created_utc": 1537589436,
        "upvote_ratio": ""
    },
    {
        "title": "Is there some sort of mist or smoke that has neutral buoyancy, won't spread on it's own, won't stain walls and other surfaces, is not toxic, and I can make/use at home easily; to study the aircurrents inside an apartment?",
        "author": "TiagoTiagoT",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hwvvw/is_there_some_sort_of_mist_or_smoke_that_has/",
        "text": "Basically, I'm looking for something I can produce on demand, that will mostly only move when the surrounding air moves, won't rise or fall on it's own, won't spread out much without the air moving etc, something sort like those dyes they use to trace underground rivers but for air instead of water; with the added requirements that it won't be harmful to the health of anyone, and won't require clean up, and that I can easily use at home (and preferably cheap to make/buy).\n\nMaybe something like what they use in wind tunnels? Or does that stuff only works when the wind is fast and goes to a filter/outside, to quickly get rid of it?",
        "created_utc": 1537589115,
        "upvote_ratio": ""
    },
    {
        "title": "How does adding the concept of dark energy and a universe that is constantly accelerating as it expands not conflict with Einstein's theory of relativity that is dependent on the idea of intertial frames of reference? PART TWO",
        "author": "TheJeremyHammons",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hvjwd/how_does_adding_the_concept_of_dark_energy_and_a/",
        "text": "[removed]",
        "created_utc": 1537576273,
        "upvote_ratio": ""
    },
    {
        "title": "Dr. Jelyll and Mr. Hyde of Virtual Reality.... Can/is virtual reality used for torture? What other nefarious purposes could it serve.",
        "author": "trep89",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hvdnl/dr_jelyll_and_mr_hyde_of_virtual_reality_canis/",
        "text": "Imagine being held captive. While tied down VR goggles are forced onto your head. You are forced to witness horrible events, gut wrenching events. Could that be an effective “enhanced interrogation” technique. Do you think it would cause significant emotional distress, what if the images werent based in fact. \n\nWhat other ways could VR be used for bad?",
        "created_utc": 1537574781,
        "upvote_ratio": ""
    },
    {
        "title": "Ideas on marshmallow catapult assignment?",
        "author": "Vitztlampaehecatl",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hval7/ideas_on_marshmallow_catapult_assignment/",
        "text": "My brother has been tasked by his high school science teacher with building a low-budget marshmallow catapult that can fire a mini marshmallow *seven meters*. At that distance, I'm expecting air resistance to be the biggest issue. Any ideas on optimizing the launch angle, flight profile, etc?",
        "created_utc": 1537574004,
        "upvote_ratio": ""
    },
    {
        "title": "What do you believe the long term implications of the internet will be, by people who use it to live in their own reality?",
        "author": "ccricers",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hv9m2/what_do_you_believe_the_long_term_implications_of/",
        "text": "I ask this as a social science-related question. I hope those are allowed here. It used to be that holding certain opinions that are highly controversial or improbable would hold people under ridicule. The internet's lack of physical boundaries or intrusions makes it much easier to keep all followers of a given belief together and turn it into a resonating chamber.  Now they have huge online communities where they can live in their own reality and never have it challenged. What do you believe the long term social implications that this would have? Would it become ever more difficult to prune the effects of delusion and paranoia?",
        "created_utc": 1537573770,
        "upvote_ratio": ""
    },
    {
        "title": "What should a person do in a high rise during a tornado?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hut3l/what_should_a_person_do_in_a_high_rise_during_a/",
        "text": "[removed]",
        "created_utc": 1537569869,
        "upvote_ratio": ""
    },
    {
        "title": "I know it's been looked at before and I know dumping nuclear waste in the ocean would have some PR problems, but why aren't we dropping nuclear waste into the Marianas Trench? If it were vitrified into glassy spheres, wouldn't it be pretty safe?",
        "author": "mutant_scum",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hur61/i_know_its_been_looked_at_before_and_i_know/",
        "text": "",
        "created_utc": 1537569446,
        "upvote_ratio": ""
    },
    {
        "title": "Why is String theory accepted even if there's no empirical evidence (yet)?",
        "author": "DrTacoLord",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9huq3k/why_is_string_theory_accepted_even_if_theres_no/",
        "text": "I noticed that when I read about Quantum physics and the Standard Model of Particles, that there are many still not proven theoretical models like Super Symmetry, Gravitons,  and most importantly the very well known String theory and its many flavours. \n\nYet the empirical evidence seems to elude us at the moment, with only the Higss boson being discovered finally in 2013. I read that there were also multiple alternatives in case the boson didn't exist as originally theorized.  \n\nTaking all of this into account, why are we so sure about the veracity of the String theory even that it can't be disproven. Isn't that attitude anti-scientific ?\n\nTl, dr;  The String theory has (as far as I know) no proof of its truthiness. Why do we believe in it? Should we? ",
        "created_utc": 1537569216,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a possible relationship between the Kardashev Scale and the Boötes Void? Is this something that astronomer/physicists debate on?",
        "author": "warminthesnowstorm",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hull2/is_there_a_possible_relationship_between_the/",
        "text": "",
        "created_utc": 1537568258,
        "upvote_ratio": ""
    },
    {
        "title": "E8 quasi crystal vs string theory for a grand unification theory",
        "author": "Dump_Bucket_Supreme",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9huhua/e8_quasi_crystal_vs_string_theory_for_a_grand/",
        "text": "Hey yall i was just curious on which of these ideas yall think could best explain the disconnect between quantum mechanics and general relativity. Hope its not a dumb question let me know if it is",
        "created_utc": 1537567485,
        "upvote_ratio": ""
    },
    {
        "title": "Is the slope infinity/1 the same as a straight line?",
        "author": "SmallsTheHappy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hu6qp/is_the_slope_infinity1_the_same_as_a_straight_line/",
        "text": "You know how when you have a slope of (big number)/1 it can kinda look like a straight up line. What if it was infinity/1, because of how infinity work you would never see the line move over because there is no end point. Because it would look perfectly vertical with not actual slope could we just call this a vertical line?",
        "created_utc": 1537565078,
        "upvote_ratio": ""
    },
    {
        "title": "Are there significant nutritional or health differences between tree-sap-based syrups like maple, palm, and birch and those derived from fruit and grains like brown rice, grape, sugar beet, corn, or sugar cane syrup?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hu03b/are_there_significant_nutritional_or_health/",
        "text": "",
        "created_utc": 1537563721,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain what's going on with these magnets w. respect to thermodynamics?",
        "author": "dungpuck",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9htmif/can_someone_explain_whats_going_on_with_these/",
        "text": "So I actually took upper division thermo in college, in case you want to reference some of those concepts, but I'm constantly amazed at how little I understand simple things about it in the real world. [This](https://www.reddit.com/r/Damnthatsinteresting/comments/9hpv4h/magnets/) post has a video that looks like it's being played backwards, but isn't. This thing isn't falling apart, it's falling together. Can someone explain what's going on? There are clearly more ways for it to be apart than together here. \n\nIf this works because they slam together and get hotter (there are more ways to be together and hot than apart and cold), isn't there some weird concept of temperature simultaneously on multiple interacting scales that they don't go into in thermo classes? (We never counted states using more than one way to categorize and label the objects at a time)\n\n",
        "created_utc": 1537560890,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any evidence that a animal species could evolve to the human cognitive level?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9htjbl/is_there_any_evidence_that_a_animal_species_could/",
        "text": "[deleted]",
        "created_utc": 1537560232,
        "upvote_ratio": ""
    },
    {
        "title": "What are the licensure procedures and governing laws (in the US) for research conducted using psychoactive drugs?",
        "author": "AcuteMtnSalsa",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hthhl/what_are_the_licensure_procedures_and_governing/",
        "text": "This question was inspired by the recent publication in which MDMA was given to an octopus. ",
        "created_utc": 1537559875,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of design would be necessary for exploration-based landers/rovers intended for life-bearing, rocky planets, such as Earth?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9ht41n/what_kind_of_design_would_be_necessary_for/",
        "text": "What would an “Earth rover” need to be equipped with to explore a rocky planet with life?",
        "created_utc": 1537557164,
        "upvote_ratio": ""
    },
    {
        "title": "How can our brains, which are so persistent on life, come to the conclusion that suicide is feasible, and then cling to life during a suicide attempt?",
        "author": "dahdoc",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hsfsg/how_can_our_brains_which_are_so_persistent_on/",
        "text": "",
        "created_utc": 1537552573,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be possible to build a moving lunar station/colony?",
        "author": "Ben_G_man",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hs5ud/would_it_be_possible_to_build_a_moving_lunar/",
        "text": "Hi\n\n[https://www.youtube.com/watch?v=NtQkz0aRDe8](https://www.youtube.com/watch?v=NtQkz0aRDe8)\n\nI was watching this video and it got me thinking, and maybe this has already been asked or pondered.\n\nSeeing as a day on the moon is so long (27 days), would it be possible to build a \"track\" around the moon on which a slow moving, lunar colony could be placed and powered by solar energy?\n\nIE: It would remain in direct sunlight and move at a rate around the moon of 29.5 days per rotation, to match the length of day.\n\nIs this feasible? The problems with a lunar colony that is stationary means you would have to place it at the poles to avoid dipping into the -280F (-173C) temperatures.\n\nThanks\n\nsources: [https://www.universetoday.com/20524/how-long-is-a-day-on-the-moon-1/](https://www.universetoday.com/20524/how-long-is-a-day-on-the-moon-1/)\n\n[https://www.space.com/18175-moon-temperature.html](https://www.space.com/18175-moon-temperature.html)",
        "created_utc": 1537550848,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a peak of human intelligence, and if so, how accurate can we describe that point?",
        "author": "just_a_firenope",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hs2r7/is_there_a_peak_of_human_intelligence_and_if_so/",
        "text": "",
        "created_utc": 1537550321,
        "upvote_ratio": ""
    },
    {
        "title": "What would happen to a skyscraper-sized rock if it fell through Venus's atmosphere?",
        "author": "moreorlesser",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hrnqb/what_would_happen_to_a_skyscrapersized_rock_if_it/",
        "text": "How fast would it be at each stage of the atmosphere? And how fast would it be when it hit the ground? And how long would it last upon landing? Based on pressure, gravity, and air resistance",
        "created_utc": 1537547665,
        "upvote_ratio": ""
    },
    {
        "title": "Do exploding stars expand space?",
        "author": "TenOunceTalk",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hqv4b/do_exploding_stars_expand_space/",
        "text": "I've been pondering the expansion of the universe. We know it's expanding\rfaster than it should be based on the initial bang, and in fact it is\rspeeding up. Everyone says that dark energy is pushing everything apart. I'm\rwondering if the extra expansion rate could be at least partially due to the\rbillions of massive stars that have exploded in the past. Wouldn't something\rthat large exploding actually bend or push the fabric of spacetime away in\rall directions, like an expanding bubble inside of oil? ...like microwave\rpopcorn (where the corn are stars and the bag is space).\n\nDo exploding stars\rexpand space? How do those explosions effect time and other objects? If\rexploding stars don't expand space, then what in space acts like friction to\rslow and stop the force of that explosion from continual expansion? If\rspacetime is effected by gravity, and these massive explosions give off\rgravity waves... then shouldn't these explosions be \"pushing\" space away to\rsome degree? When something explodes, it expands, so why wouldn't exploding stars expand space?",
        "created_utc": 1537542690,
        "upvote_ratio": ""
    },
    {
        "title": "What basics in the major scientific fields should every educated adult know?",
        "author": "Allen-a-Dale",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hq3t7/what_basics_in_the_major_scientific_fields_should/",
        "text": "Edit: serious replies only, please. \n\nPosted this in ask science, but was directed here- so hello!\n\nOk, A little explication. I'm working on a Common place Book and I want to devote a couple of pages each to some of the major scientific  fields. Right now I'm thinking Biology, Arithmetic, Geometry, Music Theory (maybe you guys don't consider it a science, but I'm going by more classical definitions from the quadrivium), Astronomy, Physics, Calculus, Chemistry, and Economics. \n\nI'm doing a lot of research, but I'm having trouble due to the vast amount of information I'm finding. I'm trying to filter by, basically- if you were going to give someone a couple of pages of notes on the absolute most vital stuff in each field, what would those notes include? Like, for Physics it would include F=MA and the Laws of Thermodynamics, but I'm not sure what else. \n\nSo, what would I absolutely need to understand in your field, before I could understand any of the rest of it? What are the building blocks of your field? \n\nEdit 2: I don't mean so basic that it should be common information but sometimes isn't, like with sex ed. I'm saying if I took this as a college course what would be the most important things I remember/review for the final?\n\nThanks so much for your responses! I look forward to learning. ",
        "created_utc": 1537538015,
        "upvote_ratio": ""
    },
    {
        "title": "Is there possibility of Spine fixing or even spine transplants in future?",
        "author": "Madcuz",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hpwk3/is_there_possibility_of_spine_fixing_or_even/",
        "text": "Further. Why is it many people have chronic back pain and spinal problems but the doctors only solution is to take anti-depressants? Is there no way to fix a spine why is it so difficult for science to fix people's common back problems? (more often than not caused by too much sitting and no exercise) Is there no research being done to help and fix people's backs?",
        "created_utc": 1537536725,
        "upvote_ratio": ""
    },
    {
        "title": "Would this question fit in here?",
        "author": "werefuckinripper",
        "url": "https://www.reddit.com/r/JordanPeterson/comments/9hmjbu/sidebar_tests_i_got_a_131_on_the_mensa_norway/",
        "text": "",
        "created_utc": 1537533172,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any chance of digital immortality really happening?",
        "author": "geekygeorgina",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hovmj/is_there_any_chance_of_digital_immortality_really/",
        "text": "[removed]",
        "created_utc": 1537530067,
        "upvote_ratio": ""
    },
    {
        "title": "What was the understanding of the moon in late modern Europe (before 1900)?",
        "author": "evolution2015",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9host9/what_was_the_understanding_of_the_moon_in_late/",
        "text": "I am not sure if this is more of a history question than of a science question, but probably it is a question of the history of science, so I have decided to post it here. \n\nI am a South Korean, I am quite sure that practically none of the people here before 1900 really even thought about going to the moon. They did not know it was a land in the sky. It was more of a mythical place than a real \"place\".\n\nI thought it was like that in the Europe before 1900's. But today, I encountered a YouTube video in which the presenter mentioned a novel, \"From the Earth to the Moon\", written by Jules Verne in 1856. The story was said to be shooting a space pod to the moon, using a big cannon.\n\nBut that was 1856, not 1956. Did European people that long ago already know that the moon is a land in the sky that can be visited? Since he thought of using a cannon, he must have known that the moon is relatively close to the Earth. Had I underestimated the knowledge of the moon that the Europeans had before 1900?\n\n",
        "created_utc": 1537529473,
        "upvote_ratio": ""
    },
    {
        "title": "Why doesn't the space-time fabric just tear apart under the mass of supermassive black holes?",
        "author": "BaidDSB",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hnssd/why_doesnt_the_spacetime_fabric_just_tear_apart/",
        "text": "I mean if it can stretch to infinity due to inflation, why can't it be torn apart?",
        "created_utc": 1537521408,
        "upvote_ratio": ""
    },
    {
        "title": "Entropy increasing in a box vs volume of the universe, which is increasing? Could entropy be constant?",
        "author": "michael-streeter",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hn817/entropy_increasing_in_a_box_vs_volume_of_the/",
        "text": "Hi, I was just watching the [Richard Feynman lecture on entropy](https://www.youtube.com/watch?v=rIIi_2wneYo) on YouTube and **suddenly** I had a most strange idea, so I thought I'd share it with you and ask if you think there's anything in it.\n\nIn a nutshell, atoms trapped in a box will become more and more disordered as time goes on; there's a problem though that the Universe is *supposed* to have started from a highly ordered state in order to permit/explain how disorder increases. but the problem with this (from my point of view) is you're just looking at the box with atoms in it  --  when you consider the box is actually a small, fixed size in the Universe and, as the Universe is expanding, the volume of the Universe has increased, so how does *that* affect entropy?\n\nFor example for the small box imagine a fish tank with dark-blue ink on the left-hand side and clear water on the right-hand side, after 1 hour you come back and find the tank is full of pale inky-blue water; this is contained inside a large box, the Universe, which is so much bigger 1 hour later.\n\nThe entropy of the ink/water fish tank box will go up of course, but the fish tank is decreasing in size as a proportion of the Universe it occupies and so, by the time the liquid has mixed completely, not much has changed on the larger scale.\n\nI am not a physicist -- and I'm not claiming to have the keys to the universe, just had an odd idea.\n\nSpeculation(?): could total entropy in such a system be constant?",
        "created_utc": 1537515880,
        "upvote_ratio": ""
    },
    {
        "title": "In SF films set on The Moon, you often see spacecraft stirring up clouds of dust as they land. Is that something that would happen in reality given the lack of atmosphere on The Moon?",
        "author": "Chicken_Spanker",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hn6dl/in_sf_films_set_on_the_moon_you_often_see/",
        "text": "",
        "created_utc": 1537515423,
        "upvote_ratio": ""
    },
    {
        "title": "New version of Schrodinger's cat thought experiment, gave me an interesting insight.",
        "author": "cole20200",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hn4ce/new_version_of_schrodingers_cat_thought/",
        "text": "Here is a article about an updated version of the cat in the box thought experiment.\n\nhttps://www.nature.com/articles/d41586-018-06749-8\n\nBasically, given two participants, one preforms an coin flip and then communications all quantum information to the second actor.  The second observer then applies all quantum information and guesses the coin flip.  However, there is a set of outcomes where both observers can predict the outcome with certainty, yet still have different conclusions.  Quantum theory gives an inconsistent picture of reality.\n\nSo I thought about this and I have an idea.  It is impossible for two different observers to have perfectly identical sets of quantum information, because, if they did, they would be indistinguishable from one another, they would be the same observer.  Which means that it's not possible to communicate consistent quantum information to another reference point.\n\nThoughts?",
        "created_utc": 1537514854,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with people in your life who you consider well informed suddenly revealing a deep belief in a particular fringe theory/pseudoscience?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hn2s1/how_do_you_deal_with_people_in_your_life_who_you/",
        "text": "[deleted]",
        "created_utc": 1537514374,
        "upvote_ratio": ""
    },
    {
        "title": "What If We Could Generate Electricity from Cancer Cells?",
        "author": "ibraim_corm",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hmuf3/what_if_we_could_generate_electricity_from_cancer/",
        "text": "I know they are out of the norm, but here are some thoughts I've been pondering on:\n\n1) If we hook up cancer cells that proliferate uncontrollably to  conductive wires, and expose them to ionising radiation, electrons would be released and since they're all connected to conductive wires, would this produce a flow of current? if so, how viable would this be?\n\n2) Can dead cells still release electrons (ionise) when exposed to ionising radiation even when they are considered biologically dead?\n\n3) In cancer patients, does the uncontrollable proliferate of cells demand extra energy? is this why they feel weak?\n\n4) To what extent of time would a single cell ionise, would they run out of electrons to release after a certain period of exposure to ionising radiation?",
        "created_utc": 1537511663,
        "upvote_ratio": ""
    },
    {
        "title": "How vulnerable are satellites/etc to a payload of gravel in LEO?",
        "author": "TheBananaKing",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hms0w/how_vulnerable_are_satellitesetc_to_a_payload_of/",
        "text": "I am totally not a rogue state planning to bring our civilisation to its knees. \n\nIf I *were*, however... ISTM that  getting a box of rocks and high explosive into LEO would take considerably less technical wherewithal than your average satellite launch.\n\nIs that the case - and if so, could a single payload create enough high-velocity space junk to nobble everyone else's space program?\n\n",
        "created_utc": 1537510859,
        "upvote_ratio": ""
    },
    {
        "title": "If We Could use Cancer Cells to Generate Electricity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hmqvy/if_we_could_use_cancer_cells_to_generate/",
        "text": "[deleted]",
        "created_utc": 1537510454,
        "upvote_ratio": ""
    },
    {
        "title": "How would the internet become accessible to homes and businesses if a physical telephone didn't exist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hlscg/how_would_the_internet_become_accessible_to_homes/",
        "text": "[deleted]",
        "created_utc": 1537500611,
        "upvote_ratio": ""
    },
    {
        "title": "Math doesn't treat positive and negative numbers the same, so why is it puzzling that something in the Big Bang treated them differently as well by creating more matter than antimatter?",
        "author": "RedEyedGrassMan",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hky7j/math_doesnt_treat_positive_and_negative_numbers/",
        "text": "**Edit:** For example, there is is no real square root of negatives.  ",
        "created_utc": 1537493242,
        "upvote_ratio": ""
    },
    {
        "title": "If I can see through my shadow, am I transparent?",
        "author": "GreatJobKeepitUp",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hklcb/if_i_can_see_through_my_shadow_am_i_transparent/",
        "text": "If my shadow cast on the ground is me blocking light, but I can still see what is inside my shadow, does that mean I am not fully opaque. Is light shining through me, or is there some other reason the light darkened by my shadow is still visible/not pitch black? Why aren't all shadows in general pitch black?",
        "created_utc": 1537490141,
        "upvote_ratio": ""
    },
    {
        "title": "Would the planets still orbit for a short time if the sun instantaneously disappeared?",
        "author": "forrestfire05",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hjjx2/would_the_planets_still_orbit_for_a_short_time_if/",
        "text": "Do gravity waves travel at an instantaneous speed, or are they as fast as light? \n\nIf they travel as fast as light, lets say we instantaneously removed the sun, would the planets still orbit a mass that’s not there? (till the waves hit of course)",
        "created_utc": 1537481730,
        "upvote_ratio": ""
    },
    {
        "title": "If objects cannot move at the speed of light, what is the next closest possibility for long-distance space travel? Manipulating black holes or something?",
        "author": "western_shipps",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hjfu1/if_objects_cannot_move_at_the_speed_of_light_what/",
        "text": "",
        "created_utc": 1537480839,
        "upvote_ratio": ""
    },
    {
        "title": "With theories like MOND, string theory, electric universe, primer fields, Ken Wheeler's, and others out there what do they need to solve and predict to become accepted?",
        "author": "i_see_dead_theorems",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hjc8u/with_theories_like_mond_string_theory_electric/",
        "text": "",
        "created_utc": 1537480064,
        "upvote_ratio": ""
    },
    {
        "title": "If Earth orbited a star of another type, which one would give us the best scientific data?",
        "author": "TitaniumBrain",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hiw6e/if_earth_orbited_a_star_of_another_type_which_one/",
        "text": "Is there any star type of which we don't know a lot and orbiting or would help us advance or science more.\n\nI'm assuming the conditions on earth would be the same, etc.",
        "created_utc": 1537476792,
        "upvote_ratio": ""
    },
    {
        "title": "What would a beam of negative energy look like?",
        "author": "Red_Bulb",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hhily/what_would_a_beam_of_negative_energy_look_like/",
        "text": "",
        "created_utc": 1537466945,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody want to join a new sub dedicated to constructively discussing climate change?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hhdne/anybody_want_to_join_a_new_sub_dedicated_to/",
        "text": "/r/climate_discussion\n\nWe can discuss geoengineering ideas, energy ideas, CO2 capture tech, ecological implications, or what a person can do to have an impact.\n\nI'd love to bring in some more scientific voices. \n",
        "created_utc": 1537465899,
        "upvote_ratio": ""
    },
    {
        "title": "If I take an ovum/egg and inject my own DNA (like they did in the clone experiments with the mother 1/mother 2 sheeps) and fertilize it with sperm which has my own DNA, do I get a child, which consists of the same basic DNA but looks different because of genetical crossing over?",
        "author": "Frommhunter",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hh230/if_i_take_an_ovumegg_and_inject_my_own_dna_like/",
        "text": "Bonus question: Technically it's not a clone, so does it die faster like a clone too?",
        "created_utc": 1537463462,
        "upvote_ratio": ""
    },
    {
        "title": "How come all animals in nature have different subspecies and humans don't?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hgsjb/how_come_all_animals_in_nature_have_different/",
        "text": "[deleted]",
        "created_utc": 1537461499,
        "upvote_ratio": ""
    },
    {
        "title": "Which branch of science do you feel is most severely \"lagging behind\"?",
        "author": "Estcoy",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hgm3x/which_branch_of_science_do_you_feel_is_most/",
        "text": "Or alternatively, which one do you feel is most advanced for our time?",
        "created_utc": 1537460178,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the effects of a (lethal) microwave directed-energy weapon on the human body, and how would a person hit by such a beam react?",
        "author": "I_Resent_That",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hgeof/what_would_be_the_effects_of_a_lethal_microwave/",
        "text": "I'm aware of a [non-lethal microwave beam weapon](https://en.wikipedia.org/wiki/Active_Denial_System) whose intended use is crowd dispersal, but if the technology was adapted for battlefield, anti-personnel purposes, what would the effects be? What would happen in the body and how would this manifest in the targeted person's reactions? ",
        "created_utc": 1537458689,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the ways the scientific community would be interested in using a very large, very cheap source of energy that are currently impossible due to lack of availability or too steep a price?",
        "author": "RusticBohemian",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hfruj/what_are_some_of_the_ways_the_scientific/",
        "text": "",
        "created_utc": 1537453832,
        "upvote_ratio": ""
    },
    {
        "title": "Do the physics governing stellar evolution allow a star to form and achieve Hydrostatic equilibrium in 2-Dimensional space?",
        "author": "Legendtamer47",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hfnpz/do_the_physics_governing_stellar_evolution_allow/",
        "text": "The process of stellar evolution, and the physics that govern it, are always presented in 3d space. I was curious how stellar evolution would differ if it had to adhere to the limitations of 2d physics.\n\nSince a 2d star would be a flat circle rather than a sphere, would it have the same radius as a 3d star of the same mass? Could a 2d star achieve Hydrostatic Equilibrium?\n\n\n\n(BTW I'm cross-posting this question from AskScience just in case the mods there reject this question.)",
        "created_utc": 1537452930,
        "upvote_ratio": ""
    },
    {
        "title": "If we invent exotic methods of storing energy, such as kugelblitzes and antimatter, would antimatter and kugelblitz storage be easier to control in microgravity than on a planet?",
        "author": "JoshuaSlowpoke777",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hfav6/if_we_invent_exotic_methods_of_storing_energy/",
        "text": "Basically, would it be best for antimatter and kugelblitz batteries to be put into orbit, as opposed to being built on the ground?",
        "created_utc": 1537450114,
        "upvote_ratio": ""
    },
    {
        "title": "How would wormhole travel affect time?",
        "author": "SalieriC",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hfaof/how_would_wormhole_travel_affect_time/",
        "text": "Hi there.\n\nSo if we could create a wormhole to travel from one place to another, maybe from Earth to a planet in another galaxy with water, atmosphere, etc, if this would be possible, how would that affect the time? Could we travel to this planet stay a minute and travel back to arrive at the Earth on t+1 minute? Or would traveling through a wormhole also be like traveling through time?\n\nThank you in advance.",
        "created_utc": 1537450074,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the environmental effect if every household had an extra medium size potted plant?",
        "author": "earthismycountry",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hemt9/what_would_be_the_environmental_effect_if_every/",
        "text": "",
        "created_utc": 1537444367,
        "upvote_ratio": ""
    },
    {
        "title": "Why is it possible for the water molecule to be immunogenic?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hdvus/why_is_it_possible_for_the_water_molecule_to_be/",
        "text": "[removed]",
        "created_utc": 1537436344,
        "upvote_ratio": ""
    },
    {
        "title": "What interesting facts and figures shall I put in my essay about \"Global Warming &amp; Climate Change\"?",
        "author": "MoralBrigade",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hc1xf/what_interesting_facts_and_figures_shall_i_put_in/",
        "text": "So my essay paper is coming next week and this sounds a very likely topic to come in exam so what stats shall I put in my essay to make it more interesting? ",
        "created_utc": 1537415706,
        "upvote_ratio": ""
    },
    {
        "title": "How does adding the concept of dark energy and a universe that is constantly accelerating as it expands not conflict with Einstein's theory of relativity that is dependent on the idea of intertial frames of reference? (continued in post)",
        "author": "TheJeremyHammons",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hbz5n/how_does_adding_the_concept_of_dark_energy_and_a/",
        "text": "How does adding the concept of dark energy and a universe that is constantly accelerating as it expands not conflict with Einstein's theory of relativity that is dependent on the idea of intertial frames of reference? Especially if scientists do not know where the center of the universe is, which would be the point that everything was expanding from. If the universe was constantly accelerating as it expands from some unknown point, then how could they ever prove that the theory of relativity is actually true? So either the universe is NOT constantly accelerating as it expands from some unknown point, OR you can never prove or verify that the theory of relativity is actually true. So which one is it? Let me make clear that I am not saying that Einstein was wrong. I am simply saying that if the universe actually is constantly accelerating as it expands from an unknown point, it means there is no way we could ever know if he was right. It would seem we can know that something needs to change in our understanding of the universe one way or the other. So what do you guys think needs to change about what we think we know about the universe?",
        "created_utc": 1537415002,
        "upvote_ratio": ""
    },
    {
        "title": "Would it be possible to extract eggs from a fetus, fertilize them and produce a child from it?",
        "author": "I_SMELL_A_KARMAWHORE",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hbw00/would_it_be_possible_to_extract_eggs_from_a_fetus/",
        "text": "",
        "created_utc": 1537414200,
        "upvote_ratio": ""
    },
    {
        "title": "Why can't we just breed coral reefs to be able to survive warmer oceans?",
        "author": "Jayant0013",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hbpml/why_cant_we_just_breed_coral_reefs_to_be_able_to/",
        "text": "",
        "created_utc": 1537412565,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think of paywalls in Science?",
        "author": "BarbaBlannk",
        "url": "https://www.reddit.com/r/AskScienceDiscussion/comments/9hauq1/what_do_you_think_of_paywalls_in_science/",
        "text": "  I recently was looking for math publications to give me ideas for my thesis for my math undergraduates studies, but I was confronted with so many paywalls that made me really mad, I know there is sites like Sci-hub or lib.gen, but still I like the free software movement and reading a little bit more discover Free culture, this moment is described in Wikipedia as follows.The free-culture movement is a social movement that promotes the freedom to distribute and modify the creative works of others in the form of free content or open content without compensation to, or the consent of, the work's original creators, by using the Internet and other forms of media. The movement objects to what they consider over-restrictive copyright laws. Many members of the movement argue that such laws hinder creativity.They call this system \"permission culture.\" \n\n- So how the actual system of publishing in science has affected your scientific work?\n- Do you think science get slowed since not many universities has the money to pay for publications.\n- Can we do something similar like free software in science?\n- No, why?\n- If you think the answer is yes, what disadvantages do you see?\n- What do you think of people having recognition for arbiter an article (Public identity of arbiters)?\n- What about this publications where you pay so people have access?\nI been reading a lot of the theme and I saw many people with good arguments for either side, if you would like to share me your opinion, this would be nice, could you please specify your discipline.",
        "created_utc": 1537405182,
        "upvote_ratio": ""
    }
]