[
    {
        "title": "Neighbor wants to “borrow” my spouse",
        "author": "Rapunzel_Fitzherbert",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzndis/neighbor_wants_to_borrow_my_spouse/",
        "text": "I realize that title sounds pretty shady but I promise this isn’t the intro to an adult movie.\n\nWe live in a quiet neighborhood, where everyone is pretty friendly with one another.  A few months ago, my neighbor, “Lisa” stopped my spouse outside and asked if he could help her replace a light bulb she couldn’t reach since she didn’t have a ladder. (He was outside with a ladder, which is what started the conversation.) He was happy to help, she thanked him by baking some cookies, which I thought was really nice, all was well. \n\n….ish. When she dropped off the cookies, he wasn’t home. She asked if we could exchange numbers in case of emergency.  Several other neighbors have my number, so I thought nothing of it. \n\nI should probably add ages in here- we are mid/late 30s and she is in her late 50s. Younger than my parents, seems to be in great shape, definitely not a feeble old lady or anything of the like. \n\nSeveral times since then, she has called me to ask if he can do some favor or stopped him in the driveway as he’s coming home from work to ask for something.  The last time, this was presented as an “emergency” (noise in her basement- which is not accessible from inside the house.)\n\nHe was working a 12 hour shift and hadn’t made it home yet- I told her as much and suggested that if she was really concerned, she call the police and have them come check it out.  I don’t think she liked that answer, but really, wtf could he even do in that situation?!\n\nEvery time she calls me to ask after him, she tells me how lucky I am to have him and not live alone.  I do feel badly for her on some level, because I think she is just lonely, but part of me is bugged that she seems to think my spouse is a free handyman, part of me is bugged that she goes through me most of the time to get to him, and part of me is bugged that she can’t call a professional or deal with it herself. \n\nI guess I mostly needed to vent, and also ask for advice. We want to be good neighbors that you can call on in a pinch, but also aren’t running a handyman/boogeyman checking service.  \n\nHow can we keep the peace here?",
        "created_utc": 1672467704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone ended a friendship without giving an explanation? What happened?",
        "author": "BossAntique7777",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzlsuv/anyone_ended_a_friendship_without_giving_an/",
        "text": "[removed]",
        "created_utc": 1672462465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some women get to be protected and taken care of while others have to fend for themselves?",
        "author": "AdDecent2538",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzkh7x/why_do_some_women_get_to_be_protected_and_taken/",
        "text": "I am 30 and I’ve never had a man in my life. I’ve spent my life observing though how some women (actually most) get to be taken care of by men. Even over simple things like they’ll get them a cab or buy them a drink. Or big things like provide a place to stay or go on travels. But it’s really the simple things that get me, how easy it is for women to accept having a lunch bill paid. I don’t know what’s wrong with me that this far in life I have struggled and suffered so much and can never find a man. And it’s not an attractiveness problem, I used to be a signed model and I guess that’s why I know so many women that are taken care of. I guess my problem is I never saw men as a financial fix, It’s always genuinely been my dream to find love. But I never found love so I ended up not just loveless but also broke. The good thing is I am getting my finances on track now (while burning out regularly and sacrificing my mental health and physical due to crazy long hours). But it’s fine it’s just that now that my finances are okay the only thing that’s left to do is find love and I’m just stuck at this question during the process. Why is it so easy for some women? Why does it seem to find them?",
        "created_utc": 1672458249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Needing a little guidance",
        "author": "ritzbitz107",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzkaa0/needing_a_little_guidance/",
        "text": "I could use some advice to help navigate through this rough spot in life.\n\nI'm feeling a little lost. I'm in my mid-thirties and about to finally graduate with my undergrad. It took a long time for me to get here but now I'm having doubts about my career choice. I've started the most basic, entry level position in my field and I'm absolutely struggling. I feel so incredibly defeated and now wondering if my career path will help me feel fulfilled. The team I work with is incredible and are super reassuring but I have this awful quirk where I pick up on the most smallest changes in body language and it's telling me otherwise.\n\nI've also realized that I no longer have a strong friend group and it's making me feel very lonely. I've always been pretty introverted and kept the same handful of friends from late teens/ early 20s until now. I still keep in touch with them but they're all married and have children and hardly have any time outside of the daily \"Good morning\" texts. I struggle to make friends. It absolutely terrifies me to go up and actually chat with someone I don't know.\n\nMy current relationship is not fulfilling for a multitude of reasons that I am hoping to fix. We share no common interests and most of the time, he just acts annoyed with me. Also, the last 3 years, I've been questioning my sexuality...\n\nAnd on top of all of that, I'm starting to suspect that I'm on the spectrum. But would it really matter at this point if I was officially diagnosed with it?\n\nI have tried therapy to help with some of these issues and it was an awful experience. I did not feel safe or heard. So, for anyone who has gone through something similar, what helped you through this time?",
        "created_utc": 1672457657,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find balance between self improvement and perfectionism?",
        "author": "kiki7865",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzjxjd/how_to_find_balance_between_self_improvement_and/",
        "text": "I’m always trying to improve myself- whether it’s focusing on my hobbies so I get better, trying to make the perfect diet plan that is balanced and sustainable, having the perfect amount of clothes and decluttering/shopping consciously, learning a language, getting great grades at uni, becoming more charismatic, less selfish, and a better friend, finding my perfect color palette, making lists of all the nicely made and expensive things I want to buy for my future home, curating and labeling my personal and interior design style, etc…\n\nThe list goes on and on. But I feel an anxiety around the whole process of “becoming” the woman I want to be. I don’t want to become stagnated either.\n\nHow did you all approach making every area of your life the best it could be? How can I keep moving towards my ideal self without being caught up in perfectionism?\n\nI can’t seem to tell when I’ve crossed over that line or not.",
        "created_utc": 1672456622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you observe/judge men based on the credit card they use?",
        "author": "IslandGirl21X",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzia8y/do_you_observejudge_men_based_on_the_credit_card/",
        "text": "Do you observe/judge men based on the credit card they use? \n\nEx: Visa/Mastercard/Amex, and then do you observe the color of their card, etc.",
        "created_utc": 1672451898,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keeping up the tree...",
        "author": "lonelyandsadturtle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzg4al/keeping_up_the_tree/",
        "text": "Has anyone kept up the tree all year round and just decorated for the different holidays? I am *extremely* tempted to do this because, honestly, I'm being lazy as fuck lol I'll admit it.",
        "created_utc": 1672445926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Torn on reaching out to former friend",
        "author": "elle_hopper011",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzeyi4/torn_on_reaching_out_to_former_friend/",
        "text": "I’ll try to explain this as neatly as possible, but I’ll apologize in advance as it’s a bit of a messy story: \n\nI was friends with “Tami” for many years. Tami was an amazing friend in so many ways. However, I ended up needing to distance myself for quite some time when she couldn’t respect boundaries regarding my personal space and time.  Mainly, it was calling and texting incessantly to vent about various things. I was becoming emotionally exhausted and it was infringing on my time with my family and other friends. \n\nOur other issue was that while Tami wanted my time virtually, she would complain about not seeing me enough in person- despite my efforts to make it happen. We would make plans, she would cancel last minute, and when I would try to reschedule, she would insist on dates where I already had a standing commitment.  I would hold firm, she would get upset, rinse and repeat.  Basically, I felt that she wasn’t respectful of my wishes or time. \n\nThat being said, I would have been thrilled to have kept the friendship going with some understood boundaries. This worked for awhile and I was enjoying our friendship again. \n\nThat went down the drain a few months ago. Tami invited me, very last minute, on a trip that was a week long and several thousand dollars. When I declined, she became very passive aggressive. (I politely and firmly declined- I don’t believe we owe people excuses when we say no, but I told her I couldn’t take a vacation at work without notice, and couldn’t really spend that kind of money without budgeting for it.) She basically argued with my reasons (exhibit number one of why I generally just say “no thanks”) and just….quit talking to me. \n\nI was hurt, but felt it was for the best as her behaviors and reactions were taking up too much of my headspace trying to make sense of them, so I gave her space. \n\nI recently found out that Tami lost a parent this week unexpectedly.  Her parents had her young and are not that much older than Tami, in the grand scheme of things, so I know this was shocking and hurtful.  \n\nI would really like to express my condolences. However, I feel like in doing so, I am opening up the line of communication and I really would rather not do that. I had thought of sending flowers or a card, rather than a text or something; but I would really prefer that we not open the floodgates. \n\nHow do I handle this?  Is it worth it to reach out?",
        "created_utc": 1672442955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Curious, do pregnant women like having their big bellies? What’s that like?",
        "author": "RealSCC",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzeer0/curious_do_pregnant_women_like_having_their_big/",
        "text": "",
        "created_utc": 1672441550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lonely in 30s",
        "author": "Background_Dazzling",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzebtt/lonely_in_30s/",
        "text": "Does anyone else feel lonely in their 30s? And have 0 friends or social life?  Has anyone overcome this or got any tips?\n\nI have husband and daughter. But 0 friends.    I've been this way for years and the problem is compounded by working from home. \n\nEven if I don't make friends, I would love to have acquaintances or social contact by a club or shared interest but I don't know where to start.  I've become so socially awkward after 3 years of working from home and only communicating with my family, I worry if I joined a club, I wouldn't be socially accepted 😞  it's so lonely.",
        "created_utc": 1672441341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Divorced women who regret getting married...",
        "author": "Laugh-at-the-Moon",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzdrhf/divorced_women_who_regret_getting_married/",
        "text": "What was your original view on marriage? (Excited and always wanted it since a kid or just happened complacency, etc *what is your perspective?) What age(ish) did you get married? How long was your marriage? What is the reason you regret getting married? \n\nFor context: I'm starting to age &amp; my almost nine year boyfriend hasn't proposed. I never really cared about or even thought about it before but I want it with him. I don't see us ending &amp; I'm getting old - running out my youth with him.\n\nI'm also beginning to idealize it in my mind. I have considered proposing but I know that I have a lot going on in my head and I need to get focused, and get some perspective to counteract the idealizing my brain is doing.",
        "created_utc": 1672439934,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you get out of the loneliness funk?",
        "author": "wishfulthinker1479",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzd3o5/how_did_you_get_out_of_the_loneliness_funk/",
        "text": "I (33F) think it’s just a combination of things just not working out for me.\n\nRomantically, endless amounts of men interested, but I can’t seem to mutually connect with someone to take it to the next level. Also tired of men after me for just sex. It’s really starting to get insane with that. I always state what I’m looking for and that I won’t have sex right away, I don’t put out sex vibes, but they just push and push and push. And it’s all kinds. It’s not my picker. They’re all very different from the next. Age, job, personality, looks. \n\nWork, I don’t like it this year and am just a bit bummed overall about it. I can’t change who I work with, only my interactions with them, but they are still energy sucking vampires. \n\nFamily, see recent post. \n\nNothing is sooo wrong though that I could say I have a bad life. I’m healthy, I have emotionally supportive friends, I pay my own way, interesting and interested in a variety of hobbies, god damn it, I’m fun! And I need a human to share this with. \n\nI think I’m just lonely and don’t want to be anymore. And I know I can’t force a relationship, but I prefer to be in one. There is something special and irreplaceable about a relationship with a man for me. I’m fine alone, I don’t go insane or do weird shit to cope, I’m just so ready to be in something long lasting and intimate. And I need sex, but with someone safe and respectful. That’s the really tough part about being alone. I can’t just go be with randoms. There’s no feeling/enjoyment. \n\nI don’t know, did anyone ever feel like me, then something happened where it all magically fell into place? I guess I’m just looking for hope or different ways to cope. Or maybe just hard truths.",
        "created_utc": 1672438261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tomorrow is New Year’s Eve and I just spent the last 1 hour crying after putting my children to sleep",
        "author": "Me1you1",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzd1vx/tomorrow_is_new_years_eve_and_i_just_spent_the/",
        "text": "I think the title pretty much sums it up. This year had been very shitty to say the least from suffering major heart attack out of no where at 36 to loosing everything to having to need food bank to feed my children.\n\nI don’t believe in New Year’s resolutions because I have always feel if you really want to make a change about anything in your life you don’t need new year to start and can make small changes anytime but and this is a big BUT I’m forced to completely start over and from scratch. I’m determined to change my situation somehow. I have started by enrolling myself into a design course that starts in January (wish me luck)\n\nSo ladies how was your 2022? Good? Bad? Ok? Do you have any resolutions (if you make them) for 2023?\n\nHere's to what's to be in 2023!",
        "created_utc": 1672438144,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's put together a New Year's Eve Spotify playlist!",
        "author": "isla_21",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzcyyn/lets_put_together_a_new_years_eve_spotify_playlist/",
        "text": "What songs would you like to put on the playlist? All genres welcome — I'm happy about inspiration! (If you like, I'll compile the list at the end up here.)",
        "created_utc": 1672437945,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA or am I being too sensitive? — Girlfriends and different values",
        "author": "DontBelieveDaHypeee",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzc0xr/aita_or_am_i_being_too_sensitive_girlfriends_and/",
        "text": "Hello! This has been weighing on me quite a bit and I need some neutral opinion.   \n\n\nI came back to my hometown for the holiday break. I caught up with some old girlfriends (from high school, university days, etc). After a few dinners with these friends, I realized I was very unhappy meeting up with these people—because our values are apparently quite different.   \n\n\nI'm not trying to say that I'm a saint—I'm extremely imperfect and have made my own mistakes—but I really try not to be judgemental; I understand everyone is dealing with their own stuff. I really don't like the extreme divides that social media has fostered, and I genuinely believe that people can be friends even if you have different political views and life values.  \n\n\nBut these last few dinners really caught up to me. I was trying to be polite, but I honestly was so fed up that I just tuned out or kept a poker face. These were different groups of girlfriends, but there were a few that I felt were making such toxic, negative comments. They'd either be about (1) gossip: who broke up, who got plastic surgery; (2) racist/classist views: how we deserve to have maids and control their lives because they don't know any better; (3) derogatory comments about Muslim women and indigenous people; (4) men: talking about these men that they'd hook up with (guys who were known to sleep around, do illegal things, etc); among other things.   \n\n\nOne of the especially inflammatory girls I understand has had her own personal trauma. Perhaps she says those things to get attention. But she's also done other selfish and mean things that I would never do to a 'friend'. I know it's time to cut ties. I also know that they make fun of me for being 'woke' and would call me up for being uppity and self-righteous if I were to unfriend them. I want to focus on myself, being a better person, and giving back to my community, instead of talking about such negative BS. I've just tried to ignore it (and those individuals).   \n\n\nBut am I being too judgemental, dramatic, and self-righteous for wanting to move away from these friendships that don't align with my values? How have you dealt with 'friendships' like these? It sucks (for both sides) when a friendship dies—and I really treasure the people in my life. I just don't know if I can deal with this anymore.",
        "created_utc": 1672435613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Positive experiences with therapy over Zoom?",
        "author": "laidbackbeerlady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzbm1k/positive_experiences_with_therapy_over_zoom/",
        "text": "Greetings and happy soon-to-be 2023 to my favorite Reddit group.\n\nSo I am about to engage on some short-term therapy through my work’s EAP to work through some personal issues that largely involve my marriage. I had the EAP company “find” an appointment for me after calling a few places on my own didn’t work out. I requested that they find in-person because I’m not keen on the idea of kicking my husband out of the house so I can do a zoom call from home, and I have no interest in just talking on the phone. (I like the in-person touch.)\n\nThe EAP lady said it took forever to find someone because the vast majority of their therapists offer only virtual therapy these days, but she found someone who does both. Great! I called the lady, and she seems nice, but she immediately asked if I was okay with virtual therapy because she is older and doesn’t want to get COVID. I was hesitant but said I would try it.\n\nFor those who have tried it, what do you think of zoom therapy? Did you find it as effective as in-person? Where did you do it from? If you live with others (including/especially folks you may want to talk about), did you explicitly ask them to leave ahead of time?\n\nI’m not keeping it a secret from my husband that I’m going to therapy, and I have no domestic violence concerns. I just am hesitant about virtual because of the awkwardness of asking him to scram and generally prefer an in-person encounter for talking about personal things.\n\nThanks, friends!",
        "created_utc": 1672434582,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you look back on your 'partying' years?",
        "author": "Critical_Teaching_35",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzbba9/how_do_you_look_back_on_your_partying_years/",
        "text": "I'm 23F on a trip around Europe with a tour group of people under 30 and we just landed in Prague. Everyone is going out to the clubs but I've been clubbing before and just don't care for it; I don't drink, it's expensive and I don't like crowds. I feel like as a 20 something year old these are the kinds of memories every adult has and I'm missing out on making them. I know if I go out I'll be bored and wish I had stayed in and if I stay in I'll be thinking about everyone having a good time at the club. Idk how to be comfortable with this feeling",
        "created_utc": 1672433879,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to throw a better party?",
        "author": "ALLNEWstratuponavon",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzb91j/how_to_throw_a_better_party/",
        "text": "Having a small party. My friends tend to cluster in one area and sit around and talk in a big group and frankly, it gets kinda boring. But then we're all kinda stuck there, too awkward to leave the group.\n\nHow do I get them to spread out into smaller groups and engage in deeper conversations/activities? My partner and I joked about being in different areas at all times and carrying walkie talkies to alert each other of our movements.",
        "created_utc": 1672433720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for going out alone?",
        "author": "lunardoggo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zzagwt/tips_for_going_out_alone/",
        "text": "I (31f) am recently single and have tickets to a burlesque show at a small local music venue for NYE. I am so excited about the show and getting out but feel so awkward going by myself when the place is full of couples or groups. On Halloween I went to a local music show at the same venue and enjoyed the show, but felt so awkward and anxious. I did try to mingle and make small talk but couldn't really connect with anyone. \n\nAny tips for situations like this? I don't want to miss out on things just because I don't have anyone to go with, but can't shake the awkward and anxious feelings.",
        "created_utc": 1672431752,
        "upvote_ratio": 1.0
    },
    {
        "title": "high heels and nights out",
        "author": "petit_aubergine",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zza7ml/high_heels_and_nights_out/",
        "text": "hi ladies! when i was in my 20s i wore heels to parties all the time and sometimes to work too. i’ve never liked heels and phased them out in my 30s but now that i’m “an adult” sometimes it seems like i should put a pair of heels on for nicer occasions. for example on christmas eve i had a nice dress, tights and jewelry on but opted for my cleanest nikes for dinner. i have a 40th birthday for a friend coming up and we’re going to fancy places for drinks and dinner. she’ll def be in heels. i want to dress up but i can’t fathom being uncomfortable all night. any one else find themselves in this conundrum? what are other age appropriate shoe styles that are nice for a night out?",
        "created_utc": 1672431130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting off hormonal birth control",
        "author": "Mediocre-Shirt-6621",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz9r8d/getting_off_hormonal_birth_control/",
        "text": "I recently discontinued hormonal birth control after being on the pill for the last 8+ years and had implanon before that for 3 years. I’ve never felt a strong maternal urge (even before bc), usually felt very undecided about whether or not I ever wanted to have kids. I’ve always gone back and forth A LOT. Well the last 2-3 months off of bc I have developed VERY intense baby fever. It’s all I think about and for the first time in my life I want to prioritize a having a baby over everything, including my career which has always been my biggest priority. That’s been the biggest shock for me. I finally feel ready (?) but I’m worried this is some odd side effect of my body beginning to normalize back to a natural cycle. I’m trying to be patient and not rush anything but the thought of reproducing has taken over. My relationship had gotten somewhat stagnant over the last several years and now these feelings have transformed how I feel about my partner (for the better). Btw he’s also extremely supportive of me in general, he seems to be happy about my baby fever, and has always wanted kids. \n\nI read that there’s no known link between baby fever and hormones, and women who get baby fever are actually experiencing an “existential” crisis or that baby fever is caused by social expectations. Based on my experience it’s hard for me to believe that it’s not hormonal and I suddenly am newly concerned with my existence and it just so happens to be at the exact same time I stopped birth control. Way too coincidental to be true, in my opinion.\n\nHas anyone experienced this? Did the feeling go away eventually or change? Did you act on these feelings or wait for them to pass? Hoping it’s not just me!",
        "created_utc": 1672430027,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you find your friends?",
        "author": "roses369",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz8n85/how_did_you_find_your_friends/",
        "text": " I’ve been curious, how do people out of school/college find friends? That’s how it seems people make them. \n\nHave you had any success finding friends through different means, other than work?\n\nI like hearing stories on how people found their friends. I find of reassuring i will one day find a few friends I really click with. In the meantime, I’m just navigating my way, finding who is supposed to me in my life and when.",
        "created_utc": 1672427299,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you met your partner on a dating app, which app and what was your experience?",
        "author": "ShoreMama",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz8e6p/if_you_met_your_partner_on_a_dating_app_which_app/",
        "text": "I’ve tried Facebook dating and hinge.  Dating pool was really small on hinge and I met someone on Facebook dating but it didn’t work.  I decided to start fresh and made a tinder account (not for a hook up, I know 2 people that met boyfriends on there) but so far I’ve only found men with no kids and I’m really looking for a single parent.  I was gonna try stir next but I don’t know anyone that had any luck on there so I figured I’d try a more popular one.\n\nTo be clear, the guy doesn’t have to have kids but in my experience I’ve never been able to date a guy with no kids because they never understand I can’t just drop everything.  I really would like to start dating and I’ve made an effort to set aside time for a potential partner.  I think I’m ready but I’m discouraged for sure.  The older I get (I’m 36) the less likely it’ll happen.  I mainly just work and work on my singing videos (I have a tik tok following and actually made a lot of friends on there) but I don’t think tik Tok is the place to look for a partner lol. \n\nCan you give me any tips or suggestions on how to find the ridge guy and what app you used particularly if you’re a parent?",
        "created_utc": 1672426700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting off hormonal birth control",
        "author": "Mediocre-Shirt-6621",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz8cbq/getting_off_hormonal_birth_control/",
        "text": "[removed]",
        "created_utc": 1672426571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting off hormonal birth control",
        "author": "Mediocre-Shirt-6621",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz7oyw/getting_off_hormonal_birth_control/",
        "text": "[removed]",
        "created_utc": 1672424934,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with family that play favourites?",
        "author": "throwaxmastantrum",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz7lco/how_do_you_deal_with_family_that_play_favourites/",
        "text": "[removed]",
        "created_utc": 1672424664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ladies that reconnected with an absent parent, did you feel like it wasn’t too late to build a relationship?",
        "author": "CheesyBrie934",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz6mvj/ladies_that_reconnected_with_an_absent_parent_did/",
        "text": "I always hear that it’s never too late to form a bond with an absent parent, but I personally don’t believe it. Has your experience matched this statement (minus my opinion)?",
        "created_utc": 1672422399,
        "upvote_ratio": 1.0
    },
    {
        "title": "I get sick everytime the daughter comes",
        "author": "New_Peanut_9924",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz6lu5/i_get_sick_everytime_the_daughter_comes/",
        "text": "My(34f) partner (C 38m) has a 10yo(v)  from a previous marriage. This is not a post questioning how I feel about her or anything. I love this kid regardless of what I’m about to tell you. Okay:\n\nSince my partner and I moved in together about a year and a half  ago. C’s daughter V has stayed with us 3 times since then. Before the first time she came over, I sat my partner down and explained that in past relationships, the kids tore my stuff up. I asked that he would sit her down and tell her. He said he did but then the following happens. \n\nEvery time she comes over, something is broken or ruined. The first time was an eyeshadow set. Digs and scraps, the black mixed with the white. So I addressed it with him. He apologized and said she won’t do it again.\n\nThe second time, I went to work and came home to my shower broken. V confessed they did it. \n\nThis last time she broke a macrame hanger from the wall and just threw it back on the wall. Again I addressed C and he apologized. \n\nOn top of this shit, she gets me so physically sick. Every single time. Her mother is a nurse and she’s 1 of five kids under the age of 15. I’ve been sick with the flu and bronchitis since Sunday. \n\nI have no idea what to do. I’m at my wits end and I can’t breathe because of the Petri dish of an offspring. \n\nWhat’s your advice?",
        "created_utc": 1672422328,
        "upvote_ratio": 1.0
    },
    {
        "title": "F19 Shaving question",
        "author": "LauraLushWinter",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz5cgg/f19_shaving_question/",
        "text": "I am asking in this group because of the experience you can offer. \n\nRegarding under arms, does your hair get thicker and more prominent as you grow older ? I have dark hairs which I shave every 2 or 3 days but they are patchy and sparse if that makes sense (I can send a pic if you wish) but I look at slightly older women and they have a circle of stubble all even etc.  \n\nSo mine would be like a lawn with bold patches between the grass 🤪",
        "created_utc": 1672419293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who decided to spend less time on social media or straight up quit all together, how did you face the constant FOMO?",
        "author": "balrogbellyrubs",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz4e2e/women_who_decided_to_spend_less_time_on_social/",
        "text": "I spend way too much time on social media, and I'm not even one to post much of anything, besides the occasional life update or some photos from a random trip/vacation. This equates to about 1-2 posts a month. I only post on Facebook, but I have an Instagram and a Snapchat because I don't want to miss any posts from anyone important. I've always prided myself in not posting as much as others. I like to actually live in the moment, and not worry about capturing what I made for dinner last night. All notifications are also shut off. \n\nBUT...  My phone has clocked me in at 5-6 hours of daily use on my phone. I am one of those people who are constantly scrolling. And once I go through all of my socials, I'll check them all again without even realizing it. It's so bizarre. \n\nI've noticed this cycle in the past, so I'll delete all socials besides Facebook. I'll delete the app, so if I want to go on Facebook, I'll have to open the browser. And I'll go about a month or two without scrolling aimlessly on my phone. But then the FOMO hits, I'll redownload all of them, and the cycle continues. \n\nThis time I want it to be different. I want to keep just one social media, Facebook. However, I want to deactivate it. If there's an important update either by me or from someone important, I can sign in whenever I would like. Everything else will be deleted and that's that. \n\nMy question is, how do I fight the aggressive FOMO? \n\n*Side note, I don't want to delete Facebook all together because there are some memories/words from my parents on there, who have now both passed.",
        "created_utc": 1672416934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who decided to spend less time on social media or straight up quit all together, how did you face the constant FOMO?",
        "author": "purplepotato37",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz4d0z/women_who_decided_to_spend_less_time_on_social/",
        "text": "I spend way too much time on social media, and I'm not even one to post much of anything, besides the occasional life update or some photos from a random trip/vacation. This equates to about 1-2 posts a month. I only post on Facebook, but I have an Instagram and a Snapchat because I don't want to miss any posts from anyone important. I've always prided myself in not posting as much as others. I like to actually live in the moment, and not worry about capturing what I made for dinner last night. All notifications are also shut off. \n\nBUT...  My phone has clocked me in at 5-6 hours of daily use on my phone. I am one of those people who are constantly scrolling. And once I go through all of my socials, I'll check them all again without even realizing it. It's so bizarre. \n\nI've noticed this cycle in the past, so I'll delete all socials besides Facebook. I'll delete the app, so if I want to go on Facebook, I'll have to open the browser. And I'll go about a month or two without scrolling aimlessly on my phone. But then the FOMO hits, I'll redownload all of them, and the cycle continues. \n\nThis time I want it to be different. I want to keep just one social media, Facebook. However, I want to deactivate it. If there's an important update either by me or from someone important, I can sign in whenever I would like. Everything else will be deleted and that's that. \n\nMy question is, how do I fight the aggressive FOMO? \n\n*Side note, I don't want to delete Facebook all together because there are some memories/words from my parents on there, who have now both passed.",
        "created_utc": 1672416868,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m 31 y/o, eat relatively healthy, HIIT &amp;/or strength training 3-4 days a week yet gaining weight. Any ideas as to why this is happening?",
        "author": "burgerzandburpeez",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz47xe/im_31_yo_eat_relatively_healthy_hiit_or_strength/",
        "text": "Not sure if my body is changing as I age so I just can’t eat the same food anymore without paying the consequences. \n\nThe thing is, the scale has stayed the same but most of my jeans don’t fit me anymore and I can see my body getting larger (not with muscle). \n\nI do notice I snack a lot these days which I’m reading is not the “healthiest.” Tons of benefits to intermittent fasting so I’ll likely try that, but I’m so confused about this weight gain.",
        "created_utc": 1672416536,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do? I changed my mind about kids",
        "author": "cheesepizza61",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz40rr/what_would_you_do_i_changed_my_mind_about_kids/",
        "text": "[removed]",
        "created_utc": 1672416074,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do with photos and mementoes?",
        "author": "purasangria",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz4083/what_to_do_with_photos_and_mementoes/",
        "text": "I have several boxes of photos and mementoes that I can't hear to discard, but also don't really know how to safely store so they don't get gross or ruined.\n\nWhat are you all doing with things like yearbooks, family photos, travel memorabilia, and such?",
        "created_utc": 1672416039,
        "upvote_ratio": 1.0
    },
    {
        "title": "38- random kid called me 'that old lady o et there's today",
        "author": "Objective-Winter-633",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zz3m5q/38_random_kid_called_me_that_old_lady_o_et_theres/",
        "text": "Feeling kinda down. \nTook my kids to a science center.\nI'm 38... A little overweight...\nI was holding my toddler over a sand display of mountains and this rude little girl \nCalled me 'that old lady over there's and was laughing at me \nSo lame that it bothered me \nBut I've already been feeling like shit about my looks \nGot called a deaf blind hag by a loved one the other day and this just added to that \nSelf esteem is in the toilet \nFeeling so discouraged 😔 \nI never felt really ugly before. People really see me that way 😔 not a great feeling.",
        "created_utc": 1672415120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cried for a good reason on my 34th birthday",
        "author": "micumpleanoseshoy",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyxvix/cried_for_a_good_reason_on_my_34th_birthday/",
        "text": "Last year I was celebrating my birthday with my ex in Paris. This year I celebrated in the middle of moving apartment and all, but mentally I was so much \"cleaner\" - I didn't have any mental burden, didnt have to worry bout anyone treating me like crap, and my friends respected my wishes to have my own time (they did send cakes, well wishes, etc that I have 4 cakes of different sizes in my fridge now).\n\nNow I'm just sitting down in a new apartment and I cried, cuz I think for the first time I truly feel like its a good start. I've been in and out of relationship with men who mostly unload all mental works on me that sometimes it's hard to explain why our relationship fizzled because to most people they're always there, they're not abusive, they have a good job, etc. \n\nI'm realising this is actually a good feeling; I'm not left out, I DO HAVE PEOPLE THAT CARES AND RESPECT MY BOUNDARIES AND MENTAL CAPACITY.  But most of all is that, realising people around me lend a hand in easing my mental burden - something I'm still working on with my therapist because I'm prone to want to take the weight of the world on my shoulder.\n\nI hope 2023 fares much better for all of us. I'm signing off on a good note, plenty of excellent lessons learned, and a feeling I'm supported by people around me. \n\nHappy NYE everyone. May 2023 be a beautiful year for you. All my consensual virtual hugs.",
        "created_utc": 1672398147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bf will not stop texting his female co-worker",
        "author": "Bug_Top_4068",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyx7a5/bf_will_not_stop_texting_his_female_coworker/",
        "text": "Couple of months back i found out my bf has been texting this co-worker on a daily basis, exchanging encouragement for each other/praising each other etc. the girl would keep praising him and saying things like ‘omg i like your good vibes so much’ or like react heart emoji to his messages. it was just very cringey kind of messages. We had a huge fight over this &amp; he briefly stopped. Then only a week later they started texting about non-work related stuff again, despite me expressing my discomfort with their relationship. (Fyi he has other female friends &amp;co-workers that he frequently exchange friendly texts or hangout as a group and i’m okay with that because it isn’t that close for comfort for me)\n\nWe had a huge fight AGAIN and then he texted her that i felt uncomfortable so he would stop texting her non-work related stuff. \n\nCouple of weeks later, on weekend, he told me he was going out to drop off the laptop to one of his sick colleague’s place. He did not intend to tell me who it was but like he shot himself in the foot, cos he forgot he had told me that girl was sick couple of days back. So obv i knew by ‘colleague’ he meant this girl. \n\nOnly when i got mad pissed again he online delivered it to her house (and even nicely PAID for her). I was like you alr know how this girl has been causing problems to our relationship, you could have just delivered it to her and he told me stuff like bla bla he isn’t really savvy so he didn’t think of online delivery \n\nAll these were couple of months back and on one of our last fights we had almost broke up. Eventually he reassured me he would no longer text her whatever if it doesn’t concern work",
        "created_utc": 1672395721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pregnant?",
        "author": "Upstairs_Tennis2979",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zywjnn/pregnant/",
        "text": "My girlfriend missed her period 6 days ago, but she’s taken multiple pregnancy tests and they are all negative. On top of that she has been throwing up early in the morning and she has had hot flashes. Can someone please help explain?",
        "created_utc": 1672393288,
        "upvote_ratio": 1.0
    },
    {
        "title": "estrogen emotions? (15F)",
        "author": "Kindly-Two6555",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zywhel/estrogen_emotions_15f/",
        "text": "[removed]",
        "created_utc": 1672393055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex-convict friend says about to propose to gf who waited 10 years for him. Just find out he's also on a dating app. WWJD?",
        "author": "6pence-richer",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyv6be/exconvict_friend_says_about_to_propose_to_gf_who/",
        "text": "Long-time friend/fam friend [34m] spent a decade in prison for a series of charges including drug and it came up in the news he also paid for strippers along other things. He seems rehabilitated + clean. He's also college educated from a good home and his gf has sacrificed a lot to be with him since Day 1 of his arrest. Her parents practically threatened to disown her if she marries him.\n\nHe tells me he is going to propose to her and I really like her for him and his family loves her too. But I find out from a trustworthy friend he's on a dating app. It was upsetting to hear esp given what his gf + fam has gone through for him.\n\nDo I:\n1. Talk to him\n2. Approach his mom\n3. Talk to his brother\n4. Do nothing",
        "created_utc": 1672388421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else watch Fleishman Is in Trouble? Thoughts?",
        "author": "heyitspokey",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyufs3/anyone_else_watch_fleishman_is_in_trouble_thoughts/",
        "text": "If you havent heard of it, it's an FX miniseries on Hulu, based on a novel. I think it's one of the best things ever about being an adult and a woman and mental health. Tread carefully, might be spoilers in the comments.",
        "created_utc": 1672385800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Corporate politics",
        "author": "hardkaur777",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyu8d5/corporate_politics/",
        "text": "I’ve been in corporate banking for 6 years now. I can’t stand politics within the company. I’ve created waves with the manager whom I no longer work with. Alas I must to withstand this recession. Any tips on how to do this. I’m in a supervisor role and tend to come across too direct. I am studying a tech position . Much appreciated!",
        "created_utc": 1672385078,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i just block him and never see him again? having trouble letting go",
        "author": "tatamochie",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyu29y/should_i_just_block_him_and_never_see_him_again/",
        "text": "[removed]",
        "created_utc": 1672384472,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i just block him and never see him again ?",
        "author": "ThrowRAmochie",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyu0hl/should_i_just_block_him_and_never_see_him_again/",
        "text": "[removed]",
        "created_utc": 1672384304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my married female coworker into me?",
        "author": "Working_Cup_2102",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyt4fn/is_my_married_female_coworker_into_me/",
        "text": "I work closely with a female coworker who is “unhappily” married. We’re both in our late 30s, I’m a Male. She often complains about her husband and makes it clear she does not like him (but they have kids together so the children keep them from separating). Sometimes I share my “single” life experiences and she at times expresses she wants to be “naughty” too. We laugh it off and leave it at that. She’s really into working out and here and there will show me a picture or two of her body (which I’m quite attracted to). Yet, I maintain my professionalism and refrain from any advances at all. Lately, she’s been putting love songs on pandora and has opened up about having “toys”… I mean - I get you’re thinking: “hello, she’s obviously into you.” BUT, I kinda think she’s just super outgoing and unhappy with her married life, and she feels super comfortable talking to me because I NEVER shared any intention to be anything more than just coworkers. However deep inside I actually may want something more. \nSo, is it possible she’s just really open with me about all these sexual things and wants nothing but to just talk about it? Or could she be trying to show me something else? Thank you in advance.",
        "created_utc": 1672381316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scared, lonely and anxious about turning 35 next year",
        "author": "sia_the_cat",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyszw5/scared_lonely_and_anxious_about_turning_35_next/",
        "text": "I’m turning 35 next year. As we are approaching 2023 in a few days, I find myself feeling really anxious. I’m scared that I will not end up with anyone. I’ve told myself many times that it’s ok to be alone and I have to embrace the possibility that I will never marry or have children. I have many friends who are already divorced or separated, or those who are together with children say their souls are dying. I remind myself that maybe I’m better off and that I just need to keep focusing on healing and doing my own thing. \n\nI live in a city that is known to be boring, it’s expensive as well so not many people have much disposable income for fun things. I have a really good job and I’m fortunate to be financially comfortable, but the downside is I work a lot. I am a fully remote employee so I am at home working alone a lot.\n\nLately, I feel extremely lonely. Since covid my work is fully remote. I no longer have the avenue of meeting new people and making new connections through work. Online dating is dull and I just can’t bring myself to feel excited about anyone. Most of my friends are with kids now so I don’t get to see them as much. I want to have a social life, but living in a city where people don’t bother to introduce themselves at parties and rains 80-90% of the time, there’s not much to do.\n\nRecently I’ve started to try online dating again. I got out of a 2 year abductor relationship last year so only until lately I feel maybe it’s ok to try dating again. I’m shocked to see how many men in their 30s want children. Given I don’t think I want kids, this makes me say no to those men who want children and it’s cut down my dating pool by a lot. I haven’t gone any dates in the last 3 months since I started trying to date.\n\nI feel the benefit of being married and having children out weights does not justify the cost for me. I’m likely going to be the one that makes more money, I have to put my health at risk to get pregnant (I have some health issues that would require me to be off of my medication before trying to conceive, and may run the risk of a flare up) and will have to be the maternal care taker while working a lot. Overall, it just doesn’t feel like a good trade off for me.\n\nBased on how my life is currently, I feel I’m letting my life pass by and the thought of me not getting any younger anymore scares me. It’s really lonely and I feel I’m soon to be abandoned and forgotten by the world. I want to feel I’m worth more than being youthful and a breeder, but the reality is, this world is not very forgiving or kind toward women. So I feel this pressure to date and find someone, but not just anyone. I want that special someone that I feel safe with, someone to share my life with.\n\nSorry that was a lot. I’m just really scared and anxious. I feel weak admitting that I’m lonely and feeling helpless. But I feel I have no where to turn right now. Has anyone ever felt this way? How did you overcome this, and what is your life like now? \n\nAny advice, encouragement or wisdom would be greatly appreciated. Thank you.",
        "created_utc": 1672380889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frustrated. How to deal with a bf who doesn't comfort?",
        "author": "maybeitsmeoryou12",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyru2q/frustrated_how_to_deal_with_a_bf_who_doesnt/",
        "text": "Hi, long distance with my bf a year and a half. \n\nI've been upset about having a sick parent. He has a cousin that has a parent with the same issue. I've asked multiple times to connected to her so I can ask questions. He always agrees but never follows through. I've met his parents multiple times so not anything sinister with hiding me. \n\nTonight I texted that I was feeling sad about the situation with my parent. I asked how does your cousin deal with this? \n\nHis response- I'm not sure, I know its a lot. \n\nNever called me, never checked in on me again, never asked how if I was feeling better.\n\nWhat's the deal? Do some people just not know how to comfort others?\n\nThanks.",
        "created_utc": 1672377297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Craving change in my life at 32",
        "author": "lp2290",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyrhvw/craving_change_in_my_life_at_32/",
        "text": "I am 32 and I feel like I am so stuck in life. Nothing has changed, and I am really craving some sort of change in my life. I have been in a relationship for 13 years and although I love him so much it’s starting to get to me that he hasn’t proposed and that I am always the planner in the relationship and he never takes initiative to do anything special.\n\nMy friends some are married with Children &amp; a house. Then I have friends who are still single and go out and party every night. &amp; I feel like I don’t belong in either  group I am sick of going out to the same bars night after night with my single friends &amp; my married friends it’s hard cause I can’t relate to having a kid right now.\n\nI live in that same apartment with my bf for 6 years I make decent money 75k I live in northern NJ. But I still can’t seem to save money and I want to move out and purchase a home so bad.\n\nI just feel like everyday is groundhogs day and I’m sick of it. I’m craving change and I don’t know where to begin. I picture my life and what I want it to be but I just don’t know how to get there. I feel so stuck &amp; lost. Sometimes, I see people my age that are thriving and I wish that could be me but I feel like I will never thrive and that scares me.",
        "created_utc": 1672376324,
        "upvote_ratio": 1.0
    },
    {
        "title": "My whole life I’ve had to monitor, manage and comfort my parents.",
        "author": "Chemical-Heat3055",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zypyjd/my_whole_life_ive_had_to_monitor_manage_and/",
        "text": "For as long as I can remember I was always running anything I do past a barometer of my parent’s emotions. \n\nIf I do this, how will that make them feel? If they get upset how do I console them? If I don’t console them what will happen? \n\nI’ve always felt responsible for their feelings and emotions. And I thought what I was doing was love. I was loving them by helping them not to feel hurt or take something personally. \n\nAt 37 I’m only now realising how long I’ve walked on eggshells. My mum is so moody, hot and cold, easily hurt and makes a big fuss over everything. \n\nShe’s controlling and immature. \n\nIt’s only now because I’m dealing with my own trauma that I no longer filter myself, change myself, rush to help, panic if they don’t cope etc. \n\nAnd I used to believe they loved me. But the selfishness and stupidity they’ve shown me when I’ve been most vulnerable means they only love me when I’m easy to love. They only love me when I’m filling their life, they only love me when I’m showing them I’m making an effort. And when I enjoy myself with other family they get angry and jealous because I am not making that effort with them. \n\nI’m actually terrified of them.",
        "created_utc": 1672371719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Throw in the towel or forge ahead?",
        "author": "Vivid-Language6500",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zypvce/throw_in_the_towel_or_forge_ahead/",
        "text": "I feel so pathetic typing this, but I swear I'm not this pathetic, online dating has just worn me down lol. Two years ago my partner cheated on me. I was 100% blindsided as I had no idea anything was wrong. I had just moved across the country for him, so I took a year for myself. I traveled, tried new things, got a dog, and hiked a lot of places I had been dying to hike. Honestly, I loved it. My ex continued a relationship with the woman he cheated on me with. Anyway, I'm now 18 months out and finally feeling healthy enough to date. I am in a new city (because staying where the cheater lived was too hard) and so online dating is kinda my best bet. I've never really online dated before and I just wonder...how do you keep going? I want a partner so badly, and  I'm trying to expand my horizons and date outside my normal comfort zone.  Not just to have a relationship, but because my last relationship was so fulfilling and I know I am capable of that type of love.\n\nI want to preface this next part by saying that after my ex cheated my self-worth and self-image was in the dumpster. I felt gross. and I've done so much work on myself, alone. And now I'm on these dates and often think....they will add nothing to my life. I'd rather hang out with me! I've done so much growth in this past year, and I guess I'm writing to vent but also maybe to hear a hopeful story of meeting someone in this situation. Do you keep going? I would absolutely say forget dating and focus on me if I hadn't experienced how great and fulfilling a relationship can be. Can it happen again? Or should I just be content with the happiness I bring myself? I know no one here can realistically answer this, but maybe you've felt this way before and can tell me your beautiful love story, lol",
        "created_utc": 1672371469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fashion advice for clueless adult",
        "author": "hereticallyeverafter",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zypshq/fashion_advice_for_clueless_adult/",
        "text": "Basically the header. I'm 32 and my closet needs help. I hate shopping but have realized it's a necessary evil. My clothing style is casual and I like soft colors but I have no idea what brands or online shops are good/reliable, I just need a step up from Wal-Mart and Target graphic tees lol. Please drop recommendations 🙏",
        "created_utc": 1672371234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who looks at their parents toxic relationship and it ruined your hopes of having a healthy relationship of your own?",
        "author": "Valuable_Relation_70",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zypnj0/who_looks_at_their_parents_toxic_relationship_and/",
        "text": "",
        "created_utc": 1672370842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding friends at 30 and after lockdown?",
        "author": "akathebub",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyoz3j/finding_friends_at_30_and_after_lockdown/",
        "text": "I recently celebrated turning 30 this year and had a really low moment of having no one else to celebrate with except my partner and in-laws. My husband had a job that required us to move around several times in the last few years, and now after COVID I only really have one acquaintance that I check in with every now again.\n\nThe rest of my friendships have pretty much fallen apart. I've joined a couple of hiking groups in my area and plan on taking some art classes &amp; putting myself out there, but I was hoping to hear some success stories or if people are in similar situations? \n\nI'm staying positive about it all, but it's hard sometimes to think that I'm going into my 30s being incredibly lonely.",
        "created_utc": 1672368947,
        "upvote_ratio": 1.0
    },
    {
        "title": "A contractor is making me uncomfortable in my home.",
        "author": "pizzatoucher",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyov56/a_contractor_is_making_me_uncomfortable_in_my_home/",
        "text": "We are having some walls reconfigured in our house to add another bedroom.\n\nDuring construction , Jack the contractor walked into my bedroom without knocking - twice - when he didn't need to be in there. Then he stayed *way* later than his colleague (I loudly called my partner to talk about dinner plans). He then sat in his van in my driveway for an hour after the work day. \n\nToday Jack pulled an electric heater out of our wall without making sure the breaker was off (again in my bedroom, a room where he shouldn't have been working). The heater was eventually going to move, but it was not part of his scope at all. Luckily, Jack didn't die in my bedroom.\n\nI've talked to his boss (a woman) who has been quick to take my side and reassure me that she is addressing these behaviors.  \n\nMy partner has been working from home as much as he can to help me feel safe. (And Jack only addresses questions to my partner, who knows nothing about construction) \n\nAnd I suppose all of these things could be innocent, he could just be oblivious. I could be overreacting. I know home renovations can be an emotionally taxing time, but I'm feeling creeped out. And like my hackles are up around this dude. \n\nI'll take any wisdom you can dispel. And please share with me your contractor experiences - would love to commiserate!",
        "created_utc": 1672368638,
        "upvote_ratio": 1.0
    },
    {
        "title": "the burden of birth control",
        "author": "JellyBreadFruit",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zynjs8/the_burden_of_birth_control/",
        "text": "[removed]",
        "created_utc": 1672365081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Night sweats concern",
        "author": "AprilBoon",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyncxn/night_sweats_concern/",
        "text": "For the last few weeks I’ve been regularly experiencing night sweats. Even with my room with windows open and heating off in my room. It’s nightly or every few days. \nI’m 34. Not on new medication and I’m in good health. I’ve recently changed jobs to one I move around the country a bit and speaking to people at their door. Charity job. I’ve never experienced anything like this before. Please any thoughts I’d appreciate thank you",
        "created_utc": 1672364588,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be supportive from a distance while my friend gives birth?",
        "author": "Cool-Alfalfa",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zym669/how_to_be_supportive_from_a_distance_while_my/",
        "text": "My friend is due to have her baby induced tomorrow and I’m not really sure what I should message her on the day. No-one I’m close with has ever had a baby before. I don’t want to be annoying but I also want her to know I’m thinking of her.\n\nAny suggestions will be appreciated.",
        "created_utc": 1672361579,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the male equivalent of I'm not like other girls?",
        "author": "Shadow_Balm",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zym4jd/what_the_male_equivalent_of_im_not_like_other/",
        "text": "",
        "created_utc": 1672361456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend? My friend? Manfriend?",
        "author": "Live-Pomegranate4840",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyltd7/boyfriend_my_friend_manfriend/",
        "text": "I’m 48. I recently introduced the man I’m dating as my “boyfriend.” Two friends— one male, one female—admonished me for referring to this grown man as my “boyfriend” seeing a show he is not a boy. Is it inappropriate to call him my boyfriend? “Friend “ feels too vague and “manfriend” just sounds weird. Partner, beaux, lover, etc. don’t feel right either so I’m wondering what you call your monogamous, non-married partner? \nBTW: he doesn’t mind the term “boyfriend.”",
        "created_utc": 1672360642,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you find friends that initiate? I am sick of always being the initiator. How do you filter out friends who don’t also initiate texts and hangouts.",
        "author": "Jamie_Potter",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zykzjy/how_do_you_find_friends_that_initiate_i_am_sick/",
        "text": "",
        "created_utc": 1672358603,
        "upvote_ratio": 1.0
    },
    {
        "title": "What advice would you give to your 25 year old self?",
        "author": "EBITDA-5x",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zykq8v/what_advice_would_you_give_to_your_25_year_old/",
        "text": "",
        "created_utc": 1672358014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you find this rude ladies or am I overreacting?",
        "author": "Puzzled_Wind_3365",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyk69d/would_you_find_this_rude_ladies_or_am_i/",
        "text": "I (36F) have been in a long distance relationship with my partner (43M). We are both parents. His children are an almost 15 years old and 11 years old while mine are 11 and 4.\n\nOur only window to catch up in our day is around 9:30pm-10pm before our own bedtimes but lately he has this thing he does soon we starts talking he will go “brb” and not see him back anywhere 1hr to 3 hrs later (when I’m usually already passed out and see his massage in the morning) of always something around the lines of “Sorry hun kids woke up I was putting them back asleep”\n\nMind you these are perfectly normal 14 and 11 years old, not special needs or anything like that. I have discussed with him that it’s better if ur still busy to just end the conversation instead of going brb when I expect something quick like 5 minutes only to disappear for 3 hrs!\n\nNeedless to say I have been annoyed but also asking myself now is this something you would also find rude or maybe I’m overreacting?",
        "created_utc": 1672356683,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some excitement in my life! What’s something crazy/exciting that you’ve done recently?",
        "author": "turktink",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyjvam/i_need_some_excitement_in_my_life_whats_something/",
        "text": "It can be anything. \n\nSome examples: \n\n- Married someone after knowing them for a month \n- Randomly moved to a new city\n- Got your first tattoo\n- Bought a luxury car\n- Sold all your stuff and started van life \n\nYou get the point…",
        "created_utc": 1672355961,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with a life partner that isn’t quite compatible?",
        "author": "probablylayinginbed",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyjuzu/how_do_you_deal_with_a_life_partner_that_isnt/",
        "text": "As a preface, I‘m only 28, my partner 31, but I really would appreciate the insight of you amazing women in this sub. This might turn into more of a ramble, but I will try to keep it concise.\n\nMy partner and I have been together for 6ish years, although we split for a few months in between. Until a few weeks ago I would have considered our relationship very good and solid. We‘re very affectionate, have developed a good communication and just love each other a lot.\n\nBut the issue is that… we’re very different in not so good ways. Our interests are quite different: He’s an engineer who loves to tinker in his workshop, while I am outdoorsy and athletic. I try to eat healthy and plant-based he mostly eats meaty junk food. He’s sober and smokes tobacco and weed, I’m the other way round. You get the picture. Also, as we‘re growing older, some major character flaws are causing me to consider our relationship. He’s quite bad with money, not recklessly so but he barely saves anything, which keeps us from making plans together.\n\nApart from that, some issues are hard for me to accept. He is and has always been pretty reluctant about moving our relationship along, such as moving in together(we haven’t yet), holidays together, even meeting friends and family in the beginning. I don’t need a timeline or grand gestures or anything as I myself are pretty laid back (don’t care about marriage for example and won’t be having kids) but I would like to see that he’s excited to be with me and plan our lives together. I know he loves me and has grown so much since we met, but he just seems to be lukewarm a lot of the time. \n\n\nIm at a sort of crosswalk in my life at the moment, basically looking into how to advance my career and longterm goals. And the fact that we’re so different and out relationship isn’t advancing keeps nagging at me. However he absolutely is the love of my life, I can’t imagine a future without him. \n\nIm just so conflicted in how to proceed. I don’t want to end an amazing relationship over mostly trifling things, but I’m also not sure if this is what I would want for the rest of my life if things keep going as they are. While we talked a lot, I also don’t see these as issues we can talk ourselves through, since they are mostly internal conflicts in myself.\n\nHave you ever been in a similar situation, in which you were with an amazing person but things don’t quite seem to work out? I would love some advice!",
        "created_utc": 1672355942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little girl advice for a single dad",
        "author": "crush_gold",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyjc0n/little_girl_advice_for_a_single_dad/",
        "text": "I have full custody of my 8yo twin girls. They see their mother once a fortnight on the weekend and special occasions. We live in Sydney and their mothers family live in Victoria. So she took them to Victoria for Christmas and grandma has a pool so they love going there.  Upon their return they tell me they swam every day and had lots of fun which is great... BUT when I grabbed em for kisses and hugs I noticed they both smelt like chlorine.  Turns out they hadn't showered the entire 5 days,  one of the girls nipples are literally red raw and bleeding and she almost drowned coz \"mummy went to sleep when we were in the pool\". My thoughts on the nipples are due to the water and rough material from the swimming rashie and not showering. OR is this normal bodily growth behaviour of a little girl. Generally I get along with their mother but when I tried to talk to her about these issues she got all defensive,  ignored the questions and complained that she's not happy with the current parenting plan we have in place.",
        "created_utc": 1672354700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something’s missing and I don’t have words",
        "author": "Embracingchange5255",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyipwh/somethings_missing_and_i_dont_have_words/",
        "text": "[removed]",
        "created_utc": 1672353196,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you don't volunteer, why not?",
        "author": "warrior_not_princess",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyi0q8/if_you_dont_volunteer_why_not/",
        "text": "I started volunteering and noticed most people who volunteer are college students or retirees.",
        "created_utc": 1672351613,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the lowest sum of money that could appear in your life to change it majorly?",
        "author": "quattic",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyhllb/what_is_the_lowest_sum_of_money_that_could_appear/",
        "text": "Perhaps enough to buy a house, a new car, enough to afford medication, or enough to move out of state. How much is that amount for you personally and what would you use it for?",
        "created_utc": 1672350652,
        "upvote_ratio": 1.0
    },
    {
        "title": "What compliments can I (f34, straight) give my female friends?",
        "author": "deLaDee2",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zygzx7/what_compliments_can_i_f34_straight_give_my/",
        "text": "",
        "created_utc": 1672349238,
        "upvote_ratio": 1.0
    },
    {
        "title": "is a written apology the same as a spoken one?",
        "author": "hurduhhurr",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyfntr/is_a_written_apology_the_same_as_a_spoken_one/",
        "text": "I apologized to my spouse in a genuine, thorough note accepting ownership for something thoughtless I had said to him. ( nothing majorly serious, just marital quibbling type of thing) I left it for him on the counter before bed knowing he would see it in the morning when he got coffee. I struggle to find the right words when speaking so I like writing in this way. He knows this. We have been together almost 20 years.\n\nThe next day, he acted totally fine like everything was back to normal. Two more days pass and suddenly he decides to pick a fight with me before bed and said he didn't consider my note a real apology. I responded with, \"What are you talking about I completely said I was sorry\" and he said \"sort of. I think you meant what you originally said\".  \n\nI am so frustrated because now he is stonewalling me and won't respond to my messages. I have since apologized more times and he won't even respond. How do you deal with a husband who doesn't know how to communicate through problems? Not speaking back to me when I'm trying  to solve something, infuriates me and I feel like he is doing this to try to punish me.",
        "created_utc": 1672346085,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel bad for not wanting to be a caregiver. Anyone relate?",
        "author": "supersleepydude",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyfcvy/i_feel_bad_for_not_wanting_to_be_a_caregiver/",
        "text": "I never wanted kids because I have zero interest in being a caregiver. I have some chronic health issues and I just don’t have it in me to cater to someone else all the time. I am also not great at dealing with bodily functions/fluids. I’ve been constantly challenged about my decision not to have kids by doctors, friends, family, even total strangers. But I actually had sterilization surgery when I turned 30 and I’m grateful every day that I will never have kids. \n\nAs I get older, I’m starting to panic about having to care for aging family members. My own and my partner’s. I don’t want to do this any more than I want to have kids. I feel horrible and selfish and I know that the aging family members don’t necessarily want to have to rely on others. But I just do not think that I can be a caregiver for them. I’m not sure I can handle it physically or emotionally. I feel like it is 100% expected of me, especially since I am a woman. My family also doesn’t really have any money, so I won’t be able to pay anyone to help with their care. \n\nI feel like a total asshole, especially because I struggle with chronic illness and I often have to rely on others myself. I also worry because while there is no guarantee that your kids can/will take care of you when you’re old, as a child free person I’m pretty sure no one will take care of me when I’m old. And that feels pretty bad. So to be another person who’s like “sorry, oldie, but I can’t take care of you” feels like a bummer.\n\nI also hate that we live in a society that devalues aging and disabled people so much and leaves them to suffer and die. I don’t want my inability to provide care to contribute to this. I think community support and interdependence is so valuable, but it’s also so discouraged in our society. And I have a hard time feeling like someone like me who struggles to provide care has any place in community with others. \n\nThen there is, of course, the gendered expectation that I will automatically be a caregiver. Which I hate! \n\nI don’t know where I’m going with this, just wondering if anyone can relate?!",
        "created_utc": 1672345331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing hair color",
        "author": "phenixrise432",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyfbq5/changing_hair_color/",
        "text": "Saw many girls in college changing their hair frequently which totally thew me off many times. Did not recognize the person. Especially when they went blonde.\n\nMy question - is it common for girls to change their hair color frequently that they become totally different?",
        "created_utc": 1672345249,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for wanting my BF to spend some of his Xmas money on home repairs?",
        "author": "tamaleringwald",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyep18/aita_for_wanting_my_bf_to_spend_some_of_his_xmas/",
        "text": "[removed]",
        "created_utc": 1672343778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ladies, am I right to be upset at this or am I overreacting or even in the wrong here?",
        "author": "Daisy_Love455",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyemo5/ladies_am_i_right_to_be_upset_at_this_or_am_i/",
        "text": "I just really need opinions here. Idk if I am right, overreacting, or even wrong. So this is the situation. Sorry if this is a little long. \n\nOne of my guy friends does wood work. Really creative person. Back in November he posted on his social media some things that he was making. One in particular was a Christmas ornament. I told him I thought they were cute and asked him how much he would charge. He never told me that part. But said he would add it to his list.\n\nOver a month later, he posts on his social media all these other things and ornaments he was making for other people for Christmas. And so I messaged him and asked about the ornament and was nice saying that ya know he didn’t have to rush or anything like that if he needed to get other orders in first.\n\nThe day before Christmas Eve he messaged and sent a photo of the ornament and said it was done and I could come pick it up. Issue was, our weather got really bad. Me and him live close to each other but our neighborhoods sit up in the hills. \n\nWeather on Christmas Eve was better but our roads were still a little messy. But melting in some parts. And I was a little nervous driving up the hills in my car. But my sister said she would be willing to drive me up to his place. I messaged him and asked him would he be busy later or home and asked if it would be ok to stop by later that afternoon. And I asked him how much I would owe him. He told me that it was a Christmas gift and no charges. He told me at the time that he could even meet me somewhere in the neighborhood to give it to me. I couldn’t at the time. I think we were getting food together. And I told him that.  And I asked what about at 4. He said that’s fine. He would be home. I was getting his stuff together. I got him just a small thing of Christmas cookies as a thank you for making me the ornament. \n\nAnd this is the part where I don’t know what to think. So he was willing to meet me earlier to hand it to me. Well I asked if 4pm would be ok (which he said yes) and then all of a sudden he sent me a photo of where he literally taped the ornament to the side of his mailbox. Literally sent me a photo of where it was on the side of his mailbox. And so I texted him and said “Hey! Will you be able to come out I have a little something for you when I get up there.” He waited 2 hours to respond to me. And when he did he wrote “I might be doing something. But you can drop it for sure.” And the photo with that message just rubbed me the wrong way. Am I wrong to think that comes across as rude? And not going to lie it kinda embarrassed me in front of my family. Neither of us have spoke since then. I haven’t reached out to him and he hasn’t said anything to me.",
        "created_utc": 1672343625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy Boxing Day to me! If you bought nice clothes (or anything really) for boxing day, want to share your fave purchase?",
        "author": "Literatelady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyelfx/happy_boxing_day_to_me_if_you_bought_nice_clothes/",
        "text": "Inspired by [this post about clothes](https://www.reddit.com/r/AskWomenOver30/comments/zxv9xw/where_do_we_buy_normal_clothes/?utm_source=share&amp;utm_medium=web2x&amp;context=3): Maybe we can crowd source nice things. Were there any things you bought you really liked? \n\nI bought this [dress from Zara](https://www.zara.com/ca/en/polka-dot-print-dress-p02587168.html?v1=208632656&amp;v2=2186075) for myself and [these slippers](https://oldnavy.gapcanada.ca/browse/product.do?pid=4768650030010&amp;cid=55147&amp;pcid=55147&amp;vid=1&amp;cpos=6&amp;cexp=319&amp;kcid=CategoryIDs%3D55147&amp;ctype=Listing&amp;cpid=res22122911584281944476199#pdp-page-content) from old navy because they are fab and I've always wanted them to make me smile\n\nMy mom also bought me [this ring](https://www.melanieauld.com/products/emerald-trio-ring-10k-solid-gold?_pos=1&amp;_sid=784140f6d&amp;_ss=r) and I just love it so sharing that link as well.\n\nPardon the Canadian links!",
        "created_utc": 1672343543,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did you do in preparation for a healthy pregnancy?",
        "author": "ProgrammerNeat3758",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zydwt3/what_did_you_do_in_preparation_for_a_healthy/",
        "text": "I will be turning 31 next year and want to start thinking about getting pregnant (for the first time)!  There are a lot of recommendations out there on fitness and diet that are super overwhelming!  Looking for a checklist of things to follow for getting pregnant and have a healthy pregnancy! Could I get any book or program recommendation? Or personal advice that worked for you?",
        "created_utc": 1672341956,
        "upvote_ratio": 1.0
    },
    {
        "title": "are there any women in this sub that got cancer in their 20s?",
        "author": "Lil--Sebastian",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zycp27/are_there_any_women_in_this_sub_that_got_cancer/",
        "text": "i got diagnosed with stage 3 cancer when i was 28. i beat it at 29, and i’m still getting scans at 30. i also still have my port as well. i have to get a certain number of clear scans before they’ll take it out. \n\nmy question is: how did having cancer so young affect you going into your 30s? i feel like i have aged mentally. like i’ve seen and experienced shit older people are “supposed” to, not young people. but that’s not true at all. young people do get cancer. and we get ignored the most because of it. “you’re too young” was literally something i heard while cancer was literally growing inside me. it aged the shit outta me. not physically, but definitely mentally. chronic illness and disease at any age of isolating, but being a young adult with cancer is particularly difficult. it set me back in life so much. i have a good job now and i plan on growing in this field (I.T.) but i still feel like i should be light years beyond where i am now. nobody around me understands unless they themselves had cancer or was a caretaker to somebody with it. \n\nand for what it’s worth, i start therapy jan 9th!",
        "created_utc": 1672339201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aging",
        "author": "Queenofhearts35",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyc65s/aging/",
        "text": "The wrinkles and changes coming it’s depressing. I just bought alastin skin care I do Botox but the fact that I eat a cookie wake up 20 pounds heavier the next day is depressing or the fact that wrinkles keep showing up is depressing the grey hairs 🥺 the up keep of being A woman is so expensive!",
        "created_utc": 1672337916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with the way my friendships have changed over the pandemic",
        "author": "radley8367",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zyc3jo/struggling_with_the_way_my_friendships_have/",
        "text": "I’ve never been great with change so I still feel a lot of inertia from the last 3 years, my brain just hasn’t been able to catch up.\n\nDoes anyone else feel the same? I went into 2020 as a 28 year old having the best time - I had so many groups of friends with a couple of people within those that I considered my closest friends.\n\nNow I’m about to turn 31 and these groups have dwindled. Over the pandemic they moved away, or had babies, or it’s just that time of life where people have their own shot going on and I’m struggling to handle it. The closest friends I mentioned are even closer, and I have gained new friends or gotten closer to ones throughout the last 3 years but it makes me so sad the way things have changed. \n\nI guess I just wanted to see if this was normal or offer any ways of dealing that have worked for you.",
        "created_utc": 1672337741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need input from women with experience with autoimmune disease",
        "author": "PetuniasSmellNice",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zybemb/need_input_from_women_with_experience_with/",
        "text": "Hi friends, wondering if what I’m experiencing is normal. Note I just messaged my doctor about this, and waiting to get prescribed meds as well but I wanted to see if you all have experienced this.\n\nI’m diagnosed with an autoimmune disease - ulcerative colitis (similar to Crohn’s disease) - for over 10 years now. I take a daily maintenance medicine called Lialda that is pretty low-profile / very few side effects, and I take steroids to control flares. \n\nIn September I had my bi-annual colonoscopy and it was 100% normal!!! No inflammation even in the deep tissue cells. Since then I’ve felt pretty great. \n\nHowever in November I had covid and this month I got a cold which I’m still recovering from. The last few days I have begun having some symptoms that indicate a flareup. However what’s really frustrating is when my whole body hurts. The actual UC-related symptoms are pretty mild - very mild pain, very mild diarrhea - like it’s there enough that I know I’m not imagining it but my other symptoms are by far worse. They include:\n\n* extreme fatigue despite TONS of rest and sleep; I’ve been off work for 2 weeks and have done nothing but rest and sleep 10 hours a night yet I can barely function \n* my muscles and joints hurt as if I worked out when I haven’t even gone for a walk in weeks. I don’t have the energy to even consider even a light yoga session or something. \n* I wake up with extreme persistent headaches that don’t go away with pain meds \n* my back, neck and head all hurt and are stiff \n* my eyes are insanely dry and itchy, it’s not painful but uncomfortable \n* I feel dehydrated despite drinking tons of water \n\nBasically I feel like absolute garbage. My entire body feels inflamed and sick. My UC symptoms are there but so mild this doesn’t seem right. Unfortunately doctors tends to just 🤷‍♀️🤷‍♀️🤷‍♀️ but I’m trying to be better about advocating for myself more.\n\nJust curious if other women with autoimmune issues experience this kind of all-body malaise and what you do about it??",
        "created_utc": 1672336080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watching Being Erica and reading The Midnight Library did more for me than therapy. What other pieces of fiction should every woman over 30 consume?",
        "author": "synaesthetist",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy9tgq/watching_being_erica_and_reading_the_midnight/",
        "text": "",
        "created_utc": 1672332202,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a relationship where one person snores and one doesn’t, who should adapt to whom?",
        "author": "Hatcheling",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy9k9h/in_a_relationship_where_one_person_snores_and_one/",
        "text": "Is it up to the non snorer to find other sleeping arrangements if their sleep is too disrupted by the snoring, or is this the snorer’s responsibility?",
        "created_utc": 1672331561,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about choking……?",
        "author": "Cocacolaloco",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy9ir3/how_do_you_feel_about_choking/",
        "text": "No shame if that’s something you like of course but it also freaks me out that people are saying it’s so common? So I wondered if that’s true?\n\nLike it would actually make me angry if I was dating a guy and he found it a turn on to put his hands around my neck (even if he didn’t actually do it). I did in the past a guy who wanted to do that and I always said not a chance but now I feel I’d be even more annoyed at the thought because I don’t get it at all.",
        "created_utc": 1672331459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on long distance dating",
        "author": "candidpecans_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy9377/advice_on_long_distance_dating/",
        "text": "[removed]",
        "created_utc": 1672330389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for ADHD friendly diet and exercise programs that I’ll stick with",
        "author": "Dry_Investigator5020",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy8xs2/looking_for_adhd_friendly_diet_and_exercise/",
        "text": "I (35f) have gained about 25lbs since the pandemic. I’m looking to loose the extra weight and get STRONG. Hoping you guys have recommendations on programs, techniques, or tips that are ADHD friendly. I have 10,000 unfinished projects and do not want this to be another one 😫.\n\nI’m looking for a diet plan that’s easy to count/keep track of calories and clean. Any tips on successfully keeping track of calories would be appreciated! I was thinking of getting a workbook, but know I’ll probably stop using it. I used to keep track of calories with my Fitbit app and that was fine, but I’d always forget and again… stopped using it.\n\nAs far as exercise, I’m thinking something that’s predictable like bikram yoga. I like that bikram specifically b/c it’s the same routine every session. I also like to swim laps and do cardio cause its meditative and straightforward. Again, Any programs, techniques, habits you can share would be greatly appreciated.\n\nBasically, I’m getting older and still haven’t figured out a diet and exercise plan that I can stick to. I get so overwhelmed by the variety of diet and exercise info out there (I’m sure you can relate!😵‍💫)",
        "created_utc": 1672330010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who survived SA - is there any hope?",
        "author": "Klutzy_Tomatillo_429",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy8qqp/women_who_survived_sa_is_there_any_hope/",
        "text": "May be messy, I can’t stop crying and am in distress. \n\nMultiple SAs in my past. Teacher who touched me, rape, and too many times of sexual relations just to avoid rape. Nothing new, just being a woman in this shit world. \n\nI’ve really tried to put it behind me. It just keeps on coming back. \nPhysical memory is lessened and I’m so grateful for that. Living the pain of my rape again and again was beyond terrible. \n\nI’m 32 now. Had meaningful relationships with lots of love. Also realising that I pick those who are unthreatening to me, but they don’t make a good lasting match because we don’t truly match. \n\nI’m in therapy for many other things and my therapist recommended me to seek additional therapy specialised with SA. \n\nThis impacts me in so many ways. I have a very hard time opening up to men, both mentally and physically. Intimacy is terrifying. The worst is possibly all the anger that I now realise I have. I’m so angry with those men. So angry that my life had brought me these terrible experiences with no fault of my own. \n\nThis anger makes me shutdown and disconnect from my life. Plenty of weed smoking and plenty of substances in the past. \n\nIs there any hope at all? \nI can’t believe I have to go through yet another therapy program. \nBut I can’t live like this. So hurt and so angry and so traumatised. \nI can’t. \n\nPlease, please please tell me there’s a brighter future for me. \nPlease tell me this anger will not consume me, that there’s light ahead of me.",
        "created_utc": 1672329527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the \"multiple vaginal orgasms\" he gives you drain you so bad that you just can't seem to stay awake after he done?",
        "author": "sahw2015",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy8hhm/can_the_multiple_vaginal_orgasms_he_gives_you/",
        "text": "tl;dr",
        "created_utc": 1672328861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to be hesitant or initially dread having kids?",
        "author": "Throwaway49585959",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy7i9y/is_it_normal_to_be_hesitant_or_initially_dread/",
        "text": "\nMy husband and I were thoroughly childfree when we got married. We love our nieces and nephews but it just didn't seem to be for us. Over the last few years we enjoyed joking about having a baby someday everytime one of our niblings did something cute. \n\nWell, suddenly my husband drops on me that he thinks we should have a baby before next Christmas. He pointed out that with jobs/school this is going to be the best time to have one since he will be home full time for childcare. He wants to start trying in the next few months.\n\nI was pretty shocked. I want to be excited and on board. We had joked/talked so much about having a baby that I assumed my mind had changed. When I'm alone and I think about the actual prospect of having a baby, I just feel my stomach drop. I think of everything I would lose and all the ways my life would change. I desperately wish I could just be on board but everytime I think of the reality of pregnancy and having a baby I feel sick. Are these normal feelings bout having a baby or do I just not want one?",
        "created_utc": 1672326298,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do women feel about dating steroid users?",
        "author": "thr0waway4dayzz",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy6v55/how_do_women_feel_about_dating_steroid_users/",
        "text": "I’m(32m) a steroid user and I’m honest about my use if asked about it. But I don’t randomly tell people I juice because imo its an odd thing to bring up for no reason. To someone who isn’t a regular gymgoer I don’t look like the stereotypical steroid user, so alot of the women I’ve dated thought I’m natural. Hollywood and social media has ruined people’s perception of what a natural man actually looks like, but people who are active in the gym will usually be able to tell that I’m on something. When they find out I juice, the way they look at me and act toward me usually changes, like I’m some sort of dirty drug addict. They usually find out when they open my medicine cabinet and see all the vials and boxes of syringes. Do the majority of women hate the idea of steroids that much?",
        "created_utc": 1672324575,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you ration chocolate or sweets? Instead of eating the whole thing.",
        "author": "arcticfox_12",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy62yi/how_do_you_ration_chocolate_or_sweets_instead_of/",
        "text": "",
        "created_utc": 1672322408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone ever manage to turn their life around in their 30s?",
        "author": "adorable__elephant",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy569k/did_anyone_ever_manage_to_turn_their_life_around/",
        "text": "I am jaded. I honestly do not have a sense of direction anymore. I was always so driven and ambitious, now I'm just depressed amongst multiple other mental illnesses and I really do not know what I want from life anymore.\n\nOn paper, I should be happy but I just feel trapped. I bought a house in the countryside last year when I was manic, and I honestly love it but the commute is wearing me down. I make really good money but I suck at managing it. My health/fitness was bad before I had Covid-19 but now I get out of breath when putting the groceries away. My boyfriend is a sweet guy but he is moody, which regularily puts me in a spiral. (I have BPD.)  I have gotten extremely anxious about leaving the house. Even going into the garden with my dogs feels like walking through snake infested waters. \n\nI just need to hear from someone who was in a similar position and managed to get out. Please, help me out of this misery. I only ever see people in their mid-twenties that succeeded at doing it...",
        "created_utc": 1672319777,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have never found any of my sexual or romantic partners physically attractive - is that normal?",
        "author": "mfog35",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy4jiz/i_have_never_found_any_of_my_sexual_or_romantic/",
        "text": "This has come out as a random thought as I’m really craving physical intimacy but cannot bare the thought of dating or getting physically close to anyone and then I realised it’s because not been attracted to a single one of the people I’ve been intimate worth. I just accepted any decent person that was attracted to me. \n\nSo I am wondering is this normal? Do we all settle for who ever comes our way or likes us? \n\nThe people I am generally attracted to are “out of my league” (complicated to explain but being a WOC, I continuously hear and experience the notion that I’m bottom on the totem pole so to speak by people in and outside of my race)",
        "created_utc": 1672317856,
        "upvote_ratio": 1.0
    },
    {
        "title": "serious relationship",
        "author": "JAMES7280",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy3yzi/serious_relationship/",
        "text": "[removed]",
        "created_utc": 1672315997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who became SAHM, and have been such for at least or around 5 years plus, what is your main gripe about the arrangement?",
        "author": "theunfinishedletter",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy3f1f/women_who_became_sahm_and_have_been_such_for_at/",
        "text": "",
        "created_utc": 1672314147,
        "upvote_ratio": 1.0
    },
    {
        "title": "serious relationship",
        "author": "JAMES7280",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy32wh/serious_relationship/",
        "text": "[removed]",
        "created_utc": 1672312985,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you received a box on your 30th with everything you'd need in your 30s, what would be in it?",
        "author": "heybud-buddy-heybud",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy2r15/if_you_received_a_box_on_your_30th_with/",
        "text": "My best friend is turning 30 in a few weeks and I'd like to set her up with a little \"here's what you'll need to get started\" box. Aside from big ticket stuff like, you know, a dehumidifier (already got) or a mortgage (also on the way), are there any items she may need, books she desperately has to read, that kind of thing that should be in there?\n\nObviously, socks with my face on them are already on the list. She'll need those in the coming years, I feel.",
        "created_utc": 1672311844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hot and cold friend",
        "author": "Chemical-Heat3055",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zy0nuv/hot_and_cold_friend/",
        "text": "I feel stuck and confused. \n\nA person I call a friend is always giving me hot and cold vibes. \n\nRecently I’ve attended her birthday and was the only person to buy her a gift. I sent her an Xmas card too. \n\nShe has been going through some physical illness so I always try to take that into account. But lately it feels like she will engage with me and then once I reply and tell her how I’m feeling about my life I get no response. \n\nSo it leads me to believe that all the nice “love you’s” I get are just a bit insincere. \n\nI just feel uneasy. I don’t know where I stand. I’ve asked her before if we’re ok. I’ve asked her if she would rather I didn’t talk to her. She never says she wants that. \n\nBut then as soon as things are good they go back to being hot and cold. When she called to say thanks for the Xmas card she said she doesn’t bother with sending them because they are a waste of paper or something. \n\nI don’t know what to do. When I stopped messaging her to give her space she would message me. When I tell her how I’m struggling with stuff she doesn’t reply. \n\nI just feel like I’m going crazy trying to make sense of her and how she feels about me. \n\nWhat do I do?",
        "created_utc": 1672304343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Too stressed about spending money on day-to-day things [question]?",
        "author": "Firm-Helicopter",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/zxz8jh/too_stressed_about_spending_money_on_daytoday/",
        "text": "Hey 33F living by myself\n\nI'm making a reasonable salary, I save enough, and my financial situation is relatively stable. I'm definitely not rich, and my family always struggled with money and cannot support me.\n\nWhen it comes to life experiences like traveling, going out with friends, etc. I'm OK. I have my limits, and I'm smart, but I'm not going to miss these moments in life just to save even more money. \n\nHowever, when it's about the simple day-to-day spending, like buying myself a new pajama, redecorating the house, or replacing an old item that cannot be used anymore, the stress levels are up. Every time I need to buy something, I prefer to avoid it and save this money for any future crisis that might come.  \nThis approach leads me to things like thinking for weeks about spending $50 on new pajamas! And probably not even buying this eventually.   \nSometimes when I do spend a few hundred $ to buy things I literally need, I keep looking into my bank account and regretting it and calculating how much more could I save if I wouldn't buy it. \n\nDo you have any ideas on how can I handle it a bit better?   \nDoes anyone struggled with that and has any ideas?",
        "created_utc": 1672299153,
        "upvote_ratio": 1.0
    }
]