[
    {
        "title": "I'm lost and overwhelmed",
        "author": "ventingfrog",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m6kxh/im_lost_and_overwhelmed/",
        "text": "Hello beautiful people!\n\nI started a phone operator job at a  big hotel that we have here, it's not paying me much, but I don't have any debt or any financial commitment, which means I get to save most of it minus my transportation, and I work for 10 hours. \n\nI have a 3 months trial which I can quit whenever I want through this period of time, it's only my second day and I'm already thinking about quitting.. \n\nHere are my concerns &amp; what I feel in general:\n\n- a connection gave me the job and that makes me feel like I don't deserve it, and I feel like I'm under more pressure to prove myself even though that the job environment isn't bad at all and none treated me bad, I know they're doing their jobs, but I think my managers a being more careful of me (my coworkers don't know that I got the job through a connection) \n\n- I took some calls today and I did some mistakes, I know it's normal, but I can't stop myself from getting nervous and disappointed.\n\n- I'm really sensitive and an overthinker, as much as I'm trying to not let anything affect me but it's not working, as soon as I get home and get into my bed I cry like a baby, even though the day didn't go so bad, and it happened at the first day as well. \n\n- WHY DO I FEEL LIKE GARBAGE AFTER RETURNING HOME EVEN THOUGH IT WAS A FINE DAY?!\n\n- after a room checks out I have to call 2 departments to tell them about the check out as well, it took me 4 minutes in total to do so, and one of the departments called to complain that I'm taking a long time to report the check out, but my mentor said that I'm not and defended me, did I actually delay them?\n\n- I have social anxiety, even though I'm acting normal, I even became kind of  friends with some of my colleagues, but as soon as I'm done with work, my mood shifts, I become angrier, cranky, with a low social battery.\n\nSorry for making this too long, that's not even half of it, and sorry for any mistakes English isn't my first language. \n\nIf you know what in the hell I'm talking about please help. \n\nMany thanks &lt;3",
        "created_utc": 1678305950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conversations about relationship and life",
        "author": "di88",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m5zzt/conversations_about_relationship_and_life/",
        "text": "My (34F) husband (35M) says that speaking about our relationship is pure torture.\n\nIts woman’s day and he made me dinner. We were watching Jay Shetty and his wife speak about their relationship. Again, maybe my mistake was not to value what he did today but this is lately often in my mind. Maybe bas timing. \n\nI was asking him whether he is attracted to me and asking why he is distant and cold. He mentions he has no emotions. I tell him that I care about him and truly want him to have a good life experience. That i feel in my heart the will to make him happy, to love him- and whether he fees the same way? Or why no? I ask him why he doesn’t want to make out with me as its something i crave, he doesn’t want to talk about any of this. I ask him that maybe we are more like roommates and he gets angry and me daring to ask. He does do many things for me, but i struggle to build intimacy if he doesn’t open up and talk about feelings and our experience in life. I ask these questions and he gets angry, but he never tells me no. These things build up in my mind. \n\nAt the end, he called me crazy and mentally unstable, insults because he didn’t know how to make me stop. \n\nI wanted to ask your perspective and advise. Is it normal to have or not these discussions? What are your thoughts on this?",
        "created_utc": 1678304688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conversations about life and relationship",
        "author": "4Purple-Avocado",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m5xpz/conversations_about_life_and_relationship/",
        "text": "[removed]",
        "created_utc": 1678304543,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get over girlfriend’s past?",
        "author": "Mpuri_maniac786",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m58ge/how_to_get_over_girlfriends_past/",
        "text": "\nHi everyone sorry for this post it will probably get downvoted but I guess I just want opinions and possible advice or help.\n\nSo I’ve recently connected with a former acquaintance who I began dating and is now my girlfriend she’s definitely amazing in a lot of ways and I’m not like judgemental or atleast I try not to be we are from religious backgrounds (British Muslims) so initially was under the impression she was quite prudish and Saintly but looks can be quite deceiving and she’s actually not very religious at all to my surprise but not a negative or a dealbreaker at all. obviously with finding that out it’s an easy guess that she’s probably had a past and that’s ok we’re all on our own journey, however and I guess this is the part I’m having difficulty with at the moment is that I found her account on Twitter which is public but she’s been inactive for a few years and it pretty much has a lot of discussion about her past sex life with her friends along with a few instances of back and forths with random guys on Twitter who she hooked up with, now I completely understand I’m in the wrong here but how do I correct that wrong I do feel slightly sickly about it and she comes across as a completely different person anybody have any advice how I can overcome this hurdle none of these are dealbreakers I’d just like to know how to overcome these feelings?",
        "created_utc": 1678302986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think there’s such thing as complimenting TOO much?",
        "author": "AnotherThrowAway1320",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m56x2/do_you_think_theres_such_thing_as_complimenting/",
        "text": "I tell my partner every day at least one or more of these: You’re so beautiful, you’re so amazing, I love your [body part], you’re so special to me, you drive me crazy, etc. \nAnd I genuinely mean it. He’s fucking spectacular and so handsome, I can’t help but keep it all in. He appreciates it every time, smiles and kisses me, thanks me, and reciprocates. My overthinking-ass is wondering if this is going to get tiresome for him or annoying. We’ve been casually “dating” for 1.5 years but got closer in November and serious in February. So very much in the honeymoon, infatuation stage still. I just want to compliment him and tell him what I love about him every time I look at him lol. Anyways, should I chill out?",
        "created_utc": 1678302892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Birthday Blues",
        "author": "nrob182",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m4z66/birthday_blues/",
        "text": "I have a birthday next month. Not a major one; I’ll be 36 but I just am not looking forward to it. I get like this every year if I think about it. Does anyone else feel this way around their birthday or leading up to it?",
        "created_utc": 1678302397,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know exactly what I need to do, I am just not being able to do it!",
        "author": "fleabag1991",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m4ejz/i_know_exactly_what_i_need_to_do_i_am_just_not/",
        "text": "Currently depressed (already on meds) and probably have ADHD too (the diagnosis are so difficult in my country...) struggle a lot with low energy and a very poor executive function. \n\nI am not exercising and my diet isn't being healthy enough. And I know by a fact how much all this matters, but i just not being able to do better. \n\nI will do some days of exercise and then something happen (too tired from work, PMDS, feeling down...) and I don't wanna go anymore. I will cook health food for some time until I get overwhelmed by work or anything else and will back to delivery again. \n\nAnd eating badly and not exercising only make me feel awful and more fatigued. I know that I need to change it but i just don't have the will to keep the routines.. what am I missing here? Any advices on how to improve it? \n\nSome background: I am 32f, live alone and work full time at a company, leave home around 8h30am and back 6h30pm. 2 cats. No kids.",
        "created_utc": 1678301120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I crazy for being sketched out about her weekend?",
        "author": "Dependent_Breath_438",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m3qew/am_i_crazy_for_being_sketched_out_about_her/",
        "text": "[removed]",
        "created_utc": 1678299582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pelvic Floor Issues?",
        "author": "AdFinancial8924",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m3a5i/pelvic_floor_issues/",
        "text": "I had a really painful surgery last June- a hemorrhoidectomy. 0 stars. Do not recommend. I'm having a complication that now my pelvic floor is weak and I'm dribbling a little urine and having some discomfort. When I'm not dribbling urine I have the sensation of dribbling urine. \n\nI followed up with the surgeon and she examined me and confirmed weakness. She wants me to follow up with this other doctor plus a gynocologist for advice because this is more common with women who have given birth (I've never given birth).  I can't seem to get ahold of these doctors offices at the right time I've been super busy to even find time for an appointment. \n\nSo I tried to research exercises on my own. But just like anything else online, I keep finding conflicting info. One website says to do \"bridges\" one says \"don't do bridges\". One teaches about trying to learn how to flex and relax the muscle. Another says this isn't the most effective. Anyone have a really good source that worked for them until I can actually get in to see the doctors? All of the medical websites say go to physical therapy but isn't there just a good YouTube video I can watch? I'd like to no longer pee my pants. Thanks!",
        "created_utc": 1678298552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for good and comfy bras",
        "author": "anxiousoracles",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m3102/looking_for_good_and_comfy_bras/",
        "text": "Hi, I’m new and 35. I’ve got some big ol honkers (40G US) and I’m looking for some supportive bras that don’t cost an entire appendage to purchase and are actually comfortable. Preferably with the option of padding, no push up, and wider/cushier straps. Hubs and I have set aside some money to buy me a couple since I only have one I wear regularly besides sports bras. \n\nI’m curious about what my fellow big titty owners like. I’m completely fine with trying something new if it’s highly recommended. \n\nMuch appreciated :)",
        "created_utc": 1678297986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fulfilling romantic needs when single",
        "author": "hohohomotherfucker9",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m1wtx/fulfilling_romantic_needs_when_single/",
        "text": "[removed]",
        "created_utc": 1678295455,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about waxing",
        "author": "Immediate_Run56",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11m18hm/a_question_about_waxing/",
        "text": "Hey guys so i normally don’t shave, i just trim down there but last year i decided to get a wax and i noticed two things   after the wax my lips (labia majora) were wrinkly and i had so much ingrowns after the wax. at that time i didn’t moisturize down there because i didn’t know you were supposed too . \n\ni want to get a wax for this spring break but i don’t know how to prevent the wrinkles from happening again, i mean if normally leaves like 12-24 hours after the wax. \n\nmy down there routine is exfoliating with a african net sponge with avenoo sensitive wash and moisture with cerave moisturizer. what steps can i remove or change to make it better.\n\nthanks to anyone who replies, im a 17 year old student in college and my mum didn’t really teach me anything about down there because i haven’t seen her since i was 12.",
        "created_utc": 1678293947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Denied a conversation",
        "author": "throwracoffeecup00qq",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lzzkw/denied_a_conversation/",
        "text": "[removed]",
        "created_utc": 1678291115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finance annoyed that I miss my parents",
        "author": "Outside_Giraffe_4738",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lzpfn/finance_annoyed_that_i_miss_my_parents/",
        "text": "[removed]",
        "created_utc": 1678290458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! What do I (32F) wear to my sister’s (24F) wedding?!?",
        "author": "Both_Perspective1498",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lyy7g/help_what_do_i_32f_wear_to_my_sisters_24f_wedding/",
        "text": "I’m braced for some hate but I really need help.\n\nMy sister has always compared herself to me. I wish she wouldn’t. She’s beautiful and talented and way better at handling life than I am, but she disregards all that when it comes to me, especially during dress up occasions.\n\nSo for some context, I dressed in something loose-fitting and high-necked and low-hemmed for her graduation and she got pissed at me later because I was “making her look insecure” by “dressing down”—but she got just as pissed off at me during her awards ceremony when I wore a black-tie worthy dress to a black-tie coded event because I was “upstaging” her.\n\nKeep in mind, I’ve never had either a graduation nor an award. Or a real wedding, for that matter. I kind of suck at life and she’s *so good at everything* and I’m infinitely proud of her\n\nBut I’m taller than she is, I’ve got the hourglass bullshit going on, I’ve got insane amounts of curly hair, and I’ve had grown men after me since I was 11. There are obvious severe downsides to this situation, but she doesn’t seem to see them, and I *really* just want her day to be about *her* and her fiancé and not about me or her insecurities regarding me.\n\nWhich brings me to my question: what the heck should I wear?!?",
        "created_utc": 1678288653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another career change query",
        "author": "MaleficentBus8198",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lyjly/another_career_change_query/",
        "text": "[removed]",
        "created_utc": 1678287694,
        "upvote_ratio": 1.0
    },
    {
        "title": "okay single... until I see my ex. Anyone else has this issue?",
        "author": "wolframdsoul",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ly4yi/okay_single_until_i_see_my_ex_anyone_else_has/",
        "text": "Hey, so I thought about sharing these odd feelings of mine.\n\nSo for start, I am on the camp of \"I am happily single, but won't oppose to finding a partner\". I am 35(f), no kids (very happy with my cat), lesbian so small dating pool.\n\nMy longest relationship was 5 years, while I had a good relationship for 4 years (with ups and downs) the last one involved my ex having an emotional affair and a lot of gaslighting. When we broke up, i went through therapy where i realized how messed up those 8 months were (also, peek covid time).\n\nI dated around, but ended up preferring to be single (and feel quite comfortable with it), but somehow I feel a extra... Inadequate when I see them around (i avoid them like a plague, but we have similar hobbies and sometimes we end up in the same crowd). They are always with the person they cheated me with, which could be more related to that than my actual single status... But somehow it makes me feel shitty that they have that person that they cause me so much pain and I just ended up not finding an person to be with.\n\nIt's also the only times that I feel an extra odd/bad feeling about being single.\n\nAnyone has any similar feelings? How do you cope with them?",
        "created_utc": 1678286704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rock the Block - do you agree with the first week winner (SPOILERS INSIDE)",
        "author": "LilDoggeh",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lxplj/rock_the_block_do_you_agree_with_the_first_week/",
        "text": "I really like the Back Street Boy and his designer as humans. They seem incredibly nice and very passionate. The couple that won - I'm just a big fan of the guy in that couple. I've watched their show and he's really mean and rude to his wife, imho. Having said that, I was surprised they didn't win.\n\nWhich design was your favorite?",
        "created_utc": 1678285554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on how to start following the news",
        "author": "Desperate-Proof-3213",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lxd2y/advice_on_how_to_start_following_the_news/",
        "text": "It's kind of embarrassing tbh and I try to change it but always give up. I'm 25 F and I don't follow the news daily, I sometimes go a week or two without checking the news on my phone unless I come across it on social media like Instagram (but rn I'm not using insta, I'm using tiktok since it has a positive impact on my mental health, though I try to scroll less on it). When I do try to check the news, after living under a rock for 2 weeks approx, I feel overwhelmed and I barely understand what's going on (especially politics or economy news, or US's news). \n\nI try to tell myself that I'm not alone in this, but can't help feel embarrassed especially being 25. Is this _bad_ ?\nWhat's your opinion on my situation and have you ever been in such situation? How did you feel? My main question is, can someone guide me on how to follow the news regularly and understand it in a deeper way? \n\nBtw Idk if this matters but I have the following: anxiety, depression (currently doing well tho), ocd (dealing with it ok too currently), and I feel \"inferior\" sometimes in comparison with anyone that crosses my mind (maybe it's inferiority complex or imposter syndrome, idk)\n\nThank you",
        "created_utc": 1678284631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else find that they sometimes feel more attracted to a guy when he is vulnerable?",
        "author": "AmazingAffect5025",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lx5vv/does_anyone_else_find_that_they_sometimes_feel/",
        "text": "Something that intrigues me is when guys show vulnerability. I feel this strong “motherly” instinct and affection towards them. When a guy I like is sick, I feel the urge to look after them and make a fuss of them. Same as if he is injured. When I was 14 and the guy I had a crush on had crutches, I felt extra affectionate towards him. Additionally, if a guy I like is crying. It sounds really weird, but it almost makes me feel more attracted to them. I also find a guy’s “tired” voice really cute. Like “aw poor baby just woke up” - there’s just something adorable about it.\n\nThere are people who are repulsed by other people’s shows of vulnerability. For example, a woman being turned off and wanting a guy to “man up” if he is crying. What’s the psychology behind the differing reactions?",
        "created_utc": 1678284112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else lose all interest in men after masterbating?",
        "author": "ObliqueOrchid",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lwr2k/does_anyone_else_lose_all_interest_in_men_after/",
        "text": "I used to think of myself as a highly sexual person. I've had one long term partner and a lot of ONS and FWB. I've now been voluntarily celibate for just over a year.    \n\n\nSometimes a guy will flirt with me and I'll get excited. When I'm home, though, I can conjure up a fantasy much better than what any man has ever done for me. During the post-orgasm clarity I always wonder why I ever thought men were worth my time.   \n\n\n\nAnyone else?",
        "created_utc": 1678283009,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do for depression when therapy and medication aren’t enough?",
        "author": "stinkybutterbean",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lwiwk/what_to_do_for_depression_when_therapy_and/",
        "text": "I’ve been in therapy and on medication for a few years now. I’ve tried a few different therapists and a few different medications.\n\nHowever, the numbness, the overwhelming desire to stay in my bubble and do nothing and see no one, and sleeping sleeping and then sleeping some more still dominate my life most days.\n\nWhat other things have you done/do you recommend to combat depression?",
        "created_utc": 1678282389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey I’m Looking for Something New this Week?",
        "author": "angelmaria12",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lrodi/hey_im_looking_for_something_new_this_week/",
        "text": "[removed]",
        "created_utc": 1678267158,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you knew for sure you were going to leave a job, what helped you go about regular business until you could actually quit?",
        "author": "Whowantsteriyaki",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lrnu0/when_you_knew_for_sure_you_were_going_to_leave_a/",
        "text": "Today was the day I hit my limit with how dysfunctional my job is. I’ve given it almost a year and it’s clear it’s just not going to be what I’d hoped. I’m in a really specialized field though and it’s likely going to take some time to find a new job (like maybe a couple months or longer), so, while I’m finally 100% certain about leaving, I’ll still need to be there for awhile.\n\nIf anyone has been in a similar situation, was there any sort of trick or mindset that helped you get through your work and interactions until you could find a new job and actually quit the bad one? Was there an approach of some type that helped you get through your days, meetings, etc? Also, did you continue to make plans for projects and things not knowing when you’d truly be out of there? \n\nIt seems like it would be harder to do the more problematic the job is. Once you’ve seen things being done so poorly it’s hard not to focus on that, and hard to want to contribute with much heart.",
        "created_utc": 1678267103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey I’m Looking for Something New this Week?",
        "author": "angelmaria12",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lra3b/hey_im_looking_for_something_new_this_week/",
        "text": "[removed]",
        "created_utc": 1678265782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why not give up?",
        "author": "nyalavita",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lqzpi/why_not_give_up/",
        "text": "I just read a thread on here where people shared their experiences with depression and what they do/have done to combat it. I've been depressed pretty much all my life. I remember having bouts of it as a child, had my first deep dark depression when I was 19, again a few years later and it's just been a case of sink, almost drown, save myself, try to heal, eventually sink back into it and the cycle goes on. \n\nBut why? For those of us with chronic depression, what is the actual point? If you begin to have suicidal ideation what is stopping you? Why try to continue fighting the same battle? It's too big, it's too powerful and we will never win. So why not just give up? Wouldn't that make it easier for everyone in the end? Taking care of my mental health is bankrupting me. I can't keep paying for therapy for the rest of my life. I can't keep expecting my family and friends to have the same conversation with me ad infinitum. I can't keep cycling through the motions of living a life that not only lacks flavour and optimism, but is causing me active pain on a daily basis.\n\nI'm very exhausted at this point and I don't care enough about myself or anyone else enough to continue.",
        "created_utc": 1678264732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anybody had a guy disappear after a great date?",
        "author": "wolfyish",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lqcub/has_anybody_had_a_guy_disappear_after_a_great_date/",
        "text": "Im 2 months out of a long relationship. I have met guys out and wanted nothing to do with them and had zero desire for physical intimacy and have been focusing on healing.\n\nI met a cute guy out and we went for drinks. All night we were laughing, he kept talking about future plans (going to the beach etc) the end of the night he kissed me and we had insane sexual chemistry. He asked me if I wanted to keep hanging out because the bar was closing…i really did but was super nervous and thought it would be best to end the night. He said okay and dropped me off and we kissed some more before I left. I was smiling from ear to ear and thought i was gonna be hearing from him immediately….i started to get kind of worried bc we had quite a few drinks so i texted him if he got home okay and he responded with yeah and then said he had a fun night…we talked a little bit more but immediately i felt he was being a bit standoffish. And since then….absolutely nothing. \n\nI know I have been out of the game for close to a decade but WTF I know I’m not crazy and we had a good time. My one friend thinks he was butt hurt bc i rejected keeping the night going…but even if he was… why wouldn’t he want to hang out again? Im just soooo confused bc i know Im not crazy. Obviously i’ll get over it but hurts to feel rejected after having these excited feelings for somebody.\n\nHas this ever happened to anybody?",
        "created_utc": 1678262613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fiancé resentful over my closeness with my parents / compared to lack of closeness with his",
        "author": "Outside_Giraffe_4738",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lq6yz/fiancé_resentful_over_my_closeness_with_my/",
        "text": "[removed]",
        "created_utc": 1678262078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy international women's day! Do you celebrate it where your from?",
        "author": "Junior_Squirrel_6643",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lpxqn/happy_international_womens_day_do_you_celebrate/",
        "text": "To all the incredible women in the world, shine on, not just today but every single day. Happy Women's Day.\n\nHow do you celebrqte it where you are from?\n\nI'm from the Netherlands and it's not really a thing here but my mother comes from Czech Republic and it's a quite known and celebrated holiday.",
        "created_utc": 1678261207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Male 25 self conscious about Phimosis",
        "author": "Ok-Jeweler805",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lpjra/male_25_self_conscious_about_phimosis/",
        "text": "[removed]",
        "created_utc": 1678259911,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you get over your belief that you’re not attractive enough?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678259673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I went to a tyre shop today. It was a entirely male staff and I was treated like an idiot. Called ‘darling’ by two of the men. It wasn’t until I started to speak more that they took me seriously.",
        "author": "Top-Meringue-1375",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lnp5m/i_went_to_a_tyre_shop_today_it_was_a_entirely/",
        "text": "I think because I look young despite being late thirties is why this bothers me so much. \n\nI’m too old for this shit. I am a very independent capable person. I have comptletee many manual tasks without a man to help me. \n\nSo when I walk into a shop and the metal music is extremely loud in the workshop, and there’s no women around, and they treat you like an idiot it makes me incredibly uncomfortable. \n\nI really thought the days of feeling this way were over. But the same primal instinct of “I’m uncomfortable and I’m glad it’s the middle of the day in a business” because I can see how scary it would be otherwise. \n\nSo for international women’s day I say a prayer that one day women will be safer. If that’s someone Inventing a sophisticated and concealed device that can help get you out of a bad situation that would be great. I don’t know. I’m over it.",
        "created_utc": 1678254045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird that I avoid casual sex and am I making women feel bad about themselves by wanting to wait?",
        "author": "Chinaski_1990",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lm8cc/is_it_weird_that_i_avoid_casual_sex_and_am_i/",
        "text": "Having been out of the dating game for nine years, I'm now newly single. As a 33 year old man, I kind of assumed it would be challenging to find someone but I've had signs of interest from a few women now. One thing which strikes me as strange though about myself is that I don't seem to be able to have casual sex. \n\nThe emotional attachment that I carry to sex is weird given that modern hookup culture espouses a \"catch flights, not feelings\" attitude to sex and relationships. It seems very common for people to have hookups and not think too much about any sort of deeper connection. And I wish I was the same but I just can't seem to do it.\n\nI feel bad not only about the missed opportunities, but also because maybe I'm making women feel bad when they show genuine interest /attraction in me yet I don't make the final move. The most recent incident happened when a girl I'd known for a couple of days ended up outside my place and the moment was there but the nner resistance reared its head and nothing happened.\n\nI guess I'm looking for advice on this and whether it's something that could be a sign of a deeper issue such as low self esteem given I've just come out of a long relationship which was for the most part very toxic.",
        "created_utc": 1678249752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creepy Basement Suite?",
        "author": "idolizedkidneys",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11llfuo/creepy_basement_suite/",
        "text": "[removed]",
        "created_utc": 1678247537,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you figure out if a significant person in your life was a narcissist?",
        "author": "UVIndigo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ll6gc/how_did_you_figure_out_if_a_significant_person_in/",
        "text": "I started seriously working on myself and realized that someone I was very close to made me feel shitty and depleted every time I hung out with her. I went low contact as an experiment to see if it would make me feel better and, honestly, I felt like I had SO MUCH breathing room. I felt significantly happier.\n\nToday she texted me a bunch of seriously depressed texts in a row and I started to second guess whether I was being a bad friend rather than taking healthy space and I responded to them about 6 hours later with some sympathy.\n\nWhat I got was a nonstop flood of victimhood where absolutely nothing I could say seemed helpful and it just seemed to make everything worse. It didn’t feel like venting. It’s hard to explain if you’ve experienced normal venting/spiraling from a friend and then experienced this. It was like she was begging me for attention and also pissed at me at the same time for not being helpful enough for her. Constantly fishing for me to build her up. If it was just this one time I saw this behavior, I’d write it off as a bad day but looking back she’s someone who is perpetually in crisis and I realized this is ALWAYS how it is with her. It’s a one sided friendship because even when something bad is happening to me, whatever is going on with her is 10x worse. Looking through the conversation with a critical eye, I can’t understand how I put up with this behavior for so long. It reminded me of something I read a long time ago about narcissistic victimhood and something clicked for me.\n\nI feel like shit again. I know she’s waiting for me to ask her if she wants to grab a drink or dinner soon for support and I just…don’t want to. I’m not even sure how to respond if she asks me. I don’t even know if I want to respond.",
        "created_utc": 1678246821,
        "upvote_ratio": 1.0
    },
    {
        "title": "itching down \"there\", 35yo",
        "author": "garbag3acct",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ll2lj/itching_down_there_35yo/",
        "text": "Not sure if this is the appropriate sub, but I am looking for some advice. A few days ago, I noticed a sore hard lump on my inner labia. It didn't appear to have a head like a pimple, so I soaked in the tub and kept an eye on it. A couple of days later, I was going pee and when I wiped, it exploded with  blood, pus and an odor. I asked my mother if she'd experienced anything like this as all my search results showed bartholin cysts (which it was not) or STDs (which I've been tested for and I've had the same monogamous sexual partner for over 8 years now). Mom said she's had something similar and to just keep it clean and put Neosporin on it, so I did. It's healing really well, but now I have this horrid itch. I washed with just warm water tonight, no sensitive soap as I usually do, and avoided Neosporin. Should I just continue to monitor it? Is this really a thing that happens regularly as we age 😩 I've had so much uncomfortable, gross things happening to my body as I get older.",
        "created_utc": 1678246512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't stop thinking of an ex-friend :(",
        "author": "Odd-Faithlessness705",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lkwut/cant_stop_thinking_of_an_exfriend/",
        "text": "I \"broke up\" with this friend-- I was upset about something she did, told her I was upset, and we both agreed to take a break for a while until we were ready to talk. Once I was ready to talk, I reached out to her and asked if we could chat. She tried to schedule me out by two weeks. Her weekends were so stacked that she didn't have an hour or 30 minutes to call and talk about our friendship. I asked her if she was SURE she wanted to schedule it out that far, as I thought it was important, but she doubled down. I was done dealing with her flakiness and feeling like I wasn't important to her, so I told her I was done and can't be friends with her anymore. Only then did she try to call me and suddenly had time in her schedule to talk, but by then it was too little too late. \n\nI really miss her and often contemplate reaching out, but I don't think there's any way that I could build that friendship again because I can't ignore the fact that she didn't really... care. Our friendship was mostly me reaching out to her. I think I was putting her in \"best friend\" status when I was just \"casual friend\" status with her, but when we hung out it was usually super fun. I guess I just miss the fun we had together when she wasn't flaking out on me. The nail in the coffin though was scheduling me two weeks out. What sort of friend does that? There's also my pride, I don't want to be the one to \"chase\" her anymore. Part of me fantasizes that we'll meet again one day and she'll be the instigator, and we can be friends again but on equal grounds, but hah, that's probably never gonna happen.\n\nAnyway, share with me your friendship breakup stories to help me stop thinking about reaching out to someone who treated me shittily.",
        "created_utc": 1678246091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy International Women’s Day",
        "author": "Ezzapezza",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lkka9/happy_international_womens_day/",
        "text": "Or potentially tomorrow in other parts of the word! Today always brings mixed feelings for me. My work place celebrates today with events and usually guest speakers. \n\nMy qualm is (and I understand these people thinking they are coming from a good place) is that the conversation around equality for women especially in the work place always gravitates around child bearing and duties at work supporting this.\n\nAs being a single woman who chooses to be child free part of me feels angered by this. Yes I understand in our modern world having children and being able to go back to work is part and parcel but do we still have a world wide focus on this around equality because it’s a given the majority of women want to birth children? There is so much more like our pay not aligning to mens, bias in many forms based upon our gender but why does it always feel like it’s around popping out children. \n\nMen usually chime in stating partners should also take carers leave to share the responsibilities, again we talk like this is the norm. What about women having children on their own? Will the world ever have options for people who choice to not have children and may also need some time out from work?\n\nJust a few thoughts i’ve had and by no means am I saying anything is unfair just curious on others perspectives and if they notice this also.",
        "created_utc": 1678245158,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do extroverted girls in general not like to date introverted guys?",
        "author": "DoctorStoppage",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ljl79/do_extroverted_girls_in_general_not_like_to_date/",
        "text": "",
        "created_utc": 1678242631,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who have major medical things happen",
        "author": "No-Chicken-3477",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lj4yx/people_who_have_major_medical_things_happen/",
        "text": "",
        "created_utc": 1678241474,
        "upvote_ratio": 1.0
    },
    {
        "title": "ovulation now diarrhea also",
        "author": "fhabuluozchiqq",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lhqga/ovulation_now_diarrhea_also/",
        "text": "Do you have also diarrhea during ovulation? This is me for some time now.",
        "created_utc": 1678237858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you done a solo trip? If yes, how was it, where did you go? Do you have any advice or tips ?",
        "author": "Valuable_Relation_70",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lhi8r/have_you_done_a_solo_trip_if_yes_how_was_it_where/",
        "text": "",
        "created_utc": 1678237284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Swimsuit shopping",
        "author": "alottaaxolotls2",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lfcwf/swimsuit_shopping/",
        "text": "I had a moment of rare luck at Target a couple of years ago and found the *perfect* two-piece swimsuit on sale at the end of the season.  The top is now presumably on the floor of a hostel I stayed at in Puerto Rico last month, from when I was rushing to change in order to meet the Uber to get to the airport.\n\nAlthough I’m still mourning the loss of the only attractive 34B swimsuit top carried by any Target ever, the silver lining is that I get to go swimsuit shopping before all the good finds get picked out.  So where do you go to buy swimwear?  Budget is under $100, if it’s durable, with some preference for ethical/eco-conscious companies.  I’m on the lookout for another tasteful bikini.\n\nThanks in advance!",
        "created_utc": 1678232012,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was told by one of my friends that it’s a girls outfit/ style of dressing and I should tell him to change",
        "author": "justanothergirl45",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lesa0/i_was_told_by_one_of_my_friends_that_its_a_girls/",
        "text": "I was told by one of my friends that it’s a girls  outfit/ style of dressing and I should tell him to change",
        "created_utc": 1678230705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does a woman's type/preference even matter if men ultimately are the ones doing the choosing?",
        "author": "Macrowaving",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11le05w/does_a_womans_typepreference_even_matter_if_men/",
        "text": "I'm one of those unlucky women that has had really terrible luck when it comes to being the recipient of romantic interest. To the point where now the only advice I'm given is that I should only choose from the pool of men who seem to be attracted/interested in me. \n\n\nNow in my whole lifetime, I can count on 2 hands the number of men who have approached me and the last time I had someone express interest was in 2014. These were not great guys though. Partly due to me not being attracted to them but also having an inkling that we wouldn't be compatible. These were not the best choices for me.\n\n\nIt's pretty obvious (from personal experience) I'm not my types type. So to me it seems rather futile for someone like myself to even have a type/preference because I'm just deluding myself at this point right? \n\n\nSome women it just works out for them and they have no problem pulling guys that are their type. For other folks, does it even matter and I should just reserve myself to the (small) pool of men who have/had shown interest of that's all I can get?",
        "created_utc": 1678228995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Help Me Be Optimistic About a \"Fresh\" Start",
        "author": "Square_Midnight",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ldr9r/please_help_me_be_optimistic_about_a_fresh_start/",
        "text": "Over a decade ago, I moved away from City A (for a lot of reasons) to City B. I was almost 30 and I was SO excited, happy, optimistic, etc. at the time. Looking back, it was like I was a completely different person. Well, a lot happened in those 10 years, and I see now how I was conditioned to be an overly naive and optimistic person due to trauma, which opened me up to very manipulative people and bad situations where I ignored red flags. \n\nObviously, I've learned a lot, grown, and I've done a lot of work. I'll admit I've looked to jobs, friends, and relationships as saviors, but I think I've finally, finally learned my lesson. Well, now I'm back in City A, and I wish I had some optimism, but I don't. It just feels like starting over again after having just left the end of a boxing match. Yes, I have a new job where I can use my degrees and actually be proud of my title, maybe even shape the organization and create my vision. Yes, I have to find a new place to live and, luckily, I can take my time and not feel rushed. And yeah, I get to make new friends and try and date (yikes), now armed with the awareness to try and avoid previous mistakes and missteps. \n\nBut, I'm emotionally exhausted. I'm terrified this job will turn toxic and abusive. I'm terrified I won't find a place to live that I can afford and that I love. I'm terrified of meeting more people who seem great at first and then, months later, find out who they really are. I'm terrified I'll never find or have the community I want. I've already tried out a few places and the results weren't great, which has made me hesitant to put myself out there again. I have made some new friends, but I'm honestly at a loss of how to nurture these relationships going forward. \n\nI'll admit, I'm in a dark mood. I feel like the next 10 years will just be terrible, too. I feel like I should just give up and go through life on auto-pilot. I feel like I should settle. I feel like I'm never going to be happy again. I've been doing ketamine therapy and talk therapy and I just don't know how to view the world. I can't be optimistic. But, my realism is a lot right now.",
        "created_utc": 1678228448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just curious what are your opinion on a so called fact that \"women need a reason to get intimate while men just need a place!\". Do you believe this is correct?",
        "author": "Itsunknown7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ld29m/just_curious_what_are_your_opinion_on_a_so_called/",
        "text": "",
        "created_utc": 1678226935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Putting yourself or your friend first?",
        "author": "Literatelady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lcr4r/putting_yourself_or_your_friend_first/",
        "text": "I am meeting up with some friends on Saturday, two who moved away and another friend I see more regularly. It's her birthday. It's about an hour and a half drive each way and I'm just not feeling great. Her grandmother also recently passed away. We're meeting up with our other two friends who moved away. The truth is my friend and I are as close as we used to be, and I am not really feeling mentally up to the meeting. I feel like my energy is very limited and I just don't have it in me to go all the way there and back. \n\nWhat would you do in my shoes?",
        "created_utc": 1678226271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women that have great relationships with your MIL, what does that look like and what are some things she has done to make you feel loved, included, and respected?",
        "author": "plantsarecool222",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lck0p/women_that_have_great_relationships_with_your_mil/",
        "text": "",
        "created_utc": 1678225835,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to ask my ex boyfriend to be with me even though he’s expressed he doesn’t want to be with me and doesn’t want solutions. I miss him. I want his comfort and company.",
        "author": "Chat_De_Miel",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lcjmk/i_want_to_ask_my_ex_boyfriend_to_be_with_me_even/",
        "text": "Same as title. I know it won’t go over well and I could lose our friendship by approaching it. But I want it.",
        "created_utc": 1678225813,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, I got into a fight with my best friend …",
        "author": "daftpenguin3",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lbzs6/so_i_got_into_a_fight_with_my_best_friend/",
        "text": "[removed]",
        "created_utc": 1678224598,
        "upvote_ratio": 1.0
    },
    {
        "title": "child abuse - need advice.",
        "author": "k-pai",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11lbics/child_abuse_need_advice/",
        "text": "You dont have ny permission to share this anywhere.\nI (37F) have a stepdaughter (7F) I'll call her B. B.stays with us Tuesday and every second weekend. I absolutely adore her and luckily for me, she adores me too. \nB has a little sister (3F) I'll call C and a 3 week old sister J at her Mums house and a (18F) sister P, who doesn't live at home.\nWe all get on pretty well, when B's Mum went into labour, B &amp; C were dropped off to us in the middle of night so I could look after them while baby was being born. \nC is a really cute little kid, she's loud and wilful but also caring lovely.\nAbout 2 months ago, B told her Dad and myself that her step-dad (C and J's Dad) has been smacking C with a wooden spoon to stop her from being naughty. As you could imagine, my husband freaked a little and asked B if SD hit her too and she replied no because she's not naughty. We told her that hitting kids isn't good and he shouldn't do it. SD said to her that it's the only to get C to listen. I said to B, is C still naughty after she gets hit? And B said yes. So I said, see it doesn't work and you should never hit kids. B agreed. We told her to tell us if he ever hits her because it's not ok and Dad will make sure it stops.\nMy husband and I were really upset and couldn't understand how his ex could let this happen. When they were together and raising P &amp; B, there was no physical punishment.\nThis leads me to what happened yesterday. Yesterday B told her Dad that SD is now hitting C with a belt and putting her in a dark room for timeout. I'm no psychologist, but I'm pretty sure she's acting out because she has a brand new baby sister and doesn't know how to process or express how she's feeling, and she's getting physically assaulted?! It's so messed up. When C was born B started wetting the bed again, it's normal for kids to struggle and punishing them is not ok.\nIt's not B thats being hit, but neither of us are ok knowing that C is and not doing anything about it. We don't want B to stop telling us what is happening either, but if she gets punished for telling us then that's exactly what will happen.\nSo reddit, I'm looking for advice- what should we do?\n(Also not living in the US)",
        "created_utc": 1678223509,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you just want to go pick up or quickly meet a guy, how do you go about it? No apps.",
        "author": "diamondeyes7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ladab/when_you_just_want_to_go_pick_up_or_quickly_meet/",
        "text": "In my early 30s pre-COVID, I could sit at a bar, bring a book and meet dudes. Or at least it was easy to chat with people. However now I've been sober for more than 3 months and don't want to drink or have the temptation, but I could sit at a bar and drink something non-alcoholic. But bringing a book or being on my phone might steer men away.",
        "created_utc": 1678221031,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often do you think about what could've been?",
        "author": "ALLNEWstratuponavon",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11la2pn/how_often_do_you_think_about_what_couldve_been/",
        "text": "I meet a lot of very talented young people in my job. Like \"best _____ under 25\" types.\n\nAnd they come from various backgrounds. Yes, many are wealthier, but some aren't. I met a 24 year old author who grew up poor in the middle of nowhere. And here he is, on a national book tour, engaged, and in the process of buying a house. \n\nAnd you talk to them, and the big this I notice is support and education. Regardless of their finances, they had those things.\n\nMy childhood wasn't terrible. It had it's issues, everyone's does, but I would never describe it as \"bad.\" \n\nBut they were definitely lacking in those two things.\n\nMaybe it's because I work with these very successful creative/entrepreneurial types all the time, it makes me think about what could've been a lot.\n\nAnd sure, we all say \"age is just a number, you can still change!\" but let's be real, it's a lot harder to make big changes when you're older. Yes, you CAN, but are you really going to?\n\nAnyway, I'm not obsessing over it, I try to just get on with my day, but it nags at me sometimes. \n\nHow do you deal with those feeling?",
        "created_utc": 1678220359,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m going on a trip to see my parents. My husband has a huge problem with it.",
        "author": "Ihavesomethingtosay9",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l92n5/im_going_on_a_trip_to_see_my_parents_my_husband/",
        "text": "I’m 32F and husband is 40M. We have a two year old son. \n\nI planned a trip to see my parents with my son. I did this without much input from my husband, which is his big problem. I didn’t include him and due to work, he can’t go. If I had waited until after the beginning of April, he could have gone.\n\nWhy did I do this? I did it last year and it was fun. But last year we had a daycare that was closed for the week, so we really had no choice. We switched daycares and now we have a choice. \n\nI haven’t seen my parents since Christmas. My husband has been upset literally every day about this. I can’t stand it and I honestly feel like I’ve done nothing wrong. Why can’t I see my parents? Why can’t I visit without him? He says it’ll look like we have marital problems, when the only one we have is his issue with me going on the trip. Wtf? \n\nNow he wants to go for the 24 hours that he can fit into his schedule and go home afterwards, with me staying until Tuesday still. No change in my plans, he’s just being present for like… 24 hours. Last month, I would have welcomed this suggestion. But today, I’m super annoyed by it. I feel like I can’t escape him. \n\nWe both WFH in the same room. Maybe if I’m being 100% honest, I was looking for a break, but we all know we can’t say that out loud. He keeps asking me and I keep denying it. I’d rather deny it than go into an annoying and irrelevant conversation. \n\nSomeone tell me I’m being unreasonable if I am, because my intentions are good and clear, so I don’t see a problem.",
        "created_utc": 1678218164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discovered my coupled friends share my texts with their partners. Am I right to be PO'ed?",
        "author": "FruitFlyTree",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l8li5/discovered_my_coupled_friends_share_my_texts_with/",
        "text": "Hi ladies, hope you're all having a great day (okay well, at least a nice day lol). \n\nMe and all my friends are early 30s. I'm one of the only single ones in my two different friend groups. We don't have any group chats, it's all only one-on-one. Last week I unwittingly found out while texting one of my friends that he shares my text messages with his new GF (they've been dating for only 2 months). He casually let slip something like \"I never noticed before Jessica pointed it out how formally you text! lol\". To which I texted back \"umm, how would Jessica know how I write?\" as I haven't even met her yet and I have never texted her. \n\nLong story short, this opened the floodgates; I then found out this is supposedly a natural and common thing all my coupled friends do, male or female (though most are women): they sometimes share my text messages with their married spouse or boyfriend without telling me... their defence for this is **1)** **it's harmless and a compliment** because I am hilarious and they love sharing my jokes with their significant other \\[I know I am hilarious, but c'mon\\] **and 2)** **they have no secrets** in their relationships, so that even if they don't necessarily have an open phone policy they are in a relationship and have the right to share openly with their SO.\n\nTheir second \"defence\" really rubbed me the wrong way, because in my opinion it was said with an air of superiority/patronizing to me, the perpetual single friend, who will act the same way as soon as I get myself a boyfriend yada yada. I'm not a gossiper and have never forwarded any friend's text, single or married, to anyone else. \n\nThis has resulted in me \"ghosting\" my coupled friends, since I feel a bit paralyzed to return their text messages now knowing there is a third invisible person in our chats i.e. their husband/boyfriend. I was not happy with their above responses when I told them I did not like this. **Am I overreacting**? I think it's so rude. \n\n\\[In case anyone asks (though I don't think it's relevant): I am not *best*\\-*best* friends or anything with any of my friends' significant others. There is no animosity, I just never hang out with them and I only ever see them at my friends' birthday parties etc. I don't know how or why it turned out this way, but I think it's normal, at least in my friend groups. When we hang out the spouses often don't come, so there is no opportunity for me to befriend them, not that I am interested to. My reason for mentioning this is to explain why it feels so weird that they read my texts when at best we are acquaintances only because they married my best friends. Maybe that should be a separate post: how close friends are you with your friends' significant others?\\] Thanks.",
        "created_utc": 1678217098,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes you attracted to younger men? (If that is the case)",
        "author": "icausepain_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l8jxg/what_makes_you_attracted_to_younger_men_if_that/",
        "text": "I've noticed that as a dude, I tend to attract a lot of older women. Which Im not complaining about at all. But I really wanted to understand your perspective on relationships with younger men?",
        "created_utc": 1678216996,
        "upvote_ratio": 1.0
    },
    {
        "title": "I freak out when I think about having sex, even though I want to. Has anyone experienced this? I feel like something deeper is wrong, even though I have never had any *bad* experiences if ya know what I mean",
        "author": "nostalgicmssatherbst",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l7x13/i_freak_out_when_i_think_about_having_sex_even/",
        "text": "(I hope it is ok to discuss this specific topic on this subreddit. I always find the best replies and understanding comes from here, which I really love and appreciate of you all &lt;3)\n\nI am a 24 year old woman who grew up in a religious upbringing. I was also the kind of person growing up who never really got male attention, had a boyfriend, and bullied because of my weight. Anyways, you know how it goes. As each year went by, my self esteem would go lower and my social anxiety was getting worse as I got comfortable just being with myself, going home, watching tv and eating food, going out with girl friends- but boys? They didn't look my way so I just suppressed that, even though I felt worthless, ugly, just felt like absoulte trash. My friends would get boyfriends. I would just be there, unaware of how much I truly disliked myself and was punishing myself for it. When you see how people treat you, over and over- when they say similar comments, or when no boy has ever asked you out- you feel undesirable. Like you are not meant to ever have that life. Like your body is not meant to have that pleasure. \n\nDon't get me wrong- there is a side of me who is confident. Who loves myself and knows her worth. But whenever I talk to a guy now, and more so think about sex or anything like that- my brain immediately wants to shut down or change the topic. I just can't chill I act like a prude. \n\nI remember having a 3 minute sex education presentation in like, 5th grade. But that's it! When you grow up being told sex is this bad thing and you feel shameful for having sexual feelings, then you have no guys wanting to touch you, so you never explore your sexuality really, you never wanting to look at yourself in a desirable way or naked in the mirror- it all adds up. I thought I would be fine but now that shit is real and I want to seriously date for the first time- those insecurities and fears are all still there. Now, there is this guy I am talking to who really likes me I think. But the issue is that whenever things get sexual, which I WANT, I also freak out at the same exact time. \n\nWhenever I read anything about sex, I freak the hell out. I do wonder sometimes, why its to this severity. My therapist and parents both have wondered if I was ever molested. The thing is, ever since I turned 21, I have this memory coming back that is sort of broken into pieces but it's this very strange memory of me in a bathroom stall, with a teacher opening the door, and then I am not sure. My mom even said there was this male teacher that a few kids were afraid of. But when they investigated nothing came out of it, they asked me questions and I seemed perfectly fine, etc. I also hear that for these cases, people become hypersexual. I don't know- I don't have enough to grasp what is happening here.\n\nI know no one here knows me or my whole story so you can't know. But the reason I am posting this here is to see if anyone struggled with this in their 20s, or are still struggling with it now. I really want to overcome this but therapy doesn't really help. I know I have to just face thse fears eventually, but I am starting to really hate myself because I feel so prude ish, even though, again, I want to have sex very badly. It's this fear and anxiety.",
        "created_utc": 1678215592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I ask for a pay raise?",
        "author": "lukester15",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l7mbr/should_i_ask_for_a_pay_raise/",
        "text": "I’d like your advice please. For almost a year now, I’ve been in a job I enjoy with a ridiculously supportive boss who is also the CEO. It’s a small NGO and we all have a lot on our plates. \n\nUpon hearing conversations of my colleagues, it seems that another person at my level makes at 15k more than me a year if not more. I’m not sure if I should ask for a raise while I’m so new, and how to go about it.",
        "created_utc": 1678214910,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I help myself not be so nervous if I see my crush?",
        "author": "funambitions-823",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l7558/how_can_i_help_myself_not_be_so_nervous_if_i_see/",
        "text": "I need help from my Reddit ladies because I haven’t shared any of this with my friends yet as everything has happened so fast.\n\nAbout 4 months ago I told my husband that I wanted to divorce, and things are underway. I felt fairly “dead” in my marriage from an emotional and sexual POV. I rarely found other men attractive and just thought it was “me” and perhaps I was asexual but realized that isn’t the case.\n\nWell, I met a man who had just flipped me on my head. I don’t really know how to explain it and just need to get all of this off my chest.\n\nI’ve seen this man around my town before over the years but we’ve never spoken before and I never really thought much of him. We just met at an evening work event and ended up talking for a bit – he was not at all what I was expecting, and I felt so nervous the whole time I swear I blacked out during part of our conversation. Thankfully I saw someone else there and the conversation ended because I am sure I was so red in the face. It was hot outside so I'm hoping he thinks I was just too hot in the sun. We’ve emailed since about some work items and I am just so freaking nervous and have butterflies 24/7. I have never experienced this before, and I am physically buzzing just thinking about him. I’m literally having to do breathing exercises to calm myself down and can’t concentrate on anything really well. I feel crazy LOL\n\nI feel like I'm going to see him again somewhere but the thought of this just makes me feel like I'll melt into a puddle.\n\nI never really thought someone could make me feel this way. I don’t understand it either because he’s not overly attractive and I don’t even know him to know his personality either. I suppose I will just enjoy it for now but I’m trying to not overthink but it’s hard when he’s literally consuming my thoughts. Does anyone have any advice – have you been here before? Is there anything I can do to calm myself down if I do see him again?\n\nI’m not delusional thinking that this is going to turn into anything but honestly any tips from you ladies would be helpful.",
        "created_utc": 1678213844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wedding attire",
        "author": "Healthy_Ad4523",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l72va/wedding_attire/",
        "text": "Is it appropriate to wear black to a wedding? I have a really pretty black dress I’ve never worn but for some reason it feelings wrong to wear black.",
        "created_utc": 1678213710,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (30F) have always been single but I can't deal with dating",
        "author": "Sad-Peace",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l6i1e/i_30f_have_always_been_single_but_i_cant_deal/",
        "text": "[removed]",
        "created_utc": 1678212419,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sister (f29) passed away recently and I (f36) moved across the country to try and help, as I had just left my ex and was living in my car. Im at her house now, have the option to take over her lease &amp; am considering getting a roommate to make ends meet. Im clueless on next steps and need advice.",
        "author": "tacoduvet",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l5c6c/my_sister_f29_passed_away_recently_and_i_f36/",
        "text": "Hey, I’m sorry that I have multiple things I need advice about.  I’ll try to be a bit more specific than in the title of my post.\n\nI had just left my abusive ex when I got the call my sister had passed away.  Her boyfriend of 3 months was the only person she had in California and I was in Alabama.\n\nAn amazing human being sent me enough to get to her and I got a job at my sisters boyfriends work and the apartment complex just approved my request to take over her lease.\n\nI haven’t ate in a few days and need to figure out how to make things work.  It’s a studio, but it’s almost $1750 a month and I currently have negative 13 in my account.  I really need to think about a roommate, but would it even be worth my time to put out an ad?  Where would I put it?  I was married since 18 and am a little too sheltered for my own liking.  Is Craigslist still the go-to?  I’m in the Sacramento area.\n\nWhat’s my best shot at getting assistance with the funeral costs, food assistance and assistance with clothing?\n\nWhat would you do if you were me?",
        "created_utc": 1678209798,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is it time to donate/recycle your worn out favourite pieces of clothing?",
        "author": "ginnapp",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l55fp/when_is_it_time_to_donaterecycle_your_worn_out/",
        "text": "So my mom commented over the weekend when we were out that my favourite winter coat is VERY worn out. And it is very true! I never noticed it because I keep the lighting in my apartment on the dimmer side and my work office does not have full length mirrors. I went to a brightly lit department store and my coat looks very very worn out.\n\nI’m kind of sad because I’ve had this coat for almost 10 years and wear it consistently, almost everyday during winter. It has absolutely no tears nor holes, the original colour is just very faded and it looks very worn out.\n\nI love to buy timeless pieces of clothing of good quality for this reason, because I can wear them for 10 years or more.\n\nWould it be time to get rid of this coat? When do you ladies get rid of you favourite pieces of clothing once they are worn out?",
        "created_utc": 1678209365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxious AF about having a baby",
        "author": "Future_Breadfruit_42",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l4cmn/anxious_af_about_having_a_baby/",
        "text": "Hey everyone! I’m 37 and my husband and I are TTC. Just started as I got my IUD out in early February.  I’m hoping to get some words of wisdom from other mommas out there who weren’t able to stop working after babies. I’ll have to keep working my office job because we need the income. I’m anxious about juggling everything…a new baby, all the new chores, and responsibilities. My husband will be a great dad but he’s not as on top of our household responsibilities as I am.  I usually have to tell him what needs to get done. \n\nI’m so anxious for the whole process and worried about post partum and handling everything including my job. My counselor suggested looking for other moms who’ve had to juggle all of this to hear stories of how it all went. I’m naturally anxious and worry about everything!!!  As I’m writing this I realize this is probably every new moms struggle. Any advice for chilling the eff out and staying calm about all this? ❤️❤️❤️",
        "created_utc": 1678207587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Advice - Not taken seriously as a woman",
        "author": "ggstar444",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l35e1/career_advice_not_taken_seriously_as_a_woman/",
        "text": "[removed]",
        "created_utc": 1678204862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone been in a phase where you just don’t care about anything &amp; feel no emotion?",
        "author": "lp2290",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l2nku/has_anyone_been_in_a_phase_where_you_just_dont/",
        "text": "I am 32 years old &amp; I used to have so much feeling &amp; hope in my early/mid twenties. Lately, I just don’t care about anything anymore. I don’t care about people, including my friends, co workers or pretty much anyone I come in contact with. I pretty much play a role, smile &amp; act happy but truly I could careless about anyone in my life &amp; their issues. I almost feel stone cold. \n\nI also feel the same in my personal life. My life has been stagnant for years I feel like I am in a hamster wheel and I just keep spinning but getting no where. I have been a relationship for 13 years we are not married, don’t know when he will ever propose, been in my apartment for 6 years and don’t know when I can even afford to move out to something better. My job, is good but I really just skate on by and I don’t care about growth.\n\nI really hate feeling this way. Sometimes, I miss having passion and being excited about things but I truly believe I have been burnt by this world so many times that I just became emotionless &amp; I want to be able to feel again. Anyone else ever feel like this &amp; if so how did you break out of this feeling ?",
        "created_utc": 1678203724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women in long term relationships- did you ever get to the point of breaking up or very nearly breaking up? Or did you always know that this was the person you should be with?",
        "author": "veryspecialnoodle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l2ddd/women_in_long_term_relationships_did_you_ever_get/",
        "text": "Asking because I think I'm (finally) on the other side of a months-long rough patch with my partner, and it was the first time I ever felt like maybe this is the end. I'm so glad we were able to work through it, but I'm curious to hear about others' experiences.",
        "created_utc": 1678203074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Home owners, do you have a \"Your place or mine?\" issue when dating?",
        "author": "MeatCat88",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l286a/home_owners_do_you_have_a_your_place_or_mine/",
        "text": "Last year I bought my first home after working really hard. It's a renovated downtown townhouse in a capital Canadian city. However, I found that dating men who own homes has been.. hard. I love my house and want people to visit. The location is great for grabbing drinks and walking home. Men However also feel the same way and want you to always go their homes. Then when there's talks of getting serious nobody wants to leave their home and move in with the other. I didn't anticipate that being a homeowner meant being in a relationship with your house and nobody else. How can you move forward in a relationship when neither of you want to leave the homes you've worked so hard to buy?",
        "created_utc": 1678202759,
        "upvote_ratio": 1.0
    },
    {
        "title": "“You don’t SEEM like you have these problems”",
        "author": "AmazingAffect5025",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l27yw/you_dont_seem_like_you_have_these_problems/",
        "text": "This was something my mom sometimes used to say when I discussed certain things like anxiety. She’d say “you look so presentable in the morning, no one would guess you’re having these problems”. \n\nIt always used to irk me a little bit, I’m not entirely sure why. I know it’s meant to be a compliment - I guess I don’t come across like a complete hopeless mess? Whatever that looks like? But there’s something about it that just annoyed me. It feels similar to “but you don’t *look* autistic” when someone says they have autism. \n\nWhat are people’s thoughts? Would you be annoyed if someone said this to you?",
        "created_utc": 1678202747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ban me from this subreddit",
        "author": "Elegant-Thing-3214",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l1sm1/ban_me_from_this_subreddit/",
        "text": "",
        "created_utc": 1678201727,
        "upvote_ratio": 1.0
    },
    {
        "title": "How casually or carefully do you you approach sex in a relationship, especially in the beginning?",
        "author": "Chat_De_Miel",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l1jxc/how_casually_or_carefully_do_you_you_approach_sex/",
        "text": "I’m curious to hear from others on this question. I for example like to wait a couple of months before having sex in order to vet the person and make sure I feel my needs will be cared for. I like to feel nurturing and connection as well! \n\nI recently dated someone who views sex a lot more casually, even in a relationship that has long term potential. They would prefer to start earlier and don’t necessarily think of the connection and sharing aspect. It was described as something you just do in relationships. \n\nAnd I want to know other people’s points of view!",
        "created_utc": 1678201168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Married women who kept their last name and had children...",
        "author": "this_is_how42069",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l1hb1/married_women_who_kept_their_last_name_and_had/",
        "text": "Did any of you incorporate your last name into the childs name? Like a second middle name for example? How common is this? Did anyone seem confused?",
        "created_utc": 1678200983,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with a younger BF who's mother is same age as I am?",
        "author": "kulambing",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l1eft/how_do_you_deal_with_a_younger_bf_whos_mother_is/",
        "text": "[removed]",
        "created_utc": 1678200786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were you ever surprised after finding out that one of your friends is divorcing their significant other?",
        "author": "CrazyGal2121",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l17d6/were_you_ever_surprised_after_finding_out_that/",
        "text": "",
        "created_utc": 1678200301,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I got the job! And now I'm completely panicking.",
        "author": "fireElmo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l102q/so_i_got_the_job_and_now_im_completely_panicking/",
        "text": "I interviewed for this job and really didn't think I would get it- but I did. It's a really great opportunity and I kind of felt like I couldn't turn it down. \n\nHowever, ever since, I've been absolutely anxiety stuck. I've been throwing up constantly and my stomach can't hold anything down.\n\nFor the past year or so I've been working part time due to mental health reasons and burnout. I typically sleep a bit into the day.\n\nI don't feel ready for a full-time day job where I only get twelve days off. It just seems like a lot right now.\n\nI really want to pull back my acceptance, but I'm afraid I won't get a chance like this again. \n\nHelp me please.",
        "created_utc": 1678199802,
        "upvote_ratio": 1.0
    },
    {
        "title": "You guys I need opinions",
        "author": "thewtfcat",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11l0vdt/you_guys_i_need_opinions/",
        "text": "So I’m limerent over this one guy that I have only just ever met two times in my whole life\n\nWe met from tinder\n\nAnd I have never had stronger feelings for anyone in my whole life ever than him\n\nUnfortunately he is not into me bc I’m not hot and he’s quite the opposite \n\nBut I still can’t help myself I know I know this is a total waste of time and all that stuff\n\nBut what I really wanted to ask for your opinion is that so this guy used to be in a live in relationship with this one chick that he was very seriously involved with\n\nHe has never had any plans to ever get married so his dream was to stay in a live in relationship with her for all his life \n\nAnd he even got a tattoo of her name with his surname on his arm \n\nBut for some reason his relationship with this chick didn’t last and they broke up and he’s just been single since he left her except hooking up on dating apps\n\nThis guy has had this girls tattoo on his arm since god knows when now but it was there when I met him and now it has been seven years since I know him and it’s still just there\n\nAnd I’m just like what do u guys think why does this guy live with her tattoo on his arm around for",
        "created_utc": 1678199499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who had a child in their late 30s, what's your advice?",
        "author": "peonyrevolution",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kzux4/women_who_had_a_child_in_their_late_30s_whats/",
        "text": "I will be 37, earliest, and I would like to learn from you. Is there anything you wished you knew in advance. What is your advice regarding nutrition etc, how can I prepare?",
        "created_utc": 1678197014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Facial moisturizer with SPF for morning use that won’t break out dry to combination skin?",
        "author": "hibbitybee9000",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kzkkj/facial_moisturizer_with_spf_for_morning_use_that/",
        "text": "Have been using Paula’s Choice, which I thought was a great brand, but recently discovered through an odd process of elimination that the sunscreen moisturizer is the culprit of my chin acne.",
        "created_utc": 1678196271,
        "upvote_ratio": 1.0
    },
    {
        "title": "experience/ opinions on starting a new relationship straight after leaving one.",
        "author": "MissJBlackheart",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kzdt4/experience_opinions_on_starting_a_new/",
        "text": "I, 36f, want to know your opinions on starting a new relationship after leaving ex 35M\n\nhow do you know its the right decision?\n\nI guess I am just looking for some reassurance. There's a few things at play, and I'm questioning myself. \n\nI (36f) left my partner (35M) of 7 years In January. We are still living together due to finances, and I'm super close to getting a council flat. He is my best friend. I love him dearly. But despite many heated rows, conversations and threats to leave, he has never pulled his weight. Has had several years being unemployed In that time, he doesn't contribute equally financially when he has been in work and has never cooked or washed up. Will only do other tasks when asked and not consistently even then. There is also some sexual incompatability, and i dont think I've had a compliment in about 5 years. I have health conditions and I have been thinking about leaving for 18 months to 2 years. But have never been brave enough, and I've never clicked with someone mentally like I do him. I guess I didn't believe I could find that again.  \n\nIn Jan, I met someone else by accident. (M35) About a week before leaving. I was already planning to and this wasn't why I did. Although may have cemented it. Nothing happened between us bar conversation. But this person is everything I could want.  Their communication is *chefs kiss*, they validate me, have excellent boundaries, deep conversation and much more. They are also not a massive man child and have their shit together. (The things that are sexy once in your 30s hey) I'm a logical sensible person, and I know he seems shiny due to my last relationship. However, the cross over in our lives, the parallels, and the coincidences are so strong and so many. I'm not really a fate person, but it's getting almost spooky. Any anxiety I usually have with new people, isn't there! \n\nMy ex is still trying to win me back. And give him his dues. He's trying hard with domestic household stuff. I can see the effort. But I also don't think I'd should go back as the issues run deeper, and I don't think it's sustainable behaviour. (Someome please tell me this is right) \nI kinda wanted to be on my own for a bit and sort my life. But this new guy!!! Has anyone been through something like This. Was it worth the risk and you found true love or does it always turn out to be a bad idea, a rebound and me not seeing clearly?",
        "created_utc": 1678195780,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much salary increase would you change jobs for?",
        "author": "beautifulsymbol",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kz98t/how_much_salary_increase_would_you_change_jobs_for/",
        "text": "TLDR: old employer didn't pay enough or appreciate me. New employer does. Old employer wants me back. Should I consider for more money? If so how much more should I ask?\n  \nI worked at my previous job for about 5 years where I quickly became indispensable. As I worked harder and learned more I outgrew my job description and title (salary is based on this as part of a compendium). I did not feel valued. So I left the company for a 37% pay increase at a new company. There were other perks like better hours, working from home and a better title and job description. \n  \nAfter I quit, my old employer changed the job title to better fit the duties (they refused to do this while I was still at the company) and upped the salary range. I currently make 2% more than the high end of the range. The job has been posted for 5 months and they still haven't found anyone to replace me. Several people at the old company have reached out asking what it would take to get me back. \n  \nIf you're reading this and asking yourself why I would even consider this. I liked my old department. I had a mentor who was amazing. He's probably the reason I stayed as long as I did. I also have a personal connection to the company where I feel like they are my sort of family.",
        "created_utc": 1678195437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay, I need to talk about it.",
        "author": "Feverish_Dreamer",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kz5sf/okay_i_need_to_talk_about_it/",
        "text": "I might be an asshole, but I don't find any substance to this relationship anymore. I'm done. \n\nI've been pushing myself for months, trying to find an apartment. I'm disabled and it has made me worse, bedridden. I'm autistic and my now ex friend (AMAB) is probably as well. Both of us are having a hard time. \n\nI let them stay at my place in exchange for help. I'm paying for it. It was supposed to be for a week or so. I ended up drained after dealing with several incidents and kicking them out. \n\nFirst, they arrived at the place that I am temporarily at. It was supposed to be short, because I needed to rest, they were supposed to accompany me for apartments viewings. Then it snowballed into a full meltdown after something spilled from their bag and I asked them to take it outside, because I can't clean and this place isn't mine. Instead of taking it outside, it was further spilled at the shared entrance. After my attempts to communicate ended with them crying and shouting I just sat there. In the end they brought a broom from the neighbors, took my keys, went to my apartment and told me that they can bring me food, but other than that, they won't respond to me further until the next day. I couldn't calm down afterwards. \n\nAnd then my driver, because I can't really walk, got sick, I called them, as I have trouble texting, and had to ask from another person to text them so that they'd reply. I asked to talk on the phone (texting takes time and energy). They refused. That set me off. You're in my apartment, with my key (I didn't have a copy), refusing to communicate or help. At this point, I just didn't want them there. They didn't respond to the fact that I don't have help now. \n\nAfter trying and panicking found a lift. I came to the apartment and tried to talk to them, I wanted to know if they're willing to help me. Instead of having a conversation they just turned to their computer. Also, their cat knocked down a container with plant cuttings and the water spilled over my clothes. I did get angry.  In response they said that I should have told them to take care of my stuff. \n\nI went to see apartments without them, they had all the time in the world to reply and say that they can and are willing to help, but they didn't. So I came back. At this point I was in a flare, pained and fatigued. Couldn't talk anymore. I told them to leave. They stormed off outside. Not a single discussion when there was time for that. \n\nI admit that I was in the wrong, maybe too aggressive, and it was a lapse in judgment letting them stay. But I can't contain them anymore. I can't be a babysitter, do all the talking, explain everything. I don't have the energy. I'm terribly ill and burnout myself. In the past they helped me, but most of the time I ended up cleaning after them, or getting stuff that I don't really need. So, I am the bad guy now, it's over, but I can't anymore accommodate their needs when they don't accommodate mine. I think that the both of us are unhealthy for eachother. I feel bad that it ended that way, honestly. But it was too much.",
        "created_utc": 1678195177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it okay to take a mental health day for this reason?",
        "author": "hunnybunnyspacecadet",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kxoim/is_it_okay_to_take_a_mental_health_day_for_this/",
        "text": "[removed]",
        "created_utc": 1678191111,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just turned 30 last year. I don't want kids but this thought that what if I regret not having kids in my late 30s keeps running in the background. Has anyone experienced the same thing?",
        "author": "Red318",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kw3fg/i_just_turned_30_last_year_i_dont_want_kids_but/",
        "text": "",
        "created_utc": 1678186461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clothing differences between different countries?",
        "author": "Muangthong200",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kvhkp/clothing_differences_between_different_countries/",
        "text": " I had the idea for this post for quite a while, and thought the moderation change would make it a good time to try it. So: What are the differences between clothing in the U.S. (which is dominant on this sub) and your country? I am not talking due to climate, but more so due to cultural differences.\n\nIn my experience, the most revealing clothing you see on the street is in the USA and Canada. In the summer months it's all about how little you can wear and u will see women wearing all types of skimpy outfits. Age or size does not matter. Women in USA and Canada wear the most revealing clothes by far when it’s not cold as hell. And I know it’s a stereotype, but many western countries including USA and Canada are actually really liberal with clothing. Western women have more freedom to wear whatever they want without being judged from others.\n\nBut I have also seen some East Asian women wearing incredibly short jeans shorts in East Asian countries like China and Taiwan. Surprisingly, China and Taiwan was home to some of the shortest booty shorts I've ever seen. I saw multiple Chinese girls and Taiwanese girls wearing booty shorts so short their ass cheeks were showing. However, showing cleavage is certainly less common in these countries.\n\nI never traveled to very conservative muslim countries but India would top my list there as the most conservative in terms of how women dress. Indian women don’t adhere to the same standards as strict muslim countries but they still tend to dress more conservatively.\n\nAnyways, this is based on my experiences so please feel free to share your opinions. I am not trying to judge others in any way. Thanks.",
        "created_utc": 1678184483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who have changed careers, how did you do it?",
        "author": "the_malteaser92",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ku8lv/women_who_have_changed_careers_how_did_you_do_it/",
        "text": "Those of you who were able to pivot into another career, how did you manage it?  What was your career/job and what did you move into? What struggles did you face?\n\nBackground;\n\nI am 31F, UK based, have a degree (in hospitality management) and a masters (in marketing), just before covid (Dec 2019) I managed to get my first full time position in marketing as a Junior, but then when covid ravaged I was made redundant (7 months later). \n\nA year and a half later I finally managed to get a job, as I was desperate for a job I took the first offer I was given, although I was mis sold the job, told it was a receptionist position with marketing involved (such as social media, website, google ads etc) and that the responsabilities will evolve over time. \n\nCut to about four months later when I inquired about the marketing side of things and I was told it wasn't necessary as the business was doing really well without it and wasn't needed. So this kinda left me in limbo, to be honest after staying at home for a year and a half, and the whole job searching process during it put me in such a bad mental space that I didn't want to restart the job search aalll over again as I didn't have the mental fortitude for it. \n\nSo instead, I utilised the time that I had (reception responsabilities were very little and I had alot of down time as long as I answered phones and booked appointments for the sales people they didn't care what I did) I focused on achieving courses and cerifications. \n\nAt this time my boyfriend started talking to me about UX/UI (product design, visuals etc) and how he thought I'd be a good fit for a role like that and there would be more money in it than marketing (he's a software programmer). So, I started reading about it, finding free courses and articles, and started practicing. I also wanted to pivot abit as my feelings towards some marketing side of things (such as ads and social media) was souring. \n\nThe point I'm at now is that I have put together a small portfolio, have finished some courses, currently pursuing another that will actually give me a certificate by Google, and have started applying for jobs. But I'm finding it's hard to come acrosss junior positions or internships when you're not enrolled in a university course. \n\nAlso, I've recently quit that job as my dog was really sick and needed cared for, thankfully financially it's doable for now to be umemployed for a short time.",
        "created_utc": 1678180098,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (34M) am searching for a birthday gift for the person (30F) I'm dating",
        "author": "kamuixxl",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ku670/i_34m_am_searching_for_a_birthday_gift_for_the/",
        "text": "Hello :)\n\nIt's pretty simple. I'm gathering ideas/tips for a birthday gift.\n\nI am dating this beautiful woman, we've been dating for a month now and it's going really great. We are pretty passionate together.\n\nShe has her birthday next week on st Patrick's day. It will be the first time that I'm going to meet her friends. Our relationship is pretty new and fresh, but I can see and feel that there's big potential for a serious and long lasting relationship and I'm 100% sure she is seeing it that way as well. \n\nI want to give her something for her birthday. Since our relationship is pretty new I don't want to go completely overboard and crazy. \n\nDetails :\n\nWe are both currently located in Switzerland. I am 34m, half French half Spanish. \nShe will be 31 next week, is Italian, likes food (duh), perfumes, fashion and her favorite color is blue and is pretty passionate in general.\n\nBuying her perfume is not a good idea. It's never a good idea anyway unless you exactly know which one the person likes.\n\nI know that the best gifts are often something very personal but as I said our relationship is quite new. \n\nDear ladies, how about a nice bouquet of flowers? With a card attached to it and a personal message telling her how nice she is and how much I'm enjoying our relationship and wishing her a very nice birthday? \n\nShe told me that she wants to invite her friends at her place first and then we're all going to the pub together. If I give her a bouquet she can just leave them at her place. I'm also thinking about the logistics x)\n\nAny tips/recommendations/ideas are welcome.\n\nHave a nice day.",
        "created_utc": 1678179839,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf (34M) and i (25F) had way too different history",
        "author": "bloodflow_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ksi31/my_bf_34m_and_i_25f_had_way_too_different_history/",
        "text": "We met from OLD, been dating half a year and everything about the relationship have been perfect so far. He's respectful, treats me kindly, gently, listens to me, doesn't mind me working on myself, well pretty much my dream man. Both him and i are physically attractive, and quite frankly, have a lot of people after us. However there are way too many differences for me to consider if i should continue this relationship or not.   \nI have never checked his phone, never wanted to know who he went out with. He also did that towards me, so that's how we roll. It's just that... here's where we differ:\n\n1. Hundreds of body count on him, and i only went all the way with him. He had been very accommodating towards me on our intimate moments, and i couldn't ask for a better partner.\n2. My view on marriage is more of [Jordan Peterson's](https://www.youtube.com/watch?v=J4_d7nENMFM) and his is \"why do i need to? it's the society programming. Maybe one day if i find someone worth all of it, but i don't think i'll ever.\" I have commitment issues, but his is far worse than mine. He told me when he was my age, he wanted to get married, settle down, but as time goes, that's no longer there.\n3. Different family background. My family is pretty distinguished albeit dysfunctional, and his seems like a pretty normal family. Although we have different cultural background (asians, iykyk) \n4. He's on the grind, and i'm pretty satisfied with being in the middle. Slow life, more quality time, minding only my business, and he's all about that fast life. I am alright with the grind since i'm also a hardworking person myself, but nightlife and all is getting dull for me.\n5. Due to the age gap, we do not have similar interests except gym (which is a huge part of our life currently).\n6. I am quite religious, he's not.\n\nThis is really all the differences i can think of. Other things outside all those is alright. I really like this guy in my heart, but a part of me is questioning really hard if all of this is worth it. Why invest these precious time when you've seen all these red signs? Should i just cut it off? Just see how it turns out? I don't think i'll be this attractive forever, y'know? Any advices are appreciated! Thank you!",
        "created_utc": 1678173729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Subtle sexual harrasment, advice?",
        "author": "Gimmesomealcohol",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11ks0ew/subtle_sexual_harrasment_advice/",
        "text": "I have no idea where to ask so I'll do it here because its really bothering me. As is very common (unfortunately so) i have also faced various incidences of subtle sexual harassment (co worker twice my age trying to shove his face in my boobs or cornering me, literally, etc). My question is for some reason, this doesn't bother me as much as should until days after (unless I am really threatened). This prevents me to react to the situation as I would like to and instead of shoving them or telling them off, I let it slide, more pressurized about upsetting the other person. It comes back to me days later when I am trying to do something important and need to concentrate and even then when i am thinking about other possible ways I could have reacted, its only because i don't want them to think i am okay with it lest they take it as an invitation more so than I am disgusted ny the situation. I think about the entire situation with a weird coldness as if it hasn't happened to me. What's interesting is I would be fired up and pissed if someone else had this happening to them or told me that it had happened to them. It bothers me that i am not bothered by it. \n\nDoes anyone know why I might be doing it? I don't think i have a fetish or that I actually want that kind of attention from a man. Its just my cynical response and non - feeling on the matter is weird.",
        "created_utc": 1678172055,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to tell someone what happened with my ex friend.",
        "author": "Feverish_Dreamer",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11krwye/i_need_to_tell_someone_what_happened_with_my_ex/",
        "text": "Hey ladies, I had a fallout with a friend and have no one to tell. I feel guilty. But also relieved. Since they're on. Reddit I'd like for someone to DM me and I will share. I hope it's okay, I need a point of view. Thanks.",
        "created_utc": 1678171748,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I stop obsessing over work? I'm not even good at work!",
        "author": "the_Stealthy_one",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11krt8q/how_can_i_stop_obsessing_over_work_im_not_even/",
        "text": "I obsessively check my emails and slack. I don't know why. I don't \"love\" my job. I think part of it may have to do with feeling like I'm doing something, and feeling like I'm moving fast. \n\nI have a tech job, and there are industry layoffs so that may also be affecting me in the back of mind. \n\nBut the more I think about work, the more burned out I am.  My company actually has pretty good work life balance, but I keep checking my messages maniacally. \n\nI am very details obsessed and I get deep into the weeds as well. I've gotten that feedback before when I communicate upwards that I'm too in the details.  I kinda think it's an offshoot of my obsessiveness. \n\nDoes anyone have any advice? \n\n(and I can't delete the apps of my phone; I actually do need them from time to time.)",
        "created_utc": 1678171406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Think My Dad Is Dying",
        "author": "mrbootsandbertie",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kr4ch/i_think_my_dad_is_dying/",
        "text": "I spoke to the nursing home today and they said my elderly Dad (91) has now lost his mobility and is getting more and more confused. I tried to talk to him today, the phone kept cutting out and when I finally got through he said he had nothing to say. He has never not wanted to talk to me before. So I told him I loved him and that I would talk to him soon. It's made harder by the fact I'm on the other side of the country, and my sister who lives in the same city he is acts like she hates my guts (has been that way for decades) and either cuts me out of decision making for his care completely or when she's forced to involve me is cold and disrespectful towards me. Because of this dynamic and other reasons I am not planning to fly across to see my Dad before he passes. I accepted years ago that would not be good for my mental health given the extreme dysfunction of my family situation which is too long of a story to go into here. The nursing home said they can set up a Zoom call with my Dad which I think would be a good solution. But it's just so, so sad. I feel so heartbroken. I won't be able to be there when my Dad dies. I will have to liaise with my nasty, vindictive sister over his end of life care plan and financial matters (she has lodged a guardianship application for him but has still not sent me the documents). I can talk to my Dad before he passes but he will be confused a lot of the time. My whole family is a mess and has been ever since my parents divorced when I was 4. I'm not looking for answers, I don't think there are any. I'm just sad.",
        "created_utc": 1678169210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman, what do you look for in a guy over 30? I’m new here so I’m sorry if it’s been asked multiple times.",
        "author": "Melodic_Future_6828",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kr077/woman_what_do_you_look_for_in_a_guy_over_30_im/",
        "text": "",
        "created_utc": 1678168868,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to heal from a friend break up?",
        "author": "styles_medicine94",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kpxuc/how_to_heal_from_a_friend_break_up/",
        "text": "[removed]",
        "created_utc": 1678165740,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to keep on top of house work when you're sick?",
        "author": "kagomechan86",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kpq84/how_to_keep_on_top_of_house_work_when_youre_sick/",
        "text": "I've been ill for more than a week now and the house is a disaster. My partner hates doing the dishes and I usually do them. I've asked him to do it but there are  dishes piling up in the sink since last night. How do I manage my expectations and not let get house chores stress me up",
        "created_utc": 1678165166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slack &amp; connecting",
        "author": "CaChica",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11kpmjp/slack_connecting/",
        "text": "Many at my work are on Slack. It’s not required. And I’m infrequently on it. It seems so inefficient to have another medium for communication to constantly check in addition to text, email, and voicemail. \n\nTell me all your thoughts on this…\nWill I be missing valuable connections if I don’t use it more? Do I just seem old if I don’t use it?",
        "created_utc": 1678164882,
        "upvote_ratio": 1.0
    }
]