[
    {
        "title": "What job recreates the 100% laser-focused, self-motivated feeling of academic study and work?",
        "author": "judgemycomposure",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107l9vp/what_job_recreates_the_100_laserfocused/",
        "text": "I thought software engineering was for me because I like talking to people in a social context, but I don't really like talking to people in a professional context, I dislike presenting, I don't like discussing findings in meetings and all that. Water-cool talk though I'm 100% down for it. I also love the idea of being hyper-focused on solving technical problems all day long in front of a computer.\n\nHowever, this is not what happens in reality. We have status meetings daily, and although we're supposed to be left alone to work there's always someone coming up to talk about something or mansplain something or hold forth. I'm tired of how much professional socialising is forced on me in the job, and how little focused work I can realistically do. As a result I rarely feel accomplished even when I accomplish something, because it was a a direct, focused, A to B effort.\n\nWhat are examples of a job where, genuinely, you can recreate that feeling of getting up in the morning knowing you have a full day of work ahead of you, that you are left to do in peace, and can make headway on. No daily meetings, no constant pings in the group Slack.\n\nI think translation work or copywriting is something along this lines, for example.",
        "created_utc": 1673287678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having kids after 40",
        "author": "pimms_pup1993",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107l8eo/having_kids_after_40/",
        "text": "I never thought I wanted kids, but now that my fiancé and I are stable, have finally landed our dream jobs and have a secure, happy home life, we’re actually thinking about dropping the birth control and letting nature take its course. But also, we have a fantastic childless life that involves a lot of travel and the freedom to pretty much do whatever we want on a dime. \n\nI’d love to hear from those of you who have come to/ may be approaching this crossroad and how your thoughts and decisions are working out for you in this department. It’s certainly not a decision we’ll be making lightly, but it has been coming up in conversation quite a bit recently, so it’s definitely worth exploring.",
        "created_utc": 1673287585,
        "upvote_ratio": 1.0
    },
    {
        "title": "How petty is this??",
        "author": "womenlikeaboss91",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107l0n7/how_petty_is_this/",
        "text": "[removed]",
        "created_utc": 1673287099,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your core values by which you live your life?",
        "author": "LookingForEquanimity",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107k9y1/what_are_your_core_values_by_which_you_live_your/",
        "text": "",
        "created_utc": 1673285389,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best/worst compliment you ever received?",
        "author": "Forsaken_Bench_87",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107i8m7/what_is_the_bestworst_compliment_you_ever_received/",
        "text": "",
        "created_utc": 1673280680,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the hardest part and the best part about living alone?",
        "author": "peace_love_bananas",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107huao/what_is_the_hardest_part_and_the_best_part_about/",
        "text": "Will be living along for the first time in my life after a really traumatic breakup. I’m scared for my future.",
        "created_utc": 1673279750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who have kids; how important was it for you to have your parents living close by when you first had babies?",
        "author": "lousey4",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107hbdf/women_who_have_kids_how_important_was_it_for_you/",
        "text": "My partner and I are finally starting to have the talk about having kids. It’s messy and ugly sometimes but we are each giving each other things to think about before we go for this. One thing we’re trying to figure out is housing and if we want to try to stay in our state (knowing with my job in the next year I will have the opportunity to look for something higher paying in another state- great because I’m a social worker and we’re still working on reciprocity 😊) \nBut we’ve always wanted to live in VA beach. My family lives in Maryland and so do his. I know it’s comforting to think about my mom being there but I would LoVe other opinions. Did you end up wanting more space from parents? Or did you need need need their help? Any advice or”in hindsight I would of done it this way” type answers are soooo welcome here! Thanks.",
        "created_utc": 1673278449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend Breakup Advice :(",
        "author": "SlippyGoose234",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107gyy9/friend_breakup_advice/",
        "text": "[removed]",
        "created_utc": 1673277608,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you handle a partner with bad social anxiety? I’m increasingly feeling the burden of having to handle ‘situations’",
        "author": "LostinParadise4748",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107gb5z/how_do_you_handle_a_partner_with_bad_social/",
        "text": "I (35F) want to start off saying I love my boyfriend (42M). This man is funny, quirky, smart and I only wish others could see how lovely his personality is! \n\nI don’t mind doing the majority of ‘speaking up’ for us but sometimes I do feel ashamed to say I feel like I’m out with a toddler who has very low communication and verbal ability. \n\nThis weekend was another example. \n\nWe went out for my birthday dinner. \n\nThe waiter came over to tell us the nights specials. However the atmosphere was loud and it was very difficult to hear him. \n\nThe whole time my boyfriend is nodding like he understands. I caught most of the specials with the exception of some detail.\n\nThe waited walked away to give us time to mull it over and I asked him if he heard the specials bc one in particular sounded great.\n\nHe said no I have no idea what he said as he couldn’t hear (internally I’m thinking why didn’t you ask him to speak up?)\n\nThe waiter comes back and I’m the one to ask him to repeat the specials again. \n\nThe waiter asks us if we’re celebrating anything special and boyfriend points at me and blurts out ‘birthday’ like a caveman. I smile and laugh and say yes it’s my birthday today!\n\nThe waiter asks us if we’d like sparkling or tap water…boyfriend just stares at me waiting to answer what he already knows…that we both always prefer sparkling. \n\nOrdering went ok but then the busboy coming to take our bread plates asks if he can remove our mostly eaten appetizer too and points to it. Boyfriend leans in to give the impression he didn’t understand the question and the busboy picking up the bread plates repeats himself ‘still working on the calamari too?’ \n\nBoyfriend gets a panicked look on his face and stammers…y-yeah.\n\nBusboy leaves the calamari but I know boyfriend meant ‘yeah you can take it too’.\n\nThe waiter comes by to check on dinner and asks him if foods ok. Boyfriend stares at me while we both are chewing so the waiter looks over at me instead as I cover my mouth and nod yes. At this point waiter has defaulted to just asking me any follow up questions and I’m slightly concerned and embarrassed my boyfriend is coming across a bit rude or superior to wait staff.\n\nThen the bill comes. There’s a problem where we were charged twice on on an upgrade only one of us had. Boyfriend says ah it doesn’t matter I’ll just pay.\n\nI said no that’s not right. We need to tell him when he comes over.\n\nWaiter comes back to take the check and boyfriend just stares at me. I sigh, grab the checkbook from boyfriend and say listen this was a duplicate charge only I had the upgrade not both of us. Waiter apologizes and says he’ll come back with a revised bill.\n\nWe pay and leave.\n\nAnd while I was so grateful for dinner, I just can’t help feeling like I’m always going to have to be the one to speak up even on the simplest of things. And wonder what will happen if we have children. \n\nAnd I also can’t help feeling scared that everyone will sympathize with his social anxiety and say I’m a bad person for not understanding. \n\nI love him, I just wish *sometimes* he could take the lead and handle certain things particularly when it’s a day or event for me.",
        "created_utc": 1673276007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raising kids without family help",
        "author": "Renchenzo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107g9uz/raising_kids_without_family_help/",
        "text": "Hi everyone. Please help settle a debate between my partner and I. \n\nI (31) am starting to talk more seriously with my partner of four years (M37) about having our first child. We currently live in his home province in Canada, in the city where his sister and parents live. I would like to relocate back to *my* home province to start a family. The catch is if we were to move, my parents would be about 1-2 hours driving distance away, and not able to be at our house at the drop of a hat...which is a perk we would enjoy with his parents if we stayed put. Personally, I think we would survive just fine having my family just a short drive away, with many of our friends (who are now becoming parents) nearby to provide support.  \nQuestion...for those of you with small children and do not have grandparents/family support super close, how hard is it? And do you regret not having your children closer to family for help?",
        "created_utc": 1673275913,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I become a walking green flag to build new connections?",
        "author": "Careless_Ad_7788",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107fze1/how_can_i_become_a_walking_green_flag_to_build/",
        "text": "Not just romantic relationships. All relationships. Professional, friendly, and romantic. \n\nI (31F) have cut my family off due to an extremely difficult upbringing. My life is a little empty but it’s definitely better than having them in my life. \n\nI want to make new and healthy connections and be the person who others want to be around.",
        "created_utc": 1673275165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honest question",
        "author": "Broad_Reward3738",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107fvav/honest_question/",
        "text": "[removed]",
        "created_utc": 1673274862,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to forgive / let go of grudges",
        "author": "rhinogirl222",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107fv5q/how_to_forgive_let_go_of_grudges/",
        "text": "I have this amazing talent (lol) of holding on to things and ruminating\n\nI suck at self-forgiveness which makes it hard for me to forgive others\n\nLong story short, my friend gave me Covid and she has apologized incessantly since and I am still upset. I am still battling a daily headache and loss of taste\n\nI am mad at her for not realizing she had it in the first place, but I am also beyond angry at myself for letting my guard down during cold, flu, rsv, Covid season  \n\nI am losing sleep over this. \n\nI recently read how Covid actually damages your immune system and they don’t know how long (maybe even permanently)\n\nSo I have anger to the fact that a temporary mistake has had permanent consequences\n\nI flip flop between hating her, hating myself, hating the world\n\nI know this is extremely unhealthy but I don’t know how to move on\n\nHow do you stop ruminating? How do you forgive? How are you living in this Covid (or post Covid as some people say) world right now :( ?",
        "created_utc": 1673274852,
        "upvote_ratio": 1.0
    },
    {
        "title": "25yr old F here. i just need to talk to another woman. i don’t have anyone i can have this conversation with. Please.",
        "author": "mayosdaughter",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107fqhb/25yr_old_f_here_i_just_need_to_talk_to_another/",
        "text": "",
        "created_utc": 1673274516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ladies, what’s y’all’s opinion",
        "author": "PowerFvck",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107fkqj/ladies_whats_yalls_opinion/",
        "text": "[removed]",
        "created_utc": 1673274083,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to live a meaningful life?",
        "author": "zakuropan",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107fkou/how_to_live_a_meaningful_life/",
        "text": "I grew up with a ton of abuse and neglect, and have only recently found financial stability and begun healing from trauma. However now that I’m out of survival mode for the first time in my life, I feel so lost. I never developed the skills to build intimate relationships or live for myself, and now I feel like I’m just going through things on autopilot - outwardly my life contains all the markers for ‘success’, but inside I feel so hollow I often think about just ending it all. How do you personally find meaning in your life?",
        "created_utc": 1673274080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who prefer/only go for \"bad guys\" when dating...why?",
        "author": "RavenLoonatick",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107eofl/women_who_preferonly_go_for_bad_guys_when/",
        "text": "",
        "created_utc": 1673271673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone ladies here in Texas, it is legal for normal citizens to own handcuffs?",
        "author": "sahw2015",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107bec4/anyone_ladies_here_in_texas_it_is_legal_for/",
        "text": "Writing this at 3:30AM waiting for my husband to come home from work and he will go with me to my PCP doctor as my doctor told me to come Monday morning so she can prescribe me mood stabilizer for the time being and refer me to a psychiatrist for evaluation and treatments.\n\nI have not sleep all night, the whole night I reflect on myself on how violent I can be to the point of when my Anger Explosive episold flare up, I'm even scare of myself of my violence. I beat my  husband to bleeding, and he endure this in our 11 years long marriage.\n\nI still get chills think back how I make my husband lay there on the floor and I repeatedly use all my strength to kick on his back, legs, to the point his whole leg from his thigh down to ankle were bleeding that blood pool was underneath the skin, his whole leg were fill with blue and purple blood underneath the skin.\n\nWhen the episold flare up, not only I punch him and slap him, but I also grab his hair and yank his head, smack his head down to the dinner table. Many times I hit him to the point I bruised his face even has my whole hand fingers print on his face, many times when I punch him that there BLOOD in his mouth. Thanks Buddhist his jobs required wear mask the whole time so nobody see his face like that. He work with Corrosive Hydroflouric Acid in Chemical plant.\n\nMy episold last shoter than 30 min but that enough time to literally hurt my husband, afterwards I regret it and think of the consequences I could face for this, I asked him why don't he called the cops and get me arrested for domestic violence, why endured these abuse 11 years long? He said: *because he loves me, and he doesn't want me get arrested, in jail, or in psych ward, he rather endure this than have to lose me.*\n\nAnd I'm a Stay at Home Wife 11 years sice marriage too, he always has been the 100% breadwinner, I have ZERO income so I depend on him 100% financially. And a woman with ZERO income like me I don't know how to be grateful for my husband. I would be homeless if he kick me out, or I would have already end up in jail if he call the police. But he never did in this 11 years long.\n\n**I don't want to physically beat him like this anymore, I think of in the morning go buy handcuffs, so when my anger episold flare up I will handcuffs myself until that 30 min of my episold passed. While I get psychiatrist help and treatments. But I don't know if a normal citizen like in Texas it legal to own a handcuffs? I read medications and therapy might help, but there no cure for my illness, so I need a way to restraint myself, and that handcuff.**\n\nDoes any ladies here know? Thank you in advance.",
        "created_utc": 1673261119,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to know the right time? How to do it right?",
        "author": "askawayor",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1079auk/how_to_know_the_right_time_how_to_do_it_right/",
        "text": "I've (32f) moved out in September and the divorce will be finalised this month. Have a daughter (4) from the marriage. We share custody 50/50.\n\nI would like to start dating (online) and see what's out there. I'm very aware of what I'm looking for and am not concerned in having very few (if any) matches. I can wait for what I'm looking.\n\nWhat you ladies suggest/recommend me to do?",
        "created_utc": 1673253637,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m just sad and need to vent… writing to clear my head.",
        "author": "DartFaceKiller",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1078nfi/im_just_sad_and_need_to_vent_writing_to_clear_my/",
        "text": "Long story ahead, thanks for reading it you get to the end &amp; hopefully it makes sense. I’m feeling a lot of feels at the moment. I’m 31 and he’s 32 \n\nAbout 4 years ago I met this guy. We were in a bit of a “situationship” for about 5 months then it ended because I told him I wanted more &amp; he “wasn’t ready” so I left, and gave myself space from him because I couldn’t be with him on a casual basis. I had feelings, and I wanted it to be something more so I thought it best we just didn’t see each other anymore &amp; I tried to move on. \n\n\nVery long story short - we re-connected a couple of months later and he said he had feelings for me and he wanted to move away from the city we lived in, to a smaller town. He asked if I wanted to come and start a life with him, without hesitating I said yes and we moved away within the next 4 months. \nI thought our story was really romantic, also important to note that by the time he asked me if I wanted to move with him, I was already in another relationship with a guy that he also happened to know. \n\nHe had seen me with my new man at the time a few times and he thought I was “settling for less” it made him sad to see me settling and he said wanted to have a life with me… \nhe didn’t want to see me sad or settling, he wanted to be with me, build a life, be happy together, he had feelings for me and all that jazz etc… \nHonestly, I agreed and I was not really into the new guy nor did I really think we were a good match. I was settling so I made the decision to break that off and move my life for the chance at real love. I kinda just thought “what have I got to lose”. You know? \nI was really into him on so many levels, mentally, physically, emotionally (and I still am). \n\nFast forward to now - 3.5 years later. \n\nHe keeps on talking about random people we know who are getting married and how exciting it is for them, so I asked him if he ever wanted to get married (this has been discussed before but now that it’s been 3.5 years my tone was a bit more serious about it because it’s something that I really want). \nHe danced around the question and basically shrugged it off. \nI obviously got upset and said I wanted to be with someone who was enthusiastic about marrying me…and a conversation later he says he has been planning on doing it, he just wanted it to be a surprise and not feel like “you’d be expecting it, but yes of course I want to marry you, you’re the person I want to be with yada yada”. \n\nHe asked me my ring size so I found out for him and told him, then I said this was the last time I bring it up. The rest is up to you. \n\nAnyway, fast forward to a couple of nights ago, we had a couple of drinks and were quite boozed. \nHe tells me he doesn’t think we are soul mates, he only asked me to move to this stupid town with him because he “wanted a companion” and went off on a huge rant about how there is all this pressure on him now, because I’ll be expecting an engagement and proposing doesn’t feel organic anymore. \nHe even had a rant about me finding out my ring size and telling him &amp; now he doesn’t want to do it because “I’m expecting it and ruined the whole thing for him”.\n\nBro… you asked me my ring size, of course I’m going to tell you what it is. I was excited when he asked me what my ring size was, so I wanted to help him out by finding out. I expressed this to him at the time. \n\n\nIt just makes me really sad and I don’t want him to feel like it’s a chore having to propose to me. \nI want getting engaged to be a happy time and not feel this heaviness around it. I’m not expecting it to happen immediately, I just wanted to know we are on the same page about getting married 3.5 years in. I think that’s fair?! (As mentioned this is not the first time it has been discussed, it’s just a bit more real this time because we’ve been together longer). \n\nAt the time of his rant I was crying and he didn’t even realise until he had finished his\nWord vomit, then I think he realised how harsh he was being when I was visibly upset. \n\nI felt special, now I don’t. \nIf you wanted a companion and that was all, maybe you should have got a pet instead of asking me to move my life?!. \n\nAnyway, this happened 3 days ago and I’m just gutted. I just wanted to vent. \nI don’t even know why I’m writing, I just feel alone and sad. \n\n\nWe haven’t had any problems or any huge issues before this. We have a very open communication style (I thought) and I was under the impression that everything was going well. Now I just don’t know what to think. \n\nAnyway, thanks for reading.",
        "created_utc": 1673251346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice needed - Dating in 30s",
        "author": "artist330",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1077f7h/advice_needed_dating_in_30s/",
        "text": "[removed]",
        "created_utc": 1673247202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Advice",
        "author": "SoftCry6300",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10772ex/need_advice/",
        "text": "There’s a guy I think might be interested but he is not consistent. He asked me to attend a friends event I went and when we got home he texted that it was nice to hangout. Then I saw him recently again and he walked me to my car but I needed help with something and he just offered info but didn’t volunteer to help. His friend who was with us later texted me when I got home to see if I figured out the issue, but this guy he hasn’t contacted me. Do u think he is interested or not?",
        "created_utc": 1673246023,
        "upvote_ratio": 1.0
    },
    {
        "title": "To respond or not to respond, that is the question",
        "author": "FlameHawkfish88",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1076tql/to_respond_or_not_to_respond_that_is_the_question/",
        "text": "I just contacted on the group chat from a former friend who has been a consistent arsehole wanting hang out. But she was so passive aggressive about it. We weren't talking to her for some shitty behaviour and she was like \"when are we all hanging out next unless you're all still freaking out about me\". Absolutely zero self reflection done in the past 12 months obviously.\n\n I'm fuming. \n\nOther people have been like sure let's hang out. But this was just the most recent in a long line of shit she has done to me ever since we finished school.\n\nPart of me says just ignore her, she's not worth your time. If they want to hang out with her that's their business. \n\nPart of me says to call her out and tell her that is no chance that I want to hang out with her because the way she behaved last time I saw her was rude, nasty and inconsiderate. \n\nAnd the worst part of me tells me to make a super sarcastic remark weaponisimg the shitty names she called me last year when I didn't do what she wanted. I probably won't do this one. But I wish I  could. \n\nWhat would you do?",
        "created_utc": 1673245247,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the things you're doing now that you never thought you'd do?",
        "author": "finelytunedradar",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/107628a/what_are_the_things_youre_doing_now_that_you/",
        "text": "On the back of the 'if I haven't done it now, I'm never going to do it' thread (no shade to [u/MinaFarina](https://www.reddit.com/user/MinaFarina/), I honestly loved your question), but I would also like to flip the script.\n\nWhat are the things you're doing now/want to do, that you had previously written off as not possible, or hadn't even considered?\n\nHere's a few of mine:\n\n* acting/improv - which has led me to places I never thought I'd go, including the potential to work with some well-known names\n* living alone (more importantly, being comfortable alone)\n* having true, deep friendships\n* finding my own voice &amp; standing up for myself",
        "created_utc": 1673242879,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you wish your current partner did more of?",
        "author": "HiddenCloud7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1075620/what_do_you_wish_your_current_partner_did_more_of/",
        "text": "&amp; do you wish you were single ?",
        "created_utc": 1673240199,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [34m] girlfriend [34f] feels unfulfilled by the lack of \"desire\" and \"longing,\" but she insists we can overcome that",
        "author": "Awaythrow2123123",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1074xbh/my_34m_girlfriend_34f_feels_unfulfilled_by_the/",
        "text": "[removed]",
        "created_utc": 1673239481,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do if someone you were dating rolled their eyes at something you said?",
        "author": "idplma8888",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1074m0z/what_would_you_do_if_someone_you_were_dating/",
        "text": "Or what have you done/what has it said about the person if anything?",
        "created_utc": 1673238589,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite phone game?",
        "author": "smallescapist",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1074627/what_is_your_favorite_phone_game/",
        "text": "Kind of a silly question, but as a fellow woman over 30, I’ve found that a lot of iPhone games over the years helped relieve stress for me and have kept me off of scrolling social media. So what are you currently playing that you love?",
        "created_utc": 1673237292,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you climb up the career ladder as a woman?",
        "author": "Fxx31z",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1073o4c/how_did_you_climb_up_the_career_ladder_as_a_woman/",
        "text": "Recently graduated, I get greater responses from companies who wrongly assume I'm a man instead of a woman. I want to work towards a job I can be happy in but it's a male dominated field and it looks like I need experience in the field to be hired for a job that doesn't require work experience in the vacancy. So to the women who did make it, a career on a position usually only men reach: how did you do it? What are the things you did that brought you in that position?",
        "created_utc": 1673235865,
        "upvote_ratio": 1.0
    },
    {
        "title": "been questioning my size.",
        "author": "Remarkable-Fold1498",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1073lhx/been_questioning_my_size/",
        "text": "[removed]",
        "created_utc": 1673235654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it bother you when you see people in relationships bombing their social media of how happy in love they are while you sit and wonder how they found each other cause you can’t seem to meet anyone worth being in a relationship with?",
        "author": "Valuable_Relation_70",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1073b9g/does_it_bother_you_when_you_see_people_in/",
        "text": "",
        "created_utc": 1673234823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Showers, Baby and Wedding?",
        "author": "Mb240d74",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1073753/showers_baby_and_wedding/",
        "text": "Years ago, I told my wife that I didn't want her to attend showers on account of me. I wouldn't spend an afternoon with my bitchy aunts and other randos, she shouldn't either. Unfortunately, we were married young and did a wedding shower at the behest of our mothers. Years later, we skipped the baby shower. Anyway, our families act like this is some sort of blasphemi. I hear about it. People make comments. We always send a gift.\n\nDo you like showers? Do the majority of women like showers? Why do you keep doing it?  Lastly, why are they joint now. I don't want to do this crap.",
        "created_utc": 1673234492,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mother is showing signs of dementia but is in denial",
        "author": "frostandtheboughs",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1072tn6/my_mother_is_showing_signs_of_dementia_but_is_in/",
        "text": "How do I handle this delicately? I recommended that she see a neurologist but she claims that she is just stressed with work and my grandmother. \n\nThis is not the case - I've seen her go through stressful times before. This is beyond normal stress-induced forgetfulness like misplacing keys. She is full on forgetting things we have talked about multiple times. I'm frankly a little frightened. She also admitted that she recently lost a ton of money in the stock market after a \"financial advisor\" reached out to her and convinced her to put all her retirement funds into one stock. I am an only child so I will be the only one taking care of my parents. My Dad is 10 years older than mom and not the most mentally fit either. \n\nI've spent the last two years trying to convince my parents to at least get a will in order and they've done nothing. Now I'm afraid they never will since I was relying on my mom to get that ball rolling, and her mental faculties are already failing. \n\nHas anyone dealt with a similar situation?",
        "created_utc": 1673233439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever not even felt upset the end of the road came faster than expected?",
        "author": "throwergaze",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1072n18/have_you_ever_not_even_felt_upset_the_end_of_the/",
        "text": "\nHi everyone, I’m at the end of my rope. I (31f)love my DH (34m) to death but he’s so messy. Yes he has adhd but I honestly don’t think this is an excuse anymore. \n\nI’ve been staying with my mother for sometime now and I lm horrified to go home because he says “it’s hard to keep up” I just want to go home bc o want my life back, but when I go home that’s not the life I want for me and my daughter (19mo) \n\nThen he’s always venturing into new business ideas. While that’s cool too I think he shouldn’t be so impulsive and at least focus on building on our foundation to be strong first before anything else. I’m tired of his mind and effort in everything else other than us and what’s important to me bc me, on the other side I support him to the end of the world but I’m over being his maid. That’s what it feels like \n\nHe said we should just hire house cleaners but that doesn’t replace the fact that this is how you actually live? \n\nThis is hard because I genuinely love him and he’s kind and a great person but we’re not compatible here. I’m considering just moving to my own place but wouldn’t that just defeat the purpose of being together?\n\nI honestly don’t know what to do anymore. I just want my life back. I’m tired of being here like a dang teenager, but I also am horrified to go “home”",
        "created_utc": 1673232961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bf pushed me to move out of the way",
        "author": "ExoticSpirit",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1072gft/bf_pushed_me_to_move_out_of_the_way/",
        "text": "Boyfriend and I were staying at a hotel yesterday evening. As I was exiting the elevator on the lobby floor, his dog cut me off and I couldn’t fully move out of the way of the elevator. Another person was waiting to enter the elevator at the lobby.\n\nAt the lobby, my bf pushed me out of the way. He physically pushed me forward to let the person entering the elevator in. I felt so angry and degraded. Am I justified here? I apologize if this is the wrong thread to post this on. I’m on here often and really admire the wisdom of you all. Would love advice and thoughts on this.",
        "created_utc": 1673232459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career advice for a newly single mother?",
        "author": "Lily_in_sunlight",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1071dm0/career_advice_for_a_newly_single_mother/",
        "text": "[removed]",
        "created_utc": 1673229523,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you wish your ex bf or ex husband did better",
        "author": "HiddenCloud7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10711dl/what_do_you_wish_your_ex_bf_or_ex_husband_did/",
        "text": "Or more of ?",
        "created_utc": 1673228595,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really need some advice ladies",
        "author": "HiddenCloud7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10710wp/i_really_need_some_advice_ladies/",
        "text": "Hello, I’m a 24 year old man who never felt understood by my generation of women, I prefer older women but among speaking to women older than me I have no further experience, now I’ve met someone who is 12 years older yes 36 and I couldn’t be happier, we’re on the same page with a lot and she’s never really had much experience with younger men she’s had a weird experience with a younger show off type of guy but I’m nothing like what she described.\n\n\nWhat can I do to not mess this up? \n\nShe’s a minimalist, divorced a few years back (abusive ex husband) she’s a genuine and proper lady. \n\nI’m an introvert who works two jobs currently but considering moving closer to her if things go well visiting for a week I’m in the market for a house and off to work hopefully remotely in IT, no credit card debt and goals. She’s a business owner and I’d say financially balanced.",
        "created_utc": 1673228557,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some ways to actually enjoy being single?",
        "author": "localminima773",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1070ydv/what_are_some_ways_to_actually_enjoy_being_single/",
        "text": "Everyone tells me to \"just enjoy\" being single but I, for the most part, am either just enjoying things I'd still be able to enjoy while in a relationship (like my friends and hobbies) or doing things alone, and being comfortable alone but not necessarily \\*enjoying\\* it. \n\nI feel like the first thing is getting to sleep with whoever I want. Believe me I've tried it and it's not for me. Casual sex doesn't feel safe or satisfying. So that's out. The second is living in your own place, being able to style it however you want and determine your own schedule. I do enjoy having my own little cozy place and I like experimenting in the kitchen and spending tons of time in the gym, having people over whenever I feel like it, taking an edible and watching a movie whenever I feel like it, going to random events/meetups without having to check with anyone else, etc. \n\nThe last thing is being able to travel where/whenever I want. There's a limit to how much I can do that, financially and while having a dog. So is there anything else I'm missing? I really do want to \"enjoy being single\" but... I can't really think of anything else I could actually be doing. Help!",
        "created_utc": 1673228373,
        "upvote_ratio": 1.0
    },
    {
        "title": "33M32F Someone please tell my wife that asking me to hide my bulge is similar to me asking her to put on pants other than leggings on. I’m wearing normal clothes, shorts, pants, street wear, gym wear. Am I wrong??",
        "author": "Googlemeister10",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10705x3/33m32f_someone_please_tell_my_wife_that_asking_me/",
        "text": "Please don’t take this out of context. It’s not a solicitation. I truly feel this to be true. Leggings can be see through and often have the sides cut and braided where you can see skin. Let’s be fair. I’m 100% fully dressed when she’s complaining",
        "created_utc": 1673226259,
        "upvote_ratio": 1.0
    },
    {
        "title": "A married friend I chat with on insta, light flirting, she knows my wife well but she just said, when are you and your lovely wife (instead of her name) gonna come visit us for some sun and fun. Why?",
        "author": "uescrazyscientist",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10705pa/a_married_friend_i_chat_with_on_insta_light/",
        "text": "",
        "created_utc": 1673226241,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this person's ethnicity?",
        "author": "anlubi333",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106zsxl/what_is_this_persons_ethnicity/",
        "text": "(Pic in comments) I know this may seem random or unrelated but, This is part of a larger study I am conducting regarding race/ethnicity and perception. I have full permission of the person pictured. Please note your first guess and, if you're comfortable enough, add your general location for context (state, country, etc.). Thanks in advance!",
        "created_utc": 1673225321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey, Im looking for podcasts (preferently available on Spotify) about finances and women, I want something informative, inspiring and empowering. Something about women+abundance/power/personal or professional growth will work too. Any suggestions?",
        "author": "RockysTurtle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106zck1/hey_im_looking_for_podcasts_preferently_available/",
        "text": "Extra info: I'm a 32yo artist and designer looking to make more money, have more sources of income, and in general to have more resources and options in my life....",
        "created_utc": 1673224127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling frustrated with a friend group",
        "author": "PiperGraceB",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ygtb/feeling_frustrated_with_a_friend_group/",
        "text": "I became friends with a group of women in grad school, through one friend in particular who I'm still very close with. With the rest of the group, while I never felt like our personalities or interests were completely compatible, I felt they were genuine and kind. In the years that followed, though, I feel like our conversations have turned increasingly toward humble-bragging (or just bragging) - about houses, money, husbands/boyfriends, vacations. It feels like I'm having a conversation with a Christmas letter or an IG profile. I find myself not wanting to say much of anything.\n\nAt first, I thought that I felt increasingly like the odd woman out because I'm not married/dating, but I think it's more that I don't feel like anyone vocalizes anything other than \"yay me\" positivity and it doesn't feel real anymore. While it's possible that they're just the luckiest people in the world, in one-on-one conversations I get snippets of the real people behind this posturing - people who are struggling with something, people who will sometimes talk shit about their friends behind their backs.\n\nHas anyone had a friend group evolve in this direction? It's quite sad.",
        "created_utc": 1673221868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hype me up, ladies [UPDATE with one regret!]",
        "author": "Embarrassed-Hat1371",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106y3l1/hype_me_up_ladies_update_with_one_regret/",
        "text": "Giving an update because so many of you asked me to report back and also, for the people in my shoes who have been wanting to go on solo dates but are still second guessing themselves. \n\nFirst of all, A++ job at hyping me up!! As the cool kids say it, you understood the assignment. I felt like if I didn't go, I'd be upsetting about a hundred people so I went! \n\nI went to a bar across the street from where I live. It was pretty packed but I found a spot near-ish to the bar. The first few minutes there were kind of awkward because a random 60-something man kept talking to me and interrupting me watching the game but eventually some people cleared out and I sat closer to the screens. And it was so fun!! I get really into games and I did all the yelling and pointing I would do by myself and it was just... fun. Fun to be around the same energy, fun to boo when others in the room were cheering at the same time. At some point, a random guy came and asked me for my number, I politely said no thank you, and went back to the game. I stayed until the end of the game, I had two drinks, made sure to tip the bartender well and then left to meet up with my very first Bumble BFF date (which was also fun) \n\nHere's my biggest regret though: I really really wish I hadn't waited this long. NFL season started 18 weeks ago. When I left, I kept thinking \"Wow, if I had done this every week for the last 18 weeks, imagine how much more comfortable I would be and how many friends or cool acquaintances I could have had by now. Imagine how fewer Saturdays I would've spent crying because I feel alone. \" My team is out of the season now so I'm a little mad that I didn't do this sooner. \n\nSo, if you're having even the slightest doubt about doing it, please do it! Everyone is right, it's not as bad as you're making it in your head and you need to just do it. I wish I had! \n\n\\#GoPats",
        "created_utc": 1673220946,
        "upvote_ratio": 1.0
    },
    {
        "title": "The negative single woman stereotype",
        "author": "IngridBashful",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106xf90/the_negative_single_woman_stereotype/",
        "text": "Hello ladies! \n\nRecently read a post on r/marriage where a woman was talking about how her married (specifically female) friends felt uncomfortable around single (specifically female) friends. The girls didn't know how to process and came to Reddit to confirm this bias, and many comments could concur they experienced this dynamic play out or they knew that friendships with married people dwindled either way if they were the only singleton in their friend group. \n\nAt work recently, my coworkers who were all talking about their serious, committed relationships started talking about dating. One coworker said, \"Thank God I'm not dating anymore, I hated it so much.\" To which I started to feel awkward because, well I'm still single -- so I chirped up feeling I shouldn't feel ashamed about participating, \"Yeah, omg I hate the apps. But realistically where else am I supposed to meet someone unless any of you ladies know of a handsome single male.\" My one coworker chuckled and said she didn't know anyone whose available, and then I commented, \"Yeah that's what most people say when I ask them to set me up with someone or I'd be open to a blind date, \" and my other coworker commented, \"What we mean is we don't know anyone whose good is single, because usually there's a reason they're single,\" to which she quickly stammered and added, \"Not you, of course, but usually.\" And then I promptly shut up because my singleness and attempt at joining the conversation had been made awkward. \n\nBut you see, there is a negative side that comes with being single. There's so many great comments here about how you just need to invest in hobbies, and your identity isn't in dating but so many people who do date *do* wrap their identities in it because they don't know another way of living and because there's a huge social status that comes with being coupled. Has anyone else experienced something similar to this? I've only really been made acutely aware of how important dating is around 25/26 because at work people always talk about significant others and that it's their main version of a \"personal life,\" so to speak outside of work. I used to not care about dating but the older I get the more of a weight it's been on me, because I want to be able to connect with others about the same milestones and life events. \n\nEdit: There's definitely more to life than dating, and you should definitely be ok being alone, but there's certain social privileges afforded to coupled people. (That they might not even be aware of).",
        "created_utc": 1673219336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you worked with a career coach before? What was your experience like?",
        "author": "idkwtfklmao",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106wyh3/have_you_worked_with_a_career_coach_before_what/",
        "text": "Would you recommend it? Did it help you figure out a more ideal career path for yourself?\n\nI (31F) would love to hear about your experience with career coaches - the good, the bad, and the ugly. If you have any tips for finding a good career coach, I’m all ears! I’m feeling ready for a revised career path after a life-threatening medical experience 6+ months ago, but am also a little lost.",
        "created_utc": 1673218221,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t love my ageing father but my family and culture makes me feel bad for not being a dutiful daughter towards him in his old age. How do I get past this?",
        "author": "Careless_Ad_7788",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106wycg/i_dont_love_my_ageing_father_but_my_family_and/",
        "text": "My (31F) father (63M) provided for us while we were growing up. He sent my brother and I to top notch universities which costed him about 500k USD. And our schooling and provisions. He went through some hard times but came through for us financially. He sometimes cooked for us.\n\nAnd thats the best I can say about him. His parental engagement was minimal. My parents are divorced and our mum outsourced most child rearing to maids. And she was very abusive but that’s a whole other story. He was an extremely angry man and there was zero nurturing from him. If I didnt understand something he was teaching me in my homework, he would get angry. As I was a sickly kid, he was often irate, and would take away prescribed meds because according to him I was self medicating and needed to ’get on with it’, and would shout at me if I dropped something or didnt hear someone behind me saying ’excuse me’. When I was in university, he would visit me and often rummage into my cupboards or toiletries and yell at me to throw them out as I was spending his money. After university I found my own way and have been financially independent since the age of 23. This man has never taught me a single skill in my life, not about saving investing taxes or DIY.\n\n2 years ago he was diagnosed with early stage Parkinsons. He has tremors and takes medication to control it. He looks a little diminished but is fit and fine otherwise and can even do moderately intense exercise.\n\nA year ago I invited him to my PhD examination. He attended, cried LOUDLY (howling) when my professors handed me my award and then tried to give a speech (I got the PhD so I should make the speech). Not even a day after that he started to treat me like a butler. His hourly requests were - get me water (he was sitting in the kitchen), make me Tea (I was in the other room and he was in the kitchen), arrange my pillows (because he did not want to look away from his laptop. He was seated on the couch and demanded I arrange the pillows he was already resting on). I cooked him dinner and he told me to serve him on his plate because it would require him to look away from his pc. The distance between the serving dish and the plate was 12 inches. He doesn’t even say please or thank you when asking for these things. \n\nI was very stressed at that time as I was moving to a new country and had to pack up my entire apartment in less than a week. Of course he did not help.\n\nAfter his dozenth request that day, I told him that he needed to be more autonomous as I had to pack. He got angry with me and said he wanted to take advantage of me being around as he hasn’t seen me in so long and it was a privilege. My brother(33M) who was there took his side and said I was being casually cruel.\n\nWhile my father has mellowed with age and does not yell at me anymore he is the same person and is just finding other ways to mistreat me. I believe that his entitlement is inexcusable.\n\nMy brother is not happy with me and insists that I am in the wrong. He wants to look after my father but also wants me to pull my weight. I really don’t want to have any relationship with either parent. What do I do?",
        "created_utc": 1673218213,
        "upvote_ratio": 1.0
    },
    {
        "title": "28 yr old single Female",
        "author": "jurimaria",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ww7j/28_yr_old_single_female/",
        "text": "[removed]",
        "created_utc": 1673218063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for 20F?",
        "author": "Ill-Ad-8718",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106wtun/advice_for_20f/",
        "text": "[removed]",
        "created_utc": 1673217908,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your \"If I haven't done it by now, I'm not going to do it\" life goal or personal aspiration? (Serious)",
        "author": "MinaFarina",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106vh9w/what_is_your_if_i_havent_done_it_by_now_im_not/",
        "text": "Outside of conventional life stage experiences (graduating college, having a kid, getting married, etc), what are some of your ACTUAL personal goals you had that you've either lost hope in achieving or have accepted you won't achieve. \n\nAlso, what's keeping you from attaining it or working towards it?\n\nI don't think I'm going to write that novel, though I've made various attempts of efforts over years. I haven't prioritized it, and can't seem to focus diligently on it.\n\nI'm interested in the actual experiences from others.",
        "created_utc": 1673214746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Considering a career change, anyone can relate?",
        "author": "Prettypettypenny97",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ticx/considering_a_career_change_anyone_can_relate/",
        "text": "I’ve been in my career (education) for a decade now. I enjoy the interactions with students but the rest of the cesspool that education has turned into in America has really killed my outlook. I don’t know exactly what else I want to do and the idea of switching career paths is very scary. But I also want to see if I would be happier (and more financially secure) if I were to work in something else. Any one done something like this? Or in a similar boat? Would love to talk it out!",
        "created_utc": 1673210117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it weird to try to date \"long distance\" right off the bat?",
        "author": "tropicalazul",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106syvf/is_it_weird_to_try_to_date_long_distance_right/",
        "text": "OK hear me out!\n\nI'm Canadian and live in a cool city, but I don't really know if what I'm looking for is *in abundance* here. I think it for sure exists, and I've seen it, but I feel some locations might be more \"desirable\" for me in that sense... though I love living here. \n\nHas anyone ever tried to long distance date? That means, set your dating profile location to somewhere else, or travel there, or just be open to getting to know someone from abroad (whether you knew them before or friends set you up etc)? \n\nI know the common sentiment is \"long distance sucks\" but I've seen *so many* examples where it actually works. I've even known people who did crazy things like \"meet\" online and then meet in person and just decide to be together quickly, and they end up getting together. It ends up being a bit unorthodox for a while (long distance or one person travels or they just have their own way) but it works.\n\nI always complain about Canadian men (lol) and just the kinds of guys around, so I'm wondering if this is a creative idea I can try out. I've certainly been to places where I just felt like... my kinda guy was around more. And then if there's mutual interest, then decide what to do. \n\nThoughts?",
        "created_utc": 1673208844,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to feel better?",
        "author": "LenoxGrace",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106s01l/how_to_feel_better/",
        "text": "My (30F) parents called to let me know they scheduled the appointment to put our family dog down. I know we were so fortunate to have him for 16 years, but I am still devastated. He is the sweetest dog in the world and I was delusional thinking he would be with us forever.  \n\nAs well, not hearing from the guy I am interested in for 3 days (4 dates over the span of 8 weeks, the last date being right before Christmas) and feeling anxious and sad over that. He had a fever so we had to cancel our date that was supposed to be on Thursday. No reply to my “I look forward to rescheduling when you’re feeling better.”\n\nMy 31st birthday is coming up. I used to love my birthday, but it lost its spark it’s spark the past three years. \n\nJust feeling down in the dumps and would like to know how you lovely ladies get yourselves to feel more positive. For now, cuddling with my kitties.",
        "created_utc": 1673206511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend Breakups",
        "author": "SlippyGoose234",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ry2z/friend_breakups/",
        "text": "[removed]",
        "created_utc": 1673206385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone wanna help me figure out what my career path should be? Feeling filled with regrets already",
        "author": "dell1ray",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106q3zc/anyone_wanna_help_me_figure_out_what_my_career/",
        "text": "I've never really been good at anything. When I was younger I was really driven to be traditionally successful in a typical career (doctor, lawyer, etc) and then kind of failed at my attempts at these things. I now am a pretty mediocre-at-best corporate employee in a career I have zero passion for or interest/goals in, but I'm staying in it because it pays decently and I chose it in a state of desperation, and I don't really have the financial safety net to fall back on. I managed to get to $50k in savings this year, but as a single 35 year old without a trust fund, I do need to start getting somewhat serious about retirement, so starting again doesn't feel like an option. I guess the problem is partially money, but also I don't really know what I want to do. I always dreamed of being a lawyer or working in politics, but as I got older, I think I realized my skills and personality might make it very difficult to be successful. I really struggle with reading comprehension and missing things, and I don't have a great tolerance for stress and am a horrible shmoozer. Plus I really hate antigonistic people, most of all, so I think I would really struggle with this, even if I feel compelled towards it on an internal level. I've also had similar strong interests in architecture and art history (many architects in my family), but again I feel like I'd be bad at it because I don't have an eye for buildings and feel like it is slightly \"off\". I've taken many career tests and I always get advertising art director, novel writer, copywriter, marketing, and social worker. Oddly I do feel like these things would probably be a fit for me, but I just don't feel drawn to them - there's no real goals there. If money were no object, I'd probably start my own small fashion label because I love making clothes. But I have no interest in entering the fashion industry for a living and want it to be a side hustle (it's really f\\*ing hard and stressful and I am aware of the shitty reality of this industry). So I guess, if money were no object and I could pay for school, I'd probably do a combo of law and architecture, but that's not financially realistic for me since in the US that easily costs half a million or more in loans. I also do want to have kids and settle down, so I guess I have to get on all of this rather quickly. My main goal is to be able to live comfortably but actually having my talents realized and being in the right place for myself, where I'm doing something I'm actually good at.",
        "created_utc": 1673202008,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you with parents in retirement, how are they doing? Did they prepare correctly?",
        "author": "goddess_banana_fana",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106oo33/for_those_of_you_with_parents_in_retirement_how/",
        "text": "Are they enjoying life?\n\nAre you taking any life lessons away from what you're seeing them experience?\n\nME: well, mom and dad weren't exactly on the same page for retirement. The compromise is a stalemate and no one is happy. They mostly just drive each other nuts.",
        "created_utc": 1673198596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking some advice on how to address feelings to my partner.",
        "author": "Precariouscrow",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106o8dr/seeking_some_advice_on_how_to_address_feelings_to/",
        "text": "[removed]",
        "created_utc": 1673197561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best/safest place to go on my first solo vacation?",
        "author": "SeniorContribution83",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106nod9/bestsafest_place_to_go_on_my_first_solo_vacation/",
        "text": "Around this time next year, I hope to take a 2-3 week solo vacation as a reward for graduating college. I don't have any preferences. I just wanna know all of the good options. What are your suggestions?",
        "created_utc": 1673196232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Romantic date ideas for my boyfriend’s upcoming birthday",
        "author": "nxtxnx2020",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106nmgb/romantic_date_ideas_for_my_boyfriends_upcoming/",
        "text": "[removed]",
        "created_utc": 1673196093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would you wash your clothes in warm/hot water vs. cold water?",
        "author": "Dull-Soup-2640",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106nas7/why_would_you_wash_your_clothes_in_warmhot_water/",
        "text": "My whole life my family has been washing clothes with warm water.\n\nI decided I wanted to stop doing this because it shrunk my work clothes and now my khakis look like some leggings and I have to squeeze into my shirts.\n\nI now only wash cold and low tumble dry.\n\nWhy do people ever wash warm? Is it more effective at killing bacteria or something? And if so, how bad of a job does cold wash do for removing bacteria? Is washing cold even sanitary?\n\nWill your clothes smell any better or worse if you wash warm vs cold?",
        "created_utc": 1673195292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone please tell me I won't be on my own forever?",
        "author": "Routine-Historian904",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106moxn/someone_please_tell_me_i_wont_be_on_my_own_forever/",
        "text": "Hi everyone  - My 9 year relationship is ending. It's mostly mutual, we want different things and don't want the other to have to compromise as much as would be needed to keep the relationship going. It's horrible and it's the right decision (I think?????). \n\nMy rational brain tells me this happens all the time, this is the right thing for both of us, and I'll be ok (eventually).\n\nMy goblin brain tells me that I'm turning 35 this year and he was my one shot at a life partnership. We had been together since he was 25 and I was 24 and what I thought my life was going to look like....isn't going to look like that. \n\nI'm in need of some positivity, if you have it to share.",
        "created_utc": 1673193784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hype me up, ladies!",
        "author": "Embarrassed-Hat1371",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106lp77/hype_me_up_ladies/",
        "text": "My New Year's Resolution is to do fun things by myself instead of waiting for a boyfriend to do it with. I also have zero friends because I'm new to the area. I love watching sports and I've been trying to gather the courage to go to a sports bar by myself to watch a game. Well, the end of the regular season (NFL) is here and... yeahhh that has not happened. So, I'm going to do it today! I think. Is it weird for a 30s woman to go to a bar by herself? I get anxiety just thinking about it. Ugh, I don't know if I have the confidence to do this... \n\n(Alternatively, if you happen to be a woman who lives in southern CT, let me know!)",
        "created_utc": 1673191250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pregnancy anxiety - looking for positive pregnancy and childbirth stories",
        "author": "theduckpuc",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106lkk8/pregnancy_anxiety_looking_for_positive_pregnancy/",
        "text": "I'm 37F in a relationship and we both want children in the near future.\n\nMy mother had a difficult pregnancy with me and my sister, and she shared these difficulties with us both as we grew up. As for my friends, they didn't have easy pregnancies and childbirths, and when I look online, all I see is difficult, scary stories. The thought of becoming pregnant gives me a lot of anxiety, and it is messing with my head and with our future plans.\n\nI'm sure a lot of women have had OK pregnancies. Rather realistic than fairy tales. However, I cannot find those voices online.\n\nCould you please share your stories with me, so that I can overcome my anxiety and create the family we want?\n\nThank you &lt;3",
        "created_utc": 1673190917,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get my ambition back?",
        "author": "shree_swapna",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106k7xs/how_to_get_my_ambition_back/",
        "text": "[removed]",
        "created_utc": 1673187266,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I chronically online, or is this a mainstream dating etiquette ?",
        "author": "Garyteck92",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106k5lh/am_i_chronically_online_or_is_this_a_mainstream/",
        "text": "On social media, I see countless videos of women saying that :\n\n* men should pay for the car ride to the date\n* men should pay for the meal\n* All of the above justified because women are supposedly the prize and should be pursue.\n\nAll of the above justified because women are supposedly the prize and should be pursued.\n\n*Or some will say whoever invites should pay, knowing well that men in general are expected to invite.*\n\nIt seems that the United States is extremely traditionalist when it comes to dating and gender roles.\n\nRedittors, is it the same in your city, country, I would love to hear your opinion?\n\nP.S : I grew up in Paris and now live in Copenhagen. I have not dated for a while but back here, things are more equalitarian.",
        "created_utc": 1673187080,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to gain my ambition back?",
        "author": "Upstairs_Twist_2117",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106jps2/how_to_gain_my_ambition_back/",
        "text": "[removed]",
        "created_utc": 1673185833,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (27M) gf (38F) is insecure about our age difference &amp; is afraid to meet my parents because of it.",
        "author": "ThrowRA_jifmen",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106iua8/my_27m_gf_38f_is_insecure_about_our_age/",
        "text": "[removed]",
        "created_utc": 1673183226,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your relationship to alcohol?",
        "author": "JunoBlackHorns",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106iqwl/what_is_your_relationship_to_alcohol/",
        "text": "So, have you thought what is the point of alcohol in our culture?\n\nI drink in social ocasions- like new year, after work, sometimes gigs. Even I do not want to, the social pressure makes me do it.\n\nThe thing is, sometimes, like once in a year I drink too much. To the point I lose my memory. This bothers me a lot. When I drink too strong drinks, I get out of control- and dont understand it would be best to not drink anymore. So I drink and lose my memory. I always get home safely- but Im small sized and it really is not cool to lose memory even for half hour.\n\nIs this common problem? Should I be worried of this? I'm a alcoholic? \n\nIm not a teenager anymore. This bothers me a lot.",
        "created_utc": 1673182943,
        "upvote_ratio": 1.0
    },
    {
        "title": "When it alcohol is a problem?",
        "author": "JunoBlackHorns",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ipnz/when_it_alcohol_is_a_problem/",
        "text": "So, have you thought what is the point of alcohol in our culture?\n\nI drink in social ocasions- like new year, after work, sometimes gigs. Even I do not want to, the social pressure makes me do it.\n\nThe thing is, sometimes, like once in a year I drink too much. To the point I lose my memory. This bothers me a lot. When I drink too strong drinks, I get out of control- and dont understand it would be best to not drink anymore. So I drink and lose my memory. I always get home safely- but Im small sized and it really is not cool to lose memory even for half hour.\n\nIs this common problem? Should I be worried of this? I'm a alcoholic? \n\nIm not a teenager anymore. This bothers me a lot.",
        "created_utc": 1673182845,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I have a babe and be a good mother whilst still maintain a career?",
        "author": "Ladidagringa",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ikfr/how_can_i_have_a_babe_and_be_a_good_mother_whilst/",
        "text": "I’m planning to have a baby this year and although I want to be a good mother I also have work really hard to grow as a professional and want to continue to progress in my career, how can I conciliate both without missing out on being a good professional and as a mother too?",
        "created_utc": 1673182410,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to handle difficult colleagues?",
        "author": "itkoiihhikr",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106iiie/how_to_handle_difficult_colleagues/",
        "text": "how to handle rude colleagues\n\nSo I'm new at work like in 3 weeks in and I'm the kinda person that needs a couple of repetitions to get it. I work at an average IT firm so yea I'm just an average person\n\nThere a few incidents that I felt could have responded better so seeking advice here\n\n1)So at work I got confused about how something works and then I just why isn't this working this way and my colleague who been there some time replied in this way, \"whyyyyyy would it be like that\" rolls eyes , \"WHAT IS THIS!?!\" slams her arm on the table and then points furiously at the screen\" so I just replied in a normal tone on what my understanding is but after that I felt I should have call her out on it.\n\n\n2) I wasn't sure about on the format of sending the email although sh had shown me before on a powepoint guide as it is the first time  I just asked her to show me how to do it the first time and I will do it by myself subsequently. She kept sighing very single steps while showing me , I told her in a sarcastic manner \" why do you keep sighing are you really tired?\"\nhow to handle difficult colleagues?\n\n\n\n3) part of my job is to monitor a system via an email and i have to ensure i received the email by morning latest early afternoon .At that point I didn't have access to the system and I still haven't receive the email for the day. So I just ping her about 11am that like hi I haven't receive the mail could you please check the system thank you and then she say she will. By 3.30pm I still haven't receive it and I got worried so I just drop her a ping again and then she sent me a whole chuck of text saying she is haven't had lunch, been in a meeting since 10am and she say \"more important things to do than adding an email !\"\n\n\n\n4) i check ping her to confirm my understanding on the task and check if the user id is that the one the task is referring to and she was like \"did you read?\"\n\n\n\n\nTL;DR: how do I handle rude colleague without freezing up whenever they are aggressive. \n\nWhat should I do and how should I response when a colleague or a manager is shouting at me?\n\nUnfortunately i have some trauma in past from domestic violence so whenever someone is shouting at me I tend to freeze up , chock up and my heart starts to pound.\n\nHow can I improve this ?",
        "created_utc": 1673182242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skin vent",
        "author": "Hatcheling",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106i2du/skin_vent/",
        "text": "So, I made the mistake of waxing my lady stache and lady beard for the first time in years the other week. Been plucking cause I just kept forgetting to get wax strips and well, age bit me properly on the ass. My last wax, sure, some skin would come off, but that was easily fixed with some zinc paste or serums, a day or two and it'd be good.\n\nThis time, half my chin was torn off. I have huge scabs now because apparently the years, the season and possibly retinol use has made my already sensitive skin, super fucking sensitive. I have rice paper face and none of all the collagen and zinc in my cabinet is helping. \n\nAnd don't get me started on the state of my assne. I'm almost forty, how can my ass still be confused for a teenaged boy's back in a blind test? Fuckfuckfuckfuckfuck.",
        "created_utc": 1673180788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I wrong for having a trip with my next door neighbour without his wife?",
        "author": "Nervous-Toe-6779",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106hpdm/was_i_wrong_for_having_a_trip_with_my_next_door/",
        "text": "\n\nSo for context my next door neighbours wife got hospitalised recently and it was quite a scare and I ended up performing cpr and apparently saving her life because the paramedics wouldn’t have arrived in time.\n\nSince then her husband has been full of thank you’s and constant appreciation and we’ve been communicating a lot because of this ordeal and I’ve tried to be a pillar of support because of the stress of the situation now.\n\nNow a couple of days ago he came to me saying he booked this trip to another city for him and his wife before hand and obviously since she’s hospitalised she can’t go and at this point apparently he couldn’t get a refund either so he offered me to come with instead of his wife I was slightly hesitant but he did then like convince me with him saying he’s been quite stressed and it would be good for him mentally and it would mean a lot if I came along so then I caved and agreed.\n\nThe trip itself was just a full day with an overnight stay and the hotel was fully booked so we had to share a room the whole experience did feel quite interpersonal which I’m not sure is a good or bad thing ? It just feels like i invaded their marital space. She obviously has no idea at the moment this happened since she’s still hospitalised it’s just made me think if I was in the wrong for this ?",
        "created_utc": 1673179614,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s it called when you assume responsibility for things you have no control over?",
        "author": "oleavemealone",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106h1r6/whats_it_called_when_you_assume_responsibility/",
        "text": "I was recently opportune to work in the main capital of my country. Where I come from, a lot of people lobby to work in the main cities cause of more employment opportunities. I have a few friends and we all planned to apply to this in hopes of being posted to the capital.\n\nThe norm is you have to go through underground channels to be posted to the city and I offered to help my friends with one of my connects. The problem now is, mine went through and theirs didn’t and I don’t even know how to feel. They got posted to a more remote area and aren’t happy.\n\nIm currently in the process of seeing why that channel didn’t go through and how to rectify it but I don’t even know how to approach my friends. I feel it’s my fault we didn’t all get to be posted to the city and I feel they hate me (I know they don’t it’s part of the assuming responsibility thing). I don’t really know how to navigate things now cause I feel guilty like I fucked up their life.\n\nI don’t know what I’m asking for or what I want to achieve by posting this but if anyone has any tips on letting go of things you can’t control I’d love to hear it",
        "created_utc": 1673177331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women over 30 with abusive childhoods, how to finally find community?",
        "author": "navigating-it-all",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106ghj7/women_over_30_with_abusive_childhoods_how_to/",
        "text": "[removed]",
        "created_utc": 1673175317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Curious if anyone has grown up with their cousins, but both families are quite different?",
        "author": "Chemical-Heat3055",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106fxdy/curious_if_anyone_has_grown_up_with_their_cousins/",
        "text": "My mum and my aunt had kids around the same time. We all grew up spending time with each others families. \n\nBut today I found a box of photos and realised that my aunt and uncle were much more progressive in their parenting. \n\nFirst I discovered they all had passports at age 10. They went on a few trips to Europe and America. I didn’t get a passport until I was 18. And we never went overseas for a summer holiday. \n\nMy cousin was so much more ambitious from an early age. She had a musical background and studied at university. \n\nMy dad would say University was a waste of time and money. It was like my parents being the youngest in their families were just not very sure how to parent when I compare it to my aunt and uncle who seemed more comfortable and capable. \n\nDid Anyone have a similar experience? As an adult I can appreciate how much more aware and knowledgeable my aunt and uncle were at supporting and encouraging their kids to travel, go to university and be financially educated. \n\nMy parents were too busy trying not to divorce, bury their stillborn baby and keep going through Illness and trauma. As a result my childhood was one of worry and anxiety.",
        "created_utc": 1673173246,
        "upvote_ratio": 1.0
    },
    {
        "title": "37m new job",
        "author": "newjiggersorjewnigg",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106b55o/37m_new_job/",
        "text": "[removed]",
        "created_utc": 1673156525,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't let go of him.",
        "author": "Mean-Discussion5221",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/106a87n/i_cant_let_go_of_him/",
        "text": "[removed]",
        "created_utc": 1673153739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone else incapable of loving people other than family?",
        "author": "tennesseewaltz",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1069gd9/is_anyone_else_incapable_of_loving_people_other/",
        "text": "I love my parents, brother, nieces, and cousins I grew up with. But I’ve never felt love for a friend or a man, even though I really liked and spent years with. \nI think I’m literally incapable of loving people and I don’t know if I care enough to consider therapy, if that is an option. Looking for like-minded women.",
        "created_utc": 1673151426,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am more successful than my husband - and I don’t want to be.",
        "author": "wonderland_107",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10692ne/i_am_more_successful_than_my_husband_and_i_dont/",
        "text": "38f here and my SO, 36m - have been married for a few years. We married quite quickly after we met and at the time I made a lot of assumptions about our values and future prospects together. I thought we would both climb the ladder at equal pace - but the reality has dawned on me that his career is at best going to be pretty limited in terms of pay and trajectory. I want to have kids soon and this worries me that I am the better earner as I want to be able to take time to be with my child without financial concerns.  Also the longer we have been together I realise that we actually have had such different upbringing - where he had to pay his way through life versus me, where I was lucky enough to have been provided for in life comfortably by my parents.  It’s causing problems in the marriage as what we consider “middle class” and “comfortable” differs greatly.\n\nAll my friends and their spouses earn a whole lot more than us with highly professional jobs.  They have had help from their parents and own multiple homes already as well.  The standards I expect out of life are higher than that of my husband and I am just not sure if I will be happy with living out his definition of a good enough life. I am ambitious and I feel I have clarity over the kind of life I want with a partner - regretfully only now. It’s a strange sense of buyers remorse that’s really plaguing me.\n\nI know everyone will suggest that I get over it but can anyone help in making my sense of panic over these realisations with some wise counsel please?",
        "created_utc": 1673150302,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get on your managers good side?",
        "author": "meowkittyxx",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1066nmy/how_to_get_on_your_managers_good_side/",
        "text": "I started a new job and I'm feeling uneasy about my new manager. She's talkitive, smiley and welcoming, but my gut is telling me not to trust her. I hate this term, but she seems fake nice. \n\n\nI had a discussion with her the other day about my role and duties. Its a brand new role on the team. Im new to the company, but not new to the role. She acted like I was an idiot and like I didn't know what my role was. I was trying to explain to her what someone in my role would do and she basically told me that im wrong and didn't understand the role I was hired to do. She didn't even know what I was talking about at one point and it was on the job posting. The conversation was really weird with her basically asking if I wanted to do the job and saying that she didn't even interview me and knows nothing about me. Im 100% she doesn't know my role because I talked to someone else on a different team who does my role. \n\nI need to get past the 3 month probation. How do I kiss her ass ? \n\nThis is her first time being a manager. Im guessing she's really stressed.",
        "created_utc": 1673143413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you make your life decisions based on what you want or based on what you \"should\" want? If it's the former, then how are you sure?",
        "author": "KarmaAndFruit",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1066m7u/do_you_make_your_life_decisions_based_on_what_you/",
        "text": "I am a 30 year old woman. I feel that biases and society's ideals are so ingrained in me that sometimes I cannot differentiate between what I should want and what I actually want. \n\nFor example - I don't know if I want children or be child-free. I do not know if I want to be in a casual relationship or a serious relationship. I do not know if I want to be very ambitious in life or if I want to have a simple average life.\n\nI feel like I do not know what I truly want. Take the example of ambition - I have always been quite ambitious as a child, but it did bring me a lot of stress. Sometimes feel that I want to be ambitious because it's my nature, other times I feel that maybe I was groomed to think that I should be ambitious as a child by my parents and teachers and that's not the real me.\n\nThis only happens with big things, not smaller things. For example, I know perfectly what kind of clothes I want to wear or how I want to keep my body. I see other 30 year old women around me dressing and maintaining their bodies in a certain way but their choices don't affect mine. I make my own decisions on what my size should be, what clothes I should wear, whether I should have body hair or not etc. \n\nBut when it comes to big things like relationships, career etc., I feel lost.",
        "created_utc": 1673143305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Womens health/family megazine recommendation ?",
        "author": "Yarafsm",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1066lv3/womens_healthfamily_megazine_recommendation/",
        "text": "Hello all - I am looking for recommendations for a good women’s magazine subscription for my wife.She is 36 and we have 2 kids,3 and 1 yo.\nIdeally i am looking for something general that helps in staying current with latest trends,health issues,housekeeping and personal growth - not sure if something decent cover all these.\nThanks in advance for all suggestions.",
        "created_utc": 1673143279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I being unrealistic in my expectations with my partner?",
        "author": "mrsbertmacklin",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1065mus/am_i_being_unrealistic_in_my_expectations_with_my/",
        "text": "My partner (together 11 years, married for 4, no kids, both 30 years old) and I have had a really, really hard few months. I've been feeling generally uncared for in this relationship almost the entirety of our relationship. The classic unwillingness for him to learn emotional intelligence, going to therapy, and this has all come to a head a few months ago when I  said that I refuse to be with someone who isn't working on these issues-- specifically the issues around anger, as there was an outburst that happened a couple of years ago that I haven't been able to get over.  \n\n\nThe comment that sticks with me the most happened a couple of weeks ago. I mentioned that I realize that the type of relationship I was is not one of conflicting standards (aka, sacrificing one part of the relationship to make space for another-- this came from a Love Languages conversation) but one where we are both setting a new normal and raising the minimum standard in which we show up in this relationship. He was aghast and thinks my standards are way too high. Is that... true? **Is that an unrealistic expectation in a long-term relationship?** This has been my only long-term and serious relationship and have never dated in my adult life, so I genuinely don't know if that's too much to ask for or not.   \n\n\nA little additional context: We aren't currently living together, since I felt like I needed space to achieve clarity on if this relationship is still beneficial to each of us. Would love some perspectives of other women who have been through something like this.",
        "created_utc": 1673140609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self Worth vs Weight",
        "author": "dirtgirlbyday",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10652if/self_worth_vs_weight/",
        "text": "Hi ladies. I’m 39F and extremely overweight. Just a few years ago I was a size US2, but depression from the pandemic coupled with bad eating habits - here I am at a size 18 within 3 years. I’ve gained almost 100 lbs. \n\nI recently landed a very high paying job, so I know some people aren’t judging me, but I feel like the world just respects smaller women in general. I work in a male dominated field so I am even more sensitive about it.\n\nHow can I accept myself while I’m working on losing weight? You’d think after years of this I would have learned this.",
        "created_utc": 1673139097,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has journaling helped your anxiety and depression?",
        "author": "peace_love_bananas",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1064w3i/how_has_journaling_helped_your_anxiety_and/",
        "text": "",
        "created_utc": 1673138629,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think Im about to be homeless again and idk where to ask for help?",
        "author": "31317059",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1063y5z/i_think_im_about_to_be_homeless_again_and_idk/",
        "text": "I was housing insecure for a couple of months back when it was still summer. It was fine for me to sleep outside cuz of the warm weather despite how shitty that was.\n\nI was able to find a place for a low rent and coincidentally my job finally started and I got paid.\n\nThe past few months have been me literally living paycheck to paycheck. After rent I only have maybe ~100$ in my bank account. Not to mention the cc debt, student loans, and borrowed money from other people I still owe. \n\nThing is, Im about to quit my job. I really fucking hate it and never put in the effort. I genuinely wake up dreading \n\nI dont even have money for rent. Not even w this stupid job. Which means Im gona get kicked out. \n\nAnd all my shit is gona be in the streets because I dont have money to pay for a storage (i got kicked out a major storage facility in nyc bc i knocked out in there) Im blacklisted from that. \n\nAnd, I cant/move in w my folks because I always hated living there. And Im not out to them about my transition.\n\nDoes anyone have any other options??\n\n Im looking for iobs now and i fucking hate that too.",
        "created_utc": 1673136186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be nice please.",
        "author": "Googlemeister10",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1062emt/be_nice_please/",
        "text": "[removed]",
        "created_utc": 1673132386,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a man I've always wondered how it feels to grow up realizing the world is obsessed with you. From movies, music , magazine , books even anime etc a woman's beauty/Body is always obsessed over.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673131078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weaponized Shame - What do I do about this?",
        "author": "SomeOil158-throwaway",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10609wn/weaponized_shame_what_do_i_do_about_this/",
        "text": "Today I had a long conversation with a long-time friend (\\~44/F).  She described an argument she had with her Mom (\\~75) about some life choices.  My friend said her Mom made comments about what she was doing wrong in a way that was impose shame.\n\nSomething clicked because my own father has been doing the same sort of thing for years - making comments and accusations in a way designed to make me feel inadequate, off balance, anxious.  The underlying emotion I couldn't put my finger on was shame.\n\nThe problem is my Dad is not interested in reconciling.  \n\nHere's an oversimplified example, if a parent wants their son/daughter to call them more, they can say, \"I'd love to hear from you more often because I care about you.\" (Direct, invitation).  They can say, \"Well, I'm going to die soon.  You'll wish you'd spent more time with me.\" (Passive aggressive?)  or \"You're a failure/disappointment and you never call me - even though I paid for your college education!\" (weaponized shame?)\n\nMy Dad me to feel like crap for not calling \"enough\"  (I talk to my Mom at least once a week.)  After a very ugly argument last year I'm low contact with him.  I blocked his cell number and only call their house.\n\nIt's frustrating and demoralizing to be in this no-win situation.  I don't know what to do.",
        "created_utc": 1673127058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Must have purse items?",
        "author": "Background_Ear_224",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/105zrko/must_have_purse_items/",
        "text": "What are your top 5 (or more lol) must have items to have in your purse at all times? \n\nMine-\n\n1. AirPods\n2. Umbrella\n3. Water bottle\n4. Book \n5. Work badge",
        "created_utc": 1673125796,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m at a loss, boyfriend of 10 years just has no motivation and it’s effecting my health",
        "author": "karenisnotmyname82",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/105ys1c/im_at_a_loss_boyfriend_of_10_years_just_has_no/",
        "text": "Ok, he’s been off for four years on an injury. Re-educated himself in a field that is only commission based as is not doing well at it. I am so stressed out watching him literally do nothing and contribute minimally to our home/family.\nHe isn’t my kids bio Dad so maybe he doesn’t feel responsible for all of us but there’s more to life then doing nothing.\nI’m not sure how we got here but I work a lot outside of the house and I’m often sick and still keep motivated, I have no choice. I’ve tried to get him to seek help mentally, physically, anything and I’ve finally realized I’m not here to fix him.\nHow much longer do I sit and watch him deteriorate?",
        "created_utc": 1673123325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it baby fever, temporary insanity or genuine change?",
        "author": "mirrorjack2",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/105yg45/is_it_baby_fever_temporary_insanity_or_genuine/",
        "text": "[removed]",
        "created_utc": 1673122468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should you spend 50/50 time with spouse and friends?",
        "author": "Starlightnails",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/105y3lu/should_you_spend_5050_time_with_spouse_and_friends/",
        "text": "In a marriage, is it normal/common to want to divide time 50/50 between time with friends, and time with spouse because both are of the same importance? Sorry for the odd Q. Just wondering.",
        "created_utc": 1673121603,
        "upvote_ratio": 1.0
    }
]