[
    {
        "title": "Toxic job, stick it out or leave to preserve mental health?",
        "author": "invisibility-cloak2",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ewt89/toxic_job_stick_it_out_or_leave_to_preserve/",
        "text": "I think by posting this I already know the answer. But I guess I’m hoping for some validation or support. \n\nI just started a job two weeks ago that very quickly started to be extremely toxic. It’s marketing and event planning for a small non profit. So far I actually like the work itself, but the boss is getting more toxic by the day.\n\nJust some examples: \n- the first day, it was just me and her in the office and she had shared gossip about every other employee and board member. One doesn’t pay dues, one fakes their time sheet for more money, and more. I’ve learned gossip about people I know in the community, things I just don’t care to know.\n\n- she walks around our 3 person office and calls herself a teacher needing to “check in on her little students.” My other coworkers are over 40, or 50.\n\n- she explicitly told me not to put certain races (or smiling people) on our marketing flyers. This alone is enough for me to quit if I wasn’t very very poor.\n\n- today she told me that I “write too much like a woman” because I used an exclamation point\n\n- she insists on standing over me while I work, and today I checked a box on accident and went to uncheck but before I could she yelled no no no no no so loud to the point where my coworker gasped and jumped\n\nI’m sure there is much more. I was really hoping this job would be a good way to explore another field (marketing and some web design) because I’m in a limbo period after burning out working in health care. I was excited to build a portfolio in this area. Around early December, my mental health had finally gotten to a point where I could think about working again so I wanted to give this a try. I also am starting to desperately need an income after a period of unemployment. I am signed up for a coding program in may, so I have an exit date (she doesn’t know this) but I’m not sure if I will make it that long.\n\nBut honestly, I just don’t think it’s worth it. I’m seeing a therapist and she was shocked after I told her about my first day with the gossip. She mentioned it might not be worth it to stay in this position and I think she is right. Has anyone else been in a similar spot?\n\nThis quarter life career crisis human appreciates any insight",
        "created_utc": 1674012819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else have a hard time saying no to things?",
        "author": "midwesterngirl44",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ewa5p/anyone_else_have_a_hard_time_saying_no_to_things/",
        "text": "I feel so guilty when someone asks me to an event and I say no. Most recent is a play that I didn't want to spend $ on. I'm not sure why I feel guilty...maybe I think they will be mad, or I'm missing out on something. \n\nAnyone else?",
        "created_utc": 1674011350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ladies who asked for a better salary: how did it go?",
        "author": "4SeasonWahine",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eva4h/ladies_who_asked_for_a_better_salary_how_did_it_go/",
        "text": "The TLDR is basically just the title. \n\nI’m in a predicament. I adore my job, I genuinely love it (and the company I work for) because it’s creative and it’s in an industry that happens to be one of my biggest interests/passions/hobbies. The problem is, we are very small team and my pay is not great + there’s not really any room for advancement since there’s only one of us doing each job. \n\nUnfortunately, like most places, the cost of living is soaring in my city and I’m having to work a side hustle as well just to have some semblance of affording to do things. I’ve run my wage past my supervisor informally before and she didn’t seem optimistic that there was enough money in the budget to pay me much more. The major issue I have with this is that I have taken on significantly more than I was hired to do, I enjoy doing it but it’s still well above and beyond the actual role I was hired for and thus I feel I’m working beyond my salary. \n\nAn opportunity came up in the industry my side hustle is in, for SIGNIFICANTLY more money than my current job - like I’m talking a 50% increase on my current wage. It would be slightly more than I’m earning with my salary + side hustle with the obvious benefit of only having one job. This new job is pretty interested in me, I would enjoy it (I enjoy my side hustle) but I wouldn’t be as in love with it or as passionate as I am about my current job. \n\nMy plan is to see this new job through to a point where I have a concrete offer, then sit down with my current boss and explain that I have a much higher paying offer… and see if there is any possibility of me getting paid more in the foreseeable future. If not, I’m facing the very real possibility of leaving which is quite sad for me.\n\nHas anyone been through something similar and how did it turn out?",
        "created_utc": 1674008562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating apps and telling someone that you dont want to continue talking",
        "author": "Similar-Poem5576",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ev5vl/dating_apps_and_telling_someone_that_you_dont/",
        "text": "So I , f/30, matched with a guy , m/32 on Hinge and we had a really good conversation, now he gave me his whatsapp so we could go and chat there. I was the whole day busy and to be honest forgot to text him on whatsapp. I am in med school and have a few exams next week and after an abusive relationship I try to not attach myself so easily to a new man in my life. He tried calling me on the app then and it kind of makes me feel annoyed that someone would go so far to call me that when I dont send a text back right away and I am afraid that this guy is controlling again. Would you say that it is a sign of interest that he calls you or if he is being needy that I did not text him yet to schedule a first date? I am honestly afraid he is too got to be true, I do not trust guys anymore after being cheated on and being betrayed, he is so kind and caring or at least it seems like it but I rather feel like I need to protect myself. \n\nAnd how do you tell him that you maybe really liked the conversation but do not want to proceed the conversation without ghosting him? I feel like and idiot but I think I noticed that I am not ready yet for the dating world due to my trust issues.",
        "created_utc": 1674008240,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone who has hired a house cleaner to clean for you regularly, is it worth it?",
        "author": "Fluffernutter80",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ev4qt/anyone_who_has_hired_a_house_cleaner_to_clean_for/",
        "text": "I’ve been on the fence about whether to try one. I can’t keep up with cleaning while working full time and keeping up with all the kids’ activities. I also have some chronic health issues that cause fatigue and I need to put what extra time and energy I have toward exercise to try to manage those.  I can’t seem to stay on top of it all so cleaning (beyond the basics) tends to be what gets dropped. I feel intimidated because everyone else in my neighborhood has a spotless house. Our house is very lived in. \n\nSo, I’ve thought but hiring someone but I worry that I will find myself cleaning up before the cleaner comes since the kids and husband constantly create clutter.  Also, I’m a little embarrassed by our mess. Will they judge? And, how do you even go about finding someone reliable and safe to allow into your home?",
        "created_utc": 1674008156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I talk to my doctor about my kink?",
        "author": "fearless898",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eus1l/can_i_talk_to_my_doctor_about_my_kink/",
        "text": "[removed]",
        "created_utc": 1674007222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Left an abusive relationship with the help of this subreddit and am learning to swim at 34",
        "author": "bringbackxena",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eunq2/left_an_abusive_relationship_with_the_help_of/",
        "text": "[removed]",
        "created_utc": 1674006918,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your personal opinion, what age do most men start losing their attractiveness?",
        "author": "dwarfranch",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10etxwe/in_your_personal_opinion_what_age_do_most_men/",
        "text": "",
        "created_utc": 1674004995,
        "upvote_ratio": 1.0
    },
    {
        "title": "32f/35m is this worth fighting for",
        "author": "EnthusiasmKey3015",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10etg2e/32f35m_is_this_worth_fighting_for/",
        "text": "[removed]",
        "created_utc": 1674003708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mechanic asked me out",
        "author": "Adventurous-Fox7978",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10et326/mechanic_asked_me_out/",
        "text": "[removed]",
        "created_utc": 1674002777,
        "upvote_ratio": 1.0
    },
    {
        "title": "No time to date?",
        "author": "Ssuspensful",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10et0p7/no_time_to_date/",
        "text": "How do y’all in long hour jobs find time to date? I work on average 9 hours (sometimes 8.5, more regularly 10) hours a day, 5 days a week, and usually commute about 1.5 hours each way. That’s about 12 hours a day dedicated to just working/getting to work. Add on my attempt at sleeping 7 hours, 2 hours of just general life up keeping (shower, eating, cooking, getting ready for the day/next day) and that leaves me with 3 hours to literally cram anything else in. Grocery shopping, calling friends and family, hell, seeing friends and family, playing with my cat. By the time I’m done just doing my daily stuff I literally am out of time. I don’t know when I’m supposed to meet someone. Weekends are also a mess because that’s the only time I have time to do longer stuff like clean the house, wash my car, do regular household maintenance, hang out with friends (my friends refuse to hang out weekdays so I can only see them Friday evenings till Sunday morning) or even just take a breather/sleep in a little. I really want to date but it feels like I have so many other things I don’t know what to do. Is anyone else in the same boat?",
        "created_utc": 1674002612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dealing with the shame of having virtually zero savings at age 29",
        "author": "Top_Yam5054",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eswmu/dealing_with_the_shame_of_having_virtually_zero/",
        "text": "Growing up I was always the girl who had her shit together, financially and otherwise. Then around age 23, life hit. I moved several times in as many years, had thousands of dollars in medical bills, and (although this definitely isn't the primary reason I'm in the position I'm in), I took me longer than it should have to be more responsible with money. Freelance writing in an unstable economy also hasn't been helpful. \n\nAs it stands, I'm about to turn 29 and I have virtually zero savings. I'm not in any debt whatsoever, which is good. And I don't have any (planned) upcoming expenses, like a morgage or wedding. Don't have and never want children. Obviously, unplanned expenses could come up at any time. \n\nI'm starting to come out of several years of basically being in an expensive medical crisis, so now my biggest \"health\" bill is weekly therapy, which for me is an essential. I'll be able to start putting a few hundred bucks into savings every month, which is not a lot. But at least its something. I'm also taking strides toward financial literacy, learning to invest, and working with a tax professional. \n\nAll that said, I'm suddenly feeling a lot of shame, guilt, fear, and self-criticism about my financial situation. It doesn't help that several of my closest friends all happened to land six-figure jobs within a few months of one another, and their lifestyles reflect it. I can't keep up with eating out several times a week and weekend trips that involve buying plane tickets. I also recently ended a four year relationship, which landed my back alone in a tiny studio apartment--a living situation I thought I'd left in my early 20's. \n\nFWIW, I also live in San Diego, so cost of living is uh....not low. \n\nI'd love to hear from any women who found themselves in a non-ideal financial situation around the time they hit 30. How did you cope emotionally? How do you feel now? \n\nWhat I'm **not** looking for is financial advice. I'm working with professionals to improve my financial literacy, and also I'm not going to take money advice from people on the internet anyway lol. \n\n**TLDR;** Crazy medical bills and several moves have left me virtually without savings at 29. I'm not in debt and I'm working on improving my financial situation, but am still feeling a lot of shame. Would love to hear from anyone else who found themselves in a similar position around age 30 and how they coped. Uplifting stories are always appreciated!",
        "created_utc": 1674002324,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is it to you for a man to show curiosity about you",
        "author": "lady_in_the_six",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10esitk/how_important_is_it_to_you_for_a_man_to_show/",
        "text": "I came home after a date last night and felt this dread wash over me. Another date with another man where he did not ask a single question about me, doesn't know where I work or how old I am, and I know much about him. I've been in multiple relationships and I realized I have never fallen in love because I need to feel seen to build emotional intimacy with someone. After conferring with a few female friends, they all concur that the men they are dating / husbands / etc generally do not express any interest or curiosity about them as a person but they nonetheless proceed to marry them and even fall in love. \n\n\nI don't think I'm a boring person and many people said I am engaging and fun to talk to and I've been asked out for second third fourth+ dates by these very same men. \n\nIs my expectation too high in our society and culture?  I don't know whether I should shift my expectation away from men who can truly form a real deep love connection and towards a good partner, father etc. \n\n- feeling hopeless",
        "created_utc": 1674001364,
        "upvote_ratio": 1.0
    },
    {
        "title": "I turned 30 today and I'm a little scared and worried",
        "author": "samm105107",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10erprx/i_turned_30_today_and_im_a_little_scared_and/",
        "text": "It feels like I was considered young and have hope in life but suddenly I should be worried about my age and reminded about it often lol. It's like I'm not ready to adapt to this new concern. I'm not where I want to be in life at the moment, but it certainly doesn't help when I keep reminded how I am so behind now that I'm 30. I started hearing criticism before this day, it actually happened once people realized I'm approaching 30s.\nI didn't start a job yet ( I pray it happens this year ). I do want to make a family and have my own baby but I am still not married. I want to be financially stable but I still didn't make a penny. One of my life goals is to pay back to my mother, because she lived in poverty but did so much for me, it'd mean the world to me to give back to her one day, she's in her 60s and I feel terrified that I lose her before I make her proud and pay her back even if it's just a little. I still have hope and I still want to keep working to live the life I dream of but it's scary that the clock is ticking and the time is my enemy in every aspect.\n\nIt's hard to be strong and hopeful sometimes. Especially when people who know me keep reminding me of how much I'm behind in life.\nAny thoughts or advise for me would be appreciated!",
        "created_utc": 1673999407,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I (29M) Help My Girlfriend (34F) Who Seems To Be Struggling With Body Image Issues?",
        "author": "EMECOR",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eqku1/how_do_i_29m_help_my_girlfriend_34f_who_seems_to/",
        "text": "My girlfriend has been showing what I believe to be signs of distorted body image (ain't a shrink or an ED expert so I'm spitballing here). She ain't obese or nothing but is a bit on the plump side, and I love that about her. But she makes frequent comments about how she eats too much and I've caught her looking at herself in the mirror a couple of times in what's obviously a body check, though I didn't say nothing about it at the time. She does go to the gym and sometimes we even go together since we both love doing it, but she ain't obsessive about it. She ain't there 7 days a week or nothing.\n\nThing is we ain't been together all that long so I’m still figuring out what she responds to and how she communicates, and it feels rude asking straight up about it at this stage. What I really want to do is tell her how sexy she is but I know some folks don't like being told they're wrong about themselves even if it’s meant to be encouraging, plus I figure a topic like this could get dicey real fast so misstepping this early on could mean stepping on a landmine. What I do now is laugh a bit at her comments about herself with a half-joking \"now that's just crazy talk\" kinda response. Usually she laughs but I wonder if that's really helping.\n\nAlso don't know if this matters at all but she's Pakistani and was raised Muslim and another friend of mine from that part of the world told me it ain't uncommon for young women to get negative comments about their figures, skin tone, and just about everything else from their own family coming up. I know that happens stateside all the time but apparently it can get pretty nasty over there. Ain't met her family so got no clue if that's true about her though.\n\nWould like any input, especially from folks who also struggled with body image shit and what your partners, friends or family did or didn’t do that genuinely helped. Some other folks in other subs mentioned complimenting things like her intellect or the clothes she wore that day (things she chooses) and I been doing that. Seems like it helps.\n\nThanks y'all in advance.",
        "created_utc": 1673996670,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do you ladies prefer? a guy with clean shaved or natural, I'm talking about down there",
        "author": "AlphatronOmegatron",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10epo6a/what_do_you_ladies_prefer_a_guy_with_clean_shaved/",
        "text": "",
        "created_utc": 1673994505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me your stories about workplace harrassment",
        "author": "goddess_banana_fana",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10epj3w/tell_me_your_stories_about_workplace_harrassment/",
        "text": "[removed]",
        "created_utc": 1673994180,
        "upvote_ratio": 1.0
    },
    {
        "title": "32f/35m needing help and advice..",
        "author": "EnthusiasmKey3015",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10epd72/32f35m_needing_help_and_advice/",
        "text": "[removed]",
        "created_utc": 1673993798,
        "upvote_ratio": 1.0
    },
    {
        "title": "32f/35m I need your help and advice .",
        "author": "EnthusiasmKey3015",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10epc2e/32f35m_i_need_your_help_and_advice/",
        "text": "[removed]",
        "created_utc": 1673993727,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when you feel unmotivated?",
        "author": "TeachOk2949",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eo0b2/what_do_you_do_when_you_feel_unmotivated/",
        "text": "Background info: I am prescribed depression and anxiety meds in case that is a question that comes up.\n\nI love my job, I love where I live, I get along with both of my roommates, I’m in a happy relationship etc. (This doesn’t mean my life is easy and has no problems. I have plenty of family trauma that I am working to heal from and help with daily). \n\nI really struggle getting up in the morning, not just workdays but weekends too. And when I’m up, I get maybe 1 hour of motivated energy and then it’s gone. I eat healthy, I do struggle with making exercise a regular thing (I go to yoga about twice a week and hike and ski on the weekends, but fly to Chicago to help my family with things 2 weeks at a time every other month, so sometimes I really get out of this routine). I live in an extremely sunny state so I get a lot of natural sunlight. \n\nI know I could exercise more and I really will try to, but just wanted to know if any of you have any special things, tips or tricks you do to just help you get out of bed in the morning, especially on the days where it feels the hardest?",
        "created_utc": 1673990665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend asks for advice, but really doesn’t want to hear it",
        "author": "testy_tulip",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10enzex/friend_asks_for_advice_but_really_doesnt_want_to/",
        "text": "My friend, “Paige” and I are both mid 30s women.  Paige has another friend, “Claudia”  who is in her late 20s- this is relevant info because of something I have noticed. \n\nClaudia and I do not know one another, other than meeting at the odd social function of Paige’s.  I enjoy being around her, and I would say we are friendly acquaintances.\n\nRecently though, I’ve noticed that when Paige asks me for advice, she doesn’t really want to hear what I have to say- she just wants to hear what she wants to hear.  \n\n\nThis can be about fairly innocuous things (“Hey, I was thinking about coloring my hair- do you like the purple or pink better?) to bigger life issues, like careers and relationships. \n\nI would never offer unsolicited advice, but Paige asks.  Typical exchanges might look like this:\n\nPaige: “I’m not happy with how things are going at work, I’ve applied for another position at a different branch.”\n\nMe: “That sounds promising, I’m sorry things aren’t going well though.”\n\nPaige: “Yeah, I was actually thinking about just calling out for the next few weeks until I hear from the other branch. What do you think?”\n\nMe: “I wouldn’t do that if you want the job at the other branch. Don’t you think word will get around to them that you stopped coming in?”\n\nPaige: “IDK, I’m just tired of dealing with it. Claudia said to just call in and see what happens.”\n\nAnother scenario: \n\nPaige: “Claudia says that Paul and I are official now; what do you think?”\n\nMe: “Haven’t you only been on two dates?”\n\nPaige: “Claudia says when I went to see his band play that counts as a date.”\n\nMe: “I think this is a conversation you need to have with Paul; but if you’re asking me if I think seeing someone three times makes you an item, then my answer would be no. Like I said though,  this is something the two of you have to discuss.”\n\nI’m left feeling odd after these exchanges. As I said, I would never offer unsolicited advice, but if I am asked, I will give my honest opinion.  \n\nAm I missing something here? I feel like the point of asking your friends things is to hear what they have to say, not to generate an echo chamber. \n\nBeyond that, I’m frankly tired of hearing what Claudia thinks on every issue. I’m not sure why Paige asks me if she’s already heard the answer she wants from someone else.  \n\nWhen you ask your friends for advice, do you really want their opinion? Any ideas on how to handle this?",
        "created_utc": 1673990605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pros &amp; cons to microneedling? Was it worth it?",
        "author": "burgerzandburpeez",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10enfff/pros_cons_to_microneedling_was_it_worth_it/",
        "text": "I am 31 years old — unfortunately I’ve aged terribly fast this past year after having two major surgeries. \n\nI’ve also been looking into chemical peels. There are SO many articles out there on different kinds of microneedling &amp; chemical peels, it’s overwhelming. \n\nJust looking for some firsthand feedback and opinions! TIA!",
        "created_utc": 1673989330,
        "upvote_ratio": 1.0
    },
    {
        "title": "What activities to do for a girl’s night-in?",
        "author": "Most-Mathematician36",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10endi8/what_activities_to_do_for_a_girls_nightin/",
        "text": "I’m having a girl’s night-in this Friday, and I’m looking for an activity or craft that we can all do. We are going to be watching Twilight (to reminisce on old days), and drinking wine, but I’m looking for a craft that we can do (not super expensive). I’ve thought about making candles, but that’s pretty extensive, or about doing punch needle, but there’s a learning curve with that. Does anyone have fun crafts that we can do? Thank you!!",
        "created_utc": 1673989220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Off season events: I’m going to a winter bridal shower and a winter formal wedding. What are some colors and options that are fresh and that aren’t too dark or gloomy given the happy mood ?",
        "author": "Comicalacimoc",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10en5r5/off_season_events_im_going_to_a_winter_bridal/",
        "text": "I’m used to spring and summer florals for these occasions",
        "created_utc": 1673988723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Handmade leather backpack vs Designer Brand.",
        "author": "walkerlegoo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10en0wp/handmade_leather_backpack_vs_designer_brand/",
        "text": "I'm stuck between buying a good handmade leather backpack for $80-$150 vs a Louis Vuitton Vintage backpack. ($500)\nPlanning on using it everyday and I wear casual clothing.\nAnyway opinion?",
        "created_utc": 1673988413,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do to keep yourself fit and motivated?",
        "author": "PonqueRamo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10emujg/what_do_you_do_to_keep_yourself_fit_and_motivated/",
        "text": "Hello! Basically as the title says, I have always been somehow anti-sports because I wasn't the best at them as a kid, fortunately I don't have many issues with my weight but I do have a big percentage of body fat and low muscle mass, but since I'm tall I look skinny so I didn't give it more thought about it but now in my thirties I do feel bad about it and because I have almost no strength and that will have a lot of impact in my health as I grow old.\n\nI did have periods of time when I went to the gym but I got so boreeed, I don't like repetitive stuff.\n\nThanks!",
        "created_utc": 1673988007,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did you stop doing in your 20s and/or start doing in your 30s?",
        "author": "EatMePrincess",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10elggj/what_did_you_stop_doing_in_your_20s_andor_start/",
        "text": "[removed]",
        "created_utc": 1673984779,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about your career level (now or past), is it fair pay, have you been underemployed?",
        "author": "tangerinefortuna",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10elcku/how_do_you_feel_about_your_career_level_now_or/",
        "text": "Maybe too much detail below so if you want to just answer the title that’s cool\n\nBut…. I’m realizing that my whole career I’ve basically been underemployed and/or underpaid and I feel really annoyed about it. I think partly even more so because I’m completely single which of course is more expensive and with no support in any way really from talking about work or to escape from work or for advice etc (also that it sucks not mattering that much to anyone and only having myself to rely on but that’s a whole different topic)\n\nFirst, when just out of college, I started out lower (like not even college degree level job) to work for a certain company. I wanted to get a professional job there, or start with a professional internship but didn’t happen. I could’ve worked my way up but the two positions I would have had to have for a long time I didn’t want and probably didn’t pay well. I basically worked in hospitality for a while doing random things until I found my last job in that, which I did really like and got good experience. But I was basically a manager without the title and DEFINITELY without the pay. (It had never even occurred to me to negotiate the offer)\n\nThen I moved and pretty much started a new career. I started barely above an intern, making less than plenty make right after college probably but I had graduated like 6 years ago. (I tried to negotiate pay and they said no) It was easy and boring but a big company and a good start anyway but when I should’ve been able to grow they didn’t hire me for a transfer and I wasn’t going to wait because it was seriously boring and I didn’t work on much of team so no one knew me anyway. So I found a job somewhere else finally making an ok pay. Got laid off, went back to the other company. Got some better experience than before (paid slightly more than my previous laid off job) I also ended up training my coworker after I was the only one for a long time even when I was still new (aka doing a lot more work). My yearly “raise” was like 2.5% so I applied for a ton of jobs and left. However at the same time a manager left, yet they never tried to get me to stay by offering that I could do that job even though it was one of the managers I supported and knew about her stuff more than anyone else. Now that coworker I trained got promoted to that position and it was a quite a blow to see! They’ve been there less time than I was when I left, and I had more experience in that company before that. And I’m sure they now make more than me even when my job now is in a hcol. Sucks for me \n\nSo now my current job. I was feeling pretty good about it. It’s sometimes interesting but also can be demanding especially if/when I get promoted which I think will happen sometime this year (although I think it’s be good I’m also wary of how often they work outside of regular hours) One thing is that I make $60k which for where I live is probably still quite under the average for this position. Another thing is that the two new managers on my team I learned are both about 4-5 years younger and I feel kind of stupid. Like one of them is barely out of college and above me? There’s no way they have more experience, just maybe a little bit more time at this company than me. \n\nIt’s just very sad to realize how I should be able to make so much more by now but I’ve often taken lower jobs or less pay or not been valued. And after feeling like I was doing well but these people younger than me having a higher position that I’m basically supporting them, when overall I have more experience (and I am a good reliable worker too). Is a bit depressing because even when I do get to that level I will have spent SO much more time making less money so that compounds.",
        "created_utc": 1673984528,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to have a conversation with your bff about her partner",
        "author": "yeahhesucks",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10elb5q/how_to_have_a_conversation_with_your_bff_about/",
        "text": "[removed]",
        "created_utc": 1673984438,
        "upvote_ratio": 1.0
    },
    {
        "title": "alright talk hysterectomy to me",
        "author": "crazypurple621",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ekwy3/alright_talk_hysterectomy_to_me/",
        "text": "",
        "created_utc": 1673983535,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you celebrate your 30th birthdays?",
        "author": "EatMePrincess",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ekpfo/how_did_you_celebrate_your_30th_birthdays/",
        "text": "What did you do for your 30ths? Did anyone celebrate theirs alone? What do you do to celebrate your birthday alone when you can't go out (I'm high risk for COVID. I would love to go horseback riding which I did prior to my 20s and then didn't get to during my 20s at all. Or to a special park I have been wanting to go to all through my 20s but no one will wear a mask. Old LA Zoo? I heard it closed down to the public and I have nobody to take pics to at least document the experience.)? I don't even have anyone who can help pick up a cake so I am dropping $100 on a cake (Delivery is $45, I can't drive and no one will wear a mask on public transit. Yay me.). Wtf else is there to do?\n\nAlso, what's the deal with the birthday funeral theme and the \"Rip 20s\"/mourning youth? I have synesthesia so I wasn't gonna go with black, but I don't think there's a \"Rip 30s\". Would a \"Rip 31 or a \"Rip 38\" even sound ok if I saved the theme for a future year?",
        "created_utc": 1673983049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal finance podcasts/YT channels?",
        "author": "justsamthings",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ekoqf/personal_finance_podcastsyt_channels/",
        "text": "Hi ladies, I wonder if someone here could recommend me a podcast or YouTube channel that teaches some personal finance basics? Specifically something for beginners, and/or people who aren’t great with numbers and abstract concepts. \n\nI’m good at budgeting my income and saving money, but I don’t know anything about stuff like retirement accounts, investing, etc. I’ve tried reading some of the Wiki and FAQs on r/ personalfinance but even that goes over my head because I don’t know what most of the terms mean. So I need someone who breaks it down in a simple way. Does anyone have any recommendations?\n\nThanks in advance!",
        "created_utc": 1673983002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we fostering a \"mean girl\" culture in this group? Is anyone else afraid to make vulnerable posts here because they're afraid of being ridiculed by other women? I know it's reddit, but I thought the point of this group was to create a \"safe space\" for women to seek support from other women.",
        "author": "pimms_pup1993",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ekobo/are_we_fostering_a_mean_girl_culture_in_this/",
        "text": "Backstory, I posted here asking about the pros and cons of having a child after 40 and got some fantastic feedback from some of you, which is usually my experience here.\n\nI just saw somebody referring to my post in another thread saying that at least men \\[paraphrasing\\] weren't \"existentially stressing over whether or not their life would have meaning if they remained child free\" which is not only sexist, but pretty catty as well. Several people liked her comment and another went back to look at my post based on her comment and said it made her sad?? (I'm not going to out them, but it's easy to locate on the \"relationship free day\" thread.) Meanwhile, many of the original commenter's posts here are about how important and meaningful her job in a mental health facility is and how she's a victim's advocate and proud feminist, so what gives with the culture that's she's fostering and is clearly not alone in?\n\nShould I not have asked that question here in the first place? Should I make sure to use an alternate account every time I ask a more personal question here related to women's issues? What am I missing? Are we here to support each other or what?",
        "created_utc": 1673982975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which popular books did you read and hated or disliked in some way?",
        "author": "scottishlastname",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ekjgd/which_popular_books_did_you_read_and_hated_or/",
        "text": "I hated *The Midnight Library* and actively spent a lot of the book rolling my eyes.\n\nI also find Jane Austen novels tedious.",
        "created_utc": 1673982655,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to open up to friends about problems with a mutual friend",
        "author": "nukin8r",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ek81w/when_to_open_up_to_friends_about_problems_with_a/",
        "text": "I apologize for the length of this post, I just really need to share my feelings here.\n\nA few months ago I ended my friendship with a girl in my friend group. She’s so nice to everyone but me, and the last few months of our friendship were rough, almost cruel. No one else in our group saw the way she treated me, though they do know that we had a couple arguments that didn’t go so well. Everyone else in the group has been very respectful of my decision not to be involved with her anymore, but they’re still friends with her.\n\nRecently that girl reached out to me wanting to talk in person, I suppose to try to reconcile, though she didn’t actually say. We tried to reconcile before I cut her off &amp; it went horribly—she was manipulative, self-centered, and put the burden on me to come up with solutions. She’s apparently been in therapy for a few months now &amp; while she might be getting better, she might also have just learned to weaponize therapy language, so I’m disinclined to give her another chance. I also don’t think it would give me any closure, but maybe I could help her move on?\n\nI want to open up to my friends about the way she treated me &amp; explain to them why I can’t trust her or give her another chance. I want them to agree it was egregious. I want to ask them what she’s told them to get insight into what she wants from me &amp; use that to determine what I should do about her invitation. I want them to reassure me that I don’t have to keep trying with her. I want them to tell me what a great friend &amp; amazing person I am, and what a huge loss it is for her that she ruined our friendship. I want them to tell me it matters to them that she mistreated me. I know I sound arrogant, self-centered, and self-victimizing, but I really just want my friends’ support here.\n\nMy question to you all is, is this inappropriate to share with my friends? Is this something I should leave them out of? Is it okay for me to vent to them &amp; ask them to talk to me about? Or should I keep this to my diary &amp; my therapist? Thank you!",
        "created_utc": 1673981924,
        "upvote_ratio": 1.0
    },
    {
        "title": "ending a relationship for no reason other than to explore a new life",
        "author": "assertivelady2022",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ek5og/ending_a_relationship_for_no_reason_other_than_to/",
        "text": "[removed]",
        "created_utc": 1673981764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone remember this late-90s, early-00s “girl power” book?",
        "author": "NothingIfKnot",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ejvcr/does_anyone_remember_this_late90s_early00s_girl/",
        "text": "Not sure if this type of question is allowed but this seemed like the perfect group to ask. This is driving me crazy! I’m trying to find the title/author of a non-fiction book that I had circa 1999-2002 or so that I think was geared at tweens. I want to say the title was something like “Girl Power,” “Girls Rule,” “Like a Girl,” etc. etc. It covered various feminist topics and highlighted some famous women throughout history with some simple illustrations (the details are hazy but I can only seem to remember that it highlighted Gloria Steinem and Roseanne Barr?? Maybe Whoopi Goldberg?) I don’t think it was associated with American Girl at all but I feel like the style was reminiscent of their non-fiction books. I googled it the other day thinking it would be easy to find, but some twenty-odd search iterations later I couldn’t find the book I’m thinking of. Starting to think I invented it lol. I know this is vague but does this ring a bell to anyone??",
        "created_utc": 1673981085,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just got ghosted and I’m devastated I could use some cheering up please",
        "author": "missmemorylane",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ejrk3/i_just_got_ghosted_and_im_devastated_i_could_use/",
        "text": "[removed]",
        "created_utc": 1673980834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know the title/author of this 90s girl power book?",
        "author": "OkMoped",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ejpub/does_anyone_know_the_titleauthor_of_this_90s_girl/",
        "text": "[removed]",
        "created_utc": 1673980725,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did it go when you told your parent(s) you won't have children?",
        "author": "SmolSpaces15",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ej9h3/how_did_it_go_when_you_told_your_parents_you_wont/",
        "text": "Wanted to ask this question as I've decided I do not want children. Between the cost, loss of privacy, autonomy, and no desire to be a parent, my partner and I discussed being happy as a childfree couple. \n\n\nI (36F) come from a small family. My parents are Vietnamese immigrants. They arrived in the US as part of The Boat People in the late 70s and their families were dispersed. My father's side of the family emigrated to Australia and I have never met them and my mother's family emigrated to the US, with some people in Cali and the rest with us on the East Coast. She has 2 sisters (my aunts) who are the closest to us and they both have grandchildren (oldest aunt has 4 grandchildren and youngest has 5, my mother is in the middle). I have an older brother (40) but sadly my parents have given up on the idea of him ever having children because he has only ever had 1 gf and still lives with my father, helping to care for my half siblings (my parents both divorced and remarried many years ago). This is all as spoken by my parents. Whenever my mom sees my cousin's kids she says how much she wants grandchildren. This happens about 2-3/yr. I ignored it many times as it was happening my whole adult life but as I've now solidified my decision, I know I'll need to tell her soon of my childfree plans. \n\n\nCurious how things went for others who told their parents they didn't want children and perhaps what it was like knowing they were disappointed?  I'm not extremely close to my parents but I do love them and I know my mother being sad over this will hurt a bit. My father, he is busy with my siblings who are under 10yrs old, I doubt he is concerned.",
        "created_utc": 1673979637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movers are coming tomorrow morning and I'm a little weepy. What are your favorite songs about letting go of old stuff and embracing new beginnings?",
        "author": "NotSkinNotAGirl",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eir55/movers_are_coming_tomorrow_morning_and_im_a/",
        "text": "It's a positive move - headed back to the East Coast, to a place where I have lots of friends... got a great new job with a decent pay increase... gorgeous apartment. But moving always makes me nostalgic, and kind of gives me the sads. I'm putting together a playlist for the 9 hour drive tomorrow... would love to hear what songs soothe you when you're stressed about change.",
        "created_utc": 1673978460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you meal prep for the week?",
        "author": "disruptivelychill",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ei3k5/do_you_meal_prep_for_the_week/",
        "text": "I've recently discovered that I would absolutely LOVE to meal prep for the week and am starting to gather insights, recipes, and strategies. During the week I have little time to cook (zero at all for lunch) which leads me to basically eat out for lunch almost every day in a place close to where i work. So the idea to prep all meals on a Sunday afternoon is very appealing, for financial reasons (trying to start budgeting for real this new year, as I've always been pretty \"spontaneous\" with money lol). I understand it's relatively common and i am late to the party, but am curious to learn more in order to optimize. Do you do it? What meals do you prepare? Any healthy and easy recipe you'd like to share? How do you handle the conservation? Other tricks and tips?\n\nAs a baseline I was thinking to oven a generous amount of veggies and put them in the fridge, along with boiled eggs and beans hummus for example. I'd prepare cereals like Quinoa or integral rice and would have enough for roughly 6 days. I'd prep also an apple cake with no sugar as a dessert for the entire week.",
        "created_utc": 1673976913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about single guys and their families",
        "author": "positivelylooking",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ehg1d/question_about_single_guys_and_their_families/",
        "text": "Hello all women out there!\n\nI have a question about how important it is for a single guy to have a family of his own?\n\nFor some context of this question, and honestly one aspect of it that I believe is personally undesirable. My case is that my family is essentially either broken due to holding hardcore Italian grudges against each other, or that we all live very far apart. My mother and father split up many years ago, my mom lives in the same state as me (Illinois) and my father lives in Vegas. Basically my father left my mom, and after 8 years, he is now divorcing who he left my mom for, and had two children with her. I grew up an only child, and I did NOT get along with my fathers wife, she doesn’t care much for me either, so my Dad is trying to foster the relationship between myself and my half brother and sister.\n\nPlease understand that I’m all for being there for my brother and sister, but they are so young (5 years old, twins, and I’m 35M). So it’s new and at times odd for me, and their mother loves to tell them I’m not their real brother, but their half sister is her real sister (her first born daughter 34F). I know how these things go, so I reserve myself from getting to close as they get older so I don’t get too emotionally involved.\n\nEssentially I live on my own, without anybody’s support, emotionally and financially. I’ve had exes in the past exclaim that they were pretty concerned with me not having a family. They always do this right before they’re going to break up, usually within a year. I find it kind of funny it takes them that long to have an issue with it, when I’m very up front about this. I don’t feel it’s a good idea to hide or lie and I know I’m weeding myself out when I do it but it’s just better to be honest. I shield my girlfriends from all of the drama and only let them know when they ask how things are going.\n\nHonestly, I feel like this is the number one thing that will keep me single and not allow me to meet a woman that I like, who values family a great deal as I do but only because I want to create one myself. I can always feel it when I explain it that they feel pretty uneasy and it’s not exactly attractive.\n\nSo rounding back to my question, based upon my own situation, is it fair for me to expect that this may be a dealbreaker for most women that I don’t have a firm relationship with my family, and is it a concern for most women?",
        "created_utc": 1673975351,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a hobby life has gotten in the way of that you’ve resolved to get back into in 2023?",
        "author": "breemartin",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10egpt7/what_is_a_hobby_life_has_gotten_in_the_way_of/",
        "text": "For me, I was always an avid reader and writer. I have really allowed those hobbies to fall to the wayside as I’ve gotten more entrenched in my career. I have also battled depression which has made it difficult to do things I enjoy at times.  Therapy has helped get me back on track.\n\nThis year I am resolving to read more and journal. What are some former loves you’re rekindling this year?",
        "created_utc": 1673973613,
        "upvote_ratio": 1.0
    },
    {
        "title": "HPV, disclosure, and ex-girlfriends...",
        "author": "kl00",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10egmeo/hpv_disclosure_and_exgirlfriends/",
        "text": "tl; dr: My ex made a pretty harsh comment regarding \"giving her an STD.\" The delivery felt inconsistent with my understanding of HPV strains that don't involve herpes/outbreaks. I'm 95% sure she's the asshole but am looking for feedback.\n\nStarting at the beginning: My (currently 34F) first pap smear after being with a new partner (who became my partner for almost 3 years) came back irregular. This was over two years ago and was a first for me. It was my first pap in three years and there had been probably 5-7 partners between those paps. Clearly somewhere along the way I came into contact with HPV. I did all the things...follow up and monitoring, and the irregular cells resolved themselves. Both of my doctors -- my PCP who did the pap and the OBGYN I was referred to -- were so clear and consistent that this is part of life now. We caught the changes as part of routine care, we monitored, it went away. I had come into contact with one the HPV strains and this is how it goes...that's how it felt to me. I handled it. I specifically asked my PCP if this is something where I need to call recent partners. She said no, that the strain showing for me wasn't aggressive and wouldn't result in genital or oral herpes. The specialist broke everything down into the five stages of progression toward cancer and all of the management at each stage. He was so responsive to the idea of cancer being a scary thing but also super clear about how the field is increasingly confident dealing with this stuff in early stages. My understanding at the time was that this was routine healthcare, the system working as designed for sexually active people.\n\nMy ex's first pap smear after being with me also came back irregular and was resolved in a similar fashion. Technically, SHE could have given it to ME, right? We started sleeping together and a few months later both receive an irregular pap. Who knows, right? My position is that the conversation about who and what and when is irrelevant. The point is that we rely on routine care to be healthy. We caught it. We both had great doctors. Moving on with life.\n\nCoinciding with this timeline is greater awareness and maturity in my sexual self. Five years ago I did not understand the difference between herpes and HPV in general. My understanding now is that the majority of the sexually active population has or will have one of the many strains of HPV; having HPV doesn't mean you have herpes; if you do have herpes, it's right to disclose to partners before sex. It's not cool to shame people with herpes and it's not the end of the world sexually. Part of being sexually active means taking responsibility for your healthcare: regular STI testing and staying on track with the doctors who care for sex organs. This is where I am with all of this; I'm open to feedback on areas where my understanding is off.\n\nFast forward to the comment made recently: We broke up and things haven't been all regulated and unmessy in the aftermath. The comment was made alongside my ex grilling me on if I had slept with someone recently (we are broken up so if I have, it's my business). The whole conversation felt wrong but then she literally said, \"and you gave me an STD.\" It felt malicious and like she was using something to situate herself as a victim of something I'd done. She also made a comment implying that we (me and the other person) are both nasty, due to my past with HPV and their history of yeast infections. The whole conversation felt inappropriate. My ex also implied that I would be wrong if I didn't disclose to future partners that I had an irregular pap and clearly encountered an HPV strain in the past. This is inconsistent with a question I specifically asked my doctor at the time, and inconsistent with my general understanding of HPV in society right now.\n\nIn my most recent STI panel they didn't even test for HPV. The nurse said it's so common and assumed that everyone has something.\n\nSo, am I the asshole? Do I need to disclose that I had an issue with this in the past? Am I right that the whole premise of the comment/conversation was wrong? I take consent and communication in sex as seriously as we all should so if this is something I need to integrate into my future, I look forward to being that better version of myself. Thanks in advance.",
        "created_utc": 1673973379,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I (29M) Help My Girlfriend (34F) Who Seems To Be Struggling With Body Image Issues?",
        "author": "EMECOR",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10egfjf/how_do_i_29m_help_my_girlfriend_34f_who_seems_to/",
        "text": "My girlfriend has been showing what I believe to be signs of distorted body image (ain't a shrink or an ED expert so I'm spitballing here). She ain't obese or nothing but is a bit on the plump side, and I love that about her. But she makes frequent comments about how she eats too much and I've caught her looking at herself in the mirror a couple of times in what's obviously a body check, though I didn't say nothing about it at the time. She does go to the gym and sometimes we even go together since we both love doing it, but she ain't obsessive about it. She ain't there 7 days a week or nothing.\n\nThing is we ain't been together all that long so I’m still figuring out what she responds to and how she communicates, and it feels rude asking straight up about it at this stage. What I really want to do is tell her how sexy she is but I know some folks don't like being told they're wrong about themselves even if it’s meant to be encouraging, plus I figure a topic like this could get dicey real fast so misstepping this early on could mean stepping on a landmine. What I do now is laugh a bit at her comments about herself with a half-joking \"now that's just crazy talk\" kinda response. Usually she laughs but I wonder if that's really helping.\n\nAlso don't know if this matters at all but she's Pakistani and was raised Muslim and another friend of mine from that part of the world told me it ain't uncommon for young women to get negative comments about their figures, skin tone, and just about everything else from their own family coming up. I know that happens stateside all the time but apparently it can get pretty nasty over there. Ain't met her family so got no clue if that's true about her though.\n\nWould like any input, especially from folks who also struggled with body image shit and what your partners, friends or family did or didn’t do that genuinely helped. Some other folks in other subs mentioned complimenting things like her intellect or the clothes she wore that day (things she chooses) and I been doing that. Seems like it helps.\n\nThanks y'all in advance.",
        "created_utc": 1673972903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we have a dating/relationship free posts day?",
        "author": "thatoneladythere",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10efebd/can_we_have_a_datingrelationship_free_posts_day/",
        "text": "It's becoming a bit overbearing.  Or if someone knows of a sub for women over 30 that's for single people without constantly bringing up the fact that I'm single. I really like this sub, but there's so much more to life than relationships with men.",
        "created_utc": 1673970344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dipping my toes in…",
        "author": "Ms_Sally_90",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eedv6/dipping_my_toes_in/",
        "text": "Alright ladies! I need some help. I am early thirties, widowed, single mom and after a recent encounter realized I am more ready than I thought to put myself out there to maybe find a FWB or something more. I was with the same man forever and a day so I have 0 idea how the apps and whatnot work. I’m working on getting over my fear of judgement of people’s ideas of me moving forward. I deserve happy and companionship. I learned I am most definitely not a gal that wants to hook up once and then see ya. I need something a little more invested than that. Any and all suggestions are helpful!",
        "created_utc": 1673967749,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you most proud of?",
        "author": "ColoringFrenzy",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ee92h/what_are_you_most_proud_of/",
        "text": "What’s your biggest thing that makes you feel pride? Can be family, work, social or you can pick a couple!",
        "created_utc": 1673967432,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm spiralling again",
        "author": "queenkik",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ee2vq/im_spiralling_again/",
        "text": "Posting here again, cuz it feels better than to keep it bottled in, and feels like I'm going to burst. \n\nSmall recap: I (F38) married to my husband (M47) for 20 years, have 5 kids ages 11-19 and we potentially reached the end of our marriage. \n\nOur relationship feels like on constant survival mode, doesn't feel calm, peaceful, welcoming or homey. In reality, it wasn't peaceful in the past either, but shame, fear and hope kept us going. \n\nI'm constantly on edge, and have almost completely closed myself up. I started therapy 1.5 years ago and have learned a lot about myself and grew as a person, yet the more I grow and work on myself, the more we drift apart. And my husband is deeply hurt, since he doesn't see where he fits in my life, which is a really valid concern, that I can't fully reassure. \n\nI don't feel emotionally safe with him, and have a really hard time forgiving him for his past behaviours. He has stopped in the past couple of months, and promised to never repeat his actions, but I came to a point where I have zero expectations from him. \n\nFor years I begged him to work on his issues with me and the kids, and now it feels too little, too late. \n\nHe's still hopeful that this relationship can be repaired, but I kinda lost hope, and I'm dying inside. \n\nWe're currently in MC, we both agree this is our last chance to save our marriage, but I am beyond exhausted.\n\nWe put sex and physical intimacy on hold, until I feel emotionally safe with him, which gave me some clarity at first, but now everything feels murky again. The self doubts are the absolute worst, and are draining me. \n\nWhat do I do?",
        "created_utc": 1673966987,
        "upvote_ratio": 1.0
    },
    {
        "title": "The BF that didn't get me an xmas gift.",
        "author": "maybeitsmeoryou12",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10edwam/the_bf_that_didnt_get_me_an_xmas_gift/",
        "text": "So he felt bad, told me to pick something out. I feel weird asking for something but he asked me to. I said I'd like a gifr card from this place to get a jacket I like. This was 4 days ago. He didn't do anything all weekend. Shouldn't he have gone online to get it right after? He has money, either he forgot or doesn't care. \n\nI don't even want something at this point.",
        "created_utc": 1673966515,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who are child free by choice....",
        "author": "gousebeerleegd",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10edsui/for_those_of_you_who_are_child_free_by_choice/",
        "text": "[removed]",
        "created_utc": 1673966250,
        "upvote_ratio": 1.0
    },
    {
        "title": "What small kind things do you do for your future self to make your life easier?",
        "author": "bluebuckeye",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ed8cg/what_small_kind_things_do_you_do_for_your_future/",
        "text": "I was reading the book \"How to keep house while drowning\" by KC Davis recently and the author spoke at length about reframing the idea of certain household tasks as a kindness to future you instead of \"chores\". The idea that you know what you will need in your home for it to be functional tomorrow, so you get it in a state before you go to bed so you won't have to deal with it in the morning. I really like thinking of these things this way, and have definitely remarked that past me was kind to future me for doing or buy a thing that I am now enjoying. For instance, I keep a fully stocked travel toiletry kit, that I replenish after each trip, so that I don't have to worry about whether I remembered my tooth brush or not. I also run the dishwasher every night, regardless of whether it is \"full\" so that dishes are ready to be put away in the morning to give me an empty dishwasher to accept whatever I need to throw at it.\n\nWhat are some of the small kindnesses you do for future you?",
        "created_utc": 1673964750,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (21M) ex (25F) has been telling people how big my penis is",
        "author": "throwra7377rhr",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ed0ll/my_21m_ex_25f_has_been_telling_people_how_big_my/",
        "text": "[removed]",
        "created_utc": 1673964168,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling like I have no control (no friends partner or family of my own)",
        "author": "ImportantComposer383",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10eap8m/feeling_like_i_have_no_control_no_friends_partner/",
        "text": "Some days I wake up feeling angry and agitated. On paper my life is fine but my personal life feels like a whole different story. My inner circle has dwindled over the years making me feel disconnected from people and like I have almost no social support. On top of that I’ve been single coming up four years and can’t seem to catch a break in that department either. This is not where I thought I would be in life and although I am actively working towards change I am tired and disillusioned. I’m trying really hard not to compare myself to where other people are at but find it hard because I want friends and a partner and family. Over the last three years I’ve worked hard to make new connections and fallen flat each time. I’m feeling frustrated because I feel like I have zero control over my life in these areas and it sucks!",
        "created_utc": 1673957270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does everyone gain weight after hysterectomy?",
        "author": "Iris_pallida",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e9qza/does_everyone_gain_weight_after_hysterectomy/",
        "text": " I'm 34 and might need a hysterectomy at some point because of  adenamyosis. I'm petite and in very good shape. Terrified of gaining  weight, if I opt for the surgery. Also terrified of back problems, hair  loss, greater risk of Alzheimer's, heart disease, osteoporosis, organ  prolapse, potbelly, shorter waist, wider hips, and rapid aging. I would  be keeping my ovaries. My physical fitness is incredibly important to  me, it's not just vanity. I don't want to lose my figure. Is it possible  to have a hysterectomy without gaining any weight at all, even 10+  years down the line? I eat a very healthy diet and walk a lot.",
        "created_utc": 1673953993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you date someone who frequently posts videos on tiktok?",
        "author": "serengazer87",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e9a5f/would_you_date_someone_who_frequently_posts/",
        "text": "How would you feel if the person you were dating / in a relationship with was posting a few videos on tiktok every few days? Perhaps if you didn't realise the extent of it when first dating?",
        "created_utc": 1673952303,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I forgive someone if they've shown no remorse?",
        "author": "rose_shows",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e89ut/how_can_i_forgive_someone_if_theyve_shown_no/",
        "text": "It's been 27 years and the resentment still eats me up. As a mum I see things from her perspective now and realise what she did was even more malicious than I'd thought. How am I supposed to let this shit go when I can't forgive them, and how can I forgive them if they've never apologised?",
        "created_utc": 1673948570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coping with loneliness, single and living alone",
        "author": "1ngleB",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e85f0/coping_with_loneliness_single_and_living_alone/",
        "text": "Hey everyone,\n\nLooking for advice that goes beyond \"learn to love being by yourself\".\n\nI (31f) was living with my boyfriend for two years until a year ago, when he broke up with me and moved out. We tried getting back together, but were long distance all of last year, and I continued living alone in our old flat. We recently broke up for a final time.\n\nI've been extremely lonely for all that time. I work from home, and spend large chunks of the week by myself. I exercise when I can find the time. I really love my job, and I try to be social and go out with my friends (even by myself if they're not free) as much as I can, but it only helps a bit.\n\nBasically, the advice I get ranges from \"you should learn to like being by yourself\" and \"you're not alone, you have your friends and family\". But every time I wake up in an empty bed and an empty house, or have to occupy myself alone late at night, I feel isolated.\n\nI have realised that I really am happiest in a relationship, and that I prefer living with my partner. I can keep myself busy as much as I like, but I fundamentally dislike being single and living solo.\n\nI'm trying to date but the dating apps are getting me nowhere so far. That just compounds the loneliness. I'm worried that I won't ever meet anyone and this will be my life forever.\n\nHave any of you felt the same way about being single in your 30s? How do you cope with the loneliness?",
        "created_utc": 1673948100,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m planning to end a situationship that feels like a relationship and I’m sad.",
        "author": "starboxB",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e7apx/im_planning_to_end_a_situationship_that_feels/",
        "text": "I guess this isn’t really a question more so just looking for support. Like many of us out there, I started seeing a man who isn’t ready to be in a relationship. He’s pretty on par with what I look for in a guy and we’ve gotten really close over the last few months. \n\nWe had a conversation today where he said he feels guilty about dating others (since we are technically single and casually dating). Neither him nor I have dated anyone since we started seeing each other, but I’m starting to feel a little like a fool. I had some hope he would possibly change his mind bc of how close we’ve gotten (and it really does feel like a relationship), but this conversation made me realize that I’m probably chasing after someone that just isn’t ready. It’s hurtful, and he’s a great guy, he’s only been nothing but honest, but the relationship is causing me more anxiety than happiness now. \n\nI’m sad tonight, and I know I will be for a bit. I plan to talk to him later this week. Any kind words are welcome. This sucks.",
        "created_utc": 1673944957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Topic increase emotional connection with women",
        "author": "Internal_Quiet9",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e64rf/topic_increase_emotional_connection_with_women/",
        "text": "[removed]",
        "created_utc": 1673940614,
        "upvote_ratio": 1.0
    },
    {
        "title": "what insecurities women start to feel or experience after 30?",
        "author": "Internal_Quiet9",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e5ppb/what_insecurities_women_start_to_feel_or/",
        "text": "",
        "created_utc": 1673939110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Too Late to Start BC to Delay Period?",
        "author": "trashbinfluencer",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e2z5c/too_late_to_start_bc_to_delay_period/",
        "text": "Looking for thoughts on manipulating my period date. You'd think I'd have the hang of it after having my period for 20 years but here we are. Any advice is appreciated!\n\nI spent basically all of my late teens and 20s on hormonal bc. Stopped taking it this past year and overall I've been very happy off of BC... until the last month or so where the timing could not be worse.\n\nDec 4 - 9: Overlapped with a bikini-heavy girls trip😭\n\nDec 31 - Jan 4: NYE😭\n\nThe next likely start date (Jan 27-28 I think) means it will likely run straight through a long overdue romantic trip with my partner😭😭😭😭😭😭 \n\n**Question:**\n\n- Is it too late too start taking hormonal BC (aviane) to try to delay it? How likely is breakthrough bleeding? \n\n- Any Other tips for delaying it or jumpstarting it?",
        "created_utc": 1673930248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just moved and wondering what other women do with limited bathroom space",
        "author": "noxious_toast",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e2yda/just_moved_and_wondering_what_other_women_do_with/",
        "text": "As the title says: we just moved, and for the first time in my adult life I have teensy little vanities in both bathrooms. Like no counter space: the whole countertop is taken up by the sink. Besides ordering medicine cabinets and floating shelves, what are my options? Where do ya'll store your makeup/bottles/hair dryers/etc.?",
        "created_utc": 1673930184,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most difficult aspect of that which you are most passionate about?",
        "author": "PuzzleheadedPerson8",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e2uzh/what_is_the_most_difficult_aspect_of_that_which/",
        "text": "Whether it’s mental, physical or emotional. What do you find most difficult about the thing you are most passionate about?",
        "created_utc": 1673929913,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do/did you leave someone you’ve been with for a very long time?",
        "author": "pqrstyou",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e2p76/how_dodid_you_leave_someone_youve_been_with_for_a/",
        "text": "My friend (35F) has been with her partner for well over a decade. They are not married, and do not live together at the moment, though they have in the past. She is not happy, but also will not move forward. (The two of them are very codependent, in my opinion. Not healthy.)They  were in each other’s lives even before they dated, and essentially grew up together, so I know they are very bonded and share a lot of memories. But, despite all this,  I have had to listen to her talk about her relationship problems for several years. This is a dead end relationship (and has been for a long time) but she won’t make a decision. It is clear at least from an outside perspective that this relationship does not have a future, as they want very different things…but it’s like he has her under a spell. She will tell me they’re breaking up, and immediately go right back into the relationship. There has been no talk of marriage as far as I know, and I hope they do not plan on it. He’s a really nice guy, but he’s to not right for her, (according to her) she’s knows it, but she is so attached to him that she stays put.\n\nWhat would you say to this friend to encourage her to choose herself??",
        "created_utc": 1673929425,
        "upvote_ratio": 1.0
    },
    {
        "title": "When You Were a Kid, Were Pro ED Sites Common To See, or Did They Have to Be Sought Out?",
        "author": "lorena302",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e292d/when_you_were_a_kid_were_pro_ed_sites_common_to/",
        "text": "I’m  gen z and I saw some older people say that magazines straight up had cotton ball diets and pro Ana sites were everywhere. How true is this, and did it have to be sought out like it does now? I’ve struggled with eating for about 4 years, and I don’t think those ED spaces are really known by most of society nowadays.",
        "created_utc": 1673928101,
        "upvote_ratio": 1.0
    },
    {
        "title": "What hobby do you share with your significant other?",
        "author": "sqrmarbles",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e28uk/what_hobby_do_you_share_with_your_significant/",
        "text": "",
        "created_utc": 1673928086,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is settling and what is exploring when it comes to dating?",
        "author": "Literatelady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10e142t/what_is_settling_and_what_is_exploring_when_it/",
        "text": "So I have a problem where  I'm very unsure of my gut, and what my gut is saying when it comes to everything, but mainly dating.  I had three dates with this guy and I've decided to keep going with it because I think he's a really sweet guy, he's cute and I find him very easy to talk to. I'm not quite sure if we \"gel\", like it's not a natural click - there is a bit of awkwardness still. I also have hang ups about femininity and masculinity. I feel very masculine and he is more slight, and comes across more feminine and smaller than me (as I perceive myself).  \n\n\n I'm going to continue to explore where this goes, but I guess I feel guilt for having these critical thoughts, like if he were \"the one\" I wouldn't have these thoughts. And I don't believe in \"the one\" but I do believe there are people you just click with and go bang. I just don't want to feel like I'm settling and I don't - but it's like if you find a top that fits pretty well, but it's not a perfect fit - like maybe you need to gain or lose 10 pounds? And is that settling or am I just doing a completely normal thing, and taking it day by day even when I do have doubts? Also I am just crippled by doubts in general so maybe I just have to accept this is the way my brain works. Has anyone struggled with something similar?",
        "created_utc": 1673924876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Words of wisdom for someone who doesn’t love their partner’s family?",
        "author": "burgerzandburpeez",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dzkk8/words_of_wisdom_for_someone_who_doesnt_love_their/",
        "text": "As a 31 y/o woman who’s mother is very out of touch with reality, I have grown to love this sub. The feedback I read and personally receive is always so insightful so I figured I would seek some advice.\n\nI have been with my partner for close to 2 years. He is amazing and everything I could have ever hoped for. Here’s the kicker… his family is… not my favorite.\n\nThey don’t know how to handle money and ask my bf for help. They don’t pay back 100% and he doesn’t say anything because “he is still on their family phone plan.” They lost their home to foreclosure 15 years ago and spend money present day as if they don’t live paycheck to paycheck. \n\nThe best way to describe his mother is “loopy.” She tells the same stories over and over again and when we say goodbye to leave, it is literally a 30 minute process. She’s in her early 50s so it’s not like she’s elderly and completely out of it. She never stops talking. Ever. And if I can manage to squeeze a word in, it’s not acknowledged and she just continue ranting on and on about something. Everything is always about her. \n\nHis sister has a harsh, strong personality and is very possessive of him. He and I split Xmas this year — while we were at my dad’s she texted him repeatedly asking when he was leaving to head to their parent’s house. He had already been at their parent’s house all morning and afternoon but took a few hours to spend time with my family at my dad’s. \n\nHis dad is weird. Doesn’t ever NOT have booze in his hand. Don’t think I’ve ever had a real conversation with him… ever.\n\nI know this sounds extremely judgmental. I don’t mean to sound better than anyone else, but we spend a lot of time with them and it’s starting to weigh on me that I’m going to have to endure this forever. I don’t intend on ending things with him just because I don’t love his family. I guess I’m just looking for advice here!",
        "created_utc": 1673920642,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those in the 9-5 corporate world, what does your schedule look like from 5pm until you go to bed?",
        "author": "svpcc95",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dz7q1/for_those_in_the_95_corporate_world_what_does/",
        "text": "I work a traditional 9-5 and have been doing so for five plus years. Even years in, I find myself anxious in the evenings after work, trying to “feel productive” and “make use of that time”. I’ve always wondered what other women do with their time and how they feel at ease. \n\nI’m an introvert who happens to be a manager which is extremely draining for me. I am a work-to-live type of gal who really appreciates the income and I’d say I have, perhaps unhealthily, a focus on building my life for the future so even though my job doesn’t light me up inside, it does fill a particular need. Knowing myself, I need down time and recovery time after the work day and typically don’t have the energy to go back out after 5 pm unless it’s to the gym (thank you endorphins). BUT like clockwork, anxiety kicks in and I have these internal thoughts that I should be doing something that’s “ for me” after work since I give 8 hours of my day away to the corporate world. \n\nSometimes I wish I had more nuance after work besides going to the gym, cooking dinner at home and then watching a show before going to bed. Yet I can’t imagine finding the energy for something else. \n\nDid you experience this discomfort? Have you made peace with it? What defines your evenings?",
        "created_utc": 1673919689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really need some support",
        "author": "GlitteringExcuse2997",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dz7lf/really_need_some_support/",
        "text": "I'm sorry, I don't know where else to put this. I'm really struggling and need help, it feels like everywhere else on reddit is cruel or uncaring.\n\nI have body dysmorphic disorder and autism. My boyfriend just dumped me because of my poor self image. I'm getting stuck with double rent since he's moving out and I don't know how I'll afford groceries much less anything else. My sister tried to sabotage my plastic surgery prospects, she only \"won\" because of the breakup. I'm getting banned from subreddits looking for help. This is all in my post history if you need context.\n\nI talk to friends and family and that doesn't make me feel better. Internet strangers make me feel worse. Therapy is moving at a snail's pace.\n\nTurning 30 was the worst thing to happen to me. My face is changing for the worse, my past ex's would think I'm disgusting now (this is important to me because everyone says that after you get dumped you need to \"glow up\" to make them feel bad. Most of my ex's were abusive so I hate to reaffirm their decision to leave). I'm being messy on the internet trying to find someone who will make any of this make sense or try and make me feel better. I feel like I'm losing my mind.\n\nI think the world sees me as an crazy old ugly woman, and the worst part is they're right. Life is just suffering and I have nothing to look forward to any more.",
        "created_utc": 1673919678,
        "upvote_ratio": 1.0
    },
    {
        "title": "dates how often just curious",
        "author": "novmum",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dxsds/dates_how_often_just_curious/",
        "text": "more so those with children(so would need to arrange a babysittter)..how often do you and your partner go out on dates nights like going out to dinner then doing something after.",
        "created_utc": 1673915879,
        "upvote_ratio": 1.0
    },
    {
        "title": "If money wasn't an issue, what would you do?",
        "author": "Nataliaherself",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dxkzn/if_money_wasnt_an_issue_what_would_you_do/",
        "text": "If you didn't have to worry about work or money, what would you want to do with your life? What would you be passionate about? And if you did choose to work, what kind of job would you want to have?",
        "created_utc": 1673915348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any suggestions on when to book a trip to Mexico? we are thinking Puerto Vallarta in January 2024. good idea or na ? TIA",
        "author": "vanedahlia23",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dxjne/any_suggestions_on_when_to_book_a_trip_to_mexico/",
        "text": "",
        "created_utc": 1673915249,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice on egg freezing?",
        "author": "Comfortable_Load_688",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dvwut/advice_on_egg_freezing/",
        "text": "i (37f) recently got out of a trauma bond relationship, which i seem to be attracting, likely due to unresolved past trauma/old conditioning that i am now processing with therapy, meditation and journalling. i have no interest in dating in the mean time, while i focus on healing and reconnecting back to my authentic self. i’m not sure when i’ll be ready to start dating again because honestly just the thought of it exhausts me.\n\ni had excision surgery for endometriosis a few months ago and my surgeon advised me to freeze my eggs. i always thought i wanted kids but now i’m realising it may just be the external pressure of society expectations. i am learning to be OK either way because i really don’t see myself meeting someone i want to raise a child with anytime soon. however, i am seriously considering egg freezing because i think that would take the pressure off and keep that option open in case i decide i am ready for it in the future. \n\nwould love to hear from someone who had this done share their story and the process? how long does it take to prep for it and how much down time should i expect after?",
        "created_utc": 1673911229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I suddenly worried that my partner will kill me even though he is not violent?",
        "author": "LadyWithABookOrTwo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dv9wo/why_am_i_suddenly_worried_that_my_partner_will/",
        "text": "Ive been married for neary 3 years and have a less than 12 month old baby. When I was younger I was in an abusive long term relationship (he was abusive physically, mentally, verbally and emotionally) and it took years to recover from that. I went to therapy, read about the dynamics of abuse, volunteered for a womens shelter and am now working in the field.\n\nMy husband has never been physically violent and is not controlling in any way at all. He lets me manage all our finances and lets me do whatever I want in general. He is a decent guy and a great father and has good morals. He is very unselfish and always helping others and doing anything for everyone. He never complains or asks for anything.\n\nThe things I have struggled with is his 0 to 100 temper. We can be talking about something and he can suddenly get really worked up and raise his voice and become so annoyed he wont let me speak and he wont lower his voice even when I ask him to. He will eventually leave the room swearing and come back later when he calms down. This happens almost everytime I try to bring up an issue or discuss how Im feeling bad about something.\n\nHe also likes to pinch and grab me playfully which never feels nice as he uses too much force. He doesnt know how to touch gently. He does it when were having a good time, laughing and having fun\n\nAnyway postpartum has been rough and Ive suffered from mild PPD. Weve had arguments as all couples do after having a baby and we just dont have much time to spend together anymore. I do most of the stuff at home and look after the baby and he feels a bit forgotten and neglected due to which he has become a bit disconnected and cold\n\nLately (the past month) Ive developed this horrible gut feeling that hes gonna do something to me and I dont know where its coming from. Why are my instincts warning me about this? I cant figure out if something has triggered an old trauma or if my gut feeling is telling me something valuable",
        "created_utc": 1673909770,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some tough love please. Why should I move on from a man who is married?",
        "author": "littlestd0nut",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dtvpd/i_need_some_tough_love_please_why_should_i_move/",
        "text": "I met a man on Reddit who I fell in love with and he turned out to be married. I keep feeling like he was maybe my one shot at love because we were incredibly compatible and I cannot stop thinking about him. I need my fellow women over 30 to talk some sense into me. Why should I move on? Why was this never going to work? Give me some tough love.",
        "created_utc": 1673906640,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when you know someone is not happy with you but they won’t tell you what you’ve done?",
        "author": "Chemical-Heat3055",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dthdl/what_do_you_do_when_you_know_someone_is_not_happy/",
        "text": "I’ve had a few days of cold, uncomfortable vibes from my aunt. \n\nI don’t know what I’ve done and I’m so anxious to be with her. \n\nI actually feel like it’s punishment via a passive aggressive way. And the urge to confront her is growing and growing. \n\nBut I know if I do and I get emotional she will unemotionally respond with “there’s nothing wrong”. \n\nI think it’s really unfair to be put in a position where you can feel there is a change in their behaviour towards you and you just have to tiptoe around this elephant in the room. \n\nI feel like she’s making sure I don’t do whatever I’ve done to her again. \n\nI’m so upset and confused and concerned.",
        "created_utc": 1673905837,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some tough love please. Why should I move on from a man who is married?",
        "author": "littlestd0nut",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dtarn/i_need_some_tough_love_please_why_should_i_move/",
        "text": "[removed]",
        "created_utc": 1673905488,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Advice) What's the best yet affordable menstrual heating waist belt device?",
        "author": "Desperate-Proof-3213",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dsp8i/advice_whats_the_best_yet_affordable_menstrual/",
        "text": "I used to have insanely bad cramps when I was around 19-20 (now I'm soon 25) and didn't have the luxury to buy such a device. Can someone recommend me a good but affordable brand? Also importantly that ships to Bosnia &amp; Hercegovina. Anything that I find on Amazon, the shipping would be higher than the product itself for a shopping to Bosnia. Your advice is much appreciated.\n\nThank you.",
        "created_utc": 1673904442,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need some tough love please. Why should I move on from a man who ended up being married?",
        "author": "littlestd0nut",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dsl1y/i_need_some_tough_love_please_why_should_i_move/",
        "text": "[removed]",
        "created_utc": 1673904248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on friendship in difficult times",
        "author": "Kot_Leopold_Ya",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ds7dx/advice_on_friendship_in_difficult_times/",
        "text": "Buckle up because it’s a long story..\n\nI met a friend about 10 years ago when we were both newish to town. She was smart and super friendly and basically adopted my introverted self and made me part of her group. I think she liked that I was foreign, and she was really into travel and having an international friend group.\n\nShe invited me on trips, and parties, and we’ve been through a million breakups together. She’s a good friend when it comes to being reliable, knowing the right thing to say, and organizing hangouts. I introduced her to my friend group and she became good friends with another friend of mine from India. We were a good three person friend group. Things were well. \n\nNow.. things went sour went my mom got sick. My friend from India was planning her wedding (in India) at the time and while it was clear I couldn’t go, my extroverted friend was expecting to be invited. Neither of us was invited. My friend from india said it was rushed and they couldn’t accommodate international friends (even though both her husband and her live in the states, and her husband is American, and she’s been here for 10+ years). \n\nI wasn’t as offended by the lack of invite, but I was really turned off my the fact that she kept bitching &amp; moaning about her parents choice of flowers, and how the reception is now 100 people, etc. to me literally the week my mom died (my marriage was also falling apart at the time and she very much knew). \n\nI tried to say “be a reasonable person” and keep the friendships going, but my extroverted friend wasn’t having it with the lack of an invite. She sat down the Indian friend and said their expectations of a friendship are different and she can’t be friends with her anymore. So our friend group was cracked.\n\nWhen I came back to the US after my mothers funeral, I tried to keep both friendships going. I was disappointed that this whole drama had to unfold while I was grieving my mom and getting divorced, but it was what it was. My Indian friend continued to be insensitive, and pressed me to pick sides. She blamed my extroverted friend for being a racist bully American, which I thought was a bit much. I got tired of her never-ending drama and insensitivity and cut ties with her too.\n\nNow I was down to one friend, my extroverted friend. She always knew what to say when it came to grief, and was there for me during the divorce, but… she was an extrovert who lost a friend, so she needed to make some.\n\nShe started a new meetup group and immediately got 12 new friends. Every time she asks me to come by to hang there are 5+ people there, half of whom I do not know. Considering I am still healing, I was looking for a friend to sit with me and talk, not a group of people who want to dance or whatever. Sometimes I snapped. \n\nIt feels like she made our friendship conditional to me being able to hang with 10 other people at the same time. I feel like I will never see her one on one again. After already losing my mom, my husband and my other best friend this year, I’m wondering what the hell is wrong with me. \n\nI’ve always been shy and awkward but after 30 I felt like I finally figured it out. Now I find myself rather abandoned by all important people at the worst possible time.\n\nI’m still friends with my extroverted friend, and she invited me to a ski trip next weekend. It’s 12 people, half of whom I do not know. I had to pay $100 to go even though it’s her house because she wants to get a cleaning service (it’s a big house that she normally airbnbs). She sent 2 pages of instructions and asked us to pay $5 if we want breakfast. She asked us not to bring food because the kitchen is too small. I asked if I can bring my dog. She said no. I can’t decide if I should go, or not go and never talk to her again.",
        "created_utc": 1673903623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth the investment to finish a business degree over 35 when you’re already making 6 figures?",
        "author": "pineapplepredator",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10drz96/is_it_worth_the_investment_to_finish_a_business/",
        "text": "I apologize if the details are a bit specific but I doubt I’m alone in this situation so hopefully others can relate. I’d love some strategic advice. \n\nI’ve worked my ass off to get here over the past 10 years and I’m now making 6 figures in a major city. This is just enough to survive comfortably so long as the rent doesn’t go up more but certainly won’t be enough to ever retire. \n\nThe business degree program I found is online, from a great university, and would only take 14mo. It’s $30k which would mostly clean out my savings. \n\nMy reason to get a degree is simply to continue to survive. I’m worried that not having one is going to become an issue as I get older. My age and lack of degree becoming dings against me in a sea of applicants. \n\nI am very good at what I do but my career is definitely no passion of mine. All I’ve ever really cared about is family, friends, painting. At 37 with no family options in sight and a dwindling social life, my career is unfortunately all I have. \n\nI’m having doubts about the opportunity cost of it taking up these critical years of reaching my actual goals of having a family while potentially having little impact on my career. I’m wondering if the money/time is better spent elsewhere. Im thinking I will try it out and if it takes up too much of my life, consider dropping. \n\nIs a business degree for $30k an even trade for the last years of my 30s?",
        "created_utc": 1673903250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on learning to accept past mistakes?",
        "author": "lonocturnal",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10drgh0/advice_on_learning_to_accept_past_mistakes/",
        "text": "I'm in my early 30s and I've been struggling with extreme anxiety the last several years. I've been in therapy for it and I'm slowly learning more about myself, my feelings, and starting to process things from my past.\n\nBut I'm wondering what advice anyone might have for learning to accept past mistakes?\n\nIt's like therapy and maturity has turned a light on in my brain and I suddenly see all these old mistakes I have been hiding from all these years.\n\nI know this is part of my anxiety and depression, but I honestly find myself obsessing and beating myself up over things I did a decade ago, incredibly stupid and dangerous things I did in my 20s or teens. Trusting the wrong people, being in dangerous situations with men, career or school failures, it goes on and on. It seems like I am angry at myself for every decision I have ever made!\n\nI'm not the same person now and I am proud of myself for starting to learn, but it seems I just can't get past MY past.\n\nI'm always haunting myself with these past mistakes and expecting them to ruin my life. And in a way, I am letting them! I'm unable to let go of the naive kid I was 10, 20 years ago, and I don't know what to do about it.\n\nWould be eternally grateful for any advice as I am struggling to sort it out on my own.",
        "created_utc": 1673902394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pregnancy with a very new partner",
        "author": "NegativeWolverine707",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10drbln/pregnancy_with_a_very_new_partner/",
        "text": "We are both in our mid-late 30’s. No kids from previous relationships and both said we want kids in near future. One of big reasons we found each other compatible. We got together and pretty much straight away agreed we would try, at the same time as becoming exclusive. Between that there were tons of serious discussions on babies including possible IVF.\n\n(I understand if people think this is crazy, but it felt right and we are at that age we need to get together if we find someone who wants the same in life)\n\nWe tried our “baby making” session the other day when I was ovulating. But since soon after that he has been withdrawing from communication for a week or so now as he has been going through a really bad and stressful incident that I know of. This is not a lie or made up, and I can honestly understand how someone would withdraw and be depressed.\n\nBut his withdrawal is triggering my anxiety. He responds to me and says he’s really not good and is sorry and isn’t up for talking and wants to be left alone. Even though we both said we wanted to try for a baby, a part of me is feeling like he mighty change his mind and leave me on my own if I was pregnant now because he wouldn’t be able to deal with the level of stress and pressure.\n\nI hear guys ditching gfs due to unplanned pregnancy all over the internet. Which is just horrible. But I don’t know any who agrees to intentionally conceive and then leaves. But what if he does this.\n\nIt’s just my anxiety but an absence of his communication isn’t helping. I want to reach out but I know he’s dealing with some serious situation. I am actually scared because I wouldn’t have done this if he didn’t want to show up for me. It was consensual and decision on both to try for a baby. \n\nI don’t know what to say to him if he flips everything if I’m pregnant. What would a guy be called if he did?\n\nI’m sorry I don’t actually know what I want to ask :(. Please don’t with harsh comments that i shouldn’t have and we are silly for doing this. \n\nI guess if I can ask how to approach him next while he is dealing with his own stuff without pushing him away.",
        "created_utc": 1673902175,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the hurt is too deep, and feeling hopeless",
        "author": "queenkik",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dqm8c/when_the_hurt_is_too_deep_and_feeling_hopeless/",
        "text": "I've shared here recently, and am really grateful for the comments, the kind as well as the harsh ones, and am sharing again for more insight, support, and just getting this off my chest. \n\nI'm feeling hopeless that our relationship can ever recover.\n\nOur relationship feels like on constant survival mode, doesn't feel calm, peaceful, welcoming or homey. I'm constantly on edge around my husband, and have almost completely closed myself up. We're married for 20 years and it feels like the more I grow and work on myself, the more we drift apart. And he's deeply hurt, since he doesn't see where he fits in my life, which is a really valid concern, that I can't fully reassure. \n\nI don't feel emotionally safe with him, and have a really hard time forgiving him for his past behaviours. He has stopped, and promised to never repeat his actions, but I have issues trusting him. \n\nI still respect, love and care about him a lot, but otherwise, I don't feel connected. \n\nAt the moment, we're roommates, barely even co-parenting, since I do most of the load anyway. \n\nHe's still hopeful that this relationship can be repaired, and I feel like a fraud, for not having the same hopes and beliefs, and basically leading him on. Feels like I'm lying to him, in some sense although I've shared with him that that's how I feel, I don't think he internalized it. \n\nWe're currently in MC, which is great, since we're putting everything on the table, but I feel exhaustion in my soul.",
        "created_utc": 1673901008,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're eating pancakes but don't have syrup, what are you putting on your pancakes instead???",
        "author": "pinkpixy",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dqgz3/youre_eating_pancakes_but_dont_have_syrup_what/",
        "text": "",
        "created_utc": 1673900775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on learning to accept past mistakes?",
        "author": "lonocturnal",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dpes0/advice_on_learning_to_accept_past_mistakes/",
        "text": "[removed]",
        "created_utc": 1673898424,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about your significant others co workers hitting on them/showing interest at work?",
        "author": "otgirl29",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dp2xv/how_do_you_feel_about_your_significant_others_co/",
        "text": "My boyfriend of a year whom I love so dearly texted me something out of the blue this morning.\n*side note: we have a happy loving relationship and are getting ready to move in together as the next step \n\nHe texted me saying the office girls at his company asked him if he was single, saying that a girl in the HR department is into him and wants to go out with him. She left her phone number on his desk. \n\nHe said he laughed it off and said it’s not a big deal and it was more awkward than anything because he’s not single. And I’m not going to make it a big deal because I fully trust that he loves me and would never do something to hurt me. But I just keep thinking about it all morning now….why did he tell me this versus brushing it off and not telling me? And this girl better stay in her lane lol.",
        "created_utc": 1673897655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stay at home Wives - advice?",
        "author": "punknprncss",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dopxw/stay_at_home_wives_advice/",
        "text": "I (40F) and my husband are finally to the point in our lives where he can financially support us if I am not bringing in a decent income. Our children (10 / 14) are old enough that I am not going to be a stay at home mom, I currently take my kids to school, but being a stay at home wife would allow me to pick them up from school and be home with then in the late afternoon. We are past the point where I'm worrying about balancing work and \"mom duties\".\n\nI don't like working, I have no joy from it. I refuse currently to commute to work (we live in a rural area and any higher level jobs would require a 45+ minute commute). I've sacrificed a lot of my career (with no regrets) to be more present in my children's lives. Even looking for something further from home, I'd essentially be starting at a similar level as to where I am now (mid-level position) and hoping to work my way up. I do not have enough transferrable skills to jump into a higher level position.\n\nThe main reasons I've continued to work is financial support and being a role model for my children - specifically my daughter, wanting her to be raised that she doesn't need a man to support her, that she can have a career and a family. I do feel confident that we have raised her within those beliefs.\n\nI am at the point where I am ready to quit, I'd give my boss enough notice to fill my position and I'd stay on board until that person was trained. Spend some time just being home, get the house organized, work on projects that I never have time to do and then maybe in the next year consider part time work.\n\nLooking for advice, guidance, personal stories of any career women that decided to step back and essentially be a stay at home wife?",
        "created_utc": 1673896820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who were happy single and are now in a committed relationship - how is it better?",
        "author": "Leopard_Legs",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10doeu8/women_who_were_happy_single_and_are_now_in_a/",
        "text": "Just genuinely interested because you often see advice about being happy single before you start dating and I take that to mean having your own hobbies, place to live, friends and emotional support network etc. Then once you’re in a relationship the advice is that as a benchmark life should feel better/easier when you’re in a relationship, that person makes your life better. So for those who were genuinely happy and fulfilled single, what parts of being in a relationship are an improvement on your singledom? Is it just sex and intimacy or is there more to it for you?",
        "created_utc": 1673896127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would he say he loves me then be with a different girl?(26F)(28M)",
        "author": "Throwra35788",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dobnw/why_would_he_say_he_loves_me_then_be_with_a/",
        "text": "[removed]",
        "created_utc": 1673895921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I always an option and not the first choice of a guy ?",
        "author": "Similar-Poem5576",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10dnjxq/why_am_i_always_an_option_and_not_the_first/",
        "text": "Hi\n\nI , f (32) am not sure if anyone here can relate but I am trying to break a relationship pattern which has really hurt me in the past and keeps hurting me.\n\nI get into short relationships, maximum 3 months, and I only had twice of them, and the guy breaks up with me, then comes back after a year or two to text me, sometimes just as a friend, sometimes to continue to play games with me, try to get me back but not really mean it, seeking attention etc. and I am left as the backup plan or second option. \n\nMy ex boyfriends all decided to commit to another woman and never chose me. It is a pattern and they all made it clear to me, even if they arent doing it on purpose, that they wont put in the effort as they put in the effort with other women in comparison or at least it looks like it on the outside. It seems like because I am not setting boundaries early enough, that guys cant take me seriously. My ex even told me I cant take you seriously anymore. I tried to set boundaries with him because he was trying to play games with me and it was so obvious but then I backed off and disrespected my own boundaries because I was so afraid of losing him. But I am asking myself why do I have to set boundaries in the first place so that men respect me, why cant they just be kind without me having to set boundaries constantly or without me being a certain way that they \"see\" something in me.\n\nI feel absolutely heartbroken after my ex who was kind of open to get back together told me that we are meant to be together , he was Jewish and I am not, but then he backed off and told me to separate. During the time he was telling me that we are meant to be together he was already in contact with his other ex he put on a pedestal and then I noticed somehow that he is not really invested because I felt someone else was on his mind, and then boom, a few weeks later he got back together with her. Its like I am already feeling the next step of these guys and that they arent choosing me. \n\nI feel so stuck in my dating life of always being the second best option and not the one to truly commit to or the one they respect. It feels like I cannot change my nature, I always was the sweet and kind girl and since I am small I feel like people think they can treat me a certain way just because I am at peace with myself and really strive for harmony but others see it as vulnerable and like I am someone they can take advantage of or throw their own negative stuff at , kind of like a doormat. \n\nCan anyone relate and let me know what I can do in order to not betray myself and become a cold mean woman? I want to open up myself to a kind guy buy I am SO afraid that the pattern will repeat itself. And is the truth that I am only an option because of how I behave , of how I am?",
        "created_utc": 1673894247,
        "upvote_ratio": 1.0
    }
]