[
    {
        "title": "How many of you have conservative mothers and how has abortion rights affected your relationship with her?",
        "author": "pineapplepredator",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10kbg36/how_many_of_you_have_conservative_mothers_and_how/",
        "text": "I’m very curious if others have felt their relationship is changed. \n\nFor me I feel grief and betrayal but also it’s revealed an unsettling sense that her poor guidance contributed to my lack of preparation for success in life. I dont blame her for my failures, but I feel like I never stood a chance. It’s just a feeling that this disagreement on human rights brings up. \n\nExample:\n\nShe is concerned about my sadness about not yet having a family at 37, and as I search for a radical change to put myself in the best position to find that, she’s suggested that I move to a small southern town near her where abortion is banned and most of the population is conservative and Christian. \n\nI casually reminded her of the abortion ban and that if I were lucky I’d be in a position to potentially have high risk in my pregnancy. Also that conservative and Christian values wouldn’t be healthy for me or my kids. She blew me off and dismissed these concerns as if they were  me be ornery or something. \n\nIt’s hard to accept that there is so much hatred standing between her and her family. It’s hard to bite my tongue and just accept she can’t be there for me.",
        "created_utc": 1674582814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solo dining (just a vent with my own form of resolution)",
        "author": "feltalpaca",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10kbbkw/solo_dining_just_a_vent_with_my_own_form_of/",
        "text": "Over the weekend I solo dined at a sushi spot (friend had a last minute cancellation, but I still wanted to enjoy it). Went in, ordered my food, but at some point during the wait I could hear the staff sniggering about the girl “eating alone” and my mood kinda just dropped. I’ve solo dined before, but never experienced feeling judged by the staff.\n\nI stuck around though, since I had ordered one of my favorite sushi pieces and had been rather excited for it. It was surprisingly big and that just meant I awkwardly ate it in bites instead of one smooth piece and my embarrassment just deepened from that. Anyways, that was that- I don’t plan on ever going to that establishment again alone (frankly it was good so I wouldn’t mind company there). \n\nToday on a whim I decided I wanted sushi for lunch. So I splurged by adding those overpriced sushi pieces I love, and now I’m just eating my lunch at work judgement free. Feels like I undid the embarrassment from my last sushi experience so I’m pretty happy about that. It doesn’t deter me from other solo excursions, but just wanted to share this somewhere and I like this sub and what I perceive as a community who would not judge solo diners. Hope you all have a good day and that if there’s anything you can do for yourself to make it just a bit better that you do it!",
        "created_utc": 1674582502,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you stop having feelings for someone you made a real connection with?",
        "author": "wishing_nymph111",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10kb7pt/how_do_you_stop_having_feelings_for_someone_you/",
        "text": "They pulled away situation.",
        "created_utc": 1674582237,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with loved ones with low EQ?",
        "author": "FokineNailedIt",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10kb3ek/how_to_deal_with_loved_ones_with_low_eq/",
        "text": "[removed]",
        "created_utc": 1674581930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favourite Podcasts?",
        "author": "OlayErrryDay",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10kaz2c/favourite_podcasts/",
        "text": "I love podcasts and know others love them as well, but haven't seen the subject pop up much here.\n\nI have a lot of favorites but one that this sub might like (if they don't know about it already) is Something Was Wrong\n\nThis is the most interesting and mind bending podcasts I've ever listened to from survivors of narcissistic partners.\n\nThey do have stories about male and female narcissists but as the seasons go on they tend to focus mostly on male narcissists and women who get trapped by their behaviour. There are stories of fake identities, men who have twenty secret girlfriends, men who fake accents and entire lives and one season in particular with a man who made his literal full time job working on tricking a woman he met through online dating. The efforts he went through are truly beyond imagination.\n\nI recently binged the entire series again and while I don't want to label someone's trauma as entertaining, it's something that I can't stop listening to and always want to know what happens next. It's also extremely beneficial when online dating and looking for red flags in the men you meet and what to watch out for. I think 12 seasons of this podcast could teach anyone online dating and should be almost a required course in defending yourself against predators.\n\nAny others that people really enjoy? Anything that even remotely resembles Something Was Wrong, by chance?",
        "created_utc": 1674581627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best home purchases you’ve made that have improved your QOL?",
        "author": "GreatValueFishEggs",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k9ubh/best_home_purchases_youve_made_that_have_improved/",
        "text": "As soon as my partner and I moved up a tax bracket, we purchased a new mattress, blackout curtains, and a white noise machine. They’ve really changed the game. Right now we’re also looking for a new couch because our current one is a back breaker (any $2-3k budget friendly brand recommendations are welcome), and I feel like it’ll be another boost for our health. Because of this, I was wondering what other purchases people have made that genuinely made a difference in their quality of life.\n\nThe price doesn’t matter, and this is a judgement free zone, so nothing is too frivolous or indulgent or too small or simple. Everyone is different, and I’m just curious.",
        "created_utc": 1674578847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Incident at work - racism",
        "author": "Negative_Government6",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k9u13/incident_at_work_racism/",
        "text": "Hi everyone, I'm unsure if this is the best place to talk about this but I just feel like I'm falling apart here. \n\nTw: racist comment\n\nThere was a work event outside of my office and since I recently moved to the US (where driving is a much bigger deal) I still don't know how to drive so I asked a co-worker to give me a ride to this venue. In the car our conversation was mostly normal until there was some silence. This person is a white man over 50 and I am a afrolatina in my 30s. This is in the South of the US for further context. I ask him about his family as a way to broach conversation and he tells me a story about how he's teaching his son to stand up to people when he sees them being bullied. \n\nUp to this point it sounds great, then he provides further comments 'if you see someone being called queer or a n****r you should stand up and say something' at this point I am shocked because I had never heard anyone say the word before, and I realized I was in a car with a stranger (I've worked here for almost a year but still) and so I say nothing. This happened on a Friday. By Monday I had a conversation with him at the office about why this word is a no go for me (didn't feel like lecturing him I just wanted to not say it around me) fast forward to Wednesday and it seemed like he was about to tell some of our juniors a story of how I talked to him in a light that made me sound as hiper sensitive. This raised a concern for me and I decided I would talk to my supervisor about whether or not this should go further. My supervisor said he was obligated to report it to our higher ups and now I don't feel safe. \n\nWhat are your thoughts on his whole thing? I'm slowly losing my mind and am scared of an actually physical retaliation if he loses his job over this considering this job is his entire life. \n\nI just hate that it had to happen to me but I rather that than to some of our younger workers.",
        "created_utc": 1674578827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever had to cut off contact completely with someone you care for but can’t continue on in relationship with?",
        "author": "Mediocrebutcoool",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k92zh/have_you_ever_had_to_cut_off_contact_completely/",
        "text": "I definitely have some codependent traits from growing up with alcoholic parents who had loads of trauma but were otherwise good people. This really has caused a lot of issues for me because I can see the best in other people and hold out for so long that there will be change, when there likely will not be.\n\nAt it’s worst, this insanely loyal “love will conquer all” and “I have to stay at the cost of anything” mentality has showed up like me ending up with abusive people. Thankfully, I’ve grown out of that and will no longer tolerate outright abuse/lying/cheating in literally any circumstance at all.\n\nHowever, when it comes to the gray and in between spaces of people treating me mediocre and not showing up at all with reciprocity, it’s iffy. This shows up mostly in relationships with men. I tolerate their inadequacies, put up with legitimately so much, and make excuses for their trauma holding them back.\n\nFrankly speaking, I’m really tired and I’m really stuck right now and have to be honest about it. \n\nI need to end things with someone I’ve been involved with. It’s a complex relationship as he genuinely is dealing with life circumstances that aren’t ideal/cptsd/depression/a possible neurodegenerative illness that we are waiting on results regarding. We connected over the loss of his brother who I dated briefly and from the first talk, we were pretty bonded and haven’t stopped this bizarre dynamic since (2.5 years ago). \n\nI am stuck in savior mode, I am straight up stuck. I care deeply. He keeps popping in and out, can’t show up in the capacity I want/need, we have a strong emotional and sexual bond but practically- he cannot be here with me or for me. Not only due to his life circumstances, but he’s also emotionally avoidant and dismissive avoidant beyond all those things: \n\nI am in therapy and have been for years. I know all the things logically. Emotionally I am stuck and I need to hear it’s okay to be sad, confused, lost, and it’s okay to want to stay… and STILL leave even with all of that. And that I’ll be better for it. \n\nI keep waiting for some spark of “I’m done” and *feeling* like it’s time to go like in past abusive scenarios. I truly don’t think I’ll ever feel that way here which is even more of a reason that I need to make a solid and internal decision to go because it’s best for me and holding me back.\n\nI need your wisdom. Thank you!",
        "created_utc": 1674576872,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to shut down “you should have a baby”? (European grandma edition)",
        "author": "glitterandgold74",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k7wj6/how_to_shut_down_you_should_have_a_baby_european/",
        "text": "Now that I’m in my 30s, my husband’s Nonna seems to bring up the subject of kids at every opportunity. Obviously, she has a very traditional view of the world. We’re childfree, but have no intention of telling her that. \n\nWhat’s the quickest, most polite way to shut down the subject when it comes up? We’ve tried to deflect but she presses until we acknowledge it. I would like to keep family relations as diplomatic as possible but this new line of questioning is irritating and incessant!",
        "created_utc": 1674573769,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to shut down “you should have a baby”? (European grandmother edition)",
        "author": "notmyrealaccount875",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k7uqh/how_to_shut_down_you_should_have_a_baby_european/",
        "text": "[removed]",
        "created_utc": 1674573639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a writer",
        "author": "Mimi_315",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k7k02/looking_for_a_writer/",
        "text": "Ok this might be a long shot but I figured I'd try anyway. I love reading the stories on subs like r/nosleep and have followed my favourite writers. Unfortunately, there was one I loved but didn't save or follow, and I don't remember their name. One of the pieces they wrote was about some alien beings that came to earth and started to randomly kidnap people. There's a family with 3 kids, and the story is from the dad's POV. The mum and dad try to keep their kids safe but those beings grab one kid. The being informs the dad that no one will remember this kid. The beings go back and the mum and the other 2 kids don't remember the kid that was taken. The dad does and lives the pain of losing the kid, and no one else remembers him.  \n\n\nThat's the gist, the original story is much better written. By any chance, does anyone know which story/writer I'm talking about?",
        "created_utc": 1674572841,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to have \"the talk\" with my niece?",
        "author": "ario62",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k77r3/how_to_have_the_talk_with_my_niece/",
        "text": "Hi ladies. For some background- in 2020, my sister passed away unexpectedly, leaving behind two young daughters and a teenage son. I was very close with my sister, and I am still very close with her kids, and her husband.  \n\nMy nieces are now 6 and 9, and my family has been encouraging me to have \"the talk\" with my 9 year old niece. I have no problem with this at all, and I know I am the best person to have this talk with her. She looks up to me a LOT, and we are extremely close.  When I saw her last month, I casually asked if she knew what a period is (she sheepishly said yes), and I told her I left some pads and panty liners under her vanity for when she eventually needs them.  I left it at that because we were in bed watching a movie, and I wasn't really prepared to have the convo with her at that time. So I'm not exactly sure what she knows (or think she knows).  \n\nI live a few hours away, so I don't get to see them as often as I wish. I'm going there on Friday to spend the weekend with them, and I'd like to have a real conversation with her this time. I'm looking for some advice/guidance on how to approach having a more in depth convo. I don't have any kids of my own, so I don't really know the best way to go about it so that she is properly educated on what changes her body will start going through without making her feel uncomfortable or confused.  \n\nAgain, she looks up to me a lot, and hangs on every word I say, so it's really important to me to make sure I get this right. Maybe I'm making a bigger deal out of it than it needs to be lol. But I tend to overthink things, so here we are😊  \n\nCan anyone with more experience give me some guidence so I am more prepared this time?  Thanks!",
        "created_utc": 1674571934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else reflect on their childhood and wonder how they didn’t turn out worse?",
        "author": "mythrowshameaway",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k70e1/does_anyone_else_reflect_on_their_childhood_and/",
        "text": "[removed]",
        "created_utc": 1674571361,
        "upvote_ratio": 1.0
    },
    {
        "title": "to declare or not to declare feelings",
        "author": "llamalibrarian",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k6yj3/to_declare_or_not_to_declare_feelings/",
        "text": "This feels so dumb. I've known this guy for about 4 years, we met on a dating app but we really hit it off as friends. And we have been very good friends during that whole time with no \"funny business\". We hang out at least twice a week, sometimes more.\n\nBut lately we've both been talking about moving from our city and it just makes me so sad to think of not seeing him, and through this I realized I was doing a lot of daydreaming that was us living together, kissing and yadda yadda yadda. \n\nMy biggest pause is that I would not be the first of his woman friends who've declared their feelings for him. He seems to get \"boyfriend zoned\" quite a bit. He's just so helpful, funny, and thoughtful. I chalk it up to a close relationship with his sister, who is also hilarious. The other two times woman friends have asked if he was interested in something romantic, he's declined and they've remained friends. He just doesn't seem to want a relationship, but he also says that it'd be nice to cohabitate and sometimes goes on dates.\n\nSo, I could also declare my feelings and hope our friendship could survive the awkward conversation. Or maybe he's down and would like to see where a romantic connection goes. But maybe also we're too close now for a romantic connection. I also worry that I'll just always think \"what if\" if i dont say something. What would you do in this scenario?",
        "created_utc": 1674571210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone experienced ovulation nausea?",
        "author": "BrutonnGasterr",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k6l1v/anyone_experienced_ovulation_nausea/",
        "text": "So I started birth control when I was 19 or 20 and I’m currently 32. I stopped taking it in late October so I’m pretty much experiencing a real period and PMS for the first time. Each cycle has been different, I’m assuming since each month more of the birth control hormones are leaving my body since it’s been said it takes 3-4 months for it to get out.\n\nAnyways, I noticed that last month I had bad nausea and light cramps *after* my period. I googled and found some articles about how it’s normal for ovulation. Since I’ve basically never ovulated in my adult life, I’ve never experienced anything like this. Right now I’m experiencing bad nausea again and I check my period tracker and sure enough, I’m supposed to start ovulating in 2 days. \n\nHas anybody experienced ovulation symptoms? Just curious if this is normal. I know I’ve seen articles that it is, but it’s still a weird feeling to feel like this when I’ve never experienced it before - plus my mom looked at me like I was crazy and asked me if it was normal so she has me second guessing myself lol",
        "created_utc": 1674570148,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is some advice you would give to women in their mid-late 20s?",
        "author": "avocado-sheepdog",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k6c0t/what_is_some_advice_you_would_give_to_women_in/",
        "text": "[removed]",
        "created_utc": 1674569412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend Break Up - What Do I Do Now?",
        "author": "livbeyorange",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k6arc/friend_break_up_what_do_i_do_now/",
        "text": "Hi ladies. Over the weekend my friend and colleague ended our 5 year friendship. I'm not sure how to explain the situation but to put it simply, we both work in the same wedding industry and became friends from the industry. We have so many mutual connections and the same circle of industry friends. She basically told me that by me expressing my feelings as I have them instead of harboring them and waiting to erupt with resentment that I'm too much for her. 48 hours prior she was inviting me to her wedding and letting me know how that was going. \n\nI'll be the first to say that in our industry it is competitive, but I never held any competitiveness over her.  I think ultimately both of us projected our insecurities in conflicting ways and it was too much in the end. She is 4 years younger than me and decided to end our friendship via text and would not accept my calls to talk about it either. She had made up her mind and would not hear what I had to say. \n\nI guess my question is, how do you move on? Especially when we have so many of the same friends?",
        "created_utc": 1674569308,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I ensure I marry a man who truly will have an egalitarian household with me?",
        "author": "sprinkledonuts8220",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k66ib/how_can_i_ensure_i_marry_a_man_who_truly_will/",
        "text": "I’m a young woman who plans to have a professional career, and also hopes to raise a family and be actively involved in doing so (like although I’d definitely use resources like daycare, maybe a nanny if we can afford one, etc. I definitely plan to be present and involved to the extent I can). I’ve heard a lot of stories about women who are married in dual-career households and yet they still tend to do the majority of childrearing tasks, household chores, errands etc. compared to their husbands. How can I ensure I’d be marrying someone who will contribute his “fair share” yet also will have a career of his own?\n\nIf this helps give a little context - I’d probably be open to working part-time for a few years if we can comfortably afford it, in which case I’d be ok doing a little more, but I don’t know if this will actually be an option. Also, my career involves in-person work with clients and tends to have somewhat rigid hours, so it’s not like for example I can do laundry or cook in the “background” while I work from home, but perhaps my future husband could if he happens to work from home – but even if he does, he’d still have to be willing to do those kinds of tasks. Also, I feel like I tend to be more organized and “on top of things” than most guys I’ve known of, even ones who seem successful so far career-wise.\n\nI just don’t want a scenario where we both work about the same amount and yet I deal more with the “screaming kids” and keeping our household together…",
        "created_utc": 1674568957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever relationally bullied another woman? Why did you? When did you realize you were being a bully?",
        "author": "wetwhyofcourse",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k63uw/have_you_ever_relationally_bullied_another_woman/",
        "text": "\nI’m a big believer in the idea that everyone is a villain at some point in someone else’s story. Can you describe a time you relationally bullied another woman (knowingly excluded someone from a social activity, gossiped about someone behind their back, intentionally withdrawing affection and attention, etc)? Do you feel you were in the wrong? What would you change about how you behaved if you had the chance to do it over?",
        "created_utc": 1674568777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sick of keeping up with Facebook \"friends\".",
        "author": "Feverish_Dreamer",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k5bse/sick_of_keeping_up_with_facebook_friends/",
        "text": "[removed]",
        "created_utc": 1674566449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice from women",
        "author": "Internal_Quiet9",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k3pmy/need_advice_from_women/",
        "text": "[removed]",
        "created_utc": 1674561078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would someone follow porn stars and only fans accounts on Instagram?",
        "author": "ShweetMimi",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k0xuo/why_would_someone_follow_porn_stars_and_only_fans/",
        "text": "",
        "created_utc": 1674549210,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your advice &amp; tips on staying safe while trying to start dating at a 25 year old woman?",
        "author": "Desperate-Proof-3213",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10k0mkj/whats_your_advice_tips_on_staying_safe_while/",
        "text": "I'm an introvert, so I went through my years accepting whoever enters my life and then I put effort into knowing them really well, instead of attracting a lot of people that I don't get close to. My problem is mostly surrounding social skills, hence why it was always hard for me to do a step forward and start conversations &amp; ask someone to hang out with. You can guess now that I'm really alone, don't have any true friends, and the only one I did have, ended up having feelings for me then ghosting me (which seemed fair to some point?). \n\nBesides that, I'm turning 25 next week, had one boyfriend when I was 17 and it lasted one month because I had to leave &amp; travel back home. He was special &amp; we shared a lot of similar interests like writing &amp; reading, &amp; our love for the English language. I'm someone who knows what they want, so I don't ever want to waste someone's time falsely leading them to something I know I'm not going to be interested in. But the downside to that feels like I'm too picky, and don't dare to try. I want to push myself out of my comfort zone &amp; actually start dating &amp; meeting guys but the only way to do that is through Tinder for me. How do you stay safe while meeting complete strangers? I also hate the fact nearly everyone is interested in hooking up &amp; that's it. I'm not interested in that but Tinder is for that if I'm not wrong? \n\nSo my question is, how did you go through this type of period I'm going through? I feel like I will never be able meet him due to my introversion &amp; pickiness.",
        "created_utc": 1674547846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Help Choosing the Right Undies",
        "author": "HomestuckPlease",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jz1bf/need_help_choosing_the_right_undies/",
        "text": "I’m marking this NSFW just in case.\n\nHey, I’m only 22 but I thought this would be a good place to ask since I figured you guys must know by now the best undies to wear that don’t make your groin uncomfortable or act up. \n\nI don’t really know who else to ask as all of my friends are guys and my mother passed when I was 10, so I’ve kinda defaulted to the target undies that come in packs. \n\nI have a few Victoria Secret undies but they are mainly for when I’m feeling sexy, not really used for being comfortable/ they aren’t really that comfortable. I like to use loose boxers for when I’m around my house, but they don’t really fit in my pants quite well.\n\nI was hoping for some wise words of panty wisdom from some more life experienced women who also have a sensitive groin.",
        "created_utc": 1674541310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mirena or any hormonal IUD- did it or does it affect your libido?",
        "author": "HappinessSuitsYou",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jya8g/mirena_or_any_hormonal_iud_did_it_or_does_it/",
        "text": "I got an iud in December and I’m seeing my once healthy and thriving sex drive plummet. Before that I had a copper iud that did not affect my libido but it did make my periods long, erratic and heavy. I gave it three years then pulled the plug (haha). Now I have the Mirena since the start of December and have noticing my libido slowing declining. Its depressing! Just seeing if anyone else had a similar experience. I’ve asked some friends but most got theirs right after giving birth at their six week postpartum appt so had lower drives anyway due to breastfeeding and in the throes of newborn land. Thanks in advance..",
        "created_utc": 1674538607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been speaking to someone for a while. He flies to Bangkok every month, for work sometimes but mostly for leasure. I'm not sure what to make of it.",
        "author": "ShweetMimi",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jya3c/been_speaking_to_someone_for_a_while_he_flies_to/",
        "text": "",
        "created_utc": 1674538593,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you calm down after experiencing street harassment?",
        "author": "cassandrairony",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jxcwp/how_do_you_calm_down_after_experiencing_street/",
        "text": "I was walking home from work and someone yelled horrible things at me from their car. It was a stranger, someone I didn’t know. Now, I don’t feel safe walking down my street. I just want to exist in peace. \n\nI’ve tried to journal about it and tell a few friends. That has helped a little bit but the stress and anxiety is still in my body.",
        "created_utc": 1674535394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Galentine’s Day have to be single friends?",
        "author": "secretid89",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jx5d1/does_galentines_day_have_to_be_single_friends/",
        "text": "I thought about maybe getting together with woman friends for Galentine’s Day.  \n\n\nHowever, do you think it has to be just single friends?   Can you invite married woman friends? (without their husbands, of course.  :). ) \n\n\nI guess I have a lot of social anxiety, so I figured guidance would be helpful.  :).  Thanks!",
        "created_utc": 1674534688,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to encourage my husband who has no drive/ambition",
        "author": "mrs_sadie_adler",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jw4it/how_to_encourage_my_husband_who_has_no/",
        "text": "I (30F) need suggestions on how to encourage my husband (33M) more as far as career and finances go. I love him but I've been frustrated with him and the frustration is growing.\n\nWe've been married 6 years and he still hasn't committed to a career. He doesnt seem to care about being a financial provider, making more than he does now, getting a raise ever, getting a promotion ever, or working towards anything in particular. Honestly I find it unattractive. He's always been like this so I shouldn't be surprised. It took him 6 years to complete his undergrad because he kept changing his mind from very different fields. He even transferred multiple colleges. He did all this on his mom and dad's dime.\n\nHe graduated with a degree in social work. Never wanted to study for the exam to practice as a social worker. Started school again for computer science. Quit that once he got a help desk job from a family friend. Has now been in IT ever since. Starts to study for IT certifications that could lead him to a better job and never follows through. Started and quit engineering classes. Claims he wants to be a pilot. Claims he wants to start a business. Do you get where I'm going with this?\n\nHe has been in IT for going on 7 years and still makes mid-50s. He just kinda rides the tide and doesn't have any direction. His first company got bought out. At his current company he's been shifted around the company as jobs get outsourced. He's letting external forces shape his \"career.\" He says he doesn't love IT so I understand that he doesnt have the passion to be ambitious in this field. But I feel at 33 years old and after 6 years of marriage he should just pick something and try to excel at that. You know? His lack of ambition and drive have been frustrating me and I need suggestions on how to help him so our marriage doesn't fall apart.\n\nI make about the same as my husband but I'm in a career with a path, a future. In 2021 I busted my ass (networking, interviewing for a dozen jobs) to get a better job at a better company. I'm in grad school at night. I'm driven. The older I get though, the more I just really want my husband to step it up and lead in this way. Especially as I'm that age where I'm need to make a decision about having kids and I'm also facing a decision about being a caregiver to my mom. If either of those things are to happen, we need to be able to survive on one income.",
        "created_utc": 1674531352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else been as happy to get older and realize there are so many different ideas of ‘sexy’ and ‘attractive’?",
        "author": "trashy_boner",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jvrmo/has_anyone_else_been_as_happy_to_get_older_and/",
        "text": "Growing up I thought women were supposed to look one particular way (thin and tall) and men were supposed to look another (tall and muscly). As I got older I tried so hard to be thin since I wasn’t tall and couldn’t understand why super fit men just didn’t do it for me. I’m now in my mid 30’s and absolutely love that I believe my boyfriend when he says he finds me sexy (I’m a plus sized short girl) and I find him SO attractive (dad bod short guy). I adore him mostly for his personality and how much he cares but I am definitely physically attracted to him. I love it.",
        "created_utc": 1674530244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Break up without closure",
        "author": "Radiant-Bag5634",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jvlyn/break_up_without_closure/",
        "text": "Dated for about 1.5 years. Definitely felt like this man was my soul mate. We both are divorced and had agreed we would never actually be married but lots of talks about “forever” and how much we loved each other. Never seriously argued. Best sex ever. All we did was laugh and have fun together. Suddenly he’s stand off-ish and short with me. At first I thought he was stressed  and now totally has stopped talking to me. This man is the definition of “if he wanted to he would” so I know if he wanted to talk he would and I haven’t reached out and asked why??  Those of you who have gone through breakups without closure.. tell me you eventually stop going crazy with the whys and what ifs 😭😭",
        "created_utc": 1674529747,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got threatened with a ban for agreeing that nevertruly is nuts.",
        "author": "girloferised",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jv4uj/i_got_threatened_with_a_ban_for_agreeing_that/",
        "text": "A bunch of people were talking about what a poor moderator she is, and the mods started threatening to ban everyone and deleted any comments that mentioned her.\n\nHonestly, I'm really disappointed in you guys. We should be able to post our experience of someone without being threatened and [censored](https://en.wikipedia.org/wiki/Censorship). People get criticized online about all kinds of things all the time and /u/nevertruly isn't entitled to a free pass just because she's in a position of power. In fact, I thought it is pretty much universally agreed upon in free countries that, if anything, it should be **more** acceptable (encouraged, even) to analyze and criticize the performance of someone in a position of power.\n\nAnd I will. She's a poor moderator. Her moderation is excessively biased, irrational, and aggressive. And I'm **far** from the only one who thinks so. Just search her username on reddit or google and see how many people she's antagonized. \n\nShe's not a victim; she's a bully.\n\nAnyway, I'll be over in /r/askwomennocensor.\n\nAdios, bitches. ✌",
        "created_utc": 1674528307,
        "upvote_ratio": 1.0
    },
    {
        "title": "What activity do you enjoy doing?",
        "author": "callme_isa",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jv4kz/what_activity_do_you_enjoy_doing/",
        "text": "This is something you do for yourself (alone or with a small group of people). Let’s hear it!",
        "created_utc": 1674528285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the only woman in her early 30s who doesn’t have a core friend group?",
        "author": "burgerzandburpeez",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jutco/am_i_the_only_woman_in_her_early_30s_who_doesnt/",
        "text": "I’ve got a handful of friends from college and high school who are within an hour from me, but we’re all in completely different places in life. We see each other maybe once a month and have definitely drifted over the years, but not completely. \n\nMy partner’s friends still party like they’re 21 or they’re on their second or third kid. No in between. \n\nFeeling left out lately - I guess I just need some reassurance I’m not the only one.",
        "created_utc": 1674527350,
        "upvote_ratio": 1.0
    },
    {
        "title": "single &amp; mid-30s: is there a light at the end of the tunnel?",
        "author": "Bess1935",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jtuwn/single_mid30s_is_there_a_light_at_the_end_of_the/",
        "text": "Hello all. I (34/F) would love some advice and motivation if others can relate.\n\nSo I'm single and turning 35 in a handful of months and it is terrifying. Here's how I got here:\n\nThrough middle school, high school, and college I wasn't a pretty girl. I didn't get invited to parties or dances, boys never liked me back, so I focused on my studies. \n\nBetween 22-33 I ended up in an emotionally draining career (along the lines of teaching or social work - high stress, low pay to \"make the world a better place\"). But I wanted nothing more than a partner to start a family with. I dated when I wasn't:\n\n* drowning work stress and chaos\n* drowning in grief and depression from my entire immediate family dying by the time I was 28\n* or emotionally &amp; financially recovering from the jobs I lost due to grief, depression, and chaos\n\nWith dating, nothing ever worked out or turned into anything long-term. There were a few men I was interested in, but once again, they never wanted me - likely due to:\n\n* my poor mental health\n* the weight I'd gained from antidepressants (I went from a size 6/8 to a 12) \n* limited capacity and means to take care of my appearance at the level they wanted me to\n* my lack of relationship &amp; physical experience for my age (see above)\n\nOne day a little over a year ago, I'd had enough. I quit my job and career path. I cut off toxic \"friends\" and extended family. I started over. At first it felt great. \n\nBut then, I was overwhelmed with messages that unmarried women in their 30s \"wasted their youth\" and if we didn't prioritize men &amp; marriage in our 20s. We shouldn't be \"rewarded for bad behavior\" with loving partners &amp; families, because all decent men of all ages only want the most beautiful 20 somethings with more fertile years left, and they deserve them. Men only value youth &amp; beauty, so now I'm a \"low value\" \"leftover woman\" and I should settle with the first man who lowers his standards to accept me (until he leaves me for a younger woman).\n\nThis is absolutely devastating and heartbreaking for me.\n\nI did not \"throw away\" my 20s and early 30s partying, sleeping around, or 'trying to be the man I wanted'. I faced a lot and I survived. But I'm worried it doesn't matter why or how. It's too late. My time has run out.\n\nHas anyone else started over in their 30s and ended up with a great partner &amp; a great life? I'd love to have hope that it can be real.",
        "created_utc": 1674524494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the idea of the nuclear family dead for the majority of millennials? Why?",
        "author": "readitanon1",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jtu8n/is_the_idea_of_the_nuclear_family_dead_for_the/",
        "text": "",
        "created_utc": 1674524441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for life &amp; starting over at 35",
        "author": "Charming_Setting5131",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jt7v4/advice_for_life_starting_over_at_35/",
        "text": "[removed]",
        "created_utc": 1674522620,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm turning 35. Send help. 💔",
        "author": "Charming_Setting5131",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jt5m2/im_turning_35_send_help/",
        "text": "[removed]",
        "created_utc": 1674522438,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can you be more pushy\\demanding when the situation calls for it?",
        "author": "hungariandog",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jt0d7/how_can_you_be_more_pushydemanding_when_the/",
        "text": "I tend to be passive instead of being demanding when asking for things I believe I had earned\n\nThis laid back attitudd is good a lot of the time but when it doesn't I'd like to be able to be more demanding when the situation calls for it",
        "created_utc": 1674522041,
        "upvote_ratio": 1.0
    },
    {
        "title": "WFH outfits?",
        "author": "peace_love_bananas",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jsxhl/wfh_outfits/",
        "text": "What do you wear when you work from home but don’t want to look like a slob? I’m not trying to wear business clothes but also not trying to wear yoga pants all the time.",
        "created_utc": 1674521836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Underwear choices for full bums 🍑",
        "author": "red_red_whine_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jswjr/underwear_choices_for_full_bums/",
        "text": "Strange question, I know lol but ladies what kind of underwear have you found that fits ?!? I am a small woman with a big booty 🍑 and have worn thongs for as long as I can remember. I'm getting near my 40's and dam am I sick of wearing thongs. Here's the catch. Boy shorts , full bum .....they all end up bunched up in the middle anyway !  Is there a style that stays put ???",
        "created_utc": 1674521761,
        "upvote_ratio": 1.0
    },
    {
        "title": "No serious relationship in several years?",
        "author": "craigies_list",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jrzpv/no_serious_relationship_in_several_years/",
        "text": "I dated a guy who was 36, and his last relationship was 22.  It seemed odd to me, but came to know over time that he was very focused on his career, etc.  However, when I asked outright, he said it was because he hadn't met the right person yet.\n\nNow - I get that you haven't settled down with the right person yet, but no relationship at all in your 20's or early-mid 30's?  I've dated the wrong people, but at least I tried.  Over time his lack of relationship skills shone through.  Going forward I would consider lack of a seriously relationship since you became a real adult at least an orange flag, but has anyone else experienced this and it DIDN'T turn out badly?",
        "created_utc": 1674519168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this normal?",
        "author": "mernalos",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jryvm/is_this_normal/",
        "text": "[removed]",
        "created_utc": 1674519101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who couldn't cook well before you had kids- how did you cope?",
        "author": "dumbnunt_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jri90/women_who_couldnt_cook_well_before_you_had_kids/",
        "text": "I'm single but I find myself worrying. I don't cook terribly, I feed myself, but I cook vegetarian and don't make anything kid (let alone man) friendly. Just pull easy recipes from the internet (had miso glazed bok choy chickpeas and rice today.) \n\nHow did you cope with learning how to cook quickly and also learn kid friendly dishes?",
        "created_utc": 1674517859,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with a little back pain",
        "author": "dumbnunt_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jr6jn/how_to_deal_with_a_little_back_pain/",
        "text": "I'm starting to get back pain recently in the early/mid day in my mid 30s. (can be the lower back, upper, middle, shoulder blade.) I don't like the ache and sometimes it makes me want to sleep (also tends to come on when I'm studying ;) or overwhelmed by all my tasks.) I have had a problem with slouching and haven't strengthened my muscles or exercised as much as I wanted. \n\nI've started with short floor workouts (the usual planks, push ups, and stuff - by bullyjuice) and yoga that reduce the pain a bit (but I don't have too much time as am studying.) I think this is due to me not having strengthened my core muscles and back (also pelvic floor isn't the strongest right now.)\n\nDo you have any exercises or strategies that helped your back pain?",
        "created_utc": 1674517014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we talk about sleep?",
        "author": "AdAromatic258",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jqudd/can_we_talk_about_sleep/",
        "text": "What are your tips, hacks, recommendations, etc on getting a good nights sleep?",
        "created_utc": 1674516161,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be single and happy again at 33?",
        "author": "Dogmummy",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jqkiw/how_to_be_single_and_happy_again_at_33/",
        "text": "Sorry this will be long. Hello, little back story I am 33 years old been single for a grand total of 1.5 years since I was 19. I was with my ex fiancé for 6 years and my current partner (to be ex) for 6 years. \n\nToday we had a sit down and realised that this is the end, nearly 2 years of no sex, lots of issues on the relationship and now different directions. I want to concentrate on starting uni and have just bought a new house which was intended for both of us to move into in a new city. (Well my hometown) new city for them. \n\nHow do I be happy, I suffer from very severe clinical anxiety and PTSD and feel like I have lost myself and became quite isolated since being with my ex. How do you deal with the grief of losing someone even though deep down you know the relationship is not healthy and you can’t see yourself ever marrying that person? How do you keep yourself occupied? \n\nWhat is the best route to take, I struggled after splitting with my fiancé and a set of circumstances and some traumatic events led me to having a breakdown for which I am still recovering. (Not from splitting with them) but other things that happened after. I don’t want to be catapulted back steps if that makes sense. \n\nThank you all x",
        "created_utc": 1674515468,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do about friend obsessing / having trouble moving beyond a tough situation / possible paranoia",
        "author": "abitravels",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jqbr9/what_to_do_about_friend_obsessing_having_trouble/",
        "text": "A long time friend (30sF) of mine (30sF) who has been very supportive of me in the past has been going through a tough situation recently where she suspected her husband placed tracking software on her phone. She is working through the fallout of that in the relationship, getting a divorce, etc. but keeps obsessing over being tracked, to the point of what looks like paranoia to me and other friends familiar with the situation.\n\nFor example, freaking out after receiving generic mailers about class action lawsuits after data breaches, filling police reports about apps on her phone, etc.\n\nI feel terrible that she is going through this and frankly unable, and like it isn't productive, to try to decide whether all of the stalking and tracking is really happening, or if this is unfounded paranoia. This friend has been diagnosed as bipolar in the past.\n\nThe friend has been unemployed for several years now and having all living expenses paid for by the husband she is now divorcing. Every time she texts me, it's either complaining or more paranoid questions about whether I'm familiar with this or that app, or otherwise helping her sleuth out who is tracking her. \n\nI keep trying to acknowledge how tough this all must be for her and listening to what she wants to say, but I feel like I'm enabling her paranoia.\n\nHow would you balance supporting a friend in this situation? Thank you!",
        "created_utc": 1674514867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who WFH, are childless, and live w a partner: what do you do after work?",
        "author": "burgerzandburpeez",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jq35l/women_who_wfh_are_childless_and_live_w_a_partner/",
        "text": "I’ve been remote since COVID. My job is very slow-paced and I probably work a combination of 3 hours per day. Some days I don’t even open my laptop until noon. Some days, I finish up by 1pm. \n\nI have hobbies including yoga, weight lifting, film photography, documentaries, cooking, and audiobooks.\n\nMost days I hit the gym/yoga at 4, head back home around 5:30, finish showering + making dinner by 7, and I’m basically done for the evening. I’m a night owl so I basically don’t do shit from 7-1am. \n\nI’m going crazy. I feel like my life is a constant loop. I have a few friends near me still (the rest are out of state or have several children) but they’re weekend friends. I love my partner so much and even when we do hangout once he gets home, it’s the same thing. We eat dinner, watch a show, then go to bed. Other days, he works on freelance in his office or plays video games with his buddies.\n\nTyping this out I’m realizing I’m lonely. I’ve got family here but they all have their own very busy lives - I see them 1-2x a month but also only on weekends. \n\nSO, what do y’all do after work?",
        "created_utc": 1674514282,
        "upvote_ratio": 1.0
    },
    {
        "title": "May seem like a simple question and yet…here I am: How do I be nicer?",
        "author": "FeFiFoMoo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jppy0/may_seem_like_a_simple_question_and_yethere_i_am/",
        "text": "Hello all. Recently got dumped and ex told me the reason he was breaking it off is because I’m mean. \nI agree, I can be tough - I tend to be direct and I know this upsets people. I try to be kind when I am honest, but I still find it upsets people. \nLong time friends tell me that I’m a loving and warm person, and that they know my heart but I don’t want to sit on their validation without exploring his assessment and trying to become a better person.\nSo I ask you ladies, what can I do to be nicer?\n\nAdditionally, I have received feedback a couple of times in life by different people that they don’t want to disappoint me - which I interpret as them letting me know that I am difficult to talk to or come to. Any further analysis is welcomed. Thanks!",
        "created_utc": 1674513354,
        "upvote_ratio": 1.0
    },
    {
        "title": "May seem like a simple question and yet…here I am: How do I be nicer?",
        "author": "beacon777eight",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jp5xr/may_seem_like_a_simple_question_and_yethere_i_am/",
        "text": "[removed]",
        "created_utc": 1674511983,
        "upvote_ratio": 1.0
    },
    {
        "title": "here anyone date with me?",
        "author": "Sensitive-Opinion952",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jon0e/here_anyone_date_with_me/",
        "text": "",
        "created_utc": 1674510739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any ideas for throwing a Galentine's or girl's night party? Games, decor, food...",
        "author": "jennycotton",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jo5s8/any_ideas_for_throwing_a_galentines_or_girls/",
        "text": "It will be a mix of female family and friends who don't know each other. I think it would be fun to play some kind of game(s) but not sure what. I want to decorate my place too and make it fun for everyone.",
        "created_utc": 1674509561,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make female friends again?",
        "author": "pinkishtiger",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jn1ci/how_to_make_female_friends_again/",
        "text": "I lost most of my friends after having a child 3 years ago. I don’t blame them at all, it’s definitely my personality that has completely changed. But I am having the hardest time making new girl friends. I am less interested in drinking and partying, can’t really do anything spontaneous currently, and in a world of new self discovery. Is the time just not right? Am I trying to rush it? Or am I being lazy and not putting enough effort in? Am I too out of touch since I’ve been just doing the mom thing for so long? How do I restart this journey? Any advice is welcome!",
        "created_utc": 1674506857,
        "upvote_ratio": 1.0
    },
    {
        "title": "The guy I am seeing used to go to same university as my ex. Now I don't know if I should continue.",
        "author": "MaterialConference4",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jmddc/the_guy_i_am_seeing_used_to_go_to_same_university/",
        "text": " I found out that the guy I am seeing used to go to the same university as my ex. The new guy graduated few years after my ex. They don't seem to have each other on socials but I saw there is a mutual friend that knowns me and my ex and is also friends with this new guy. He doesn't know that I know that though. Btw my ex and I broke up because he cheated. So now I don't feel comfortable I find it weird for some reason. We are still at the beginning stages. What do you think to continue or not?",
        "created_utc": 1674505246,
        "upvote_ratio": 1.0
    },
    {
        "title": "What vitamins do you currently take?",
        "author": "Strawberyblonder",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jlmrp/what_vitamins_do_you_currently_take/",
        "text": "I just bought those hair and nail gummies from Costco… but I have a suspicious feeling that they don’t actually do much for me…",
        "created_utc": 1674503461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone drastically changed careers in their 30s?",
        "author": "veryspecialnoodle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jlipw/has_anyone_drastically_changed_careers_in_their/",
        "text": "I've always been the \"perfectionist\"/ \"high-achiever\" but I don't think I ever really stopped to ask myself if these \"achievements\" were something I really wanted. I went to law school and was singularly focused on becoming a public defender, which I am now. I've been in this job for over 2 years, and I hate it. I dread going to work, I don't want my bosses' jobs. I care deeply about the social justice aspect of it, but day to day it's not for me. I've been seriously considering quitting for over six months (and I actually discussed it with my supervisor who suggested changing my role to see if it improves things, but that was 2 months ago and it's slightly better but still not what I want).\n\nI've been struggling w/ my mental health as well -- largely due to my job -- and so I 've been trying to dedicate more time/energy to taking care of myself and truly getting to know myself. I've had a relatively consistent yoga practice for 12 years or so and started really committing to it over the past few months. The teacher at my studio said I should think about teacher training. I did think about it, and I decided to do it. Initially, I did it just to deepen my own practice, learn more about the history of yoga, anatomy, etc. not necessarily to teach. But I'm about halfway through the teacher training (it's 200 hrs), and I absolutely love it.\n\nMy partner has been encouraging me to think about if this is something I would like to start doing full-time after I finish teacher training. He asked me the other day \"what does your ideal life look like?\" and the easy answer was being a yoga teacher and eventually opening my own yoga studio. Financially, I'm not quite there yet, but I think my partner and I could be in a year or so (he makes a lot more than I do now and certainly more than I would as a yoga teacher).\n\nI don't know if this is just me feeling fulfilled by something for the first time in a long time or if I really should give up on law. I have only ever practiced in one area of law (criminal defense), so a part of me feels like I should try something else before completely switching gears. I don't really know what this kind of career shift would even look like for me, so any insight or experience would be great!",
        "created_utc": 1674503191,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to go back to compassionate communication after a season of conflict?",
        "author": "idyllicisland",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jldqp/how_to_go_back_to_compassionate_communication/",
        "text": "",
        "created_utc": 1674502865,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your weekend prep for the week other than* paid work tasks/kids/food prep/laundry/cleaning?",
        "author": "ultracuddle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jkndf/whats_your_weekend_prep_for_the_week_other_than/",
        "text": "",
        "created_utc": 1674501060,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I date elder girl then me?",
        "author": "Sensitive-Opinion952",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jjfaw/how_can_i_date_elder_girl_then_me/",
        "text": "",
        "created_utc": 1674498122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a hard time finding men attractive as I’m getting older. Am i too picky?",
        "author": "insecure_f",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jgjnz/having_a_hard_time_finding_men_attractive_as_im/",
        "text": "The older I get the more I’m finding men not so attractive. Now that im older, the pool of men are older. Either they don’t take care of themselves (scruffy, unruly hair, bad skin, dresses bad/old fashion) or are very stubborn about what they want or just down right smell.  Yet men are hyper critical and expect their women to be the total opposite of themselves.\n\nWas it the pandemic that caused some of them to just stop caring about themselves? at least where I live/the ones I see don’t put any effort into dressing well or taking care of themselves. My sense of smell is really strong and I’m having a hard time tolerating most smells too (too much cologne, strong pheromones, BO).\n\nIs it just me? Am I being too picky? I might not be perfect, but it just seems like the older I get the pool of available guys are so blah and I feel so demotivated.",
        "created_utc": 1674491294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frustrated with parents, thoughts?",
        "author": "missourifarmgirl",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jf008/frustrated_with_parents_thoughts/",
        "text": "I'll try to make this as condensed as possible. I'm my mother's 4th child, my dad's only child. They've been together since the year before I was born. All my other siblings are older than me. I basically grew up as an only child.\n\nMy mom and I are very different people. Almost polar opposites that just have a few common areas. Our relationship until a few years ago was bad. Because my parents were older than most, I grew up hearing how they'd be dead in 10 years. How I'd just stick them in a nursing home. How I don't care about them. My mom frequently would have explosive anger about small things and I basically grew up walking on eggshells. I got married young, and basically my husband and I helped my parents all the time. We made poor choices, but with the intention that we were helping them because they were older. They had a house we lived in (we paid all taxes, insurance, utilities and fixed it up so they made a profit when they sold it). I spent the majority of my 20s being at my parents (especially my moms) beck and call. Helping with yard work, with technology, simple things that looking back they were capable of. Although they are older (in their 70s now) they've been in general good health. The situation got so bad it effected my marriage and almost led to a divorce. So much of my and our life was about assisting them. I realized my mother has a lot of narcissistic traits, and once I realized just how flawed things were, we got our own rental then a house in 2020. I didn't talk with my parents much for awhile, but when we did things were much better. I try to enforce strict boundaries and my mom is way better than she was. We are in an OK place. \n\nBut it leads me to today. I'm having a hard time deciphering if how I'm feeling right now is normal or if I'm just a horrible person. My mom is getting an mri read and my dad has a bone infection in/near his toe. He's doing hyperbaric treatments for the next 10 weeks and his first one is today. They are both at the hospital, and because my mom is getting her mri read she wanted me to come and sit with my dad before his appointment. I told her I could but mornings are a little hectic for me right now. I have livestock, and a puppy. I am bottle feeding three goats each morning, letting poultry out, and if I leave early it means I have to make sure the puppy gets enough exercise. I live about an hour from the hospital. My mom then told me my sister would sit with my dad and then go be with my mom, so not to worry about it. Then she messaged me this morning and said they were there and asked if I was. \n\nAnd I feel bad I'm not there, that I didn't want to go, and don't want to go. I feel angry that I put up with so much of their drama while my siblings didn't help much at all. I don't understand why I need to be there if my sister is. Not to mention my dad's wait would only be 15 minutes before he starts treatment and then what would I do? What am I there for? And then I feel bad because they are older now and they literally do need more help. I finally have a life I want to live, and I am happy and content. Are my feelings normal? I just need some perspective.",
        "created_utc": 1674487418,
        "upvote_ratio": 1.0
    },
    {
        "title": "If someone made you believe in God and lied to bits to take away all faith and hope you had. How did you deal with it?",
        "author": "Just_Vermicelli_7848",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jeu4y/if_someone_made_you_believe_in_god_and_lied_to/",
        "text": "",
        "created_utc": 1674487006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with moving on.",
        "author": "Just_Vermicelli_7848",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jesxa/help_with_moving_on/",
        "text": "[removed]",
        "created_utc": 1674486925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestion on moving on.",
        "author": "Just_Vermicelli_7848",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jes98/suggestion_on_moving_on/",
        "text": "[removed]",
        "created_utc": 1674486880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice needed: colleagues went to escorts on company sponsored offsite",
        "author": "blakey1414",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10je9dp/advice_needed_colleagues_went_to_escorts_on/",
        "text": "My office team of 20 people went on a company offsite. There were only 2 women in the group (including me). I learnt that 7 of the men went to a place to hire escorts one night - 2 of these never entered the place and stayed outside, 2 went in but came out before anything happened while 3 paid for escorts. Out of the 3, I got to know from a colleague was scammed and lost money (I.e he was asked to leave after he paid). The other two paid and I don’t know what happened after that. 5 of these people have spouses. They kept making cryptic jokes about this for the rest of the trip (about the guy who lost his money). The jokes were also made by my head of department who was part of the group but came out before anything happened. I didn’t realise at that time what the jokes were about but got to know later when my colleague told me the background. I feel absolutely disgusted by these people. I felt it was totally unacceptable and unsavoury to indulge in something like this in a group while on a company sponsored offsite. I am aware that if I raise this with HR or the head of the company, some of the people might get sacked. I am thinking of talking to my head of department and telling him how uncomfortable this has made me and how disturbing this was. I don’t know what outcome I expect. I honestly don’t know what to do. I don’t think I can pretend nothing happened and go on working with these people. One of these guys is a total creep and always made me uncomfortable by staring inappropriately whenever I had to interact with him for work. I don’t want people to lose jobs but I think this was completely unacceptable. \n\nI did not feel unsafe at any time during the trip so I am unsure if I am overreacting. But am I am creeped out by my colleagues. Need advice on views on what to to do next. Thanks",
        "created_utc": 1674485523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saving for retirement?",
        "author": "aninconvenientpoo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10je6nc/saving_for_retirement/",
        "text": "I was wondering how you are saving and planning for retirement? Has any of you been through a divorce and had to figure out how to divide the retirement savings?\n\nMy husband (35M) and I (32F) have had multiple discussions about how our private savings will get sort of unequal as he earns 40% more than I do. So we save 5% of the total household income and divide it by 2. No idea what would happen if we’d split up or sth, nor what kind of lifestyle we’re planning for..\n\nAny of you had this conversation in non cisgendered relationships/marriages? Feels like it easily falls towards gender inequality but I’m not sure if it is or just income inequality…",
        "created_utc": 1674485317,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you cope with the fact that the world is a lie?",
        "author": "wolframdsoul",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jd1mx/how_do_you_cope_with_the_fact_that_the_world_is_a/",
        "text": "The title is a bit of a mouthful, but couldn't really come up with better wording.\n\nIn ancient greece, there used to be tragedy play's, the aim (besides entertainment) was for audiences to see and accept how most life is beyond their control and suffering/tragedy is the only thing certain in the act of living.\n\nIn modern world, the most popular mode is to be hopeful and optimistic, the default is that if you try, there is a chance that things will turn around for the positive.\n\nIn reality however, the only thing certain in life is that whatever dice you are born with + luck is what you get. \n\nIf you are born in the wrong country, wrong body, wrong people around you, you are destined in most times to live live in hard mode.\n\nAnd yet, we live in a world where everywhere everyone screams lies as if trying to make them true \"you have power with your vote\" (no you don't, there is an exclusive few that give you the candidates to vote), \"you have power with your dollar\" (we have no dollars, the upper 10% of society has it all and doesn't care about either companies being bankrupt or not), \"we can save the environment\" (again, there is the upper 10% that has the power for this, not us).\n\nI am conscious that I am being a downer, but I want to ask why can't we go back to ancient greek times and accept our fate? Like, I think life would be a lot more manageable if we all had an more realistic expectations? Like \"the world will get increasingly worst in 80 years while the rich gets to escape it, but hey, at least you have a sweet ride until then\" or like \"you will see your grandparents, parents and family die, so you should cherish the moments while you have them\" or like \"the only constant in life is pain and uncertainty, so normalise those feelings and chose what do you want to feel pain for?\"\n\nAnyone thinks of this? How do you cope with it?",
        "created_utc": 1674482170,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m asking the opinion of women with children…",
        "author": "Healthy_Ad4523",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jczyw/im_asking_the_opinion_of_women_with_children/",
        "text": "I can’t believe I’m coming here to ask strangers advice about my relationship…But here I am..\n\nI’m in a 13 year relationship with my high school sweet heart(29M) We never married. He doesn’t want to.\n\nWe’ve had a rocky relationship for a year now. We’ve always had our ups and downs though. I suppose like every relationship does. \n\nHe’s developed a secret drinking problem. I’ve found empty vodka bottle everywhere. At one point I was cleaning out his car and I found 8 empty bottles. When he comes home from work he sits in his truck and smokes cigarettes, watches YouTube and I guess drinks vodka. \n\nAnyways this event is what really wants me to leave the relationship… \n\nI had the flu I was really sick. I was absolutely miserable. I asked him to come home by 5 which is an 8.5 hour day for him. He said he’d try. I told him to grow a backbone and say “I have to leave my partner is very sick taking care of a baby and a toddler.”  He didn’t come home until almost 7. It was miserable  taking care of my children so sick. Well he got mad at me for saying that. Which I get, I shouldn’t have said that. Came home went to the basement and drank. He didn’t help me at all with the kids. \n\nI sleep on the couch because my 1.5 year old wakes up occasionally wakes up in the middle of the night and I really wanted rest… well that wasn’t happening. I guess our baby pooped in the middle of the night. He comes down screaming “where the fuck are the wipes” he woke up the entire house. He’s continuing to scream throughout the house. The kids are crying. I tell him to leave. He freaks out slams the door breaks the framing on my door. So I take the kids to the couch. And he starts scream at me and my 5 year old. “I will never see you again. Enjoy your shitty life” he took my hours to calm down my 5 year old. He didn’t fall back asleep until 6am. This was a school night thank god it was snowing so no school the next day.\n\n\nSo this event traumatized me and my son. My son seems to be over it now. It’s been 5 weeks and he’s living in the basement. \n\n\nNow he’s telling me he wants to be back with me and he’ll make some changes. Which idk if I believe him.  At what point do I leave or stay for the children??? I do feel terrible that he’s sleeping in the basement. But I can’t shake that night.",
        "created_utc": 1674482030,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you handle social comparisons while trying to change yourself?",
        "author": "HonestlyDontKnow24",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jcz6m/how_do_you_handle_social_comparisons_while_trying/",
        "text": "Hi all-\n\nI've been something of an introvert who's lived in my own world much of my life (depression, anxiety, etc). After a few years of reflection and growth, I'm trying to spread my wings, get out in the world, and make more connections. A lot of it's going well, but one challenge I have is I'm making a lot of comparisons.\n\nI live in a HCOL area and have been trying to go to meetups. Most people at the meetings are in their mid to late 20s (I'm in my mid30s), and I find myself kind of intimidated. Many seem very cool and rich  (they're almost all tech people and I'm not) and capable, with nice clothes and good social skills, and I'm an often awkward introvert trying to get better socially and make up for lost time. I feel weird about my clothes (which I've never cared much about or been good at), my age, my career, etc. *I* know that, compared to where I've personally been psychologically, I've made a ton of progress. But then I look at someone over 10 years younger than me who does so much of this stuff effortlessly and it's rough.\n\nI know the common advice is \"don't compare your insides to someone else's outsides,\" but I genuinely do believe a lot of these folks, while they have their own challenges I'm sure, are just more put-together than I've ever been.\n\nSo I dunno. I'm trying to stick with it and keep learning and growing, but it can still be hard. Any thoughts or suggestions are appreciated!",
        "created_utc": 1674481966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women who work mon-fri out and do basically all the house chores during the week, how do you organize it?",
        "author": "fleabag1991",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jc9ng/women_who_work_monfri_out_and_do_basically_all/",
        "text": "I (31f) work mon-fri 9 to 6pm at the office; and live alone with my 2 cats in a house that despite not being big, it's not super easy to clean as it has a lot of constructions around so the amount of dusty is unbelievable. \n\nAnyway, I really want to create a schedule where I can do the house chores + some cooking during my weekdays so on weekends I can just rest without feeling guilty that i didn't do x or y. \n\nI struggle with a poor executive function sometimes so it's been a challenge for me. Looking forward to hear how other people organize this. Thanks a lot.",
        "created_utc": 1674479838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spa re pair of underwear in the car.",
        "author": "DeathFromAbove02",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jc0b9/spa_re_pair_of_underwear_in_the_car/",
        "text": "My wife  took our daughter to church last night and I picked her up in my wife’s car. I noticed I didn’t have my phone charger so I looked around her car to see if there was one in there.  When I opened the center console, under some papers she had a folded pair of underwear. \nI was in her car the other day and didn’t notice anything. \n\nSo the question is, why would she need/have a pair of underwear in the car?",
        "created_utc": 1674479048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Family history of breast cancer",
        "author": "nikz771",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jbz9d/family_history_of_breast_cancer/",
        "text": "Hi everyone\n\nHas anyone been in the situation where their mum had breast cancer at a young age? \n\nMy mother was diagnosed with breast cancer age 39 and passed away a few years later. I’m approaching age 30 now and I know my risk is increased. I feel really scared about this. \n\nThere has been no other cases of breast cancer in the family. My mum’s two sisters are both alive and well in their 60s. Her brother is also well and his children including females in their late thirties all fine. \n\nGiven she had it at a young age, which is unusual, my sister and I are really scared about our risk. Despite lots of research and speaking to my doctor, I find it hard to ascertain the level of risk we face. I’ve seen different figures and the specialist I spoke to said if there was a genetic link there’s typically more of a pattern. But now I feel like I’ve seen so many stories of daughters getting it where their mums have. \n\nI don’t know exactly what I’m asking for here, I guess it would be good to hear if anyone had been in a similar situation. Or has anything useful to share. \n\nThank you :)",
        "created_utc": 1674478963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guy who works at the cafe is so LOUD and whiny?",
        "author": "Character_Peach_2769",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jbl4i/guy_who_works_at_the_cafe_is_so_loud_and_whiny/",
        "text": "I live in a small town, not many cafes. The best place is one near me. I go there and work on my laptop some days and it's really chill with good coffee. \n\nWell, it WAS really chill. \n\nThey hired a new guy at the cafe, and he is so annoying! He'll start hoovering in the middle of the day right by me, and in between this he has to shout over at other batistas (who generally don't reply much, just \"yeah mmhmm\"). He'll be shouting about the previous customers, if someone seemed a bit rude or really any grievances. \n\nAnother thing that irritates me is that he'll perfectly smiling and courteous to the male customers, but the young women he serves really bluntly with this dead look on his face. \n\nHe's in his late twenties and I don't know if he has his back up about working as a barista, but he's really killing my vibe. \n\nWhat would you do?",
        "created_utc": 1674477746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me be a better husband please",
        "author": "ThrowRA0182716555219",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jb5iv/help_me_be_a_better_husband_please/",
        "text": "[removed]",
        "created_utc": 1674476333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worried my wife may leave",
        "author": "ColdWeatherGuy",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jb4s9/worried_my_wife_may_leave/",
        "text": "I don’t think she enjoys sex with me anymore. She is silent and distant and when I ask if everything is ok she says yes and then all of a sudden she’s into it. She’s had a more adventurous past than I have and at one point when we were dating after some wine she said she wished I wasn’t so boring in bed. She only wants to do missionary now because she says she knows it’s my favorite but I think it’s because she knows it won’t take very long. I’ve tried talking to her about all of this but she either gets defensive or changes the subject. \n\nI know this isn’t a sub for men’s issues and I apologize but I’m lost and I want to fix this with her.",
        "created_utc": 1674476264,
        "upvote_ratio": 1.0
    },
    {
        "title": "what kind of podcasts are we all into right now?",
        "author": "Adorable-Ring8074",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10jahwz/what_kind_of_podcasts_are_we_all_into_right_now/",
        "text": "",
        "created_utc": 1674474048,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was the biggest lesson you learned in 2022?",
        "author": "briefly_accessible",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j8wys/what_was_the_biggest_lesson_you_learned_in_2022/",
        "text": "",
        "created_utc": 1674467817,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you feel if a significantly younger men than you (-8 years) approached you with dating intentions?",
        "author": "DetermineAssurance",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j7owm/how_would_you_feel_if_a_significantly_younger_men/",
        "text": "[removed]",
        "created_utc": 1674462686,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Professional advice) What's your advice for teeth whitening at the dentist? Is it worth it?",
        "author": "Desperate-Proof-3213",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j7cd2/professional_advice_whats_your_advice_for_teeth/",
        "text": "I've had this wish to have my teeth professionally whitened for a long time now, but I still have some questions about it. If someone professional amongst you could answer these questions, I'd appreciate it a lot.\n\n- how many types of teeth whitening procedures are there? and which ones are the best? I've talked to my dentist she told me that they offer a procedure where they make a mould of my teeth and then offer me an at-home kit to use at home to whiten them, is this method the best one?\n- with the method mentioned above, how fast will I see noticeable results? &amp; how long will my teeth stay white?\n- I don't drink any coffee, alcohol, wine or black tea, nor do i smoke, so will i have prolonged results?\n- what are the side effects of this method?\n- and lastly, what's the best way to take care of my teeth after this whitening procedure?\n\n\nPS. where I live the teeth whitening procedure costs around 140$\n\n\nthank you",
        "created_utc": 1674461206,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m wondering if those of you that have a lower back tattoo would still get it if you could go back in time.",
        "author": "mnlmitch",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j4ygh/im_wondering_if_those_of_you_that_have_a_lower/",
        "text": "",
        "created_utc": 1674452115,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just can't with men",
        "author": "rpaul9578",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j4t3a/i_just_cant_with_men/",
        "text": "Well that's depressing. I signed up for a free credit monitoring service and they provided all the men on the sex offender list within a 2 mile radius. All 90 of them. With details. Many of them with children under 14. That's 45 per square mile. Bloody hell.",
        "created_utc": 1674451591,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is a good starting conversation with a guy you know nothing about?",
        "author": "PersonalityUpbeat870",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j4hez/what_is_a_good_starting_conversation_with_a_guy/",
        "text": "There is someone at gym I like to talk to. What is a good convo (a little flirtacious, kind and respectful) for start?",
        "created_utc": 1674450445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you get scared when you're alone in your house at night?",
        "author": "zouss",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j3w41/do_you_get_scared_when_youre_alone_in_your_house/",
        "text": "I usually live in an apartment with a roommate but past few weeks have been housesitting for a friend. I've been in houses alone before but always outside cities; here I'm in NYC and for some reason it's made me feel very unsafe. Every night when I shut down the lights to sleep I find myself lying awake freaking out over any sound I hear, going back down a couple times to triple check I locked all the doors, feeling paranoid I'll find a face staring at me through the window or somehow someone managed to sneak into the basement during the day and now they're going to come out. I know consciously that I'm being silly but I can't help it. My friend has a nice place and I'm glad to be here but honestly the nights are kind of ruining the experience.\n\nAnyone dealt with this/have any tips?",
        "created_utc": 1674448533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone find their home is what grounds them, gives them a sense of protection, sanctuary and safety?",
        "author": "Pristine_Sky_5634",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j3n8s/does_anyone_find_their_home_is_what_grounds_them/",
        "text": "[removed]",
        "created_utc": 1674447765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice Needed: Choosing Love with Age Gap Significant Other or Age Appropriate Partner",
        "author": "Spacequest89",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j3kh0/advice_needed_choosing_love_with_age_gap/",
        "text": "Some background: I am a mid-twenties female who met and is deeply in love with someone who is 26 yrs older. I realize the significance of this and realize the challenges that come with many age gap relationships. We are on the same page regarding children, finances, etc, so that is not an issue. I also realize that I may need to be a caretaker for him in his later years, and also accept it as part of the reality of choosing to be with him. \n\nHowever, the biggest fear for me is due to the significant difference in age, it is likely that he will pass before me and I will spend decades alone. Dating is extremely hard as is currently, and I cannot imagine trying to date in my older years and trying to find someone. \n\nI am so absolutely in love with him for the person he is and the qualities he possess. We just connect in a way I have never experienced before. I really do not think I will find someone like him ever again and I feel like this is my chance at true love. So here is the question: Should I be with him and enjoy our relationship or just find someone age appropriate (with whom I get along with, but just don't click as well with/don't have as much feelings for) that I can grow old with? Would it be worthwhile to find an age appropriate partner that I don't have as deep feelings, and bank on the fact that we won't get divorced, we will be good to each other and take care of each other even into old age? \n\nI am hoping to get advice from ladies in this sub who have some wisdom and life experience on how to navigate this situation and what your thoughts are. Thank you!",
        "created_utc": 1674447526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this girl normal? Or something wrong with her!?",
        "author": "Prestigious_Text_349",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j1zlo/is_this_girl_normal_or_something_wrong_with_her/",
        "text": "Hello ladies of reddit i'am a young man almost 20 years old i know a girl who has a crush on me (more like obsession) it might be funny to you but this woman is in love with my body hair and obsessed with it i don't know why! normally if  girls wanted to flirt with me they ask about a n*de photo  but this girl is different when she's horny she ask's me to take a photo of my body hair and when we met she doesn't stop complementing it ... \nIs this girl normal? Or something wrong with her?\nI just need an answer \nBecause nothing is special about my body shape im skinny - white boy - kinda hairy ect ..",
        "created_utc": 1674442615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mom’s hearing has gotten really bad and I’m not sure what to do",
        "author": "cass2769",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j1jc1/moms_hearing_has_gotten_really_bad_and_im_not/",
        "text": "My mom’s hearing has been declining in recent years. She’s late 60s in good health.  I didn’t realize how bad it had gotten until a few months ago when I moved home after a breakup.\n\nShe has hearing aids that she rarely uses.  I get the sense they just don’t help that much.\n\nMostly it’s no big deal.  Most people she interacts with know about her hearing and they adjust accordingly but lately there have been a couple instances where she’s gotten upset at service workers.  I wasn’t present for either instance but I have a feeling the problem is that she couldn’t hear them properly.\n\nMy mom is not a big “I want to see your manager” person but if this keeps happening I think it might go that way.  She’s a very smart and aware person but she doesn’t seem to recognize this might be due to hearing issues.\n\nThen again, I’m not sure.  I wasn’t there.\n\nThere was one time a couple months ago I was with her when something happened with this.  I made eye contact with the service worker and sort of mouthed “I got it” to them.  I hate to have to act like my mom is a baby or less than capable of caring for her daily needs.  It’s more that she’s such a kind person I hate to see her interactions with the outside world decline.\n\nI’m not sure what I’m looking for here.  But anyone ever experience this?",
        "created_utc": 1674441212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you start getting night sweats in your early 30s? (Not menopause)",
        "author": "adressedupskeleton",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j1j64/did_you_start_getting_night_sweats_in_your_early/",
        "text": "I'm honestly at a loss and I've done SO MUCH Google searching and reddit searching and I feel very much alone because it seems like no one is having this problem. \n\nI am 33 cis female. I started having night sweats around 3 years ago when I turned 30. It is EVERY NIGHT. Some nights are worse than others but I haven't had a sweat free night in years. I have been to an OBGYN, primary doctor, endocrinologist, and a functional medicine doctor. I have had bloodwork. Its fine. I have had my hormones tested. They're fine. I am not in early menopause - we checked. I do have PCOS but I've had it since I was a teen, it's well controlled now on and it's never caused sweats before. I also have suspected endometriosis but not surgery yet to prove. My OBGYN says Endo does not cause night sweats. \n\nI have changed my diet. I have changed to all natural fabrics. I have tried exercising/yoga/meditation. I fluctuate weight wise and I've had them at 125 pounds and 150 pounds so it is not weight related. I have tried sleeping nude, sleeping clothed in natural fabrics, sleeping with a fan, sleeping with AC blasting. None of it has stopped them. I have had them on birth control and off birth control so it is not birth control related. I had them on and off Lexapro so it is not my anxiety medication. Is this just my life now? Are some women just hella sweaty at night over 30?",
        "created_utc": 1674441199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you celebrate your pets' birthdays?",
        "author": "goddess_banana_fana",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j1ilw/do_you_celebrate_your_pets_birthdays/",
        "text": "Just curious if you do. What did you do for it?",
        "created_utc": 1674441152,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often should you see a doctor?",
        "author": "Dry-Grapefruit-8665",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j1h8j/how_often_should_you_see_a_doctor/",
        "text": "How often should you go to the doctor to get a check up?",
        "created_utc": 1674441036,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I improve my life",
        "author": "Lana_Anthony_Kane",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j0mm3/how_can_i_improve_my_life/",
        "text": "I’m feeling depressed, lost, and like a loser. I’m over 30 and still living with my parents. I paid off my student loans but only make $55K as an Office Manager. I also feel like I’m not motivated. When I get home from work, I’m so exhausted from the commute and day that I only have energy to eat dinner and go to sleep. \n\nI’m not sure what to do to change my life. The easy answer is to get a higher paying job. However, I live in an expensive city. I also don’t want roommates and would like to save up for a house. However, that’s also depressing to think about since nothing is affordable. \n\nSometimes I think about going to grad school or getting a certificate in something, but I don’t want to get into debt again. Also, if I went that route, I’d have to find time to study which would only be the weekends. \n\nI’m also trying to date and that makes me depressed as well. I’m truthful about living at home, but guys don’t stick around.\n\nI’ve also thought about moving to a lower cost of living state but that seems scary. While I want my own place, I don’t want to be super far away from my family. \n\nI don’t know what to do and feel like everything is a dead end.",
        "created_utc": 1674438492,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you cope with family estrangement?",
        "author": "ms_p28",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10j05xr/how_do_you_cope_with_family_estrangement/",
        "text": "Question’s in the title. \n\nI’m generally interested in how folks deal with feelings of loneliness and deep sadness, if this is a part of their experience. I am especially interested to hear from others who are experiencing estrangement from family member(s) in light of ongoing scapegoating or other forms of emotional abuse.   \n\n\nHow do you stop yourself from reaching out when you know it will be somehow used against you?\n\nhow do you deal with the sadness associated with happy family memories, if you have them?\n\nhow do you build community when emotional abuse and isolation have made you so scared or distrustful of other people?  \n\n\nI’m in good, long term therapy and have a supportive spouse. Interested to hear from this lovely community in the wake of a new rupture. thanks all.",
        "created_utc": 1674437110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a nice way to tell someone that you appreciate the gift, but would rather they not if they’re going to purchase from certain shops?",
        "author": "lemonadeonasaturday",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10izxy0/is_there_a_nice_way_to_tell_someone_that_you/",
        "text": "I refuse to give my money to places like Amazon. My family knows this because I’ve been very vocal about it for years. Still, my sister will mail me gifts coming from Amazon. I tried to steer her away this year by sending her screenshots from another website that had what I was looking for and would deliver to me (we live across the country and she insisted that I shouldn’t go pick up my own gift.. I pick my battles). To my surprise, an Amazon package showed up. I’m very grateful for her putting all this effort to get me something. And I get that it’s her money and she can spend where she chooses. But I’m surrounded by Amazon packaging waste and am irked. I’d rather she not get me anything. \n\nIs there a polite way to set this boundary?",
        "created_utc": 1674436448,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you handle family members who get upset when you remember things differently?",
        "author": "flipthescript95",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10izv87/how_do_you_handle_family_members_who_get_upset/",
        "text": "Everyone in my family seems to remember things differently. It’s not usuaully an issue for me, we are different people who have had different experiences.\n\nBut my sister (27) seems to get particularly upset and actually angry when I don’t remember things as she does or when I feel differently. \n\nHere’s a small example…\n\nOur mom lost most of her teeth because she didn’t have papers or access to regular dental for most of her life. My sister and I are citizens and had Medicaid covered care and our mom took up to the dentist as much as those policies allowed, which included several visits a year. She would remind us to brush and floss and lecture us often. She and my sister would fight because my sister didn’t like to do those things. It wasn’t until she got bullied for having forgotten to brush her teeth one day in middle school that she finally started brushing and flossing without a fight. \n\n10+ years later, she told me she recently had 3 cavities and how she wishes our mom cared enough to make us brush our teeth. I mentioned the blow out fights about teeth rushing and she got upset saying that never happened and that mom only took us to appointments because she had to legally, which isn’t true. She was so upset I began questioning my own memory of it. \n\nAnother example is that recently she said she was afraid of wearing feminine or revealing clothing because our mom would yell at us about how important it was no to be too sl*tty. So she had a lot of shame around sex and being sexy. When I mentioned that I actually don’t remember her doing that she asked over and over again “Don’t you remember how she would yell? You really don’t remember?” \n\nAnd I said no, I really dont. I was curious to get more info because she said it with so much conviction I was suddenly not sure. \n\nI remember our mom being the opposite, in fact I remember when we stopped dressing emo and started wearing Brazilian jeans and crop tops, our mom was so happy and would encourage us to wear whatever we wanted without shame because she wishes she was able to wear whatever she wanted growing up. I don’t remember her ever yelling at us about not being modest… it would be so opposite of what our mom would do. Our mom would tell our dad to see quiet if he had any issues with what we were wearing. She’s from a country where dressing up and being sexy are totally normal and welcome. I’m wedding dress shopping and my mom has been sending me dresses that have plunging necklines and are tight. I didn’t mention any of this to her because usually sharing my experience makes things worse. So I usually just let her share hers. \n\nWe have a lot of friction related to these sorts of things. I usually just say I remember it differently and I’m fine with that but she gets really upset.\n\nI’ve tried to explain that we’re different people with different perspectives of shared and not shared experiences. We’re bound to remember and see things differently. But it makes her really upset and I’m not sure what to do. Any help appreciated!",
        "created_utc": 1674436228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overdramatic.....",
        "author": "Cloud_Additional",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10izqjw/overdramatic/",
        "text": "Movies....or too much gore, or just big named celebs that in my opinion can't act outside of the persona they have for themselves, crack me up.\n\nWas watching the newest Jurassic World movie earlier today and just some of it is soooo cheesy. Or even the CG is too much.\n\nLike back in my day 😆😆, while they used CG they also used the anamatronics and it seemed sooo realistic. Or maybe that was part of the magic of being a kid. *Because just looked it up and they used them in the new one*\n\nAnd even though I steer clear of horror films for the most part I did watch the new scream and the new Halloween and it was just so much unnecessary gore.\n\nAnyone have some good movie recommendations? Old ones, new ones, funny, sad, whatever you got share with me please.",
        "created_utc": 1674435854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are the work from home jobs?",
        "author": "skite456",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10iz0vn/where_are_the_work_from_home_jobs/",
        "text": "I see so many people who say they work from home and my city has had a huge increase of new residents who make large salaries working from home, but what are these jobs?? When I look for work from home jobs online it just seems to be selling vacations or credit card companies, working the call center for comcast and similar jobs. These are not high paying gigs. I feel so old lately on what’s new and on trend. What am I missing?",
        "created_utc": 1674433833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Secret aspirations.",
        "author": "40oz_Mouse",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10iz0bf/secret_aspirations/",
        "text": "What is something you’ve always wanted to pursue but don’t often tell other people about it? \n\n\nI’ve always wanted to become great at competitive eating. Not speed eating, but more like “can you finish this pizza as big as a table” competition. \n\n\n\nI’ve also always been interested in trying to learn how to free dive (think scuba diving with no tank). However I also fucking love breathing and those competitions freak me out a little. \n\n\n\nWhat about you? Do you have a skill you’ve always wanted to learn or a different occupation you’ve always wondered about?",
        "created_utc": 1674433792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone schedule two dates in the one day?",
        "author": "supremelyparanoid",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10iyj3s/anyone_schedule_two_dates_in_the_one_day/",
        "text": "I want to organise two dates in one day. This would be for first dates where it might be a coffee or drink. Nothing to crazy. \n\nI hate getting ready for just one date: hair, make up, effort of leaving the house lol. I rather maximise my efforts if I can get them lined up on one day around brunch / lunch. \n\nAny ladies done this successfully?\n\n- did you find you were saving a bit of time on the weekend / weekday doing this? \n\n- did you find that you could tell who you got along with (or not) faster this way?\n\nSome parameters I have: \n\n- For first dates I like to keep them short, 1-2 hours. \n\n- I’m not looking to have sex with any of these dates as I’m not a sex on the first date type of person (nothing wrong with it, just not for me). \n\n- I’d go to a different location to keep the risk of a run in low. \n\n- I wouldn’t tell the dates that I had multiple dates that same day. However, I wouldn’t hide that I was on a dating app dating other people. Which is where I meet all my dates. I’d assume the guys I’m on a date one would be doing the same.",
        "created_utc": 1674432429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you accept expensive gifts from men you're not interested in? Do you refuse a gift just so you don't send a \"\"wrong message\"\"?",
        "author": "nonstopCairina811",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10ix2fc/do_you_accept_expensive_gifts_from_men_youre_not/",
        "text": "Hey everyone\n\n&amp;#x200B;\n\nSo, I'm a woman in my early thirties, and I've been thinking a lot about the topic of accepting expensive gifts from men. I've had a few experiences where I've received gifts from men who I'm not particularly interested in romantically, and it's always been a bit of a tricky situation for me. I consider myself friendly and outgoing, which can clearly sometimes come across as \"\"flirty,\"\" but there's a difference between being invited to coffee and men buying pricy things to get your attention. The latter is starting to make me really uncomfortable.\n\n&amp;#x200B;\n\nFor example, last year, I received a beautiful leather handbag from a friend of mine. We've known each other for a while and have always just been friends, but after he gave me the bag, I started to suspect that he might be interested in something more. It was a really lovely gesture, but it also made things a bit awkward between us, and I'm still not sure what to think about it. The leather garment bag is rather expensive, as well.\n\n&amp;#x200B;\n\nAnother time, I received a piece of jewelry from a guy I had just met. He was clearly trying to impress me, but I wasn't interested in him at all, nor did I show any signs. I didn't know how to refuse the gift without hurting his feelings or making it awkward, so I ended up accepting it even though I felt uncomfortable.\n\n&amp;#x200B;\n\nI've also received a few other expensive gifts over the past year, like a designer purse and a fancy watch, but those experiences were similar to the ones I just described. I'm not bragging, by the way, and I'm sure I'm not the only one in this particular situation.\n\n&amp;#x200B;\n\nIt's not that I don't appreciate the gifts, because I do. It's just that it can be difficult to know how to handle the situation when a man gives you something expensive, and you don't understand why. I don't want to hurt his feelings by refusing the gift, but I also don't want to give him the wrong idea by accepting it.\n\n&amp;#x200B;\n\nI'm curious to hear from other women and how they deal with this kind of attention. Any advice or tips would be greatly appreciated. Thanks for reading!",
        "created_utc": 1674428582,
        "upvote_ratio": 1.0
    }
]