[
    {
        "title": "is this a bad idea? want to talk to my MIL about boundaries",
        "author": "ndcc-2022",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xugpr/is_this_a_bad_idea_want_to_talk_to_my_mil_about/",
        "text": "So, my MIL and I have had a pretty good relationship over the years. I've let things go in the name of keeping the peace. She is an amazing grandma, truly loves my kids, and helps as much as she can, even while living out of state. My parents are not the best grandparents, so I'm not trying to ostracize the good ones we do have.\n\nThat said, after my in-laws' last visit here, there are some things I am stewing over. \n\nOne, for instance, is that my MIL has a habit of saying things about me under her breath. It's not often but has happened enough over the years. I called her out on it years ago and she just brushed it off.\n\nMy MIL definitely thinks her son does too much around the house. When they visit, he is extra helpful because he knows I get overwhelmed with guests. Anyway, last time they were here I was very preoccupied with prepping for a (dream job!) part-time job interview. I spent a couple days prepping while my husband handled a lot of the house stuff. One night, we were sitting around and talking about stuff. Somehow, the topic of men getting sick came up and I made a joke about how my husband is super whiny when he's sick. (A stereotype but true.) It was totally lighthearted, just poking fun at him. I was in the kitchen and she was in the living room (connected). I am 99% sure that she said, \"maybe he's just tired of waiting on his wife\" to her husband.\n\nMy body immediately tensed up and I said, \"what did you just say?\"\n\nShe said, \"oh, I said it is true that women deal with pain better.\" I said, \"that's really what you said?\" She says, \"yes.\" I get really tense and go to my room. I knew she didn't say that but chose to let it go in the moment. Ten min later, she comes up crying and gives me a hug and says she's so thankful to have me in her life. Wtf! I am just so confused by her. 90% of the time, she really is good to me and treats me like a daughter. But then we have these random moments like this where I feel angry but also completely confused because her words and actions don't match up. \n\nI'm still irritated by this weeks later. Do I say something? What if she deines it and says I misheard her? (My parents used to joke that I have superhearing because I could/can hear things from far away).",
        "created_utc": 1675948456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad clothing choices",
        "author": "92yraurbeF",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xucde/bad_clothing_choices/",
        "text": "I was wondering if someone else has the same issues.\n\nI set myself a challenge to improve my habits on clothes shopping. So I am that type of person who can grab a thing just because I liked it at the moment. Nothing fancy much. \nHowever I just realized I’ve no certain style. Turns out I wear only 30% of my clothes. \n\nLike I have these mom jeans because I liked them and now never know how to wear them, for instance. It ends but with a couple of thousands dollars wasted. Not speaking of time and frustration or  space occupied by these clothes. \n\nIt was mind blowing to learn that one manager (makes six digits a year) has only 6-7 tops and twice less bottoms to wear. They always travel light. So their advice was: know your style and stick to it. This way, you won’t buy unnecessary things.\n\nHas someone any tips as well? \nThank you",
        "created_utc": 1675948106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men are fucked",
        "author": "_Inter_esting",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xtxan/men_are_fucked/",
        "text": "Not all of them and not all the time but duck their stupid projections and emotionally immaturity seriously! Why do we have to wait so long for one man to just get the basics??? \n\nOh my god.",
        "created_utc": 1675946874,
        "upvote_ratio": 1.0
    },
    {
        "title": "boys…!",
        "author": "teenagesalmon",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xsauu/boys/",
        "text": "[removed]",
        "created_utc": 1675941406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else hanging out in a dead end relationship?",
        "author": "AnguaVU",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xrviy/anyone_else_hanging_out_in_a_dead_end_relationship/",
        "text": "I've been dating my boyfriend for close to 2 years. I know that we won't be together long term, and a lot of time I want to break up. The main reasons are his refusal to treat his mental health and weed addiction. \n\nWe don't live together and have no plans to. Right now I'm in a sort of life limbo. I've recently started a new job and am in a non ideal living situation. In a few months I'll be moving into my own place and I'm very excited. Work takes up the majority of my week and my weekends I don't have a huge amount to do except relax etc. I tend to spend this time with my boyfriend, it's easy and we chill and sometimes do fun things.\n\nThis isn't really a post asking for advice, but just wondering if anyone else is in a similar situation? I know I should break up with him, but my life has been tumultuous the last 9 months and I don't have the energy for it. Sometimes the relationship is really shitty, but as I said above most of the time it's ok. I just feel gloomy often, knowing the relationship has an expiration date.",
        "created_utc": 1675939903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad that I feel happy?",
        "author": "_Inter_esting",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xrfpk/is_it_bad_that_i_feel_happy/",
        "text": "Post breakup (3 days) and I feel elated. I just turned up EDM music and caught myself SMILING to myself!!! \n\nThis was a 9 year relationship. The last two n half years were long distance tho cause he couldn’t get his shit together - so, I guess I’ve already grieved since we lived apart? I tried to warn him this was happening rhe longer we are apart but yeah fuck him! \n\nI know I’ll have some ups and downs in coming weeks but I don’t mind. I truly feel I’ve already done at least partial grieving in this last year alone. I kept avoiding him and it wasn’t feel the same just he’s so detached and always the victim \n\nI’m pissed I spent 9 fucking years waiting for him to get it together but I’m 36 which means I can still go out in the world and be me. And maybe someone will like me and maybe they won’t. I just wanna LOVE me again and be happy 😊",
        "created_utc": 1675938264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to speak to people who have managed to overcome ‘the ick’ in their relationship!",
        "author": "Adorable_Law2577",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xr7k1/looking_to_speak_to_people_who_have_managed_to/",
        "text": "[removed]",
        "created_utc": 1675937422,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Nice thread about and for us Ethical Non-Monogamists",
        "author": "TwoOranges",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xq1uj/a_nice_thread_about_and_for_us_ethical/",
        "text": "That other thread is frankly disgusting and demoralizing to read, and I used to like this forum until today. Can we please have a positive thread for those of us who \\*are\\* into this sort of dating? Hi ladies, it's nice to meet you and support you.",
        "created_utc": 1675933030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help identify the nature of this 'friendship'?",
        "author": "brainwaveseagull200",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xp1zs/can_someone_help_identify_the_nature_of_this/",
        "text": "Since the pandemic and feeling somewhat isolated, I started having regular phone calls with a friend of a friend.  She's bright and chatty, and with her lack of social and work life has the time to support me through many of life's ups and downs. I think she's quite lonely and I am somewhat too, so I know our calls are a positive for her. However, I do not think I like her very much. We have very different values and I think it makes me feel frustrated and deep down even more isolated and misunderstood. It doesn't help that I just moved away from hometown and lost contact with much of my wide circle of friends. I am making steps to rebuild my friendships but it's overwhelming. \n\nThere had been times when I became so annoyed and frustrated with her, that I didn't speak to her for months and it was actually a productive time for me. But then I feel guilty or something happens and I know she will be at the other end of the line. She also has her own issues, and I tried to be supportive but she refuses to take responsibility for them so it is equally difficult to be talking or gaining advice for someone who is not particularly thriving. \n\nDo I need to accept the friendship for what it is? Or do I need to evaluate whether I am doing the right thing?",
        "created_utc": 1675929195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Being Able to Get into Relationships Easily Make Them Less Meaningful?",
        "author": "J0E_Blow",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xn93w/does_being_able_to_get_into_relationships_easily/",
        "text": "I've heard from women that it's easy to have sex and get into relationships. If it's easy does that make them less meaningful? A lot of women I know go through a breakup but within a month or so they're with their new \"love\" and are happy as a button. It often feels like it'd make the relationship less real if it was so easily created.",
        "created_utc": 1675922974,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired of non-ethical monogamists on dating apps. Like stop",
        "author": "Literatelady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xkiof/im_so_tired_of_nonethical_monogamists_on_dating/",
        "text": "Who is with me? I matched with a guy I didn't realize was non-monomagous on Bumble and I saw it on Hinge. His response to me pointing that out was that he wants to \"figure out his relationship type more so than non-monogamy?\n\nMore seriously do you know people doing this where it actually works and doesn't end in a huge drama mess?\n\nSorry I'm judgy today and tired.",
        "created_utc": 1675914540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Major cleaning concern",
        "author": "cass2769",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xkd63/major_cleaning_concern/",
        "text": "A few years ago I moved in with a partner and boxed up all of my kitchen stuff and put it in my parents basement. A year or two ago my parents basement flooded due to a sewer back up.  A lot of things had to be thrown out but most of my kitchen ware was not touching the sewage so they left it.  \n\nAlso over the years my parents cat appears to have come into the basement and urinated on some of the boxes in storage.  Some of my dishes seem to have residue of this.\n\nNow I’m single again and in need of household items… And I really don’t wanna start from stretch considering I have good things in storage.\n\nBut… With all of the nastiness my stuff has been exposed to over the years is it possible for me to clean these items well enough that I could use them without fear? Dishes, pots and pans, cutting boards, glasses, mugs, mixing bowls, Tupperware style containers.  It would probably be several hundred dollars to replace them.\n\nDo you think it’s possible for me to clean these things in such a way that they would be safe to use going forward? How would you go about it? Or would you always be worried that something gross was still lingering?",
        "created_utc": 1675914098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 40 too old to start a career?",
        "author": "cafeteriastyle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xk370/is_40_too_old_to_start_a_career/",
        "text": "I’ll be 40 this month. It’s been hard to come to terms with and honestly I’m scared to death. I’m married with two boys, they’re still young (6 and 12) which I’m glad about; I’ll have them with me for a few years yet. I have stayed home and taken care of them for about the last 10 years.\n\n Now that my youngest is in kindergarten I’d like to go back to work. I have experience in primary education. I was finished with all the coursework to become a teacher and in student teaching when I got pregnant, so I didn’t finish. I’m not sure education is where I want to be. I worked as a TA in a special education classroom for awhile and I did enjoy that. But I don’t want to be a teacher. \n\nMy undergrad degree is in Economics, but I’ve never really used it. Shortly after I graduated I worked at a real estate law firm doing foreclosures during the housing crash. That’s more along the lines of what I’d like to do, office work. \n\nAnyway, I don’t know where to start. I’m extremely nervous to go back to work but I know I need to. My husband would really like me to work but he doesn’t want me to take any jobs that don’t pay well. But I have no experience, and I need to get used to the workplace again. I just feel very frustrated about that bc he wants me to go back to work but nothing I show interest in seems good enough. He thinks bc I have a college degree I should be able to find something better. \n\nI have a misdemeanor on my record I need to get expunged before I put in any applications. I’m dragging my feet on that bc getting a job seems really scary. I am not a very social person, my social anxiety is pretty bad and I also have OCD. M depression in the past. Tbh I’m pretty depressed about my whole situation right now in general.\n\nIf anyone has any advice or kind words, I would so appreciate it. I’m tired of feeling like I’m a failure. I’m afraid to turn 40 and I’m feeling very old. I miss my youth and constantly wish I could go back. My life now just feels like such a disappointment. I just don’t know what to do.",
        "created_utc": 1675913320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confirmation I need to let go",
        "author": "oppokkll",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xjf9v/confirmation_i_need_to_let_go/",
        "text": "[removed]",
        "created_utc": 1675911503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you noticed that having a degree or not, has affected your career progression?",
        "author": "marmaladeskies80",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xjc32/have_you_noticed_that_having_a_degree_or_not_has/",
        "text": "I attended college out of high school and managed to obtain 37 credits but due to cost of college (parents didn’t help), I dropped out.  \n  \nI’m 37 now and worked hard in the workforce and managed to land a great career that often required a degree and worked in that for a decade.  \n  \nBut I’ve since switched industries in the hopes of increasing my salary.  \n\n  \nNow I’m in insurance (not sales) and I feel like everyone has a bachelors. Even peers in the entry level positions.  \n  \nI find myself feeling insecure and “less than”.  \nI try to give my all and as the cliche goes “work harder than anyone else in the room” to be noticed.  \nOn paper though, my education could only reflect high school and that makes me uncomfortable.  \n\n  \nMy position is what could be considered entry level and I often wonder if I’ll be pigeon-holed and unable to even make a lateral move in the future.  \n  \n\n  \nI have been thinking seriously of obtaining a degree of *some sort*. Associates degree would be easiest and probably most feasible/cost effective.  \n  \nIs an associate’s degree taken seriously in your experience?  \n  \nDo you have a degree?  \nIf not, has this hindered your career?",
        "created_utc": 1675911261,
        "upvote_ratio": 1.0
    },
    {
        "title": "What has helped you manage your depression and become high-functioning?",
        "author": "briefly_accessible",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xiqgj/what_has_helped_you_manage_your_depression_and/",
        "text": "",
        "created_utc": 1675909613,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your opinion, what are the factors that differentiate average sex, good sex, and great sex?",
        "author": "Dreamaminex",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xipf6/in_your_opinion_what_are_the_factors_that/",
        "text": "",
        "created_utc": 1675909531,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do/say when your friend keeps dating toxic people?",
        "author": "Spirited_Shop1625",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xin0h/what_do_you_dosay_when_your_friend_keeps_dating/",
        "text": "How do you show up as a supportive friend if it’s a close friend? Do you engage in their relationship dramas? Do you take a step back from the friendship?",
        "created_utc": 1675909348,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's it like having a plate in your wrist?",
        "author": "Blue_geranium",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xi6dn/whats_it_like_having_a_plate_in_your_wrist/",
        "text": "I'm going in for surgery next week and I'm terrified. My arm was first set and put in a cast and now I've been told that I will need surgery with a plate and screws installed in my forearm close to my wrist or I risk permanent damage from it not healing properly as the break is unsteady. \n\nI already experienced the most extreme pain in my life this week, I'm losing my mind over the level pain I've been told to expect after the surgery and the idea that I'll be able to feel metal lumps in my wrist for the rest of my life. Not to forget the possible future pain like increased risk of carpel tunnel, pain in the cold, etc. \n\nIt's not like I can not have the plate put in but I've been fighting off episodes of hyperventilating and throwing up since I found out.\n\nHas anyone else had a plate put in their forearm by their wrist? What's it like?",
        "created_utc": 1675908119,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did 36 become the new 50?",
        "author": "StandardYTICHSR",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xi5p4/when_did_36_become_the_new_50/",
        "text": "Turned 36 this week. Several colleagues and friends wish me happy \"48\" \"50\"? Is.....36 old? Is this misogyny? Or sexism?",
        "created_utc": 1675908075,
        "upvote_ratio": 1.0
    },
    {
        "title": "“If you make big improvements to yourself after a break-up, you weren’t giving your relationship your best.” Thoughts on this?",
        "author": "Icy_Winner5668",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xhxbg/if_you_make_big_improvements_to_yourself_after_a/",
        "text": "Many people tend to make changes to themselves after a break-up. Working out more. Moving somewhere new. Break-up bangs!\n\nMy (former) boyfriend used to say this exact comment to me frequently- that if I changed at all post-break up, it meant I hadn’t tried with him. He usually said this in the context of my appearance - he was unhappy that when we both worked from home, I would often wear sweats and no make-up. I told him that regardless of whether I was single, newly dating, or married, there would be days where I don’t leave the house and don’t get ready. He just happened to be there to see it!\n\nWhile I think his thought process was nonsensical, the concept keeps knocking around my brain and I wonder if there’s any truth to it. \n\nWhat do you all think- if someone makes drastic changes post-break up, does it mean they weren’t giving enough to the relationship?",
        "created_utc": 1675907475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newly 30…",
        "author": "No_Drive_1940",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xhkt2/newly_30/",
        "text": "What do you do with the things you feel like you can’t tell anyone? About things you have done? Nothing illegal or down that road. Just things you hold shame about. I forgive myself. I have compassion. I just feel like it’s a heavy load to carry all alone.",
        "created_utc": 1675906566,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a subscription-based service you use that's worth it?",
        "author": "farty_mcfarts",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xgy9n/whats_a_subscriptionbased_service_you_use_thats/",
        "text": "Any time I see an ad for something that looks interesting, I get a bit upset when I download the app and I'm given a 7 day trial but then have to subscribe. From meditation apps to stretching to even identifying problems in plants. \n\nI only pay for Spotify Premium because I love music. I can't live without it. \n\nWhat do you subscribe to that is worth it, made a positive impact in your life, and would recommend?",
        "created_utc": 1675904931,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of your ways of coping with burn out?",
        "author": "sweetescapeohoh",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xg6l3/what_are_some_of_your_ways_of_coping_with_burn_out/",
        "text": "I (31f) am trying to create a 'burnout plan' to help me get through it. I live alone and want to make coping with it as easy as possible. Unfortunately cannot afford therapy at the moment.",
        "created_utc": 1675902948,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's up with the 30s tired/old/settling mindset?",
        "author": "Practical_Awareness4",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xf2y6/whats_up_with_the_30s_tiredoldsettling_mindset/",
        "text": "I am turning 31 at the end of this month. I remember thinking 30s was going to feel old but to be honest, I feel like my life is just beginning. I finally have a decent enough salary to enjoy my life and I feel happier and still young. I don't feel like there is a limit to anything I want to do. I dont feel too old to do anything. \n\nBUT THEN THE PEOPLE AROUND ME SAY THINGS LIKE:\n\n\"omg its' not like our twenties anymore.\"\n\n\"I'm so old now.. things aren't like they used to be\"\n\n\"I remember concerts used to be more fun in my twenties. Not anymore\"\n\n\"That isnt as fun as in my twenties\"\n\nPeople normalize gaining weight and being tired in your 30s as something natural because we are \"getting old.\" There's all these jokes about how boring/old life people have in their thirties.\n\nI've gained weight but Im focused on getting into the best shape of my life and Im not accepting it as an age thing.\n\nAnother example: I made a comment to my friend about how I organized my closet over the weekend. All of a sudden, my age gets bought up. Like this is something I do because I'm in my 30s? I've been organizing my closet and cleaning since my 20s! I've always enjoyed cleaning my space. Why is it suddenly a part of my age identity?  When I was 20 and I would have said this, I wouldn't have received a comment like that, but suddenly its my age making me do this?! And this happens ALL THE TIME in micro ways. \n\n\\---  \nI still get depressed like I did in my twenties. I still have amazing days like I did in my twenties. I dont look much older.  \n\nBut it's EVERYWHERE, even memes on social media.. It can influence me or make me wonder if I'm acting immature for still feeling so new and open to evolve. I really do feel like my life is beginning and I finally have a chance to really enjoy my life after getting through the trials of my twenties. Im sorry if this is a bit of a ramble but it makes me sad. \n\n I want to be around people my age but who also match my desire to still enjoy life and explore. Does anybody relate to this? This is a specific energy that I don't know if I'm capturing in my post but I hope I am. I'm not letting it stop me per se, but I also can't help but feel burdened by expectations of what I'm supposed to be. it feels like I'm fighting against something which I never felt in my twenties.",
        "created_utc": 1675900277,
        "upvote_ratio": 1.0
    },
    {
        "title": "handling ambiguity about the future in a relationship - advice on how to proceed?",
        "author": "fridgemenow",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xen8c/handling_ambiguity_about_the_future_in_a/",
        "text": "My boyfriend and I have been together for several years. He struggled with some commitment issues related to past trauma in the beginning but has worked through that awhile ago and we overall have a loving and happy relationship. he recently found out he has to relocate for work for 2 years across the country. the plan is to do long distance for the time being - I just got a new job, he's going to be so busy that it'd be difficult to really build a life out there together so I would probably feel pretty isolated if I moved there, etc. \n\nthe question is what's happening after those 2 years. we are from different parts of the country. I am open to moving somewhere new for a fresh start as I've never left my hometown (where we're both currently living), and he quite frankly has no idea where he wants to end up because it depends on where he is able to find work, the health of his parents at the time, etc.\n\nour values regarding marriage and kids are both similar, as in we both aren't in a rush for either as we want to prioritize things such as traveling and cool experiences. however he brought up that he does not feel like he can ask me to uproot my entire life and relocate for him in the future if we aren't engaged at the time. yet he isn't sure he will be ready for engagement in 2 years. I also do not think I will be ready for engagement in 2 years (but open to it in the future), but I'm also fine with continuing to build a life somewhere new without pressure of marriage. I also told him it was unfair of him to make this decision essentially without me about whether we will move somewhere together or not. I asked him what he expects to happen then after his work relocation is over in 2 years, because I refuse to commit to distance without an end date. he didn't know and he feels like there's so much unknown that it's hard for him to give me any direct answers. \n\nhe expresses he wants to stay together but I'm feeling completely lost. I don't question that he deeply loves me but I can't go into a long distance situation without any idea when we plan to close the distance. is this the end? I'm not sure how to continue and while I'm stating this all matters of factly, I am completely heartbroken especially since we've been thriving as a couple lately and this came out of nowhere.",
        "created_utc": 1675899218,
        "upvote_ratio": 1.0
    },
    {
        "title": "waves of emotions post breakup",
        "author": "iampretzel",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xe485/waves_of_emotions_post_breakup/",
        "text": "I am going through waves of emotions post breakup (been like 4 days now). It hits me in different intervals and very different feelings.\n\nDay 1 - news just hits me, let it sink it. I cried \nDay 2 - I am going to be okay, I don't feel anything. I cried.\nDay 3- I am very heartbroken, sad, there is a feeling of loss. I don't wanna cry.\nDay 4 - I am very angry at how he treated me, I deserve better. I can do so much better.  \n\nToday I was reading some of our old text messages and it really hurt me. He seemed interested and was putting in effort, we made some good memories, we had fun times, it's sad he didn't put the effort to fight for our relationship or he was okay to let me go!! I cried, I cried a lot. I deleted all our messages. \n\nSome days I do fine, I distract myself to doing other things to keep my mind off. But there is this innate sadness that's inside me and I am very positive it's really not worth it, because as time goes as I reflect back I deserve someone way better than what he offered me. \n\nI am trying to go for walks, go into office to distract myself, journal, etc. Breakups really chip away a part of my soul and I know he shall too pass. But that's in the future, dealing the present is absolutely challenging!!! I am an extremely private person, but now I am reaching out to people for support, they are all very surprised I even had a Bf. \n\nI want to heal. The talk I am telling myself is that, once I do all the right things and move on quickly, I am statistically closer to finding the guy who can give me all (hope is a dangerous thing!) \n\nOthers have anything to add? How did you move on and find someone better than the guy who didn't treat you properly?",
        "created_utc": 1675897978,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are your awkward ride share stories?",
        "author": "NormalVermicelli1066",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xdke5/what_are_your_awkward_ride_share_stories/",
        "text": "I'll start... back in my funner days I stayed over at a guy's after a date and tried to Uber home. I rushed out if his place with my bra in my hand because I thought the Uber was outside but mostly I was still pretty drunk. I got picked up and it was a guy driver with two other guy passengers and I Def looked like a ride home of shame in my tiny dress and bra in my hand. They were all very amused and I was so embarrassed and they could tell but were like hey its cool trying to make me feel better I guess. Anyways that was the last time I took an Uber pool.\n\n\nAnother time I got picked up solo and the driver was playing raunchy RNB which included long ass moaning parts and lines like \"I wanna do you after school like homework.\" That was the longest song in the world and I wanted us to get t-boned to put me out of my misery.",
        "created_utc": 1675896740,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found my man commenting/messaging women complimenting them.",
        "author": "Chicken_manure",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xdhky/i_found_my_man_commentingmessaging_women/",
        "text": "Tbh I consider it a sense of cheating. Like soft cheating. I’ll be honest. I’m pretty attractive and have a lot of natural beauty. I’ve fully been committed to my man’s family for 7 years completely. I don’t do social media sites. Other then Reddit and Snapchat (which I only have super close real friends/family on). I never once thought of commenting on another man’s appearance. Obviously I have celeb crushes  but not realistically. Nothing to explicitly message and say sexual things towards. My man is not the most attractive guy. He’s overweight and is aging. But I grew up in a household where looks don’t matter. We all age. I will age too. It’s part of life. I guess I’m just shocked That he would engage in such an immature and wrong thing to do. It’s a break in trust. And I know my self worth. I know that it’s wrong and I don’t really feel the need to validate what led him to do such thing. We got into Ana argument of course where yes he blamed me. “Takes two to tango” talk. And I just held my ground. I told him. No one forces you to look at this content. To engage in it. That’s on you fully. Not me. He says he takes responsibility but makes a backhanded comment. I’m not angry actually. Or sad. I’m disappointed. He has a daughter that’s a teen and I said to him what if some guy did that to her. Wouldn’t you be mad? And he said if she treated him as “distant” as I treat him. It’s valid. Like who says that? I’m sorry this sounds like a rant. But I actually feel so humbled. It doesn’t matter how committed. Devoted. Pretty. Everything going for you. Men will disappoint. I’m so disgusted.",
        "created_utc": 1675896562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanna a play a game of songs/lyrics?",
        "author": "goddess_banana_fana",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xcg1e/wanna_a_play_a_game_of_songslyrics/",
        "text": "You provide lyrics that you adlib to a song you love to sing and dance to.\n\nWe have to guess the song.\n\n**Mine**:\n\nCmon, let's pour\n\nLet's po-o-o-o-o-ur\n\nLet's whisper in the moo juice\n\nWhisper in MOO juice",
        "created_utc": 1675894187,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you handle your decisiveness toward marriage and children in finding a partner?",
        "author": "Familiar-Mongoose-51",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10xaeyl/how_do_you_handle_your_decisiveness_toward/",
        "text": "I am newly single out of a 5 year relationship. We were engaged but for many reasons knew he wasn’t the one and now know I should have left much sooner. It’s only been a few months but met a guy I really like. I’m also starting to have these urgent feelings around marriage and children. I’m 100% certain I want both with the right man. I’m 34 and understand biological limitations. How do you reconcile all these feelings, and timing without scaring off men? I feel like I have enough relationship experience to better vet partners than ever before but is this just over-confidence from desperation? Thanks ladies! :(",
        "created_utc": 1675889556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job burnout and finding a way out",
        "author": "ModestScientist",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x9xp9/job_burnout_and_finding_a_way_out/",
        "text": "I’ve been in an admin/patient facing role at a hospital (US) for a little over 3 years now. The management has entirely changed in that time and my amazing manager left. My workload has also increased tremendously about 7 months ago due to rapid growth. \nThe new management refuses to listen to anything I say and just asserts ‘I’m your manager’ whenever I bring up how much work I am doing. A second person has been hired to help but I’m so overwhelmed and exhausted that training a new person is more mental work that I can currently do. \nI would like to find a new job, but I feel so burned out and overwhelmed that I can’t fathom adding another task to my to do list. I also don’t think I’d want to find the exact same job as it can be very overstimulating for me. Has anyone had this experience before? What did you do?",
        "created_utc": 1675888412,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I care for my changing hair?",
        "author": "mummummaaa",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x8ger/how_do_i_care_for_my_changing_hair/",
        "text": "I'm coming in grey. Nope, I'm not coloring it, at least for a while, I'm living life as a silvery goddess.\n\nBut it's changed. My hair is coarser, and the grey has a wave or slight curl. My not greys are straight.\n\nAfter a shower, I have a fluffy, bushy mess that might do an 80s teenager proud.\n\nSo how do I love my long locks, without looking like I stuck my finger in an electrical outlet or tried channeling Einstein?",
        "created_utc": 1675884955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting your clothing back from someone?",
        "author": "lotsoffireandwater",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x8966/getting_your_clothing_back_from_someone/",
        "text": "[removed]",
        "created_utc": 1675884468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating if terminating this pregnancy or not",
        "author": "iamdua990",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x7c8a/debating_if_terminating_this_pregnancy_or_not/",
        "text": "My husband and I have been married for less than a year. When we were first dating a few years ago he told me he didn’t want kids.  He made some comment about kids and pets being useless- he didn’t say it like this but I’m paraphrasing.  That was the idea of his comment. By then I had my son from a previous relationship. My husband raised his ex’s daughter until she left him for someone else and this hurt him a lot. I believe this left a bad taste regarding parenting and this is why he made such comments.  \n\nI did want to have at least another kid and I expressed that to him for sometime. He was neutral at this point in time but I could see he was doubtful. This gave me a sense of insecurity and caused me to feel inadequate, as he had told me before that he and his ex were planing on having kids until she left. \n\nFast forward to today, I found out I was pregnant. He seemed excited and happy. He told me he wants to have this baby…  had he told me this before I would have been over the moon. But now, I am the one who has changed my mind. I don’t want a baby. I’m 33 and just thinking of starting back from zero is exhausting. I’m curious about how our baby would look like or how parenting would be with him but his comments from a few years ago still haunt me. I still feel inadequate even when he’s reassure me the opposite.  I felt like I wasn’t good enough for him to have kids with but his ex was and that’s why he wanted kids with her.  I know that is ridiculous but I can’t help but have this kind of anxiety deep inside me. It’s an insecurity I’ve never felt before and it’s been quite hard to get rid of no matter how much he tries to convinced me otherwise. \n\nI’m currently about 5 weeks and I have an appt next week to terminate the pregnancy. He has cried about it and asked me to please reconsider. I know this might damage our marriage but i don’t know if I want to risk my body, mental health and happiness to make him happy. I wish so much he had been less crass with me regarding this subject way back when. But we can’t change that and now here I am, full of insecurity, some resentment and confusion. \n\nHow can I assort my thoughts to figure this out?",
        "created_utc": 1675882289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else seeing a rise of misogynistic comments on social media, especially related to Leo dating a 19 YO?",
        "author": "LenoxGrace",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x64cu/anyone_else_seeing_a_rise_of_misogynistic/",
        "text": "Every post I see regarding Leonardo DiCaprio dating the 19 YO (and his whole dating history in general) the comments are FILLED with men saying “she’s an adult, it’s not illegal, no one is forcing her” (ignoring the fact that there is a disturbing power imbalance and her brain is still developing) etc but mostly:\n\n“of course he wants to date women under 25. 18-24 is when women are at their biological prime and highest beauty. For women it’s all downhill once they turn 25.”\n\nIt’s making my stomach turn seeing all these people speak about women this way. Leo isn’t having babies with these women so why does her “biological prime” matter? It doesn’t even make sense and reeks of misogyny because there is zero reflection of men and their aging or looks. IMO, they are disguising the manipulation of young, impressionable women with the claims that it entirely has to do with beautify and the state of our wombs.\n\nThey really don’t value women as people at all. It’s heartbreaking to see this blatant confidence in these insane comments. I know not all men think this way, but it definitely feels like there is a rise. The pendulum swung in the direction of encouraging people to wait until they are older to get married and have kids and now it feels like it’s swinging back. I know their opinions mean nothing, but it’s still scary to see. I’m guessing this is A. Tate rhetoric",
        "created_utc": 1675879287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell Me Your Dismissive Doctor Stories",
        "author": "Initial-Computer2728",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x5q6o/tell_me_your_dismissive_doctor_stories/",
        "text": "Inspired by another thread where I shared an experience of my primary doctor ignoring my headaches &amp; migraines for years, only for an optometrist to help me jump-start a diagnosis. I'm overweight, so my PCP would simply blame my headaches on that. Turns out I had optic nerve swelling not caused by weight at all. And I actually gained weight because of it because I couldn't exercise without my head feeling like it was going to implode.\n\nUnfortunately, this isn't the only time a doctor has been completely dismissive of symptoms when I know something is wrong. \n\nOne time, I told a doctor that I was sleeping 12-16 hours a night and was *still* feeling exhausted during the day. She straight up looked me in the eyes and goes, \"yeah, I get tired easily too.\" AND THAT'S IT. \n\nCommiserate with me, friends. When has a doctor been almost laughably dismissive to you? Were there any repercussions? How are you doing now?",
        "created_utc": 1675878350,
        "upvote_ratio": 1.0
    },
    {
        "title": "What childcare experience did you have, prior to parenthood? If none, what did you do to prepare?",
        "author": "76qZOdo5nJh502lf",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x5o8w/what_childcare_experience_did_you_have_prior_to/",
        "text": "",
        "created_utc": 1675878219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explain how you are happier in your current relationship vs your last one",
        "author": "ohlittlebugger",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x5etx/explain_how_you_are_happier_in_your_current/",
        "text": "",
        "created_utc": 1675877597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self Defense? Please help!",
        "author": "AshamedBarracuda7446",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x5czk/self_defense_please_help/",
        "text": "Hi all! My friend and I are planning on going to Miami for spring break, and I’m a little anxious about the chaos that can come with spring break in that area (as I’m sure everyone has heard/seen). I know how dangerous it can get, so I want us to prepared as best as we can be. If it were up to me, we would probably go somewhere else but I still want us to have a good time while we’re there. \n\nWhat are some of your recommendations for self defense? What are things we can bring with us to keep us safe? How can we maximize safety in our Airbnb? Most importantly, what can we carry on ourselves? I know there can be a gray area of what we’re allowed to carry on us, so I want to make sure it’s “legal” I guess. Things that are discrete but easy to access (and effective of course!!!). While I’m referencing spring break in this example, this honestly just applies to everyday life. \n\nHow do you feel safe as a woman? I am in my early 20s and attractive. I get bothered my men all the time and am tired of feeling vulnerable. I know my friend and I are potential targets, so please leave me your best advice and recommendations! Thank you 🫶🏻",
        "created_utc": 1675877477,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who wanted to stay single, or the opposite. What changed your mind?",
        "author": "doricoins",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x55ot/people_who_wanted_to_stay_single_or_the_opposite/",
        "text": "People who wanted to stay single majority of their lives who ended up getting married and happy. What changed your mind?\n\nSame for people who always wanted to get married and ended up single and happy. What changed your mind?",
        "created_utc": 1675876994,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am furious with the treatment I put up with last year",
        "author": "An_alternative_smile",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x3hxw/i_am_furious_with_the_treatment_i_put_up_with/",
        "text": "I don't know where this revelation has come from, but reflecting on the year just gone, I am FURIOUS at the treatment I accepted. Not only that, but I self-denied what could have been wonderful opportunities for growth.\n\nI went through an awful break-up last year, which a lot of you really really supported me through and helped to fix my vision. While I have felt angry about that relationship previously, I've come to see an entirely different side now, where I can see JUST how much shitty behaviour I was tolerating. I put his needs before my own for every decision, went along with what he wanted to do in most things, I even fucking gave him a week to think about whether he wanted to be together while he was off on holiday with his family. He later told me he had a 'decision by jury'chat with family members to help him decide. Yet I still stayed!?!? \n\nHe wasn't a right fit for me and deep down I knew yet, and yet I continued to be in this relationship, even when he treated me badly. I EVEN PUSHED FOR US TO GET BACK TOGETHER!? \n\nCareer wise I also has an opportunity for growth and didn't apply for it because I didn't think I was good enough. Its now frustrating to see that opportunity has become a permanent position and I've trained up someone for that role. Meanwhile I'm stuck in the same position. Its completely my own fault for not applying and I'm SO furious I didn't when I had the chance.\n\nThere were also smaller examples throughout the year where I didn't advocate for myself or continued with my people pleasing tendencies, which reflecting on now, just make me sad. Why did I not think I was worthy of the things I was being offered? Why did I accept shitty treatment from an ex? \n\nHas anyone experienced this before? Do you have any advice as to what I can do to accept that I didn't value myself? I'm so sad and mad at myself. I'm also afraid that even though I recognise it now as shitty behaviour that I won't in the future. How do I know I will be able to identify patterns?",
        "created_utc": 1675873325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dry Aging Skin",
        "author": "TheToastedGhosted",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10x0395/dry_aging_skin/",
        "text": "Wow I hate that I’m asking this! Haha! \nSo I’m in my mid 30s and my skin is super dry and I have large pores and fine lines..and mostly my “wtf” lines in between my eyebrows. \n\nWhat foundation do y’all use that doesn’t settle into fine lines?\n\nI use a MCT oil cleanser, and I use aloe and rosehip seed oil during the day. I just need help!",
        "created_utc": 1675869830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small things that make you feel grateful and that you might actually have your shit together?",
        "author": "farawaykate",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wyjou/small_things_that_make_you_feel_grateful_and_that/",
        "text": "I’ll go first. I have a cold and my medicine cabinet actually has unexpired cold medications.",
        "created_utc": 1675867687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lack of social etiquette",
        "author": "discorockopera",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wy6r7/lack_of_social_etiquette/",
        "text": "I found out that a guy friend of mine, who I go on outings with quite a bit one-on-one, excluded me from a party. Their rationale was that they 1) wanted to flirt and get irritated that people think we’re together (even though we stopped sleeping together a long time ago and I’m seeing someone else) and 2) I don’t care for some of his friends (some are very immature and two have been classified as either a sociopath or narcissist) and he chose them over me. I found out about this before the party and called him out, because I was very hurt. I was also hurt to find out that he truly believed that inviting me meant that he couldn’t invite certain people. And the kicker is, the people he wanted to invite didn’t show up anyway because they aren’t good friends of his.\n\nI told him that it hurt my feelings, especially when he told me he was going to throw a party and didn’t invite me. He said that it was a small house and he even didn’t invite some of the guys he plays card games with on a WEEKLY basis. He chose fairweather people who just want to party over those who genuinely choose to spend time with him on a weekly basis.\n\nI’m on the verge of saying, “fuck it” and rescinding my friendship but I also need time to process and be with other friends to cool off. Has anyone else noticed the pattern of grown adults having less empathy and social awareness than a middle schooler? Because I feel like I’m 12 again. We had a convo about the situation and I said, “I don’t care that you invited people I don’t like. They’re your friends, not mine. I’m an adult and can ignore them. What really hurt was that we see each other often and that you excluded me. I would have shown up to support you and say hello and left early, but instead you excluded me.” He said that from now on he will communicate better and let me know if people I don’t like will be around, but I am still hurt that he did this and he thought he was protecting my feelings when it sounds like he finds me to be a problem.\n\nBack to where I was before, anyone else tired of having to remind others of social etiquette and how to maintain friendships? I’m exhausted.",
        "created_utc": 1675866769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stress",
        "author": "Mimi_315",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wxa8r/stress/",
        "text": "How do you react to stress? In my twenties I had no idea what stress was (bliss) but obviously that’s not the case now that I’m in my thirties. A couple of years ago when I was going through stressful period I’d have regular panic attacks, bald spots due to stress (my hair grew back later) and this was so horrible that I got therapy to manage it better. Things were ok for a bit but I’m once again in a stressful situation. This time therapy has helped me not to have regular panic attacks, my anxiety is sort of manageable too, but I’ve lost my dry drive, I sleep poorly, and almost every month I fall sick (cold, sore throat, fever etc) I’m so tired of this! I can’t avoid stress but I want to react to it better. How does stress manifest for you? And what are your copes? I would love to know, thanks!",
        "created_utc": 1675864518,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling so down",
        "author": "radhika1710",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wvpm3/feeling_so_down/",
        "text": "",
        "created_utc": 1675860123,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [30F] can’t tell whether it’s time to finally leave my partner of 4 years [40M].",
        "author": "ThrowRAthrowaway-0",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wr98l/i_30f_cant_tell_whether_its_time_to_finally_leave/",
        "text": "[removed]",
        "created_utc": 1675844102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marriage is a bigger commitment than a baby?",
        "author": "Beneficial_Action435",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wq5y6/marriage_is_a_bigger_commitment_than_a_baby/",
        "text": "Late 30's. Together 4yrs (live together 3yrs). He works 15 days on and 4 days off. It is a strenuous and stressful job. We have a 2 month baby together. I am currently on Mat leave. \n\nHe tells me that he loves me and he is not going anywhere, but his rule is he wont marry unless we live together for 5yrs as then you really know someone then. He says marriage is a bigger commitment than children? It makes zero sense and I think that he is playing me.\n\nWhy are you having kids with someone if you \"don't truly know if them until you live with them for 5years?\" \n\nTo me it sounds like a run around and he is settling or he has other options he wants to try in the next 2 years before settling down\nYet he wants more kids with me?? \n\nI did not pick the right partner, he is a good dad to our baby. Thank goodness. \n\nBefore I was 6 months pregnant (very easy pregnancy) he was talking about marriage and how we should do it after Covid. Then 6 months and lots of Andrew Tate and Pearltalk podcasts he became different, cold, very secretive of his phone. Any type of marriage talk and he gets angry. I became a option. \n\nWe agreed to try for a baby before getting married after Covid, as I'm in my 30's and it could take a long time as a \"geriatric\" to get preggo. \n\nI feel babytrapped and getting the run around with him.\n\nIt is difficult to talk to him, as he dismisses my feelings, walks away or is tired of repeating himself on this topic.\n\nI no longer want to marry this man, I get being a dad is life changing. So is becoming a Mom! Grow up! \n\nDecided to have a discussion when he is back to change babies last name to mine. Were not married she gets my name. I didnt get to pick her name, I wanted one but his Mom made me feel bad about it as so many of her family have that name already. I don't even remember naming my daughter in the hospital. I was so stressed trying to figure out how to feed baby and he was rushing me to choose a name.\n\nI definitely let him get away with too much, I paid rent, did all the cleaning and cooking, laundry etc and even the nicest of people treat you like trash when you dont hold boundaries or accountability.",
        "created_utc": 1675840057,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about your partner going radio silent on work trips?",
        "author": "Electrical-Climate96",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wowct/how_do_you_feel_about_your_partner_going_radio/",
        "text": "I have anxiety over loved ones traveling because in the last few years I lost a couple friends when they were on trips. Because of this, my partner and family will check in with me when they travel—even if it’s just a quick hi. \nMy partner left for a random work trip a couple days ago and hasn’t contacted me once. He hasn’t responded to me other than “liking” a question I asked him about a video game. I feel like even if it’s busy you can send a quick text while you’re on the toilet. Especially since I know he’s always on the phone.\n\nJust feels so calloused.\n\nAm I being crazy?",
        "created_utc": 1675835761,
        "upvote_ratio": 1.0
    },
    {
        "title": "LTR breakups when you own a home",
        "author": "QuietFatCat",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wo9cp/ltr_breakups_when_you_own_a_home/",
        "text": "Tangible steps for a kind breakup\n\nPractical steps steps for a kind breakup\n\nI'm 35F and he is early 33M. I think my bf and I are headed for a breakup after 7 years. We love each other but ultimately the relationship is not serving us anymore. I think we're both stagnant and anxious about moving on. I'm particularly concerned because I want the option of having kids (undecided) and my window is closing. For a few reasons he is unlikely to want kids or to be the right coparent for me.\n\nI don't know if I have the courage to do it. I feel very old and scared about starting over. I love him and don't want to hurt him but he would need to make tangible changes and FAST for me to reconsider. Besides ripping off the bandaid and just saying it, I don't know HOW to break up with someone you own a home with. It's a recent purchase and would be very difficult financially to sell right now. How do you do things kindly? Fairly? Equitably? I need some stories of how you got out of relationships where there was still love. Bonus points if you had to untie your whole lives, including property. I need to know there is a light at the end of the tunnel.",
        "created_utc": 1675833636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally done",
        "author": "_Inter_esting",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wnq86/finally_done/",
        "text": "Finally made a decision to end it. 9 years. \n\nLong distance for 2.5 years and 6.5 in person. The long distance part was recent. \n\nJust gradually realised I’m happier alone. Sad and weird part is he was literally about to visit me after all the time apart - and I’ve said I don’t even wanna see him. \n\nI’m just. So. Done.",
        "created_utc": 1675831954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure how to discuss disappointments with sex life",
        "author": "ObjectImpermanance",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wna13/not_sure_how_to_discuss_disappointments_with_sex/",
        "text": "My partner is incredibly eager to please and always up for sex, which is wonderful. I've been trying to put my finger on why our sex life feels disappointing. \n\nI think what I'm missing is a passion aspect. In my past, I have had partners where passionate kissing leads to sex. My current partner and I have very different experience levels (he less so) and he lets me take the lead. We usually goes straight from, let's have sex, to trying to make me come. It's a lot of pressure and he has been unable to do it with just his mouth or fingers so we use a toy and that's great. It usually always works. But the sessions are pretty short. \n\nI miss the foreplay, the neck kissing, the making out, but that just really hasn't ever been his style. I think I would like to be more ravished? How do you ask for someone to be more aggressive (is that the word)? We don't do a lot of missionary, we just go straight to the positions that work… But I am realizing that leaves out a lot of the eye contact, body rubbing, kissing, that gets me hot. \n\nHe is truly the best person I've ever been with but I have felt like there is something lacking. We have talked about it a lot already and he loves getting books and games and all sorts of things like that. Whereas I am wondering if we are missing some sort of fundamental. \n\nIs this something you are able to talk about or some thing you just get over when you find the right person?",
        "created_utc": 1675830578,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s something you did that positively affected your relationships?",
        "author": "pizzatoucher",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wn8s1/whats_something_you_did_that_positively_affected/",
        "text": "And yes you can say therapy! Maybe share something your therapist taught you?\n\nBut really looking for anything that worked for you in your life to improve your relationships. Keeping it open ended to see where the discussion goes. \n\nRomantic partners, bosses, friends, you name it.",
        "created_utc": 1675830474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you have kids with no romance?",
        "author": "Ok-Supermarket-6747",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wmx50/would_you_have_kids_with_no_romance/",
        "text": "Simple as it sounds. Would you have kids with a man if you didn’t have a romantic relationship with him? Also, has anyone used a sperm donor from someone they knew? How did that go? Did you actually have sex or did they just kinda hand you a cup \n\nI think I probably don’t want kids...but I am curious about the different scenarios",
        "created_utc": 1675829515,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to feel better when you’re depressed",
        "author": "throwaway24828648",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wluyk/how_to_feel_better_when_youre_depressed/",
        "text": "I (F22) broke up with my long term bf about a month ago. I loved him but something felt off about the relationship and I had a gut feeling that wouldn’t go away (see my last post) so I didn’t want to lead him on. I’ve been feeling really shitty ever since.\n\nMy depression also played a role in our relationship deteriorating but I didn’t even realize I actually had depression until I started seeing a therapist a month ago. I told her I have trouble sleeping, I don’t get excited or happy anymore, and I’m just stressed/anxious all the time and she said those are all symptoms of clinical depression. I graduate college soon and my career is also causing me so much stress because I still don’t know what I want to do.\n\nI don’t want to take medication unless it’s the absolute last choice I have. I’m open to hearing your experiences though.\n\nIt’s just really hard to be a functional human from day to day. I only have one friend who I feel really understands me but I don’t want to burden her with my sad ranting all the time. \n\nI also don’t have a good relationship with my family members and they also don’t believe in mental health so I just feel so alone. I broke up with my bf to find myself but it seems like I’ve gotten so much worse since leaving him.",
        "created_utc": 1675826446,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's something that instantly makes you swipe left?",
        "author": "readitanon1",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wlimg/whats_something_that_instantly_makes_you_swipe/",
        "text": "On the dating apps, We all have that one thing that makes someone instantly unattractive. \n\nWhat's that \"thing\" that makes you say \"pass\"?",
        "created_utc": 1675825484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting over.",
        "author": "No_Chance20",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wl48a/starting_over/",
        "text": "Hi guys! I am a 30 year old stay at home mom. From the age of 21-28, I was a dog groomer who eventually owned a very successful business. Unfortunately during my pregnancy, it was discovered I was in kidney failure which later led to a transplant.  Dog grooming was taken off the table for me as a job with the increased risk of infection due to my medication. As stated, my only work experience is grooming dogs with some waitressing here and there. So now I am back to square one in terms of what I want to do as a job once my daughter starts school. I don’t have a degree. I’m not completely opposed to getting an associates degree but would rather stick with some kind of training program if I found a job that took me down that path. I’ve looked into becoming a phlebotomist and also medical coding. I have possibly a year or two before I am back in the world field but would love to know if anyone had any suggestions on different options to look into! Thank you!",
        "created_utc": 1675824345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why should men make the first move?",
        "author": "pqrstyou",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wk0h8/why_should_men_make_the_first_move/",
        "text": "Potentially unpopular opinion: (In hetero relationships) While it’s typically seen as empowering—and is quite literally the selling point of Bumble that women make the first move—I think making the first move as a woman actually takes away your control. While ultimately I don’t care what anyone does or doesn’t do when it comes to asking people out….\n\nTheoretically, isn’t taking the responsibility of making the first move from men removing them from a position of risk and vulnerability, and placing that burden on the woman? Asking a man out is giving him the power to reject you. If you are the one being asked, the ball is in your court! You are in control. You ask him, he is in control, and he never has to prove to you that he is capable of being vulnerable or willing to take even a small risk for you. \n\nAs someone who considers myself to be a pretty vocal feminist—I am perfectly content to not make the first move for this reason. I believe it levels the playing field a bit for women to be the decider and not the asker.\n\nWhile I do live in REALITY and understand that in some cases, rejecting a man has consequences and can be dangerous, (I’ve read too many horror stories about men getting angry when they’re rejected) I tend to feel like, if he can’t even bother ask you out, he’s not worth your time. \n\nIn my experience, if he can’t put himself out there for the risk of an initial rejection, he’s not going to be emotionally available.\n\nAm I off base? Would love to hear arguments to the contrary, but personally I think the power to say no is more appealing than the “power” of asking someone out. \n\nI mean, do what you want. But would love\nTo hear peoples experiences both ways.",
        "created_utc": 1675821304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tonsillectomy",
        "author": "bluegiraffe1989",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wjzr0/tonsillectomy/",
        "text": "Has anyone on here had their tonsils removed after 30? I’m 31 and a tonsillectomy was suggested as a *possibility* by my doctor. I’ve heard the recovery period is terrible as an adult, but I’m constantly getting tonsillitis and whatnot. I’m just curious on what some others have experienced!",
        "created_utc": 1675821245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we stop using “you don’t look your age” as a compliment?",
        "author": "sunrise_d",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wj41u/can_we_stop_using_you_dont_look_your_age_as_a/",
        "text": "I just turned 50. Why does that make (mostly other women) feel the need to tell me I don’t look 50 or I could “pass for 30”? First of all, NO I absolutely cannot pass for 30. Second of all, I look 50, because I AM 50. We can all look different at 50 and still look 50. We can have signs of aging and still be beautiful. 50 isn’t bad, it’s great. I’ve lived 50 years. I’m alive.",
        "created_utc": 1675818854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spending on Neverending celebrations",
        "author": "maybeitsmeoryou12",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10widv8/spending_on_neverending_celebrations/",
        "text": "Does anyone else get frustrated with this? I'm single, so didn't have a bachelorette party or wedding. No kid's bdays. That stuff won't come back to me since I'm not planning. \n\nNow these same people want to celebrate a big birthday. Fancy dinners, gifts etc. It's just so much and it's frustrating. Can anyone else relate?",
        "created_utc": 1675816886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Processing grief/a will with a sibling who won't communicate.",
        "author": "allblackrainbows",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wi059/processing_griefa_will_with_a_sibling_who_wont/",
        "text": "My mother passed away last year of cancer. I  was left as the executor of her will. This was known to everyone involved because I asked my mother to review the entire document last summer with my siblings and I so that no one felt surprised. Most of her estate was split 50/50 between my sister and I.  \nOnce she passed away I discovered that my sister had modified another version of the will and tried to get my mother to sign it towards the end of her life, she had also added her name to bank accounts and insurance documents.  \n\nWhen I  began the probate process to settle the  estate, my sister quit communicating with me.  She answered no texts, emails or phone calls. I  felt forced to get a mediator for her to turn over the account funds. I finally have access, but I am exhausted trying to get the  paperwork completed.  Has anyone else dealt with this? Will it ever get better?",
        "created_utc": 1675815860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go on vacation with an 4 month old baby??",
        "author": "ty457u",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10whpnh/should_i_go_on_vacation_with_an_4_month_old_baby/",
        "text": "My brother and his wife have a 4 month old and they’re going to be vacationing in  Greece. They asked me to join them on their trip. Should I go? \nAnyone who has vacationed with a baby, what is it like? \nI don’t want to go and not have fun. I’m single in my 30s.",
        "created_utc": 1675815096,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (47f) partner (41m) blames me for problems when things don’t go his way.",
        "author": "lorelei81",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wgabg/my_47f_partner_41m_blames_me_for_problems_when/",
        "text": "This happens often and now as soon as it does, I am so frustrated and triggered because I know the issue isn’t me.   \n\nFor instance, we were both hungry and headed to an appointment.  Tried to grab lunch otw, but the place we tried to dine at quickly was understaffed and I didn’t have the confidence that we would be able to eat and make the appointment.  So, we leave. En route to the appointment, we get into a fight because he blamed ME for us leaving and not eating.  I stayed calm for as long as possible, but this happens so often lately, that I couldn’t take it. Yelling ensued and he throws the car in park and walks away from the car.  Mind you, this appointment was for the chiropractor which he (and I) sorely needed.\n\nHow do I handle situations like this?",
        "created_utc": 1675811471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever changed your hair drastically (color or cut) and found that it affected you mentally?",
        "author": "diamondeyes7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wfvuc/have_you_ever_changed_your_hair_drastically_color/",
        "text": "I am now bright BLONDE! lol. It's a little jarring.\n\nMy natural hair is light brown. The past year I've done partial balayage with the blonde weaved through and starting about 2-3 inches from my roots, with a brown near my roots. I tried a new salon today and told her I wanted to continue the partial balayage but start it up near my crown to cover all my grays. Well she did and it came out much blonder than I expected! LOL\n\nI probably just need to get used to it, but it's so different lol.",
        "created_utc": 1675810498,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to know if a therapist/type of therapy is right for you?",
        "author": "According_Debate_334",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wfkp8/how_to_know_if_a_therapisttype_of_therapy_is/",
        "text": "I have seen counsellors a few times, once to help deal with extreme stress when I was studying and more recently when my dad was dying of cancer. I felt it did help and I am now thinking of going back, and cant decide to go back to my old counsellor or find a new one. Both were different counsellors, as the first one was free through uni. \n\nI stopped seeing her about 3 months ago, a few months after my dad died and just before I had my baby. (He was diagosed when I was 5 weeks pregnant). It kind of felt like my time with her had come to a close, and she didnt really expect to see me again. I did like her but am not entirely sure if it was the right fit, or if I am expecting too much from therapy.\n\nI was very worried about post partum depression but my mood has been quite good and I do enjoy my baby and being a mum. But occasionally when I have had arguements with my partner or my mum I just feel so overwhelmed and I feel incapable of seeing past that moment of crisis. I can just see red and be so frustrated and upset and I dont know what to do with those feelings. Its temporary and infrequent but I would like to work on better coping strategies for these moments.\n\nObviously some emotional turmoil is somewhat inevitable as I have just watched my dad die over 6 months and then had my first baby, and my mum does not always deal with it well and refuses to see anyone about it. I also came back to the UK because of what was going on, but am now going back to Australia after a year away from my \"normal\" life. So all concidered I feel I am in a reasonably good emotional place, but might still need some help navigating it.\n\nI have only ever done what I see as \"standard\" therapy, where you basically just talk. What other types of therapy are there and are there types that are better suited to different goals? \n\nHow did you find different types and how did you know your therapist/type of therapy was the right fit?",
        "created_utc": 1675809741,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this called regular periods?",
        "author": "avacadopizza01",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10weaga/is_this_called_regular_periods/",
        "text": "oct5-9\nnov12-16\ndec19-23\njan30-feb4\n\nHI i'm 22F, is my cycle regular periods?i am confused since each site on Google has different answers will definitely visit a gynaecologist if i get a confirmation that my cycle isn't normal\n\ni haven't visited yet cause i got my full body checkup done few days ago (just general checkup nothing serious)and there's no sign of pcos so i'm considering it normal .what could be the other reason as per your experience?",
        "created_utc": 1675806695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lying by Omission",
        "author": "nrob182",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wazkn/lying_by_omission/",
        "text": "Been with my bf for a little over a year. He had lots of friends who are girls. I’m totally fine with this. I’ve met them and even befriended them myself. There is one girl who I’m not super fond of but she’s not a real big issue. \n\nTwo days ago I was asking him questions about her like “how long have you been friends?” And “do you guys hang out one on one!”. Then i asked the question “have you ever hooked up?”. He gave me a smirk and said yes. They had a summer fling over 10 years ago. She wanted more but he didn’t and it just ended. \n\nI started noticing her comments on his social media. They are things like “I’m so proud of you. Love you bubs”. It irked me before but now I’m mad about it. \n\nI feel like this is a betrayal. It feels like there is more to the story even though he has said there isn’t.  I’m not normally a jealous person but this has me so upset. I have never hidden anything or lied to him. I’ve been totally transparent with who I’ve been with in my 35 years. Am I overreacting? I just can’t shake this feeling.",
        "created_utc": 1675798890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going through a rocky period in my marriage, and unsure if to stay or leave. For those who have gone through the same, what did you choose and how is life on the other side of your decision? How did you cope with the uncertainty?",
        "author": "throwaway1507863",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10waud8/going_through_a_rocky_period_in_my_marriage_and/",
        "text": "Throwaway since my husband is on reddit. We are both in our 30s, only been married a year but together for 7. Our relationship in many ways is positive, but there have been underlying issues for a while with communication and trust. Our sex life is seriously struggling and is the biggest issue for him now - in light of a big life change (husband's new job that would require us to move to a new city), he is unsure if he wants to continue in our marriage, and wants us to either improve or make a decision to end it relatively soon, before the move. \n\nI feel completely heartbroken, stressed, helpless, and unsure about the future. I love him and at the same time wonder if I'd be better off just calling it quits as much as it hurts. I love him and since this \"ultimatum\" was issued, have been trying my hardest to come up with solutions and working toward improvement. He seems more uncertain about even trying because of past resentment, but doesn't want to outright call it quits. \n\nI am going to start therapy to work through this myself, even if he isn't willing to go. But wanted to get perspective from others who have been through similar situations. How did you cope with the uncertainty? What decision did you make in the end and how did it turn out? For those who made it work, what led to your success? For those who divorced, what made you ultimately decide and how did you get past your fears?",
        "created_utc": 1675798534,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Dates That Organically Get a Little Personal?",
        "author": "tomah4wx",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10wailf/first_dates_that_organically_get_a_little_personal/",
        "text": "How do you feel when first dates sometimes venture into situations that are a bit personal? \n\nI realize it's off-putting to just come out swinging with heavy hitters, \"So tell me about your last relationship?\", \"Why are you single?\", \"Did you go on a date recently, how was it?\" Those can all be a lot, and put pressure on you.\n\nHowever, sometimes on dates, similar topics come out in tactful ways where it organically comes up and you discuss something about a past relationship, divorce, marriage, date, illness, etc.? How do you feel about that? \n\nIE; Let's say a person is telling a story, \"So I actually went to that restaurant last year, it was a really good place, the company I had was a bit of a trainwreck though, I was with my ex-boyfriend\"\n\nMe: \"Trainwreck? What do you mean?\" \n\nNext you know, she's talking about some faults in their past relationship. \n\nI realize even in these situations, tact, self-awareness, and emotional control is needed, because you can venture into things too far and that can make a person uncomfortable even if they were comfortable discussing things just vaguely. I'll contribute a bit to a conversation with some light surface level questions, and then change the subject. It just feels natural to respond like this, but maybe I shouldn't be saying anything? \n\nDo you mind if on a first date something more serious, like the past gets brought up? I realize it's one of the forbidden acts for somebody to do.",
        "created_utc": 1675797741,
        "upvote_ratio": 1.0
    },
    {
        "title": "requesting words of appreciation",
        "author": "thethingsineverknew",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w9kd2/requesting_words_of_appreciation/",
        "text": "TLDR: For our anniversary, I asked my wife (as a gift to me) to make me a list of 10 things she feels like I'm amazing at. Her response didn't seem thrilled or positive. Where did I go wrong? Did I?  \nAs of today my Wife and I have been married for 4 years. I hold no hesitation in saying that it hasn't always been easy, but we've teamed up and gotten here all the same. Between life as it happens, unraveling and healing past trauma, differences in attachment styles, and modes of thinking; we (in our mutual opinion) have to work pretty hard to keep at our best. Despite our failures, we really do try.   \nIt's a bittersweet anniversary for me because not only is my wife out of town for the month (Work) but as also 13 weeks into carrying our first baby. Something we're both really excited (scared, ecstatic, anxious, etc etc.) about. \n\nI've been working on our house/yard a lot this week with her out of town. I work  on the house/yard a lot. I'm fairly skilled with tools and pretty capable in the Construction/DIY Department. So, though we work together on things sometimes, I take on the lion share of that responsibility to our home. I enjoy it.  Today when we talked on the phone She asked what I was doing with my day and I responded (I thought playfully) with \"You know, doing what I do best!\" and her response was \"Puttering around the house and playing on your computer?\" - I admittedly got a little defensive and asked \"Is that what I do best?\". The conversation got a little awkward from there, nothing much else said and we ended it with the 'love you's' etc.  \nI tried to go on with the day, but I felt it, her response struck a nerve. Admittedly, 'puttering around the house and playing on my computer' ARE two things I enjoy when there's no real work to be done at the moment. She probably \\[obviously?\\] feels like I do it a lot.  \nIn that moment, I just couldn't help but feel unappreciated. I do work really hard on our home in much of my spare time. \n\nThings have been a little extra strained with us lately with the baby coming. New joys, new fears, new things to bond over and have conflict over. We're getting by, but emotions have been running high...for both of us.  \n\n\nRather than try and push the feeling away or otherwise invalidate it, I called her back and told her that our last conversation left me feeling down. I explained that I didn't think she was saying anything to be mean\\[in fact was probably just being playful\\], and that I knew it was ME experiencing a moment of insecurity....and asked for her help by (as an anniversary gift) making me a list of ten things she appreciates about me and feels like I'm the best at. She agreed to it, but her response was...unenthused.....begrudging? and I feel lost and puzzled by it. My words were kind, I didn't make blame or lay guilt, and I felt like my tone of voice was appropriately soft, and undemanding.  \n\n\nI'm reaching out here for feedback and thoughts from the community. Fully understanding that none of you (I'm pretty sure) are my wife and therefore can't be in her head. But any insight into the response or feedback on how I could have approached things differently would be really appreciated.\n\nThanks!",
        "created_utc": 1675795487,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you lessen unecessary feelings of anxiety/guilt?",
        "author": "Literatelady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w99xk/how_do_you_lessen_unecessary_feelings_of/",
        "text": "I was really sick with a flu last week, and took six days off work. I have never done that before but because I've had a lot health issues this year, including migraines and depression, I couldn't shake this feeling of guilt and gaslighting myself for taking so many sick days. I'm still trying to wrestle with it, like thinking \"I could have dragged myself in for Thursday and Friday or at least Friday\". But then there's this other part of me that's like \"I'm done going to work and feeling like absolute trash when I do. I'm sick so I'm staying home.\"\n\n I know the key is acceptance but I don't like feeling guilty for stupid reasons . A lot of it is about how people see me and they might think I'm a slacker and the guilt of feeling I am a slacker sometimes. I guess I just have to find some kind of affirming phrase to tell myself in these moments. \n\nHow do you reconcile those different parts of you? Any therapy practices/self-care practices that work for you?",
        "created_utc": 1675794799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you who have spent a lifetime oscillating wildly with your weight - where do you shop for clothes and what’s your shopping philosophy? Do you save old things that don’t fit? Do you buy forgiving items?",
        "author": "UVIndigo",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w8a0u/those_of_you_who_have_spent_a_lifetime/",
        "text": "This is kind of a vent but I’m also looking for practical advice.\n\nFor a myriad of reasons ranging from mental health struggles, insulin resistance, accidents resulting in broken bones, difficult work schedules, etc. I’ve been every size between 4 and 22 in my adult life. If you were to track my weight linearly, it would look like a wild rollercoaster with 5 or 6 large peaks. \n\nI got tired of trying to constantly lose weight all the time and the yoyo life and embraced the Health At Every Size movement and finally allowed myself to buy nice clothes for my Size 18/20 body. I got rid of my old clothes, except for a few items that I wanted to sell because they had been so expensive (and luckily never got around to selling.) \n\nThen I found out I was solidly prediabetic and am on a medication where I’m losing weight because my insulin resistance is finally being addressed. Which is great for my health, except that it’s expensive to keep buying new clothes. The kicker is that it’s a relatively new med and people are finding that once they get to a healthy weight/healthy glucose level/A1C, their insurance pulls their support for the meds and it’s $1000 to stay on them per month, so some are finding they regain when they go off of it, as one of the ways the the med works is to address insulin resistance…which doesn’t always go away once you’re at a healthy weight.\n\nSo, once again, there’s a good chance that once I go off of it I’ll gain again (or I need to figure out how to spend $1k+ a month forever for the medication or hope the insurance companies change how they handle it.) At this point I’m leaning towards just keeping a capsule wardrobe for every season in every size into perpetuity but who has the storage for that? If I get to a size 8, that’s still probably at least 60 items of clothing I’m storing but not wearing. I cringe when I think of all the stuff I gave away as I size down and have to rebuy items.\n\nAre there clothing items you find fit you at multiple sizes? I hate wrap dresses with a passion, but maybe I could buy some paperbag waist wide leg pants and boxy shirts for work? Stretchy leggings and sweatshirts for home? Any other strategies? Maybe if I stick to clothes that look OK baggy, I can figure out how to only buy new things every 2 sizes?",
        "created_utc": 1675792503,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a positive \"pretty privilege\" you've used in your lifetime?",
        "author": "Maybe_Intellect_554",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w7wzn/whats_a_positive_pretty_privilege_youve_used_in/",
        "text": "I'm a science professor, so I use my \"pretty privilege\" (usually just being my cute feminine unapologetic self with a giant smile and a happy go lucky attitude) to get students to attend every class and encourage them to do their best. I have students often tell me they want to \"do their best\" to impress me and other kind promises of effort that I utilize to the benefit of all.\n\nNote: I absolutely have boundaries with my college students, but they still flirt, and it's always funny to me bc I'm nun like at work and I would never hang with a student (even after they graduate) outside of the lecture hall.",
        "created_utc": 1675791624,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is feminine anyway?",
        "author": "khfswykbg",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w7soj/what_is_feminine_anyway/",
        "text": "A recently deleted post here complained of feeling too masculine, that they wanted to feel soft and delicate and to be cared for. I found it interesting. \n\nI'm currently reading The Feminine Mystique and thinking a lot about what it means to be feminine vs. masculine vs. just human. For those things that we can identify as masculine or feminine, how many of them are truly biological and how many of them are socialized? \n\nWhy, in Western society at least, is \"feminine\" so very overlapped with fragile and dependent? Why do we identify with these things which are so infantalizing?",
        "created_utc": 1675791346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Below the belt maintenance",
        "author": "hexenwolfhollow",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w77tb/below_the_belt_maintenance/",
        "text": "CW: question about vaginal discharge. \n\nI know we’re all adults here, but I wanted to give a heads up in case there are people in this group who don’t want to read about it.\n\nOk, so. I (38F) have always experienced normal (or what I assume to be normal) healthy vaginal discharge. I’ve only had a handful of yeast infections in my life and no BV. I’m not on birth control or other meds aside from various vitamins. But sometimes during certain times of the month, especially when I am ovulating, the discharge seems to be way more than usual. I know this is normal, but I have to wear liners and carry wet wipes with me if I know I’ll be using a public bathroom; otherwise my underwear gets damp and sticky in that particular spot and it feels very unpleasant.\n\nWhen I’m at home, if I’m lounging in my pajamas and not wearing underwear, I will have to go to the bathroom and wipe the insides of my thighs periodically due to discharge, especially during ovulation, like I mentioned before.\n\nI know it’s a normal thing, and I know it’s a healthy discharge because it’s often clear and slightly sticky with no unusual odor. And I appreciate my vagina being so proactive with its self cleaning oven capabilities. I understand that my body is just doing what it is designed to do, I guess I just sometimes get frustrated with the maintenance of it all. \n\nMy question is, does anyone else in this thread go through a similar issue and if so, how do you deal with it? Thanks in advance for the advice.",
        "created_utc": 1675790029,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when things don't move quickly from texting to a plan to meet up?",
        "author": "idplma8888",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w6yqa/what_do_you_do_when_things_dont_move_quickly_from/",
        "text": "I met someone online a little while ago and we’ve been texting back and forth. The texts are pretty interesting and he asks questions, but there’s been no sign of actually meeting up. In these cases, would you you take initiative and ask to meet up, or give up? Or just keep texting without expectation to meet?\n\nNot really looking for advice, just curious what others would do.",
        "created_utc": 1675789436,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you share a bed with your partner, what size mattress do you have?",
        "author": "Priyo1111",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w6okc/if_you_share_a_bed_with_your_partner_what_size/",
        "text": "Any pros or cons to going bigger? I honestly don’t see any downsides to upgrading from a queen to a king. I love being close to my partner when I sleep but don’t want him on top of me necessarily and I tend to stay in one place at night. My partner tends to do acrobats and ends up sideways at times lol, leaving me toward the edge! Just curious what other’s experiences have been. Thanks!",
        "created_utc": 1675788778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Annual Physical - What to Request?",
        "author": "capablepsyduck",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w5ze5/annual_physical_what_to_request/",
        "text": "It’s only been a year since my last physical but I always feel rushed and dismissed so I’m planning to bring a list of questions/requests with me this time. I’m going to ask for a full blood/hormone panel as I’ve been lethargic lately and my hair is thinning, plus I’d just like a comprehensive look at my blood work. I’m not due for a Pap smear as I believe those are recommended every 3-5 years now. \n\nWhat does everyone else over 30 ask their primary care doctors for during their annual physicals? Is there anything I should really make sure I bring up?",
        "created_utc": 1675787090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intense headaches during orgasms and exercise",
        "author": "schwenny",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w5kb4/intense_headaches_during_orgasms_and_exercise/",
        "text": "This may not be the right place to ask this but I lurk here most often and this is my favorite sub. I (47f) have been getting intense headaches with orgasms and working out. It started about a week ago and it’s kinda freaking me out. I love working out and having orgasms (obviously) but not lately! \n\nHas anyone else experienced this? What caused it? What kind of tests or dr visits did you need? Did it go away?\n\nI’m not looking for medical advice, I have seen my doctor and have an MRI/MRA scheduled. I’m curious if anyone else had this weird issue.",
        "created_utc": 1675786070,
        "upvote_ratio": 1.0
    },
    {
        "title": "stinging burning pain in left Tata",
        "author": "Magic-unicorn-dust",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w3r2r/stinging_burning_pain_in_left_tata/",
        "text": "[removed]",
        "created_utc": 1675781617,
        "upvote_ratio": 1.0
    },
    {
        "title": "left breast stinging pain - intermittent",
        "author": "Magic-unicorn-dust",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10w3ped/left_breast_stinging_pain_intermittent/",
        "text": "[removed]",
        "created_utc": 1675781492,
        "upvote_ratio": 1.0
    },
    {
        "title": "masculine",
        "author": "dimple-freckle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vztqy/masculine/",
        "text": "I feel like I’m in my masculine divine even though I want to be feminine and be cared for. I want to be delicate and beautiful and soft. And I dont feel that way inside or externally. \n\nI feel like I have to be tough on the outside to protect my inner child and be taken more seriously. \n\nIm so tired of putting up this fighting barrier. I just want to be seen as beautiful and be cared for instead of caring for myself.",
        "created_utc": 1675770231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Partner rages and goes 0-100",
        "author": "blueskies23827",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vzn8g/partner_rages_and_goes_0100/",
        "text": "I’ve been in a relationship for maybe a year and a bit. Met all the friends the family and everything is great except for one thing. His anger - it’s not so much the frequency but the lack of self control. When he gets mad in an argument with me he goes 0-100 there is no sense of logic, or responsibility. He knows his past relationships have all ended because of his anger issues and “is working on it” but I really can’t see how it’s improved. \n\nThe main issue I have is not yelling it’s his inability to control his physical self. He will rage drive, will yell, hit things, just run off because he has no idea how to self regulate this anger. \n\nDoes anyone have experience dealing with this issue? Would like to to hear your stories if you’ve been with someone who has a similar lack of self regulation.",
        "created_utc": 1675769565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ladies I really need advise and help regarding my chronic vagina issues. I don’t want to deal with this for the rest of my life💔",
        "author": "Clean_Currency_2891",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vzl14/ladies_i_really_need_advise_and_help_regarding_my/",
        "text": "It all started when I was 18 and I first had sex with someone who get using different things as lube because I don’t get wet easily and I got the worst infection known to mankind. When I say different things I mean from body lotion, hand cream, body oils and different things so yeah I was very stupid but I didn’t know better because my mom never gave me that talk as we’re very religious.\nAnyways I’ve secretely had more than a dozen round of treatments because I can’t tell any of my family members what I’m going through, and the treatments were only successful for about the first 4 times then it comes back again but after the fourth time it never budged. \nIt’s been almost 2 years of hell and I’m sick and tired of this discharge and itching. Literally have no relationship with anyone and I’m so depressed. I never imagined entering my 20s with this same issue. \nAnd the test results always come back negative for everything. It’s the fact that the health sector do not have much information on ladies health, we probably know more about the oceans than women’s bodies. I’m so lost. I don’t know what to treat it with. Has anyone here had a chronic vaginal issue and what was used in treating it?\nThank you",
        "created_utc": 1675769370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else NOT want to date and just be alone?",
        "author": "lumiesck",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vzksn/does_anyone_else_not_want_to_date_and_just_be/",
        "text": "Or is it just me? I’ve been single for 3 years and the more time goes by the more I want to be alone. I’ve gone on a few dates and I purposefully made myself super friendly and ‘bro like’ just to seem unattractive to them. Also smoked a few cigarettes beforehand and they found it so gross 😂 2 of these guys were childhood friends I hadn’t seen in 10+ years and wanted to ‘reconnect’ but they were flirting and stuff and I really wanted to see my friends so I decided to meet up. Another date I met on tinder and we went to the movies, he was super creepy and terrifying, kept smelling my hair with deep sniffs and I hated every moment of that. When I go to places I avoid talking to anyone or avoid being approached. I find almost every man unattractive or just plain annoying… most are wimps or sexist. I’m not attracted to any race, any social class, anyone with or without a degree, any type of height or body type, they’re all cringe and super fucking weird. If a guy is sweet and sends me kiss emojis I think ‘what a loser’ if a guy is emotionally unavailable I think ‘what a waste of time.’ So yeah I just like being completely alone, not even having a hookup, friend with benefits, casual dating, texting buddy (they eventually wanna meet), just NOTHING and I have ZERO stress!",
        "created_utc": 1675769346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I stay or go?",
        "author": "BusNo3267",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vve3w/do_i_stay_or_go/",
        "text": "[removed]",
        "created_utc": 1675753233,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you overcome feelings of isolation/regret over ex friendships that have resurfaced on social media and realizing you haven’t quite healed from loss",
        "author": "thewiselady",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vtxg2/how_do_you_overcome_feelings_of_isolationregret/",
        "text": "A brief context: I left a friendship group (all in our early 30s) about two years ago after I recognized that 4 of my friends have gotten much close to each other and have begun planning trips without the rest of us. None of them ended up reaching out to me. I’m still following them on social media, but never met up or reached out over these years. I recently saw an Instagram story of them hanging out, and I still recognize that I felt hurt and slightly regretful that I may have prematurely left the group. I see this as a permanent change, however, I find friendship lost to be quite a difficult emotion to work through. Any advice appreciated. TIA",
        "created_utc": 1675748253,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's a normal amount of physical activity?",
        "author": "evilsnowqueen",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vs3wz/whats_a_normal_amount_of_physical_activity/",
        "text": "I'm looking to get an idea of how much the average woman in her 30s exercises. I'm 30F, walk about 60-90 minutes per day, do like 60 min of strength training per week, and play volleyball or tennis about once a week. I'm 5'9 and overweight. Is this amount of activity low, average, or high? Curious what the average activity level is of most of y'all.",
        "created_utc": 1675742926,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling like a failure",
        "author": "Puzzleheaded_Dig_185",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vqw6f/feeling_like_a_failure/",
        "text": "I know I can switch everything to be positive. But sometimes we have feelings and we have to let the feelings have their moment. I’m 31 and I feel like a failure. I hardly make any money, have 10k in saving. Switching careers, again. I feel like I’ll never be able to own a home or think about having children because of finances. I’m not happy and I just feel like life was supposed to be better than this. Obviously I have to so much to be thankful for at the same time. But sometimes I want to scream. Life is so hard!",
        "created_utc": 1675739558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex-Boyfriend keeps texting, I’m married and he’s about to be married soon. Do I tell his fiancée",
        "author": "ladyluck754",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vqpzq/exboyfriend_keeps_texting_im_married_and_hes/",
        "text": "I (28F) dated a guy for about 7 or 8 months in 2017-2018. Obviously deleted his phone number, probably need to block it at this point. Anyway since about a year ago, (every 3 or 4 month) I get a “Hiii”. My response is either, “what do you want?”, “this is completely embarrassing for you.” or I don’t respond at all. \n\nThis guy is getting married in about 2 weeks and his fiancée is either a. Real cool with this, or b. Blissfully unaware. Would you want to know that your future spouse is texting his ex girlfriends? Or just block him and leave it alone",
        "created_utc": 1675739092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband In Need of V-Day Help!!",
        "author": "Realistic_One_8606",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vqb8x/husband_in_need_of_vday_help/",
        "text": "Hi everyone.  I hope that y'all don't mind me posting here.  I am a husband that constantly fails at being thoughtful on days like birthdays, anniversaries, and valentine's days, and this year isn't any better.  I genuinely want to take care of my wife and  show her that I'm thoughtful, but the day sneaks up on me and then it's there without me having planned anything.  Anyways, this year on Valentine's Day, I have to work all day.  I will be gone before my wife wakes up, and won't be home until after 10:00 pm.  There isn't anyway that I can be with her really at all that day.  I don't have it in the budget to have flowers delivered, otherwise I'd just do that.  I'm looking for some sweet and thoughtful ideas that I can do that might surprise her throughout her day at home (she's a homemaker and homeschool mom).  Can anyone help me out?  I don't want another ruined holiday for my wife.  Thank you in advance!",
        "created_utc": 1675737980,
        "upvote_ratio": 1.0
    },
    {
        "title": "when do you do complex multi-step adulting tasks requiring things like faxing and phone calls and waiting on hold??",
        "author": "ultracuddle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10voyxm/when_do_you_do_complex_multistep_adulting_tasks/",
        "text": "",
        "created_utc": 1675734480,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the redditors who had family remarry or date each other (Dad with aunt[moms side], etc) how was it? was it weird at all?",
        "author": "PlasticYou9295",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vo7c2/for_the_redditors_who_had_family_remarry_or_date/",
        "text": "",
        "created_utc": 1675732496,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do in this weird friend situation/conflict?",
        "author": "shalaiylee",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/10vnpmm/what_would_you_do_in_this_weird_friend/",
        "text": "So a while ago I planned a trip for a small group of friends to show them around one of my favorite places. I picked the rental and planned our itinerary. My boyfriend was unfortunately injured at the time and had trouble walking, but still wanted to stay and hang out from the couch. I set up a puzzle near him and friends would come over and play for a little bit, then get up and move around the house to eat and party. As far as I could tell it was a good, balanced combo and we were able to let loose while also having other options for folks (especially him). During the day, the rest of us would go to town and see the sights, and then come back to the house to cook and drink and goof off at night. Throughout the weekend, one friend kept making comments about the puzzle saying it was ruining the ambiance to have the lights that bright (they were pretty dim, but light enough to see still) and that we were 'ruining the party'. Eventually she started turning off the lights in that room while about half of us were playing and we all yelled at her to stop, and I got up and turned the lights back up since she wouldn't do it. This continued to escalate the two days we were there, and she claimed she was 'joking around', but it was stressing me out and was unrelenting. At no point were people laughing and we asked her to stop messing with the lights. Eventually she apologized to my boyfriend saying she knows he doesn't have many other options to socialize given his injury and after he said 'You were really messing with me but I forgive you' she then revoked her apology, also claiming she thought they were 'joking around together'. Mind you they don't know each other that well and have never had that kind of dynamic. \n\nThe next morning I let her know it went too far and made the night stressful for the two of us, but she dug her heels in and said I should have communicated more directly and should have known it was 'just a joke'. Other conversations with her have gone similarly. She claims she had 'no issue with the puzzle' but also complained later that week that we 'ruined the lighting' and 'shouldn't have set it up in the middle of the room' - which makes me think she was actually frustrated but using the 'joke' to hide behind. It would have been fine if she were frustrated, but also everyone else was enjoying the set up and there were several other common rooms to hang out in. There was also enough space in the living room to do things other than the puzzle. And, the dining room was right next to the room we were in (it had an open floor plan) and had big cushioned bench seating, too, and was near the sound system. Why not blast the music and party a little harder over there? Anyways, this whole thing didn't have to be a big deal but has made me feel so weird since she dug her heels in and got super defensive. I would have loved to have heard some gratitude for planning the trip and driving people around town and planning out the days for them - but instead I got yelled at every 20 minutes that I was 'ruining the party'. \n\nAll I really want is for her to say she's sorry for taking the joke too far and can see how it would have had a negative impact, but she insists we should have pulled her aside and told her to stop (since she says she thought us yelling 'stop - please leave the lights on', etc was also a joke). I've been drafting an email to send to her to hopefully resolve the whole thing since she's been a friend for many years and we share many mutual connections and often plan weekend trips together. We talked on the phone a few weeks ago but that's when she was super defensive. Can anyone relate, and /or have any advice?",
        "created_utc": 1675731194,
        "upvote_ratio": 1.0
    }
]