[
    {
        "title": "Ladies - Need some tough love and honesty. Am I a jerk? Should I do my wife a favor and leave so she isn’t the bad guy?",
        "author": "itsmillertime512",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116nob4/ladies_need_some_tough_love_and_honesty_am_i_a/",
        "text": "PLEASE READ- I need valuable feedback. \n\nMy wife and I have been together for 10 years. I struggle and have struggled with anxiety and depression since day 1. I’ve never even thought of leaving but apparently she has multiple times. When we first were married, I was on and off meds (my brother had just passed randomly from the flu). I was drinking and was a crazy person (flew off the handle bc I didn’t process his death properly). Once I realized doctors just throw meds at you, I swore off meds and got my shit together for her and my son. Started to workout during Covid and got really good with anxiety. We got pregnant again. Life was good.\n\nThen I decided to leave my job bc I got poached to another place for 40k more. It was awful for my mental health. I realized that. Then went back to old employer to only then get poached again and now I’m making almost 100k more than before. However, that comes with long days, quiet/low moods, etc. not only that, people have quit left and right so I’m doing like 3 jobs in 1. I tried psychedelics and they worked for a bit for context of me coping with how zonked I’ve been. I don’t argue anymore and walk away when things get heated.\n\nMy wife is REALLY upset bc she’s sick of taking care of me and for my negative/low attitude except on the wknds. I dont blame her AT ALL. She just text me “I should be at peace when I wake up. You destroyed our son. Our family. Our lives. You don’t take responsibility. I feel sad for our babies. I don’t like you. You as a person suck.”\n\nNow , I know I have anxiety 24/7. I’m NOT perfect. At all. But I am in therapy for myself and with a career counselor. I work my ASS off and drown myself 5 am- 9 pm. I help take the kids to school. Try to make coffee for her in the AM. I take them to their extra curriculars (sometimes with zero break ALL DAY bc of how busy work is). Shower the kids. Bed time routine. Help with homework. Get takeout if needed. Etc. She does a ton for the house. Her job gives her great WLB so I slack there big time. We have been able to stack over 25k in saving this year from my work. I know that shouldn’t matter but I work hard and take pride (even tho that doesn’t matter). I KNOW I need to chill with work and take care of my wife (not just the kids). But she’s getting advice like she doesnt need to be a Martyr for 10 more years and to “run” for the sake of a peaceful home and so the kids can be free.. I just can’t agree with that at this point. I’m trying to suggest couples counseling and she’s refused mostly. I think she sees it as weakness. I’ve emailed people as of today to get started and likely will be staying a hotel as she doesn’t want to see me.\n\nI’m kind of pissed tho. I know I’m an anxious mess who Wears his heart of his sleeve. I know I put her through bullshit bc of my low moods. My resume is out everywhere with this shit economy. I know I need to do more for her. But I am THIS big of an issue for divorce and to be talked down to like this? Bc of what happened 5-6 years ago, during my brothers death and start of marriage, she just resents me. Says I’ve ruined the start of marriage and times with both kids bc of my anxiety..  it seems like if I am happy 24/7, everything is good. If I’m upset though, it reverts back to Im a crazy person?\n\nI think it’s too far gone which sucks but I don’t even trust her or value her opinion bc I work every hard single day for my family. Now, I feel like I do so much (of the wrong things) and feel unlovable and now divorce?? I need HONEST feedback as a male here. Am I just a complete asshole for all of this? If so, I will leave and be single forever lol. Ladies be honest! I just don’t think I’m this big of a piece of shit personally",
        "created_utc": 1676840063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men I date are indifferent/negative towards my career",
        "author": "Worth-Meeting9332",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116nibw/men_i_date_are_indifferentnegative_towards_my/",
        "text": "I 30F am in a career which requires me to continuously up-skill myself. The weekdays are super busy with work and mundane things but I try to devote some time over the weekend to go over papers and new developments in my field. I also have a few patents and multiple papers in my name.   I am currently looking for a partner and the past two guys I dated weren’t supportive of my choices. They would often make me feel bad about working on weekends and for being ambitious. Both these men mentioned on their profiles that they were looking for ambitious women and expressed the same in the initial dates. But when it came real life, I didn’t feel supported. Felt they were putting me down. I try my best to maintain a balance but some time it’s just hard. I try my best to communicate it to them.   I don’t lead with my achievements but I am proud of it and would want whosoever I am dating to appreciate it as well. I would do the same for them. Be their biggest cheerleader. At best, I have found men who are indifferent. Has anyone faced something similar and how did you navigate it?",
        "created_utc": 1676839634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuck in a rut, hard to make an effort",
        "author": "nubbuoli",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116nd0c/stuck_in_a_rut_hard_to_make_an_effort/",
        "text": "I apologize in advance since this is not my first language. I would love to get some advice.\n\nI’m having a hard time putting effort in myself and my relationship. I don’t feel like dressing up, brushing my teeth, eating healthy, having sex or making any effort at all. But I don’t want to be like this. I especially want to be a better girlfriend and also like myself more. \n\nSome context: I had a baby 7 months ago and we’re doing well. I get sufficient sleep. I have a new job that I enjoy and I like being a mother (most days). But I do feel I have become a boring person. I used to be more outgoing and had more interests. I have less time for hobbies now baby is here but even if I have time, I don’t feel like doing anything besides zone out by scrolling, eating, shopping or gaming. Not the healthiest stuff to do. \n\nIt bothers me that I don’t like myself anymore and I am afraid my current mood or attitude negatively impacts my relationship I’m fairly sure it does, although my boyfriend is very patient with me.\n\nI love this community. Any advice is greatly appreciated &lt;3",
        "created_utc": 1676839248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do women typically choose slightly older men? Is the reason more sexual or romantic?",
        "author": "John-The-Bomb-2",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116mr07/why_do_women_typically_choose_slightly_older_men/",
        "text": "[removed]",
        "created_utc": 1676837738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tired of attracting the same kind of partner(s) but unsure what the signs of a good one would be?",
        "author": "perceivewithcaution",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116mqx5/tired_of_attracting_the_same_kind_of_partners_but/",
        "text": "[removed]",
        "created_utc": 1676837732,
        "upvote_ratio": 1.0
    },
    {
        "title": "To the woman who rejected a guy because he's shorter than you what are your views now?",
        "author": "Significant_Tiger640",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116kp50/to_the_woman_who_rejected_a_guy_because_hes/",
        "text": "",
        "created_utc": 1676832712,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some signs of burnout and how have you come out of it?",
        "author": "Hot-Promotion509",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116khp8/what_are_some_signs_of_burnout_and_how_have_you/",
        "text": "",
        "created_utc": 1676832205,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you make travel more bearable?",
        "author": "AccurateStrength1",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116juwq/how_do_you_make_travel_more_bearable/",
        "text": "I am on a work trip on the other side of the world and miserable. Younger me would be angry at myself for being so ungrateful but I’m so jet lagged and uncomfortable. I wish I could go the rest of my life without ever getting on a plane again. \n\nWhat do you do to make travel more comfortable or even enjoyable? Any special hacks you’ve figured out?",
        "created_utc": 1676830683,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might have lost a male work friend because I didn't want to go out with him as a....friend? Need advice on how to proceed",
        "author": "HoffyTheBaker",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116joj3/i_might_have_lost_a_male_work_friend_because_i/",
        "text": "I started a new job a few months ago in an office setting with cubicles. A guy (about 10 or 15 years older than me) and I hit it off well because we like a lot of the same stuff. He hung out at my desk multiple times a day and we'd have really interesting conversations. I admit that I'm kind of starved for intellectual conversation/connection where I live, so while his attention was a little much sometimes, I appreciated the friendship. To be clear, I have never been romantically attracted to him.\n\nHe is married, and I have a significant other. He talks about his wife a lot, sometimes praising her, sometimes complaining about her, but overall it seems like he loves her. He is aware I have a boyfriend, too.\n\nA while back he invited me to have lunch on a non-work day with him as a friend. I believe he really meant \"as a friend,\" because he tends to befriend his \"favorites\" at work (who are not women, btw) and they interact outside of work.\n\nWell, I agreed to this lunch. But after agreeing I had second thoughts. I've always kept work and private life separate, and I told him as much and cancelled our lunch a week ahead of time. I felt guilty because I should have never agreed in the first place. But I admit, something about going out with him during non-work hours just felt odd for reasons I couldn't really put my finger on.\n\nBut since I cancelled, he's been freezing me out and ignoring me. Other coworkers have noticed because he was at my desk so much before and now he doesn't even say hi to me. He seems pissed at me and his avoidance feels deliberate. I feel weirdly rejected and sad to lose his friendship, though I'm also pissed that he's pissed, and I don't really feel like I should apologize or have to smooth things over when all I did was just establish some boundaries.\n\nWhy can't we just get along at work? Has anyone else dealt with this? I really don't know how to proceed. If I'm ever promoted, I'd be working alongside him in his department, and I'm now worried that he'll poison others against me somehow, either with stuff he says or his attitude towards me. \n\nShould I CYA and try to smooth things over with him to avoid trouble in the future? Or leave it alone? Maybe I'm over-thinking it, but it keeps bothering me.",
        "created_utc": 1676830254,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got the worst haircut and it feels like a bad dream - help!",
        "author": "poot_snoot_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116j1l7/i_got_the_worst_haircut_and_it_feels_like_a_bad/",
        "text": "I wanted collarbone length - I’ve had this cut before and it’s cute. I said that.\n\nShe says, “I think we could even go chin length. You have such pretty bone structure.” \n\n“Idk…”\n\n“I think it would be so cute. Plus it’s just hair, it grows back.”\n\n“Okay, if you think so…”\n\nTHE WHOLE TIME she keeps talking about how iT’s JuSt HaIr, It GrOwS bAcK, to the point that I started thinking she must have realized my bone structure is not, in fact, pretty enough for whatever tf is going on here. \n\nThrough gritted teeth, I tell her how “it does feel a lot lighter,” and “now I won’t have to spend so much time blow drying” while I die inside. \n\nEventually she lets me up, I see the MASSIVE pile of MY hair on the floor and sadly comment on how much there is. \n\nShe goes, “Yeah, it’s sooooo satisfying to just chop off tons of hair.”\n\nI tip her 30% and leave to cry in my car. \n\nNext day, I go to work filled with dread and anxiety. \n\nMy coworker says, “Oh. You cut your hair.”\n\n“Yep, I hate it.”\n\n“Welp, just don’t take any pictures to memorialize this one.”\n\n“Hahahhahahahahha yeah for sure!!!”\n\nI just need some support. I know it will grow back but NOT FAST ENOUGH. Fuck. 🥲",
        "created_utc": 1676828710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is your body/mind falling apart as well?",
        "author": "Adelheit_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116hqop/is_your_bodymind_falling_apart_as_well/",
        "text": "This one goes out to anyone who’s seeing doctors once in a while. :D Not those walking miracles, who never need to.\n\nI’m almost 33 and I’m COLLECTING diagnosis after diagnosis for my body as well as my mind. And most of them are chronical.\n\nI feel like I’m losing my mind over this and all I do is managing my goddamn health. So many pills and supplements to swallow, carefully watch what I eat, sports, therapies, sooo many dr appointments. 😵‍💫\n\nI don’t know what I did to deserve this, I always tried to live a healthy life. And now I’m stuck with a life that will Center around managing various illnesses, while others my age reach milestone after milestone (which I know are silly to strive after if they don’t mean anything to yourself).\n\nPlease, please tell me I’m not alone in this. I’m sad, angry and pity myself right now tbh.",
        "created_utc": 1676825622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Different types of cumming?",
        "author": "No_Evidence_1606",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116hk8n/different_types_of_cumming/",
        "text": "I was with a woman last night and she gave me a nice compliment saying her old boyfriend never made her cum like I do. As a man, it’s kinda hard to relate to because we just cum, there’s not different types of orgasms. Could a woman please elaborate on what she meant?",
        "created_utc": 1676825223,
        "upvote_ratio": 1.0
    },
    {
        "title": "I honestly wanna know why",
        "author": "jumpdiaz888",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116gxe7/i_honestly_wanna_know_why/",
        "text": "I’m a 36F. I had a few dates with different men in the past few months.\nI’ve a decent job, and always dress appropriately when I go out on date.\nBut the thing is, those guys asked for second or third date to their apartment to watch TV, aka Netflix and chill.\nI’m not mad about that. I was just chose not to go and cut ties with those dudes.\nSince once I fall into the Netflix and chill category, they just treat me like a girl who can sleep around with. Trust me Ive been there when I was in my 20s. \nI told my friends I’m kinda upset about that, “sorry girl you just have a provocative face and men usually think you don’t need to be cherish.”\nI’m kinda upset but I thought about my past relationships, that’s kinda true.\nI actually look and dress very feminine but I can’t pretend I’m a feminine person. I know it sounds like some “not like the other girls vibes” but I actually have boyish personality (raised with brothers). \nI don’t know what should I improve about myself.",
        "created_utc": 1676823933,
        "upvote_ratio": 0.99
    },
    {
        "title": "anyone else atp want a partner to help split costs?",
        "author": "dealio-",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116exau/anyone_else_atp_want_a_partner_to_help_split_costs/",
        "text": "I'm not someone on here with a good salary, it's quite basic, probably bordering statistical poverty. It is what it is.\n\nAs much as I do want love, companionship, cuddles, sex etc I more than that lately want someone to split costs. It's become something I never really considered until the past year or so. I've never lived with a partner but I'm definitely seeing those perks more than anything else.\n\nIf love isn't in the cards I wanna Golden Girls it up, but that seems even less likely 😅",
        "created_utc": 1676821058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever bought a car by yourself without taking a man to a dealership with you?",
        "author": "forthelulzac",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116ds0i/have_you_ever_bought_a_car_by_yourself_without/",
        "text": "How did it go? I've never bought a car and I'm really afraid I'm going to get scrod.",
        "created_utc": 1676819458,
        "upvote_ratio": 1.0
    },
    {
        "title": "30M here looking for some serious advice - what should I do next?",
        "author": "Familiar_Ad6648",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116de0s/30m_here_looking_for_some_serious_advice_what/",
        "text": "I’m sorry if this is not right platform for it. Also, sorry as this might be a little long as I’m going thru a scenario.\n\nSo I am (30m) talking to this 32F for about 7 months now for a potential long term relationship.\n\nWe live couple of hours away and only met like 5 times in this time period. I won’t say we have been talking very consistently - but still regular enough (like we won’t chat for couple of days then start again for next few days). But I’m usually the first one to initiate it that I don’t mind at all.\n\nI like her and I have already told her and confessed my feelings sometime back. She liked it hearing from me and appreciated it. She seems fine after this and but also told me she doesn’t show her emotions until she’s completely convinced that it’s gonna work fine (that I don’t disagree completely with). \n\nFrom her talks it’s very clear that she’s worried about financial side of the things which I don’t think ain’t any problem from my perspective cuz I own a house and I’ve a well paid engineering job. I’ve tried assuring her that Im capable enough or sorting out. I don’t how she can believe it tho.\n\nI was asked her a couple of times what she thinks about whole thing or if this talk is bugging her or stressing her cuz it sounded like she was a little confused(and I know talks about a potential serious relationship could be stressful esp in today’s world). \n\nI actually do care a lot about her well being. So, I also put it out there that if she wants to take a step back and take a break for sometime or I can help by any means I’ll be more than happy. To which she said there’s nothing of that sort.\n\nAll in all, I don’t know what to do. What shall be the next step from my end if anything?",
        "created_utc": 1676818902,
        "upvote_ratio": 1.0
    },
    {
        "title": "What publications do you read?",
        "author": "handsomewizard",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116btui/what_publications_do_you_read/",
        "text": "Do you subscribe to a printed newspaper or magazine?\n\nDo you have a web subscription recommendation?\n\nFun email newsletters to try?\n\nLooking to replace some of my mindless scrolling with better content!",
        "created_utc": 1676816748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could I have some outside perspective on this issue please?",
        "author": "silentuser01",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116a6z6/could_i_have_some_outside_perspective_on_this/",
        "text": "I f 35 and m33 have been together for 5years. During those 5years I have gained around 15kgs. He says that he wants me to lose weight, I agree that I also would like to lose weight. He constantly brings it up though, says that he's not attracted to me anymore ( fine I get it, I don't like it but I understand it ). I haven't been getting much work recently and so I have been looking for a new job, I have had 3 jobs in the last few years as I am trying to find a balance between earnings and looking after my children. He just criticizes me that well I am obviously not applying for the right jobs then. When I started walking he said that won't work, when I was working all the time I had no energy to exercise so on my days off I'd rest and he'd be like \" all you do is lay in bed on tt, ( for reference we share a house with his parents so I don't have a lounge room to escape to ). I pay half of the bills but earn less and have no savings and he's constantly saying that he's \" carrying \" everyone and is sick of it. My question is, is he being reasonable in his requests and is it normal to constantly criticize someone like this?",
        "created_utc": 1676813005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I overthinking",
        "author": "bshukor1",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1169v3p/am_i_overthinking/",
        "text": "I went on a 4th date with a guy, the location was 1 hour from where I live so I didn’t know the area. The guy gave me the wrong address so I tried to find a close address instead of just checking with him and ended up in the wrong place…I know it isn’t my fault but I didn’t like that. \n\nThen later in the evening he asked me to remind him of something so I set an alarm thinking he would remember and of course he couldn’t remember and neither could I. \n\nOne thing I am insecure about is my memory sometimes. Did I come off wrong or is it not a big deal?",
        "created_utc": 1676812012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I setting boundaries or overreacting?",
        "author": "Redhaired103",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1169jad/am_i_setting_boundaries_or_overreacting/",
        "text": "I fail to set boundaries, but I also tend to get too anxious/skeptical sometimes. I would appreciate if you can share your opinion.\n\nI met a guy who lives only 10 minutes away from me by car last April. We started to chat heavily in June. A good human; respectful, compassionate, into charity a lot. The problem was I was struggling with agoraphobia at the time and was too anxious to meet in person, which had to be outside. I was going to therapy. We texted every day throughout the day the whole months. He would send videos all day. He named his new adopted cat after me. He was very sweet. But also,\n\n- In July I brought up \"if he was flirting with other people, or trying to.\" He said he wasn't flirting but didn't want to answer \"if he was *trying* to get a date\" and tried to end the conversation. I asked \"like, would you go on a date with someone next week?\" and he said \"I don't think so, no.\" So it wasn't a firm no. I later realized this was when he was \"liking\" thirst trap pictures of his former fuck buddy on Instagram. I found this dishonest. \n\n- By late August I told him I was feeling better and told him he could stop by if he likes, and I could at least do 10 minutes outside. Despite living so close and hanging out with people every weekend, he didn't take this opportunity, ever. I was puzzled by this because he was still showing interest all day, every day otherwise. I also thought it wasn't supportive. I supported the whole months with his philanthropy work and any problem really.\n\n- On my birthday in September, a Sunday, he did absolutely nothing other than texting \"Happy Birthday!!\" IN THE EVENING. And this was AFTER I reminded him of my birthday all week, so I clearly cared. We talked even less than our usual that day. When I asked him about it he said he doesn't care for birthdays, he never celebrates his, and apologized. Apparently he also had a female friend over that day too. He tried to make it up in the following days with sending me cute videos.\n\n- In the summer he met a single, young Ukrainian lady through work. She has escaped from the war and moved to our city. About 2,5 weeks after the birthday incident, I asked him like if he could stop by 6 times or so. He really was busy those days - hectic work, his one cat got spayed, he had dental problems and kept going to the dentist. On Thursday he said \"I will check my calendar.\" Well on Saturday evening, apparently he went out to meet have dinner with this Ukrainian woman and her sister who was visiting. They then came over to his place for wine. I told him \"I thought you were gonna come over if you go out this weekend\", he said \"I had dinner for only an hour and came back home (with them). I ONLY LIVE 10 MINUTES AWAY. \n\nThe next day when I asked him about this, and that if he thought bringing single women to his place for wine was appropriate when he was \"I don't know what we are\" with a woman, me, he said it was and that they were just friends anyway. He didn't want to talk further and was annoyed of me questioning this. That's when we stopped to talk and didn't say a word to each other for 4 months. He could have texted me, didn't.\n\nA week ago, we started to chat a bit (friendly) after a mutual charity thing. He asked if I want to go have a cup of coffee and I said \"it's quite busy lately. Let's do it when things calm down.\" and he didn't respond. I don't think he would reject me if I asked to hang but I found his silence a bit disrespectful too.\n\nThis is what my question is about really. I need time and really to like him more again even as a friend to want to hang out. Is this unreasonable? Am I overreacting? I would love to have him as a friend in my life and have our friendship develop closer, but is this weird to not jump on hanging or such close communication a week in after we start to chat?",
        "created_utc": 1676811012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions/advice needed",
        "author": "tb1993x",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1167nyd/opinionsadvice_needed/",
        "text": "In your opinion would a man tell you they care about you when they don’t? I know abusive people would do this to manipulate someone but would a genuinely nice person do this and why? . I went through something a few months ago and I’m struggling to get over that person. All I keep thinking about is how he apparently cared about me. I wish he never said those things because I just can’t move past it. I probably sound really naive but I’m struggling so please be gentle",
        "created_utc": 1676803870,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes sex good for you?",
        "author": "EntirePerspective711",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1165em3/what_makes_sex_good_for_you/",
        "text": "[removed]",
        "created_utc": 1676795320,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I move on from being cheated on?",
        "author": "eggyolksinthedark",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1164vcw/how_do_i_move_on_from_being_cheated_on/",
        "text": "I am in shock. Angry. Sad. Ashamed that I let in someone who did this. \n\nHow do I believe in myself again? \n\nHow do I trust again? I cannot believe in kindness anymore. Up until I discovered the betrayal, I thought everything was perfect. \n\nI am 30F. Been in relationships before, but this is my first time to experience this kind of betrayal. \n\nMy ex-partner (just learned about it all this week) cheated on me with someone I considered to be a friend. \n\nHow do I grieve and heal and move on?",
        "created_utc": 1676793297,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about women over the age of 40 that choose to get pregnant?",
        "author": "miningquestionscan",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1164jp2/what_do_you_think_about_women_over_the_age_of_40/",
        "text": "Do you think they are bad asses, crazy, or both?",
        "created_utc": 1676792007,
        "upvote_ratio": 1.0
    },
    {
        "title": "fear of ending up alone",
        "author": "Appropriate_Cat370",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1164hkd/fear_of_ending_up_alone/",
        "text": "[removed]",
        "created_utc": 1676791771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing hope in finding new love",
        "author": "Appropriate_Cat370",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1164fvg/losing_hope_in_finding_new_love/",
        "text": "[removed]",
        "created_utc": 1676791564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanting to wait for sex till marriage but not a virgin.",
        "author": "5thaccountrunner",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/116478p/wanting_to_wait_for_sex_till_marriage_but_not_a/",
        "text": "I’m 27, f and I am now thinking that the only way I want sex is in a marriage. I am still figuring it out, I will explain my POV and I’d like to know what you guys think your perspective. I already have had sex with previous partners and I know that sex affects us women deeply and bonds us to the person we sleep with especially women. I wish I’d known sooner but I didn’t have proper guidance in childhood. \n\nThere’s a whole culture that says if a woman has had sex before she should give it up before etc which is ignorant but I won’t go into it here. \n\nThis isn’t me asking another man to fix my past hurt, but it’s respecting my body and my innate capacity to love and bond with a man, so it should only be with a man who loves me, will step up and will give me the security of marriage. Not someone who wants to have all of me with no real commitment and then leave when it suits. I’ll respect the man the same way and have the integrity to hold up my side. \n\nIn today’s culture most people are not willing to wait, because the commitment level is low when men have sex, they can test drive a woman their not 100% sure about, because you can swap partners 1 day 1 year 2 years later, most people are deeply hurting in this easy come easy go culture. The man doesn’t have to make concrete commitment he can take baby steps whilst receiving all of the woman and she takes the scars of not receiving the true standard of love she actually wants. And the woman gives less of herself than she’s capable. Yes women also don’t have to hold up more of their character in this dating economy which also hurts and affects men\n\nI’m aware marriage won’t fix all either but at a minimum I’d want to wait till we reach the stage we live together for sex. Which then makes me think well why don’t we marry then, if you love me so much that you want to live with me or we wait till you’re sure about me. Otherwise I feel it’s just a way to get more of the relationship without yet having the courage to commit your heart fully. It can truly destabilise a woman and man to live with a man/woman build a whole life with them, then break up a year later. Sure it’s the same in marriage if it ends in divorce but at least our commitment to each other was more concrete. We were more in it to try make it work, not just convenient love.\nI’ve never lived with a man by choice but I know this from dating.\nShouldn’t both sides be busy cultivating a good life success if they haven’t found what their looking for in someone instead of hurting and using each other.\nIn this day and age it’s like to some people I’m out of line for thinking this. I’m still figuring it out but I’d like to hear the perspective your perspective on this.",
        "created_utc": 1676790618,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is it for women to fall asleep during masterbation",
        "author": "No_Sprinkles_384",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1163wtl/how_common_is_it_for_women_to_fall_asleep_during/",
        "text": "[removed]",
        "created_utc": 1676789521,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite way to cook vegetables to actually make them taste good?",
        "author": "lightbluebeluga",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1162pn6/whats_your_favorite_way_to_cook_vegetables_to/",
        "text": "",
        "created_utc": 1676785102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Filter calls and text from one number but keep the record (iPhone)",
        "author": "Pretty-Plankton",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11618mh/filter_calls_and_text_from_one_number_but_keep/",
        "text": "Do any of you know of a way to filter calls and texts from one phone contact while still having any voice mails and texts archived somewhere? I’m on an iPhone.\n\nMy separated spouse recently broke up with his girlfriend and she has decided that she urgently must talk to me and find out my “intentions”. She believes, mistakenly, that I am the reason he left her, and correctly that he and I are considering attempting to repair things. \n\nShe appears to be emotionally flailing and in denial that their break up is truly happening. I have zero desire to engage at this time, and don’t want to see or deal with her messages; but I would like to have a record of them archived somewhere.\n\nIs there a way to do that?\n\nThank you!",
        "created_utc": 1676780070,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you left an abusive marriage, how did you do it and what advice would you have for someone going through it?",
        "author": "vertigorecord",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11612lq/if_you_left_an_abusive_marriage_how_did_you_do_it/",
        "text": "Earlier today I meditated for the first time in a long time. The prompt was to think of someone in your life who doubts you or discourages you, even if subtly or only to “play devil’s advocate”. At first I couldn’t think of anyone. I don’t have many friends since 2020, so I don’t really have these kinds of “frenemy” relationships like I used to. After a while, though, I realized the only person who speaks to me like this is my spouse.\n\nEven though I already think about leaving a lot, part of me is unsure. I more or less put it out to the universe to give me a sign that my meditation was true. \n\nTonight my husband started yelling at me. Long story short, and to protect from identifying info, he kept calling me “stupid”. How I had wasted so much of “our” money. How he wasn’t mad at me, but people taking advantage of me (remember, I’m stupid). He’s gotten loud like this before, but things haven’t been bad today, so it was really unexpected because he kind of snapped on me over something small. \n\nAs I was walking away I realized this isn’t normal. That I finally feel done enough to leave. The only question is, how? Is there a strategic way I should do things? I’ve never been married before and I don’t really know what to do. I would really appreciate any advice or information you have.",
        "created_utc": 1676779517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you learned to \"move on\" from true love?",
        "author": "nvyetka",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1160wq8/have_you_learned_to_move_on_from_true_love/",
        "text": "How do you come to terms with losing love that is real and deep on a soul level -- but not practically possible due to the circumstances of life, the misaligned timing, the impracticalities\n\nOn the one hand we learn to go any distance for true love, or maybe that is fairy tale. On the other hand, how do you learn to accept the reality of the way things are. You make do with what you have? You sacrifice the connection? \n\nYou learn to love somebody else? How do you not see them as second to the person who you loved the most deeply?\n\nMaybe i'd understand after i change as a person, or move on. I dont know what that means because I've been the same person deep down, same soul, my whole life. I feel he societally correct thing is to 'grow up' or 'move on' but i dont quite get it.\n\nWhat is \"meant to be\" ? Maybe we can choose our fate -- whether we sacrifice all the other circumstances in the pursuit of this love, or we sacrifice the love to maintain our circumstances. \n\nThoughts / experiences from wiser minds/hearts?",
        "created_utc": 1676779008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you broke up w/ a short term partner cold Turkey?",
        "author": "GorillaGlue32",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115wmr2/have_you_broke_up_w_a_short_term_partner_cold/",
        "text": "So I was dating someone for two months and even though I could have maybe stayed with them for a few more months I just cut it off today and broke up with them after a fight. They definitely didn't want the breakup however there were many things I noticed that I just felt I didn't want to try to work out nor deal with. #1) there was a 10+ year difference with me being the older one #2) I got avoidant vibes for them or at least a lack of curiosity in me on a deeper level. They hardly asked me questions or talked about their feelings and I feel I had to initiate that stuff a lot 3) sex was also initiated mostly by me and even when I brought up I wanted them to tell me when they wanted to, they said they would but still never followed through. 4) they just didn't seem very communicative especially through text (which I know some ppl aren't big texters). 5) when I brought up the issues above, they believed they were doing those things or at least didn't think there was an issue and when I said you do these things when I initiate it, they went in to say that I should have brought it up as the situation came up cause they need examples. I felt this was valid but I guess I was trying a hands off approach and not be soo direct and thought they would open up more as time went on.\nAnyways, I felt there was just too much to fix which creeped into maybe changing their personality on top of them being younger and might just not know better, so I just said I don't think it's gonna work and broke up w them. There was a last event that led to this fight but I feel I already painted a sufficient picture of the issues.",
        "created_utc": 1676766405,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do right after a proposal?",
        "author": "psychedelicpopsicle",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115vima/what_do_you_do_right_after_a_proposal/",
        "text": "[removed]",
        "created_utc": 1676763299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice - am I at fault/bring me to reality",
        "author": "raspstrawblueburner",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115to3a/need_advice_am_i_at_faultbring_me_to_reality/",
        "text": "Hi, I don’t have anyone I can talk to. \nI’ve been seeing a guy I’ve been unsure about from the start. He had to me very ‘unconventional’ relationship habits that he played off as normal. I liked him alongside these\n\nHe called me selfish the other day. It was my birthday soon and he told me we were celebrating a week early because he might not be around. He said ‘choose wherever’ to go eat. I chose a place I was excited about and he nixed it because he just came back a week ago from that country and was sick of their food. And he thought I was being selfish for being upset and not thinking of him. We went somewhere else and I was perturbed that ‘my’ night wasn’t mine. \n\nHe left my place before I woke up. The night before I’d offered to make us breakfast and asked if he’d needed to leave by a certain time (no and no). I woke up looking for him and cried. I just want to be taken care of and it felt cold. He’d texted me but I was still upset and I told him. It blew up from there. I felt he blew off my feelings. He called me selfish and that he was tired of the bullshit and I should meet him halfway. ‘How about next time I won’t take you to dinner’ he didn’t pay for dinner so I also thought the wording weird \n\nHe said i make it all about my perspective but I feel the opposite ALL the time like I struggle to get my perspective heard / taken as even part of the truth. I feel he doesn’t see things from my perspective like I make effort to do from his. \nHow can we both feel this way - assuming his accusations were in good faith?\n\nSometimes I feel like he is incredibly self focused and steamrolls what I bring to interactions. He puts me down sometimes in unfair ways or blames me for his misinterpretations. And is so confident about it. It’s like he could ASK but doesn’t. \n\nI’ve been having a very rough time depression wise. I need help and support but I barely mention it because I don’t feel he’d be supportive. I’m afraid that’s my fault and I should try. \n\nCan anyone see something I can’t and offer guidance?  \n\nIt’s been half a year, I do t feel emotionally close enough (though I was suspicious for a lot of the start due the unconventional parts), I’ve said I love you before (recently) and he said he wasn’t there. I come from background of unhealthy dynamics and get intimidated when we try to talk.",
        "created_utc": 1676758463,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those who are in book clubs, does your group discuss the book or do you actually not talk about the book at all?",
        "author": "MuffyCrosswire5",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115tmnu/for_those_who_are_in_book_clubs_does_your_group/",
        "text": "I went to a book club event (through meet-up) last night  I hadn't gone to before. It was about 8 people total, and no one talked about the book at all. Only 3 of the people knew each other, the rest of us were all strangers. One of the women kept talking about her relationship issues with her husband, and how she wanted to get divorced but had a bunch of miniscule reasons why she wasn't pushing for one, and then another woman was clearly drunk, interjected (loudly) into every conversion and was just annoying. It was a lot. I was disappointed we didn't talk about the book, but I think I would have enjoyed it more if I had clicked with even one of the women.\n\nI also belong to another book club group where we actually talk about the book, but each meet up is like 30 people! It makes it kind of hard for discussion where you only get to talk a few times.\n\nPre-COVID I had a book club with 3 other friends where we all actually read the books and devoted maybe 15 - 20 minutes talking about it, then socializing as normal. I really enjoyed that type of set up. Unfortunately they've all moved away and have other priorities.\n\nI get that people are busy and don't have time to read or finish a book, but then what's the point of picking out a book and making some people read it? \n\nI think the main issue is that I'm not connecting with anyone in these groups, but I also want to talk about books! lol",
        "created_utc": 1676758362,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to cope with future DIL who isn't mentally well",
        "author": "Bob_ZimmerWoman",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115stqz/how_to_cope_with_future_dil_who_isnt_mentally_well/",
        "text": "The day I met my future DIL she told me she \"never gets along with her boyfriends mothers and has mother issues\". \n\nShe has repeated this to me 3 or 4 times when I have tried to ask her if we could talk on the phone more and get to know one another. \n\nShe has a history of childhood trauma. He own mother died a few years ago from drug and alcohol abuse and she herself has a history of substance abuse &amp; is attending AA. \n\nShe has hurt me badly under the manipulative excuse of boundaries. How do you call someone out for using boundaries as a manipulative tool? She has told me I have to stay in a hotel if I visit (very odd for our family plus I can't afford it). She seems to twist many things I say so they no longer hold the same meaning. \n\nI have my own cPTDS from childhood but I was managing well until 2020 when I experienced severe medical gaslighting &amp; almost died due to being misdiagnosed 15x's at the Er as having a mental issue when I was actually having a thyroid storm. With ICU care only 10% of people survive a thyroid storm and I ended up having to treat myself at home with meds I happened to have until I could get in with an endocrinologist because of what kept happening in the Er. \n\nSince then, I have been having very bad PTSD symptoms. Nightmares, little sleep, disassociation, rage, panic, anxiety, etc. \n\nThis situation with my future DIL is making me very ill. I'm in therapy with my son but he only seems to see things from her point of view. My son has never dealt with substance abuse or BPD (we suspect she has). He's in over his head and thinks he's dealing with a normal person.\n\nI'm terrified for him. My #1 goal at this point is not losing all contact with him so he isn't alone trying to cope with this. \n\nSince she twist everything I say, I feel very nervous being around her. Even my most well meaning loving acts are seen entirely different. She twisted me inviting her entire family to spend Christmas with us into me not wanting them to ever spend Christmas with her family. \n\nSo I'm afraid that if I continue to have any contact with her, that she will continue to create these dramas and eventually my son will cut me off entirely. \n\nI'm considering talking with my son in therapy this week about going as low contact with her as possible. I realize the implications for my future with grandchildren, holidays, and basically the entire way I thought my golden years would look. It's heartbreaking but as I said, my #1 priority is being in touch with my son. He has no one else right now to go to. No best friend to talk about wife things with and he and his birth father don't talk about serious things. I was always that person. I'm very worried about his mental health as I see her wearing on his self esteem and I see him becoming depressed. \n\nBut how well can that go over? Being low contact with his wife? I know she'll twist that too. I'm so scared and I have no idea what to do in this situation. This is the worst my own mental health has ever been by far. \n\nI'd really appreciate your perspective and any advice on solutions that I may not be thinking of because I'm so anxious I know I'm not at my highest good right now. \n\nThank you for being here.",
        "created_utc": 1676756686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking vs slow fade",
        "author": "lucent78",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115s7sh/talking_vs_slow_fade/",
        "text": "When have you decided to talk to a friend about a perceived imbalance in the friendship and when have decided to just let it fade, and why did you opt one way or the other?",
        "created_utc": 1676755640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you date a man 5 years younger than you?",
        "author": "DumbbellDog",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115r923/would_you_date_a_man_5_years_younger_than_you/",
        "text": "I'm 28M and I have a crush on a woman (33F) in my nursing school class. Since it's a nursing school, the gender ratio is very imbalanced and I'm the only guy in my class (1 guy and 24 girls in my class), but she's the only person I'm interested in.\n\nAlso, she has 2 kids and is single. And I don't have any kids and never married.\n\nSo my question is: Would women in their 30's be comfortable dating a man 5 years younger than them? Would you personally date someone 5 yrs younger?",
        "created_utc": 1676754249,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I become less sensitive?",
        "author": "cerealmonogamiss",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115pume/how_can_i_become_less_sensitive/",
        "text": "Can you guys relate? Is there any way out of this? I posted on another forum about someone being rude to me. People were blaming me for it. I guess I'm very sensitive. People were like \"Move on\" and someone said I had \"victim syndrome.\" I like being sensitive (art and nature have great effects on me,) but at the same time, maybe I shouldn't take things too seriously. Also, being down voted and rude comments really hurt. Can you guys help?",
        "created_utc": 1676752313,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are long term psychosocial effects of the pandemic that we’re not acknowledging?",
        "author": "sweetobscurity",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115oz0i/what_are_long_term_psychosocial_effects_of_the/",
        "text": "",
        "created_utc": 1676751099,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has your opinion about friendships changed in your 30s?",
        "author": "sanoneiro",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115n2u9/how_has_your_opinion_about_friendships_changed_in/",
        "text": "",
        "created_utc": 1676748434,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can a pessimist become an optimist?",
        "author": "Cats_have_teats",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115mw56/how_can_a_pessimist_become_an_optimist/",
        "text": "I'm really at the point in my life (37) where I am fed up of all the time I've wasted in low self-esteem and negativity. \n\nI've had a really bad time, especially over the past few years (domestic abuse, bereavement, bullying at work). BUT I was depressed and negative even before all that. \n\nI feel like if I were 27 now I'd be able to capitalise on this new found drive to change how I think. But I'm paralysed by the \"it's too late\" thing of family and not just that but too late to fix all the wasted time and catch up on having friends and hobbies. I'm also questioning my sexuality so that's another late to the party issue!\n\nSo how do you truly become an optimist in spite of that regret? \n\n(Btw I'm in therapy so believe me I know the work will happen there, but l am just curious about some opinions and experiences out in the wild on Reddit)",
        "created_utc": 1676747945,
        "upvote_ratio": 1.0
    },
    {
        "title": "success stories please",
        "author": "PositiveBeginning0",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115moso/success_stories_please/",
        "text": "Hi ! Feeling a little disheartened by the dating scene, I am 31, all my friends are married/having kids and I want this for myself as well. I have a full, successful life on my own so I am not looking for \"love yourself\" advice - i just want to hear some success stories - people who have or know someone who has found love in their 30s and was able to start a family.\n\nThanks friends :)",
        "created_utc": 1676747397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Higher hourly wage as a contractor or lower hourly wage with employer-provided health insurance?",
        "author": "Cant-Get-Any-Worse",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115ls1w/higher_hourly_wage_as_a_contractor_or_lower/",
        "text": "Hi all,\n\nI've owned a small business for the past 8 years. Most of that time was extremely rough and I paid my employees $16 to $18 an hour as 1099 contractors. \n\nI live in a high COL area, and I've always felt bad about paying that amount. But according to Indeed, production/manufacturing jobs in my city actually average $14 to $15. So as terrible as my price point was, it was better than a lot of what was out there. Also, I myself have struggled to keep the business afloat. Many  months I don't pay myself, and I've gone deeply into debt to keep the business going.\n\nOver the past year or so the business has been growing rapidly due to improved marketing, and I've had to hire on new employees. I am now paying $20 an hour, and have even implemented a paid time off policy. However I was interviewing a prospective employee and he said that although he loved my business and wanted to work there, he didn't want to give up the health insurance with his current employer, although his hourly wage was less. He wound up quitting his other job to work for me, but I am not feeling great about it.\n\nI have a couple choices. I can increase the hourly wage for my employees to about $22 or even $23, and continue to pay them as 1099 contractors, leaving them to find their own insurance. Or I can make them 1040 employees, offer health insurance, and lower their hourly wage to about $19. \n\nI have spoken to my employees about this one-on-one and they are split pretty much 50/50 on what they prefer. \n\nIn your working experiences, which would you prefer and why? More insight into this would be really helpful. Thank you.",
        "created_utc": 1676744922,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are we wearing?",
        "author": "_greentea",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115jww7/what_are_we_wearing/",
        "text": "Hi everyone! \n\nI’m a 35/F and spend too much time on tiktok. I’m always watching these gen z girls wear these cute cut out shirts, baggy jeans, cargos etc.\n\nFor the record: I don’t think fashion or wearing a certain thing has an age limit. But I’m just curious what people my age are wearing. I love a lot of the trends but personally don’t want to dress in many of them.\n\nPersonally, I’m a jeans (with 2% spandex or more lol) and a sweater with uggs and hoop earrings or a matching sweat seat with a cute coat or jacket and uggs and hoops kinda lady. When I’m feeling fancy I usually wear a nicer top with my stretchy jeans (flare/bootcut), nicer boots and a biker jacket. \n\nI’ve ordered some things online to try to incorporate gen z fashion that I like, for instance, straight leg pants with cargo pockets, but personally I don’t want to dress super trendy. Just want to update a bit.\n\nAnyway, what are you guys wearing? Where are we shopping?",
        "created_utc": 1676739919,
        "upvote_ratio": 1.0
    },
    {
        "title": "$500 for Personal/Professional Growth",
        "author": "TrebleTreble",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115jir8/500_for_personalprofessional_growth/",
        "text": "I am being given $500 by my company to use in any way I feel would advance personal and professional growth. Examples are books, classes, workshops, etc. I am in distribution in the construction industry and am moving into a new role in which I will manage a team of project managers nationally. I feel overwhelmed by the possibilities so thought I'd come here to see if anyone has any ideas about how to use the money. Thank you for reading!",
        "created_utc": 1676738882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best friend breakup has left me devastated",
        "author": "Massive-Put7715",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115jg22/best_friend_breakup_has_left_me_devastated/",
        "text": "I just experienced a breakup with my best friend of 10 years after I spoke up about not liking being treated as the “low maintenance” friend and feeling abandoned at a time when I needed a friend the most. She had no emotion during the conversation which isn’t like her and said she isn’t willing to care about anyone but herself right now. The last thing I said to her was that I still loved her so I would not speak negatively of her (hence why I’m not giving full details of what happened) and everything ever told to me in confidence will stay that way and I can only hope for the same. I didn’t get a response after that. I am so hurt and confused. My best friend had zero emotions over hurting and losing me. I trusted her with a lot of stuff. I don’t want this to be the kind of friend breakup where it’s a backstabbing feud. I just couldn’t keep getting hurt by her. I don’t know how to cope with feeling like my best friend stopped loving me a long time ago.",
        "created_utc": 1676738673,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bf lied about going to a bar",
        "author": "_sleepy_time_tea",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115jb9l/my_bf_lied_about_going_to_a_bar/",
        "text": "Important note: My boyfriend is a recovered alcoholic, (it destroyed two years of my mental health and our relationship). So I naturally got worried seeing him at a bar without telling me.\n\nContext: My boyfriend expects me to tell him when I'm going out. Which is fair, I feel like partners should let their partner know if they go out to drink with their friends. NOT ASK PERMISSION, just a simple heads up. He would be extremely upset if I didn't tell him. \n\nBut a few nights ago, he went out drinking with his friends, and lied and said he was going to sleep. I only found out through our mutual friend posting some videos of the night. The next time we spoke, I asked him why he didn't just let me know, and he got mad. I stayed entirely calm and sweet, (I always do that, I literally never get angry at him,) but he immediately accused me of \"overreacting.\" He's STILL mad at me. Even though I said \"everything's okay babe, I'm not mad at you, I was just curious. I love you!\" He just said okay and hung up. \n\nIf anything, I under-reacted and now I'm extremely upset at:\n\n1. being lied to\n\n2. him getting mad at me for asking\n\n3. EXPECTING ME TO LET HIM KNOW WHEN I GO OUT BUT NOT DOING THE SAME.",
        "created_utc": 1676738304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to teach teens how to spot a moral panic?",
        "author": "frostandtheboughs",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115ja1a/best_way_to_teach_teens_how_to_spot_a_moral_panic/",
        "text": "I've got some nephews that just turned 14 and got smartphones for their birthday. I would like to create a non-partisan, age-appropriate curriculum to educate them on moral panics and media literacy. \n\nI just want to teach them how to use social media responsibly and not get sucked into some Andrew Tate -esque rabbit hole or conspiracy theory garbage. I want to teach them how to tell the difference between a \"good\" source of information vs some weirdo in a basement making things up.\n\nTheir mom is a single parent who doesn't have social media of any kind because their Dad was abusive, so she doesn't want to be found. She's a wonderful mother. \n\nOne nephew has already gotten in trouble for bullying so I'm most worried about him succumbing to the toxic masculinity spaces online. They both idolize their uncles so I feel uncles would be able to teach them this stuff and have it stick.\n\nDoes anyone have some good resources for teens?",
        "created_utc": 1676738208,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this healthy behavior in marriage?",
        "author": "Lalitoeatscheese",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115hhqn/is_this_healthy_behavior_in_marriage/",
        "text": "Hello, \n\nI'm sorry for the relationship post, but I feel that this community is more sane that many other ones.\n\nI've been married to my husband for 6 years, together for 8. Both 36 yo. It has not been an easy marriage. My husband is the most conflict avoidant person that you could imagine, he's also in the spectrum and doesn't communicate well.\n\nWhen we have conflict, he usually deactivates, which makes it linger for longer. In the last conflict, which imo wasn't too bad (we had been fighting for a few days about a misunderstanding related to me picking him up too early from work), he got off the car, screaming that he was done w the marriage. To give a bit more context, we were coming back from couples therapy and during therapy I had said that I was feeling disconnected from the marriage and it came up that a few years ago I felt happier w my friends than at home.\n\nAfter that, he came home a few hours later and moved to the guest bedroom. He pretty much avoided me for 3 weeks, and after that he started making repair attempts. \n\nMy problem is that I don't want to be in a relationship where that is how people deal w their feelings. It has been 6 weeks so far and I can't trust him. This is not the first time that he deactivates like that and it makes me feel like there's no commitment. I understand taking a cooling off period but I don't think that it should be that extensive. \n\nWith an effort of moving forward w our marriage, I proposed that we should have a set of rules or guidelines for how to react if someone was feeling overwhelmed, but he just found that it was controlling so he wasn't okay w it.\n\nI'm so exhausted of the withdrawal when things get hard that I'm willing to separate to avoid going through this same thing again.\n\nMy question for y'all is what is the norm? Am I crazy for wanting someone to not bail when things get hard? It's hard for me to discern what is healthy and what is not.\n\nThanks!",
        "created_utc": 1676733304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moms with teen girls or anyone with parenting help, how would you go about this situation?",
        "author": "independentKitten464",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115h5gt/moms_with_teen_girls_or_anyone_with_parenting/",
        "text": "So just for some background I have a 7th grader who has always been great academically and she has a few friends who seem nice for the most part, so that's all good. She's gotten to the age where she cares more about her appearance and clothes etc., which is of course to be expected but thankfully she's been pretty reasonable overall with her choices. I understand that's part of growing up.\n\nAnyway this morning after breakfast, she had plans go over to her friend's place to do some studying and hang out for a couple hours. So her ride arrived and she was all set to leave, but then when she bent down to tie her shoes, I noticed a skimpy thong peek out of her jeans... I was just kind of shocked, because I had no idea she started wearing thongs and I'm not quite sure how I feel about it. I mean she seems a bit young? And I know we can't all be perfect, but in any case the fact that I saw it when she bent down isn't too comforting either. Has anyone dealt with this situation? How should I go about talking to her?",
        "created_utc": 1676732359,
        "upvote_ratio": 1.0
    },
    {
        "title": "struggling w dealing w partner that deactivates during conflict",
        "author": "Lalitoeatscheese",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115h5bh/struggling_w_dealing_w_partner_that_deactivates/",
        "text": "Hello, \n\nI'm sorry for the relationship post, but I feel that this community is more sane that many other ones.\n\nI've been married to my husband for 6 years, together for 8. Both 36 yo. It has not been an easy marriage. My husband is the most conflict avoidant person that you could imagine, he's also in the spectrum and doesn't communicate well.\n\nWhen we have conflict, he usually deactivates, which makes it linger for longer. In the last conflict, which imo wasn't too bad (we had been fighting for a few days about a misunderstanding related to me picking him up too early from work), he got off the car, screaming that he was done w the marriage. To give a bit more context, we were coming back from couples therapy and during therapy I had said that I was feeling disconnected from the marriage and it came up that a few years ago I felt happier w my friends than at home.\n\nAfter that, he came home a few hours later and moved to the guest bedroom. He pretty much avoided me for 3 weeks, and after that he started making repair attempts. \n\nMy problem is that I don't want to be in a relationship where that is how people deal w their feelings. It has been 6 weeks so far and I can't trust him. This is not the first time that he deactivates like that and it makes me feel like there's no commitment. I understand taking a cooling off period but I don't think that it should be that extensive. \n\nWith an effort of moving forward w our marriage, I proposed that we should have a set of rules or guidelines for how to react if someone was feeling overwhelmed, but he just found that it was controlling so he wasn't okay w it.\n\nI'm so exhausted of the withdrawal when things get hard that I'm willing to separate to avoid going through this same thing again.\n\nMy question for y'all is what is the norm? Am I crazy for wanting someone to not bail when things get hard? It's hard for me to discern what is healthy and what is not.\n\nThanks!",
        "created_utc": 1676732347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mouth Sore--How to Heal It",
        "author": "JRadiantHeart",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115h0s8/mouth_sorehow_to_heal_it/",
        "text": "I bit my lip and now have an irritated oval of skin which is half inside and half outside of my lip. \n\n I've read up on how to heal the *inside* of my lip--avoid irritants like peroxide, glyoxide, and mouthwash. I'm following the recommendation to  rinse with warm saltwater before bed. \n\nWhat about the *outside*? Wondering whether plain chapstick or coconut oil on the outside would spur healing. Either overnight application or daytime.\n\nIs there anything else I can do? Perhaps swishing with coconut oil as well as applying it topically?\n I want to heal this quickly, as Cupid's arrow has hit me and I want to be back in the business of safely  smooching. \n\nI know the once daily coffee and  mint gum I use might be a culprit. Perhaps my mint toothpaste as well.\n\nThanks in advance.\nSincerely,\nSmoochless In Seattle",
        "created_utc": 1676731983,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to do if your partner withdraws extensively and often",
        "author": "Squeezy_pal",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115guxk/what_to_do_if_your_partner_withdraws_extensively/",
        "text": "[removed]",
        "created_utc": 1676731503,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have been your best skin care discoveries and routines?",
        "author": "MountainPerformer210",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115gocp/what_have_been_your_best_skin_care_discoveries/",
        "text": "Disclaimer: Reddit is not a place for certified dermatologists, but I've noticed immense improvement in my skin since starting a dedicated skin care routine and doing regular facials when the budget and time allows plus drinking lots of water. My skin care routine:\n\nDr Hauschka cleansing cream, toner, soothing day cream, rose hip body oil (for night)\n\nASAP hydrating moisturizer \n\nSPF 50 sunscreen topped off throughout the day \n\nNew York Biology face mask (twice a week for pore reduction)\n\nAlong with water, and getting a full night (7 hours) of sleep have really changed my skin.",
        "created_utc": 1676730961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unmarried women over 30- Do you see a benefit to marriage?",
        "author": "shellbloomagain",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115gc0s/unmarried_women_over_30_do_you_see_a_benefit_to/",
        "text": "Why or why not? The older I get the more I think it depends on whether or not I make more money than my partner. If I had a higher net worth I don’t think marriage would really benefit the woman but curious to hear other perspectives",
        "created_utc": 1676729937,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do y'all think about eliminating AP classes? The Florida thing...",
        "author": "LilDoggeh",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115fuuw/what_do_yall_think_about_eliminating_ap_classes/",
        "text": "For Non-Americans, here's the scoop: \n\n* AP stands for advanced placements\n* In high school, kids can take AP classes that prepare them to take tests that count toward college credits.\n* For example, you can take an AP Physics course in high school. It's college level material, and if you take the AP Physics test at the end of the year and pass it, many colleges will say: ok, that counts as your Physics requirement for your college level class in Physics.\n* It saves a lot of kids money. High school is generally free. College is generally not. My college roommate came into college with 52 AP credits, and got rid of an entire year of college (i.e, she saved closed to 24,000 dollars by eliminating that year).\n* A state governor (De Santis) wants to ban AP classes\n\nMy .02 - I mean, damn... some kids really need AP classes to make college affordable.",
        "created_utc": 1676728552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I reduce my 'staring life' fund to travel more?",
        "author": "Critical_Teaching_35",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115fkqq/should_i_reduce_my_staring_life_fund_to_travel/",
        "text": "I 23F am finishing school abroad in Spain. I have $22k in student loans and have $10k stowed away for when I'm done with school to put towards things like my car insurance, rent if I decide to move out, etc. I have enough money saved to support myself while abroad, and have a job lined up for when I finish school that will pay very well, but isn't something I'm really interested in/want to do long term, and would require me to live with my parents (its so close to home it wouldn't make sense to rent a place). My biggest goal when I'm done with school is to move out/relocate to a metropolitan area since I'm from the sticks. \n\nThat said, I haven't done as much travelling as I would like while living in Europe and since this is the only time I think I'll be doing that in my life, I'm debating dipping into my 'when I return home' fund to travel more while I'm here. Is this a bad idea, or should I leave that money where it is and prioritize getting another job and moving out and starting my life?",
        "created_utc": 1676727688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women, would you date a man that has used sex work? Why or why not?",
        "author": "SimplestBanana2",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115finz/women_would_you_date_a_man_that_has_used_sex_work/",
        "text": "[removed]",
        "created_utc": 1676727509,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be your best advice for 15-20 yrs younger you?",
        "author": "KMMMK-",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115eo44/what_would_be_your_best_advice_for_1520_yrs/",
        "text": "",
        "created_utc": 1676724773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Out of all the amazing qualities you have - which one is your favourite and why?",
        "author": "TheDinosaurDiaries",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115e5n0/out_of_all_the_amazing_qualities_you_have_which/",
        "text": "",
        "created_utc": 1676722961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice for a clueless 20M on dating/love?",
        "author": "Luffz_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115d6zz/any_advice_for_a_clueless_20m_on_datinglove/",
        "text": "",
        "created_utc": 1676719219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this excessive?",
        "author": "IamTrAsH58076",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115cxli/is_this_excessive/",
        "text": "I have a friend who is currently dating a guy she met on one of those dating apps. \n\nShe's very sweet, cute, really kind and intelligent. I love her to death. However, I think the way she treats her boyfriend is a bit....off. \n\nFor example: he must call her at specific times during the day and report his whereabouts and if he doesn't call her on time she'd lash out at him. She frequently checks his phone for nude photos of women; once she found a blurry picture and immediately accused him of infidelity—the poor guy even cried. She sent the picture to me and honestly I have no idea what it was. It could have been a thumb or a nose. \n\nShe was cheated on a lot in the past so I understand that there are some leftover insecurities and abandonment issues, but I think she may be doing too much? Or am I overreacting?\n\nWhat do you think? How should I advise her (if at all)? Thanks.",
        "created_utc": 1676718171,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with anger",
        "author": "Hackmops",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115b4kz/how_to_deal_with_anger/",
        "text": "Pretty much was the title says. I went to an initial therapy consultation a few days ago and even with all the sadness going on, the therapist pointed out that she senses a lot of anger under the surface. I find I can sometimes vent with a friend but it is only a temporary solution to blow off some steam but it does not help me with the great injustices in life and I don't want to do it too much because even I have recognised that being so negative all the time does not put you in a great state of mind. How do y'all deal with it?",
        "created_utc": 1676710872,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for ways to organize my life so that I still get the free (low quality) childcare and sharing of expenses while living with my husband, because I can't really afford to divorce him. Please brainstorm with me?",
        "author": "ThenConversation7",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115b2p9/im_looking_for_ways_to_organize_my_life_so_that_i/",
        "text": "[removed]",
        "created_utc": 1676710673,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did you ‘settle’ for in your partner and how did it fare out in the longer term?",
        "author": "lady_in_the_six",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115arzi/what_did_you_settle_for_in_your_partner_and_how/",
        "text": "I’m genuinely curious to hear stories of what women didn’t find appealing about their long term partner but decided to commit to them regardless. I personally struggle finding a man I find attractive on both physical and personality/values/beliefs sides, and have often traded off one for the other, and am having a philosophical debate with myself of what is truly important in a partner long term. \n\nWhat are the things that really made you sit back and think hard if you wanted to settle down with him long term?",
        "created_utc": 1676709457,
        "upvote_ratio": 1.0
    },
    {
        "title": "English Degree-Havers: What Do You Do?",
        "author": "meliorayne",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1158it1/english_degreehavers_what_do_you_do/",
        "text": "I (F27) got my BA in English 2 years ago. I was (obviously) a pretty late bloomer to the whole university scene, so I didn't really have the typical college experience and I feel like I missed out on a lot of opportunities to connect with others in my department. I thought I would teach, but after doing some student teaching, I realized it really wasn't for me, so when I graduated, I had no idea what to do afterward. I'm still in the same job I had while I was in college, and kinda at a loss as to how to make my degree work for me in a field that at least has decent upward mobility, if not decent starting wages.\n\nSo: ladies with English degrees, what do you do for work, and how did you get there? I'd love some advice or general direction from folks that have been there before!",
        "created_utc": 1676700649,
        "upvote_ratio": 1.0
    },
    {
        "title": "What advice would you give a lonely man struggling to get back in the dating game?",
        "author": "Former-University-65",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1158ifd/what_advice_would_you_give_a_lonely_man/",
        "text": "",
        "created_utc": 1676700614,
        "upvote_ratio": 1.0
    },
    {
        "title": "A good friend of mine is married to a man that admires alpha male podcasters such as Andrew Tate and Fresh and Fit. What would you say to her about it?",
        "author": "Objective-Elk-2910",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1158bg9/a_good_friend_of_mine_is_married_to_a_man_that/",
        "text": "",
        "created_utc": 1676699926,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Navigate dating scene after being a widow last 3+ years?",
        "author": "Nervous-Toe-6779",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115880g/how_to_navigate_dating_scene_after_being_a_widow/",
        "text": "\nHi ladies, I (F30) recently got back into the dating scene after being with my husband for 6 years and a widow for 3 (Total 9 years) honestly I’m really struggling and I know it’s pretty obvious but the whole dating scene is so different from when I in my late teens early 20s! \n\nThrough dating apps I’ve managed to basically get a lot of dates so thankfully that part isn’t the issue but I just keep seeing reoccurring patterns of like either guys meeting me on the first date coming on too strong trying to sleep with me on the first date or like some guys will be decent for a couple of dates but when it gets to the 3rd or 4th date they begin expecting intimacy and if they don’t get it they ghost. I’ve been on a lot of dates and that’s been the consistent reoccurring theme.\n\nIs there something I’m doing wrong here or things I should be aware of? \n\nI really feel lost like a duck out of water almost. If anyone can help and give advice that would be great!",
        "created_utc": 1676699561,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you have plans to meet with someone and they leave you on read.",
        "author": "MaterialConference4",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1158424/if_you_have_plans_to_meet_with_someone_and_they/",
        "text": "If you have plans to meet with someone and then the whole week they leave you on read and no responses at all. You check in with them to confirm the day before of the plans. They leave that message on read and they still don't respond. Then they eventually reply on the actual day. Would you go? Does this person even respect my time?",
        "created_utc": 1676699154,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you negotiate this?",
        "author": "limetot",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1157l09/how_do_you_negotiate_this/",
        "text": "I quit a very stressful career of 15 years (executive sous chef) 1 1/2 years ago and since then have been working for myself. I’ve been applying to jobs and taking my time to make sure I find something that’s the right fit for me but the money I’m making on my own is only just enough to pay my bills so the past few months I shifted to looking for something more entry-level and low stakes in addition to my own work so I can have consistent income and health insurance again (with my short term goal being that I can make a little extra to save towards emergency expenses and the education I need for a career change). \n\nI mentioned this to one of my good friends/former colleague and she was persistent in trying to get me to apply for a position in her company so I did just to see what would happen. I interviewed with several people for a lower-level hourly supervisor position and made it clear that I was happy with taking the significant pay and title cut compared to my previous position. \n\nHowever I didn’t realize that my friend had been talking me up to the executive team for months so they offered me an upper level front-of-house management position instead and sold it to me as a great opportunity to switch career paths. The salary is 15k lower than my minimum to accept a salaried position (that number based off what income I would need to be approved for the average rent for a 1bd apartment in my city) but when I raised concerns with my friend, she told me it’s reasonable because I don’t have experience managing in that department and people with my work ethic tend to move up quickly in this company. \n\nI’ve been in this position for about 6 weeks and while learning how to process payroll, I’ve found out that I am one of the lowest-earning full time staff in my entire department. The lowest entry-level position makes only 2k less than me a year, and that’s based on a 40 hour week. I am required to work 50 hours a week, but it’s been more like 60+. Because of the nature of this work, my schedule comes out only days before the work week starts, changes frequently, and isn’t consistent. And because this job doesn’t pay enough to cover my bills, I still have to work part time 15-20 hours a week to catch up and i am burning out quickly. \n\nI’ve been trying to think of a solution because I don’t want to quit so early (1.5 years looking for a job and this has been the best and only chance I’ve been given for a career change) but I don’t know how to approach my boss without any sort of plan/solution. In thinking about it constantly for the last 2 weeks, I can’t figure it out. I expressed my concerns with my friend and she said the justification for the line-level staff making more money is because there’s more “opportunity” in management. \n\nWhat should I do? Is it even worth negotiating? I go back and forth between feeling like I’m being taken advantage of and feeling like I’m being unreasonable.",
        "created_utc": 1676697283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extreme hanger but no other warning signs",
        "author": "PoopEndeavor",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1157756/extreme_hanger_but_no_other_warning_signs/",
        "text": "Not looking for advice as much as other people’s experiences with this situation.\n\n Bf and I are mid thirties. We unexpectedly went from friends to one-time hookup to dating for the last year. \n\nHe had a long dry spell before me (like reeeeally long) so I unfairly assumed he wouldn’t be partner material. But he’s actually one of the most emotionally intelligent, kind, patient, and thoughtful people I know. Except this one thing…\n\nThe hanger. \n\nWhen he’s hungry and we’re trying to decide what to do for dinner, he goes into this really unpleasant mode. He can’t answer questions I ask to narrow down options, and no matter what I offer he’s not into it and says he “doesn’t want to make decisions.” Yet every suggestion/decision I make is rejected! \n\nNormally, we either eat separately, cook for each other, cook together, heat up freezer food, or occasionally go out.\nHe’s a little picky but I try to keep at least a few things he likes on hand. He’s a pretty good cook and brings some stuff for himself, too. We stay at my place but he knows the kitchen.\n\nEventually I have to make an executive decision (“I’m eating xyz, you can either join or go do your own thing”). But I’ve explained that it’s unfair to be so short and moody with me at these times. I understand hunger and frustration, but it’s not my fault if he’s indecisive and doesn’t want a snack to take the edge off. I can’t win when he’s like this and it’s very unpleasant for me. Then he’s normal again after eating. It’s happened a few times and he’s apologised and said he’s working on it. He acknowledges it’s not ok. But it happened again yesterday. To a lesser degree, and he did acknowledge while it was happening, but he couldn’t seem to shake it. Our order took forever (we have terrible restaurant luck - we get forgotten or ignored or given wrong orders quite often for some reason. We’re both polite to workers, tip well, and aren’t kareny at all so 🤷‍♀️). But he lost his patience and was pissed off we had to wait so long. I acknowledged it was a frustrating situation, but I tried to just converse and hangout bc what else are gonna do? Why not make the most of it? But he was just stewing and negative so I got on my phone and walked away. He tried to recover but the negativity still seeped through.\n\n\nI have interests in crime, gender issues, scams, and human behavior, so I consume a lot of information about relationship hazards. I also have pretty good instincts about dangerous people and situations. I dgaf about offending someone, I’ll literally run away like a maniac if I feel unsafe. I’ve never been in an abusive relationship and am pretty familiar with common red flags, cycles of abuse, etc. I don’t trust easily and I’ve usually been right about people as far as trustworthiness and safety. I’m troubled bc I’ve read stories of partners who were a dream man for the first year or 5 years, then the abuse began. So how the hell can you know if something like this is just a little character flaw that can be improved, vs a huge red flag? I feel like how can I ever commit to anyone knowing they could just change down the line? Or do I hold out for perfection…which doesn’t exist?\n\nOne last thing that might matter. We both also deal with depression to different degrees (me way more), so I do know how it feels to feel like shit for no real reason and feel stuck in that feeling. I try not to impose it on others, though. Even so, he’s so compassionate and giving when I’m barely able to get out of bed. never makes me feel bad about it. So maybe I should just be patient about this (provided he continues to work on it and I see longterm improvement. I refuse to accept that treatment forever).\n\nIf anyone has experienced this, I’d be curious how it turned out. Did they overcome it? Did it get worse? What helped?",
        "created_utc": 1676695936,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend’s husband loves the alpha male podcast Fresh and Fit",
        "author": "Objective-Elk-2910",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11573c4/my_friends_husband_loves_the_alpha_male_podcast/",
        "text": "\nI recently discovered Andrew Tate and alpha male podcasts like Fresh and Fit and I am so disturbed. My friend’s husband told me to listen to it so I could “understand” men, which is ironic because I’ve been happily married for 10 years. Anyway, I listened to it, and I think it is the most sexist content I have ever heard. The next day I told my friend so and apparently she was offended because she put her husband on the call to debate it with me. He proceeded to tell me I was just being emotional and that I didn’t want to hear the truth about women. He was very patronizing and at times I could hear her laughing in the background. When I confronted her about that she said she was laughing at him because he was getting animated. I truthfully feel really sorry for her because I think she is in a bad relationship. I haven’t mentioned the whole thing since, but man it’s all very disturbing  :(",
        "created_utc": 1676695557,
        "upvote_ratio": 1.0
    },
    {
        "title": "My neighbours who I don’t know just circled the block and drove away while I was outside walking my dog. Wtf?",
        "author": "Top-Meringue-1375",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1156r00/my_neighbours_who_i_dont_know_just_circled_the/",
        "text": "I’m not a nosy or difficult person to live near. I have a dog who is inside and doesn’t bark. I don’t bother them. So I can be fairly certain they didn’t avoid me because I’m a horrible neighbour. \n\nSo I am so confused by this situation.  Either they are up to no good and want to keep a low profile or they just hate the thought of being spoken to. \n\nAnyone else got any ideas? Just curious",
        "created_utc": 1676694367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you worry you’d never meet a partner you like again?",
        "author": "Vivid-Language6500",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115670x/did_you_worry_youd_never_meet_a_partner_you_like/",
        "text": "So - this is about dating. Drop out now if you so desire.\n\nI’m single, much to my chagrin. I’m dating on the apps for the first time, and I’m really struggling with meeting anyone I like past date 3, much less see a future with. Not because the men are trash, but because I just don’t really like any of them that much. I’m giving it my best shot and I’ve taken a bit of a break, but the truth is I worry that maybe I’ll never meet anyone I connect with again. I like myself, I’ve worked on myself, my life is fine - but im not ashamed to admit I just really want a partner. I had the fulfillment and joy of a relationship with someone I felt was my person, and I want that again. I don’t believe in soulmates and I don’t think im hung up on my ex, but I just can’t seem to get jazzed about anyone. Does anyone else feel this way, or did you feel this way and then you met someone who blew your previous partners out of the water? I feel like I’m the problem but I don’t know how to “fix it” and meet someone I connect with",
        "created_utc": 1676692551,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom (64F) is getting a knee replacement. What's a great unique gift she can enjoy while she has temporary immobility?",
        "author": "strway2heaven77",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/115555s/my_mom_64f_is_getting_a_knee_replacement_whats_a/",
        "text": "Ideas from other place:\n\n- TIME, obviously spending time with her is the best thing (but I'll be out of the country unfortunately.)\n- Cards to DoorDash, GrubHub, etc (seems impersonal)\n- New pillow, padded laptop tray, etc\n- My buddy suggested a backscratcher\n- Massagers, foot baths, etc.\n\nAny other great and especially unique ideas? Thanks friends.",
        "created_utc": 1676689076,
        "upvote_ratio": 1.0
    },
    {
        "title": "constantly feeling like I'm breaking social norms?",
        "author": "princess_lissie_",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1153uf5/constantly_feeling_like_im_breaking_social_norms/",
        "text": "I swear I never used to have this problem but in the last 3ish years, I feel like I'm always violating some sort of unspoken rule. I haven't felt this unsure of myself since I was a teenager. I'm constantly offending someone or triggering friends' anxiety/trauma without meaning too. Every interaction I have with neighbors is stilted and awkward. I can't explain my perspectives to my family members without it getting heated. I don't know what I'm doing wrong or how to fix it so I can go back to being a productive member of society. Is there some sort of resource on how to handle social interactions, or even a forum that's like AITA but instead of conflicts it's \"was I weird or were they?\" (Jk on that last idea... Kinda)",
        "created_utc": 1676685041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you be interested in having a conversation about how women handle financial matters?",
        "author": "fluffiesbot",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1153n3t/would_you_be_interested_in_having_a_conversation/",
        "text": "We are a group of researchers at the University of Washington studying financial literacy in women, between the ages of 25 and 35, who currently reside in the United States. We are currently recruiting participants for a 60-minute (maximum) zoom interview about their experience with learning about and managing their finances during their lifetime. If you are interested in being a part of our study, please fill out the survey below! Participants will be selected and notified by 2/20/23. Thank you :)\n\n[https://forms.gle/wbKxUX5tF7T86WnL8](https://forms.gle/wbKxUX5tF7T86WnL8)",
        "created_utc": 1676684417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a safe and successful one night stand while traveling",
        "author": "TinyOnion1074",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1153n45/having_a_safe_and_successful_one_night_stand/",
        "text": "I’m a woman in my mid twenties who has never explored sexually. I haven’t even held hands with a man let alone had sex. I wasn’t saving myself, the opportunity never presented itself and I was very socially anxious. I used to feel insecure about it but I’ve finally gotten to a point where I don’t care that it hasn’t happened. I’ve realized that it’s very normal to be a late bloomer and I don’t need to worry about invisible social constructs, everyone has their own timeline. I’ve grown so much in the past few months and it has made me realize it’s a good thing that nothing happened, I wasn’t ready. All that being said, I’m ready. I know for a fact that I’m not looking for a relationship of any sort, all I truly want right now is to explore sexually. I’ve always envisioned my first time as a very casual (safe, respectful and fun) experience. \nI’m traveling to a big city from my tiny town for a few days and would like to use this opportunity to explore. I’ve heard stories of some great holiday hookup experiences and wanted to know how I can go about giving myself that experience especially as someone who has 0 experience with anything (including flirting). I’d rather not get on an app so if you have any tips on how to make this happen, I’d appreciate it you sharing. I want to add that I’m not going to force it or set an expectation that it should happen or anything. If it doesn’t happen, it doesn’t. But I do want to be open to the possibility. \nHow do you meet people? How to stay safe? How to spot red flags? Sex tips? First time tips? Communication tips? If you were me would you be upfront about the inexperience? \n\nThe main reason I ask here is because I feel like there is less judgment and more wisdom. Usually people’s first reaction is to say don’t rush it, wait for the right person, don’t have one night stands. But I’m not doing this out of desperation, and I’m definitely not rushing it. I finally feel ready and I’m excited and I want/have always wanted a very casual enjoyable first time experience. So please don’t try to tell me what I should or shouldn’t want.",
        "created_utc": 1676684417,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study on how women handle financial matters.",
        "author": "Common_Ad6601",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1153l71/study_on_how_women_handle_financial_matters/",
        "text": "[removed]",
        "created_utc": 1676684256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Leaving a 'work bag' of feminine supplies in the restroom",
        "author": "LenoreSkellington",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1153014/leaving_a_work_bag_of_feminine_supplies_in_the/",
        "text": "I work in a machine shop.\nBest guess, there are maybe 10-15  women across all shifts.\n\nI have a fair share of IPSY bags I like to use for feminine products. \n\nThey allow me to keep an adequate supply for days I may need them.\n\nI want to leave one in the bathroom at work. I don't truly care if other women use them - however- I would like to leave a note either taped to the bag or inside the bag that says 'Don't be greedy - they're not yours - but they're here if you need them.'\n\nThoughts on this? I don't want to be solely responsible for supplying other women with these products, but I'm absolutely OK with making sure there's something available in a pinch. No one should have to wad up toilet paper.\n\nJust wanting input on:\n1. What to put on the note\n2. If I should include my name (in case anyone wants to contribute or may like a bag)\n3. Tell the managers I'm doing this\n\nThanks!",
        "created_utc": 1676682485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asexual women: have you found a partner accepting of you?",
        "author": "Grouchy-Sherbert1062",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1151xrd/asexual_women_have_you_found_a_partner_accepting/",
        "text": "I've decided that I've become ace (asexual) with age, but still interested in finding a romantic partner. For late 30s and older women, wondering if you found a partner ok with you being ace?",
        "created_utc": 1676679417,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with a controlling sister?",
        "author": "worriedoften123",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11517bk/how_to_deal_with_a_controlling_sister/",
        "text": "[removed]",
        "created_utc": 1676677358,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't deal with everyone's problems anymore",
        "author": "readytorhumba",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1150g8v/i_cant_deal_with_everyones_problems_anymore/",
        "text": "I'm mid 30s and single (I think this is relevant because people perceive I don't have much going on - I do! I have a pretty full life.). It feels like everyone sees me as an easy target for dumping their problems on. It's got to the point that friends now call me when mutual friends they've introduced me to need help rather than dealing with it themselves.\n\nI can't take anymore. I have a lot of shit going on. My health is up and down (thanks cancer!) and I feel like when I start drawing boundaries people get offended. When I have a hard time with scans or post cancer stuff they tell me how lucky I am to have a second chance and I just need to get on with my life. I don't get support or sympathy (I don't want sympathy tbh, it's a wasted emotion).\n\nIs this a thing? Is it because I'm single? Is it because I'm seen as emotionally resilient? I feel like if me drawing boundaries means I lose friends then it's not my loss. \n\nAny advice other than cut them out? I'm leaning heavily towards cutting people out where there isn't mutual support. I'm too old for this shit, but equally I'd feel terrible if something awful happened and I hadn't tried to help the person.",
        "created_utc": 1676675312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neighbor woman",
        "author": "Glittering-Lock-6343",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/11503u0/neighbor_woman/",
        "text": "[removed]",
        "created_utc": 1676674384,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"f-buddy tried to talk me into being his hooker\" update as requested",
        "author": "lizlaf21952",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114zi4j/fbuddy_tried_to_talk_me_into_being_his_hooker/",
        "text": "https://www.reddit.com/r/AskWomenOver30/comments/110zkm8/just_had_a_fbuddy_of_mine_try_to_talk_me_into/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button\n\n(^original post)\n\nSo here's the update. He texted me the next day asking me his usual \"smooth\" questions, calling me \"sweetheart\" and all this other bullshit. Instead of threatening him with legal action, I took practically forever to respond to each of his texts. Communication dropped off after he asked me how I slept and I replied \"didn't really sleep too well.\" His last reply was \"I'm sorry to hear that, baby\" and I simply stopped replying after that. \n\nHypothesis: this guy fully expected me to draw up all the plans and motivate HIM into pimping/prostitution, he was actually quite lazy while fully believing that *because* I told him that I'm tired of crappy casual sex with no relationship, that an actual solution to this problem would be that I would breathlessly jump all over becoming a well paid prostitute with clients of his choosing. 🤣 Fucking wackjob. Haven't heard from him since.",
        "created_utc": 1676672802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone here have oily skin? What is your routine?! What products do you use?",
        "author": "RUsername01012023",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114yvni/does_anyone_here_have_oily_skin_what_is_your/",
        "text": "I have very oily skin and have to use harsh cleansers. When I run out, I use regular soap but pat my face with alcohol afterwards.\n\nNo moisturizer.\n\nThat probably sounds crazy but my skin is so oily that if I don’t wash my face 2-3x a day, and keep moisturizers low and face touching to a minimum, I break out bad.\n\nMaybe in the coldest months of the winter I’ll use a very light moisturizer every other night or so.\n\nI need tips, advice, anything. I don’t know much about skincare and products.\n\nDo I need to drink more water? Am I doing something to cause oily oil?\n\nGlamGlow Supermud Mask works for me - but it’s $60 + dollars\n\nBoscia charcoal Cleanser and mask I like as well, also $$$$.",
        "created_utc": 1676671208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on period pains?",
        "author": "Green_Scholar_1232",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114yo7v/advice_on_period_pains/",
        "text": "Hi- I might need some advice from people who might have more experience in this area. My period cramps are generally pretty painful but also very irregular...I have rare good months where I barely feel anything, and then some really bad months where everything just aches (but I'm generally able to function regardless and don't take painkillers very often). Recently though, I've noticed 'bad' becoming 'worse', if that makes sense? I've had a couple of periods in recent months that were so bad that they actually almost drove me to tears, and then today I could barely function because I was in so much pain...I'm in college, I live off-campus and had to leave class early and call someone to pick me up because I couldn't move and couldn't keep myself from crying. Then I was pretty much crying and hyperventilating the whole ride home, and couldn't get up off the floor once I got there. My ride wanted to take me to the emergency room because apparently it looked (and felt, honestly) that bad.  \n\n\nIt's died down now and I'm actually able to move around and talk like a human being again, but the whole experience has left me kind of shaken; I've had painful before but not this kind of incapacitating level of pain. In conclusion, I know this isn't a medical subreddit, I just wanted to ask if anyone here has had a similar experience and whether this kind of randomly super-horrible period can just \\*happen\\* for no reason? Has anyone had something like this happen and was fine afterwards? Or is it better to see a doctor to be on the safe side? Any second opinions would be appreciated;;; if it helps to know, age-wise, I'm a month away from 19",
        "created_utc": 1676670678,
        "upvote_ratio": 1.0
    },
    {
        "title": "How has losing 40+ pounds affect you?",
        "author": "happyandthankful",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114xh1h/how_has_losing_40_pounds_affect_you/",
        "text": "",
        "created_utc": 1676667629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late period with cramps for over a week. I’m 30. Never happened before. Not pregnant.",
        "author": "hello5194",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114xglf/late_period_with_cramps_for_over_a_week_im_30/",
        "text": "I had posted here before and you lovely ladies told me to get a pregnancy test because cramps can be a sign of pregnancy. I took the pregnancy test and it was negative. I actually took it twice. I took the ones that work six days before your period. So, I think it’s safe to say that it is very unlikely that I’m pregnant. Not to mention, I have been practising safe sex so it is even more unlikely that I am not pregnant.\n\nNow, the real question is, has this happened to anyone before where their period is late and they have cramps? They are a little less severe than earlier this week but still there. I have health anxiety so lol considering I was already anxious before my anxiety is now high and I’m super worried this is as a result of a serious medical condition. I would love to hear others stories. 😊",
        "created_utc": 1676667603,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to explain to my husband that his constant baby voice kills my sexual desire of him?",
        "author": "balrogbellyrubs",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114xf4e/how_to_explain_to_my_husband_that_his_constant/",
        "text": "Using a baby voice is fine sometimes, but my husband has gotten into the habit of constantly using it in and outside of the bedroom. He's a sensitive guy, so I try to tread lightly when it comes to critiquing him in any shape or form. I've brought to up a couple of times in the past, but it hasn't seemed to have stuck. \n\nHow do I bring this up lightly?",
        "created_utc": 1676667495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seasonal depression",
        "author": "riseaboveitx",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114xde7/seasonal_depression/",
        "text": "If you struggle with seasonal depression did you find relocating to a less prone place significant for your mental health?\n\nI live in an abysmally overcast part of Michigan, lots of cloud cover being right off Lake Michigan. I have struggled with SD for most of my adult life but it has become debilitating. I’m at the point where I can’t imagine staying here in this vicious cycle, despite loving my proximity to family and being mostly happy with the area. I really love Michigan for the beginning of winter and in every other season, I just can’t stand going through this. I do see a therapist thankfully.",
        "created_utc": 1676667366,
        "upvote_ratio": 1.0
    },
    {
        "title": "What clothing or outfits or styling do you find attractive on men?",
        "author": "jessemerollin",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114wxfb/what_clothing_or_outfits_or_styling_do_you_find/",
        "text": "[removed]",
        "created_utc": 1676666234,
        "upvote_ratio": 1.0
    },
    {
        "title": "I should be sad",
        "author": "ican76543",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114wwcq/i_should_be_sad/",
        "text": "[removed]",
        "created_utc": 1676666161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Therapy is too expensive",
        "author": "5_5apple_Arwen26",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114we03/therapy_is_too_expensive/",
        "text": "Are there any alternatives?",
        "created_utc": 1676664864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Tell Me I’m (37f) Not The Only One Enduring This Much Hell on “the apps”?",
        "author": "NotTodayThrowAway55",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114w95m/please_tell_me_im_37f_not_the_only_one_enduring/",
        "text": "I’ve been off and on dating apps for the past four years, since my (soon-to-be-ex) husband and I tried opening things up as a last-ditch effort to save the marriage. For most of this time I wasn’t looking for anything more serious than a fwb. It was fine, great even back then. I met a ton of cool guys I saw multiple times each, and they all treated me fine. One of those fwb situations even turned into something serious.\n\nWell back in November that guy dumped me, right around the same time my husband and I decided to officially call it quits (amicably, he’s been great through this all.) I decided to jump back into the apps and find a fwb for some fun/distraction. It’s been AWFUL! So different out there than I remember. With both the number of responses and dates that result, and also what happens after. Ghosting. So much ghosting.\n\nA few weeks back I was relieved to meet a decent guy. We had a fantastic first date. He texted me after (before I even got home) and kept the conversations going. He lived a few hours away and so after texting a bit suggested we spend the weekend together for our second date, halfway between our cities. He booked a hotel at a casino and we spent the next two weeks texting and flirting a lot. Whelp. He just cancelled, a few hours before I was about to leave for the hotel, with a lame stomach bug excuse. Then he ghosted. \n\nTell me to stop crying my eyes out, and that it’s not me? That it’s this bad for everyone? Why are men ghosting so much more, without any seeming reason, even when all we’re asking for is something casual and ongoing? I’m not trying to get a ring. Just be treated like a person, damn.",
        "created_utc": 1676664519,
        "upvote_ratio": 1.0
    },
    {
        "title": "This one is dark but seriously urgent",
        "author": "femcelmindpalace",
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/114vyy7/this_one_is_dark_but_seriously_urgent/",
        "text": "[removed]",
        "created_utc": 1676663831,
        "upvote_ratio": 1.0
    }
]