[
    {
        "title": "I want to study astrophysics in college but i have not studied it in secondary/ highschool.Would it be possible? ",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/xz0xl/i_want_to_study_astrophysics_in_college_but_i/",
        "text": "",
        "created_utc": 1344562223,
        "upvote_ratio": ""
    },
    {
        "title": "New Cosmos Data Poised to Unlock Secrets of the Universe",
        "author": "streetlite",
        "url": "http://www.dailygalaxy.com/my_weblog/2012/08/new-cosmic-survey-data-poised-to-reveal-secrets-of-the-universe-.html",
        "text": "",
        "created_utc": 1344466008,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good universities that I should look into to pursue a career in Astrophysics? ",
        "author": "Tiger21SoN",
        "url": "http://www.reddit.com/r/astrophysics/comments/xqrmp/what_are_some_good_universities_that_i_should/",
        "text": "I'm currently a high-school student and I want to know what schools I should start looking into. Astrophysics has always been an interest of mine and since none of my guidance counselors know anything, I was hoping that r/astrophysics could help. Thanks! ",
        "created_utc": 1344220066,
        "upvote_ratio": ""
    },
    {
        "title": "A good run down on Black Holes and Event Horizons",
        "author": "Scienceman23",
        "url": "https://www.youtube.com/watch?v=iA53l7AG7Pg",
        "text": "",
        "created_utc": 1343949237,
        "upvote_ratio": ""
    },
    {
        "title": "Death by Black Hole: Neil deGrasse Tyson describes what it might feel like to be crushed in deep space ",
        "author": "oddpunch",
        "url": "http://fora.tv/2008/02/19/Neil_DeGrasse_Tyson_Death_by_Black_Hole#fullprogram",
        "text": "",
        "created_utc": 1343909353,
        "upvote_ratio": ""
    },
    {
        "title": "What is it like to be an astrophysicist? The importance of stupidity in research.",
        "author": "ivenoneoftheanswers",
        "url": "http://www.gatsby.ucl.ac.uk/~pel/misc/stupidity.html?fwcc=1&amp;fwcl=1&amp;fwl",
        "text": "",
        "created_utc": 1343906597,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone name some elite scientists?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/xjzvl/can_someone_name_some_elite_scientists/",
        "text": "Could anyone give a list of big players in the field? Anyone from those who made really large contributions to the science to those who are more educators (Carl Sagan, etc.)",
        "created_utc": 1343897114,
        "upvote_ratio": ""
    },
    {
        "title": "Advice?",
        "author": "thisguy45",
        "url": "http://www.reddit.com/r/astrophysics/comments/xjvzp/advice/",
        "text": "I am a tenth grader and I am very intrigued by this subject. Can someone give me a little info on how they got to where they are now, what I can do to help me get there, and some popular misconceptions people have about this feild? Also I'd like it if someone would recommend some good books to read on the subject.",
        "created_utc": 1343889808,
        "upvote_ratio": ""
    },
    {
        "title": "Movement to make Apollo 11 Moon Landing a Holiday. Let's do it.",
        "author": "littlesparkvt",
        "url": "http://www.moonlandingday.com/index.html",
        "text": "",
        "created_utc": 1343655003,
        "upvote_ratio": ""
    },
    {
        "title": "Books for someone interested in Astrophysics/Astronomy?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/xdc6z/books_for_someone_interested_in/",
        "text": "Sorry if this isn't the right subreddit, I wasn't sure where to post at.\n\nMy younger brother (17ish) is very interested in going into astrophysics. His birthday is coming up and I'm trying to think of a good book to get him but I'm out of my element. He has read both of Phil Plait's books and one of my textbooks, is subscribed to Sky and Telescope, is currently reading Cosmos, and has a really nice book on the constellations and such. He also watches everything he can on the subject as well.\n\nThe textbook I gave him was The Essential Cosmic Perspective by Bennet, Donahue, Schneider, and Voit. It was pretty basic and he complained that he already knew most of what was in the book.\n\nHe has a real interest in black holes and quasars. He doesn't know too much math because his school sucks, he's at a trig level, but if things were explained well I think he wouldn't mind a bit of math. ",
        "created_utc": 1343614743,
        "upvote_ratio": ""
    },
    {
        "title": "DIY/Amateur Radio Astronomy",
        "author": "irokie",
        "url": "http://www.reddit.com/r/astrophysics/comments/x91rf/diyamateur_radio_astronomy/",
        "text": "I made a [post](http://www.reddit.com/r/Astronomy/comments/x8ndn/amateurdiy_radio_astronomy/) in /r/Astronomy about what sort of things a person might expect to ~~see~~ observe with a small dish.  This might be a better place to get some answers...\n\nAre there any radio-astronomers out there?  Would this be incredibly tedious for an amateur?  Is there anything that is particularly worth looking for?  Could I, for example, pick up the pulsars used as triangulation points on the Voyager plaques?\n\nThanks!",
        "created_utc": 1343403445,
        "upvote_ratio": ""
    },
    {
        "title": "If all the matter of the entire know universe was in one spot...",
        "author": "Tezdoll",
        "url": "http://www.reddit.com/r/astrophysics/comments/x47wq/if_all_the_matter_of_the_entire_know_universe_was/",
        "text": "I was watching the tv show, \"Seeing Black Holes\" on some science channel and it raised a question. If all the matter of the known universe was at one point (the big bang), 100 million million galaxies worth of matter, why did it not deteriorate in a super massive black hole right then and there?",
        "created_utc": 1343193280,
        "upvote_ratio": ""
    },
    {
        "title": "Want a tattoo of a quasar. Would you guys be kind enough to help me out?",
        "author": "angelofdeathofdoom",
        "url": "http://www.reddit.com/r/astrophysics/comments/x3svw/want_a_tattoo_of_a_quasar_would_you_guys_be_kind/",
        "text": "So like I said, I'm interested in getting a tattoo of a quasar. I would like to be informed about them beforehand.\n\n[I have watched this video](http://www.youtube.com/watch?v=qil7bKy1NrQ).  And have now read the Wiki on them\n\nDo you guys have any other suggested videos for viewing or any knowledge you would like to impart. \n\nSecondly, could you guys help pick out an image to start with.  I'm looking for something that is an accurate representation of a quasar. The artist can add some style to it later\n\nI have these two (and can screen grab some from the video) and if you could comment on them that would be great. Feel from to suggest your own pictures as well.\n\nhttp://i.imgur.com/rYgR8.jpg\n\n\nhttp://i.imgur.com/0Ukan.jpg",
        "created_utc": 1343178211,
        "upvote_ratio": ""
    },
    {
        "title": "Are there comets, asteroids or other space projectiles traveling so fast that their trajectory towards earth would be mostly undetectable before impact?",
        "author": "deejayreddit",
        "url": "http://www.reddit.com/r/astrophysics/comments/x02wy/are_there_comets_asteroids_or_other_space/",
        "text": "",
        "created_utc": 1343020205,
        "upvote_ratio": ""
    },
    {
        "title": "\"New type of chemical bond may form in extreme \nmagnetic fields of stars\" via Ars Technica",
        "author": "orionshmorion",
        "url": "http://arstechnica.com/science/2012/07/new-type-of-chemical-bond-may-form-in-extreme-magnetic-fields-of-stars/",
        "text": "",
        "created_utc": 1342728386,
        "upvote_ratio": ""
    },
    {
        "title": "Mexican American undergraduate who is studying astrophysics and i need your wisdom about graduate school!",
        "author": "physicsmathgeek",
        "url": "http://www.reddit.com/r/astrophysics/comments/wlt1t/mexican_american_undergraduate_who_is_studying/",
        "text": "I am a Mexican American pursing an astrophysics degree at Ohio University. I am a rising sophomore and i have decided that i want to purse a PHD. My question to all who are in top graduate schools, can you provide any advise? your stats.(if i may ask), and do you think i have a chance of getting in base on my ethnicity(and of course good grades, research experience, high PGRE,etc.)?  \n\nNote: Planetary Astronomy is my first choice of major research. If you have any questions please ask. thank you",
        "created_utc": 1342381996,
        "upvote_ratio": ""
    },
    {
        "title": "What the Higgs-(like) boson discovery says about modern science",
        "author": "unitvector",
        "url": "http://smallerquestions.squarespace.com/blog/2012/7/11/the-big-higgs.html",
        "text": "",
        "created_utc": 1342106952,
        "upvote_ratio": ""
    },
    {
        "title": "Oscillating instead of expanding universe?",
        "author": "TwinkyTheKid",
        "url": "http://www.reddit.com/r/astrophysics/comments/we42n/oscillating_instead_of_expanding_universe/",
        "text": "Greetings physicists and physics enthusiasts...\n\nI understand that there is a new theory of our Universe is that it may exist within a black hole of a Universe that contains the black hole which houses out universe. \n\nI had a question on this subject as I wonder. Could this potentially explain that our universe is not, in-fact, expanding; but rather oscillating? \n\nBlack holes exists as a point of singularity as a mass of infinite density, but as waves of radiation is emitted from black holes it is theorized that the mass oscillates slightly. Could this account for a presumed expansive motion of our universe? We see expansion and dread contraction but may there be a chance that the 1(expansion/contraction) universe may be wrong and that we're just (right now) expanding in an infinite loop of oscillation?",
        "created_utc": 1342024879,
        "upvote_ratio": ""
    },
    {
        "title": "Problems with the Fine-Tuning Argument",
        "author": "NeedsEvidence",
        "url": "http://debunkingchristianity.blogspot.com/2012/07/problems-with-fine-tuning-argument.html#more",
        "text": "",
        "created_utc": 1341974261,
        "upvote_ratio": ""
    },
    {
        "title": "Is Neil DeGrasse Tyson a elite astrophysicist?",
        "author": "peepseroni",
        "url": "http://www.reddit.com/r/astrophysics/comments/wc1r5/is_neil_degrasse_tyson_a_elite_astrophysicist/",
        "text": "I'm completely illiterate when it comes to astrophysics but I'm intrigued by Tyson as a person and a communicator and very much respect his efforts to educate the public about science. But I've always wondered if he really is considered, within the field of astrophysics, to be a top-class scientist or rather just a good communicator of the science?",
        "created_utc": 1341938162,
        "upvote_ratio": ""
    },
    {
        "title": "What makes gravity have it's unique force? ",
        "author": "miagi100",
        "url": "http://www.reddit.com/r/astrophysics/comments/w8u5h/what_makes_gravity_have_its_unique_force/",
        "text": "I understand gravity comes from a large amount of mass, but why, why does a large amount of mass, such as the earth have that tug or pull on us as humans to stay grounded. Why does the sun have the tug on the Earth for us to stay in orbit. \n\nwhy does mass want more mass, why does it attract other things?\n..I'm young and fairly new to space and time, it's a bit overwhelming for me to be honest. I'm having trouble grasping certain ideas, any comments would be appreciated. ",
        "created_utc": 1341794545,
        "upvote_ratio": ""
    },
    {
        "title": "Regarding the recently discovered binary star systems...",
        "author": "jmorlin",
        "url": "http://www.reddit.com/r/astrophysics/comments/w4x1x/regarding_the_recently_discovered_binary_star/",
        "text": "I read about [the newly discovered systems](http://www.sci-news.com/astronomy/article00447.html) and after being prompted by another redditors comment, I started to calculate the total kinetic energy of the system.  However I cannot get an exact number as I cannot determine the orbital radius.  I was hoping someone here could help with that... please?\n\n\n[my calculations so far](http://www.reddit.com/r/science/comments/w4eqj/astronomers_discovered_four_impossible_binary/c5a7kjn)",
        "created_utc": 1341594136,
        "upvote_ratio": ""
    },
    {
        "title": "The Higgs Boson explained simply by Minute Physics",
        "author": "ajclarke",
        "url": "http://www.youtube.com/watch?v=9Uh5mTxRQcg&amp;feature=player_embedded",
        "text": "",
        "created_utc": 1341515233,
        "upvote_ratio": ""
    },
    {
        "title": "The Proton-Proton chain reaction, how our Sun fuses Hydrogen into Helium &amp; releases energy (x-post r/physics)",
        "author": "Corsten",
        "url": "http://www.tysonswalk.net/2012/07/02/physics-stellar-fusion-i/",
        "text": "",
        "created_utc": 1341348988,
        "upvote_ratio": ""
    },
    {
        "title": "Solar Flares Hitting Earth, causing heightened SID pickup over Europ",
        "author": "ion-tom",
        "url": "http://news.discovery.com/space/solar-flare-ionizes-europe-skies-120702.html#mkcpgn=rssnws1",
        "text": "",
        "created_utc": 1341262789,
        "upvote_ratio": ""
    },
    {
        "title": "A polite request - would someone be interested in archiving from reddit the works of a pretty neat astrophysicist?",
        "author": "Gimli_The_Dwarf",
        "url": "http://www.reddit.com/r/astrophysics/comments/vxkxe/a_polite_request_would_someone_be_interested_in/",
        "text": "[RobotRollCall](http://www.reddit.com/user/robotrollcall) was pretty active in /r/askscience for a few months, and shared some pretty incredible insights into the universe, relativity, black holes, etc. She had a way of helping one really grok what the heck was going on, if you chose to open your brain and listen. \n\nHowever, she got frustrated at the constant \"but what if you *could* go faster than the speed of light?\" and left about ten months ago. \n\nMany of the threads she participated in have some really great stuff, and I worry that either reddit might start deleting older user accounts, or she might come back and delete it herself. Some of this stuff should be saved, IMHO. \n\nSo I'm just making the suggestion that if someone's looking for a short-term hobby, organizing and archiving her posts would be worthwhile. Just a thought. ",
        "created_utc": 1341250263,
        "upvote_ratio": ""
    },
    {
        "title": "What's the difference between astronomy and astrophysics courses? ",
        "author": "tacoman202",
        "url": "http://www.reddit.com/r/astrophysics/comments/vttgz/whats_the_difference_between_astronomy_and/",
        "text": "",
        "created_utc": 1341026889,
        "upvote_ratio": ""
    },
    {
        "title": "Leap Second on Saturday Will Cause 61-Second Minute ",
        "author": "sunnydelish",
        "url": "http://www.space.com/16356-leap-second-added-clocks-saturday.html",
        "text": "",
        "created_utc": 1340985527,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for ideas for an undergrad research project.",
        "author": "pacman529",
        "url": "http://www.reddit.com/r/astrophysics/comments/vqt30/looking_for_ideas_for_an_undergrad_research/",
        "text": "So at my school we have to do an internship, and a faculty guided research project counts. Don't bother telling me to look into REUs or actual internships, I'm doing that as well but want to do a research project either way. I am currently majoring in physics with a double minor in math and computer science. I've fallen in love with space and want to focus on astrophysics as much as possible. I would love to do a guided research project involving astrophysics, but I'm not really sure what exactly I'd like to research that would be doable, which is why I'm asking you guys. \n\nI'm going into my senior year.\nHere is a list of my relevant courses, to give you an idea of my capabilities and knowledge base:\n-modern physics (basically intro to SR and quantum)\n-quantum mechanics\n-statics\n-astrophysics (was mostly about planetary orbits,included some visual python programming)\n-AC/DC circuits\n-electronics (mostly logic gates and such)\n-intro to experimental design\n-cslculus up thru multivariable\n-linear algebra\n-differential equations (have to retake)\n-intro to algorithmic design 1 &amp; 2 (inrto cs courses, all programming in C++)\n\nI'm really interested in cosmology, galaxy formation and life, gravatational lensing. I'd like to do something somewhat unique nd challenging without biting off more than i can chew. Any and all suggestions are really appreciated! Thanks!",
        "created_utc": 1340897110,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible that The Great Attractor is just the universe on a similar path that the planets have around the sun?",
        "author": "Treheveras",
        "url": "http://www.reddit.com/r/astrophysics/comments/vpzi8/is_it_possible_that_the_great_attractor_is_just/",
        "text": "I have heard people talk about the mysterious area of the universe that all galaxies we can see are moving towards. But could it just be that we are circling something, and the universe is just too big for us to know we are travelling in a circle instead of travelling to a destination?",
        "created_utc": 1340852902,
        "upvote_ratio": ""
    },
    {
        "title": "Asteroid 2012 LZ1 Just Got Supersized : Discovery News",
        "author": "shredditor",
        "url": "http://news.discovery.com/space/asteroid-2012-lz1-just-got-supersized-120622.html",
        "text": "",
        "created_utc": 1340491564,
        "upvote_ratio": ""
    },
    {
        "title": "Extensive Water in Mars Interior",
        "author": "NGC300",
        "url": "http://carnegiescience.edu/news/extensive_water_mar’s_interior",
        "text": "",
        "created_utc": 1340439788,
        "upvote_ratio": ""
    },
    {
        "title": "Alien World Looms Large in its Neighbor's Sky",
        "author": "NGC300",
        "url": "http://www.cfa.harvard.edu/news/2012/pr201220.html",
        "text": "",
        "created_utc": 1340439103,
        "upvote_ratio": ""
    },
    {
        "title": "which department of Univ. of Colorado offering PhD Astrogeophysics course?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/vdk9i/which_department_of_univ_of_colorado_offering_phd/",
        "text": "well, i have come across astrogeophysics course http://www.colgate.edu/academics/catalogue/coursesofstudy/astrogeophysics by Colgate Univ. for their BA Major course. I want to do research in different univ. like Univ. of Colorado. I am more excited about this course. http://en.wikipedia.org/wiki/John_A._Eddy who was the first student in this program. It would be very helpful if you suggest the relevant department so that i can get more information about the research in the department. i am confused for its course name ...   ",
        "created_utc": 1340275843,
        "upvote_ratio": ""
    },
    {
        "title": "If space and time are linked (spacetime) then how are we able to calculate the age of the Universe?",
        "author": "comawhite53",
        "url": "http://www.reddit.com/r/astrophysics/comments/vaonk/if_space_and_time_are_linked_spacetime_then_how/",
        "text": "As I understand it gravity affects time. The closer you are to a source of gravity the slower time is relative to areas experiencing less gravitational pull. And as you \"wind the clock back\" the Universe becomes more compact therefore gravity increases which warps time. Surely this means the concept of a \"year\" becomes meaningless. So why is 14 billion years always quoted as the age of the Universe?",
        "created_utc": 1340142598,
        "upvote_ratio": ""
    },
    {
        "title": "How do I switch to a career in astrophysics?",
        "author": "astronerd44",
        "url": "http://www.reddit.com/r/astrophysics/comments/v94fn/how_do_i_switch_to_a_career_in_astrophysics/",
        "text": "Rather than bore you to tears with the exceedingly long life story I punched out earlier, allow me to distill my situation into a few short bullet points for you:\n\n- 27 years old\n- Undergrad degree in finance\n- Employed in the finance sector rising up very quickly \n- Completely unsatisfied with job and want to change careers\n\nWhat do I need to do in order to make this happen? \n\nWill I need to take further undergraduate coursework to increase my GPA or get a new major? \n\nCan I/must I get a master's prior to my PhD? \n\nWhat are my chances of getting into a good program if I excel in my graduate studies?\n\nI've spent a lot of time thinking this through and I am very certain that this is the direction I would like to pursue with my life, I just need some advice on mapping out the path I need to take to get there.\n\nThanks!",
        "created_utc": 1340068102,
        "upvote_ratio": ""
    },
    {
        "title": "Need Help Unpacking Some Astro Data (.fz)",
        "author": "baconarray",
        "url": "http://www.reddit.com/r/astrophysics/comments/v8a0j/need_help_unpacking_some_astro_data_fz/",
        "text": "Hey guys. I'm an undergraduate intern working the summer at an observatory and we went to access some solar data and found it packed in this .fz file extension. After some Googling I know it is a common compression format for astronomy files but most of the websites spend more time talking about what a wonderful compression technology it is and not nearly enough on how to actually uncompress it. I guess, could someone explain it to me like I'm 5.",
        "created_utc": 1340036824,
        "upvote_ratio": ""
    },
    {
        "title": "Any ideas for a project on the use of emission spectra in astrophysics, for a high school student?",
        "author": "Bubble_Lord",
        "url": "http://www.reddit.com/r/astrophysics/comments/v818o/any_ideas_for_a_project_on_the_use_of_emission/",
        "text": "So I'm doing year 12 Physics (in Australia) and we're doing an issues investigation where we choose a topic and develop a focus question for it.\n\nI chose my topic as 'the use of emission spectra in astrophysics' (partly because I want to study Astrophysics in uni) and I'm trying to come up with a focus question.\n\nI thought of the question 'Can spectroscopy be used to identify habitable planets?' after doing some research online, but I'm not sure if it would be too difficult an area for a high school student to look into.\n\nDoes anyone have any ideas about whether my question is suitable/any better focus questions? \n\nThe project doesn't have to be started for a few weeks but it's sometimes hard to come up with a good focus question.",
        "created_utc": 1340025675,
        "upvote_ratio": ""
    },
    {
        "title": "Dark Matter and Mass to Light Ratios of Galaxies",
        "author": "spuds1234",
        "url": "http://www.reddit.com/r/astrophysics/comments/v5z4d/dark_matter_and_mass_to_light_ratios_of_galaxies/",
        "text": "I cannot find a clear answer for this question so I thought I would ask here.\n\nIf a galaxy contains a great deal of dark matter, then, compared to the mass-to-light ratio of the inner part, what will the mass-to-light ratio of the whole galaxy be?\n\nThe more I think about the problem, the more I go around in circles in my head and then wind up confusing myself.  Any help would be greatly appreciated.",
        "created_utc": 1339904469,
        "upvote_ratio": ""
    },
    {
        "title": "Roger Penrose claims evidence for cyclic universe",
        "author": "kuipernova",
        "url": "http://www.reddit.com/r/astrophysics/comments/v0clg/roger_penrose_claims_evidence_for_cyclic_universe/",
        "text": "According to my research, Roger Penrose first proposed this theory, along with evidence, in 2010. Is there a particular reason why the scientific community hasn't adopted support? Are there any articles out there refuting these claims? I'd like to see some skepticism. What are your thoughts?\n\nhttp://www.dailymail.co.uk/sciencetech/article-2157548/Is-secret-previous-universe-hidden-microwaves-Scientist-spots-ghost-Big-Bang.html",
        "created_utc": 1339617130,
        "upvote_ratio": ""
    },
    {
        "title": "looking for some *good* news about tacking astro/physics on as a degree, given that i am a junior in poly sci and feel as worthless as i did when i first enrolled at the university... ",
        "author": "das_kapital96",
        "url": "http://www.reddit.com/r/astrophysics/comments/uz4p3/looking_for_some_good_news_about_tacking/",
        "text": "I am currently a junior majoring in poly sci and I feel like I haven't learned anything. I am 23 and obviously my parents are anxious for me to graduate from college but I have developed other interests since I have been at college. I have never taken the *hard* sciences seriously but I have always had an interest in astronomy. I just never believed I was smart and capable. I always thought, why bother? I would like to begin taking classes to potentially gain a degree in astronomy and physics. I absolutely love astronomy and always have I just never ever felt like it was something I could do professionally. It also did not help that I have not had the best support system pushing me to take action. I must ask, am I wasting my time or will it, even if I do not end up becoming an astrophysicist, pay off, in terms of critical and analytical thinking and the like? Also, is being 23 and signing onto school for another let's say three years pathetic? ",
        "created_utc": 1339555543,
        "upvote_ratio": ""
    },
    {
        "title": "APOD: 2012 June 9 - Venus at the Edge - One of the greatest planetary science photos ever!",
        "author": "NeedsEvidence",
        "url": "http://apod.nasa.gov/apod/ap120609.html",
        "text": "",
        "created_utc": 1339216314,
        "upvote_ratio": ""
    },
    {
        "title": "APOD: 2012 June 9 - Venus at the Edge",
        "author": "[deleted]",
        "url": "http://apod.nasa.gov/apod/ap120609.html",
        "text": "",
        "created_utc": 1339215639,
        "upvote_ratio": ""
    },
    {
        "title": "A shiny citizen science site, a la GalaxyZoo.",
        "author": "Catharsis25",
        "url": "http://cosmoquest.org",
        "text": "",
        "created_utc": 1339103335,
        "upvote_ratio": ""
    },
    {
        "title": "Need help installing programs for astronomical data ",
        "author": "BoobRockets",
        "url": "http://www.reddit.com/r/astrophysics/comments/uq44g/need_help_installing_programs_for_astronomical/",
        "text": "Basically I've spent two days trying to install pgplot on my computer. Macports doesn't seem to be a viable option. Does anyone in this corner of the internet think they can help me? I have a macbook pro with an i7 processor and I'm running snow leopard (10.6). \n\nEDIT: pgplot seems to be installing now. More on this later. \n\nEDIT2: Everything solved. Thank you astromonerd and mendelrat for helping. ",
        "created_utc": 1339092085,
        "upvote_ratio": ""
    },
    {
        "title": "No \"South Star\" explains why the Northern Hemisphere is more advanced?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/ulgow/no_south_star_explains_why_the_northern/",
        "text": "Do you think that the fact that there is no star at the south celestial pole explains (part of) why science was more advanced in the Northern Hemisphere? All of the big astronomers, at least, lived in the Northern Hemisphere.\n\nHas anyone else ever thought of this? The North Star is so significant that I can't imagine it not being there.",
        "created_utc": 1338866326,
        "upvote_ratio": ""
    },
    {
        "title": "Couldn't this detect subtle frequencies of motions in astronomical object images? Eulerian Video Magnification (notice especially example using only two pictures 15 seconds apart)",
        "author": "georedd",
        "url": "http://www.youtube.com/watch?v=ONZcjs1Pjmk&amp;t=2m13s",
        "text": "",
        "created_utc": 1338848106,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to (Simply) Simulate a Protoplanetary Disc",
        "author": "ThePsion5",
        "url": "http://www.reddit.com/r/astrophysics/comments/ukku0/trying_to_simply_simulate_a_protoplanetary_disc/",
        "text": "Hi,\nI'm a (very) amateur astrophysicist, and for the past couple of weeks I've been interested in creating a very rough web-based simulation of planetary formation. I've decided to limit the initial scope of this project as much as possible by starting with a VERY rudimentary simulation of a protoplanetary disc.\n\nI know that I have little hope of understanding the math and writing/understanding algorithms to simulate things like fluid dynamics and gravitational instability, so instead I want to try and simulate a protoplanetary disc as a horizontal cross-section with density, temperature, and shear force attributes. I can then use these attributes to calculate the a rough metric for stability per any radial section of the disc and from there work on simulating planet formation.\n\nI THINK that this is possible - at to the extent that it won't give wildly unrealistic or physically impossible results. But I'm not exactly sure where to start. I was hoping that someone could point me in the right direction (or a direction in general). \n\nAn example of where I might start is by writing an algorithm that will determine the average temperature of the disc at radius r given some basic info about its mass and density.\n\nThanks in advance!\n\nEDIT: As far as programming experience is concerned, I've got about 8 years experience with PHP and Javascript, with about 3 years experience in each C# and Java. ",
        "created_utc": 1338834231,
        "upvote_ratio": ""
    },
    {
        "title": "ALMA peers into the dark soul of Centaurus A",
        "author": "toomanyparsecs",
        "url": "http://www.toomanyparsecs.info/2012/06/alma-peers-into-dark-soul-of-centaurus.html",
        "text": "",
        "created_utc": 1338823240,
        "upvote_ratio": ""
    },
    {
        "title": "What does it take?",
        "author": "Doctrineate",
        "url": "http://www.reddit.com/r/astrophysics/comments/udd6d/what_does_it_take/",
        "text": "What does it take to be a physicist? More specifically, what does it take to be an astrophysicist?\nI didn't do that well in high school (apathy for everything except video games), and now attend UNL. When I get back to my sophomore year, I want to change my major to physics. In high school, I did poorly in physics, but I found it to be the only thing that was interesting (that and biology and english). It also wasn't until this last semester that I realized that I actually enjoy math and am decent at it, with scoring an 88% on my college algebra final (the best that I have ever done on a final for math) after taking the time to study.\nI have a curious nature, enjoy learning, and want to help others, whether it be through scientific findings, or something else. Also, I have finally realized after reading 'How to think big' by David Schwartz that it's all about attitude and passion that matters, not how smart someone is. I have a great attitude toward everything and I think this is my passion, learning about the physical conundrums of the universe.\nDo I have what it takes? What does it take? Am I too late in a quest for becoming a physicist?\nThanks reddit.",
        "created_utc": 1338438356,
        "upvote_ratio": ""
    },
    {
        "title": "Planning on going to grad school in Fall 2013. Torn between Aerospace Engineering and Astrophysics. Any advice?",
        "author": "bkay17",
        "url": "http://www.reddit.com/r/astrophysics/comments/ubgk5/planning_on_going_to_grad_school_in_fall_2013/",
        "text": "So I got my undergrad at Georgia Tech in Chemical Engineering in May 2011. 3.22 GPA (kinda let that one slip, wasn't really planning on grad school at the time). Now I work at an oilfield lab in west Texas, and have decided that I definitely want to go back to school and get an advanced degree in something that I'm more interested in. \n \nAfter contacting multiple universities and looking over old/sample Physics GREs, I'm positive that I'd be able to get into at least a *decent* school for either Astrophysics or AE with my undergrad GPA and some decent recommendations.\n\nI understand that if I go the Astro route, a PhD would pretty much be a must, and I have no problem with that. \n\nThe way I've simplified it is that with Astrophysics, I could be studying the universe and celestial phenomena, whereas in Aerospace, I could be designing/researching spacecraft. Both seem like incredible opportunities to me. If you guys have any clarification of what things may actually be like, I'd welcome any input.\n\nI guess I'm a little torn about pay and job availability. How easily would I be able to get a job in Astro? AE? Also, I'm currently under the impression that I'd have a better chance of making more money with AE, any truth in that?\n\nSo basically, any differences between the two that could help me make a decision would be great. I also welcome any anecdotes you might have on the matter.\n\nThanks!",
        "created_utc": 1338345282,
        "upvote_ratio": ""
    },
    {
        "title": "Job opportunities?",
        "author": "andromeda31",
        "url": "http://www.reddit.com/r/astrophysics/comments/uaxkk/job_opportunities/",
        "text": "I'm currently a high school senior and I plan on majoring in astrophysics in the fall. I'm about to graduate and I keep getting asked the question \"What jobs are in astrophysics?\" What are some of your careers r/astrophysics?  ",
        "created_utc": 1338325341,
        "upvote_ratio": ""
    },
    {
        "title": "I want to be alive when this awesomeness happens. This and the explosion of Betelgeuse ",
        "author": "Digirak",
        "url": "http://blogs.discovermagazine.com/badastronomy/2007/06/20/eta-car-tick-tock-tick-tock/",
        "text": "",
        "created_utc": 1338257583,
        "upvote_ratio": ""
    },
    {
        "title": "A Brief Summary of Modern Astrophysics",
        "author": "orrery",
        "url": "http://www.reddit.com/r/astrophysics/comments/u9if6/a_brief_summary_of_modern_astrophysics/",
        "text": "Our modern understanding has advanced significantly since the primitive days and theories of Carl Sagan's times. Modern Cosmology has overturned and invalidated 20th century musings like Black Holes, Neutron Stars, Pulsars, Quasars, and Big Bang Creationism of Catholicism. Much of 21st Century Cosmology is disdained by the Public due to the fact that it challenges their sacred religious beliefs founded in the Book of Genesis and repudiates the idea of a Creation Event and challenging them to accept a Universe infinite in time &amp; space.\n\nThe following videos will give you the most accurate and truthful understanding of 21st Century Cosmology.\n\nUniverse: Cosmology Quest - [part 1](http://www.youtube.com/watch?v=IFFl9S39CTM), [part 2](http://www.youtube.com/watch?v=Sb_EWnXCu2w).\n\nOn the cutting edge of Cosmology are the advocates of The Electric Universe, you can watch their groundbreaking documentary [Thunderbolts of the Gods](http://www.youtube.com/watch?v=P4zixnWeE8A). Professor Donald Scott, author of The Electric Sky, NASA guest lecturer, Ph. D of Electrical Engineering, highly praised by the most prestigious names in Government research like Anthony Peratt provides modern explanations for everything to the Sun, and debunking failed concepts like Pulsars and Black Holes using exciting science of Plasma Physics and Electrical Engineering. \n\nKey Scientists of 21st Cosmology aren't people like Stephen Hawking.\n\nThey are people like:\n\n* Dr. Hannes Alfven\n\n* Dr. Anthony Peratt\n\n* Dr. Eric Lerner\n\n* Natural Philosopher Wal Thornhill\n\n* Dr. Donald Scott\n\n* Dr. Ari Brynjolffson\n\n* Dr. Halton Arp\n\nThe momentum of previous decades still weighs heavy in cosmological discussions. People have yet to upgrade their Cosmology Firmware and still believe in outdated concepts like the Big Bang, Black Holes, Pulsars, Neutron Stars, Dark Matter, &amp; Dark Energy.\n\nBig Bang Creationism has long since been debunked through new modern interpretation of the Red Shift phenomenon by the world's leading Radiological expert Ari Brynjolffson. You can explore his website [Plasma Redshift](http://plasmaredshift.org)\n\nPersonally trained by Neils Bohr himself, Ari is one of the last remaining of a great generation of Scientists. He has been head of the Danish, US Army, and United Nations Radiological Research divisions. His scientific research, using the most advanced radiological and scientific instruments available in the world, prove beyond any shadow of a doubt that the Doppler Shift interpretation of Red Shift originally proposed by Catholic Preacher Georges Lemaitre is fundamentally flawed just as believed by Hubble &amp; Einstein. \n\nBrynjolffson has shown beyond any reasonable doubt that Red Shift is a consequence of the Electron Plasma Density, and the conclusion of this Emissary of the Prestigious U.N., U.S. Army, Danish, and other Institutes?\n\n&gt; When photons penetrate a cold and dense plasma, they lose energy through ionization and excitation, Compton scattering on the individual electrons, and Raman scattering on the plasma frequency.  But in sparse hot plasma, such as in the solar corona, the photons lose energy also in plasma redshift.  The energy loss per electron in the plasma redshift is about equal to the product of the photon's energy and one half of the Compton cross-section per electron.  In quiescent solar corona, this heating starts in the transition zone to the corona and is a major fraction of the coronal heating.  Plasma redshift contributes also to the heating of the interstellar plasma, the galactic corona, and the intergalactic plasma.  Plasma redshift explains the solar redshifts, the intrinsic redshifts of stars, quasars, the galactic corona, the cosmological redshifts, the cosmic microwave background, and the X-ray background.  The plasma redshift explains the observed magnitude-redshift relation for supernovae SNe Ia without the big bang, dark matter, or dark energy.  It explains also the observed surface brightness of galaxies.  There is no cosmic time dilation.  The universe is not expanding. The plasma redshift, when compared with experiments, shows that the photons' classical gravitational redshifts are reversed as the photons move from the Sun to the Earth, provided they have adequate time to change their frequency.  This is a quantum mechanical effect.  As seen from the Earth, a repulsion force acts on the photons.  \n\nBig Bang Creationism and Cosmology, despite still being popular in Christian countries as the dominant explanation has been debunked for over 50 years. **Plasma Cosmology** is the only real game in town.\n\nOnce the Doppler Theory of Redshift had been debunked, all the work of \"Expanding Universe\" Theoreticians that built their work on the idea of Doppler Redshift became instantly invalidated. Once Redshift moved from a Doppler interpretation, to one of the Photon's Journey through Interstellar Space, the work of popular names like Stephen Hawking suddenly became toilet paper, and a new generation waits in the wings to take the baton and advance humanities understanding of the Cosmos. As we come to better understand the Photon's Pipe Journey through Space, we will be able to see further into Space than ever before through improved adaptive optics. The Universe becomes infinite in age &amp; size and we are just opening our eyes to view deeper through the fog.\n\n/r/plasmacosmology\n\nI recommend the following books:\n\n* **The Big Bang Never Happened** by Dr. Eric J. Lerner \n\n* **The Electric Sky** by Dr. Donald E. Scott\n\n* **Cosmic Plasma** by Dr. Hannes Alfven\n\n* **Physics of the Plasma Universe** by Dr. Anthony Peratt\n\n* **The Electric Universe** by Natural Philosopher Wal Thornhill\n\n* **Plasma Redshift** by Dr. Ari Brynjolffson\n\n* **Seeing Red** by Dr. Halton C. Arp\n\nIn closing, I find it is always important to note, that much of the public believes that the Michelson-Morley experiment upon which early 20th Century Science was developed remains valid. Nothing could be further from the truth. It was once believed that Space was a vacuum. Since our first probes into Space, we have found this is not true. Far from disproving the existence of the Aether, it has come that we have instead disproved the existence of a vacuum.\n\nSpace is a gigantic Sea of Plasma consisting of electrons, quarks, and other exotic charged particles. I can not stress this enough, there is no vacuum in Space. Despite the illusion of a vacuum, you are living in a gigantic sea of electrified plasma, a complex dusty plasma makes up our Arm of the Milky Way Galaxy. This plasma is in a Dark Glow State, not enough energy goes into it to illuminate it, but we can see much of it through Infrared Telescopes. The \"seeing\" may seem great, but this electrified plasma currently limits our view to around 14 GLY and its density varies depending on the Electric Field of the object being encompassed by it. With the improved red-shifted viewing of the James Webb Space Telescope, its gold primary mirror will serve as an adaptive optic to this effect, allowing us to look further than ever before into the infinite sea of space.\n\nGreat Websites:\n\n* [The Big Bang Never Happened](http://bigbangneverhappened.org)\n\n* [Thunderbolts](http://www.thunderbolts.info)\n\n* [Plasma Redshift](http://plasmaredshift.org)\n\n* [Surface of the Sun](http://www.surfaceofthesun.com/)",
        "created_utc": 1338251281,
        "upvote_ratio": ""
    },
    {
        "title": "Current High School Junior aspiring to become Astrophysicist. Any tips?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/u5iir/current_high_school_junior_aspiring_to_become/",
        "text": "I'm pretty new here, and to Reddit in general, been browsing a couple of months. Anyway, I was wondering if any of you fellas here had some tips on what I could start doing now in order to ready myself for University. I took Physics and AP Chemistry this year, and next year I will be taking an Astronomy class by Dual Enrolling at a local college throughout the year. I've been told that it is much better to major in Physics, so that way you have a blanket to fall back on if Astrophysics isn't your \"thing\". I was wondering myself if a double major in Physics and Astronomy will do me any good? Thanks for the contributions, if any! :D",
        "created_utc": 1338002356,
        "upvote_ratio": ""
    },
    {
        "title": "What is an astrophysicist's day to day work really like?",
        "author": "f1ndingwalden",
        "url": "http://www.reddit.com/r/astrophysics/comments/u4izg/what_is_an_astrophysicists_day_to_day_work_really/",
        "text": "Hey /r/astrophysics, I am a senior in highschool and am very interested in being an astrophysicist, the problem is I believe that I might have a very romanticized view of the job. I saw a video be Neil DeGrass Tyson describing it as a pilgrimage to the wilderness and looking up at the stars through a telescope, but I was wondering if now it os all done from computer screens. What I'm really asking is if you can describe your job on a daily basis and all the pros and cons that come with it.\nThank you! ",
        "created_utc": 1337957569,
        "upvote_ratio": ""
    },
    {
        "title": "Can the moon be considered a planet?",
        "author": "iddothat",
        "url": "http://www.reddit.com/r/astrophysics/comments/u456g/can_the_moon_be_considered_a_planet/",
        "text": "From [Wikipedia](http://en.wikipedia.org/wiki/Definition_of_planet)\n\n&gt;A \"planet\"1 is a celestial body that: (a) is in orbit around the Sun, (b) has sufficient mass for its self-gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape, and (c) has cleared the neighbourhood around its orbit.\n\nIf you trace the Moon's path in a Sun-centric frame of reference, that path is completely convex. Quoting [this Wikipedia article](http://en.wikipedia.org/wiki/Orbit_of_the_Moon):\n\n&gt;Unlike most other moons in the Solar System, the trajectory of the Moon is very similar to that of its planet. The Sun's gravitational pull on the Moon is over twice as great as the Earth's pull on the Moon; consequently, the Moon's trajectory is always convex (as seen when looking inward at the entire Moon/Earth/Sun system from a great distance off), and is nowhere concave (from the perspective just mentioned) or looped.\n\nIf the Earth suddenly vanished, the Moon would continue in its orbit around the Sun (the same is true of any satellite), and it's big enough that it would be considered a planet (if there were anyone left to consider it at all).\n\nOn the other hand, in an Earth-centric frame of reference, the Moon is in an elliptical orbit around the Earth (with some significant, but not overwhelming, perturbations caused by the Sun's gravity).\n\nFrom the same article:\n\n&gt;Some consider the Earth–Moon system to be a double planet because of the relatively large size of the Moon; the Earth–Moon mass ratio, about 81:1, is much smaller than that of most other natural satellites in the Solar System. An informal criterion for a double planet system is that its barycentre must be exterior to both bodies. By that criterion, the Earth and Moon are an ordinary planet–moon system, because their mutual distance is about 60 Earth radii but their mass ratio is 81:1 so their centre of mass always lies well within the Earth.\n\nBut that seems like a very arbitrary criterion. If the Moon were either about a third farther away or about a third more massive, the barycenter would be above the Earth's surface. Intuitively, it doesn't seem (to me) that that should be enough to make it a planet. But if the Earth and the Moon were of roughly equal mass, orbiting each other at about the same distance, then we'd probably call them a double planet system -- and the official definition of a planet would probably have been written a bit differently. (Then again, any such criterion probably has to be arbitrary.)\n\n[The article on the definition of a planet](http://en.wikipedia.org/wiki/Definition_of_planet#Double_planets_and_moons) also discusses the controversy over whether the Earth-Moon system might be considered a double planet. It gives may reasons for it, but not against.\n\n**So, my question is... Why not? It fulfills all the criterion...**\n\nIf we cannot say it is a planet, then a specific rule should be made for the cases of terrestrial planets with large 'moon's.",
        "created_utc": 1337929077,
        "upvote_ratio": ""
    },
    {
        "title": "Striving to be a professional astrophysicist, what are some resources to get me started?",
        "author": "FuckingYawn",
        "url": "http://www.reddit.com/r/astrophysics/comments/u3ra5/striving_to_be_a_professional_astrophysicist_what/",
        "text": "I'm currently a freshman undergraduate student majoring in Physics, pursuing a career in Astrophysics. I am almost done with my first year of college at a state university, and I'm really itching to get started on studying astrophysics on my own until I get to graduate school. \n\nThe problem is, I have really no idea where to start. Every book I can find on astrophysics seems to either assume that I already know the basics or just point out how awesome and important the study is. What are some books or resources I can use to get me started with like, the facts, figures and definitions that I need to know to pursue a career?",
        "created_utc": 1337909740,
        "upvote_ratio": ""
    },
    {
        "title": "What will happen to Jupiter as the sun expands?",
        "author": "Iraneth",
        "url": "http://www.reddit.com/r/astrophysics/comments/u1kc8/what_will_happen_to_jupiter_as_the_sun_expands/",
        "text": "My high school astronomy teacher told us that Jupiter almost became a brown dwarf. As Sol becomes a red giant, will it get large enough for some of its hydrogen to slough off into Jupiter? Could Jupiter achieve brown dwarf status as a result, or even ignite? I'm not knowledgeable enough to figure it out...hoping someone here is.",
        "created_utc": 1337805207,
        "upvote_ratio": ""
    },
    {
        "title": "Herschel Sees Intergalactic Bridge Aglow With Stars",
        "author": "toomanyparsecs",
        "url": "http://www.jpl.nasa.gov/news/news.cfm?release=2012-139",
        "text": "",
        "created_utc": 1337708304,
        "upvote_ratio": ""
    },
    {
        "title": "I've been running n-body simulations of planetary systems. But it's only Newton-based. Where can I learn to/find equations for a post-newtonian correction for GR effects?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/twcn4/ive_been_running_nbody_simulations_of_planetary/",
        "text": "",
        "created_utc": 1337542881,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone easily explain the Dark Matter Problem?",
        "author": "DocStrong",
        "url": "http://www.reddit.com/r/astrophysics/comments/tqujp/can_anyone_easily_explain_the_dark_matter_problem/",
        "text": "I am having a little trouble grasping what the real problem is.",
        "created_utc": 1337214641,
        "upvote_ratio": ""
    },
    {
        "title": "Energy stuffed black holes",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/tncp2/energy_stuffed_black_holes/",
        "text": "Black holes are very interesting not only for there large mass but also there importance to science and are very universe. This theory revolves around the theory that when an atom gets condenses it will explode, my theory is that black hole have enough energy to condense an atom, yet there is to much gravity to let it escape or explode, in turn making black holes stuffed with energy, this energy may condense into matter and create an ongoing pattern of nuclear fission, keeping the energy inside of it, or it may just stay at the black hole trying to escape, one flaw I've found with this is that time slows down in a black hole meaning that there would be no time for the protons of the atom to hit the nuclease, if you find any flaws or have any other black hole theories please leave a comment. :)",
        "created_utc": 1337041888,
        "upvote_ratio": ""
    },
    {
        "title": "Cosmic Evolution - From Big Bang to Humankind",
        "author": "Kida89",
        "url": "https://www.cfa.harvard.edu/~ejchaisson/cosmic_evolution/docs/splash.html",
        "text": "",
        "created_utc": 1336583465,
        "upvote_ratio": ""
    },
    {
        "title": "Help with research for a career in astrophysics?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/t3xjd/help_with_research_for_a_career_in_astrophysics/",
        "text": "I'm a freshman in highschool, and our end-of-the-year project is to research and do a presentation on what career we wish to pursue after highschool. I chose astrophysics, and my friend/partner is doing theoretical physics.\n\nAs part of the project, we have to answer two specific questions:\n\n1. What are the environmental impacts (positive or negative) of my chosen career?\n\n2. What are the possible health effects, both long-term and short-term, on you as a result of your career choice?\n\nI've found a few sources that answer the first question, but none for the second. I need three sources for the first question, and five for the second. They can all be internet-based, and they all have to be separate websites. (Also, before anyone asks: yes, I did use google to search for sources, and didn't just come here expecting someone to do my work for me.)\n\nCan anyone link me to sources that answer either of these questions, or at the very least just point me in the right direction? Thank you in advance!",
        "created_utc": 1335993190,
        "upvote_ratio": ""
    },
    {
        "title": "Watch out we got a fascinatingly disturbing thought over here",
        "author": "curtis657483",
        "url": "http://www.viddler.com/v/edb8e7c7/",
        "text": "",
        "created_utc": 1335747818,
        "upvote_ratio": ""
    },
    {
        "title": "Learning iraf",
        "author": "Idiosyncra3y",
        "url": "http://www.reddit.com/r/astrophysics/comments/sxfh5/learning_iraf/",
        "text": "I will be doing some astronomy research, and would be interested in any good sites to help me learn iraf. I can do the basic data reduction, but think I will probably need more. Thanks.",
        "created_utc": 1335655428,
        "upvote_ratio": ""
    },
    {
        "title": "What companies (private sector and government) employ astrophysicists?",
        "author": "PirateLogic",
        "url": "http://www.reddit.com/r/astrophysics/comments/sx6cn/what_companies_private_sector_and_government/",
        "text": "I've been reading a lot about astronomy lately and physics has always struck a cord with me. While exploring my options as far as school are concerned I started thinking about studying astrophysics at Florida State University and I'm curious as to what companies (both in the private sector and government) employ astrophysicists. Do you *have* to have a PhD in astrophysics to work in the field? Where can I find some astrophysics dissertations?\n\nAlso, any thoughts on FSU's astrophysics program is welcomed.",
        "created_utc": 1335643424,
        "upvote_ratio": ""
    },
    {
        "title": "Advice for someone about to major in Astronomy? ",
        "author": "Antibody624",
        "url": "http://www.reddit.com/r/astrophysics/comments/sr6n2/advice_for_someone_about_to_major_in_astronomy/",
        "text": "This Fall I'll be attending the City College of San Francisco. I want to major in Astronomy, but what I've been reading leads me to believe I should major in Physics with an Astronomy minor, or double major in them, as I want to go to graduate school and get a PhD and actually do it for a living. What would you guys recommend, and why? Does anyone have experience with that college that could give me some advice? I don't know much about Physics, but I absolutely love Astronomy and I'm confident it's what I want to do.\n\nThat said, I've been out of high school for 3 years, I haven't had a math class in 4 years, and I'll be leaving the art school I've been studying 3d Modeling and Animation at for 2 years. Obviously, I'm at quite a bit of a disadvantage. I need to start relearning Math at an embarrassingly low level, Elementary Algebra, and I already know I need to not only learn, but understand and be fluent in advanced Calculus to be successful in this profession. But I'm only at such a low level because I forgot so much of it, not because I was ever bad at it. I know the challenge ahead of me is ridiculously huge, but I've never been more motivated. I explained all that because I also wanted to ask, at what point should I start taking Physics-heavy classes? Do I need to wait until I've started Calculus? Or will I be okay as long as I have a solid foundation in Algebra? The first semester I'll just be taking English, Elementary Algebra and Geometry. I'd love to at least be able to start the basics with that foundation during the next semester as I progress to Intermediate Algebra.\n\nComing from a major that I eventually learned wasn't for me, I'm really scared to major in something that I know is right for me (Astronomy), but isn't right for the academic world like Physics apparently is. So if I could get some advice, I'd really appreciate it.",
        "created_utc": 1335324897,
        "upvote_ratio": ""
    },
    {
        "title": "Neil D Tyson Subreddit [X-Post from r/Space]",
        "author": "Jenksz",
        "url": "http://www.reddit.com/r/astrophysics/comments/sqz86/neil_d_tyson_subreddit_xpost_from_rspace/",
        "text": "Hey everyone, I hope this is an acceptable place to post this. I just created a new sub-reddit (http://www.reddit.com/r/NeilDTyson) for fans of Neil and his work since I haven't been able to stumble across one (surprising. personally).\n\nI dont know much about customizability (ex. banner images or new alien images- if anyone wants to help with that it would be appreciated, if not, I will learn about such things eventually)\nIt was literally just created, and I hope the Space community enjoys it. Thanks!\n\n http://i.qkme.me/36elyy.jpg",
        "created_utc": 1335317052,
        "upvote_ratio": ""
    },
    {
        "title": "Open Sourced Astronomy",
        "author": "runaloop",
        "url": "http://www.reddit.com/r/astrophysics/comments/sq07t/open_sourced_astronomy/",
        "text": "Hey everyone,\n\nI'm a programmer who also has a degree in Astrophysics. It's been a couple of years since I've completed my undergraduate research and would like to get into more research. I've been looking for an open sourced astro project to start working on but haven't been able to find very much. Does anyone happen to know if any research is being done by the public? I had thought that Sloan was open sourced, but I think it's mostly done by universities.",
        "created_utc": 1335278703,
        "upvote_ratio": ""
    },
    {
        "title": "Studying astrophysics... Some questions.",
        "author": "Derekdezz",
        "url": "http://www.reddit.com/r/astrophysics/comments/spbsw/studying_astrophysics_some_questions/",
        "text": "I've recently become fascinated by astrophysics. I'm 21 and have considered going to school to study it. I was never really great in school because I just didn't care at the time. But now I have a whole new mindset about wanting to learn and expand my mind and grew a real interest in astrophysics. Its like a hobby that i'm really passionate about. I just want to know if it's something you can really get into, and how difficult it could be without much of a science background in school.",
        "created_utc": 1335235922,
        "upvote_ratio": ""
    },
    {
        "title": "Seeking Advice From Professionals",
        "author": "starhawks",
        "url": "http://www.reddit.com/r/astrophysics/comments/spbmz/seeking_advice_from_professionals/",
        "text": "Hello everyone, I am very much interested in astrophysics. The field intriques me intellectually, and I have been a backyard astronomer for quite some time, so I figure a career in the field would suit me. I am fascinated by modern observational techniques, and by the birth, life, and death of stars. I am currently a sophomore in college going for a major in biology, and I have only completed calculus 1, so catching up may be a bit difficult. I have done exceptionally well in all my science classes, so I know I am willing to put in the work. I am, however, reluctant to give up my current plans of going to medical school. I am wondering, from a professional's point of view, what would you recommend? Is the career rewarding or even worth the intensity of undergraduate/graduate school? Thanks very much.",
        "created_utc": 1335235739,
        "upvote_ratio": ""
    },
    {
        "title": "[1204.2797] A Tentative Gamma-Ray Line from Dark Matter Annihilation at the Fermi\n  Large Area Telescope",
        "author": "ttruth1",
        "url": "http://arxiv.org/abs/1204.2797",
        "text": "",
        "created_utc": 1335217636,
        "upvote_ratio": ""
    },
    {
        "title": "Got a couple hours for the Universe?",
        "author": "PivotalPlatypus",
        "url": "http://www.c-spanvideo.org/program/SpaceCh",
        "text": "",
        "created_utc": 1335040077,
        "upvote_ratio": ""
    },
    {
        "title": "Question about Fermions and spin",
        "author": "Turts",
        "url": "http://www.reddit.com/r/astrophysics/comments/sjodf/question_about_fermions_and_spin/",
        "text": "So I learned about bosons and fermions in physics recently, and know that bosons have integer spin e.g +1/-1, whereas fermions have fractional spin e.g 0.5. This means bosons can superimpose whereas fermions cannot.\n\nThis is where it gets complicated, my physics tutor also mentioned fermions can superimpose in certain cases of black holes. I will ask him to explain further what he meant and how they do this, but I'm also wondering if anyone on here can clear this up for me ? As I searched for it but I couldn't find anything.\n\n",
        "created_utc": 1334931825,
        "upvote_ratio": ""
    },
    {
        "title": "African Lake Has a Twin on Titan",
        "author": "kkaliayev",
        "url": "http://www.universetoday.com/94706/african-lake-has-a-twin-on-titan/",
        "text": "",
        "created_utc": 1334892142,
        "upvote_ratio": ""
    },
    {
        "title": "I need some recommendations on basic astrophysics books",
        "author": "WUTBM",
        "url": "http://www.reddit.com/r/astrophysics/comments/si9fc/i_need_some_recommendations_on_basic_astrophysics/",
        "text": "I'm starting to think about university courses, and I'm looking into Astronomy, Space Science and Astrophysics. However, we haven't done it in school yet and won't until next year, so I'd like to start reading up a bit more on the subject. \n\nLinks or names of any books/authors/videos/papers/general resources would be much, much appreciated. Also, your guys opinions in general on the subject, why you like it (or don't), what got you interested and if you would recommend it.\n\n\nThanks!",
        "created_utc": 1334862780,
        "upvote_ratio": ""
    },
    {
        "title": "Getting a start with GR",
        "author": "chaos__cosmos",
        "url": "http://www.reddit.com/r/astrophysics/comments/shnao/getting_a_start_with_gr/",
        "text": "Astrophysics undergrad back again, this time with a question about General Relativity. I have minimal problems with the data reduction associated with the systems of gravitationally lensed quasars that we monitor; however, the concept of gravitational lensing is still just beyond my reach mathematically. I understand the concepts reasonably well, but what would you all recommend for getting a better understanding of GR? perhaps a book or something else? (I'm not afraid of the math, so dont skimp)",
        "created_utc": 1334833797,
        "upvote_ratio": ""
    },
    {
        "title": "  Cosmic superaccelerators surprise scientists at South Pole telescope",
        "author": "[deleted]",
        "url": "http://www.interactions.org/cms/?pid=1031653#.T48RL9fT_w4.reddit",
        "text": "",
        "created_utc": 1334776158,
        "upvote_ratio": ""
    },
    {
        "title": "The Molecule That Made the Universe",
        "author": "NeedsEvidence",
        "url": "http://www.astrobio.net/pressrelease/4695/the-molecule-that-made-the-universe",
        "text": "",
        "created_utc": 1334745360,
        "upvote_ratio": ""
    },
    {
        "title": "Calling all Quasar aficionados",
        "author": "chaos__cosmos",
        "url": "http://www.reddit.com/r/astrophysics/comments/sfbic/calling_all_quasar_aficionados/",
        "text": " Astrophysics undergrad here, currently engaged in some research involving lensed quasar systems. There is a nearby m~12 star which spills over into the qso system. Any ideas as to how to best reduce that noise for better data reduction?",
        "created_utc": 1334715815,
        "upvote_ratio": ""
    },
    {
        "title": "help - Tv series / documentary's ETC (Don't know if this is the right sub'rediit really)",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/seizy/help_tv_series_documentarys_etc_dont_know_if_this/",
        "text": "Hi,\n\nIm looking for good TV series / documentary's ETC on space, science of space and so on. I'm getting a lot more interested in all this lately, But last time i was interested with years ago in earlier teenage area, So i have no idea what there is out there (and being from UK and most series being american its harder).\n\nI've watched a load of Q/A's on you-tube with Neil Tyson and I've seen the 4 part mini series \"The fabric of the cosmos\" With Brian Greene, also a few other documentary's on you-tube. But as i said don't know where to look now.\n\nP.S: If this is the wrong subreddit just say, and i will move this.",
        "created_utc": 1334685387,
        "upvote_ratio": ""
    },
    {
        "title": "Looking into Heliophysics",
        "author": "Dr_Zaphod",
        "url": "http://www.reddit.com/r/astrophysics/comments/sdlwi/looking_into_heliophysics/",
        "text": "So I've been looking into Heliophysics the problem is I'm not sure where to begin. I would like to start with a book or text book so I know what I'm getting myself into.\nDoes anyone know of a good book/textbook that gets into great detail on the subject of Heliophysics? ",
        "created_utc": 1334632465,
        "upvote_ratio": ""
    },
    {
        "title": "I am still i high school, but i am looking to follow a career in astrophysics, anybody got Advice?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/scfhs/i_am_still_i_high_school_but_i_am_looking_to/",
        "text": "Thanks everybody for the advice. All of you helped out a ton. Thanks!",
        "created_utc": 1334587532,
        "upvote_ratio": ""
    },
    {
        "title": "Hey! subscribed to reddit 5 minutes ago to ask r/astrophysics about Edwin Hubble!",
        "author": "katherinecian",
        "url": "http://www.reddit.com/r/astrophysics/comments/s9s9o/hey_subscribed_to_reddit_5_minutes_ago_to_ask/",
        "text": "using Hubble's constant (based on latest data 70.8km/s/Mpc) i derived the age of the universe ignoring gravity. If i were to take gravity into account would it make the age of the universe longer or shorter  than hubble's time??\n",
        "created_utc": 1334429819,
        "upvote_ratio": ""
    },
    {
        "title": "if I'm struggling with a basic college physics class, is astronomy and astrophysics out of my league?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/s952v/if_im_struggling_with_a_basic_college_physics/",
        "text": "Right now I'm basically in an introductory physics class as one of the basic courses for any major. Right now I'm an architecture major, but I really don't know if it's for me. It seems that space has been the only thing I've ever gone out of my way to learn about, and one of the few things that I really find meaning in. \n\nAnd I know people say that you can do whatever you put your mind to. But let's face it, some people aren't cut out for certain things. And the fact that I seem to be struggling with this Physics class kind of makes it seem like I may not be. Although, I think part of it may be due to a lack of a bit of motivation. \n\nI've been told that astrophysics and astronomy is practically impossible too, which it kind of seemed like that was said because they didn't think I was quite cut out for it. ",
        "created_utc": 1334380205,
        "upvote_ratio": ""
    },
    {
        "title": "IRAF in Debian/Ubuntu (crosspost from /r/Astronomy)",
        "author": "john_o",
        "url": "http://www.reddit.com/r/astrophysics/comments/s3tv6/iraf_in_debianubuntu_crosspost_from_rastronomy/",
        "text": "NOAO's installation instructions for IRAF are *incredibly* outdated.  They even have instructions for when installing from a tape.\n\nLuckily, I found an ISO with a super easy script that will install everything for you in pretty much any Debian based Linux distribution.  In addition to being easy to use, this script will also automatically install DS9 for you, if you don't already have it.\n\n[Here's a link to the ISO which contains an installer and a very straightforward readme file. **This is a direct link to the download.**](http://www.astro.uson.mx/favilac/downloads/ubuntu-iraf/iso/IRAF_Ubuntu.iso)\n\nI just ran this on Linux Mint 11 x64 and it installed with no errors and works flawlessly.\n",
        "created_utc": 1334118213,
        "upvote_ratio": ""
    },
    {
        "title": "Milky Way mysteries: Antimatter factory",
        "author": "[deleted]",
        "url": "http://www.newscientist.com/article/mg21328586.200-milky-way-mysteries-antimatter-factory.html?full=true",
        "text": "",
        "created_utc": 1334085933,
        "upvote_ratio": ""
    },
    {
        "title": "will we identify our universe as a subverse bubble, from potential collision bruises found in the microwave background?",
        "author": "JEDDIJ",
        "url": "http://phys.org/news/2011-10-abuse-universes-opinion.html",
        "text": "",
        "created_utc": 1333759334,
        "upvote_ratio": ""
    },
    {
        "title": "The Big Bang for Dummies. Seriously. [~70 seconds]",
        "author": "[deleted]",
        "url": "http://www.youtube.com/watch?v=HGTJWQhRm_c&amp;feature=relmfu",
        "text": "",
        "created_utc": 1333747233,
        "upvote_ratio": ""
    },
    {
        "title": "Good Astrophysics books?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/rwihw/good_astrophysics_books/",
        "text": "I have recently acquired an abundance of spare time. I have never really read any decent books in this field. Any suggestions? (I'm a novice astrophysics enthusiast)",
        "created_utc": 1333732324,
        "upvote_ratio": ""
    },
    {
        "title": "Empty Space?",
        "author": "TheWalkingWounded48",
        "url": "http://www.reddit.com/r/astrophysics/comments/rwcvt/empty_space/",
        "text": "I apologize if this is a ridiculous and/or stupid question, but it was something that popped into my head while I was reading a book on Quantum Physics and I figured you guys might have some interesting input. The book was describing how light does not seem to need a medium for the waves to travel through, considering the fact that we can see things through space (ex. the moon, other planets, stars, etc). Then the thought popped into my head, \"unless it's NOT empty space?\". I know this idea has already been thought of obviously, but I was wondering your guys' thoughts on this. This is a concept that has recently intrigued me and I would like to know other people's opinions that are educated on this subject.",
        "created_utc": 1333725646,
        "upvote_ratio": ""
    },
    {
        "title": "How to make a tidally locked planet revolve faster?",
        "author": "meltedPancreas",
        "url": "http://www.reddit.com/r/astrophysics/comments/rtclk/how_to_make_a_tidally_locked_planet_revolve_faster/",
        "text": "This is just a mind exercise, and not something I plan on doing Friday night, so answer with that in mind please.  The premise came to me while reading some odd sci-fi book.  Could a planet-like body be made to speed up (or slow down, I suppose) such that the day/night cycle was equal to Earth's?  For instance, assuming we had a \"portal\" device to instantly transport the planet to a new location and trajectory, given that all the properties go with the move, i.e. current mass, angular rotation, and velocity.  Could we \"whip\" it around another larger planet/star without shattering/fracturing it? Even if we needed to do it multiple times.  Use Venus as an example, if necessary.  I want to move it to a new orbit and give it a 24 hour period.",
        "created_utc": 1333567181,
        "upvote_ratio": ""
    },
    {
        "title": "How Black Holes Grow",
        "author": "raja_2000",
        "url": "http://unews.utah.edu/news_releases/how-black-holes-grow/",
        "text": "",
        "created_utc": 1333359980,
        "upvote_ratio": ""
    },
    {
        "title": "Neat perspective on the March 7 solar storm",
        "author": "christhechris",
        "url": "http://www.youtube.com/watch?v=S-saaAyaW0c",
        "text": "",
        "created_utc": 1333323383,
        "upvote_ratio": ""
    },
    {
        "title": "Edges of the Universe",
        "author": "ilbuconero",
        "url": "http://www.reddit.com/r/astrophysics/comments/rgthb/edges_of_the_universe/",
        "text": "I've been pondering what happens to the furthest galaxies as they travel farther and farther away.  Since the expansion of the universe is accelerating, and the furthest galaxies we can see are already traveling faster than the speed of light, how does this affect them?  Traveling faster than the speed of light causes time to go backwards, so are these galaxies actually affected?  Also, if it is normally affected by time reversing, could the galaxy travel so far that it would pass up the moment of its creation?",
        "created_utc": 1332898408,
        "upvote_ratio": ""
    },
    {
        "title": "What does r/astrophysics think of this masters program?",
        "author": "[deleted]",
        "url": "http://spacemaster.eu/",
        "text": "",
        "created_utc": 1332887641,
        "upvote_ratio": ""
    },
    {
        "title": "Giant black holes called cosmic 'gluttons' - UPI.com",
        "author": "older_than_your_dad",
        "url": "http://www.upi.com/Science_News/2012/03/23/Giant-black-holes-called-cosmic-gluttons/UPI-30761332543689/",
        "text": "",
        "created_utc": 1332697585,
        "upvote_ratio": ""
    },
    {
        "title": "Magnetar Formation?",
        "author": "dbssaber",
        "url": "http://www.reddit.com/r/astrophysics/comments/r85lc/magnetar_formation/",
        "text": "Magnetars (Neutron stars with astronomically strong magnetic fields) are super cool (what with the pair-cascades, vacuum birefringence, etc.), but has anyone proposed any viable models for how these stars attain such tremendous fields?",
        "created_utc": 1332407880,
        "upvote_ratio": ""
    }
]