[
    {
        "title": "How to get Started in Astrophysics/Astronomy",
        "author": "charlesxtrent",
        "url": "http://www.reddit.com/r/astrophysics/comments/2r3qp3/how_to_get_started_in_astrophysicsastronomy/",
        "text": "Can anyone recommend any books/Videos on getting started in astrophysics/Astronomy Im looking for something cosmos themed. In a list from entry level to more advanced topics. \n\nWhat I mean by cosmos themed is the way of storytelling sortive how Neil Degrasse Tyson , Stephen Hawking , and Carl Sagan explain the beginning of our universe to the present. \n\nThanks for any post in advanced. \n\n",
        "created_utc": 1420210338,
        "upvote_ratio": ""
    },
    {
        "title": "Used to read a ton of astrophysics books when I was young, In need of an intermediate-level textbook/book for now.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2r0aw6/used_to_read_a_ton_of_astrophysics_books_when_i/",
        "text": "I used to read daily about astrophysics and physics in general, I'd read hours on hours for most of my teenage years (12-16), I was reading mostly theoretical stuff and not math-filled ones, but now that I know math I don't think I will shy away from an intermediate-level astrophysics textbook or regular book.\n\nI just want to re-ignite my passion for astrophysics because it was such a big part of my teenage life and now I've kinda let it go..",
        "created_utc": 1420122832,
        "upvote_ratio": ""
    },
    {
        "title": "CERN’s Large Hadron Collider gears up for run 2 - circulating proton beams slated for March 2015",
        "author": "Gaviero",
        "url": "http://home.web.cern.ch/about/updates/2014/12/cerns-large-hadron-collider-gears-run-2",
        "text": "",
        "created_utc": 1419953804,
        "upvote_ratio": ""
    },
    {
        "title": "/r/astrophysics hip-hop thread",
        "author": "Metagozdilla",
        "url": "http://www.reddit.com/r/astrophysics/comments/2qly5g/rastrophysics_hiphop_thread/",
        "text": "",
        "created_utc": 1419762624,
        "upvote_ratio": ""
    },
    {
        "title": "have you ordered your squishable snoo",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2qh99j/have_you_ordered_your_squishable_snoo/",
        "text": "",
        "created_utc": 1419631583,
        "upvote_ratio": ""
    },
    {
        "title": "[Community Request] If the stylesheet doesn't get changed soon I'm just going to try reorganizing this subreddit elsewhere. I'd like a real community, not some circlejerk.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2q49oz/community_request_if_the_stylesheet_doesnt_get/",
        "text": "",
        "created_utc": 1419290793,
        "upvote_ratio": ""
    },
    {
        "title": "The Calculations of General Relativity on Massive Celestial Bodies Collapsing into Singular Black Holes Are Wrong",
        "author": "srp2014",
        "url": "http://www.scirp.org/journal/PaperInformation.aspx?PaperID=52426&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1419217295,
        "upvote_ratio": ""
    },
    {
        "title": "String theory?",
        "author": "Joncon007",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pzb3y/string_theory/",
        "text": "Astrophysicists were stumped a few years ago by a light that appeared at a certain point in our Universe, grew to a certain size and brightness before gradually fading to 'nothing'. I believe the light may have been from a 'white hole', or a massive star dying, forming a black hole from within another universe/dimension and releasing its contents into our own. This, in my comparatively small, high school-educated mind, would also explain dark matter 'clumps' surrounding galaxies. Might these gravitational 'clumps', discovered by 'gravitational lensing', possibly reflect the gravity from the gigantic collapsing star and matter that had fallen through to create the super-massive black hole at the center of the galaxy? I'm thinking the force of the collapsing star forced open one or more additional dimensions from the heretofore 'curled up' extra dimensions like a balloon. Also, I understand that gravity is the only detectable force common to all dimensions in 'string theory' and it leads me to believe that our 'Big Bang' might have been a collapsing star from another universe/dimension, or white hole. It makes sense, then, to believe that our universe is being continually 'fed' by other universes, via black hole/white holes, within the grander multi-verse and this would also, by definition, describe the accelerating expansion of our universe.\nOne great thing about my ignorant questions is that I don't have to worry about scathing peer review and can, therefore, spout anything I want. But, does any of this have a place in theory, or can string theory be ruled out?",
        "created_utc": 1419178615,
        "upvote_ratio": ""
    },
    {
        "title": "Message from the Mod Team [IMPORTANT]",
        "author": "Metagozdilla",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pxvo9/message_from_the_mod_team_important/",
        "text": "On behalf of the mod team, I would like to apologize to the members of this subreddit for the direction in which we have taken it. We realize this is alienating to most, if not all, of you, and that it takes away from the serious discussions that are the heart of this subreddit. I know this apology may not be enough for some of you, and we already lost many of you in the change. I am deeply upset about that.\n\nThat said, I would like to announce that we have been working on a new theme in line with what this subreddit is all about. I believe you will all enjoy it and we can go back to our erstwhile harmony. This being the holiday season, we've decided to drop it around Christmas time. Just one more thing to be excited about.\n\nAgain, I'd like to express our sincerest apologies. What happened was a tragedy, and I will do anything &amp; everything in my power to fix it.",
        "created_utc": 1419130329,
        "upvote_ratio": ""
    },
    {
        "title": "Gamma-Ray Bursts 'Common in Storms'",
        "author": "peter_bolton",
        "url": "http://www.bbc.com/news/science-environment-30491840",
        "text": "",
        "created_utc": 1419005431,
        "upvote_ratio": ""
    },
    {
        "title": "Thermonuclear flame plume bursting through the surface of a white dwarf",
        "author": "astrocosmo",
        "url": "http://i.imgur.com/zR8L4Iu.jpg",
        "text": "",
        "created_utc": 1418987281,
        "upvote_ratio": ""
    },
    {
        "title": "Help understanding gravitational time dilation.",
        "author": "halyjam",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pr3ml/help_understanding_gravitational_time_dilation/",
        "text": "I understand (i think) time dilation in regards to velocity. for a stationary person, someone moving close to the speed of light appears to have travelled a farther distance in the same amount of time (Using the speed of light to essentially clock your time as it remains constant regardless of perspective).  Where as the person travelling  at that speed sees the clock travelling a shorter distance in his perspective (once again using c to clock themself). Correct me if i am wrong about this or give me a better analogy so i can fully understand. \n\nMy real question though, is, why does time appear to move slower for someone in higher gravity?\n\nI have no physics training whatsoever, i have just always been curious about physics and love astronomy.\n\nThanks!",
        "created_utc": 1418959459,
        "upvote_ratio": ""
    },
    {
        "title": "Visit \"Astrophys\" for more Astrophysics discussion.",
        "author": "AgentBif",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pqvv7/visit_astrophys_for_more_astrophysics_discussion/",
        "text": "",
        "created_utc": 1418954849,
        "upvote_ratio": ""
    },
    {
        "title": "Dark matter x-ray emissions? Majorana neutrinos?",
        "author": "Riboflavius",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pnzy6/dark_matter_xray_emissions_majorana_neutrinos/",
        "text": "Hello all,\n\na few days ago, iflscience pulled out a paper about [x-ray signatures](http://www.iflscience.com/space/could-scientists-have-finally-detected-dark-matter-signal) from Perseus and Andromeda.\nWhat's going on here? This seems kind of oldish, so did it pan out? Do you have any information on what happened in research since then?\n\nThank you kindly!",
        "created_utc": 1418891011,
        "upvote_ratio": ""
    },
    {
        "title": "On the Gravitational Bending of Light —Was Sir Arthur Stanley Eddington Right?",
        "author": "Claire3652",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=43984&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=zc",
        "text": "",
        "created_utc": 1418889671,
        "upvote_ratio": ""
    },
    {
        "title": "Best intro-level astrophysics/theoretical physics book to read?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pn3w0/best_introlevel_astrophysicstheoretical_physics/",
        "text": "I'm really interested in reading about more modern developments in physics, especially in astrophysics. Ideally, I'd like to get a solid understanding of more modern/theoretical concepts without having to bust out my calculator - this is just pleasure reading. I don't want everything completely glossed over either though, I do want some concrete substance.\n\nI would say I'm more scientifically literate than the average person (I work in epidemiology), but with that said I don't specialize in physics or astronomy. I took some classes on classical physics in my undergrad a few years ago, but besides that I'll just occasionally watch a documentary or read an article.\n\nI've looked into it a bit and was thinking possibly A Brief History of Time by Stephen Hawking, or The Elegant Universe by Brian Greene. Both seem really highly regarded, but they might be getting a bit outdated. I was also looking into The Shape of Inner Space by Shing-Tung Yau.\n\nI'm mainly curious to wrap my head around quantum mechanics, string theory, supersymmetry, M-theory, and all the stuff that seems infinitely foreign to our everyday lives. It'd be really great to get some suggestions!",
        "created_utc": 1418869228,
        "upvote_ratio": ""
    },
    {
        "title": "Visit /r/astrophys for a more Astrophysics discussion!",
        "author": "AgentBif",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pjgs8/visit_rastrophys_for_a_more_astrophysics/",
        "text": "",
        "created_utc": 1418786784,
        "upvote_ratio": ""
    },
    {
        "title": "is it possible to make a rocket powerful enough to propel the planet earth",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pimjp/is_it_possible_to_make_a_rocket_powerful_enough/",
        "text": "could you imagnie how frikin sick that would be smacking a fat booster on the south pole that is powerful enough to shoot earth off into the depths of space",
        "created_utc": 1418770521,
        "upvote_ratio": ""
    },
    {
        "title": "How does warp drive work?",
        "author": "Goku_01",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pgx08/how_does_warp_drive_work/",
        "text": "So I've recently read that NASA is currently trying to create a ship capable of warp drive. It says that the fabric of space-time is bent by the ship as it travels through it, and that this type of travel theoretically surpasses the speed of light. But what I didn't understand is how this works, and how they would accumulate the energy needed. Any explanation is welcome!",
        "created_utc": 1418739378,
        "upvote_ratio": ""
    },
    {
        "title": "I'm going to make my own subreddit called /r/actualastrophysics.",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2pc4h1/im_going_to_make_my_own_subreddit_called/",
        "text": "This has gone on for far too long now.\nIt was funny for 2 hours but now it is just beyond stupid, the people who are subbed want to see astrophysics based articles and discussion, not a lame attempt and contemporary humour.\nWhile the user generated content may still be good, the mods have no regard to this subreddit.\nSo I will make my own, feel free to join but in the coming days it will be slow and unfinished.",
        "created_utc": 1418624418,
        "upvote_ratio": ""
    },
    {
        "title": "Go to this subreddit to complain instead of messing with our good threads. Here's your little banned support group.",
        "author": "Gozdilla",
        "url": "http://www.reddit.com/r/astrophysicsinsurgent",
        "text": "",
        "created_utc": 1418611708,
        "upvote_ratio": ""
    },
    {
        "title": "DESember - Dark Energy Survey",
        "author": "Gaviero",
        "url": "https://www.youtube.com/watch?v=JzorVBblI4w&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1418602580,
        "upvote_ratio": ""
    },
    {
        "title": "/r/astrophysics anime thread v2",
        "author": "Gozdilla",
        "url": "http://www.reddit.com/r/astrophysics/comments/2past3/rastrophysics_anime_thread_v2/",
        "text": "The original turned into a fucking shitpile of [deleted] so I'm making a new one.\n\nThis is the thread to discuss all animes, not just astrophysics ones. Try to stay on topic, please.",
        "created_utc": 1418596539,
        "upvote_ratio": ""
    },
    {
        "title": "How would Earth be affected if Saturn was suddenly gone?",
        "author": "WildCharger",
        "url": "http://www.reddit.com/r/astrophysics/comments/2p4dgl/how_would_earth_be_affected_if_saturn_was/",
        "text": "Does its gravity affect us that much?",
        "created_utc": 1418423999,
        "upvote_ratio": ""
    },
    {
        "title": "AskAstrophysics: how long does the regolith deposition process take to cover sharp features on asteroids?",
        "author": "skytomorrownow",
        "url": "http://www.reddit.com/r/astrophysics/comments/2p49mr/askastrophysics_how_long_does_the_regolith/",
        "text": "In this image of an [asteroid surface](http://i.imgur.com/5L5mvQT.jpg), we see a 'recent' impact (A) showing sharp features. Slowly, over many eons, the regolith ejected from recent impacts (including micro-impacts) begin to bury older impact sites (B), thereby softening and 'blurring' once shape features. \n\nHow long does such a process take? How old would the oldest and most 'blurred out' craters be?\n\nedit: So I already have an 'it depends' reply. Of course it depends -- I should have given some kind of specific scenario, otherwise it is just too hard to give even a rough answer. The way I stated the question doesn't really account for the fact that deposition rates during the early bombardment are way different than today.\n\nAssume the impact crater (A) happened in the asteroid belt today. How far in the past would impact crater have been 'fresh' given the image of it today underneath a lot of deposited regolith?\n\nHopefully that helps fix my oversight.",
        "created_utc": 1418421813,
        "upvote_ratio": ""
    },
    {
        "title": "BBC - Light and Dark, Light",
        "author": "Gaviero",
        "url": "http://www.bbc.co.uk/programmes/p01k4yt6",
        "text": "",
        "created_utc": 1418416206,
        "upvote_ratio": ""
    },
    {
        "title": "What would you want for Christmas?",
        "author": "Ghotifett",
        "url": "http://www.reddit.com/r/astrophysics/comments/2p1jfr/what_would_you_want_for_christmas/",
        "text": "I have a friend who is studying astrophysics and would love to get him something to do with it. So what would you want that would make you happy as a gift? Obviously pertaining to astrophysics.",
        "created_utc": 1418353953,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"Serial Experiments Lain\" considered an astrophysics anime?",
        "author": "TheEmbernova",
        "url": "http://www.reddit.com/r/astrophysics/comments/2p19r9/is_serial_experiments_lain_considered_an/",
        "text": "",
        "created_utc": 1418348607,
        "upvote_ratio": ""
    },
    {
        "title": "What crystals grow in deep space (with no oxygen)?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2oyf5r/what_crystals_grow_in_deep_space_with_no_oxygen/",
        "text": "What crystals grow in deep space (with no oxygen)? I am sure there are a few, but can someone please list a few? and perhaps a few that does take oxygen but were found anyways (separate list)?",
        "created_utc": 1418285780,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone fucking change the layout of this subreddit.",
        "author": "danski36",
        "url": "http://www.reddit.com/r/astrophysics/comments/2oxdnk/can_someone_fucking_change_the_layout_of_this/",
        "text": "",
        "created_utc": 1418261623,
        "upvote_ratio": ""
    },
    {
        "title": "Two Unified Algorithms for Fundamental Planetary Ephemeris",
        "author": "winni709",
        "url": "http://www.scirp.org/journal/PaperInformation.aspx?PaperID=52103&amp;utm_campaign=twitter&amp;utm_medium=sx",
        "text": "",
        "created_utc": 1418201670,
        "upvote_ratio": ""
    },
    {
        "title": "2021 the year of the cumplanet",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2ojhds/2021_the_year_of_the_cumplanet/",
        "text": "there has been a lot of talk lately about a team of scientiest planning on getting together and cumming in a great big balloon hoping to create a planet of cum that they will launch out into space in the year 2021. just wondering if anyone else has heard of this",
        "created_utc": 1417947219,
        "upvote_ratio": ""
    },
    {
        "title": "Weird question...",
        "author": "LeBronholmes27",
        "url": "http://www.reddit.com/r/astrophysics/comments/2obdmr/weird_question/",
        "text": "Ok here it goes. Imagine there are three humans with superpowers. One has the ability to control matter, including creating/destroying it. \n\nThe second can control anti-matter, including creating it...can you destroy antimatter? Huh...anyways\n\nThe third can control dark matter, including creating/destroying it. Here is my question: \n\nWhat sort of abilities would each one have? Give me examples, like \"he would be able to wipe out the whole universe in one second\". Also conclude about who would be the strongest. I really need this answered!!",
        "created_utc": 1417740031,
        "upvote_ratio": ""
    },
    {
        "title": "What the fuck happened?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2o8lxa/what_the_fuck_happened/",
        "text": "http://i.imgur.com/NnypSoC.png",
        "created_utc": 1417675241,
        "upvote_ratio": ""
    },
    {
        "title": "How do planets orbit binary stars?",
        "author": "SteveBJobs",
        "url": "http://www.reddit.com/r/astrophysics/comments/2o64hb/how_do_planets_orbit_binary_stars/",
        "text": "I'm learning about Kepler's laws in Physics and the law requires focal points. In the case of binary stars do the planets technically orbit one or both of the stars?",
        "created_utc": 1417627270,
        "upvote_ratio": ""
    },
    {
        "title": "Just a brief theory of Supermassive Black Hole formation by way of Population III Stars",
        "author": "d023n",
        "url": "http://www.reddit.com/r/astrophysics/comments/2o3y11/just_a_brief_theory_of_supermassive_black_hole/",
        "text": "I'd like to see if and how much this makes sense to other people.\n\nAs the theoretical first stars of the cosmos, Population III stars were exceptionally massive (possibly hundreds of solar masses) and went through their life cycles very quickly (millions perhaps hundreds of thousands of years).\n\nIf there were extremely large quantities of these stars rapidly forming and exploding in the early universe, as a result an increasingly large quantity of stellar mass black holes would be created. If galactic and surely filamentary type structures had not yet formed in the universe from the initially uniform expanse of hydrogen gas, then Population III stars and black holes would be distributed somewhat uniformly themselves. The number of black holes would rapidly increase, and the uniformity of spatial distribution would decrease, resulting in greater numbers of black hole mergers. Once the Population III cycle was spent, the rapid stellar mass black hole formation would cease, and the huge surplus of black holes would quickly form into supermassive mass black holes (and almost no intermediate mass ones) due to positive feedback, much like planets grow exponentially from dust in stellar systems. The supermassive black holes would then go on to govern the further formation of structure in the universe.\n\nHydrogen gas --&gt; lots of Population III stars --&gt; lots and lots of black holes --&gt; supermassive black holes --&gt; galaxies and filaments\n\nGiven that a universe of just hydrogen gas is very different from our current state, it makes a lot of sense that odd things would happen at the beginning of its transition to a more equalized state.\n\nA relatively okay analogy that I can think of would be how a match flares when struck before calming to a steady flame.\n\nAnyways, I was just wondering how sensible/interesting this theory was. Feedback welcome! Thanks.",
        "created_utc": 1417571036,
        "upvote_ratio": ""
    },
    {
        "title": "Traveling Faster than the Speed at which the Universe is Expanding",
        "author": "drewb1988",
        "url": "http://www.reddit.com/r/astrophysics/comments/2o2wpt/traveling_faster_than_the_speed_at_which_the/",
        "text": "Are there any theories on this? Such as what would happen when you reached any potential finite point?",
        "created_utc": 1417552825,
        "upvote_ratio": ""
    },
    {
        "title": "I'm thinking of an Physics/Astrophysics major but I don't know if i'm good enough at math.",
        "author": "SteveBJobs",
        "url": "http://www.reddit.com/r/astrophysics/comments/2nwz6b/im_thinking_of_an_physicsastrophysics_major_but_i/",
        "text": "I'm not terrible at math, I am a straight A student in high school. I never really had an interest in astrophysics until this year though. I wanted to be a biologist but there are no jobs in it really and i feel i would waste time getting a bio degree. I started taking physics this year and i fell in love with how math can explain things. The problem is that I am deffinatly not a genius and I only get slightly above average grades. How good at math does someone need to be to be a physics major?",
        "created_utc": 1417412666,
        "upvote_ratio": ""
    },
    {
        "title": "why arent you idiots talking about star wars",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2nu73p/why_arent_you_idiots_talking_about_star_wars/",
        "text": "n/t",
        "created_utc": 1417347981,
        "upvote_ratio": ""
    },
    {
        "title": "'Eye of Sauron' provides new way of measuring distances to galaxies",
        "author": "[deleted]",
        "url": "http://www.sciencedaily.com/releases/2014/11/141126132702.htm",
        "text": "",
        "created_utc": 1417262401,
        "upvote_ratio": ""
    },
    {
        "title": "Wavelet analysis of lunar semidiurnal tidal influence on selected inland rivers across the globe",
        "author": "dose27dose27",
        "url": "http://www.nature.com/srep/2014/140226/srep04193/full/srep04193.html",
        "text": "",
        "created_utc": 1417254778,
        "upvote_ratio": ""
    },
    {
        "title": "Boy, this Satr Wars trilaler sucked, eh? Woof. what the fuck was up with that stupid lifesaver hilt? Dumbe.",
        "author": "Gozdilla",
        "url": "https://www.youtube.com/watch?v=OMOVFvcNfvE",
        "text": "",
        "created_utc": 1417227368,
        "upvote_ratio": ""
    },
    {
        "title": "Not a member but...",
        "author": "tensorstrength",
        "url": "http://www.reddit.com/r/astrophysics/comments/2nppnt/not_a_member_but/",
        "text": "Stopping by to say that your subreddit is kawwai as fuck.",
        "created_utc": 1417220530,
        "upvote_ratio": ""
    },
    {
        "title": "Star Trek-like invisible shield found thousands of miles above Earth",
        "author": "dr-knowledge",
        "url": "http://phys.org/news/2014-11-star-trek-like-invisible-shield-thousands.html",
        "text": "",
        "created_utc": 1417027083,
        "upvote_ratio": ""
    },
    {
        "title": "jurassic world got me thinking....",
        "author": "UNIVERSEnema",
        "url": "http://idealuststudios.com/wp-content/uploads/2012/10/20120227-Tyrannosaurus-Astronaut.jpg",
        "text": "",
        "created_utc": 1416990049,
        "upvote_ratio": ""
    },
    {
        "title": "Why gas giants?",
        "author": "emb3a",
        "url": "http://www.reddit.com/r/astrophysics/comments/2ng20c/why_gas_giants/",
        "text": "How come Jupiter's (and the other gas giants for that matter) mass, and thus gravity, doesn't pull its gases into it's center? do gas giants have an engine within like the sun that keeps its gases away? what about colder gas giants like Neptune and Uranus?",
        "created_utc": 1416974785,
        "upvote_ratio": ""
    },
    {
        "title": "Wow",
        "author": "Rimm",
        "url": "http://www.nature.com/nature/journal/v513/n7516/full/nature13674.html",
        "text": "",
        "created_utc": 1416943285,
        "upvote_ratio": ""
    },
    {
        "title": "gravity and time",
        "author": "cmartin2273",
        "url": "http://www.reddit.com/r/astrophysics/comments/2nbvc8/gravity_and_time/",
        "text": "The theory of gravitational time dilation says that the stronger the gravitational potential the slower time passes. If this is true than in space, where there is zero gravity is time constant for everyone in zero gravity? Do they all share the same passage of time? Why does time pass at all in zero gravity?",
        "created_utc": 1416882539,
        "upvote_ratio": ""
    },
    {
        "title": "space ship megathread",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n8eun/space_ship_megathread/",
        "text": "post your fav spaceships itt they can be from real life or fiction or heck even your own designs",
        "created_utc": 1416803536,
        "upvote_ratio": ""
    },
    {
        "title": "Devenir chercheur en astrophysique en France.",
        "author": "Espequair",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n7fv5/devenir_chercheur_en_astrophysique_en_france/",
        "text": "",
        "created_utc": 1416783269,
        "upvote_ratio": ""
    },
    {
        "title": "Wtf?",
        "author": "onewhitelight",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n5eja/wtf/",
        "text": "",
        "created_utc": 1416726116,
        "upvote_ratio": ""
    },
    {
        "title": "Gutbuster",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n4uon/gutbuster/",
        "text": "https://www.youtube.com/watch?v=0MlyEFK3iSM",
        "created_utc": 1416710936,
        "upvote_ratio": ""
    },
    {
        "title": "Gutbuster",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=0MlyEFK3iSM",
        "text": "",
        "created_utc": 1416710835,
        "upvote_ratio": ""
    },
    {
        "title": "What has happened to this subreddit?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n4h1z/what_has_happened_to_this_subreddit/",
        "text": "Why are there cartoons in a Astrophysics forum? This is not appropriate.",
        "created_utc": 1416701894,
        "upvote_ratio": ""
    },
    {
        "title": "/r/astrophysics anime thread",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n4cd9/rastrophysics_anime_thread/",
        "text": "anime posts itt only. no astrophysics allowed. all anime discussion restricted to this thread only.",
        "created_utc": 1416698985,
        "upvote_ratio": ""
    },
    {
        "title": "wiki finally added after much demand",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n4aqt/wiki_finally_added_after_much_demand/",
        "text": "you want it you got it baby your welcome",
        "created_utc": 1416698038,
        "upvote_ratio": ""
    },
    {
        "title": "Enjoy the sub.",
        "author": "mons00n",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n3acb/enjoy_the_sub/",
        "text": "",
        "created_utc": 1416675721,
        "upvote_ratio": ""
    },
    {
        "title": "So is this subreddit going to shit, or..?",
        "author": "namhtes1",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1t8o/so_is_this_subreddit_going_to_shit_or/",
        "text": "",
        "created_utc": 1416626223,
        "upvote_ratio": ""
    },
    {
        "title": "thoghts opinions on this news",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1qn0/thoghts_opinions_on_this_news/",
        "text": "http://www.youthhealthmag.com/articles/2640/20141120/cosmos-season-2.htm\n\ni am personaly outraged but what can you do",
        "created_utc": 1416624420,
        "upvote_ratio": ""
    },
    {
        "title": "thoghts opinions on this news",
        "author": "UNIVERSEnema",
        "url": "http://www.youthhealthmag.com/articles/2640/20141120/cosmos-season-2.htm",
        "text": "",
        "created_utc": 1416624351,
        "upvote_ratio": ""
    },
    {
        "title": "When wouyld be the best Day to impregante my wife?",
        "author": "Rimm",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1ot5/when_wouyld_be_the_best_day_to_impregante_my_wife/",
        "text": "I'm a Virgo Rising, she is a Pisces waning and we're lookking for the best day to cenceive if we want to produce another Pisces. ",
        "created_utc": 1416623160,
        "upvote_ratio": ""
    },
    {
        "title": "astrpohysics n00b thread",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1osd/astrpohysics_n00b_thread/",
        "text": "make some frieneds lets have a good time in here talk about dumb science stuff too if you want",
        "created_utc": 1416623143,
        "upvote_ratio": ""
    },
    {
        "title": "have you guys seen this good thing?",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1oi0/have_you_guys_seen_this_good_thing/",
        "text": "http://2.bp.blogspot.com/__bqXP4eg7X8/TJLotkyDBrI/AAAAAAAABXM/f12NrkzYxH4/s1600/Car+in+Space.jpg",
        "created_utc": 1416622933,
        "upvote_ratio": ""
    },
    {
        "title": "what are you up to tonight astrophysics",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1lkx/what_are_you_up_to_tonight_astrophysics/",
        "text": "its friday baby whos getting into trouble any good stars to look at or whatever",
        "created_utc": 1416620983,
        "upvote_ratio": ""
    },
    {
        "title": "What does your Rising Sign say about you?",
        "author": "jizzbabyswag",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n1k32/what_does_your_rising_sign_say_about_you/",
        "text": "You probably already know that I'm a Virgo (Earth sign), which is why I have such a grounded, \"down-to-earth\" personality. I like to stand on two feet and take life one step at a time. However, my Rising Sign is Scorpio, which explains why I can sometimes betray a fiery, fearsome temper (Scorpion sting), but only when pushed.\n\nThoughts? Questions?",
        "created_utc": 1416619943,
        "upvote_ratio": ""
    },
    {
        "title": "Senior Project Products",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n17iy/senior_project_products/",
        "text": "",
        "created_utc": 1416612085,
        "upvote_ratio": ""
    },
    {
        "title": "In case anyone is interested, I created a new subreddit for IDL tips/help/discussion called IDLhelp.",
        "author": "Cletus_awreetus",
        "url": "http://www.reddit.com/r/IDLhelp",
        "text": "",
        "created_utc": 1416610450,
        "upvote_ratio": ""
    },
    {
        "title": "Need help identifying this unknown object moving by a star.",
        "author": "[deleted]",
        "url": "http://i.imgur.com/qPK5nCV.gif?1",
        "text": "",
        "created_utc": 1416607184,
        "upvote_ratio": ""
    },
    {
        "title": "What is the black in space?",
        "author": "Iwasputhere",
        "url": "http://www.reddit.com/r/astrophysics/comments/2n0mfu/what_is_the_black_in_space/",
        "text": "It has to be something,Right?",
        "created_utc": 1416601286,
        "upvote_ratio": ""
    },
    {
        "title": "Too late to start?",
        "author": "nodayzero",
        "url": "http://www.reddit.com/r/astrophysics/comments/2mux6z/too_late_to_start/",
        "text": "I have been learning string theory for the past few months and I am fascinated. I did my undergrad in electrical engineering with a lot of focus on experimental side of things but I took a lot of math courses well into my senior year. I have been working at a computer company for the last 3 years but realized that programming is not something I enjoy and I would rather be a theoretical scientist. I did some experimental research back in the day and got disillusioned with academia for a while. My question is if I want to study astrophysics/cosmology is it too late for me to try getting into this field? If I do decide to do this, should I  do BS in physics before or should I apply to masters  ( i think Phd is a long shot at this point)?",
        "created_utc": 1416469715,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good topics which I could write a 10 page paper over, relating to stellar astrophysics?",
        "author": "eyeofthetiger11",
        "url": "http://www.reddit.com/r/astrophysics/comments/2muk5z/what_are_some_good_topics_which_i_could_write_a/",
        "text": "Other than the progenitors of Gamma Ray Bursts (I've already written one on that)",
        "created_utc": 1416459584,
        "upvote_ratio": ""
    },
    {
        "title": "Elusive Dark Matter Could Be Detected with GPS Satellites",
        "author": "PinkSlimeIsPeople",
        "url": "http://www.universetoday.com/116449/elusive-dark-matter-could-be-detected-with-gps-satellites/",
        "text": "",
        "created_utc": 1416455255,
        "upvote_ratio": ""
    },
    {
        "title": "Supercomputer models 13.7 billion years of the universe's evolution in one day. Crossposted to /r/compsci",
        "author": "greenprius",
        "url": "http://www.deixismagazine.org/2014/11/universe-in-a-day/",
        "text": "",
        "created_utc": 1416424440,
        "upvote_ratio": ""
    },
    {
        "title": "Gravity may have saved the universe after the Big Bang, say researchers",
        "author": "petskup",
        "url": "http://phys.org/news/2014-11-gravity-universe-big.html",
        "text": "",
        "created_utc": 1416324206,
        "upvote_ratio": ""
    },
    {
        "title": "College",
        "author": "are446",
        "url": "http://www.reddit.com/r/astrophysics/comments/2mmr1k/college/",
        "text": "I have been thinking about college and I wanted to know. Is there one over arching heavenly place to go to college for? Would that include MIT?",
        "created_utc": 1416282927,
        "upvote_ratio": ""
    },
    {
        "title": "I want to be an Astrobiologist",
        "author": "polikujm1",
        "url": "http://www.reddit.com/r/astrophysics/comments/2mj6an/i_want_to_be_an_astrobiologist/",
        "text": "I thought about posting this in /r/astrobiology but this sub is a lot bigger and astrobiology is a part of astrophysics after all so..\n\nI am a second year undergraduate student who is aspiring to be an astrobiologist, my question is: what should I study as an undergrad?\n\nMy school doesn't offer an astronomy/astrophysics/astrobiology major, so I have declared my major as math and I am right now planning on minoring in astrophysics. However, should I try to minor in Bio or chem as well? Or should I only take one or two Bio classes, or does it not really matter that much? My school also offers Genetics, Bioinformatics, and Molecular Bio minors if those are relevant at all.",
        "created_utc": 1416200060,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain the difference between Astrophysics major and a Physics major with astrophysics emphasis?",
        "author": "omniscientclown",
        "url": "http://www.reddit.com/r/astrophysics/comments/2mffk4/can_someone_explain_the_difference_between/",
        "text": "I'm currently university shopping and have seen both of these show up.  I've even seen a physics major with astrophysics specialization (Uni of Chicago). If I would like to go to graduate school for astrophysics, would it matter if I went in with one or the other? Or is one of those options a better choice? Thanks!",
        "created_utc": 1416100859,
        "upvote_ratio": ""
    },
    {
        "title": "What should I major in as an undergrad?",
        "author": "8855nocab",
        "url": "http://www.reddit.com/r/astrophysics/comments/2me99l/what_should_i_major_in_as_an_undergrad/",
        "text": "I have been interested in astronomy and astrophysics for many years. I am now a Junior in High School and I have started looking at colleges. Should I be looking for a major in Physics, Astronomy, or Astrophysics. Eventually I hope to get a PhD in Astrophysics, but i know that having a degree in physics helps greatly. Would double-majoring in any of the three be a good idea?",
        "created_utc": 1416075103,
        "upvote_ratio": ""
    },
    {
        "title": "Grad School from the opposite end...",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2mdday/grad_school_from_the_opposite_end/",
        "text": "Hey Guys,\n\nAnother grad school question ( apologies ).\n\nI am wondering how I can get into a good grad school without a physics or astronomy bachelors. I am doing a Maths/Applied Math bachelors. I do cover Fluid Mechanics, Nonlinear Dynamics and Chaos, PDEs, Numerical Analysis, Optimisation and Stochastic Differential Equations in my Applied Math classes.\n\n1. Given I get some research experience, what other things could I do to increase my chances of astrophysics grad school?\n\n2. I'm also highly interested in Machine Learning in Edinburgh University's grad school. What machine learning is used in astrophysics and would I be better off trying to get into that phd program?\n\n3. If I want to study myself, should I start with the B.O.B or get a straight physics undergrad text?\n\nThanks!\n\nEDIT: Forgot to mention I am from the EU if that makes any difference!",
        "created_utc": 1416048360,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a need for a \"time constant\"?",
        "author": "PHOClON",
        "url": "http://www.reddit.com/r/astrophysics/comments/2md4h1/is_there_a_need_for_a_time_constant/",
        "text": "Not sure if you're the ones to ask but I've been wondering this for a while. Since time is effected by gravity, and gravity effects everything to some extent or another, is there a need to establish a baseline for time? I'm sure everything is based on earth time right now but is that not a bit deceptive when we're trying to date astronomical objects which may be effected by time in a way which is much different from our experience? bonus question: how long would an earth second be if not effected by gravity at all?",
        "created_utc": 1416037737,
        "upvote_ratio": ""
    },
    {
        "title": "Philae mission failed IMO",
        "author": "atlien23",
        "url": "http://www.reddit.com/r/astrophysics/comments/2mb7oz/philae_mission_failed_imo/",
        "text": "I just want to say that to me it sounds like Philae part of the Rosetta mission has almost completely failed. The harpoons didn't fire to help it land and not bounce. The thruster to keep it pinned to the surface won't work and screwing the probe into the surface has also failed. As a result the solar panels are not getting sunlight and so it will run out of batteries by Saturday.\n\nOf course they are hailing it as a huge success because it is in their best interest to do so. But really the Philae part of the mission was just a glorified egg drop...\n\nAm I wrong here?",
        "created_utc": 1415993251,
        "upvote_ratio": ""
    },
    {
        "title": "Detecting imploding pulsars can help tell us properties of dark matter",
        "author": "Eaharter",
        "url": "http://news.nd.edu/news/53745-new-paper-explains-methods-that-may-lead-to-new-insights-about-dark-matter/",
        "text": "",
        "created_utc": 1415907126,
        "upvote_ratio": ""
    },
    {
        "title": "I am very interested in astrophysics. What should I expect?",
        "author": "ProfessorPootis",
        "url": "http://www.reddit.com/r/astrophysics/comments/2m5c7r/i_am_very_interested_in_astrophysics_what_should/",
        "text": "I have always been very interested in astrophysics. This may sound cliche, but I love learning about space and was originally inspired by Neil deGrasse Tyson. I'm wondering if anybody can help me understand what I would need to do and what I should expect in pursuing a career in astrophysics. I am currently a junior in high school with a reasonable GPA ( around 3.5, A's and B's ).",
        "created_utc": 1415850608,
        "upvote_ratio": ""
    },
    {
        "title": "Where did the idea of the worm home come from?",
        "author": "hypertrophicmasseter",
        "url": "http://www.reddit.com/r/astrophysics/comments/2m4e6s/where_did_the_idea_of_the_worm_home_come_from/",
        "text": "",
        "created_utc": 1415833068,
        "upvote_ratio": ""
    },
    {
        "title": "Rosetta's lander, Philae, has successfully landed on a comet!",
        "author": "BeerBrewerz",
        "url": "http://www.reddit.com/r/astrophysics/comments/2m33ms/rosettas_lander_philae_has_successfully_landed_on/",
        "text": "http://www.theguardian.com/science/across-the-universe/live/2014/nov/12/rosetta-comet-landing-live-blog",
        "created_utc": 1415810829,
        "upvote_ratio": ""
    },
    {
        "title": "Apocalypse in 20 ways",
        "author": "[deleted]",
        "url": "http://www.whatisuniverse.com/content/Apocalypse%20in%2020%20Ways/",
        "text": "",
        "created_utc": 1415807663,
        "upvote_ratio": ""
    },
    {
        "title": "World's Theory",
        "author": "Physicspart_theory",
        "url": "http://www.reddit.com/r/astrophysics/comments/2lzdze/worlds_theory/",
        "text": "My theory that the sun is another Earth, which I call world's theory, is based on the fact that while performing the ten plagues of Egypt, The Black Land, the sun blacked out several times. This, combined with the understanding that the spirit of the wind is in fact God himself, makes perfect sense.\n\nI was lying in bed and meditating, and I perceived an image of bubbles consisting of planets and their atmospheres, each producing the next with motion on a planet such as ours. This was a legitimate image and not a forced thought, and therefore I would consider this superior to our current particle soup theories.\n\nAny thoughts?\n\nEdit: 'Worlds Theory'\n\nTo elaborate, light from the sun would be the bond between out worlds, the light would go towards a single point on the edge of the atmosphere, expand to the edges of the next planet's atmosphere, the go in, grazing the planets edges and reaching a single point on the other side, hence the cone of light from the sun.\n\nhttp://imgur.com/WxYQApa\n\nThere are many holes in this, but I see the same in bosonic theory, atomic theory, etc., and therefore believe that with more reflection this could develop into a legitimate understanding of space.",
        "created_utc": 1415726854,
        "upvote_ratio": ""
    },
    {
        "title": "Faith in Science? Dark matter and Dark energy?!?!",
        "author": "Voltariat",
        "url": "http://www.reddit.com/r/astrophysics/comments/2lyoed/faith_in_science_dark_matter_and_dark_energy/",
        "text": "Something about dark matter and dark energy never sat well with me. We have, what I assume to be a bunch of math and analytics that describe our world. I'm not an astrophysicist but I've seen some scrawling of those fancy math people. The people that make those scrawlings tell me that much of their calculations rely on calculations that others have done. Ok, Newtons \"on the shoulders of giants thing\", got it. They also tell me that some of those other peoples theories are far from proven and can't really be tested. They go on to say something about needing a bigger hadron colider or there is no pratical way to test it, etc. Ok, I guess I understand, when you get into the very BIG world of things and extremes of heat and speed, those are hard to re-create.\n\nLets go back to the scrawlings of math type stuff. I'm not doubting that all those symbles and stuff mean something but there is a very small poplulation of people that understand it. Additionally, I have talked with deep math professors and they admit that they really understand the math type stuff that is related to their specific focus. Often times they just have to take others people math type stuff at face value because its much to complicated for them to proof out every corner of someone elses work.\n\nHere is the catch... the extrems of our science relies on significant faith in others, sometimes dead people. It requires faith in ideas and scrawlings that are unproven and unreadable by most. I've only got the preaching of a small group of people that tell me that they have checked \"most of\" the facts behind their science. If I where to rebut this, I am often told things like \"its really complicated\". Or \"we have proof of this....(or not, sometimes you can just say you can't test that theory). Not only that but the Science community regulates it information and publication via science boards, these boards are funded by individuals with political and economic motives.\n\nThe final things that just kills me is.. to put a bow on every formula and idea presented by our modern scientific community, I must believe that MOST of our world is made up of energy and matter that can not and will not ever be identified and was ONLY discovered when its ABSENCE made their math not work.\n\nHolly cow, that takes SO much faith. Is this Science? Why does this not feel like Science at all? I am not going to now compare science with my own spiritual beliefs because I don't think its possible to compare science and spirituality, they are two totally independent things with near zero direct correlation points. My only point here is; is Science a process that, inevitably, strongly relies on faith?\n\nFaith in boards and people entrusted with maintaining it.\nFaith in dead people that created therms that can't be proven.\nFaith in energy and mater to exist when we have not way to prove it.\nFaith in the word of your own pears to support your work.\n\nCan we call this science anymore?\n\n\nEdit:\nClarification - based on the lovely input I've gotten and I have really enjoyed and am grateful for the very smart people that have responded to this thread...I have to make a clarification\n\n\nI am perusing the idea that \"Our Modern Scientific In query\" requires Faith. The abstraction of \"Science\" itself clearly tried to build on only facts and repeatable proofs and leave no room for Faith.\n\n\nEdit 2:\nEdit Notes: More Additions to build clarity around my question based on feedback and repeat comments/questions\n\n\nI've had to do some updates and clarifications. I'll summarize some of that for you. You could find it spattered about this thread.\n\nMy postulate is this:\n\nEdge modern scientific pursuits are requiring more and more faith.\n\n-It requires some faith in the accreditation and administration of scientific record. i.e. the people responsible for the checks and balances and ensuring the integrity of some of these fringe ideas have much more room for influence from the political, social, and economic interests involved or funding them.\n\n-It requires significant faith in theories, postulates, and formulas created by predecessors. Theories that grow increasingly in complexity, lack of testing, or ability to measure.\n\n-It requires faith in unobserved results and measurements but rather in assumptions based on absence of a better explanation or simply adding a constant to make a formula balance (to state a few examples of faith needed in the results)\n\n\nWhy is this important to me? Well, time and time again I see people reference the \"irrifutability\" of scientific method in compassion to \"faith based\" religious ideals. The thing is, I see time and time again where \"faith\" in a very similar fashion is needed for the modern pursuit of science. It is my belief these are just two separate belief systems. If people want to believe Science is the end pursuit and a creator is never needed then I understand this but if your saying science is just plan better then a religious belief system because it doesn't require faith, then I have a problem.\n\n\nIn conclusion. The pursuit of Science as a belief system. i.e. There is no God and science will explain it all, is a belief system that does require faith to move forward. It does not maintain any specific superiority to any other belief system solely because it points to scientific method to produce proof of its belief.",
        "created_utc": 1415711986,
        "upvote_ratio": ""
    },
    {
        "title": "How Building a Black Hole for Interstellar Led to an Amazing Scientific Discovery | WIRED",
        "author": "[deleted]",
        "url": "http://www.wired.com/2014/10/astrophysics-interstellar-black-hole/",
        "text": "",
        "created_utc": 1415681559,
        "upvote_ratio": ""
    },
    {
        "title": "Software Engineering and Astrophysics?",
        "author": "VesperStorm",
        "url": "http://www.reddit.com/r/astrophysics/comments/2lwkrb/software_engineering_and_astrophysics/",
        "text": "",
        "created_utc": 1415658924,
        "upvote_ratio": ""
    },
    {
        "title": "Best resources/texts for an Engineering Physics undergrad interested in astrophysics?",
        "author": "Galileans",
        "url": "http://www.reddit.com/r/astrophysics/comments/2ltwxg/best_resourcestexts_for_an_engineering_physics/",
        "text": "I'm a junior in engineering physics at a well-known university- I've got a very solid background in math and mechanics (in-depth E&amp;M and quantum is forthcoming). I've always loved space and astronomy and would like to keep doors open in astrophysics. There's not a whole lot of room in my schedule as I finish undergrad to take lots of prereqs. I would love recommendations on essential intro to mid-level astrophysics texts, books, or other resources. Thanks very much!",
        "created_utc": 1415594582,
        "upvote_ratio": ""
    },
    {
        "title": "The Unbearable Beauty of the Night Sky",
        "author": "CLiechtenstein",
        "url": "http://www.youtube.com/attribution_link?a=SQO_LWRp8pU&amp;u=%2Fwatch%3Fv%3DpV58YptFTK0%26feature%3Dshare",
        "text": "",
        "created_utc": 1415535153,
        "upvote_ratio": ""
    },
    {
        "title": "The Riddle of AntiMatter",
        "author": "CLiechtenstein",
        "url": "http://www.youtube.com/attribution_link?a=nE-ZsQfmOpI&amp;u=%2Fwatch%3Fv%3DY5oNwJNdMxY%26feature%3Dshare",
        "text": "",
        "created_utc": 1415534030,
        "upvote_ratio": ""
    },
    {
        "title": "How does the passing of time differ when moving very fast?",
        "author": "xero00",
        "url": "http://www.reddit.com/r/astrophysics/comments/2lludf/how_does_the_passing_of_time_differ_when_moving/",
        "text": "Say we figured out how to make a spaceship that could travel at 99% of the speed of light. As time passes at a different rate the faster you are moving, how much of a difference would there be in time passing for astronauts traveling on a ship like this? Would this allow them to go somewhere 10 or 20 light years away while only seeming like it took a fraction of that time to get there?",
        "created_utc": 1415388435,
        "upvote_ratio": ""
    },
    {
        "title": "Question about light in the 4th dimension",
        "author": "Shellbelly",
        "url": "http://www.reddit.com/r/astrophysics/comments/2llgnf/question_about_light_in_the_4th_dimension/",
        "text": "What if the sun is our 3 dimensional experience of the fourth dimension?\n\nJust like a 2 dimensional person would experience a sphere as a circle in a 2 D world, maybe we are experiencing light as a 3D shape even though it's all encompassing in 4D?\n\nI was envisioning all these 'Suns' of our universe and what all of them do in the 4th dimension and I can't help but think of an electron cloud. \n\nCould our 'sun' be constantly moving in the 4th dimension? And we are  seeing it frozen because it's constantly moving in the 4th dimension?\n\n\nIs form limited to the third dimension?\n\n\nDoes this even make any sense? Perhaps my limited understanding of physics is making me piece together things that inherently don't make sense together. Would love some insight.\n\n",
        "created_utc": 1415381369,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a first year Biochemistry student thinking of transferring into Astrophysics. What would sort of courses would I be taking? And what would I learn?",
        "author": "LavenderTownJpeg",
        "url": "http://www.reddit.com/r/astrophysics/comments/2ljrh2/im_a_first_year_biochemistry_student_thinking_of/",
        "text": "I'm a first year Biochemistry student living in Canada. I'm interested in Astrophysics and was thinking of transferring. What is a degree in Astrophysics like? Is it useless if I don't get a Masters or PhD? What sorts or courses would I be taking, and what would I learn in those?\n\nThank you for any information!",
        "created_utc": 1415333539,
        "upvote_ratio": ""
    },
    {
        "title": "Expansion Theory Question",
        "author": "stomppad12",
        "url": "http://www.reddit.com/r/astrophysics/comments/2lh956/expansion_theory_question/",
        "text": "If everything in the universe is always expanding, is everything on Earth (including our bodies) also expanding, but we've never noticed because our methods of measurement are also expanding at the same rate?",
        "created_utc": 1415286847,
        "upvote_ratio": ""
    },
    {
        "title": "Science AMA Series: We are graduate students at Cornell University studying what things like colliding black holes and wormholes actually look like. We also provided black hole visualizations for the special effects team of Interstellar. AUA! (Post your questions to the linked /r/science submission)",
        "author": "nallen",
        "url": "https://www.reddit.com/r/science/comments/2l259x/science_ama_series_we_are_graduate_students_at/",
        "text": "",
        "created_utc": 1414932044,
        "upvote_ratio": ""
    },
    {
        "title": "Hubble Space-Shattering Discoveries",
        "author": "CLiechtenstein",
        "url": "http://www.youtube.com/attribution_link?a=UVHEaeN1eoE&amp;u=%2Fwatch%3Fv%3D--X9zfgZtS0%26feature%3Dshare",
        "text": "",
        "created_utc": 1414926087,
        "upvote_ratio": ""
    }
]