[
    {
        "title": "Problem regarding bolometric magnitude and distance to a group of stars",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/353x9x/problem_regarding_bolometric_magnitude_and/",
        "text": "Hello everyone here!\n\nI'm posting because I'm taking Astrophysics of Stars as an elective. To put you in context I'm finishing my geology career, and doing my thesis.\nSo, I came to ask for help with some problems I need to know how to solve for Friday (please please please):\n1. A group of 10^5 stars, that are equal to the Sun, have a bolometric magnitude mbol1 = +5.0. What is its distance from Earth? Data: mbol(Sun) = -26.7\n\nSo I figure one has to do\nmbol - M = 5Log(d) - 5\n\nBut I don't know where to obtain M (absolute magnitude). I thought maybe it was 10^5 times the absolute magnitude of the Sun, but that gives a negative distance in pc. \n\nIf you know how to do this, I'll be forever grateful of your help.\n\n",
        "created_utc": 1430950120,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think is inside a black hole",
        "author": "Charlestrentm",
        "url": "http://www.reddit.com/r/astrophysics/comments/34zkh1/what_do_you_think_is_inside_a_black_hole/",
        "text": "Open discussion ",
        "created_utc": 1430861514,
        "upvote_ratio": ""
    },
    {
        "title": "Astrophysics - Wikipedia, the free encyclopedia",
        "author": "assho1e",
        "url": "http://en.wikipedia.org/wiki/Astrophysics",
        "text": "",
        "created_utc": 1430673430,
        "upvote_ratio": ""
    },
    {
        "title": "Orbital Mechanics book recommendations",
        "author": "asking_science",
        "url": "http://www.reddit.com/r/astrophysics/comments/34m1e7/orbital_mechanics_book_recommendations/",
        "text": "As the title suggests, I'm looking for recommendations for the most comprehensive, complete and advanced manual that I can get. Thanks in advance.",
        "created_utc": 1430563598,
        "upvote_ratio": ""
    },
    {
        "title": "R.I.P. Eric \"jizzbabyswag\" Westlake - Beloved Astrophysicist, Father, Husband, Friend, Mentor, and Moderator (1982-2015)",
        "author": "perciousangle",
        "url": "http://www.reddit.com/r/astrophysics/comments/34kfvs/rip_eric_jizzbabyswag_westlake_beloved/",
        "text": "To all my friends and fellow members of the astrophysics community, I've come to you today with some very unfortunate news. A man who was very dear to me, and who was a big part of this subreddit, has been taken from us. You knew him as a tireless, dedicated moderator, but he was more than just a moderator to me, he was a teacher and a great friend. He was the one who first opened my eyes about the wonders of the stars, who inspired me to follow in his path and become a great astrophysicist, just like him.\n\nYes, Dr. Eric Westlake, the man whom you all know as jizzbabyswag, died last week in what coroners are calling an apparent suicide. His last known communication was right here on this very subreddit. His friends and family all know how much this forum meant to him. Spreading knowledge and understanding of astrophysics was his great passion in life, and being a mod here meant so very much to him. As his longtime student and protege, I felt that I should be the one to break the news. My condolences to all of you. I know this isn't easy.\n\nBut along with this sad news, comes the bittersweet announcement that I will be taking his place on the /r/astrophysics moderating team. He stipulated in his will that I should be the one to take his place, as he always considered me his best and brightest student. Now I know that none of you know me yet (I'm new to this reddit website- still getting the hang of it!) but you'll all come to know me very well soon, and I hope to earn your trust and live up to the reputation that my good friend Dr. Westlake left behind.\n\nI'm very excited to become a part of this team, and my door is always open. If you ever have any questions or comments for me, please feel free to contact me. God bless.",
        "created_utc": 1430520489,
        "upvote_ratio": ""
    },
    {
        "title": "Theory - 4 dimensional rotation of our universe is uniformly accelerating",
        "author": "irondentist",
        "url": "http://www.reddit.com/r/astrophysics/comments/34d3v9/theory_4_dimensional_rotation_of_our_universe_is/",
        "text": "As our planet is rotating 3 dimensionally and revolving around the sun 3 dimensionally, our universe is rotating and revolving but 4 dimensionally in space time. When we look through our telescope beyond the earth's horizon, we fail to see the mass beyond it, as we look through our best telescopes through the universe's horizon, we will never visibly detect all the hidden mass and energy that's hidden beyond the 4 dimensional horizon. I propose that all this dark energy is simply gravity from the hidden (or dark) matter beyond this 4 dimensional horizon. The detectable dark matter and dark gravity may in reality be to the 4th power beyond the universe's horizon. \n\n As our planet have a fairly uniform rotational velocity and revolving velocity around the sun,  so too our universe but since it's 4 dimensional,  it's acceleration is uniform, not velocity. And I propose that the rotational acceleration of our universe is so uniform that eventually it's speed is at and beyond the speed of light. Beyond the universe's horizon,  it is timeless and going backwards in time to the point of what we would consider our universe's origin. ",
        "created_utc": 1430368321,
        "upvote_ratio": ""
    },
    {
        "title": "Just found this meme! (Will post more when I find it :))",
        "author": "TheEmbernova",
        "url": "http://i.imgur.com/3Tho9Al.jpg",
        "text": "",
        "created_utc": 1430261837,
        "upvote_ratio": ""
    },
    {
        "title": "Look! It's this sub!",
        "author": "[deleted]",
        "url": "http://imgur.com/h9cHI4m",
        "text": "",
        "created_utc": 1430195662,
        "upvote_ratio": ""
    },
    {
        "title": "[QUIZ] Which \"Big Bang Theory\" character are you? Very fun, and the results may shock you!",
        "author": "TheEmbernova",
        "url": "http://www.buzzfeed.com/iramadison/which-big-bang-theory-character-are-you",
        "text": "",
        "created_utc": 1430190721,
        "upvote_ratio": ""
    },
    {
        "title": "What the hell is going on?",
        "author": "Crux315",
        "url": "http://www.reddit.com/r/astrophysics/comments/342z2s/what_the_hell_is_going_on/",
        "text": "",
        "created_utc": 1430172594,
        "upvote_ratio": ""
    },
    {
        "title": "Mods are we being downvote brigaded?",
        "author": "TheEmbernova",
        "url": "http://www.reddit.com/r/astrophysics/comments/341zc5/mods_are_we_being_downvote_brigaded/",
        "text": "Hi I'm just making a post to voice my concerns about the voting patterns I've seen from some recent comments\n\nI've noticed that a lot of comments, especially the mods' get downvoted really quickly \n\nI've deduced that we're being downvote brigaded by /R/futurology so if anyone could tell me how to alert the reddit mods I'd appreciate it\n\n",
        "created_utc": 1430157462,
        "upvote_ratio": ""
    },
    {
        "title": "Am i smart enough to watch anime?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/341t0p/am_i_smart_enough_to_watch_anime/",
        "text": "What are some good anime schools with anime degrees? Please no answers about astrophysics only anime, after all this is the astrophysics sub",
        "created_utc": 1430154766,
        "upvote_ratio": ""
    },
    {
        "title": "20,000 Lightyears in 40 seconds.",
        "author": "TheGuyOfDoom",
        "url": "http://blog-off.co.uk/hubble-turns-25-way-celebrate/",
        "text": "",
        "created_utc": 1430143511,
        "upvote_ratio": ""
    },
    {
        "title": "Looks like the Hawkster has an answer for all you upset Directioners out there!",
        "author": "UNIVERSEnema",
        "url": "http://time.com/3836129/stephen-hawking-one-direction-zayn-malik-multiple-universes/",
        "text": "",
        "created_utc": 1430108574,
        "upvote_ratio": ""
    },
    {
        "title": "Question about speed of light observations",
        "author": "Farleyfan4life",
        "url": "http://www.reddit.com/r/astrophysics/comments/33v5v6/question_about_speed_of_light_observations/",
        "text": "Sooo if someone travelled faster than light, what is the theory for observations.\n\nI would imagine you would not see anything to the sides or behind as you are out pacing the light itself but looking ahead would things appear to move in fast forward over large distance as you are reaching the light sooner?\n\nJust something I was wondering yesterday.  Sorry if this is a common question.",
        "created_utc": 1430002386,
        "upvote_ratio": ""
    },
    {
        "title": "Where is all the dark matter?",
        "author": "flamethunder",
        "url": "http://www.reddit.com/r/astrophysics/comments/33t8ka/where_is_all_the_dark_matter/",
        "text": "So i was getting fucked by my midget dad while my mom was reading the krabby patty secret formula and i thought to myself, where is all the dark matter?",
        "created_utc": 1429962836,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of astrophysics animes should I start watching?",
        "author": "TheEmbernova",
        "url": "http://www.reddit.com/r/astrophysics/comments/33kxdd/what_kind_of_astrophysics_animes_should_i_start/",
        "text": "Looking to get my feet wet in astrophysics and I decided to do it through anime -- any recommendations? \n\nedit: what the fuck is wrong with you people? downvoting me for asking a question? this is why no one likes you guys you stupid fucks, only the mods were nice enough to thoroughly answer my question instead of downvoting it like you stupid crybabies ",
        "created_utc": 1429785731,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Can we have a sidebar for frequently asked questions?",
        "author": "SurlyDrunkard",
        "url": "http://www.reddit.com/r/astrophysics/comments/33i7zo/meta_can_we_have_a_sidebar_for_frequently_asked/",
        "text": "Most of the posts on this sub end up being \"Should I pursue astrophysics?\"/\"What school should I choose?\"/\"What jobs are there?\"\n\nCan we have these common questions on the sidebar with a guide to what the users here suggest? How does everyone else feel about this?",
        "created_utc": 1429729016,
        "upvote_ratio": ""
    },
    {
        "title": "Jobs in astrophysics?",
        "author": "the_life_is_good",
        "url": "http://www.reddit.com/r/astrophysics/comments/33fx4k/jobs_in_astrophysics/",
        "text": "I am headed off to college at the end of next school year, and before i decide between this and something in computers, I am wondering what careers are there in the field? Im open to just about anything.",
        "created_utc": 1429678342,
        "upvote_ratio": ""
    },
    {
        "title": "Which UC school for Astrophysics career path?",
        "author": "DarkPigNinja",
        "url": "http://www.reddit.com/r/astrophysics/comments/33flo2/which_uc_school_for_astrophysics_career_path/",
        "text": "I am working towards pursuing a career in astrophysics research; to that end, I was accepted as a transfer student into both UC Santa Barbara and UC Santa Cruz. I understand UCSC has a superb Astrophysics program, and UCSB has a superb Physics program. Would it be more prudent to enter the astro program at UCSC, or the physics program at UCSB with a minor or some background in astrophysics?",
        "created_utc": 1429671753,
        "upvote_ratio": ""
    },
    {
        "title": "My girlfriend needs help!",
        "author": "karmakiller69",
        "url": "http://www.reddit.com/r/astrophysics/comments/33e7o5/my_girlfriend_needs_help/",
        "text": "She is currently trying to calculate the distortion of iron emission lines near the event horizon of a black hole due to relativistic effects and I have no idea what to say to her. I had never taken that class so I have no understanding of it. Any insight,  any tips or hints would be immensely helpful and we would both be grateful.",
        "created_utc": 1429647764,
        "upvote_ratio": ""
    },
    {
        "title": "Are there books out there that aren't too advanced but do explain the concepts of common astrophysics topics??",
        "author": "NowAnActuary",
        "url": "http://www.reddit.com/r/astrophysics/comments/33aig9/are_there_books_out_there_that_arent_too_advanced/",
        "text": "i have a fairly solid mathematical history completing calc sequence and a bunch of other random classes like probability and linear algebra. But I don't have much of a physics background. I'd like to know more about topics like relativity, how black holes work, etc. Is it even possible to comprehend the ideas of Einstein and Hawkings work without graduate level math??",
        "created_utc": 1429571552,
        "upvote_ratio": ""
    },
    {
        "title": "Seven Out of Nine Space Stations Were Built by Soviet Russia",
        "author": "ankursinha03",
        "url": "http://guardianlv.com/2015/04/seven-out-of-nine-space-stations-were-built-by-soviet-russia/#5Gxyi68sy64ihs3z.16",
        "text": "",
        "created_utc": 1429479559,
        "upvote_ratio": ""
    },
    {
        "title": "This is possibly the greatest contribution I've seen from a mod.",
        "author": "viper1255",
        "url": "http://www.reddit.com/r/astrophysics/comments/32znif/is_the_theory_of_general_relativity_two/cqgeeti",
        "text": "",
        "created_utc": 1429414281,
        "upvote_ratio": ""
    },
    {
        "title": "Is the theory of general relativity two dimensional?",
        "author": "smechanic",
        "url": "http://www.reddit.com/r/astrophysics/comments/32znif/is_the_theory_of_general_relativity_two/",
        "text": "Every picture I see of an interpretation of the general theory of relativity appears to be two dimensional, as if a body is lying on a plane. Why isn't it three dimensional? Shouldn't a body be bending space around it in 3 dimensions? \n",
        "created_utc": 1429322446,
        "upvote_ratio": ""
    },
    {
        "title": "Insubordination; or, how we trusted you and we'll never make that mistake again",
        "author": "Gozdilla",
        "url": "http://www.reddit.com/r/astrophysics/comments/32w0q9/insubordination_or_how_we_trusted_you_and_well/",
        "text": "So we recently took on new people as mods in our team, looking to turn a new leaf and regain your confidence. Well, those people betrayed us immediately, trashing the sub and undoing all the hard work we'd done to get this place presentable. I cannot believe they would so utterly tarnish the very thing they claim to want to preserve. It's unconscionable!\n\nWe trusted you all. We wanted to make peace and make you happy. But you spat in our face while we were defenseless. Shame on us for ever believing you people could accept our apologies in good faith. You're a bunch of monsters!",
        "created_utc": 1429244562,
        "upvote_ratio": ""
    },
    {
        "title": "I make you a beautiful Space Theme and this is how you assholes repay me?",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/32vzvu/i_make_you_a_beautiful_space_theme_and_this_is/",
        "text": "You should all be fucking ashamed of yourselves. I do nice things and get treated like dirt. ",
        "created_utc": 1429244074,
        "upvote_ratio": ""
    },
    {
        "title": "Subreddit looks better, doesn't it? Pity I can't kick the shit mods and install good ones, but I've undone their crap.",
        "author": "stevesteve111",
        "url": "http://www.reddit.com/r/astrophysics/comments/32vxg2/subreddit_looks_better_doesnt_it_pity_i_cant_kick/",
        "text": "",
        "created_utc": 1429242649,
        "upvote_ratio": ""
    },
    {
        "title": "Guys, I think I found a new planet! It's even got two moons!",
        "author": "Gozdilla",
        "url": "http://www.reddit.com/r/astrophysics/comments/32v0sa/guys_i_think_i_found_a_new_planet_its_even_got/",
        "text": "[Here it is!](https://s-media-cache-ak0.pinimg.com/236x/8e/ff/6c/8eff6cff6c3282f8786ebd1e6775bc50.jpg)",
        "created_utc": 1429225414,
        "upvote_ratio": ""
    },
    {
        "title": "Dwarf planet \"Ceres\" sparks mystery",
        "author": "4amgine",
        "url": "http://www.cosmostv.org/2015/04/white-spots-on-dwarf-planet-ceres.html",
        "text": "",
        "created_utc": 1429159049,
        "upvote_ratio": ""
    },
    {
        "title": "I've been invited to join a research group at my University! [x-post /r/Astronomy]",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/32roh4/ive_been_invited_to_join_a_research_group_at_my/",
        "text": "Our research is on exoplanets. The specific purpose of the research is actually undetermined. Faculty members knew they wanted to do research with students in astrophysics, so invited six of us, and know that they think exoplanets are rad. Until we decide on a specific question we want to investigate, we each were assigned with different tasks in order to get a proper base of knowledge on the subject.\n\nMy particular assignment was to learn all about the data collected from the Kepler Space Telescope. What form does it come in, how is it gathered, how can we access it, what does it all mean, etc. Once this is done, along with everyone else's assignments, and it is all presented, we will begin research in the summer.\n\nSo, I ask you guys, where can I go to find this information? I know there is an FAQ that will certainly be helpful on the Kepler website. Other than this, what are some reccommended readings on the Kepler Space Telescope, its history and operation, maybe a summary of findings? How about more technical articles on the nature of the data?\n\nI will certainly do the work I need to do on my own, I only post this in case anyone is aware of a lesser known book or source I may refer to. Also, I wanted to share my excitment :P\n\nThank you!",
        "created_utc": 1429157192,
        "upvote_ratio": ""
    },
    {
        "title": "Stay tuned for fresh new space layout that isn't ugly and orange!",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/32r882/stay_tuned_for_fresh_new_space_layout_that_isnt/",
        "text": "",
        "created_utc": 1429148735,
        "upvote_ratio": ""
    },
    {
        "title": "How do you tell your friends and family that you are interested in astrophysics?",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/32qzth/how_do_you_tell_your_friends_and_family_that_you/",
        "text": "The other day I let a good friend of mine at school look through my class notes while we were studying for an exam, and he happened upon one of my doodles of the planet Saturn. I forgot it was in there and wasn't expecting anyone to ever find it. An honest mistake. He didn't say anything, but I know he saw it. I'm not sure what his feelings are on the matter, and to be honest, I'm a little nervous about bring it to his attention. Have any of you ever been put in a similar situation? Does anyone have any advice? I would hate to loose such a good friend over something I'm so passionate about.",
        "created_utc": 1429144523,
        "upvote_ratio": ""
    },
    {
        "title": "can anyone actually define what \"astrophysics\" is? is it even a real thing? how do we know it's not just made up like the bible?",
        "author": "jizzbabyswag",
        "url": "http://www.reddit.com/r/astrophysics/comments/32qpbe/can_anyone_actually_define_what_astrophysics_is/",
        "text": "as men of science, we should always remember to be skeptical",
        "created_utc": 1429139320,
        "upvote_ratio": ""
    },
    {
        "title": "BREAKING NEWS: HOT TWITTER FEUD BETWEEN NEIL DEGRASSE TYSON AND BILL NYE!! POST YOUR SUPPORT FOR #TEAMTYSON OR #TEAMNYE ITT",
        "author": "[deleted]",
        "url": "https://twitter.com/BillNye/status/588167980552445952",
        "text": "",
        "created_utc": 1429128706,
        "upvote_ratio": ""
    },
    {
        "title": "BREAKING NEWS: HOT TWITTER FEUD BETWEEN NEIL DEGRASSE TYSON AND BILL NYE!! POST YOUR SUPPORT FOR #TEAMTYSON OR #TEAMNYE ITT",
        "author": "jizzbabyswag",
        "url": "http://www.reddit.com/r/astrophysics/comments/32q1le/breaking_news_hot_twitter_feud_between_neil/",
        "text": "https://twitter.com/BillNye/status/588167980552445952\n\nEDIT: after the tragic cyberattacks of april 16, 2015, it no longer seems appropriate to engage in the kind of petty bickering that this thread encourages. it was started in the spirit of fun and lively competition, but now is no time for that. now is a time for remembering that astrophysics is a beautiful and spiritual pursuit that unites us all. mssrs tyson and nye are both pillars of the scientific community to whom we can all look for guidance and inspiration. so i'd like to take this opportunity to call on these two great men to bury the hatchet and end their ongoing feud, so we can all join together and remind ourselves what makes this community great.\n\n\npeace and blessings to you all #TeamTyson #TeamNye #TeamMutualRespect",
        "created_utc": 1429128631,
        "upvote_ratio": ""
    },
    {
        "title": "BREAKING: HOT TWITTER FEUD BETWEEN NEIL DEGRASSE TYSON AND BILL NYE!! POST YOUR SUPPORT FOR #TEAMTYSON OR #TEAMNYE ITT",
        "author": "[deleted]",
        "url": "https://twitter.com/BillNye/status/588167980552445952",
        "text": "",
        "created_utc": 1429127927,
        "upvote_ratio": ""
    },
    {
        "title": "Recently Became Very Interested in Astrophysics",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/32pizx/recently_became_very_interested_in_astrophysics/",
        "text": "Hey guys, I am wondering if you wouldn't mind helping me out.\n\nI am currently a sophomore in college, and I am a computer science and math major, both Bachelors of Science.\n\nWhen I was a freshman, I wanted to do engineering, but I did not do well in Physics I and II. Partially because of the professor, but also because I had never been introduced to vectors, or any sort of physics math before.\n\nHowever, I have aced all of my math classes thus far, including Calculus II and III, Linear Algebra, Differential Equations, and Discrete.\n\nRecently I have become extremely interested in astrophysics, and some part of me feels like if I would have waited to take physics my second year, I would have done much better.\n\nSo I guess my question is, is a physics undergrad required for someone who wants to work in the field of astrophysics, is there a demand for CS majors in the field?\nI just want to pursue a career in the field somehow, and am worried that the current degrees I am pursuing won't allow me to do so.\n\nI appreciate the advise!\nThanks!",
        "created_utc": 1429120352,
        "upvote_ratio": ""
    },
    {
        "title": "Any suggestions for a paper on a subject in cosmology?",
        "author": "eyeofthetiger11",
        "url": "http://www.reddit.com/r/astrophysics/comments/32ee2j/any_suggestions_for_a_paper_on_a_subject_in/",
        "text": "",
        "created_utc": 1428892807,
        "upvote_ratio": ""
    },
    {
        "title": "Does the moon orbit the earth or is it's main influence the Sun",
        "author": "danielbritton",
        "url": "http://www.reddit.com/r/astrophysics/comments/32bofo/does_the_moon_orbit_the_earth_or_is_its_main/",
        "text": "Astrophysics",
        "created_utc": 1428838348,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for a moon to orbit a planet more slowly than the planet orbits the system center?",
        "author": "MookVanguard",
        "url": "http://www.reddit.com/r/astrophysics/comments/325n1t/is_it_possible_for_a_moon_to_orbit_a_planet_more/",
        "text": "Is there any sort of dynamical system where you can have a body A orbiting B, which orbits C, but where the period of A around B is greater than the period of B around C? It seems impossible for hypothetical moons of planets in our solar system due to hill sphere calculations. I was wondering if it was possible at least theoretically in some scenario involving black holes and ergospheres or something.\nThe main reason I'm asking this is for a sci-fi/fantasy universe I'm writing, where the goal is to have a black hole that's prominent in the sky but goes unnoticed by medieval societies because it's, well, black. Like the rest of space.\n\nWould it be possible for a binary system of planets to each orbit at a radius similar to that of the hill sphere of their combined barycenter? The orbital period of the pair could hypothetically be long enough in that case.",
        "created_utc": 1428695752,
        "upvote_ratio": ""
    },
    {
        "title": "What kind of math is involved with Astrophysics?",
        "author": "AllThingsMustEnd",
        "url": "http://www.reddit.com/r/astrophysics/comments/322y24/what_kind_of_math_is_involved_with_astrophysics/",
        "text": "I am currently in Calc 2 at my university and some stuff goes over my head sometimes or is just hard to get down. I was curious what types of math (processes) are involved in Astrophysics. I really think it's an amazing thing but I'm worried the only math involved will be math I'm not good at. Thank you in advance!",
        "created_utc": 1428637390,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for a moon to orbit a planet more slowly than the planet orbits the system center? (copied from r/Astrophys)",
        "author": "MookVanguard",
        "url": "http://www.reddit.com/r/astrophysics/comments/3229he/is_it_possible_for_a_moon_to_orbit_a_planet_more/",
        "text": "",
        "created_utc": 1428624779,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the universe against me?",
        "author": "Sorryaboutthat1time",
        "url": "http://www.reddit.com/r/astrophysics/comments/320r3c/why_is_the_universe_against_me/",
        "text": "",
        "created_utc": 1428600679,
        "upvote_ratio": ""
    },
    {
        "title": "Planetary Bombardment",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/31xsca/planetary_bombardment/",
        "text": "So I have been reading recently about hypothetical weaponry, and came across the concept of Orbital Bombardment - that is, massive tungsten beams angled into position and allowed to re-enter Earth's atmosphere and plummet to the land below causing extreme devastation.  I was wondering, hypothetically speaking, what the effects on Earth would be if someone were to use something much larger, like a Comet for Orbital Bombardment?  I have no idea about this stuff, just very interested, and I figure ya'll are probably among the smartest subreddits on here.  Anyone have any ideas?",
        "created_utc": 1428537909,
        "upvote_ratio": ""
    },
    {
        "title": "How big could a star actually get?",
        "author": "paidenblood",
        "url": "http://www.reddit.com/r/astrophysics/comments/31xp17/how_big_could_a_star_actually_get/",
        "text": "I'm talking about undiscovered supermassive stars out in the universe. Is there a maximum* mass we estimate they can reach before something happens that causes it to not be a star anymore? Where did that number come from? What happens if a star were to surpass it? Also what is the smallest mass we think a star could be?\nThanks in advance, I tried to google this but I couldn't find anything worthwhile. ",
        "created_utc": 1428536346,
        "upvote_ratio": ""
    },
    {
        "title": "CERN Update: LHC Reboots With a Bang",
        "author": "ankursinha03",
        "url": "http://guardianlv.com/2015/04/cern-update-lhc-reboots-with-a-bang/#uVYQAf9yjkPdxx6P.16",
        "text": "",
        "created_utc": 1428340180,
        "upvote_ratio": ""
    },
    {
        "title": "Big Crunch to Be the Doom of Universe That Began With Big Bang",
        "author": "ankursinha03",
        "url": "http://guardianlv.com/2015/03/big-crunch-to-be-the-doom-of-universe-that-began-with-big-bang/#caItcF0fwtkCqeK7.16",
        "text": "",
        "created_utc": 1427769868,
        "upvote_ratio": ""
    },
    {
        "title": "Planet sized ball of iron - Molten or not?",
        "author": "TurboGFF",
        "url": "http://www.reddit.com/r/astrophysics/comments/30vhn0/planet_sized_ball_of_iron_molten_or_not/",
        "text": "If you have a planet sized ball of iron, roughly the size of the earth, will it be molten or solid?  ",
        "created_utc": 1427763977,
        "upvote_ratio": ""
    },
    {
        "title": "Help with counteracting pressure.",
        "author": "Quarter_Chubs",
        "url": "http://imgur.com/vCplapf",
        "text": "",
        "created_utc": 1427386797,
        "upvote_ratio": ""
    },
    {
        "title": "Binary black holes, extreme time wimey",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/30cf4f/binary_black_holes_extreme_time_wimey/",
        "text": "Hi, I'm new to this sub, but I feel this is the right place to ask. \n\nSo, I just watched a lot of Dr. Neil De Grasse Tyson. He mentioned in \"Cosmic Quandaries with Dr Neil Degrasse Tyson.\" that two black holes close to each other causes such ripples in space and time that if you take a certain path between them, you could actually end up travelling back in time according to Einstein's laws of relativity. \n\nIs this pushing Einstein to where his theory breaks apart, is there a miscalculation, or is it true that travelling back in time could be possible between two black holes? \n\nLink to video: http://m.youtube.com/watch?v=CAD25s53wmE\nBlack hole question is at 45:20",
        "created_utc": 1427348930,
        "upvote_ratio": ""
    },
    {
        "title": "Switching major from aerospace to astrophysics?",
        "author": "dakoman",
        "url": "http://www.reddit.com/r/astrophysics/comments/30agat/switching_major_from_aerospace_to_astrophysics/",
        "text": "\nMy question is simple. I wish to change my major from aerospace to astrophysics. I am on my 2nd year of college, so I have already taken 2 years of aerospace courses.\n\n\n\n1) Is astrophysics the \"philosophy major\" of the science world? In other words, are there jobs that I can get with an astrophysics degree?\n\n\n\n2) Have I simply wasted my time for 2 years? How do aerospace courses transfer to astrophysics courses? (I know this is school dependent, but in general)\n\n\n\n3) With number 2 in mind, is it too late for me to make the switch? I am going to community college, so money isn't a huge issue, but at the same time it is.\n\n\n\n4) Anything else I should consider about my situation?\n\n\n\nThank you all so much in advance.",
        "created_utc": 1427313804,
        "upvote_ratio": ""
    },
    {
        "title": "Atlanta Science Festival with Neil deGrasse Tyson",
        "author": "screamingexile",
        "url": "http://www.reddit.com/r/astrophysics/comments/30597l/atlanta_science_festival_with_neil_degrasse_tyson/",
        "text": "",
        "created_utc": 1427214079,
        "upvote_ratio": ""
    },
    {
        "title": "Restoring /r/astrophysics",
        "author": "screamingexile",
        "url": "http://www.reddit.com/r/astrophysics/comments/303gsd/restoring_rastrophysics/",
        "text": "",
        "created_utc": 1427169177,
        "upvote_ratio": ""
    },
    {
        "title": "who's your favorite character on big bang theory?",
        "author": "jizzbabyswag",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zin8e/whos_your_favorite_character_on_big_bang_theory/",
        "text": "personally, i'm a fan of sheldon",
        "created_utc": 1426715960,
        "upvote_ratio": ""
    },
    {
        "title": "The Discovery Of Galaxy X",
        "author": "[deleted]",
        "url": "http://yottanews.net/?p=9132",
        "text": "",
        "created_utc": 1426714174,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] If I somehow lost my space suit while on Mars, would I have enough time to masturbate to completion before I suffocated to completion?",
        "author": "MsOhHai",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zg782/serious_if_i_somehow_lost_my_space_suit_while_on/",
        "text": "Asking for a friend.",
        "created_utc": 1426669213,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] If I somehow lost on my space suit on Mars, would I have enough time to masturbate to completion before I suffocate to completion?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zg4h7/serious_if_i_somehow_lost_on_my_space_suit_on/",
        "text": "Asking for a friend.",
        "created_utc": 1426666252,
        "upvote_ratio": ""
    },
    {
        "title": "[Serious] If I somehow lose my space suit on Mars, would I have enough time to masturbate to completion?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zg43v/serious_if_i_somehow_lose_my_space_suit_on_mars/",
        "text": "Asking for a friend.",
        "created_utc": 1426665874,
        "upvote_ratio": ""
    },
    {
        "title": "just for the record!!!",
        "author": "UNIVERSEnema",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zeg1e/just_for_the_record/",
        "text": "",
        "created_utc": 1426630186,
        "upvote_ratio": ""
    },
    {
        "title": "ASTROPHYSICS ART THREAD",
        "author": "jizzbabyswag",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zdmgo/astrophysics_art_thread/",
        "text": "share all your favorite piece of space-related art here. SPACE ART ONLY. IF IT'S NOT ABOUT SPACE KEEP IT OUT OF THIS SUBREBBIT&gt;\n\nhttp://fc03.deviantart.net/fs70/f/2012/343/d/1/kirk_x_spock_through_glass_by_technoranma-d5nif2u.jpg",
        "created_utc": 1426617354,
        "upvote_ratio": ""
    },
    {
        "title": "A lovely example of Gravitational Lensing",
        "author": "TheGuyOfDoom",
        "url": "http://blog-off.co.uk/hubble-gravitational-lensing/",
        "text": "",
        "created_utc": 1426590890,
        "upvote_ratio": ""
    },
    {
        "title": "We're Sorry; or, Back to Basics",
        "author": "Gozdilla",
        "url": "http://www.reddit.com/r/astrophysics/comments/2zbriw/were_sorry_or_back_to_basics/",
        "text": "Boy, that was a wild ride, huh? Sorry about that. We on the mod team have decided this cannot go on any longer. We're an astrophysics sub, and anything else is just a distraction. From now on, any and all content outside of that focus is not welcome here. We wavered, but our resolve is clear now. We are sorry that you had to go through that dark period with us, but we will do our best to win back your esteem. Again, we apologize for our conduct in the past.",
        "created_utc": 1426574876,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: do other planets (either in our solar system or in general) or moons have plate tectonics, and if so are they similar to earth's at all?",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2z5un5/eli5_do_other_planets_either_in_our_solar_system/",
        "text": "",
        "created_utc": 1426454268,
        "upvote_ratio": ""
    },
    {
        "title": "Am I smart enough to do astrophysics?",
        "author": "HairySlother",
        "url": "http://www.reddit.com/r/astrophysics/comments/2z5qx7/am_i_smart_enough_to_do_astrophysics/",
        "text": "Hi, I am in my last year of school and I have to choose my college courses, I was considering astrophysics because I have always loved space and find it extremely interesting, I am only doing ordinary level mathematics (I am not sure what type of level that is in america or Britain, I am Irish) but I am doing Higher level physics. I am uncertain about my maths ability, I am afraid I will get into college and become overwhelmed. Also what are the job prospects for an astrophysics graduate, my parents are set on me doing computer science and so was I but I fear I might be coding uninteresting bollocks for the rest my life, If you could help me out it would be greatly appreciated. Thanks\n\nTLDR: Am I smart enough to do physics, what are the job prospects like",
        "created_utc": 1426452490,
        "upvote_ratio": ""
    },
    {
        "title": "Came here for astrophysics...",
        "author": "Damnaged",
        "url": "http://www.reddit.com/r/astrophysics/comments/2z4zyy/came_here_for_astrophysics/",
        "text": "",
        "created_utc": 1426439463,
        "upvote_ratio": ""
    },
    {
        "title": "My 7-year-old wants to be \"An astrophysicist who finds dinosaur bones in space!\" when she grows up. Recommendations?",
        "author": "cheappoet",
        "url": "http://www.reddit.com/r/astrophysics/comments/2y65cf/my_7yearold_wants_to_be_an_astrophysicist_who/",
        "text": "Good Afternoon Reddit,\n\nFor the last few years when someone would ask my daughter what she wants to be when she grows up she would reply, \"An astrophysicist\", and I've been able to find materials for her age group on astronomy. Though for the last few months, when asked what she wants to grow up to be, she now replies, \"An astrophysicist who finds dinosaur bones in space!\"\n\nI was hoping some of you may have recommendations for books (she reads at a 3rd grade level), films, or toys for her age group which relate to the following: astronomy, physics, astrophysics, paleontology, extraterrestrial life -- not UFOs or intelligent life -- but germs, microbes, et al., as well as any other materials you think would relate to her interest.\n\nThanks in advance!\n\nX-Posted: /r/astronomy, /r/astrophysics, /r/biology, /r/paleontology, /r/physics, and /r/space\n\nEdit: Also x-posted to /r/astrophys as recommended.\n\nEdit 2: X-posted to /r/astrobiology as well, per a recommendation.\n\nEdit 3: Third recommendation; x-posted to /r/LadiesOfScience",
        "created_utc": 1425673193,
        "upvote_ratio": ""
    },
    {
        "title": "Anime about space?",
        "author": "LITERALLYCHEERILEE",
        "url": "https://en.wikipedia.org/wiki/Planetes",
        "text": "",
        "created_utc": 1425407284,
        "upvote_ratio": ""
    },
    {
        "title": "Tsuma wa, uchū kūkan no uchū-sen ni eikyō o ataemasu ka?",
        "author": "gbfhi20",
        "url": "http://www.reddit.com/r/astrophysics/comments/2wlvce/tsuma_wa_uchū_kūkan_no_uchūsen_ni_eikyō_o/",
        "text": "",
        "created_utc": 1424478660,
        "upvote_ratio": ""
    },
    {
        "title": "Anime is gay as fuck and anyone who watches it has autism",
        "author": "[deleted]",
        "url": "http://www.reddit.com/r/astrophysics/comments/2wegh5/anime_is_gay_as_fuck_and_anyone_who_watches_it/",
        "text": "\n\nsee ya at /r/astrophys",
        "created_utc": 1424323737,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to this subreddit?",
        "author": "Javier_the_Janitor",
        "url": "http://www.reddit.com/r/astrophysics/comments/2v1wkg/what_happened_to_this_subreddit/",
        "text": "That anime thread, the picture up top, the \"rules,\" and whatever else is getting screwed over... \n\nSo before this gets deleted by a crazy mod, or whoever hacked their accounts... does anyone have any answers? Is astrophys the new legitimate astrophysics subreddit? \n\nThanks in advance",
        "created_utc": 1423275669,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about Career options in Astrophysics?",
        "author": "scianime4ever",
        "url": "http://www.reddit.com/r/astrophysics/comments/2uyn5l/questions_about_career_options_in_astrophysics/",
        "text": "[I made an account just to ask this as a 10th grade student as this sub really seems to help and explained a lot of questions I](http://i.gyazo.com/c8f8792f9e95f6afc0e972cf14f97de4.png) had.\n\nI'm currently a high school student and am really interested in getting a career in astrophysics in the future. I am constantly obsessing over space, stars, dimensions, etc. \n\nThe only thing is after searching, it seems quite a large amount of people who earn degrees become a professor or a teacher. This is something I'll simply never be able to do, due to my current situation[.](https://chrome.google.com/webstore/detail/reddit-enhancement-suite/kbmfpngjjgdllneeigpgjifpgocmfgmb) Will this get in the way of my path[.](http://i.gyazo.com/132f8c341ee4edbce74e56c87e13d596.png) Or is this really just a fact I'll have to accept and find another career path[..](http://i.gyazo.com/5be90d7f958cedf2531a2fa5ff2f4260.png)",
        "created_utc": 1423204917,
        "upvote_ratio": ""
    },
    {
        "title": "Why Do the Main Sequence Stars Have Similar Chemical Composition?",
        "author": "amber_01",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=18181&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1423108381,
        "upvote_ratio": ""
    },
    {
        "title": "Neutron Star Explosion",
        "author": "Griffinstorm",
        "url": "http://www.reddit.com/r/astrophysics/comments/2urx0w/neutron_star_explosion/",
        "text": "What would be the quantitative force of a neutron star's explosion if the forces sustaining it just disappeared? \n\nAnd also what if this explosion were to occur in close proximity to a black hole; would it have any measurable effect on the hole itself or the galaxy surrounding it?",
        "created_utc": 1423072000,
        "upvote_ratio": ""
    },
    {
        "title": "Structure of Relatively Accelerating Universe",
        "author": "amber_01",
        "url": "http://www.scirp.org/journal/PaperInformation.aspx?PaperID=43659&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1423028008,
        "upvote_ratio": ""
    },
    {
        "title": "Hubble Scientist Mario Livio: In an Immense Universe, Small is Significant",
        "author": "galacticpublicarchiv",
        "url": "https://www.youtube.com/watch?v=6yV1vyyQ9dM&amp;list=UUarOfCcpIblxSlNjJUPPqvg",
        "text": "",
        "created_utc": 1422909894,
        "upvote_ratio": ""
    },
    {
        "title": "Formula for age/luminosity relationship for our sun?",
        "author": "60secs",
        "url": "http://www.reddit.com/r/astrophysics/comments/2uhjqc/formula_for_ageluminosity_relationship_for_our_sun/",
        "text": "Is there a formula for predicting the change in luminosity and radius for a star as it ages? I'm interested in our sun, in particular. Application: I would like to be able to predict when the sun will melt the ice of Ceres and Europa.",
        "created_utc": 1422854321,
        "upvote_ratio": ""
    },
    {
        "title": "Gravitational Waves from Early Universe Remain Elusive",
        "author": "tecme",
        "url": "http://www.jpl.nasa.gov/news/news.php?feature=4469",
        "text": "",
        "created_utc": 1422797202,
        "upvote_ratio": ""
    },
    {
        "title": "Damping-Antidamping Effect on Comets Motion",
        "author": "amber_01",
        "url": "http://www.scirp.org/journal/PaperInformation.aspx?PaperID=41482&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1422598937,
        "upvote_ratio": ""
    },
    {
        "title": "Homogeneous Distances to Several Stellar Groups in the Second Galactic Quadrant",
        "author": "srp2014",
        "url": "http://www.scirp.org/journal/PaperInformation.aspx?PaperID=34807&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1422256961,
        "upvote_ratio": ""
    },
    {
        "title": "Peering into cosmic magnetic fields",
        "author": "Vailhem",
        "url": "https://www.llnl.gov/news/peering-cosmic-magnetic-fields",
        "text": "",
        "created_utc": 1422024006,
        "upvote_ratio": ""
    },
    {
        "title": "Three extremely luminous gamma-ray sources discovered in Milky Way's satellite galaxy",
        "author": "[deleted]",
        "url": "http://phys.org/news/2015-01-extremely-luminous-gamma-ray-sources-milky.html",
        "text": "",
        "created_utc": 1422009779,
        "upvote_ratio": ""
    },
    {
        "title": "A Synthesis of Fundamental Parameters of Spiral Arms, Based on Recent Observations in the Milky Way",
        "author": "srp2014",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=29430&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1421899317,
        "upvote_ratio": ""
    },
    {
        "title": "Approximate Kepler’s Elliptic Orbits with the Relativistic Effects",
        "author": "amber_01",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=29436&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1421649579,
        "upvote_ratio": ""
    },
    {
        "title": "Unsolved problems in the Big Bang model",
        "author": "nepali_keto",
        "url": "http://physicsanduniverse.com/unsolved-problems-in-the-big-bang-model/",
        "text": "",
        "created_utc": 1421261733,
        "upvote_ratio": ""
    },
    {
        "title": "Blazars",
        "author": "LiamOS",
        "url": "http://i.imgur.com/eVXToqf.png",
        "text": "",
        "created_utc": 1421248044,
        "upvote_ratio": ""
    },
    {
        "title": "How did the Universe evolve?",
        "author": "[deleted]",
        "url": "http://www.whatisuniverse.com/content/Cosmic%20Evolution/",
        "text": "",
        "created_utc": 1421174677,
        "upvote_ratio": ""
    },
    {
        "title": "ATTENTION",
        "author": "Fakelwr",
        "url": "http://www.reddit.com/r/astrophysics/comments/2s7ruv/attention/",
        "text": "",
        "created_utc": 1421102690,
        "upvote_ratio": ""
    },
    {
        "title": "[ask astrophysics] Given that life only uses one version of chiral organics (L-aminoacids and D-sugars) could the counterclockwise motion of our solar system affect the primordial molecules?",
        "author": "boffrey",
        "url": "http://www.reddit.com/r/astrophysics/comments/2s7mkh/ask_astrophysics_given_that_life_only_uses_one/",
        "text": "When the solar system was younger and Earth was forming from the disk of dust, could the debris and heating up chunks of matter containing organic precursors be biased by the counterclockwise motion of the solar system into one of the chiral conformations? Or more simply, can gravity in a tide-kinda way exert a clockwise force that stirs molecules within orbiting bodies over long periods of time, which would then shower into ancient Earth and seed it with already selected molecules that could spark life?",
        "created_utc": 1421100260,
        "upvote_ratio": ""
    },
    {
        "title": "Mass Limit of Neutron Star",
        "author": "amber_01",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=47120&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc﻿",
        "text": "",
        "created_utc": 1421032556,
        "upvote_ratio": ""
    },
    {
        "title": "What Happened Here?",
        "author": "Lodorenos",
        "url": "http://www.reddit.com/r/astrophysics/comments/2s2b06/what_happened_here/",
        "text": "Hey, I'm quite new to the field and was looking for a community to become a part of. What happened here? I remember it to be a respectful community of people who provided intelligent discussions on the various aspects of astronomy and the physics thereof. The stickied thread makes little sense and the subreddit style is quite out of place. The head admin seems to be MIA for the past 2 years and left... this? The rules are also quite off and some have little to do with the subject (\"This is a feminist and pan-africanist subreddit\"). If this is some joke by moderators turned sour, why? What's the point of having a subreddit if you chase off everyone who knows anything? Anime, memes, PAEC warning, wtf? Although I was never a part of this community earlier, I'm saddened to see a potential learning and knowledge sharing area become whatever this is.",
        "created_utc": 1420989056,
        "upvote_ratio": ""
    },
    {
        "title": "‘Iron Sun’ is not a rock band, but a key to how stars transmit energy",
        "author": "Vailhem",
        "url": "https://share.sandia.gov/news/resources/news_releases/iron_sun/#.VK9DqCvF89R",
        "text": "",
        "created_utc": 1420772313,
        "upvote_ratio": ""
    },
    {
        "title": "Black Holes—Information Models",
        "author": "srp2014",
        "url": "http://www.scirp.org/journal/PaperInformation.aspx?PaperID=39834&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=lc",
        "text": "",
        "created_utc": 1420680381,
        "upvote_ratio": ""
    },
    {
        "title": "Antigravity—Its Manifestations and Origin",
        "author": "Claire3652",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=36509&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=zc",
        "text": "",
        "created_utc": 1420612695,
        "upvote_ratio": ""
    },
    {
        "title": "For those who want to discuss astrophysics related topics without an asinine background.",
        "author": "jake__the__snake",
        "url": "http://imgur.com/a/dR8ch",
        "text": "",
        "created_utc": 1420597468,
        "upvote_ratio": ""
    },
    {
        "title": "What is negative energy? I researched it in the internet, but still I couldn't understand it. So, can someone please explain to me what is negative energy?",
        "author": "AhmedSamra7",
        "url": "http://www.reddit.com/r/astrophysics/comments/2rhvr2/what_is_negative_energy_i_researched_it_in_the/",
        "text": "",
        "created_utc": 1420532147,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Cosmic big Trip Just a Classical Wormhole Artifact?",
        "author": "Claire3652",
        "url": "http://www.scirp.org/Journal/PaperInformation.aspx?PaperID=5672&amp;amp;utm_campaign=reddit&amp;amp;utm_medium=zc",
        "text": "",
        "created_utc": 1420439685,
        "upvote_ratio": ""
    },
    {
        "title": "So this is what this place is for now, right?",
        "author": "mandelbrony",
        "url": "https://www.youtube.com/watch?v=Emi3gsMeDSU",
        "text": "",
        "created_utc": 1420264779,
        "upvote_ratio": ""
    }
]