[
    {
        "title": "(UK only) how long did it take for you to get your results back?",
        "author": "Latter-Meringue-7661",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11mflvg/uk_only_how_long_did_it_take_for_you_to_get_your/",
        "text": "just want to know other people’s experiences",
        "created_utc": 1678327592,
        "upvote_ratio": 0.99
    },
    {
        "title": "how long did it take for you to get your result back? (UK only please)",
        "author": "Latter-Meringue-7661",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11mfl2v/how_long_did_it_take_for_you_to_get_your_result/",
        "text": "just want to know other people’s experienced",
        "created_utc": 1678327534,
        "upvote_ratio": 1.0
    },
    {
        "title": "how long did it take for you to get your result back?",
        "author": "Latter-Meringue-7661",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11mfk2u/how_long_did_it_take_for_you_to_get_your_result/",
        "text": "just want to know other people’s experienced",
        "created_utc": 1678327464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this PDA or just plain old executive dysfunction/stubbornness?",
        "author": "WeiWeiSmoo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11mce2x/is_this_pda_or_just_plain_old_executive/",
        "text": "For as long as I can remember I’ve had difficulty “doing things I’m supposed to do”. \n\nIve always been a really sweet, affable, and people pleasing girl. But there are parts of me that would always disappoint and frustrate those around me, including myself. Examples include: \n\n- I’ve always struggled with homework my entire life even though I’ve always been a bright student. I could not force myself to do assignments, the only way I’d get them done (maybe) is if I was yelled at or if there was some social pressure that made me (like group projects, my personal hell). I remember often telling my mom frustratedly, “I can’t make myself do something I don’t want to”\n\n- I get really irritated or annoyed if someone tells me to do something in an authoritarian way. Especially if it doesn’t make sense or I view them equal to me. This has translated over into my work life and it’s why I’m now self employed. I was able to bury it and hold onto jobs for years, but eventually my mask would slip and I’d end up rage quitting. Or the anxiety and depression would be so bad that I’d have to leave. \n\n- I constantly feel like I have to assert myself with partners. For example my douchebag ex would tell me to stop eating if I was eating too many sweets. I would stare him in the eyes and continue devouring donuts even though I felt like crap after. If my husband reminds me to brush my teeth before bed, I’ll stubbornly refuse to even though I know it’s gross. \n\nSo what do you guys think? I’ve recently learned I’m autistic so this is all very new and fascinating to me (my special interest is psychoanalysing myself).",
        "created_utc": 1678319333,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Notion Template I created to help myself with masking while I was having a burnout. Incase anyone needs it.",
        "author": "elina116",
        "url": "https://i.redd.it/hy07q0cjolma1.jpg",
        "text": "",
        "created_utc": 1678318330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rehearsing dialogs",
        "author": "michelfmc30",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11m5sl6/rehearsing_dialogs/",
        "text": "I’d like to ask you guys how you usually rehearse dialogs. \nFor me it works kinda like a stimming. A situation pops-up inside my head and I just start imagining what I’m going to say,  and I normally pace around while I do it. I don’t sit in front of a mirror and start talking to myself. How does it work for you guys?",
        "created_utc": 1678304227,
        "upvote_ratio": 1.0
    },
    {
        "title": "executive dysfunction/PDA and being creative",
        "author": "Pristine-Ad-4082",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11m4vae/executive_dysfunctionpda_and_being_creative/",
        "text": "I’m a recently self diagnosed autistic with PDA and I’m realising now how much it prevents me from actually ‘doing the thing’ that creative expression requires - in this case all the steps involved in shooting a film on my own for a university project. my systematic brain knows exactly what I need to do but I get so frustrated being unable to take action. does anyone else struggle with this or have advice? :)",
        "created_utc": 1678302159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anxiety and impostor syndrome preventing me from asking for a diagnosis.",
        "author": "gamepab_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11m38ch/anxiety_and_impostor_syndrome_preventing_me_from/",
        "text": "I (15M) have been suspecting being autistic/asperger for months, and i think i identify with enough of the criteria for an evaluation being worth it. My father knows about my suspects and my mother doesn't and also she has an extremely steriotypical view of the issue (while im more functionating) so i don't know how she Will react. The thing is that every time i want to tell my father i want to get a diagnosis a Big anxiety comes in and i am very afraid of telling him. This anxiety usually comes with a lot of impostor syndrome where i think maybe my symptoms arent enough and that im exxagerating. \n\nMy problem is that in every situation i Kind of lose. If i tell my father he Will probably be supporting and convince my mother. The problem is the conversation would be akward (at least from my point of view) and i cringe to painful levels when i have to describe my feelings or mental state. Also for maybe 4 months  i Will be extremely nervous about the results, since the consequences of the diagnosis arent just a yes or no, but It would cost 600 euros to my parents, so if it's negative i would feel very guilty and like an idiot. If my mother knows about my suspects, she may not agree or think im exxagerating (although probably my father would still pay the diagnosis), if the result is positive she Will believe me and everything Will be fine, but there is a 30% chance im not autistic and i don't know what her reaction could be. \n\nSo basicly i have been weeks trying to find a good opportunity to tell my father and when i can do It i have a panic attack and quickly change theme. What do i do. The only person that can help me our of this situation is myself and i am too coward.",
        "created_utc": 1678298455,
        "upvote_ratio": 1.0
    },
    {
        "title": "teacher suddenly asking class to take off hats/hoods after 6 months.",
        "author": "Peach-Individual",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11lymb4/teacher_suddenly_asking_class_to_take_off/",
        "text": "I have curly hair, and I wash my hair on Sundays and Wednesday night. When it's Wednesday morning and it looks rough and I don't have time to fix it, I put a beanie on. It's become a routine where I ALWAYS wear a beanie on Thursdays and Fridays cus I didn't want to cut out beanies just cus of my hair so I wear it at the end of the week so it's fine if it gets messed up.\n\n\nAt the beginning of the year, I was worried teachers would complain, but I have a classmate who wears his beanie every day, and he has 2 out of 3 of the same classes as me. We're 6 months in, and our teachers or any other teachers have never had a problem. Recently one of our teachers asked a guy in the front row to take off his hood and then she looked at me and had me take off my hat and then she asked my classmate in the back to take it off and he mumbled something and she said it was out of respect he didn't take it off and kept his head down and rubbed it and she moved one. For the rest of class, I was unable to focus cus I wasn't expecting the sudden change and it was cold, which made my head cold, and I also wear headphones when I'm not in class and every morning I put on my hat I do it in a way so hair doesn't get in my way and I can wear my headphones over my beanie comfortably.\n\nI also wear my beanie when I'm having a bad day in general cus it just feels like warm pressure on my head. It made me more upset that we had to take it off, and our classmate didn't even tho it's \"all out of respect.\" We r literally wearing the same hat I don't get why we have to take it off, and he doesn't. At first I thought it was cus he questioned her so she backed off cus of \"pick ur battles\" but yesterday she asked another boy to take off his hood and he said \"but miss my hair looks really bad today\" and she said in a snarky way \"well I'm sure no one else here rlly cares\" and made him take it off. The guy who wears a beanie literally sits one person away from him, and she asks him a question about the topic like right after. I'm not trying to be rude, but this classmate's mom is a teacher at our school, and his dad is too, and that genuinely seems like the only reason he's getting a pass.\n\nI'm just wondering if there's anything I can do. I get genuinely stressed when I know I have her class cus of this. She's always getting us to peer marks and talk to our peers for assignments. These things stress me out cus she gives us a 5 min time limit, and I usually need to read the question a few times, and I'm holding my classmate behind by not working faster. I'm aware in the \"real world\" if I have a job with a dress code I might not get to wear a hat but the difference is I'll know that for sure and the rules will be the same for everyone. The last time me and my classmate didn't talk(we were paired up) we were both having a bad day, tired, we had a 2 hr lesson w her, and it was already 4:00 pm. She came up and got mad at us for not talking and said if we were in lower school, she would have given us a detention.\n\nI want to talk to her, but Idk if it's too much to ask or if she'll think I'm being disrespectful because I'm questioning her teaching. I'm genuinely trying to be respectful, and these things actually make it harder for me to focus. I was thinking abt fidget toys, but it's likely she'll say I'm being distracted by them and when a guy said he likes to keep a toy in his pocket she said it was for little kids. I also have a history as coming off \"disrespectful\" when I try to talk to teachers because they think I'm challenging them but I really am trying to make it sound like I'm not doing that. This is the only way I know how to talk to ppl, and they always think I'm trying to be confrontational or difficult when I'm really just trying to work out a solution that works for everyone.\nSorry if my sentence structure/punctuation is bad. Any advice for the situation?\n\n\nTLDR: After 6 months in school, our teacher is having us take off hats out of respect. While the rest of us have to follow the rules, she lets one kid get away with it. Not wearing my hat is making it almost impossible for me to focus in class. Advice??",
        "created_utc": 1678287872,
        "upvote_ratio": 1.0
    },
    {
        "title": "NOT complete but EXHAUSTIVE list of STIMMING",
        "author": "shutthefuckupgenius",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11lyiye/not_complete_but_exhaustive_list_of_stimming/",
        "text": "I found this list while researching more about stimming and wanted to share. \n\n(Here's the original: [https://www.mama5ocial.one/2022/03/15/lista-no-completa-pero-exhaustiva-de-stimming/#comment-258](https://www.mama5ocial.one/2022/03/15/lista-no-completa-pero-exhaustiva-de-stimming/#comment-258))\n\nAnything that especially resonates with you?\n\n**LIST:**\n\n*VISUAL STIMMING*\n\n* Watching the sun filter through a window (*I spend hours on that*).\n* Aligning objects\n* Finding patterns on tiles (or anywhere else) *(sometimes I make stories with those patterns, it's fun, especially when it's a party and you're already banned from using your phone because \"you should socialize more\"*)\n* Sorting objects by colors/shapes (*all the time! My candy has to be eaten in a certain order or else I won't enjoy it properly, obviously*)\n* Focusing and blurring the gaze (*my mom says it's disturbing*)\n* Stare at one spot and blur the rest (*preferably a specific color (yellow), but anything will do*)\n* Using glow sticks/other toys (*I love my glow bracelets! It's the best (and bearable) part of carnivals*).\n* Visual sensory toys\n* Looking at a painting (*not so much*)\n* Watching dust motes in the light (*ohhhhhhhhhhhhh, I could do that for hours, it's like a dance*)\n* Blinking rapidly (*or not blinking at all, there's no middle ground, ladies and gentlemen, people in general*).\n* Looking at shiny things (*my eyes are left with spots, but it's worth it*).\n* Watching satisfying videos (ASMR, kittens, people cooking...) (***KITTENS***).\n* Staring at lights or fans (*and following them until you get dizzy*).\n* Moving objects in front of the eyes (usually very close)\n* Looking at things from the \"corner of the eye\" (out of the corner of the eye)\n* Turning lights on and off (*drove my mom crazy with that when I was younger*)\n* Watching rain fall/watching a thunderstorm (*I* ***LOVE*** *rainy days*)\n\n*TACTILE STIMMING*\n\n* Hugging something or someone (*I live hugging my friends/family*)\n* Petting an animal (*my dog loves petting as much as I love petting him*)\n* Touching an object to feel its texture (*but when it's a bad texture tm, yikes*)\n* Touching objects in passing (the bark of a tree, a railing, the wall...) (*all the time*)\n* Touching hair (stretching it, rolling it, tucking it behind the ear, etc.) (*it's relaxing*)\n* Touching fingertips (with a pattern or without) (*tickles a little, doesn't it?*)\n* Touching the corners of the lips\n* Stroking lips with fingertips or tapping (*yes*)\n* Touching lips, biting lips or running tongue over lips *(I did that before I read that and then laughed at the coincidence*)\n* Touching a sensory toy (pop it, slime...) (*I have so many slimes and pop its, it's almost ridiculous*)\n* Scratching your head or any other part of your body (*scalp*).\n* Clenching and unclenching fists \n* Squeezing the button on pens (*drives everyone crazy for some reason, which I don't understand, why something so relaxing is so irritating to others?*)\n* Playing with jewelry (rings, bracelets) *(I wear a lot, especially rings, so I spend all day twirling them on my finger*)\n* Wrapping/twisting fingers around fabric, t-shirt straps or other (*long sleeves*)\n* Bumping wrists (as in clapping)\n* Pinching the tip of the nose, eyebrows, etc. (*sometimes*)\n* Bumping teeth together repeatedly (*oh yes*)\n* Rubbing hands against clothing or others (*the fabric of my jeans has the perfect texture to do that, then my hands have like electricity and it's so much fun*)\n* Squeezing your hands/fists (*great with nails that are a little long*)\n* Rubbing the palms of your hands/fingers (*it itches and tingles, but relaxes?*)\n* Playing with twisting a rubber band (*not so much*)\n* Playing with your fingers/hands (*and doing complicated dances with them at the same time*)\n* Splashing hands in cold water (*ugh, no, I hate cold water*)\n* Running your hand over your forehead (*once or twice maybe*)\n* Wiping your hand over your eye (squeezing it) (*no?*)\n* Rolling objects between hands (***YES***)\n* Braiding hair (*me, my friends, any hair that stands still in front of me will be braided, in exams, I used to do it on my friends' hair to relax and they would calm down too, which was a plus*)\n* Pretending to play an instrument (*air guitar, triangles, maracas, etc*)\n* Spelling with sign language (*I only know a few words, mental note, I'd like to learn more*)\n* Breaking leaves or pieces of tree bark while walking (*it's like leaving a trail of bread crumbs hahahahahah*)\n* Breaking into many pieces and/or folding sugar envelopes (*yep*)\n* Pulling out body hair (one at a time) (*painful but satisfying*)\n\n*OLFACTORY STIMMING*\n\n* Smell something repeatedly (*yeah*)\n* Smelling new (*it's such a good smell!*)\n* Smelling your pets (*especially if it's freshly bathed*)\n* Smelling your loved ones (*everyone smells different and their smell calms you down, my mom's/little brother's makes me fall asleep every time, my dad's makes me hungry, he always smells like some food I don't recognize haha*)\n* Smelling essential oils/ candles (*not so much*)\n* Using diffusers / incense (*a lot! my dad and I do it all the time and it makes my mom climb walls because she doesn't like the smell of incense, so now we do it when she's not home xd*)\n* Smelling the clothes you've washed (*ohhhhhh, I love the lavender smell of my freshly washed clothes*).\n* Using bath bombs (*I don't use, but I think I might*).\n* Smelling food (*if it smells bad I won't eat it*)\n\n*TASTE STIMMING*\n\n* Wearing chewelry (*I don't have any, I didn't even know it was a thing o: I should invest in some)*\n* *Eating something for the feel of its texture (texture is everything, if it doesn't have good texture, forget it, I'm not going to eat that*)\n* Sucking on the sleeves of t-shirts (*and nibbling on them, all my favorite sweaters have little holes in them from all the nibbling*)\n* Repeatedly eating/sucking/slurping on something (*definitely, pens, my fingers, fabrics*)\n* Eating something to taste it (*yes*)\n* Eating spicy/sour/ etc. food for the sensation it gives you (*sour yes, sometimes, but spicy is a big no no*)\n* Eating raw pasta (*then I regret it because it gives me a stomach ache)*\n* Eating play dough /wax/ paper or other inedible things (it stings) (*like so much paper my mom says I will grow leaves someday, play dough tastes weird*)\n* Thumb sucking/ hair (*all the time, really, all, the, time*)\n* Throat clearing/coughing repeatedly (*it's more the motion than doing it...not sure if I'm making myself clear*)\n* Running tongue over teeth (*yep*)\n* Grinding teeth (*I used to do it when I was a kid, not so much anymore*)\n* Eating very slowly (*ohhhh, this one, my younger brother and I are very slow eaters*)\n* Eating candy, lollipops, chewing gum (*keeping my mouth busy helps me think*)\n* Nail biting (*if I had a dollar every time I was told \"stop biting your nails,\" I'd be a multimillionaire*)\n* Eating the skin of fingers, lips, etc. (*my lips live peeling, my dad tries to stop me from doing it by giving me lip balms, but the taste just makes me eat them more lol*) (*my favorite flavor is blue raspberry*)\n* Biting the inside of my cheeks and sucking the blood (*more the little skin than the blood, but sometimes I get out of hand and end up with sores, I've been scolded for that a few times*) (*my mom is a dentist, so*)\n\n*AUDITORY/ VERBAL STIMMING*\n\n* Hearing/singing the same song/songs on loop *(I will definitely become obsessed with a song and listen to it on loop for days, the last one was Dark Paradise and its playback was constant for a whole week*)\n* Listening to a specific part of a song on loop (*Athena's part in My Goodbye from Epic The Musical*)\n* Listening to the sound of rain (*I play videos with that sound to sleep*)\n* Repeating phrases from movies /series/ mantras/ catch phrases (*ohhh, yeah. repeating dialogues is my thing*)\n* Repeating words (*I'll start repeating a word and then a sentence and it'll be an endless loop*)\n* Listen to any repetitive sound (***YES***)\n* Grunting (*especially if I'm feeling uncommunicative that day*)\n* Yelling (*not so much, talking very loudly yes, but not to the point of shouting, I think*)\n* Whispering / mumbling (*no?, I think*)\n* Whistling / humming (*yes, I hum all day long*)\n* Putting my ear close to the speakers (**NO**) (*I tried it once*) (*Never again*)\n* Turning on a household appliance to listen to it (*The sound of my laptop is comforting*)\n* Listening to music (at a very high volume) with headphones (*Hahahaha, definitely yes, everyone asks me if it doesn't bother me and I'm like \"No? If it bothered me I wouldn't do it\"*)\n* Snapping my fingers (*I can't snap my fingers, feel my pout from the screen, I never learned how, it's so hard*)\n* Count out loud (*and one, two, three, and one, two, three) (the waltz beat sticks with me for hours, I keep hearing my old dance teacher*)\n* Clicking your tongue (*with a rhythm, obviously*)\n* Recite something from memory (a poem, numbers...) (*there's a poem I learned when I was very young, like, 3-4 years old, and I still recite it, it's \" The Pink Slippers\" by José Martí*)\n* Drumming (*another thing that bothers others for some reason that I don't understand for the life of me*) (*I've been told that the sound is annoying but I swear I don't understand why*)\n* Listening to the sound of a seashell (*I have a lot of seashells, like, a lot, and hearing the sound of the waves is super relaxing*)\n* Listening to nature sounds (*minus crickets, I hate the sound of crickets/crickets*) \n* Beatboxing /rapping (*I can't do that TwT*)\n* Making beats with my fingernails on a surface (*yeah, another annoying sound for others, relaxing for me*)\n* Snorting (*not much*)\n* Pretending to tickle the other person but with \"tiki tiki tiki tiki\" sounds *(ohhhhh, I love doing that, tickling or just poking someone's cheek by making that sound is fun*) (*kids love it as much as I do*)\n\n*PROPRIOCEPTIVE/ VESTIBULAR STIMMING*\n\n* Jumping (*in the same place, small jumps when I get excited*)\n* Jumping rope (*I would do it, but my balance sucks*)\n* Use a balance board (*I repeat, my balance sucks*)\n* Shake my head sideways (***YES***)\n* Twisting and turning (*especially if it's a swivel chair, my mom uses one in her office and when she's not working I'm on top of it, twisting and turning wiiiiiiiiiiiiii, wiiiiiiiiiiiiiiiiiiiiiiiiiiii*)\n* Dancing (*I have three left feet and can't carry a beat even if it kills me in public, but I like to dance in private with impromptu moves, sometimes without music*) (*The times my mom has caught me cooking and moving to the beat of a music in my head are countless*) (*I die of embarrassment every time, because she just looks at me with an amused smile and it's embarrassing, people*)\n* Walking up and down the aisle (*especially if I'm studying*)\n* Flapping/flapping (*I get really excited and my hands can't help it, ok?*)\n* Moving feet, hands, etc. (sometimes in sync) (*or rather, almost all the time in sync and in rhythm with something*)\n* Walking on tiptoe, standing on the side of one foot or heel (*I love that, a lot, I do that for no apparent reason*)\n* Swinging (*not everyone?*)\n* Contract and relax some muscle (*ouch, no, it's painful, they always ride on top of each other and it's a pain to put them back in place*)\n* Rocking back and forth (*again, not everyone?*)\n* Shrugging shoulders (*if they get too tight*)\n* Using a weighted blanket (*I've never done that, as far as I can remember*)\n* Opening and closing doors (*nope*)\n* Hanging from places (***MONKEY BARS, MONKEY BARS***)\n* Laying face down on something (*in my bed, sometimes I wake up in that position, my mom just sighs, because my little brother and I do it and she's just resigned to finding us in the weirdest sleeping positions*)\n* Hitting your head (*or another part of your body) against something or with your hands (it hurts, don't recommend it*).\n* Running (*exercise, ugh*)\n* Spinning around in a chair with wheels (*I think I mentioned this already, but I LOVE doing that*)\n* Swinging on a pendulum (*yes*)\n* Shake your head to a rhythm (*hahaha, also yes*)\n\n*OTHER STIMMING / COMBINED*\n\n* Doodling (*if my notes don't have doodles/drawings, they are not my notes*)\n* Looking for patterns on tiles or any other object (*it's funny*)\n* Reading license plates and the like (*and forgetting them five seconds later but then you remember and start finding patterns and*)\n* Memorizing things (*you never remember what you need, but you remember that obscure fact you read at 4 a.m. about jellyfish*)\n* Playing an instrument (*I don't know how to play one, but I'd like to learn violin*)\n* Keyboarding (***YES***)\n* Painting (mandalas, patterns...) (*I* ***LOVE*** *it*) (*Seriously, mandalas are my life*) \n* Assemble something with legos (*My little brother and I have a huge bag of legos*) (*Technically, they are his, but I like them better, so he gave them to me and now they are ours*).\n* Using a stimming toy (example: anti-stress) (*Er, I've broken more than I should by squeezing or biting them too hard*)\n* Lying on the floor/cold surface (*especially if your brain is going too fast*)\n* Mentally counting/ mentally repeating things (*definitely yes*)\n* Crafts that require repetition/ patterns (crochet, knitting, bracelet making, macramé...) (*I love knitting*)\n* Collecting objects and sorting them, classifying them, observing them... (*organize my seashell collection in order of size/colors*)\n* Hatha yoga or any sport that requires repetition (*I like yoga, but I don't like to exercise, so it's something I do once in a while*)\n* Folding my ears in on themselves (*ohhhhhhhh, I used to do that all the time as a kid*)\n* Do stretching (*and rattle your bones, all my friends cringe every time I do that*)\n* Doing puzzles / jigsaw puzzles / rubik's cube (***YES, YES, YES***)\n* Read the same book/books over and over (*Guilty, I have my favorites*)\n* Shuffle cards, coins, etc. (*Cards*)\n* Popping bubble wrap (***PLOP, PLOP, PLOP***)\n* Doing sudoku, looking for patterns! (***ONE OF MY FAVORITE THINGS IN THE WORLD***)",
        "created_utc": 1678287659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Behaviors I’ve experienced over the years. Anyone else?",
        "author": "somehuman01",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ly2x6/behaviors_ive_experienced_over_the_years_anyone/",
        "text": "Hello, I was diagnosed ASD level 1 at around 24 years old. Below are some examples of repetitive behaviors I’ve experienced over the years. I’m just curious if anyone else has experienced anything similar. Fair warning some of these are very strange.\n\n1. At one point during my childhood I became “stuck” on the number 5. I would count to 5 repetitively.\n\n2. I kept getting caught counting to 5 so I then moved on to the number 3. I would count to 3, rub things 3 times etc.\n\n3. I don’t know how to articulate this one but I went through a phase where I would extend my arm straight out in front me and look at my hand/arm at weird angle and sort of extend/retract my neck. \n\n4. at one point I felt the need to always finish whatever I was doing by looking at my right hand and making a small “nodding” motion with my head almost like a twitch.\n\n5. Probably the most prevalent and long standing one. I rub my pillow case and sheets at night between my fingers to help me go to sleep. I have done this for about as long as I can remember.",
        "created_utc": 1678286551,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I suspect I have autism, is there any traits that you had that you did t know were signs of autism?",
        "author": "Swiftly_speaking",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11lomi8/so_i_suspect_i_have_autism_is_there_any_traits/",
        "text": "",
        "created_utc": 1678256909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neuropsych evaluation completed, but waiting on interpretation",
        "author": "aimlessly_driving",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11lo2f6/neuropsych_evaluation_completed_but_waiting_on/",
        "text": "I (34M) recently went through a second round of Neuropsych testing at Kaiser as during the first set of testing (in 2018), they didn't assess the Social and Emotional aspects as the psychologist was only authorized to perform testing to confirm my ADHD (inattentive presentation) diagnosis. As someone who was diagnosed later, I can look back on my childhood, and go \"yep, that makes sense now.\"   \n\n\nDuring this testing session, it was a lot more conversational with the psychologist, which was something that I wasn't fully expecting since the previous testing session was just one test, right after the other.   \n\n\nLater in the week, I received the raw evaluation report, which is still a bit confusing:  \n\n\n&gt;**Childhood Autism Rating Scale, Second Edition, High Functioning Version**  \n&gt;  \n&gt;\\[me\\] was assessed using the Childhood Autism Rating Scale, Second Edition, High Functioning Version.  The CARS-2, HF is an observational scale designed to assess the frequency, duration, intensity, and atypicality of behaviors that help identify individuals with Autism Spectrum Disorders.    \n&gt;  \n&gt;\\[me\\] earned a raw score of 24, giving him a t-score of 35 and placing him at the 7th percentile compared to other individuals with Autism Spectrum diagnoses.  This score places him in the 7th Symptoms of Autism Spectrum Disorder group.  These scores will be used to help inform the decision on whether \\[me\\] meets the DSM 5 criteria for an Autism Spectrum Disorder.\n\nI'm assuming for that particular assessment, my score places me in the minimal-to-no symptoms range?   \n\n\nThen, the report continues:   \n\n\n&gt;\\[me\\] is a 34 year old male who was referred for diagnostic testing by \\[psychiatrist\\] to rule out Autism Spectrum Disorder. Current testing and review of records suggests that \\[me\\] has High Average to Superior estimated cognitive skills that may be an  underestimate of his abilities. He has two PhD's, one in physics and one in Chemical Engineering, and is employed by the government. He is in a  steady long-term relationship and reports multiple long-term friendships. He  does struggle with reciprocal conversation at times, both upon report  and upon direct observation, but is able to easily have a four-point  conversational exchange. Some inconsistencies in eye contact resolved as  he became more comfortable during the evaluation. He has lovely,  appropriate high-level gestures but reports missing nonverbal cues. \\[me\\] does  have significant compulsive behaviors that he reports as well as some  minor sensory issues. However, no functional impairment is noted; he has  multiple and varied hobbies, a successful long-term romantic  relationship, friends, and employment. So while he has several symptoms  associated with autism spectrum disorder, his presentation is better  accounted for by his psychiatric diagnoses. A developmental disorder  diagnosis such as Autism Spectrum Disorder does not appear appropriate  at this time. Regardless, even if he were diagnosed, there are no  autism-specific services that would be recommended to Frederich at this time.   \n\n\nWhen the psychologist called to follow up, she mentioned that even though, on the whole, I would typically meet the criteria, its because I have a successful career and a long-term relationship that negates out the other elements. She also mentioned that because I'm fairly well integrated into society, there is no benefit to having a diagnosis, and under Kaiser Permanente's guidelines, there is nothing that could be done either way. But, she did tell me that it's up to the psychiatrist to formally determine it, so I'm a bit confused.",
        "created_utc": 1678255190,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I took the test again and this time I focused really good and answered the questions very well and took my time and some how it’s worse 😭😭😭",
        "author": "YaquiiKills",
        "url": "https://i.redd.it/4s86er9juhma1.jpg",
        "text": "",
        "created_utc": 1678253915,
        "upvote_ratio": 1.0
    },
    {
        "title": "A nice cubicle addition",
        "author": "Technical_Reward",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11lk9a1/a_nice_cubicle_addition/",
        "text": "This is definitely not an autism specific thing but with the widespread use of headphones and earplugs in our community I wanted to share this! (I also just really wanted to share in general 😊) My brother and I both are almost always wearing some form of headphones or noise dampening things at work and we also both have curtains hung up on the entrance of our high-walled cubicles. It's a constant problem of us not hearing people knock or speak to us, one time a coworker startled me so bad that I half-volume screamed.  But my brother learned about visual doorbells so now he has a little doorbell button on the outside of his cube that people can press to tell him they're there and it lights up all sorts of rainbow colors!\n\nNo loud noises, significantly less people startling him, all around its a really fun addition to his cube and a super helpful little tool!",
        "created_utc": 1678244368,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just told my sister I'm autistic.",
        "author": "No-Combination-1019",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ljskm/i_just_told_my_sister_im_autistic/",
        "text": "And I have no idea if it went well or not. I could feel myself getting gradually more emotional as the conversation went on and bless her she was non-judgemental and accepting but she doesn't think I have it. I only found out a week ago and my mind has been reeling ever since, first of all because the more I read about autism the more it resonates with my lived experience but my psychologist of 2 years didn't pick up on it until I told her that I thought I might be and after listing all of my symptoms and experiences she confirmed it. But if I've had it this whole time why didn't she notice it earlier? Am I that good at masking or am I just not autistic at all?\n\nAnyway it ended in me becoming more and more worked up on the inside and shutting down more and more on the outside. I just couldn't get my words out. I spent the drive home feeling really worked up that I had to yell and scrunch at my skin to try to feel better. \n\n\nI feel so fucking lonely right now. I don't know where else to turn to. I've gone down such a deep rabbit hole of research and reading about autism and for the first time I feel seen but also feel incredibly in denial about it all. And what's worse is that I work with my parents so they will KNOW that something is up with me but I don't know if I'm ready to have this conversation yet.",
        "created_utc": 1678243166,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm moving house and I'm really scared",
        "author": "critterinthedoorway",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11lhikc/im_moving_house_and_im_really_scared/",
        "text": "Hiya, so basically I still live with my parents and we're all moving house soon. So there's been a lot of changes already and it's freaking me out :'( like a few days ago my mum moved my wardrobe to the other side of my room, knocking all my stuff over, all of which is in a very specific order. Then a lot more stuff got moved in my room, some of which is now uncomfortably close to my bed and it's making me feel sick. My morning and nighttime routines consist of reaching in very specific places for very specific things, and now I can't do that and it's horrible and I can't cope.\n\nI also have this weird thing where I can smell if something in my room has moved and it makes eating or drinking in that room really uncomfortable. \n\nPlus, ever since the house move all kicked off, my symptoms of OCD have been gradually increasing so that's also terrifying me. I'm scared I'll finish this move off with a brand new illness.\n\nPlease give me sum advice or anything cus aaaa xP yours sincerely, I am laying in my bed with the uncomfortable feeling of dusty furniture moving residue which is driving my senses insaneeee",
        "created_utc": 1678237304,
        "upvote_ratio": 1.0
    },
    {
        "title": "I crave social connections but they feel \"wrong\" for some reason",
        "author": "JarJarJacobs",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ldthx/i_crave_social_connections_but_they_feel_wrong/",
        "text": "Bear with me, this is a bit of a long one.\n\nI desperately want to connect with other people, but something about actually *talking* just feels... wrong.\n\nI've had issues with my family, but I do love them, and I like the *idea* of spending time with them. But when I'm presented with an opportunity to hang out with them, my brain tells me to just sit in my room instead. Same with my friends, just to a lesser extent.\n\nWhen we're hanging out, things are great. I can carry a conversation and shoot the shit with my friends all night. But if I get a text from them on my own time, I'll usually ignore it for a few hours. Even if I'm just staring at a wall, even if I WANT to chat with them, something inside me says \"no. wait until it feels \"right\"\".\n\nThe biggest way this manifests is in my (non-existent) love life. It's weird- up until like 2 or 3 years ago, my entire life was focused on relationships, but I couldn't get them. I crushed hard on lots of girls in school, but I was an insecure asshole so that never worked out. Now, I actually have some opportunities to go on dates, and I straight up *don't take them.*\n\nI'm still not very good-looking, but I get a decent number of matches on dating apps. Problem is: I *refuse* to talk to them. Even if they message me first, I'll completely avoid replying due to some weird self-imposed pressure. I could match with someone who shares my interests, is gorgeous, and texts first, and I'd *still* just avoid talking to them at all cost.\n\nI've always been this way- I distinctly remember a cute girl asking me for a pencil in middle school, and I legit just said \"no\". I had tons of pencils, and I LIKED her, I just didn't want to engage. And now that I'm out of my edgy teenage phase, it's frustrating that this aspect of my personality is lingering.\n\nIt's like my body is an extrovert while my brain is an introvert. I crave physical closeness with others, I want to hang out and have fun with people- but my brain is constantly telling me that that's *not who I am.* People say \"it's fine to be reserved and quiet\", but I don't *WANT* to be reserved and quiet! I want to joke around, and walk around my house *looking* for conversations instead of hiding from them. I want to be excited by a match on Tinder, and not horrified that I now have a \"responsibility\" to take care of.\n\nIs this an autism thing? I feel like I'm a very social person inside, but there's this immovable piece of duct tape always covering my mouth. I sometimes have months where I'm on fire in this regard, but lately I've just been a total hermit with no desire to improve.\n\n*Addendum:* I'm going on a trip with a local filmmaking group next week. I committed to this trip because it's a fantastic opportunity, but now that I'm staring down the barrel of it, I'm worried. I'm afraid that I'll spend my entire time in a foreign country alone, actively shooting down attempts to chat with me.  I've had issues with booze in the past, so I can't even drink to give myself a little more social lubricant. What am I supposed to do?",
        "created_utc": 1678228588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal or am i autistic?",
        "author": "Cellist_5638",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ld479/is_it_normal_or_am_i_autistic/",
        "text": "Some of my days are very long and very tiring. I work at a pharmacy where there’s constant noises all day and you have to talk to lots of people (which takes so much energy). After work I have orchestra (it is something I been going to for a long time but I don’t really remember much from being a kid)\n Sometimes it’s fine and there no problem \nOther times it’s incredibly “uncomfortable”. When the conductor is not doing her thing and people practice their own things it’s so bad. There’s so many people practicing their own thing and it’s so many noises at once. Concentrating is also incredibly hard. I just sit there can’t focus and wanna run away hiding to somewhere less nosy. My leg bouncing too idk if that something or just a bad habit\nThen I can’t comprehend having conversation on my way home and have to sit with my headphones on because trains have too many noises. There’s always too many sounds at once like multiple people talking at once. \n\n\nIdk maybe I’m putting too much into this and it’s nothing. I’m not sure would love some help",
        "created_utc": 1678227047,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does autistic burnout feel like?",
        "author": "romainelettuce365",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11l9hqw/what_does_autistic_burnout_feel_like/",
        "text": "I've had an inkling that I've been experiencing that for the past few months but I'm not sure. I work a highly public facing job as a dental receptionist, and while I'm mostly able to keep it together at work, I come home drained every night\n\nluckily I have Thursdays and weekends off but even with those, I feel like I'm spending all of my free time recovering\n\nI think what mainly drains me is the nature of the job itself. The workload is reasonable, the environment is friendly and accommodating, and of course there's asshole patients but they're not super common. So, the things that drain me are all the sounds and lights, having to speak to people (including/especially my coworkers, who are all very nice but that makes it worse because that means they wanna talk all the time), having to mask my stims, etc.\n\nI don't know if this is just normal hating your job stuff that nearly everyone deals with nowadays (unfortunately) or if it's something different/more concerning",
        "created_utc": 1678219089,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone explain \"AA\"?",
        "author": "moemermccloud",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11l56ob/can_someone_explain_aa/",
        "text": "I know that it means \"actually autistic\", and I know it's in response to being spoken over and spoken for by NT peeps and pros.\n\nWhat I don't understand is why it's used in exclusively autistic spaces -  reddit, fb, etc groups \n\nWhat is the alternative when speaking in an autistic space? Why does that need to be specified in that context?\n\n\n(Also please know that I'm asking this honestly)",
        "created_utc": 1678209443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a sub like this just for ppl who suspect ADHD?",
        "author": "glowingstar444",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11kzf7v/is_there_a_sub_like_this_just_for_ppl_who_suspect/",
        "text": "",
        "created_utc": 1678195876,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't be fully independent",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11kz93w/i_cant_be_fully_independent/",
        "text": "I've found out that i need help in some aspectos of my life and i hate it, my mother raised me and y brother to always be self sufficient and never depende on anybody, she wanted us to be this way cause she worked all the day and couldn't take care of us, i know we all need help sometimes but i feel like i bothers everyone by telling them my problems, i can't help it, the kind of trouble i have are social, like, i can't go to the market alone or else i'll have a shutdown, i can't do taxes, i can't drive, i can't keep focused when people talk to me and all these things make me feel so helpless, my family thinks i'm just lazy and afraid of adulthood but i really can't do this things alone, it was a lot easier when i was at my hometown, my mother took me to the hospital and supported me when i got too nervous, she makes things easy, she doesn't drags me down with a lot of things to care for and that's what i need, someone who distracts me from my anxiety, not giving me more to think about.\nSorry, i feel like this is all over the place, i haven't been able to express myself with words lately.",
        "created_utc": 1678195426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any extroverted women with asbergers here?",
        "author": "5unbear",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ky0hy/any_extroverted_women_with_asbergers_here/",
        "text": "What was your diagnosis experience?",
        "created_utc": 1678192037,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend thinks he might be on the spectrum and sent me this",
        "author": "barelyillegirl",
        "url": "https://i.redd.it/m90ggafymcma1.jpg",
        "text": "",
        "created_utc": 1678190832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inappropriate laugh",
        "author": "PercentageInside5693",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11kskxw/inappropriate_laugh/",
        "text": "I have these moments of inappropriate laugh with my roomate anytime she interacts with me . I just cant stop laughing .  I dont have it with anyone except her particularly . Its not abour her or anything its about my nervous system . I think she hates me and I hate myself for that . I dont want to hurt her . I explained to her but I think she just find me weird . Any tips for avoiding theose types of awkward socials moments ?",
        "created_utc": 1678174020,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP! Did I do something wrong?",
        "author": "Expensive_Archer9686",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11klxdg/help_did_i_do_something_wrong/",
        "text": "Hello! I’m in a class where the main part of it is discussion and I we were talking about people having different narratives clashing. \n\nI got kinda tongue-tied since I get anxious when speaking and I was talking about how I grew up orthodox religious and how I came out of it not for religion (but clarified that I do respect religion but the culture around it I found misogynistic and racist in the communities I was in) and I was giving an example (as prompted) of how my mom (who is religious) and I tend to argue (and I said I could be snarky). \n\nMy professor just gave an awkward “thanks for sharing” after it was over and I’m afraid that maybe I talked to much or wasn’t clear or if I said something really bad?? We were running on not a lot of time so maybe it was just to move on but still…I hope I didn’t offend any of my classmates or shared too much or anything!! \n\nAny advice or comments would really help!",
        "created_utc": 1678154982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bug bites and sensory issues",
        "author": "Tea_Addicted_Artist",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11klw3r/bug_bites_and_sensory_issues/",
        "text": "Hello I have a question. My boyfriend is Autistic and can't stand bug bites but he as swarmed by a cloud of mosquitoes while on a walk. The itching is driving him bananas because he doesn't like things like lotion or sunblock on his skin. He also hates allergy meds because it fogs up his brain. What are some options that you find helpful in this situation?",
        "created_utc": 1678154889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend’s friend hurt my feelings by saying there should be a cure",
        "author": "mangoesandpeaches666",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11kf31v/boyfriends_friend_hurt_my_feelings_by_saying/",
        "text": "I hope this is an appropriate space to post this.  I’ve historically found this to be the most helpful autism-focused community on Reddit.  I am seeking help understanding/articulating my feelings regarding this situation.  For reference, I (NB19) have known I am autistic for two years and I am very open about it.  I love being autistic and feel it is 100% intrinsic to who I am.  My boyfriend(M20) is not autistic but understands autism and me in a way no other non-autistic person I’ve met has.  He is very supportive of my way of communicating/thinking and the struggles I face.\n\nBasically, I was meeting my boyfriend’s friends for the first time and autism came up in conversation (I was talking about my affinity for this subreddit, actually).  One of my bf’s friends (M20) asked if I thought autism was genetic or learned, and I responded that it is genetic.  Autism speaks’ search for a prenatal test for autism came up.  This friend said something like “you know it’s bad when even autism speaks wants it gone.”  He knew nothing about autism speaks previously, so likely assumed it is a positive organization run by autistic people.  I explained that it is a terrible organization run by neurotypicals who paint autism as evil.  He didn’t have much to say about this, but went on to say he thinks there should be a cure for autism.  He said he thinks it should be a choice made by each autistic person whether they follow through with it, but that many autistic people hate being autistic and deserve the choice to be neurotypical.\n\nI’m sure some autistic people do wish to change.  But I believe that the struggles of autistic people are simply a result of a lack of accommodations.  And despite the struggles I face socially and sensory-wise, and with meltdowns and shutdowns, I love the way my brain works.  I love being unique and I wouldn’t have it any other way.  I did express this sentiment.  I said I would rather struggle much more than I already do than be neurotypical.\n\nI wish to eloquently explain exactly why his statement hurt so much.  He didn’t outright say autism is bad or that he dislikes autistic people.  He said he thinks a potential cure should be a choice.  Probably some autistic people feel the same way.  But I feel his statement hurt me so much that I can’t even process or explain why it did.",
        "created_utc": 1678139065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else feel like this?",
        "author": "meduse5789",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11kecgr/anyone_else_feel_like_this/",
        "text": "Whenever I'm in the presence those I don't feel comfortable with (so basically everyone minus three people), I feel so, so uncomfortable. It's unbearable.\n\nIt's most prevalent when I'm sat in class. I'm in a constant staring contest with my laptop screen so as to avoid making eye contact with human beings, but just being around them sends all sorts of weird sensations pinging through my body. \n\nIt feels like my skin is crawling. That's the closest description I can give. \n\nI absolutely hate it.\n\nMy facial muscles also tense up. I never know what to do with them, when to smile, when it's weird to do so, when to nod in acknowledgement to the professor's questions. I'm always thinking to myself \"Oh, for fuck's sake. What atrocious facial expression are you pulling now?!\". \n\nPretty sure I constantly have a concerned/stressed look on my face after one recent anxiety loaded run-in with some girls I haven't seen in months. I didn't notice them at first, as I was spaced out (typical) and trying to grab food as quickly as possible. I didn't recognise their faces at all - it's always a blur to me. \n\nWell, one of them waved her arms in front of my face, smiling but also looking a bit confused (no wonder). I was overwhelmed and the emotion on my face was probably as clear as day. She then proceeded to ask, \"are you okay?\" with a slightly concerned and bewildered tone. Those three words were enough confirmation that I must look so obviously uncomfortable out in public. The other two just sort of kept looking at me, maybe wondering what was going on, lol.\n\nIn class, I'll also force myself to briefly look up at the professor, to show I am being attentive. They look back at me, and I look fleetingly to hold my gaze briefly to note their reaction. Then I'll think, \"They're definitely wondering what is wrong with me right now and my presence is probably making them uncomfortable.\"\n\nI try to make my physique look as 'normal' and socially acceptable as it can be - not fidgeting, no desperate attempts to fix my uncomfortable clothes, no bad/strange looking posture. I also found myself observing another students and how their eye contact was. From that, I learned that I was the only one with my gaze nearly permanently lowered. I must have looked ridiculous.\n\nAlso, omg, I wanted to ask something else. I'll often get these random body jolts in class/during lectures, and sometimes the professor notices. I can be sitting in a chair, and then my whole upper body sort of jolts forward out of nowhere? Or my legs twitch? It's like I have energy buzzing around my body and I'm trying my best to suppress it.\n\nAre these things common in autism? Is there a specific name for this 'skin-crawling' phenomena, or is does it likely come down to sensory overload?\n\nThanks for reading.",
        "created_utc": 1678137497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't fill in the forms for my ASD/adhd assessment...",
        "author": "Matrixblackhole",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11kdqr3/cant_fill_in_the_forms_for_my_asdadhd_assessment/",
        "text": "The irony. \n\nI got a message a few days ago that I and a family member or someone that knows me well needs to fill in a some forms before I can have my combined autism and adhd assessment.\n\nThe only thing is though they're over 25 pages long! I goy given one, and I'm asking my mother to do the other one but the questions are basically identical.\n\nI have really bad dyslexia and can only type things somewhat accurately using specialist software provided by my university to get things done. So totally overwhelmed by this. I've a good mind to not fill in my forms :( it's too big and long.",
        "created_utc": 1678136241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need for participants: autism research / Only in french",
        "author": "clairegltps",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11k95vi/need_for_participants_autism_research_only_in/",
        "text": "I am a student in Master 2 Clinical Health Psychology 👩‍🎓\n\nI am asking you today to help me with scientific research on ASD. We're interested in the differences in expressions of the disorder according to gender ! 🚺 🚹\n\nIn the end, the goal is to develop adapted psychological treatments \n\nIf you are over 18 years old, french talker, you can participate by answering this questionnaire (10 minutes): [https://sphinx-campus.com/d/s/5id83u](https://sphinx-campus.com/d/s/5id83u)\n\nThis study is supported by researchers from the Institut Catholique de Toulouse (CERES laboratory). Your participation is completely anonymous.",
        "created_utc": 1678127455,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend made a comment how someone's haircut \"makes them look like you have to be extra friendly towards them\" referring about autism and now I can't look at my friend the same way",
        "author": "Positive_Market_4324",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11k529c/my_friend_made_a_comment_how_someones_haircut/",
        "text": "I didn't say anything but in my head I keep thinking everytime I talk to this person they always changed the way they talked to me and minutes later talk to our other friends in a normal tone, like overly excited. Maybe I'm dramatic or looking at it in a wrong way but my stomach dropped when I heard him say that like something clicked.",
        "created_utc": 1678122782,
        "upvote_ratio": 1.0
    },
    {
        "title": "trying to get tested and need advice",
        "author": "ggukyuns",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jzi8b/trying_to_get_tested_and_need_advice/",
        "text": "\nhello all, everyone in my (22f UK) life including myself suspects i have autism and has done since forever basically. my therapist sent me the aspie test that a lot of people use when getting diagnosed and i got 171/200. i tried to get it looked into last year but they basically told me i was just depressed and anxious. a year later, my mental health is fine and i haven’t changed (obviously). i have an ocd diagnosis already and several family members are autistic. i’ve booked another appointment but i’m worried i won’t be taken seriously again as many autistic/neurodivergent women aren’t. does anyone have any tips so i can actually get referred and get the answers i need? i’m going through the nhs so it’s going to be a tough one. i don’t even care if it turns out i’m not autistic, though i’d be surprised. i just want to be listened to lol",
        "created_utc": 1678110707,
        "upvote_ratio": 1.0
    },
    {
        "title": "My name is Adam Kulper I have Autism I into Car vehicle combat .",
        "author": "Additional_Chard_935",
        "url": "https://www.reddit.com/gallery/11jv4ja",
        "text": "",
        "created_utc": 1678098512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else only have empathy for fictional/imaginary people?",
        "author": "cistvm",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jqbz5/does_anyone_else_only_have_empathy_for/",
        "text": "I've been thinking about empathy lately and how to tell if i experience it and I'm starting to think that generally speaking, I don't have the literal \"feel others emotions\" or the \"know what others are feeling\" type empathy except for when it comes to fictional characters which who's emotions i can definitely feel sometimes. I also will think in their voices or just in general feel in their head space sometimes. Not for every character, but enough I noticed the trend. Does this sound like an autistic thing or am I over thinking? I know low/no empathy is a common trait but idk if it counts if i can randomly have really strong empathy for characters. I really don't think i've ever experienced empathy in the same way for real people",
        "created_utc": 1678082830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else only for fictional/imaginary characters?",
        "author": "cistvm",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jqb6i/does_anyone_else_only_for_fictionalimaginary/",
        "text": "I've been thinking about empathy lately and how to tell if i experience it and I'm starting to think that generally speaking, I don't have the literal \"feel others emotions\" or the \"know what others are feeling\" type empathy except for when it comes to fictional characters which who's emotions i can definitely feel sometimes. I also will think in their voices or just in general feel in their head space sometimes. Not for every character, but enough I noticed the trend. Does this sound like an autistic thing or am I over thinking? I know low/no empathy is a common trait but idk if it counts if i can randomly have really strong empathy for characters. I really don't think i've ever experienced empathy in the same way for real people",
        "created_utc": 1678082762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whenever I am dancing in a club with a group of people I gradually get pushed out of the circle??",
        "author": "LordOf2HitCombo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jneob/whenever_i_am_dancing_in_a_club_with_a_group_of/",
        "text": "First of all, I want to mark this as 'Is this a thing?' cause I've never really heard anyone mention it, and honestly have no idea if it is related to autism. Furthermore, I know this is really random, specific, and perhaps insignificant, but I've noticed that the thing I described in the title of this post has been occurring with a curious consistency and on different occasions.\n\n\nIt's one thing if I go out with my close friends, but if I am in a crowded club with people I only kind of know (and the others' relationships are around that same level, it's not like I am intruding in a close-knit group), the shifting of the \"circle\" we are all dancing in inevitably leads to me being blocked. I hope this made sense, but if not, let me rephrase it: you know how in a club you might dance in a circle with, say, 5 other people, everyone is shimmying, turned towards the center, there is some interaction... And then people will move around a bit, maybe another club goer might want to squeeze past, or the whole circle shrinks a bit because the place is getting more crowded... Well, I feel like I am always that sucker who in these events is bound to have his \"circle neighbors\" backs turned on him, effectively blocking him from actually being part of the circle. On my part, I always pay attention that whoever is a part of the group is not staring at my back while the rest of us are vibing, and I get a bit frustrated when, for the umpteenth time, I get excluded from the group and no one (or at least those \"considerate\" people next to me) bats an eye. This is not really an issue when I am with my close friends, as I mentioned, but in motley groups it has happened more times than I could ascribe to pure chance. I don't know if this is some undiagnosed autism in me speaking, but it feels sucky and it upsets me to be the odd one out in these situations, as I feel like I am doing something wrong. I don't think my dance moves are outrageous and disruptive, and, on the other hand, I am also not a statue who is ruining other people's fun by standing straight, a broom handle poking out of my butt. So I don't understand how and why this happens, except I know I am not assertive enough to push my way back in until there is enough space again or someone else moves, which I also find a bit ridiculous to have to do cause I wouldn't let a person next to me basically look from the outside while dancing alone (well, somewhat alone), while everyone else is dancing in a circle, which is exactly what happens to me.",
        "created_utc": 1678074331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music and possible relations to autism?",
        "author": "neurospicysillyguy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jhgtp/music_and_possible_relations_to_autism/",
        "text": "Hi, I have such a weird (positive) relationship with music. I know I was diagnosed with ADHD in high school but I think there's more to it reflecting back on my life. but I'm here about my relationship with music. I am deeply connected to music, I love it, listen to it every day. But I have certain ways of listing to music. I have to have headphones in, looking upwards, and twisting side to side, it's almost like a stim? I also always sing or hum, I can't listen to music quietly. I never listen to like random playlists, I either have to listen to stuff by the same artist, same genre/sounding music, or by how the beat is whether it's happy, sad, angry, or whatnot. and if I am listing to stuff on shuffle (which it's usually radio or my partners music) and if one of my favorite songs comes on I HAVE to stop everything I'm doing and listen/sing to it with all my focus. Just a second ago one of my fave songs by my all-time favorite artist came on and I kept on being pulled back and forth for people in the household and I said multiple times can I PLEASE just listen to the song real quick and they wouldn't let me. I ended up getting so frustrated and starting flailing and crying and freaking out and I'm getting called dramatic and a baby. I know that's not normal but it just happens so often. Or when my partner leaves their music running it drives me crazy bc what if they miss one of their favorite songs???? it's so weird that I react like this. But there's a lot more to my questioning of autism than just this but this is one of the bigger things I've noticed that seem similar at least with the little meltdown I had.",
        "created_utc": 1678058760,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a meltdown if my sibling starts to like things that I like?",
        "author": "anonyonymous",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jfddg/i_have_a_meltdown_if_my_sibling_starts_to_like/",
        "text": "I have multiple special interests and just interests and favourites in general but if my sibling starts to like or buy the things I like then I have a meltdown. I don’t know why. I was just wondering if anyone else experiences this. I am constantly worried that they will start to like specific shows, movies or music that I like and if they do start liking or showing an interest in them I have quite bad meltdowns that can happen several different times over a course of many days. I recently had a meltdown because they started listening to one of my favourite musicians. \n\nDoes anyone else have issues with this?",
        "created_utc": 1678053835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Celebrities who REFUSE to Declare Their Autism!",
        "author": "Usual_Ad_730",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jda2d/celebrities_who_refuse_to_declare_their_autism/",
        "text": "Does anyone else get annoyed by celebrities who are VERY OBVIOUSLY autistic, but refuse to say it?\n\nI mean, why?  You are millionaires, if not billionaires.  I'm looking at you Mark Zuckerberg.\n\nWhat do you have to lose?  You could afford to not work for literally the rest of your lives.  There is quite literally NO reason not to, and yet they don't.\n\nI am thinking of people like:\n\nBill Gates\n\nMark Zuckerberg\n\nEtc.\n\nI have actually been re-watching the Flight of the Conchords stand up, and OMG Jermaine Clement has GOT to be autistic.  I mean, it is in the jokes.  All of the jokes are about social awkwardness, and it works because he can relate to the audience, but still.\n\nIn a bitter pill of irony, Stephan Merchant (the South English Comedian) actually got in trouble for BASICALLY admitting to his autism:\n\nCommenting on a character he wrote for a tv show, he said (I'm paraphrasing): \"Yeah, I wrote the character as a socially awkward autistic guy.\"\n\nAnd apparently our community was really offended by this statement.\n\nFirst of all, why?  We are socially awkward.  That is like the whole apple.  Where is the insult?\n\nAlso, what?  He is basically coming out and saying he is autistic, without saying he is autistic.\n\nI mean, watch any interview with the man.\n\nHe is autistic as fuck!!!",
        "created_utc": 1678049341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not autistic but in an autistic friend group where they all keep insisting that I am autistic when I'm not. How best should I convey my annoyance at this?",
        "author": "Volovolvo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11jc89r/not_autistic_but_in_an_autistic_friend_group/",
        "text": "I'm decently confident I'm not autistic, only really sure I have anxiety and *maybe* ADHD but I'm doubting myself on that. My autistic friends tend to be much more understanding in general hence why I hang around them a lot. Overall, they're just a really nice set of people to hang around with.\n\nOnly issue is, as of recent, they seem to havr some weird unending confidence I'm autistic. I could do something as mundane as asking someone if they're joking or not and they'll go \"Oh, well Volovolvo, not being able to understand jokes is a sign of autism!\" even though it's literally just one instance of someone's sarcasm genuinely being believable enough. They've also encouraged me to do numerous online tests in the past, and the results have always been 'You don't have it' but they'll say I did the test wrong, I was biased, I was lying, etc.\n\nGiven that I know they might not understand how much this is getting on my nerves, does anyone know how best to approach them about it in the right way to get them to stop and to understand that I'm just not autistic? I don't want to seem confrontational about it but the insistence of it is just getting to be a bit much. I figured that other autistic people would probably know how best to approach the situation here.",
        "created_utc": 1678047871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latest Blog Entry: \"Lock &amp; Key\"",
        "author": "KingRandor82",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11j9yvc/latest_blog_entry_lock_key/",
        "text": "[https://gettingrealwithautism.wordpress.com/2023/03/05/lock-key/](https://gettingrealwithautism.wordpress.com/2023/03/05/lock-key/)\n\n&amp;#x200B;\n\nIn this entry, I discuss how we're on a mental frequency intended for synchronicity and harmony, but are dealing with a world that's.....well *not* on that frequency.",
        "created_utc": 1678045384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this sound like PDA or something else?",
        "author": "lilblu87",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11j7ice/does_this_sound_like_pda_or_something_else/",
        "text": "I cannot figure out why I am feeling the way I do. I know I shouldn't be behaving or feeling this way, but I can't seem to help it.\n\nThis is most noticeable in a video game I play online with other people (strangers). I'm excited to play, I join the server and wait in the lobby for the next game to start. Then when the next game starts I start feeling irritable. Then I start feeling like I don't want to be there, like I'm bored and want to quit. This takes place within the first two minutes of the game.\n\nIf I feel unproductive in the game or if something triggers me like an extra person joining mid-game, I'm highly likely to just quit.  I don't understand why I feel this way. The fact that I'm fine until the game starts is disturbing to me. Originally I thought it was from social anxiety disorder, and maybe it originally was, but now I don't know.\n\nI've noticed that I've been increasingly stressed out and maybe OCD in the game (I do have OCD). I'm getting super anal about the teams being fair and balanced even though these are casual games. I freak out if I think I might lose, but I believe this is related to social anxiety somehow. I don't always feel this way, only with certain players. I do think I feel better, less irritable playing later in the day such as after dinner (after 6 pm). People are usually done playing by 8 pm, sometimes as early as 7 pm.\n\nI don't understand my own feelings here. I can't figure out why I'm feeling this way.",
        "created_utc": 1678042258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being friends with neurotypical people is so exhausting (ramble)",
        "author": "Hour-Foundation-767",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11j27se/being_friends_with_neurotypical_people_is_so/",
        "text": "It is so tiring when they give \"hints\" and then get upset when you don't see or follow them instead of being direct or when they have an issue with you, they don't tell you what specific things to work on so you can be a better person for them. I also find it more awkward when I randomly drop facts about random shit that interests me and they're like \"ok??\", like I know it's something I shouldn't feel upset about but I still feel upset about it anyway, it just stings a little you know?",
        "created_utc": 1678035685,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you know if you're going non-verbal?",
        "author": "justanotherhuman255",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11j1qlp/how_do_you_know_if_youre_going_nonverbal/",
        "text": "19f. I have this thing (since childhood) where I often have a reluctance to talk or use words. If my mother were to walk into my bedroom to ask me a question, I'd always respond with sounds like \"mmhm\" for yes or \"mm-mm\" for no. There were many attempts to get me to use proper words, none of which led to much change. Whenever I did speak, I felt like I was either really annoyed by it, or forcing words out of my mouth, or both.\n\nI also have something similar with my boyfriend. Whenever I'm tired or overwhelmed, I often find myself using mouth noises or babbling when I'm alone with him. If he were to ask me something or try to start a conversation, I could quite easily answer with words (I'm more comfortable around him than my mother). I don't feel burdened by it, it just isn't something that comes naturally or instinctively to me unless I'm asked of it.\n\nCould this be somewhat of an example of what people mean when they talk about going non-verbal? Or is it something else? I know that anyone can have trouble talking when they're tired, so how is the line drawn between NT and ND?",
        "created_utc": 1678034852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always targeted / kindness taken advantage of - how to protect myself?",
        "author": "InvincibleSummer_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11j0bld/always_targeted_kindness_taken_advantage_of_how/",
        "text": "I (24f) have been in a lot of bad situations (including with older men) because I cannot read people's intentions but I'm getting better at pattern-matching. Am finding my best support from unexpected places, like my plush friends. But people always see and take advantage of my kindness. My therapist describes it as 'when someone steals a bike just because it's left unlocked'. I do not want to be a target anymore, because it drains a lot of energy.\n\nHow can I protect myself better? I'm working on self-esteem and standing up for myself. I know the patterns but when I am in the situation it's still hard to see what's going on.\n\nThanks!",
        "created_utc": 1678031612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something different I realized about interests",
        "author": "Flighttofreedom",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11iwiek/something_different_i_realized_about_interests/",
        "text": "Most of the media I engage in is about information. Ideas, facts, philosophies. Very little of it is people-centric. Yet when I try and gather with others to share a conversation, most are interested in discussing people or media about people (television, news and recent events, relationships). \n\nIs that an autistic trait to care mostly about information?",
        "created_utc": 1678020966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationships and demand avoidance",
        "author": "Safe-Elevator1567",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11isd17/relationships_and_demand_avoidance/",
        "text": "All my life I've had major problems with demand avoidance and I've gradually realized it's the main reason why I've never felt comfortable with long term partners. One year is the maximum I have been able to tolerate in a relationship and I'm in my 30s. I think one part of the problem is that I demand too much of myself and society probably also expects a lot out of women in relationships too. I would like a partner in my life, but my experience has been that it is a lot more draining than being on my own. \n\nSo, what I would like to know is if you have found long term relationships difficult due to demand avoidance? If so, how have you managed to cope with this? Does the relationship feel like it drains energy from you or does it feel good in general?",
        "created_utc": 1678006750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research on self-diagnosed autistic women",
        "author": "Ch4o5Muff1n",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11is9r9/research_on_selfdiagnosed_autistic_women/",
        "text": "A plug for this research project by an autistic woman seeking to better understand the experience of self-diagnosis for women and non-binary folk.\n\nhttps://twitter.com/AFriedmanMMU/status/1627660278870441986",
        "created_utc": 1678006402,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an assessment on Tuesday and I'm nervous.",
        "author": "OrderlyToaster",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ihc0p/i_have_an_assessment_on_tuesday_and_im_nervous/",
        "text": "So first off, it's an unofficial diagnosis(?) so I don't think it'll be on any record, but the doctor will give me some kind of more professional insight. \n\nI (M25) was diagnosed with ADHD about a decade ago now, and self-diagnosed autistic since September 2021. I've tried to prepare as much as I can for the assessment, however because of (I assume) my combination of trauma and ADHD my brain refuses to dig deeper into any past instances that may be of use during the process. \n\nDoes anyone here have some tips or some insight on what to expect?",
        "created_utc": 1677973807,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm 30. I have a fiance, a couple friends, and a \"career\" job. I'm \"high functioning\". I'm also very low functioning and being \"highly functional\" hurts painfully. I'm tired of being scared all the time. I'm tired of being tired all the time. I'm tired of hating myself when I remember that I exist.",
        "author": "TrueSelfWhat",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11hyiaf/im_30_i_have_a_fiance_a_couple_friends_and_a/",
        "text": "\nThis is a rant. It's disjointed and probably nonsensical as it's mostly stream of consciousness and I'm just not interested in making it make sense today. \n\nI'm 30. I have a fiance. I have a job that by all acounts can lead to a lifelong career at the post office without having to hop companys, move, etc. I even sort of have a couple friends at work. I'm also constantly feeling on the edge of throwing all of it away if I'm not careful about timing when I completely fall apart.\n\n\nIt feels incredibly bullshit that every step toward understanding myself leads to painfulness. The alternative is relatively untenable too though, so I'm ping ponging between stoic-useful-to-society-person and full on meltdowns. \n\nIt's entirely possible for me to mask the majority of the time even from myself in such a way that the following things happen for better AND worse. To the outside world I appear to:\n\n-work with decent work ethic\n-get along with others\n-take care of myself somewhat, with hygiene being hit or miss\n-chitchat about life as if I'm getting by decently\n-confuse the hell out of anyone that I admit to not being all together and/or having autism and/or adhd. \n\nHow's it going really? \nShowers are hopefully a once a week affair. I'll brush my teeth about as frequently as there are holidays(thank god my genes gave me good teeth, but boy am I taking them for granted). Having to make a phone call sends me into a full blown meltdown if I try to force myself to do it, otherwise I ignore the need entirely. That goes for calling family, friends, making appointments, calling into work(its an automated system with zero human interaction too LOL). \n\nI wash my clohes only when my dirty ones become damn well unusable. Most dirty clothes are strewn about on the floor, most clean clothes are in one of a few hampers. If I find clothes and get dressed fast enough, it doesn't stress me out too much!\n\nMy eating habits rubberband between hey-i-had-3-normal-meals and oh-day-3-of-just-cracker-snacks with amount eaten from not enough to way too much because i binge ate before forcing myself to bed.\n\nGoing to bed is a game of getting exhausted enough mentally that I get up and lay down with so little energy I can't be stressed, otherwise I can melt down before, during, or after getting into bed. Or, if I'm feeling froggy I can just have a low-drone level of stress that makes me lay there for 3 hours and I start counting how many hours I have left before having to get up.\n\nMost days that I give myself more than literally 5 minutes of freetime between waking up and having to leave for work leads to stress and or meltdowns so getting up a few minutes after I should start getting ready is the norm.\n\nWhat do I do when I'm not passed out, getting ready for work, or at work? Sit on my computer and either browse randomly or play video games that can suck me in. What happens if I don't? I might think about myself and that's a recipe for spiralling into a meltdown of selfhatred. That means errands and literally-cant-not-do-them-chores are ALWAYS last minute and/or overdue. I can't take out the trash unless it's literally overflowing, and even then it's only when i'm headed out the door to work. The cat runs out of cans of food, so I HAVE to get some that morning before going to bed(i work nights, woo). Rent due? better do that ON the first. Online bill pay stuff? literally speedrun doing them all at once early in the month so I don't completely forget about them. \n\nOh, feeling like I'm worthy of something positive? I'll buy a game I won't actually like playing(but I'll sink time in it to not think about anything else), or I'll order food that I don't end up caring for, or I'll buy random shit online. Or hey, maybe I'll actually have a positive gaming session that somehow spirals 2 hours latter than I wanted it to and now I don't have enough time to get enough sleep for work later. Sure hope I don't call in AGAIN because even though I'm making more money than I ever have I still overdraw my account once every couple months. \n\nWould be cool to get another therapist but oh-that costs money I don't have because I won't qualify for sliding scales anymore. My meds are only partially covered too, which leads to some fucky situations. It sure feels great to feel like the 3 years of therapy I got recently is regressed out of me, and it feeling like finding a therapist that I don't have to educate about autism is like a fucking lottery spin. \n\nI'm 30. I have a fiance. I have a job that by all acounts can lead to a lifelong career at the post office without having to hop companys, move, etc. I even sort of have a couple friends at work. I'm also constantly feeling on the edge of throwing all of it away if I'm not careful about timing when I completely fall apart.\n\nI'm tired of being scared all the time. I'm tired of being tired all the time. I'm tired of hating myself any time I remember that I exist.",
        "created_utc": 1677934497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else on the Autism spectrum find certain accents more annoying than other people do?",
        "author": "itsjakeprice",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11hp6wu/does_anyone_else_on_the_autism_spectrum_find/",
        "text": "I’ll be real I can’t stand some southern accents &amp; the way they pronounce things. I can’t stand winey midwestern accents too!",
        "created_utc": 1677903423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to understand what this means? I’ve struggled through 30 years of life but never considered ASD until it was brought up in therapy. Should I reach out for help if I think this could be my problem? Who do I talk to if I don’t even have a primary doctor? I still struggle talking in therapy",
        "author": "tayvibes",
        "url": "https://i.redd.it/n9rwiva98ola1.jpg",
        "text": "",
        "created_utc": 1677895324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Managing symptoms as a stay at home wife",
        "author": "Icemilk-Magic",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11hl7u8/managing_symptoms_as_a_stay_at_home_wife/",
        "text": "So I have quite a lucky situation for my mental health in which my husband works and I get to stay home to take care of my two cats and just do simple housewife things. Its done wonders on my learning processes in many aspects of life, but ironically now that I'm more comfortable with just being me, I find myself uncomfortable in my surroundings more often. This means that since I've had the space to participate in my favorite activities more, none of them make me feel how they used to. So I've been in a burnout phase for what feels like an eternity now, having exhausted all possible methods of trying to wriggle free of this state.  \n\n\nI recognize that a break in routine will likely be the best fix in this, but I'm not sure how to approach it safely without putting myself under extreme stress! Since I'm still learning about my diagnosis and what coping mechanisms work for me I haven't really learned how to differentiate what is uncomfortable vs what is legitimately stressful, ultimately making it much harder for me to learn how to cope on my own, which obviously doesn't help. I'm someone who is always willing to recognize my faults and work to correct them in healthy ways asap, though sometimes I need a little help. I just want to feel productive again!  \n\n\nSo here I am, asking for assistance once again from this lovely community! I'd love to hear your stories and advice about how you manage your time and how you cope with a scary (but necessary) change in routine (or if there are other strategies for situations like mine). I'm confused on what could possibly feel different enough to make my \"safe\" activities feel like real options again while I continue my stay at home lifestyle. I hope this makes sense!",
        "created_utc": 1677892489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intrusive thoughts",
        "author": "Lanky-Beyond-6767",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11himhm/intrusive_thoughts/",
        "text": "Man, I've always found them deeply unsettling but lately when it happens I'm frozen in my tracks. I get overtaken and start panicking, crying and stimming. It is horrible. I can't visualize abe lincoln on a bicycle but I can see these awful scenes in my head.\n\nI've read they're thinking errors that everyone has sometimes, but fricking hell I wish they didn't scare me so badly.",
        "created_utc": 1677886060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music therapy?",
        "author": "vract",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11hbklk/music_therapy/",
        "text": "I am currently on medical leave for burnout. This is the first time I have been this burned out. I have a great therapist who is encouraging to find activities that are not taxing cognitively either in content or having to direct my attention. So far I have found video games and off brand adult legos to fit the bill. But I was reading about the benefits of music therapy for autistic people and started looking into drum sets. Has anyone noticed if learning to play an instrument or playing music is cognitively taxing? \n\nI am horrible at predicting activities that are more depleting and have a problem with pushing myself to learn new things (it’s a problem because right now I’m trying to learn to relax and be present/feel safe). So, I would really appreciate if anyone can share their experience with playing instruments and what they noticed about their own brain.",
        "created_utc": 1677869963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masters student recently diagnosed, regressing",
        "author": "ESmith810137",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11h2x09/masters_student_recently_diagnosed_regressing/",
        "text": "Hello all. I’m experiencing what I believe many people are and I’m getting worried about my future abilities to do things. I handled myself really well before my masters, but I think everything I learned throughout probably elementary school and up has been through a severe mask. \n\nI definitely fell apart and stopped functioning about a month into my masters and finally got some help, earning shiny new diagnoses of Autism, ADHD and OCD. I didn’t really feel any regressing until the new semester, and am struggling to do a number of basic things as well as things very important to my degree and job. \n\nCan anyone offer advice/personal story? What do we even do in this situation? Is this burnout?",
        "created_utc": 1677855767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cowboy Bebop’s Radical Ed: Alien or Autistic?",
        "author": "NotKerisVeturia",
        "url": "https://aureliaundertheradar.wordpress.com/2023/03/01/cowboy-bebops-radical-ed-alien-or-autistic/",
        "text": "",
        "created_utc": 1677854745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience with Astral Projection?",
        "author": "Smart_Ambition_6154",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11h0zbj/experience_with_astral_projection/",
        "text": "So, recently I had 3 times out of body experiences where I was switching galaxies faster than speed of light, I came across one with many formulas &amp; gadgets, in forms of tornado, but I am not a maths person, I didn’t understand most of it so just started swallowing, there were gadgets with all blueprints written clearly but moving too fast me for to hold &amp; comprehend. I will try to do this again but slower this time, has anyone else here experienced such thing? Do you think those equations could really mean something, my forte is mostly arts &amp; music, I never paid attention to maths during school because my teacher was an ass &amp; people in science are perceived as nerds &amp; geeks &amp; nobody wants to be friends with them and I wanted friends so never paid attention but after these encounters something tells me I am in the wrong field but I don’t understand mathematics properly yet, should I invest my time in learning it now, as a young adult?",
        "created_utc": 1677850656,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to disclose diagnosis to employer? During interview, or afterwards?",
        "author": "kerghan41",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11h0rsi/when_to_disclose_diagnosis_to_employer_during/",
        "text": "What are everyone's thoughts here? I don't want to harm my chance at getting the job and after having spent nearly 20 years in the workforce I am very good at faking/masking during interviews. Back in the day I would accept every interview I could to practice just so I could get good at it. \n\nIf I disclose my ASD1 diagnosis to them I'm worried it will jeopardize my chance of getting hired. I also don't want to piss them off either after I settle into the job and then disclose my diagnosis.",
        "created_utc": 1677850071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a rant. Or maybe a plea.",
        "author": "userlesssurvey",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11gxz4x/just_a_rant_or_maybe_a_plea/",
        "text": "What's below is something I wrote trying to explain to someone how I'm doing..\n\nMaybe this isn't the best place for it but I've been stuck with a feeling for so long and it's not going away. \n\nTrying to name it or define it to myself makes it slip through my fingers as soon as I touch it. \n\nIf I try to get perspective on it by taking a step back it's suddenly bigger than me or anything I've known.\n\nI try to find something without it and it's there in the smallest part of everything I see. \n\nThis feeling follows me. Haunts me. Drives me forward. this feeling is killing me and I don't know what it is. \n\nI can guess though..\n\nIt's my mask and I can't feel where it ends and I begin. \n\nOr it's my heart, that I never let grow, beating for a future and a dream I've not yet known. \n\nOr it's my mind, trying to get me to see something I don't want to look at, even though I no longer remember why I stopped being able to see what's there in everything I do.\n\nMaybe it's my soul, whatever that could or may be, trying to reach out to another person so I can stop drowning in uncertainty. \n\nWhatever the case I thought that somebody on this sub may relate. May know this fight better than me and have some words of wisdom to help guide me forward. \n\nI'm at the end of my rope.\n\nAnyways. I'm not looking for any advice on what to do with my life or how to find help. I mostly just want to know that I'm not alone in my struggle. That's enough for me to keep fighting to find my truth.\n\n--------------------\n\nI never chose a direction in life because it's what I wanted. \n\nI'm burning out and my life is falling apart. That's how I'm doing in simple terms. \n\nI was married for nine years from when I was about 21. We had kids together and that was my life. \n\nThen my ex-wife has a mental break and a lot happened. \n\nNot going to get into it other than to say we ended up homeless, lost custody of our kids and split up. \n\nI fought so hard to help her because I couldn't imagine being a father alone. \n\nThat cost me my chance to be a father to my kids. \n\nThat broke my world. \n\nI loved my kids and not being able to be there for them nearly killed me.. I shouldn't be here, but I am. \n\nI've been trying to come to terms with what that means to me.. other people can say they love themselves or they have pride in what they accomplished in life. I never will. \n\nWhen I think back on my life I see and endless procession of mistakes and compromises I should never have made with myself in order to push through to the next day. Sometimes the next minute. The next second. Sometimes even to convince myself I should keep breathing.\n\nI've always pushed through. But even that's an illusion. Something I tell myself. I keep going because of instinct. And because I know I'm not done yet. I can't ignore that fact, much as I try to. \n\nI can be better than the sad person I've let myself devolve into being. But I've been fighting for so long to fix what's been broken.. \n\nI have so much left to do and it's been taking more than I have to give. \n\nI lost my job because I can't keep up with the bar I set for myself even last year. \n\nI'm so sick of starting over. \nBuilding Sandcastles out of twisted bent and broken pieces of my heart just to watch them fall apart at the first sign of trouble. \n\nI realize that I'm the one that's letting it happen, but especially lately, I feel powerless to stop it. \n\nI'm tired of finding something I could love only to watch it die before it even starts to grow. \n\nI'm tired of hope. \n\nAnd I'm tired of people expecting me to do more and be more than what I'm able to give when I have nothing left to remind myself why I should keep hold of hope in my heart.\n\nBut that's also a lie. I know it as soon as I say the words to myself. \n\nIf I'm honest, I've lost my truth a long time ago and I'm not sure if I'll ever get it back. \n\nWithout a way forward that I can trust, I'm blind to what I need. What I want. It's slowly eating my will.\n\nI've spent the last 4 years trying to recover from my own personal tragedy and hell.\n\nWhat I discovered after all that.. was that I've never really been happy. \n\nOutside of my children, everything I've done has been either about what was expected of me or what I knew I needed to do or things would get worse. I've never chosen where I want to go or decided why I'd want to be there..\n\nSorry. It's been a stressful couple of months for me.",
        "created_utc": 1677841632,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which common autistic behaviors do you not have?",
        "author": "Department_Flimsy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11gs0op/which_common_autistic_behaviors_do_you_not_have/",
        "text": "For me it’s social anxiety. I actually don’t have much anxiety at all. I still suck in social situations, tend to shut down in them, and try to avoid them, but the whole anxiety part is not something I have a problem with.",
        "created_utc": 1677820152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is talking on the phone so stressful? What are some tips for not being anxious of talking on the phone for people with an autism neurotype?",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11gm822/why_is_talking_on_the_phone_so_stressful_what_are/",
        "text": "",
        "created_utc": 1677804103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worthwhile to seek an official diagnosis?",
        "author": "QuestionsThrow_away",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11gj7pf/worthwhile_to_seek_an_official_diagnosis/",
        "text": "I (30M) was hoping to get some perspective as to whether it would be worthwhile to get officially diagnosed with autism. According to my therapist, I would meet the criteria for a diagnosis if I wanted to go the route of seeking one. But I haven’t gone through with it yet-- my main concern is that it could possibly be more of a detriment than a help to me.\n\nA bit of background-- I’m currently in a combined PhD / residency program which I really enjoy. I only infrequently interact directly with clients in my chosen medical specialty, but I do work with other doctors and residents and occasionally students. I’ve been able to keep up with the workload just fine, and my biannual reviews are consistently good. I think I’m pretty good at acting ‘normal’ when I have to, and my colleagues act neutral or friendly toward me. Two colleagues have caught me ‘stimming’ (I ball up my fists and gently rap my knuckles together-- it happens most often when I’m intently working on something or feel a strong emotion but I only let myself do it if I think I’m alone). One didn’t mention it after, and the other asked what I was doing, and I apologized and told her I do that sometimes when I think. She said, ‘Oh, okay’ and didn’t mention it again. A lot of the other doctors and researchers have their own ‘quirks’ and I think I blend in with them okay, but I haven’t figured out how to ask anyone if that’s actually true. My wife tells me it’s ‘pretty obvious’ that I’m somewhere on the spectrum, but I’m not sure if it’s equally obvious to others. \n\nMy main concern is that if I seek out a diagnosis, it could be used against me when I eventually graduate from the program and try to seek a job. It feels like a lot of people have misconceptions about autism. Does anyone else have experience with this? Do the possible benefits outweigh those concerns?",
        "created_utc": 1677798348,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW! : How to deal with suicidal thoughts? (This is pretty dark, apologies in advance)",
        "author": "meduse5789",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ghu78/tw_how_to_deal_with_suicidal_thoughts_this_is/",
        "text": "I don't really even know what to say here. Obviously, as in the title, I'm having suicidal thoughts. Every day.\n\n&amp;#x200B;\n\nI'm holding onto the thought that maybe one day I'll muster up the courage to do it, because I'm sick of this life. I've thought in immense detail about what my future likely holds - you know, the inevitable stuff, mostly.\n\n&amp;#x200B;\n\nMy mother has always been the one person that has kept me going in life. She understands me the most, she's my best friend, she supports me. She doesn't judge me.\n\n&amp;#x200B;\n\nBut what about when she's no longer here? Thinking about it just absolutely crushes me. I feel like I'm already grieving her loss. How fucked up is that?\n\n&amp;#x200B;\n\nI live for her and because of her. And once she goes, so do I.\n\n&amp;#x200B;\n\nI think I'm more attached to her than usual because of my childhood trauma. My dad was an alcoholic, he was abusive. I used to do my best to protect her as a little girl, pushing my father away from her when he'd come violently close. I know she's been through so much and I appreciate her for it. To have three children, and manage to get them through life whilst having her own threatened constantly takes an astounding level of strength.\n\n&amp;#x200B;\n\nUnfortunately, my 'father' continues to be a complete dick, attempting to find me on social media and ruin my 'peace'. He tried to murder my mother, and he still thinks he's the victim somehow. I don't know how he sleeps at night.\n\n&amp;#x200B;\n\nI also feel like a burden on my mum - mentally, and financially. I'm 20, I'm a university student. I'm now realising how fucking unequipped and incapable I am of dealing with any social environment. I don't even think I'll be able to work... I've had like four jobs in my lifetime, and I hated them all. It takes very little to cause a burnout for me. I simply do not like being around people.\n\n&amp;#x200B;\n\nI just feel like I'm living a pointless and painful existence.\n\n&amp;#x200B;\n\nI've said this before in another post, but I can't feed myself anymore. I refuse to go into our communal kitchen to cook. I'm wasting my money on fucking takeaway, but tonight I've decided not to bother, because I really do not want to see anybody. So tonight, I'll be starving.\n\n&amp;#x200B;\n\nYes, I have a stash of 'snacks', and meal-substitute drinks (which taste vile), but I can't even consume this stuff anymore. I'm sick of it. I want a healthy, warm, comforting meal. I cannot get it without encountering others, though. This just makes me feel pathetic, like a failure, a weirdo, like I deserve to suffer for being so fucking incapable.\n\n&amp;#x200B;\n\nI'm a human being, instinctually hardwired for survival. So why can't I even do that? Why am I so useless?\n\n&amp;#x200B;\n\nI sleep during the day so as to avoid people, and I'm awake at night. You'd think I find some sort of relief from this, but not as much as I thought it would. If I have the socially acceptable sleep-wake cycle, I face crippling anxiety, but at least I have some sort of 'normalcy'. If I divert from this, the anxiety is reduced significantly, but the depression is extreme.\n\n&amp;#x200B;\n\nI can't win.\n\n&amp;#x200B;\n\nI've been missing classes at university. I just got a grade back from one of my essays, which I'm ashamed of. I always wanted to do well academically, but my executive dysfunction just fucking ruins everything. Someone literally just messaged me asking whether I was coming to class tomorrow. I can't bring myself to open the message, let alone reply. This happens every single time.\n\n&amp;#x200B;\n\nSometimes I really want to just give up and become a fucking alcoholic or something, but I can't even do that - because I couldn't even work to fund this fucking addiction. I suppose even if I could, it wouldn't be sustainable, anyways.\n\n&amp;#x200B;\n\nI've tried therapy, I've tried antidepressants, I've tried ringing suicide hotlines - they do nothing for me.\n\n&amp;#x200B;\n\nI'm desperate right now.",
        "created_utc": 1677796827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 90 minutes for an autism assessment long enough?",
        "author": "barbske",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11g8pk0/is_90_minutes_for_an_autism_assessment_long_enough/",
        "text": "I have my autism assessment in April and they say it will take 90 minutes. It just seems like not very long, especially seeing that some people on here say they've had like 6 hour long tests. The psychologist specializes in autism and adhd assessments for all ages of people. Could they just have really narrowed down a good strategy for diagnosis. Has anyone else experienced an assessment this short that could talk on their experience? I mean obviously I don't mind it not being this big hours long process that will exhaust me but I'm just worried it won't be thorough enough.",
        "created_utc": 1677778605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 90 minutes for an autism assessment long enough?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677778268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else do this?",
        "author": "peepeethehampster",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11g8abn/does_anyone_else_do_this/",
        "text": "I haven’t been diagnosed yet and I’m very nervous to be screened. My main thing I struggle with is sensory issues. For some examples I wear earplugs in church and can’t stand thunder or loud convos. Because I don’t want to seem weird or inconvenience other people, if it’s not too unbearable I’ll force myself to zone out until it’s over. Like spacing out, but I make myself do it. I usually do this in context of a loud conversation or little children being to loud, because if it’s a sudden noise I’ll instinctively plug my ears lol. Anyway people are really weirded out if I tell them the spacing out thing and I’m wondering if this is just me? Also any advice for the screening is welcome I’m so scared for some reason.",
        "created_utc": 1677777575,
        "upvote_ratio": 1.0
    },
    {
        "title": "What I Thought of ‘Inside Our Autistic Minds’",
        "author": "Hassaan18",
        "url": "https://www.hassaanshouse.co.uk/blog/what-i-thought-of-inside-our-autistic-minds",
        "text": "",
        "created_utc": 1677777207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you have similar signs as a child?",
        "author": "Adorable-North123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11g38vc/did_you_have_similar_signs_as_a_child/",
        "text": "I made a list of signs I had of autism when I was about 3-5, I was wondering if you guys had similar signs or if I misinterpreted one or more as a sign when it isn't. I mostly just wonder if people relate to how I felt in preschool- kindergarten \n\n\nDelays\n- my mom often says I was the most delayed of her children\n- gross and fine motor skills are kinda stunted, they developed enough to function but on bad days it really effects me\n- some examples how they were delayed is: not able to catch balls as soon as other kids, I couldn't tie my shoes properly until I was 11, I have a hard time picking up small objects or pushing buttons on a keyboard properly, I couldn't put on a shirt or button or use a zipper when I should of been able to, I'm overly clumsy and can't control my movements well\n- other then that I wasn't really delayed on anything else\n- I could read at 3 and way above my \"age level\"\n\nSocial/communication\n- I don't know if I stopped making eye contact at 3 or if I've never made eye contact but 3 is when it was pointed out\n- I was only interested in interacted with one other kid and my family, other than that I could care less about interacting\n- when I would interact I would get \"lost\" and not respond well to the conversation\n- my mom often says how she was concerned because I never talked to anyone and she often \"wondered what I was thinking\"\n- other kids seemed annoyed or put off by the way I talked and acted\n\nRepetitiveness and sensory \n- I would line up toys or play repetitively (like spinning the wheels on a toy care over and over instead of pretending to drive them)\n- I would watch the same movie(the land before time series) over and over\n- my special interest was dinosaurs and I could tell apart a lot of dinosaurs and read about them all the time\n- I would also read the same books over and over \n- my sensory issues weren't as obvious except for not wearing certain clothes and complaining of light often\n- I often had tantrums/meltdowns where even I didn't know the cause of them causing everyone to stress out about what to do",
        "created_utc": 1677764989,
        "upvote_ratio": 0.99
    },
    {
        "title": "That was very brave of you",
        "author": "Technical_Reward",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11g2i17/that_was_very_brave_of_you/",
        "text": "I haven't spoke to much of my family about my autism just because I hardly ever have the energy to explain what they would probably want explained. But, I had dinner with my cousin and her husband the other night and ended up talking all about it! It felt very nice to be able to talk about all the research I've been doing and answer what felt like very genuinely curious questions. \n\nWhat didn't sit right though were a few offhand comments. \"How is your husband handling this?\" In terms of my relatively recent self determination. I don't know?? He's fine?? I haven't changed at all, I just finally have a name for the things I do. It felt very... Weird. But I couldn't exactly put my finger on why.\n\nThen after I had gone home my cousin texted me \"Thank you for sharing all of that tonight, it was very brave of you.\" And it just hasn't set well with me since. Why was it brave?? I'm not ashamed of my autism, it's not something to be ashamed of! But it feels like she expects me to be ashamed of it and it really has just been looming over me the past few days.",
        "created_utc": 1677762899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Secret social cues",
        "author": "22sunflower",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11g0i2h/secret_social_cues/",
        "text": "Hi guys. I recently started a job where I supervise other people. I try to communicate in a direct and literal way but I feel like it always comes across as having meaning I didn’t intend. I messaged one person to ask about some of our students attendance and then I guess it seemed like I was checking up on him or doubting that he was doing his job. Another person told me I have a lot to learn and asked me what I find difficult about this job, so I asked if she had any specific feedback for me, and she said she was just trying to make conversation and said she was sorry if she made me uncomfortable and I was doing a great job. \n\nI feel frustrated by this. And yet, if I don’t learn all the intricacies of communication I will be doomed to constantly come across in ways I don’t intend. Are there any jobs where it’s okay to be shy and where people don’t read into things you do and say? I’ve never been a manager before and to be honest I don’t really want to be one again. Feeling discouraged, and if anyone has any tips on work related communication or resources, particularly about being a manager, please let me know. Thanks in advance :)",
        "created_utc": 1677756649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you enjoy social dinners?",
        "author": "Fiddlinbanjo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fzhm6/can_you_enjoy_social_dinners/",
        "text": "I recently went over the situation of social dinners (e.g. my family with kids, plus another family with kids either at a home or restaurant).\n\nAfter going through all the difficulties and stress of this situation due to my troubles with ADD and ASD, my therapist looked back at the flip chart and said \"I have to say, if this were me, I would find this a very stressful situation. And most people think of a social dinner as a relaxed, enjoyable experience.\"\n\nI can follow and socialize at dinners up to a certain point and then I just zone out for various reasons such as ASD masking-related stress and sensory issues and ADD attention issues.\n\nAt the therapy session, I realized that I function better at restaurants when I'm facing towards a wall rather than towards the interior of the restaurant and alcohol helps if I don't overdo it. The only time I really function well is if I can get the topic of conversation focused on a special interest. \n\nHowever, the stress of pretending to follow a conversation when I'm passed my limits seems unavoidable. My therapist suggested explaining that I actually have a disability (or two), but I don't think I want to do that.\n\nWhat do you all do?",
        "created_utc": 1677752970,
        "upvote_ratio": 1.0
    },
    {
        "title": "what to do when you don't want to talk",
        "author": "snailat",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fwuay/what_to_do_when_you_dont_want_to_talk/",
        "text": "Sometimes when im tired i dont want to speak, so if someone asks me something i get upset and come off as grumpy. Im unsure if this is a nonverbal thing as I can speak if nessacary or prompted but I really don't feel like doing so, and it takes more effort. Does anyone else experience it? What do you do, or what could I do in this situation",
        "created_utc": 1677743546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Placebo effect?",
        "author": "Department_Flimsy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fr8m7/placebo_effect/",
        "text": "Since I’ve started suspecting I have autism, I feel like I’m “trying” to be more autistic. \n\nI’m trying to convince myself that I’m still me, and this is just putting a name to my struggles, but I keep catching myself doing an “autistic behavior” and wondering if I’m doing it because of autism, or if I’m doing it because I think I am autistic. \n\nOr maybe I’m just noticing my behaviors more now that I know more. It’s just making me wonder if I’m trying to convince myself of something untrue",
        "created_utc": 1677726875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neuro-Mixed Couple Study",
        "author": "Chrisscogginswilson",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fqrvn/neuromixed_couple_study/",
        "text": "Hello everyone!\n\nI am currently a student at Georgia Gwinnett College and working on my senior project. Dr. Michael Bar-Johnson and I are studying neuro-mixed relationships (relationships consisting of one neurotypical partner and one neurodivergent partner). I am neurodivergent, so this research means a great deal to me, as I believe it will also mean to you all. The focus is not on how neurodivergent individuals interact with neurotypical individuals but on how neurotypical individuals interact with neurodivergent individuals. We are examining subjects such as past social history and relationship satisfaction. Once the survey is complete, we will post the results in this group!\n\nWe thank you in advance for helping the scientific community understand an under-studied issue.\n\n*A neurotypical partner in a relationship with a neurodivergent individual can only complete the survey.*\n\n[https://ggc.az1.qualtrics.com/jfe/form/SV\\_8w5ccY7btc1ZCC2](https://ggc.az1.qualtrics.com/jfe/form/SV_8w5ccY7btc1ZCC2)",
        "created_utc": 1677725651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which level of anger is reflected by a non-autistic person not being able to make eye contact?",
        "author": "Terrible-Trust-5578",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fpnxi/which_level_of_anger_is_reflected_by_a/",
        "text": "I pissed off my coworker a month ago.  Now she's being really sweet, overly polite.  Way too nice.  \n\nAnd she can't make eye contact with me anymore.  She'll use the sugary tone, but she will not look me in the eyes.  \n\nAnd when I catch her off guard, say hi to her when she didn't see me, her tone and facial expression is stone cold.  Serial killer style. \n\nIs this cut-your-brakes level anger or just a normal anger response for a non-autistic person?  How scared should I be?",
        "created_utc": 1677722794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"Long day, huh?\" code for \"You look like horseshit?\"",
        "author": "Terrible-Trust-5578",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fmsto/is_long_day_huh_code_for_you_look_like_horseshit/",
        "text": "",
        "created_utc": 1677715639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi all, going to get diagnosed in 1 month and i feel anxious from time to time. Did plenty of online tests and got peer reviewed but i’m still scared of being wrong. Here you can find my results to one of the famous tests. How would you interpret it? Also i’d love if you could share documentation 🌷",
        "author": "TreeFrogsLover",
        "url": "https://i.redd.it/lrn6kod169la1.jpg",
        "text": "",
        "created_utc": 1677712974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autism-Tutoring",
        "author": "FanOfTheDong",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fhbrx/autismtutoring/",
        "text": " Are you looking for an autism-focused tutor?\n\nI cannot recommend this autism-focused tutoring service enough. My son, who has autism, struggled with academic and social skills in school, and we were at our wits' end trying to find the right support for him. Thankfully, we found ScholarlyTutor.com Their experienced tutors provided individualized academic support that not only improved his grades but also helped him develop communication and social skills. They truly understand that every student with autism is unique and tailor their approach accordingly. Thanks to them, my son has made remarkable progress, and we are grateful for their unwavering support. Their phone number is 858-380-7148\n\n\\#sandiego #tutoring #school #autism #adhd #ocd #university #highschool #education #books #losangeles #irvine\n\n&amp;#x200B;\n\nhttps://preview.redd.it/teo27iocv6la1.jpg?width=1980&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=83620ed5e386a9508dd205a459933a756c1f7dd5",
        "created_utc": 1677703167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a delayed reaction to stimuli/overstimulation happen hours later? ( I know it sounds silly)",
        "author": "randomness20",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11fd26h/can_a_delayed_reaction_to_stimulioverstimulation/",
        "text": "So, for the last 2 days, there's been drilling in some unit above the apartment I stay in. While I had major sensory sensitivities to noise as a child, I outgrew them and am now generally hyposensitive. Of course, the noise of drilling makes even the most neurotypical of NTs go nuts. I thought it wasn't bothering me much and thought my mind managed to shut out the noise pretty well, and I tried to sleep for an hour or two more (!) and eventually got out of bed and got ready for the day. But that evening, I was suddenly hit by an overwhelming wave of tiredness I've never felt before- it wasn't just the tiredness that comes from a lack of sleep- I felt like someone had drugged me. I went straight home and slept for the next 12 hours. The next day, the drilling continued and again, I thought it wasn't bothering me much and eventually got up and went about my day again. That evening, again I got hit by a wave of tiredness that felt like I was drugged. That night ( last night), I went back to my mum's place instead of my apartment to escape the drilling. This evening- no sign of the tiredness that made me feel like I was drugged. I notice it's happened before- where I go to a noisy place that I don't think bothers me at all but hours later I feel inexplicably tired. It doesn't happen all the time though, so maybe I'm just overthinking it/making a big deal out of nothing?\n\nI'm generally hyposensitive to noise in adulthood, so I'm not sure if it's possible to be both hyposensitive and hypersensitive to noise. Can a delayed reaction even occur?",
        "created_utc": 1677697669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could this be facial blindness or something else?",
        "author": "midnightt32",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11f8p8e/could_this_be_facial_blindness_or_something_else/",
        "text": "So I think what I’m about to describe could be considered facial blindness, which I know is fairly common in Autistic people, but I’m not sure because I’ve heard other people describe it very differently to how I’ve experienced it. Basically, I can recognize people in unfamiliar contexts most of the time, but I don’t actually remember what people look like. Even my family that I see every day, and my own face, I can’t properly visualize. I can recognize them but not picture them. I have fairly strong visual memories and a minds eye, and although I have some difficulties visualizing, I’m not sure if that’s the problem. \n\nI know Individually what features me and other people have (like, I have brown hair, my mouth is small, etc) but actually picturing it is impossible. I can only picture actual photos I’ve seen before, and even that can be reallyyyy difficult. The longer it’s been since I’ve seen the photo the harder it is to visualize it. I used to stare at pictures of my now ex for ages trying to get his face to “stick” in my brain and it just didn’t work.\nI used to get confused when people on tv and movies would express distress that their loved ones face was “disappearing” after their death. I thought everybody didn’t have a clear image of anyone in their head. \nI can’t imagine being able to picture someone’s face so clearly like that. \n\nHaving dreams about specific people makes this even weirder. They never look like themselves in my dreams, yet I usually know who they are. \n\nIt’s not really a problem for me, just a bit annoying and kinda depressing. But I’m interested to know if other people experience this too, and if it is in fact facial blindness or something else entirely.",
        "created_utc": 1677689390,
        "upvote_ratio": 0.99
    },
    {
        "title": "When did your social problems start?",
        "author": "spookje_spookje",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11f7a9x/when_did_your_social_problems_start/",
        "text": "Background: I have been searching online about autism for months now since multiple people have told me they think I am autistic. People who have known me for years and people who have known me for a couple of months. When I look at autistic traits in young children I have difficulty relating to the social aspect. \n\nPost: I did not have any social problems untill I started middle school (11 years old on my country). I went from having a couple of friends (3) in my class to having 0 at my next school. It seemed like everyone became 3-4 years more emotionally mature during summervacation. I was left out in social aspects but was not bullied. Just ignored mostly. \n\nI did manage to make a friend after a couple of months (4+). They where in a different class but they saw me play a game on my phone in the hallway and started talking to me about the game. \n\nWhen I asked my parents about my childhood they insist I behaved all normal. I doubt this because there were definitly weird things about me. For example: sensory issues, no pretent play, low frustration tolerance. \n\nMy report cards say nothing odd about me socially in elementary school. I did get diagnosed with dyslexia when I was 9 and needed extra 1 on 1 classes outside of school. There where a couple of things they noted:\n\n1. We can often not read (my name) emotions. \n2. (my name) gets easily frustrated when they can't do something right.\n3. (my name) barely responds to praise. \n\nQuestions:\n\n\\- Did someone have a similar experience and was still able to get diagnosed?\n\n\\- Or do you know someone with a similar experience and was still able to get diagnosed? \n\nI am afraid my autistic traits before 10 years old where to little to get a diagnosis.",
        "created_utc": 1677686071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips on how to unmask",
        "author": "PopIntelligent5136",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11ezg50/tips_on_how_to_unmask/",
        "text": "I’m looking for tips to unmask because I’m feeling very lost with myself. I’m so used to masking 24/7 and I’m exhausted from it. I’ve been doing it soo long, I don’t even feel like I know who I am anymore. The constant fake smiling and acting happy all the time. I feel like my voice is even different when I’m with my family.  Please help if you can.",
        "created_utc": 1677663107,
        "upvote_ratio": 0.81
    },
    {
        "title": "Is it common for NT's to have obsessive fixations?",
        "author": "justanotherhuman255",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11exh60/is_it_common_for_nts_to_have_obsessive_fixations/",
        "text": "Tldr (sorry, I go on tangents :p): My NT boyfriend told me that my obsessive fixations on things like music theory and medical procedures are not common among NTs. Is this true? I thought everyone was like this. I also don't know if I'm autistic or not.\n\nI'm 19f. Since I was 17, I've gone in and out of suspecting I was on the spectrum. I never got evaluated mostly because of intimidation and financial concerns. \n\nA prominent part of my personality is that I get very fixated and obsessive with categories of information that I'm interested in. Examples of this may include but not be limited to music (theory, harmonic analysis, recently jazz improvisation), true crime (child exploitation, a few specific cases, interrogation techniques), medical treatment (surgeries, diseases, various fields and practices such as family medicine, dentistry, and orthodontics), internet culture. I also find consistent interest and enjoyment in working with computers and numbers.\n\nThe thing is, I don't even remember a lot of the information I collect about such topics. I just really enjoy learning and everything that has to do with taking things apart and seeing the inner mechanisms, and I get excited when given the opportunity to talk about it or connect it to other aspects of life. For example, going on a tangent about a rhythmic pattern I found interesting in a song, or using if/then statements as an analogy to how I make decisions.\n\nI thought for a long time that this was common because I'm sure that there are plenty of NTs who are musicians who love true crime, etc. And if a person loves something, of course they would want to talk about it all the time, right?\n\nAccording to my boyfriend, who I recently talked about this with, and who seems to be convinced that I'm autistic... apparently not.\n\n For context, my BF is the most extroverted, neurotypical person I've ever met. He can read someone almost instantly just by looking at them or hearing their voice, and I have no idea how he does any of it. He practically spent his whole life observing and interacting with people with varieties of different personalities and from all different kinds of backgrounds. Meanwhile, I went to arts schools, spent almost all my free time studying, and am now on my very first \"public school\" experience since I was 12. From what I've heard from my high school friends, they adjusted to their college lives much faster than me.\n\nAccording to my BF, none of his friends (and he has a lot of them) are at my level of obsession with their hobbies and interests except for the ones who are autistic. After asking for his perspective on other attributes of my personality, the same thing apparently applies for other things, too, such as my aversion to unwanted noise and struggle with reading faces and vocal tones. He named other things that apply to me, too, namely, fidgeting, black-and-white thinking, frequent use of unusual conversation topics, and treating life like a puzzle to solve. According to him, my body language and tone of voice also seem to be based on accumulated mimicry rather than intuition. \n\nWhen I asked him what social interaction looked like in his eyes, he told me that all of it was based on feeling. There was no problem solving or step-by-step formula. He just goes with his gut. He also told me that he was never bothered by noise before. Instead, he enjoyed it because it made him feel energized. At one point, I also said to him, \"You talk about me a lot to your friends and family. How is this different from your hobbies and other interests?\" His response was, \"You're my girlfriend, which makes you stand out. That's just how things are. It might not make sense to you because you process things differently, and that's okay.\"\n\nSo... where exactly is the line drawn between a socially awkward NT who simply has a passionate personality and an autistic person who has special interests? What is the difference? And for people who are diagnosed as adults (especially women and/or POC), how did you discover that this aspect (among many others) of you was more unique than you anticipated?",
        "created_utc": 1677655597,
        "upvote_ratio": 0.93
    },
    {
        "title": "I must share this with the world",
        "author": "Metal_wand",
        "url": "https://www.reddit.com/gallery/11etz7c",
        "text": "",
        "created_utc": 1677644314,
        "upvote_ratio": 0.75
    },
    {
        "title": "Reading",
        "author": "Department_Flimsy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11espav/reading/",
        "text": "Sorry if this is random but does anyone have trouble reading? I love to read, and I can comprehend the story fine, but every time I see a slight difference in the text (like using italics) or the chapter coming to an end my eyes are drawn to the “disruption” and I end up reading a sentence or two that I wasn’t supposed to read for another page. Really slows me down and gets annoying sometimes.\n\nI don’t know if it’s just a me thing but thought I’d share.",
        "created_utc": 1677640628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been wondering for a while. Not sure if this helps to confirm my suspicions.",
        "author": "MilesToHaltHer",
        "url": "https://i.redd.it/50vizuk4l2la1.jpg",
        "text": "",
        "created_utc": 1677633300,
        "upvote_ratio": 0.89
    },
    {
        "title": "Did I Get the Job?",
        "author": "Teener111",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11emy13/did_i_get_the_job/",
        "text": "You know when you complete a job interview and it feels like everything went really well but they didn't say explicitly if you got the job or not? I just had an interview like that and she asked me to come and meet the team next Thursday. Did I get the job? Or is this just a third step after phone screening and interview before giving me the job? I'm confused lol",
        "created_utc": 1677625433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I just need too much emotional support from my NT friends and family?",
        "author": "thechoochlyman",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11el2xf/do_i_just_need_too_much_emotional_support_from_my/",
        "text": "I'm M30, I've known I'm autistic since I was about 22. I've learned many things in my journey, but one thing that I cannot seem to get over is how little emotional support or empathy I can manage to drag out of my NT friends and family. I'm the kind of person who will listen intently to your problems and say things like \"wow, that must be really hard for you\" or \"I'm sorry to hear that, I'm sure that's a tough situation to be in.\" But getting OTHER people to give me the same kind of emotional space seems impossible - they just gloss over my struggles or ignore me entirely. \n\nThere are certainly a lot of factors playing into the personal relationships I have. Another one is that I recently left the church/Christianity and for the most part none of the \"Christians\" I know are very good at giving emotional support, at least not to me or my wife (who also has autism). But all the neurodiverse people I know (autism, ADHD, etc) seem to be pretty good at it. I'm curious to know if this is a problem that most other autistic people also deal with or if I just have shitty friends.",
        "created_utc": 1677621047,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do I do.",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11eh9fc/what_do_i_do/",
        "text": "17 male ( ADHD, suspected autism ) I hate my mom, she's got something against me. She always goes from treating me nice to treating me like shit out of nowhere while treating my other siblings like nice 24/7. Everytime her friends are around she always say something to embarrass me, like \"we need to cut your hair\" or \"go take a shower, you smell\" and laughs with her friends, even though I smell fine and take showers everyday. Not only that, everytime I ask for something she get's pissed off for no reason. One second shes nice to me, the next she's mad at me. And she's always suspecting me of doing something wrong, she always ask me \"what are you doing' suspiciously but never does that with my brothers. I think it's due to when I was a child I had Conduct Disorder and I used to steal and lie. But that isn't me anymore. And my mom is Caribbean, she comes from a country where they think disorders are \"vodo\" or they don't believe they exist. Everytime I get angry and sad at the same time and have thoughts about doing \"things\" and I end up surfing the net for a gun even though I can't buy one. What do I do.",
        "created_utc": 1677612071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scores for “Aspie Quiz”",
        "author": "Homunculox",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11eg3n8/scores_for_aspie_quiz/",
        "text": "“Your broader autism cluster(Aspie) score: 171 of 200\n\nYour neurotypical (non-autistic) score: 37 of 200\n\nYou are very likely on the broader autism cluster (Aspie)”\n\nDoes anyone believe this test to be of any value? I know it doesn’t count as an official diagnosis but does it truly signify anything?",
        "created_utc": 1677609330,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is how i be. Anyone one else do this?",
        "author": "Roanhouse",
        "url": "https://imgur.com/gallery/f0Qa5d7",
        "text": "",
        "created_utc": 1677602719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone interpret this exchange between me and my assessor?",
        "author": "emileif",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11e8hay/can_someone_interpret_this_exchange_between_me/",
        "text": "Hi all, I posted a few days ago asking for advice about my assessment. You can find that post in my history. I was wondering if anyone could help me make sense of my provider's response. Does it feel dismissive? Should i follow up or not say anything?\n\nme:\n\n\"Hey redacted,\n\nI’m really sorry to bother you. I did leave a message this morning but I wanted to see if I could reach you before the weekend and I communicate better in writing.\n\nI had some questions/concerns about my testing. I know it was a full neuropsychological eval but my primary interests were in Autism and then ADHD. I noticed only one of the written tests was for Autism and I was just wondering if that’s because I included test results in the information I gave you or if it’s because it had already been ruled out in favor of a personality disorder (I noticed two of the tests were regarding personality disorders). Or were the personality disorder tests exploring the BPD diagnosis I was already given? \n\nSorry to be so neurotic. This testing means a lot to me because I really feel like I’ve found my place in the autism community and it makes sense of so much of my life that I would be very distraught and confused to find out that it’s not the case. I guess what I’m trying to convey is that I came in with a certain amount of certainty about the diagnosis and I left feeling not so confident and also confused about the tests that were administered, so I’m just looking for a bit of clarity.\n\nI hope it is okay to ask these questions. \n\nThank you,\"\n\nher response:\n\n“Thank you for the additional information. I received your other emails, too; however, I’m not in the office on Fridays. \n\nTo answer your questions, we completed comprehensive cognitive testing that included comprehensive psychological testing. The reason for this is because there are a lot of diagnoses that can mimic or appear to be ADHD and/or autism, such a traumatic responses and anxiety, or personality disorders. Also, some people meet criteria for several diagnoses so I want to make sure I have enough data to determine accurate diagnostics to help guide treatment recommendations. Otherwise, I feel as if testing that’s incomplete may not be accurate and that’s generally unhelpful. \n\nI hope this helps clarify what we did on Thursday.”\n\nI’m feeling really upset about this whole process because I’m scared that we paid out of pocket just to be told I have BPD again. I have 11 pages of evidence supporting my belief and my therapist’s belief that I’m autistic but I’m just worried I won’t be believed.\n\nI also found out that my provider worked with the military police before she became a doctor and it put a really bad taste in my mouth because I have cop trauma. So I’m just generally in a bad place about the whole thing.\n\nAny advice is appreciated. Part of me doesn’t want to go to the results appointment because I would be so devastated to hear that she doesn’t believe I’m on the spectrum. I have high support needs and trusting that I’m autistic has helped me radically accept my past and present selves.",
        "created_utc": 1677594851,
        "upvote_ratio": 1.0
    },
    {
        "title": "That's funny",
        "author": "AdResponsible4604",
        "url": "https://i.redd.it/qbkuqhjqazka1.png",
        "text": "",
        "created_utc": 1677593488,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is funny",
        "author": "shutthefuckupgenius",
        "url": "https://www.reddit.com/gallery/11e5k67",
        "text": "",
        "created_utc": 1677589459,
        "upvote_ratio": 1.0
    },
    {
        "title": "autism and \"pretty privilege\"",
        "author": "minty_oolong",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/11e5cex/autism_and_pretty_privilege/",
        "text": "we all know the tropes of manic pixie dream girl, weird but alluring goblin/gremlin boy or ethereal non-binary person everyone is confused about is just autism with pretty privilege.  \n\n\ni would like to know how my fellow conventionally attractive autistics exist.   \ndo you also have it same as i - when people on the distance fall for you, some even go crazy trying to get involved with you, sometimes for months, sometimes for years but it all vanishes once you get close and they see that you are in fact weird and not just quirky and fun? or, well, the sad case when it's other NDs and they still are in love with you even seeing your true self but it's not a good type of in love, it's an obsession(muse trope i guess)? or the terrible part of being a pretty autistic girl in a group of people(school, small towns) where immature males of the group become a mob and sexually harass/assault you?  \ndo you have any stories to share?   \nif you're currently suffering and would like to know if it's possible to find a partner to be happy with, i can tell you right now it is possible. but it involves big time luck + huge effort from your side to not fuck it up out of fear.",
        "created_utc": 1677588839,
        "upvote_ratio": 1.0
    }
]