[
    {
        "title": "Autistic Individual doing Autism Research",
        "author": "foxnoodle98",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rzbpr/autistic_individual_doing_autism_research/",
        "text": " **Quantitative research study on how individuals with ASD perceive their own symptoms**\n\n \n\nHello All! I am a 24 year old female with ASD and I am conducting a Qualtrics survey study to determine the different self-perceived intensity at which those with Autism Spectrum Disorder experience their symptoms for my graduate thesis in the Creative Arts Therapy Department at Nazareth College in Rochester, NY. The goal of the study is to determine if the sex assigned at birth correlates with different intensities of particular Autistic traits. The target age range will be between the ages of 18 and 65. Individuals will be excluded if they do not fall into the category of self-diagnosed or clinically diagnosed with Autism Spectrum Disorder. Individuals will also be excluded for all other neuro-developmental and psychotic disorders with the exception of Attention Deficit/Hyperactivity Disorder (ADHD) due to the high co-morbidity of Autism and ADHD.\n\nSurvey Link:\n\n[https://naz.qualtrics.com/jfe/form/SV\\_2h5e8UwRGBxnt8q](https://naz.qualtrics.com/jfe/form/SV_2h5e8UwRGBxnt8q)\n\nThe survey mentioned above is accessible through the provided link and I am trying to distribute the survey to as many individuals with ASD as possible. If you could share this link with as many people as possible, my research would greatly benefit. \n\nThank you so much for your help and support!!",
        "created_utc": 1675368241,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont know what to think-",
        "author": "TheRealToby_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rzatp/i_dont_know_what_to_think/",
        "text": "So today I found out that both my partner and my best friend think I might be autistic- like I was on a call with my partner and they were like “im gonna diagnose you with autisism” (intentionally pronounced wrong, not mocking- its meant nicely I swear.)\nAnd I went to tell my friend it as a joke and they were just like “yea I agree. It fits you”\nAnd now i dont know what to think- I’ve never talked about thinking to be autistic or anything like that to any of them so I feel like they must be honest when they say it fits me.\nBut idk what to think- maybe some opinions?",
        "created_utc": 1675368178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I possibly autistic?",
        "author": "_Constell_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rxuwu/am_i_possibly_autistic/",
        "text": "I apologize in advance for a very long post! Let me know if this type of post isn’t allowed!\n\nI have recently started looking into the possibility that I may be autistic. I (19m) have cptsd which I have heard can be confused with asd but I know all of my cptsd symptoms have have stuff that doesn’t add up. I am nit diagnosed but I also am pretty sure I have adhd. I have several other mental health issues (social anxiety, depression, generalized anxiety, agoraphobia) but theres just some things that are unaccounted for.\n\nFor instance, I have a lot of sensory issues that have significantly affected my life since I can remember. As a kid I was even worse but I still suffer daily from many sensory issues. My most bothersome sensory issue is touching anything liquid. If I touch something liquid I have to put on lotion as soon as possible or my hands will feel so uncomfortable that I will get very upset. There have been times where I didn’t have any lotion so I would hold my hands in a fist or praying hand motion (it helps) and try not to panic. The feeling of my wet/damp (even after I dry it it feels terrible) makes me want to rip my skin off my hands at times. After showers all of my skin becomes super sensitive to touch and even textures I usually can put up with become unbearable.\n\nThats another thing, textures are also a big struggle of mine. Some textures are so disgusting to touch I physically recoil (and sometimes gag). As a kid I literally had to cut all the tags off my clothes because they drove me crazy (I grew more out of this one though). I wore as little clothes as possible when at home because I hated how they felt on my skin (just shorts, no shirt whenever possible). I’ve always been very bothered by textures. I also have problems with lights, bright lights give me headaches and most artificial lights make me very uncomfortable and upset. My eyes are just super sensitive to light input. I also have an extreme problem with strong smells, even one sniff is enough to send me into a migraine (which uch can last for hours without medication). I have some problems with food textures but its just really back and forth one what triggers disgust and what doesn’t (can’t list a particular texture that bugs me, just specific foods). I’m sure theres more I’m forgetting.\n\nAs a kid I didn’t have many developmental delays, just a couple. For one (possibly because of my social anxiety too), I had a hard time interacting with my peers (I have a very hard time to this day understanding how to hold conversations with even people I know). I took an embarrassingly long time to learn to tie my shoes or button a shirt without messing up. I was very clumsy and always getting small little injuries. I really struggled with sports (and still do) so I gave up ever doing them. \n\nTheres a bunch of other stuff, such as stimming. I paced in a circle writing this. I pace at least 20 minutes a day. Everyone else finds it weird and has always put me down for it but I just can’t help it, its soothing and helps me focus. I have a lot of fidget toys for when I’m anxious or excited or if I get restless.\n\nI also struggle, as an adult, with eating the same 12 things everyday. I don’t try new things (except very rarely) and like to eat the same thing everytime at restaurants (I only have like 5 things I’ll order from all restaurants). Sometimes I eat the same meal basically everyday for months. It just feels right. Everyone else also seems to think this is weird. I’ve always been this way.\n\nI mostly started questioning it after I told my dad about my sensory issues and he said that maybe I was autistic. He looks down on people with autism so he probably wasn’t being serious but for me it made me think. I then looked through some old childhood taps and noticed a lot of interesting behavior. Such as raptor hands, spinning, and other stims even in situations where they were very unwanted (such as during whole class preformances). Random jumping as well, with no other students doing anything remotely similar. \n\nI found many photos of me lining up my toys (one of my favorite ways to play as a kid, I would do it so it was spanning throughout several rooms). As well as memories of all my playing with toys being the same way over and over again. As a kid I would also get upset very easily (sometimes over very small insignificant things) and I would freak out. I would cry and sometimes bang my head on the wall. I have a younger sibling and while they throw tantrums, I was on a whole other level as a kid. My parents hated me for that and still bring up how terrible of a kid I was. So now I’m wondering if I’m possibly autistic. It would explain a lot of my behaviors and struggles. Any insight? Anything would be appreciated.",
        "created_utc": 1675364735,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a song about social anxiety and I’m wondering if it resonates with anyone else here.",
        "author": "heybubbahoboy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rxdb2/i_found_a_song_about_social_anxiety_and_im/",
        "text": "The first time I heard this, I really connected to it. It’s a description of feeling social anxiety at a party, but it seems more than that to me. Especially in the first verse, she studies the other people in the room and wonders how they understand each other. \n\nI would love to hear y’all’s thoughts, especially if this reflects your experience too. Here are the lyrics.  \n\n\n“Don’t Quite Belong” by Dodie:\n\n\nI'm taking my time in the back of a room\nDon't assume I'm as cold as I seem\nWiden the eyes, show the teeth, holding hands like it's planned\nHow do they know what they mean?\nI go up to a friend, grab his arm\n\"What's the code I should know? Do you struggle like me?\"\nHe says, \"Finish your drink, then we'll bounce, get it down, hit the town\"\nI still don’t know what he means\n\nAm I missing something vital here?\n'Cause I woke up feeling kind of weird\n\nGuess I'll just pretend\nPlay along till they figure it out\nI don't quite belong\nFake it 'til you make it, but I'm getting it wrong\nThink I’ve figured it out\nI don’t quite belong\n\nSuddenly face to a face, man to man, understand?\nI say yes, but I don't\nIt's working a charm, here take this, you'll be wired, but I'm tired\nI'd rather smoke it alone\nIn goes the drink and the fire and out comes the doubt and the stutter and shame\nI chew over a word, but it's wrong, no I'm fine, what's the time?\nI think I’m done with this game\n\nAm I missing something vital here?\n'Cause I woke up feeling kind of weird\n\nGuess I'll just pretend\nPlay along till they figure it out\nI don't quite belong\nFake it 'til you make it, but I'm getting it wrong\nThink I’ve figured it out\nI don’t quite belong",
        "created_utc": 1675363583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranoia &amp; Shutdown?",
        "author": "FulanxArkanx",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rrf53/paranoia_shutdown/",
        "text": "Hi.\n\nBackground: I have a lot of paranoid intrusive thoughts (around social things mostly, i believe due to not having realised i was missing cues for so long and internalising that) - for the longest time i didn't realise that \"not all thoughts are real\" (as my therapist puts it), so I just fed into them. Now that I'm realising they are, in fact, a form of intrusive thought, I've started to wonder if it's linked to overload?\n\nIt seems to me that often the paranoia with social situations always tends to begin just shy of the start of a shutdown, or leading up to and during it.\n\nFor example, last weekend i went to a hibachi with my family for my father's birthday. It was a fun experience but there were a lot of people, it was very loud, and since you're sitting next to the stove it's also very hot, all three of which are huge triggers for me. Almost immediately after he began the show, I mentioned that I'd give away my shrimp to the others bc i don't like them (meat shouldn't be crunchy) and my mom almost immediately responded \"I probably won't eat them either, they make my stomach hurt\". That's how i feel as well, and i had never heard her say that before, and even called that out, to which she responded \"oh, I do like them, I just can't usually eat very many because they don't agree with me.\" Again, more-or-less a conversation I had had with them in the past, where i'd said the same. I started wondered why she was picking fun at me for having felt that way and why she may have felt the need to change her mind like that to match how i felt - what was the reason for that? Anyway, later I shut down of course bc it was too much, and afterwards i realised those thoughts began right before the fidgeting, quietness, and 'inexplicable' anger started, all of which i already know are pre-overload signs for me, and it got me wondering if maybe the paranoia was as well.\n\nTl;dr: I'm wondering if anyone else experiences this - maybe not paranoia specifically, or even intrusive thoughts, but just some sort of non-standard thing that you've found seems to be like a \"shutdown aura\" for you, as it were?",
        "created_utc": 1675348930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I feel this way?",
        "author": "RogueKhajit",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rlmi7/why_do_i_feel_this_way/",
        "text": "Story:\n\nTonight I was sitting in my car at my partner's work just waiting for him to get out of work. He was taking a while so I was looking at TikTok. My partner works at a gas station and this old guy I saw enter it comes back out. He slapped the hood of my car but I thought nothing of it. He's old and uses a cane. If he needs to hold onto my car for support walking on the ice I was fine with it. He walks around to the passenger side of my car and again I just assumed he was walking between my car and the truck next to me. But he stops at my passenger door and I watch, frozen, as he opens my car door. I left it unlocked so my partner can get in. But instead this old, long-bearded man, is trying to get into my car. I wish my instinct in any situation wasn't to be nice, because I didn't scream, I didn't curse at him. Instead I said \"Excuse me, sir, you can't come in here.\" He realized his mistake and apologized and left but I was left shaken. I turned my car off, went inside my partner's gas station and asked if he was almost done. At this point he should have clocked on 20 minutes prior anyways. \n\nHis co-worker upon hearing me say someone tried to get in my car brushed it off \"He's old and can't stand up straight so he can't see where he's going.\" Or something like that. But I still feel shaken. My car is where I spend a lot of time as I use it for work. My personal safe was invaded. It immediately ceased to he a safe space for me.\n\nI want to cry. Why? He's an old man but I was scared. Why am I still upset by this, why do 8 keep playing it over and over in my head.",
        "created_utc": 1675329315,
        "upvote_ratio": 1.0
    },
    {
        "title": "F*cking horrible family dinner and I don't know if I'm having a meltdown or just a teenager tantrum.",
        "author": "The_Stellar_Boy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ripyf/fcking_horrible_family_dinner_and_i_dont_know_if/",
        "text": "K, so, I posted this on the autism sub but I'm posting here too in hope for some more perspectives.\n\nI (16 ftm) am currently on the couch of my grandparents house, this text would be finish probably when I'm in home but I need to start texting now. (Sorry for any problems with the grammar, English is not my first language) Because I feel like everything is too much right now.\n\nI always try my best to fit during the family dinner, with this, I learned that I need to talk about something because otherwise someone would point out my silence and I start to feel uncomfortable and guilty. The problem starts when I can't talk in any given moment, because every time we reach a subject that I could talk about and I actually get invested because it's interesting (to me), I would get easily interrupted by my mother or any other family member. That's exactly what happened today.\n\nThe talks felt so overwhelming and I shrink every time my aunt or sister talked (the talk SO laud, to the point I cringe and I can't take it). And the worst part is that after begin interrupted, I felt like I was burning inside because now I was feeling like I REALLY needed to spit out what I intended to say and it became a cycle:\n\nI want to say something/I start saying something because I really have something interesting to talk about --&gt; someone interrupts me and starts a completely unrelated subject or simply ignores my attempts at talking --&gt; I start feeling horrible inside and feel an urge to finish what I wanted to say --&gt; the conversations already was too far gone and it doesn't make sense to bring it up again (they would most likely make fun of me) so I suffer more --&gt; repeat.\n\n I felt so lost and I couldn't handle all this at all. But when FINALLY I had the moment to talk without nobody step on my words, I just snapped and I had to walk away.\n\nWhy? We started talking about universities and what I wanted to study when I finish high school. I love this question because I like talking about neuroscience, neurology and psychology, I want to focus in one of this and maybe be a psychiatrist or something along the lines. I was talking about this when I hear my mother (who was sitting to my right) mumbled something about this and I asked what's wrong, so she basically said that she doesn't see me as a psychiatrist. I started to feel really bad, but I asked why again, and she answered that I hated medicine so it doesn't make sense why I would want that and I should try other options. For the record, I never said in my life I hated medicine, and I literally said a few minutes prior that I didn't mind studying medicine and I want to give it a try.\n\nSo, I just got up from my chair and moved to the couch, where I just felt an overwhelming wave of anger inside me and I think externally nobody saw nothing. But I just felt so overwhelmed, I hated this situation and being on that house, my mother was the last straw and I couldn't take it anymore. I never feel listened and I'm so confused and irritated I think? \n\nAfter that I still feel so unreasonably angry and I feel like literally drowning. Most things like fabric that I dislike, now they annoy the hell out of me, same for lights and sounds, I just feel like a ticking bomb and anything can make me explode. So when we got home I apparently slammed the door before entering the house and I didn't noticed, my mom now is mad at me because I'm acting like \"a drama queen\" for no giving reason. When she later asked what was making so angry I just had to lie and say nothing until she leaved me alone because I really can't handle another discussion and I know she won't listen to me. \n\nIt eventually happened, I really didn't want the night light we have in the room with my sister because it's very horrible to me and I'm almost unable to sleep with that, but my sister loves it and this night, I just unplugged, I would not handle it. My sister started insisting so I just snapped and started yelling \"please stop talking\" or \"shut up, I'm begging you\" over and over until she eventually stopped. \n\nI'm now shaking I ended up crying and hurting myself to stop all of this (mainly, digging nails into my arm as hard as I can), I have a huge stomach each and I'm just so tired and I can't take anything more, I swear I just want to die and it doesn't help me the fact that my brain after all this is still going \"you are doing this for attention, you know what you are doing and it's intentional\" or \"stop pretending to be autistic and seeking attention\".\n\nPlease, just, someone tell me if they know this is some kind of autistic meltdown or I'm just having a temper tantrum or something like that. I'm loosing my shit right here.",
        "created_utc": 1675318473,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think there's somthing wrong with me",
        "author": "abortion_gone_wrong",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rh50d/i_think_theres_somthing_wrong_with_me/",
        "text": "I think this has to do with my autism, but I'm not sure..? I just wanted to know if anyone else on the spectrum relates to this.\nI, (15 M) feel like a robot. I don't know what to do most of the time and feel like I'm left out of everything when I'm assured I'm not. I don't see myself as me, I don't even really see myself. I look in the mirror and see me, I feel me, I know I'm physically there, but I feel like I'm not the person in the mirror. I feel like a robot who is consciousness trapped inside this flesh monster that is supposed to just- go? Be? \"Live\" isn't the right word. I look down at my hands and just think. \"These aren't mine\". Is this normal? I don't feel like I have emotions half the time either, and I don't know why. I say I love people such as my parents or my boyfriend but I don't know if I actually feel for them. I look qt others just. Living. Crying, grinning, they bleed, they see, yet I can smile, I can hug, I can act, but that's all it is. Acting. Are other people acting too? Does this feeling ever change? Will I ever be a person and not a robot?\n\nThank you for reading if you got this far, please let me know if I'm not alone.",
        "created_utc": 1675313453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loneliness and Imposter Syndrome",
        "author": "VibeClub",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rguzj/loneliness_and_imposter_syndrome/",
        "text": "I keep feeling lonely or out of place, and I’m scared that it’s because I’ve researched autism, and that I’ve developed a mindset where I’m tricking myself into thinking I’m bad at social interaction and therefore I don’t try as hard and that translates to feeling more isolated.\n\nI don’t know if this is actually a true and/or logical conclusion, but I do know I often feel disconnected from people, as though we’re on different levels or wavelengths. Other people also care about different things than I do, so it’s difficult to connect. Additionally, I think in concepts rather than words, so it’s hard to translate my thoughts in a way that other people can understand (and in general I just find it very difficult to express myself outside of poetry).\n\nThe biggest current source of doubt is that I don’t seem to struggle as much as most other autistic people. I only occasionally shutdown and my sensory issues only occasionally pop up. I’ve had *some* trouble getting work done since fourth grade, but that’s gotten a lot better these past two years. I’m capable of carrying out basic social interactions, and either my mask is so ingrained within me that I don’t struggle because of it or I just don’t mask, other than having social calculations that most people around me have been quick to label as “overthinking”. Although I am forgetful, socially awkward and anxious, and really obsessive with certain topics (and lonely too, I guess), I do function in life fairly well.\n\nLast year, I forced myself to socialize often despite growing anxiety. This year, I’m not only spending most of my breaks alone, I’ve also joined fewer activities—which means less of a chance for me to socially interact in a more structured environment (socializing during a shared activity is a lot easier for me than unstructured interactions with people crowding around making confusing subgroups). This is part of the reason I feel more isolated—I find it more difficult to initiate interactions and have fewer opportunities to do so. However, a big part of it is just feeling disconnected from other people even during social interactions. Sometimes, it feels like they’re acting, or like they’re movie characters.\n\nDoes anyone have any advice for me? Both for the social side and for the imposter syndrome. Am I just feeling isolated because I’m not trying hard enough to be social? Should I put more effort into it? Or what should I do? Is my hyperfixation on autism potentially causing issues?",
        "created_utc": 1675312621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone had an official diagnosis after testing very likely NT in all the online assessments?",
        "author": "Im-very-nice",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rdhvk/anyone_had_an_official_diagnosis_after_testing/",
        "text": "Now I really don’t know what exactly is going on with me, what I’m sure of is ADHD and emotional neglect.\n\nBut I can only ever think of two convincing traits: social awkwardness, and how I used to “lose it” when I’m mad and start saying hurtful things, like once calling my brother sick in the head because ironically, I thought he was misreading someone I thought had good intentions.\n\nI do kinda mean the shit I say when I lose it but they are things I wouldn’t say at all if I was in control of my emotions. \n\nOh yeah, and I don’t know if it does count, but knowing about all this autism stuff has made me go into a horrible loop where anytime I have an awkward moment I go back home and get consumed by my anxiety and sadness and waste the whole day reading about autism for the sole purpose of trying to diagnose myself just like I’m doing right now lol. \n\nIt serves nothing but make me hate myself even more but I can barely stop myself from doing it.\n\nI’m just so confused, I don’t recall masking at all and I’m not blunt at all, I never even scripted a social situation apart from job interviews. I mean I read the “how to win friends and influence people” book and felt like most of what’s in there was common sense that I figured out on my own, its more like I just avoid people because I can entertain myself just as much on my own, but the loneliness kills me as well.\n\nI’m just trying to figure out if I should be looking at my issues from an NT/ADHD standpoint or from an autistic standpoint, but I can’t get a diagnosis for a very long time because the nearest center is in another continent.\n\nIs there like someone I can talk to online that can help figure out whats wrong with me? Or has anyone had a similar experience? \n\nReally would appreciate some input",
        "created_utc": 1675303308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demand avoidance.. do I have higher support needs than I realized? What to do about this?",
        "author": "crumpleforskin",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10rc206/demand_avoidance_do_i_have_higher_support_needs/",
        "text": "Thanks to a lovely person here I now know my primary barriers to success are demand avoidance and autistic inertia.. so now I’m trying to figure out what this means for me. \n\nI am essentially useless when I am at home by myself. I can muster up tiny bursts occasionally to do things like the dishes and tidying up, and if I’m feeling creative I can coax myself into making a post on social media or making a small doodle.\n\nI can scroll on my phone, and if I am really firm with myself I can sometimes manage to put something on the TV but not often. My brain starts to physically hurt doing art or reading after about an hour or so, I think because I am willing myself to do it in the first place so the whole time it is a direct effort. \n\nI have tried to use my phone to accomplish things like doing research, reading books, organizing my thoughts or my photos, etc. Anything that gives me something to show for my time existing in this world, but I can never stick with anything more than a couple of days.\n\nWhat can I do for myself here? If I get rid of the phone I will literally just sit or lie down in dead silence, and that’s a terrifying place to be mentally so at least looking at cute and funny content online gives me something to cling to even though the entire time my brain is begging to do anything else. \n\nWhen my roommate is here I am capable of more, but they are also neurodivergent and not the most motivated or productive themselves so we usually just end up sitting together. \n\nThis is a sad existence and I have so many grand ideas and dreams for my life but I have no family or friends to support me and the demand avoidance makes trying to make new friends very difficult because I often ghost people. \n\nIt’s hard to not feel like I’m hopeless. I want to call my doctor to try occupational therapy but I’ve been putting it off for 2 weeks now and it doesn’t get any easier. I just need help and I can’t even get myself to take the smallest steps.",
        "created_utc": 1675299622,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I’m losing it",
        "author": "myselfnotyou_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10r2nib/i_feel_like_im_losing_it/",
        "text": "I recently posted the same thing in a different subreddit but have seen more similar posts on this one. \n\nMy partner (21ND) and I (21ASD/ADHD) have a pretty healthy relationship and have been working consistently on making communication better and diving deeper into our individual love languages. Though because we are both ND it makes some situations harder to dissect than others. \n\nThis is going to be long, sorry in advance \n\nLast night, I told her that I felt like my emotional needs hadn’t been met for the day. And explained my reasoning, which was something we had previously talked about. I would say I’m pretty understanding, I get that it happens. That being lack of communication and/or misunderstanding of situations. To which they told me that they didn’t feel appreciated. I am really surprised by the statement because I thought I showed that I appreciate them often and pretty well. They told me that when they have ask for my help rather than I volunteer my help feels not good. Which I understand that, I do need to step up more often. However, I told them that the reason why I don’t ask if they need help is because there have been a couple times where we have disagreements on how a task should be done. We were raised very differently. I don’t want to increase or cause tension because I don’t know how to do a task or what task they want me to help with. And I’ll be honest, they do a lot for me. They primarily cook out of the two of us (this particular tiff being around the kitchen and cooking). I try to help as much as I can in the kitchen. I just don’t know how sometimes. They asked to put a pin in the conversation and revisit it this weekend. And I agreed. I know I need more time to process the information and I know they need time to process the information. \n\nOutside of the kitchen I do many things that I think show my appreciation for them to the best of my currently abilities. Things like, grabbing things they’ll need, filling their drinks, I verbally tell them I appreciate them almost everyday, there’s more things but I can only think of those off the top of my head :/\n\nI just don’t know what I’m doing wrong or what happened to put us in this rough patch. I made sure that this wasn’t going to be a make it or break it discussion. So I know that they want to work on it and get through it too. \n\nDoes anyone have advice on what I should maybe think about in the mean time to prepare for when we reopen the discussion?",
        "created_utc": 1675277566,
        "upvote_ratio": 1.0
    },
    {
        "title": "should i seek diagnosis?",
        "author": "ezra502",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10r17qg/should_i_seek_diagnosis/",
        "text": "hi there, so i’ve been decently sure i’m autistic since i was 14 or so. i’m 19 now, and i didn’t feel comfortable self-identifying as autistic until my mom believed me (she is likely autistic too). of course being able to think of myself as autistic and say that to others has really helped me to feel less ashamed of the way i naturally am and has often helped other people to understand me. i function decently, even though i really struggle to work and struggle with mental health. i mask well enough to the point that i’m usually just a little strange. now for the question: do yall think that seeking a diagnosis would be beneficial to me right now? i have an ADHD diagnosis which can occasionally help me get accommodations, but i don’t really know the extent of that. for those of you who are diagnosed, what benefits has the diagnosis been able to bring you? what are the drawbacks? with my level of function/masking, do y’all think it would be best to seek a diagnosis or continue to avoid one?",
        "created_utc": 1675274324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Test results",
        "author": "imaginationwhat",
        "url": "https://www.reddit.com/gallery/10qym6n",
        "text": "22,Female.Could someone please explain these results to me?",
        "created_utc": 1675268140,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think autism is common in my family",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qx82f/i_think_autism_is_common_in_my_family/",
        "text": "So, i say this cause my mother has traits, she takes things todo literal, has flat effect, She's very \"childish\" for her age but at they same time very responsible, doesn't like parties at all, is brutally honest, never had a lot of friends and a lot of other things that i don't know how to put in words, but She's always been like that, she even told me once that my grandparents thought she was autistic and it makes sense for me, i remember when i was a kid i had to be very careful on how i said things cause my mother would misunderstand what i said and nos i have they urge to be very specific when i talk for people to understand me, also, i think my grandparent may be autistic too, it's a lot more obvious un him, he has very límites and closet likes, doesn't like to interact with people, has flat effect, i don't really know how to explain it, it's a lot of things i've seen from they time i've known him until now, however i just wanted to share this cause it's annoying for me tha way all My family denies the posibility that they may be autistic without a diagnosis, i mean, i know You shouldn't diagnosis yourself, but there are a lot of things You can't deny and won't go away, in my case i just want, if i'm actually autistic, to know it and deal with it in a better way.",
        "created_utc": 1675264717,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i survive a big city?",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qwqrv/how_do_i_survive_a_big_city/",
        "text": "I've been born and raised in a small town all my life, recently i moved out to a bigger city to attend college and i just can't get used to all they sounds and they grest groups of people, i don't know what i can do to block they loud sounds, i've been thinking ok wearing headphones, but there's a lot of insecurity and i don't want to be robbed, i just don't know what to do, i'm going crazy everyday",
        "created_utc": 1675263557,
        "upvote_ratio": 1.0
    },
    {
        "title": "I notice people in my life dismiss the severity of how autism affects me due to coming across as neurotypical",
        "author": "teatea_321",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qu3xb/i_notice_people_in_my_life_dismiss_the_severity/",
        "text": "A few months ago I (26F) found out I'm autistic and a whole world is opening up to me. I've been extremely fixated, or well I think it's fair to say obsessed, with learning about what autism actually means. My whole life I've been deeply struggling and it was torture not knowing the 'why' behind most of it. Ever since learning about autism and becoming to understand how it affects me I feel so much more at ease and most importantly understood and seen. It's liberating. \n\nI haven't told many people yet, also due to the fact I try to keep my social (media) life to a bare minimum ever since becoming depressed about a year ago. Once I know more and have my official diagnosis (I'm starting the assessment any day now, but also I know you don't need/are always able to get an official diagnosis so I absolutely don't mean to diminish/invalid self diagnosing) I do want to 'come out' with it. \n\nAnyways, the few people I did tell about it tend to brush it off or mostly say things like \"well you can't be super autistic\". Comparing me to the stereotypical autistic person who is very obviously autistic. Not that it's a contest who suffers most, but I just get such a shitty feeling afterwards about it. Just because one can't always notice how much I struggle, doesn't mean you can judge how far one is on the spectrum.. I never know how to respond to it, I don't know why but it hurts me to hear such things. My whole life is a lie to a certain degree due to my masking skills so people just now have an incorrect impression of me, even my best friends. \n\nAnd what makes it even more difficult is that when those people ask me if I can give them a few important autistic traits of mine, I just get a blank mind. There is just so much of me apparently autistic that I don't know where to begin. Right now it feels like as if someone would ask me to give a few examples of being a human. It's so broad and complicated, there are a gazillion things I'd want to explain, yet I get such a messy head and all my thoughts blend in with each other making it impossible for me to pick them apart. There are also so many traits I didn't even know were traits to begin with since it was just life and I had no idea to put it into words or give much thought to it. I don't know, it's just hard. Also, I feel like autism is not just only having traits and all, it's that your brain is wired differently and thus everything you do is impacted by/connected with it. I might be wrong about that, but it feels like it. There's not an on or off switch determining which aspects of your life will be affected by autism and which will not. \n\nAnyway, since I always freeze when people ask me what my traits are and them thinking I can't be far on the spectrum/are much affected by it, I just feel not taking seriously and get insecure. Anyone recognises him/her/their self in this? And if so, how do you cope with it?",
        "created_utc": 1675256256,
        "upvote_ratio": 1.0
    },
    {
        "title": "How am I thw one communicating incorrectly???",
        "author": "KuroNikushimi",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qp72e/how_am_i_thw_one_communicating_incorrectly/",
        "text": "I was just thrown out of my psychiatric group home because of communicatuin problems. But how is it that I'm the one to blame? How are there communication probpems to begin with? I say everything I mean just like I mean it. When I think it can be misinterpreted I even add an explaination like \"btw I mean it like this... And not like this..\" or \"this is not meant sarcastic btw\". I communicate so clearly but they throw me out because I talk in autistic ways which lead to misscommunications. But it's just them interpreting shit into weist I'm saying!! Just stop doing that and LISTEN to what I'm saying!! I can't make it any clearer!! It is so clear already. I am so often complimanted on the way I communicate so efficiently, but then they complain about miscommunication that almost everyone in the group home has with me. How is that?? I have you all the information you needed. I told you everything in the most precise manner. And still they go and make shit up and somehow I'm the one to blame???",
        "created_utc": 1675243478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autism and emotional intelligence",
        "author": "theanswerisnt42",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qp23c/autism_and_emotional_intelligence/",
        "text": "I (mid 20s male) have reason to believe that I lie on the spectrum. I never felt as though my experience of life is different from what is \"normal\" but living with my girlfriend has given me reason to believe that I should try and get an official diagnosis. For the longest time I displayed some of the symptoms - hyperfocus and obsession, getting overwhelmed by too many tasks, disliking bright light and loud sounds but none of them really impacted the quality of my life to a significant degree. However, repeated arguments with my girlfriend made me realize that I am terrible at understanding and expressing emotions. I sought out therapy and have realized that I have surprisingly low emotional intelligence and never really learnt how to handle or identify my own emotions. I have this weird trait of distracting myself, reasoning away my feelings, minimizing them or just forgetting them altogether. If I do have autism, this struggle with emotions and understanding how people feel about things fits the bill. \n\nHas a diagnosis help people deal with their low level of emotional intelligence differently or more effectively? Or should I just continue to work on this with my therapist (who is not a licensed psychiatrist)? I am afraid that getting a diagnosis which confirms my beliefs might cause me to blame my lack of emotional intelligence on autism and might cause me to stop working on therapy as seriously",
        "created_utc": 1675242886,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Think I May Have Autism",
        "author": "meduse5789",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qgxhf/i_think_i_may_have_autism/",
        "text": "Hello. 20 year old female here. I'm considering asking for an autism assessment because this is seriously impacting my day-to-day life.\n\nFor context, I have previous childhood diagnoses of depression, social anxiety, panic disorder, and PTSD (also some agoraphobic tendencies). All treatments I have tried for anxiety/depression and PTSD, like months and months of therapy, and several medications - have all been unsuccessful in helping me to cope. I also have suicidal thoughts because I get so distressed and overwhelmed. It causes me a lot of depression.\n\nIt wasn't until last month that I started learning about autism, because I am fascinated by psychology in general, and upon hearing female-specific traits, something clicked.\n\nI started balling my eyes out. Almost everything this woman said made absolute sense to me. I had been putting my social discomfort and distress down to my past diagnoses.\n\nAlso now just realised, my regular therapy sessions (with the classic cognition-focused strategies) have always left me feeling as though I'm not being supported with the right thing. The only 'negative cognitions' I have during anxious episodes is about whether people will be able to tell I'm different. I constantly feel as though I'm putting on masks, adopting different personas, and I then end up feeling like a fraud once my bedroom door shuts behind me.\n\nIt was much, much easier to cope with when I was a child, but now that I'm an adult at university, the natural thing to do is to compare yourself to others. It's inevitable, especially in such a social-heavy setting.\n\nHere are a list of the symptoms I've experienced. I promise I'm not trying to self-diagnose, I will be getting a professional assessment, but I just wanted some opinions.\n\n* From being a very young age, up until now, I have very often relied on other people to speak for me. I have always been too anxious to pay for things at the checkout, or to voice my order to a waitress. In advance, I often will ask others to do it for me. I always questioned why others didn't do this.\n* Social interactions make me extremely uncomfortable - to the point where I feel like ripping my skin off. I struggle knowing what to say, how to react to what others say, and I absolutely cannot stand small talk. I just do not see the point of it and can’t even carry it well. I feel myself 'forcing' certain facial expressions/tones of voice in order to provide the optimal reaction.\n* I constantly dread going to lectures and classes because being around people is severely uncomfortable for me. I have always managed, up until a few weeks ago. I hit rock bottom, and my sleeping pattern is absolutely ridiculous (has been for years, but I cannot break the cycle). I have missed so many classes recently.\n* After these social interactions, I will come home feeling so heavily depleted and exhausted. It takes me days to recover. I automatically rule out social commitments during this time. I also become severely depressed, shaming myself for not being able to ‘function’ properly like other people.\n* I often find I am on the sidelines when it comes to group social interaction. This was a point made in the YT video I watched, and where I started crying. I have felt this way since I was a kid. I joined a netball team here at university, and they can all communicate with ease, and actually appear as though they enjoy it. I am the complete opposite. I never ever know what to say or to talk about, how to begin a conversation. They can sense this and are visibly more reluctant to speak to me as opposed to with each other. This is so painful for me. I genuinely enjoy getting to know people, but the process just naturally feels excruciating to me? It has ruined my self-esteem. I constantly kick myself for not being able to function as others do.\n* I get so so uncomfortable the minute I walk out into public - the space I feel least comfortable in. I become hyperaware of EVERYTHING. I HATE PEOPLE WALKING BEHIND ME. It causes me so much stress. It's all I can think about the moment I hear those hellish footsteps.\n* I am so uncomfortable with social interactions, that although I managed to ‘make friends’ and find people to live with this year at university, I physically cannot go into the kitchen and cook food for myself because I am too anxious about having to have conversations with people. The most accurate way I can describe social interaction is that it’s like a chronic itch that won’t go away, and it makes you go insane. My eating habits have always been pretty messed up anyways - I go long periods without eating - it always feels like a stressful chore, because everything has to be just right - but I put this down, again, to mere depression. (So yay, not only am I mentally drained, but I'm also \\*\\*\\*\\*ing malnourished).\n* I’ve recently reflected upon my behaviours as a child, trying to recall other possible symptoms, even discussing this with my mother. I remember how before school, I would become irritated and overwhelmed when getting dressed. The seams on clothing, especially socks, would drive me mad. My mum had to cut off some of the seams so that I wouldn’t have these sort of meltdowns before school.\n* I have always been quiet, especially in group situations - but I often find that I 'mask'. I am never naturally focused on the topics of a conversation when I get pulled into one - it is always me stressing out about whether they can tell I’m ‘different’, even if I didn’t know how I am different. I hate eye contact, and do manage to make it, but it makes me seriously uncomfortable. (NB: my 'negative cognition' that I've been working on in therapy for months has literally been \"I am different from everyone else\").\n* I find I’m often overly sensitive to noise compared to others. I’ve recently been able to recall past instances of this which have resulted in conflict with others. During the first lockdown, the home dynamic completely changed, which stressed me out. I was used to being at home by myself until everyone returned from work at a specific time. My brothers both ended up working from home, so I would withdraw and avoid going downstairs as it would make me anxious. However, I could hear their online meetings from my bedroom, and had multiple meltdowns and arguments about this with my brothers, who thought I was just being selfish. Another instance of this is a time when my brother would get ill frequently. Our rooms were back to back, and each night, he would be coughing continuously. It drove me insane and led to many arguments. My mother thought I was overreacting. I’m not sure whether I was or wasn’t.\n* Not sure if this is a symptom - but I literally drink from the same cup and must eat using the same cutlery/plate/bowl when I’m at home, which nobody else can use, else I will sort of have a meltdown over it. The plates/bowls/cups have one specific colour and the cutlery is more of a rounded shape which sort of comforts me. One time before dinner, I washed my cutlery specifically and it was on the draining board. My mum unknowingly took it, and used it, and I sort of got upset. Now she knows how I am and has adapted to it.\n* I can think of some things that may have been stimming, from when I was a child and things I do now. When I was a kid, I often enjoyed spinning around in circles whilst gazing at the floor for a long time. Over time, this sort of stopped, but I instead find myself scratching my scalp or bobbing my leg up and down. Even when I’m in bed, I will find myself tapping my foot against the mattress, and really trying to feel the fabrics of my bedding? I also bite my lips and gums chronically. Not even when I’m necessarily anxious. I do it when I’m alone, which is when I am least likely to be anxious.\n* Another thing I cried at upon learning, is the feeling of having such vivid and beautifully imagined ideas in your head, but not being able to verbally translate them whatsoever. I feel I am my most authentic form when I am writing, but other than that, the 'masking' has basically resulted in an incessant identity crisis.\n* I have passionate but limited interests. I like languages and study them pretty intensely. I was told from a young age that I am very good at them, sounding like a French/Spanish native speaker since age 15 (according to my teachers). I adore psychology, criminology, and social justice. I find I am absolutely no good at speaking about other topics with people here at university. I do much better with my mother at these things. I feel at ease with her, but not completely.\n\nThere are probably more that I forgot or don't even know about, but yeah.\n\nSorry for such a long post. If anyone bothers to read it, I would be so grateful if you could offer some words of advice, or even if you feel like you can relate to something, by all means, feel free to share it!\n\n(I also posted this in another autism community on here)",
        "created_utc": 1675215416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unmasking",
        "author": "Pensgirl319",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qb4ts/unmasking/",
        "text": "(Lengthy post sorry, TW also) Hello everyone, I am 22F, and over the past year I have suspected I am autistic. I recently read the book Unmasking Autism by Devon Price and realized that everything applied to me. I related to almost every piece of it, while being somewhat relieved, I am also scared. \n\nIn my childhood I never fit in. No matter how hard I tried to make friends no one seemed to want to stick with me. It was always confusing to me because adults always said how great I was, and even some of the kids parents praised me as well. I didn’t realize it until now that I was masking so hard to be liked by everyone. Everyone in my school was very superficial. I was bullied a lot for multiple things like not having the latest kids stuff like technology and clothing. I was also very gullible in which people thought I was stupid and dumb. I was also never academically inclined, yet my parents never thought I needed help, or I rejected it to seem normal. I also have a brother, and growing up all the kids in my neighborhood were boys. I began to realize I liked hanging out with boys so much more than girls. I was more interested in guy stuff than girls stuff (not trying to be sexist) like sports, playing outside and getting dirty, and also dressing like a boy(which did not go over well in school or at home). I tried to take on the personality of a boy to try and fit in with them because I couldn’t with girls. It was only in high school that I started to “dress like a girl” and wear makeup. I was always a very athletic person and even won several awards but I was never good enough to be the best. I also had a huge obsession with Pittsburgh penguins hockey.  For the playoffs I would paint my face before school. \n\nMy sophomore year of high school I ended up having to receive treatment for depression and anxiety. I was having panic attacks, meltdowns, stopped doing school work and slept most of the time. My meltdowns got worse as high school went on and I became the “problem child.” My parents never properly learned about my diagnosis which made things worse. Sometimes I wouldn’t come home for days to get away from them. I started doing drugs which eventually led to a traumatic event (TW), SA then a suicide attempt. I never ended up graduating high school because I didn’t have the brain capacity to handle anything. After high school I got diagnosed with ADHD at 19. \n\nTo this day I still have meltdowns due to overstimulation, plans changing, not getting what I want, etc. Autism has explained a lot of the reasons why I do things. I had always asked myself “what is wrong with me” “why can’t I be normal” in reality it was the people around me that were wrong. I am so frustrated that for 22 years no one has had the slightest clue that I could be autistic. I feel like I have masked for so long that I literally have no clue who I am. I have lost all my special interests. I don’t have a fire in my soul for anything. I have had 8 jobs since I was 16 and now know that masking was the reason I was so burnt out from them and had to quit. I have absolutely no clue what to do to start the unmasking process because I have no clue what I’m into anymore. I don’t know how to embrace myself, take care of myself, or voice my needs. I am now a people pleaser, have chronic stress, PTSD and can’t leave the house without getting a headache. \n\nCan someone please give me some pointers on where to start? How to start? I just want to know what it feels like to love myself. I just want to do what I want to do. Thank you.",
        "created_utc": 1675200693,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't want to be special anymore",
        "author": "KuroNikushimi",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10qa34c/i_dont_want_to_be_special_anymore/",
        "text": "I'n so tired of always being the \"special\" one. Being \"unique\". I'm told this so often and all I wanna do is fit in. I don't want to be special, I want to belong. I want to enter a social situation and find people like me and relate. I don't want to be the weird way. Either good or bad. I just want to be like everyone else. I feel so excluded all the time and people keep on telling me my brain works differently than theirs do. I don't want my brain to work differently from them. I do love how my brain makes connections and works, but I hate how it isolates me from everyone. I'm so tired and frustrated. I don't wanna do this anymore",
        "created_utc": 1675198258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi can someone please explain this score to me? I am not sure what it means. Thanks",
        "author": "Puzzled_Rain_2517",
        "url": "https://i.redd.it/j8qcsi4e4hfa1.jpg",
        "text": "",
        "created_utc": 1675194187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Family stories confirm my autism",
        "author": "ljubenica2",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10q5n34/family_stories_confirm_my_autism/",
        "text": "The other day my sister told this story about how she took my lunch by mistake when we were both in high school. \nSo when I discovered this at lunch time, I headed to the office and they called her up because I wanted MY SANDWICH and I couldn’t stand her chicken sandwich monstrosity.\n\nAnyway they were all like “you’re so picky” and all I could think was, no that was me being autistic. But I did say it.",
        "created_utc": 1675187703,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Autism comorbid ADHD look like?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10q53p0/how_does_autism_comorbid_adhd_look_like/",
        "text": "Hey 18 male, ( ADHD, suspected ASD ) Im a bit confused on the difference between the two. I identify traits I've had my whole that are similar to both. With adhd ( Short attention span, Extreme boredom, Fidgety, Random Burst of hyperactivity, Impulsiveness, Maladaptive daydreaming ). And the no name part of me ( Lack eye contact, Lack of conversation skills, Speaking to low, Obsessive interests, Repetitiveness, Smell stim, Giving people different sides of my personality, Compulsive, Intrusive thoughts, Confused about my empathy, Not expressing my emotions, dislike certain taste or textures in foods ) that's my struggles in life. But I don't relate to Strict routines or schedule, I don't do formal speech, im the opposite of those lol.  How does Autism + ADHD take shape in you?",
        "created_utc": 1675186438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice, guidance etc. please!",
        "author": "thesagebrushkid1",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10q3pm6/advice_guidance_etc_please/",
        "text": "Hey everyone\n\nSo I’m just after a bit of guidance/advice.\n\nI’m 33m, UK, gay if that matters. It’s been suggested to me that I could be autistic to some level, or possibly ADD, and I’m just after a bit of guidance on how to pursue this, and a big problem I’ve got is… how do I know?\n\nI’ve been down a couple of rabbit holes trying to find sort of checklists for adult diagnoses and what have found is that it’s tricky and hard to pin down. I’ve tried a couple of different tests with different results, in general I score relatively high on the asd side of the test but higher on the neurotypical side. The last one I did was with ADDitude magazine online which they said was designed more with adults in mind and I scored higher on that one. I read the odd post on here talking about daily autism things and there a bits I really relate to, others that don’t. I’ve got a few friends in choir who are open about their autism, they’ve said they notice things in me too (I stim a lot particularly if there’s music). Other friends have suggested maybe ADD or something instead of autism? I talk a lot, massively over share and have huge trouble with time keeping, guess that’s their thinking. \n\nAs a disclaimer, this isn’t a worry thing for me. I’ve always felt like my brain works different to others. It’s lead to a diagnosis of depression/anxiety, I’ve had counselling sessions for that and I’ve been pretty introspective since. Counselling revealed I had a fractured sense of identity, so when people have suggested anything neurodiverse even as an off-the-cuff remark, it feels like it could be a missing puzzle piece. Like it could be a big step in understanding and accepting me, which is all I want. I just want to be happy with whoever I am. \n\nSo if I was to follow this up, what’ve I got? Some vastly different test results, a few comments from friends and family, and a faint grasp on myself. Given how crappy health services are in the uk right now we could be waiting 18 months or longer to even get an initial assessment. A mate of mine went private for his adhd assessment; changed his life for the better but it cost about £3k that I don’t have. So it would be a long waiting time for what could be me just having a prolonged identity crisis or lifelong depression, and i would’ve deprived someone of the service who actually needed it whilst I was essentially identity shopping. \n\nI’ve tried rereading this and it’s a mess, blessings to whoever’s made it this far. But honestly I am a mess. I can’t stop fixating on all this. Every thought or action I do I’m thinking “is that autism?” Even when I got the depression diagnosed I remember thinking “there’s more to it than that,” like there’s always been something else different. I don’t want to say misdiagnosis, I’ve just felt like there’s more to it. \n\nI overthink a lot anyway but this is making me lose sleep. Am I? Aren’t I? What’s my reasoning when the criteria’s so wishywashy? Is this just my depression looking to tick a box? Or some other mental health quirk? Just me trying to squeeze into yet another identity? Because there have been a lot of unsuccessful attempts at trying to fit into… anywhere! \n\nVenting over. I’d be grateful for all comments, I think I need a different perspective. If there’s anyone reading this from the uk, in particular if you’ve had experiences with an adult diagnosis I would love to hear from you. Feel free to DM. \n\nThank you all for reading!",
        "created_utc": 1675183224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I so paranoid?",
        "author": "AdEnvironmental7794",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10q28q2/why_am_i_so_paranoid/",
        "text": "Ok, so I do have a history of abuse, and I recently found out I am autistic, but I don't know if what I am experiencing is typical, or a weird result of my life experience, or another mental health issue. I always feel like I am being watched. I CRAVE being alone, but often don't feel fully alone even when I am by myself. I talk out loud to myself, maybe like as a narrator for this imaginary audience. Just in case someone is watching or listening, so they know what I am doing and why, like I have to explain it. I feel like people are looking over my shoulder when I am on my phone, to the point that I will skip a song bc I am afraid someone might judge me for seeing that I listen to it. I feel like I am under constant judgement. Even before the days of cameras being everywhere, I felt like all eyes were on me. I know it seems like an egotistical arrogance, but it is torturous. Cognitively, I can say \"Most ppl don't give a crap what I am doing and they are thinking of themselves or other things\". Yet, the FEELING is there. I was judged and berated a lot as a kid by my parents and brothers for being weird and doing weird things, so maybe it is residual hyper vigilance from that. MY own internal voice is super critical, so maybe it is a projection of that onto others, assuming they are watching me and judging me just as closely and harshly as I watch and judge myself. Maybe I have a paranoia disorder. It is exhausting though and makes my anxiety increase tenfold whenever I am around others. It is like I have to be extra alert about my behavior in order to not get judged, so I am in performance mode, but then it backfires and makes me seem weird anyway bc of heightened anxiety so I can't win. It never fully goes away. How do I stop it. Please help me. What is wrong with me and how can I have peace? Why does being around others feel like it is sucking my life force from me.",
        "created_utc": 1675179730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you relate to my experience of connection?",
        "author": "ithinkimighthaveasd",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10pz6gz/do_you_relate_to_my_experience_of_connection/",
        "text": "So, my online assessment starts tomorrow! I'm not looking for answers to my questions, just your perspective, do you relate?\n\nI've spent five months pondering and researching the question; am I autistic? While I worry that I'm looking for an excuse rather than an explanation, that I'm using confirmation bias to make it fit, I'd be very surprised if I'm not Autistic at this stage.\n\nMy therapist, who is autistic herself, thinks I am. If I'm not then where does that leave me, after nearly two years of therapy? She said she suspected it from the moment we first met.\n\nI had a very profound experience last week with her. For the first time since I started therapy we connected, I connected with my body and with her. I could feel all the swirling energy inside me and we held eye contact for what seemed like forever. I don't usually let people inside my shell, it took nearly two years to both properly access my own body and connect with her. She's one of maybe 3 people I've ever really connected with. It was an alien experience for me. Strange but profound. Nice but unsettling.\n\nWhen we do relaxation and body scanning excercises everything slows down, my thoughts, my speaking, even finding the right words is harder. It takes me a long time to say anything. Is that my natural state of being? My unmasked genuine self. In that moment I can feel my life force, my energy bubbling away inside me. I don't normally feel that. It feels strange to me but it must be the real me, I've forgotten what it feels like to be me.\n\nWas it the right thing for my therapist to not tell me I might be autistic straight away, to guide me to finding out for myself, after 1 ½ years of therapy. To get to know myself first. I think it was, the connection was intense, I think I'm very lucky to have her as a therapist. \n\nDo people normally feel all those swirling sensations in the body that I have to consciously access. It feels so strange and intense to me. People can't always walk around like that can they?\n\nI suspect it's not the autism that prevents me from making connections but the shell I have created to protect myself, maybe from the way I have been treated because I'm autistic, maybe from addiction, maybe from childhood trauma. It's a lot to untangle but either way that shell has prevented me from making any real connection with myself and with others. It's time for it to go I think, time to be vulnerable and sensitive and emotional ..and who cares how it affects others. It's time to look after myself for once. \n\nThank you for reading my musings, and I'd be interested to hear your perspective. Does it resonate with you?",
        "created_utc": 1675172077,
        "upvote_ratio": 1.0
    },
    {
        "title": "infodumps to someone new &amp; experiences regret in shrimp colors",
        "author": "rbwolves",
        "url": "https://i.redd.it/sw5tbl452dfa1.jpg",
        "text": "",
        "created_utc": 1675145002,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice For Going to New Places",
        "author": "ScarletRoads",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10poq1g/advice_for_going_to_new_places/",
        "text": "I'm not sure if this is the right place to go to, but I'm gonna ask anyway. I'm pretty sure I have autism, and I think this problem is related. I also don't post often so I'm sorry if the formatting is weird.\n\nI (20F) absolutely cannot go to new places/new environments unless I am with somebody I trust, or somebody I know is there. It's extremely annoying for me. For example, a few months ago I had wanted to go to a store I had never been to before, and my brother had agreed to go. But when it came time to going, he wasn't in the mood, and while I really wanted to go, I couldn't make myself go alone, and ended up having a bit of a breakdown in the living room. He agreed to go a little later and I was able to go, and everything was fine, but I think that incident emphasized to my family that I usually ask for company for a reason.\n\nAnyway, I really want this gone, I've had to cancel some plans that I was planning for the summer because I was planning to go alone, and I've had one of the worst weeks of my life of breakdowns several times a day if I think about for even just a few seconds. I've readjusted plans to go somewhere else where I could meet up with people I know and I'm magically okay again, a little stressed about flying by myself, but not an abnormal amount.\n\nIf anyone has any ideas on how to try and work through this so I could maybe be at least a little better about it, I would appreciate it. It gets in the way, but I've been like this as long as I can remember, and I don't even know where to start with fixing this aspect of me. \n\nThank you",
        "created_utc": 1675139944,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you “come out” as an autistic adult to parents?",
        "author": "wiildsage",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10pogy3/how_do_you_come_out_as_an_autistic_adult_to/",
        "text": "Hi all! So, I’ve been in a weird spot lately— i found out that I’m autistic back in 2020, and the time spent since then has been a lot of introspection, reframing, and skill-learning. I feel significantly better about being autistic, and I wholly am glad I learned that about myself. I’m openly autistic to all my friends and coworkers, but for some reason I get really anxious thinking about talking to my mom about it.\n\nI’m 26, and we’re pretty close. She’s an open minded person and I feel like she was really good at working with my autism growing up before I even knew what it was— I have some suspicions she might also be autistic, but that’s another subject. \n\nMy only worry is that I don’t know if she has any education on what autism is outside of like, bad media portrayals, and I’m worried she’d dismiss it if I told her. Does anyone have experience with this?\n\nAlso: I know that she doesn’t “have to know”, it’s something I’ve thought through a lot and *want* to share with her.",
        "created_utc": 1675139326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please tell me someone can relate to this. I need help",
        "author": "siterock",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10pmtia/please_tell_me_someone_can_relate_to_this_i_need/",
        "text": "So I have this issue were two people at my job who have authority over me Regularly plant themselves in front of me and just dump a 10 to 15 minute monologue on me about their personal life. I feel like I have to mask so hard.  I start fidgeting and getting nervous. Meanwhile they are apparently oblivious to the effect it’s having on me.  In my mind it’s obvious but I can’t tell them to get lost because that would affect my employment. Hours later I’m still all messed up inside about it because of the injustice of it.  This is probably going to sound hyperbolic, but in my mind it’s almost to the level of psychic rape.  I’m in my mid-40s and just now realizing I’m Autistic.",
        "created_utc": 1675135431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know the type od doctors tocseek for screening",
        "author": "BuckinsterAbbey",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10phwfb/does_anyone_know_the_type_od_doctors_tocseek_for/",
        "text": "Hello, I believe I am on spectrum. I have tried to contact just shy of 10 different places trying to get a screening for myself a young adult. I looked via my health care prov8der app and no one would screen me, only one place would after doing therapy for a few sessions which doesnt seem very effienct. Does anyone know any way to go about screening? Or should I just bite the bullet and do therapy?",
        "created_utc": 1675121997,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you ask for help when you don’t even know how to articulate your problem?",
        "author": "crumpleforskin",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10pgu03/how_do_you_ask_for_help_when_you_dont_even_know/",
        "text": "I was just diagnosed recently and I am a problem solver so I am trying to solve a lot of my issues with this new found context, but I just can’t seem to find the right words to explain what I’m dealing with. \n\nAvoidance of hobbies, staring blankly and daydreaming instead of taking care of responsibilities, trouble getting out of certain sitting positions, etc. I feel like a shell when I’m not at my job.\n\nI have been like this since puberty and I always blamed depression, but even when I am doing better with my mental health it doesn’t seem to subside. I think maybe I need more structure and routines? But nothing I read or watch resonates with me. \n\nI feel like a ball of wasted potential",
        "created_utc": 1675119356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sometimes I don't know how to play my video game - I feel senile",
        "author": "lilblu87",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10pdnnc/sometimes_i_dont_know_how_to_play_my_video_game_i/",
        "text": "I play the same sports video game all the time. It's basically my special interest, plus I use it for socialization. \n\nDespite everything being the same, sometimes I can't differentiate the team colors (red and blue). Some days I see them better than others. Sometimes I just can't see stuff, or see it right. I don't know how to explain. I only have this problem in this video game, I don't play other video games.\n\nI think it's all in my head. I think it's the way my brain is processing things, I don't know. \n\nThere are also some days where it's like I don't know how to play. Obviously I do know how to play, but it's like I don't know what to do even though I do. It's like I forget how to use strategy and stuff.\n\nPeople get upset with me sometimes because they think I'm trolling or drunk.\n\nI think this is something related to autism, but I don't know. Could be my inattentive ADHD I suppose. I definitely think the difficulty seeing stuff is a sensory issue related to autism. Can anyone identify with any of this? I'm starting to feel senile.",
        "created_utc": 1675111934,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Should I Do If My Child Has Autism?",
        "author": "melaniasm",
        "url": "https://www.sciaticaweb.com/2022/03/what-should-i-do-if-my-child-has-autism.html",
        "text": "",
        "created_utc": 1675100680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do these behaviors seem consistent with being on the spectrum?",
        "author": "torpedolife",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10p85jr/do_these_behaviors_seem_consistent_with_being_on/",
        "text": "My 8-yr old daughter was diagnosed as being on the spectrum. There are some behaviors that she has that I am wondering if they are consistent with Autism, or if they are just bad behavior, or if there might be something else. Can anyone please tell me if any of the following seems consistent with Autism?:\n\n\\- she is VERY, VERY jealous of her sister and it very frequently leads to fights. Examples: during Christmas she will open her present, and before even looking at what she got she will look at what her sister got and find something to complain about. During dinner she might get very upset if her sister has a larger piece of pizza, or more slices. There are many other similar examples that I could provide.\n\n\\- Often times she might not be happy with what she has for dinner, and she might start yelling something like \"hamburger\" and she might do it over, and over and over again for a long period of time. She will yell and scream that she is hungry and she is not going to eat what she has, even though it will be something that she normally eats. However, she might slowly start eating what she has but not want us to know she is doing it. \n\n\\- she very often will tell someone to \"shut up\" and when we tell her that it is not \"nice\" to say that she will completely deny saying it. It is almost as if she says this without being able to control herself. She also when very frustrated will say the \"F\" word and completely deny she said it. There are other words she says sometimes and she denies doing so. It does not happen all the time, and it is usually based on a situation that makes her do this. When her sister is being silly and she is annoyed by it, when we tell her to do something that she doesn't want to hear, etc.\n\n\\- I will very often tell her to do something, such as, clean up her room and she can watch for 20-minutes, and she will not fully pickup what she is supposed to, and then demand to watch and when I try to explain that she did not do what she was supposed to she will scream and tell me I \"promised\" and she will yell and scream and it will go on and on....\n\nThanks for any feedback.",
        "created_utc": 1675098860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resilience and Coping in Autism: Research Participants Needed!",
        "author": "AmyDHealthPsych",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10p6faz/resilience_and_coping_in_autism_research/",
        "text": "[removed]",
        "created_utc": 1675094525,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't think I'm autistic but my gf thinks I am and I want to rule it out",
        "author": "tinydragonn",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10p647p/i_dont_think_im_autistic_but_my_gf_thinks_i_am/",
        "text": "I am not looking for a diagnosis from reddit, I honestly just don't know where to go from here and this community seems like a great jumping-off point for next steps. For context, I am an 18-year-old AFAB white cis girl. I have a lot of privileges and want to acknowledge that in this post because I feel it is important. I want to start off by saying that I love my gf so so so much. We have been dating for about 4 months and she is the love of my life, always supportive and kind and means everything to me. Being around her brings me joy and happiness on a level that I've never experienced before, and I feel so special and privileged to have found her. She is diagnosed autistic and ADHD, and she and I both find similarities in how we perceive and interact with the world to such an extent that one of our inside jokes is that I'm the \"most neurodivergent neurotypical person\" (ik its stupid lol). I feel guilty about even posting here because I worry that I could be offending people who might believe I'm trying to seek attention or invalidate them by mislabelling or misnaming whatever is going on with me. Everyone has a different way of seeing the world, and I am honestly hoping that I'm not neurodivergent, just a confused nt with a shit ton of teenage angst and hormones floating around in me and making me go bonkers. I sincerely apologize to anyone I offend by making this post, and I will delete it no questions asked if it is offensive to the community in any way, shape, or form. \n\nMoving on from my introduction. I have been diagnosed with several conditions (by legitimate psychiatrists, I had a stay in a hospital due to anorexia (or at least that's what they presumed it was) and I received many a diagnosis in- and out-patient concerning that stay. A psychiatrist who had access to my chart and who I met once diagnosed me with two things based on months of evidence gathered in and out of the hospital, based on up-to-twice-weekly meeting with different therapists (outpatient treatment for ED's was very supportive to say the least). He told me that I had mild OCD and something called obsessive-compulsive personality TRAITS, he made it very clear that it was different from obsessive-compulsive personality disorder. Upon my asking him what the hell that meant, he said it reflected a \"rigid and inflexible\" personality and that I was \"governed by routine\" and delighted in \"sameness\", all of which I wholeheartedly agree with. I personally loved high school and find myself struggling in university for that very reason-- in high school I had strict routines with inflexible timing. I did the same thing every day, with structure and rigidity, and I thrived. I had a 94 average because everything was predictable and revolved around a certain formula of expectations and schedule. I would re-live almost the same week for 4 years and was perfectly content doing so. I find myself in university missing that routine and structure, and notice my grades and time management skills have plummeted. Occasionally, I cry when I have to do work simply because I can't face the idea of having poor marks or because I'm so behind that the idea of getting started is beyond overwhelming and causes me great distress, or because the 2 hours of unstructured work time is so out of my attainable goals. I constantly and incessantly compare myself to others, and have everyone around me set on a pedestal to which I must aspire. Everyone else has better study habits, better grades, better time management, better extracurriculars and exercise habits and overall health and a better body and appearance and overall life than me. I constantly feel inadequate and distressed over this. I don't know if this reflects some kind of mental instability or condition or simply a neurotic and weird personality. \n\nI also have been previously clinically diagnosed with anxiety at age 9, and have been dealing with that since I was 14. Many of my anxious and OCD traits, as well as leftovers from anorexia and a damaged relationship with food, are what lead me to think that I might be going down the wrong rabbit whole here. \n\nAnother thing that my gf likes to bring up is my intense interests. I have a love of everything to do with Tudor England to an extent that I read every book on the subject in my hometown's library. This has been a consistent pattern through my life, beginning with an intense obsession with dinosaurs at the age of 6 and progressing through the stages of (from youngest to oldest in age): space, rocks and minerals, Anne of Green Gables and Little House on the Prairie, PJO and Harry Potter, archaeology and history, space again (specifically the planet Mars), musicals, the Tudors, Queen Victoria and her descendants, the British monarchy as a whole, plant species, the last of the Romanovs, and Christian religion and theology. These interests have dominated my life at various stages, being things that I would think about constantly and google, read about, and obsess over, frequently over-sharing my interests with my family/friends and boring people to tears (which I feel immensely guilty about after realizing I'm doing it, which is often nowhere near an immediate realization). \n\nOne other thing that she brings up (that I agree is a \"weird\" or \"quirky\" personality trait) is my food aversions and rituals. I like to dissect, peel apart, order, and overall eat food in an abnormal and sometimes gross way. For instance, I eat Boston cream donuts with the cake part first, nibbling around the cream. I then eat the cream on its own, leaving the chocolate icing in a fragile shell on top. I then roll the chocolate icing up and eat it in one fell swoop. I also have to eat trail mix in a certain order, and have such a violent aversion to meat (such so that I became vegetarian as soon as I moved out and my parents no longer forced me to eat meat despite tears, complaints, and physical reactions to their great annoyance) as well as some other oddly textured foods (gagging and spitting back up) and she has seen this in real-time (and I don't blame her for finding it a little gross). I have also been diagnosed with severe anorexia and spent time in the hospital for it, but honestly, I've had a weird relationship with food my whole life- not so much body image-focused but lots of picky and ritualistic eating and consumption habits.\n\nI really do genuinely think that my girlfriend is wrong, and for my sake, I hope she is. I simply don't know what to do, because I would like to prove to her that I am nt and for lack of a better word, simply have a quirky personality type (like everyone in my life has been telling me since the day I was born). I would rest at ease if someone could tell me to stop appropriating this community and that clearly I am just a confused, attention-seeking teenage girl whose every action indicates an overprivileged nt person with too much time for introspection on her hands. Sorry for the long post by the way!",
        "created_utc": 1675093785,
        "upvote_ratio": 1.0
    },
    {
        "title": "brain jumping to conclusions",
        "author": "blaurascon",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10p5jb7/brain_jumping_to_conclusions/",
        "text": "i have noticed a particular type of anxiety(?) i get, and i'm curious if there's like.. a name for it?\n\nexample: i just changed a character name in a game. i wanted to ask for opinions in map chat for which name sounded better (because i had a few that sounded cool) but i didn't, because *i was worry-convinced that someone else would make a new character just to steal the name*\n\nthis happens.. a lot? i want to do something but ultimately don't because i'm worry-convinced that someone is going to do something hostile in response. i feel like it might just be how my brain's reacting because that's happened to me a lot / i've seen it happen a lot in the past, but i'm curious if there's like, a name for it or something? or if my brain is just trying to protect me?\n\ni'm posting this here because i feel like it might be related to being autistic, since i've tended to walk right into these sorts of things in the past, and i'm curious if yall have had similar issues",
        "created_utc": 1675092370,
        "upvote_ratio": 1.0
    },
    {
        "title": "I never considered myself to be disabled until kids",
        "author": "amandacisi",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10p163u/i_never_considered_myself_to_be_disabled_until/",
        "text": "I always struggled growing up and into my adult life, but 30 years in, and I never considered myself to be disabled until now. I have triplet toddlers and, while they would be a lot for anyone, I feel so debilitated all the time. They zap me of everything. I’ll “recover” by myself upstairs for a couple of hours and then after 30 minutes with them again, I’m losing it. \n\nMy husband is amazing and so supportive and understanding. It’s hard to not feel selfish and like I’m adding to his burden, but raising these kids while being autistic is so fucking difficult. \n\nLike I said, I finally now see this as a disability, at least in this way.",
        "created_utc": 1675083166,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't handle seeing pranks/practical jokes",
        "author": "No-Armadillo-3562",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10oziqz/i_cant_handle_seeing_prankspractical_jokes/",
        "text": "Does anyone else experience this? I don't cringe at much, but I can never watch prank videos without cringing. I get so uncomfortable and can't watch.\n\nThis also applies in person. I don't like lies or when someone doesn't know the truth... So even fun pranks that end in presents or surprises are a no-go for me. \n\nFor example: pretending to give bad news and it turns out they get a gift instead.\n \nIt just feels like deception for the sake of imo",
        "created_utc": 1675077468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Misdiagnosed earlier in life",
        "author": "RogueKhajit",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10os94v/misdiagnosed_earlier_in_life/",
        "text": "I was talking today about how autism helps explain a lot of things about myself. And I came to the conclusion that I was misdiagnosed as bipolar in my early teens. Was anyone else misdiagnosed as something else?",
        "created_utc": 1675051660,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't feel autistic when I'm alone",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10orjj0/i_dont_feel_autistic_when_im_alone/",
        "text": "Recently, I've started watching shows alone at night in my room after everyone's gone to bed. I love it. I'm alone finally and doing something I enjoy. I have found, however, that I do not feel autistic at all during these times (by feeling autistic I mean feeling as I normally do during the day).\n\nI can physically feel different from everyone around me during the day and basically everything is more difficult for me. But, I do not feel like that when I'm alone at all. I feel what NT must feel the majority of the time. I don't feel like I'm struggling, I even enjoy being there and idk I just like it. \n\nIs this a thing? Because if I spent the rest of my life alone I wouldn't even remember I had autism. I feel like it comes out when I'm around people",
        "created_utc": 1675049526,
        "upvote_ratio": 1.0
    },
    {
        "title": "can being drunk help you unmask?",
        "author": "i_devour_gluee",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10oisfr/can_being_drunk_help_you_unmask/",
        "text": "Basically the title. I got drunk yesterday night and I started stimming a lot, like hand flapping and being very happy and talking to people I didn't even know without feeling out of place. I am always scared I'm faking it but doing that while drunk and so not consciously modifying my behaviour kind of proved that I do mask.",
        "created_utc": 1675026776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music sensitivity?",
        "author": "Eastern_Roll6374",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ogil2/music_sensitivity/",
        "text": "I'm new to this subreddit so hello all 👋\nDoes anyone get very profoundly emotional with some music? With songs with sad subject matter it's a given, but for me even the ways chords sound together in a song with neutral or positive subject matter makes me feel very deep emotions. Like one time, I was with friends and music was playing in the background, and a song came on that is generally pretty calming for others but idk, just the way it sounded made me start tearing up and feeling melancholic when everyone else was okay.",
        "created_utc": 1675021430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could this be stimming/repetitive behaviour?",
        "author": "NuclearAugustus",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10oggxu/could_this_be_stimmingrepetitive_behaviour/",
        "text": "I don't do what are usually the main examples of stimming. Hand flapping etc. But there are a few things that some sources list as repetitive behaviour. \nSkin picking. I do that almost constantly, mainly around the nails but also on the rest of my body. When I was younger, I used to chew on my nails, which basically got replaced by picking. Some sources list it as potentially repetitive behaviour. \nLeg bouncing, leg jiggling, whatever you want to call it. Also sometimes listed as repetitive behaviour. I do that a lot as well, but the majority of people does this too. I'd say that I do it a lot more than other people, but that doesn't have to mean anything. \nThen there are a few other things I can't really name, like kind of swaying when standing, or bending my knees through the back. Rocking (on a chair) is commonly referenced as well. Doesn't everyone does it, but it becomes less common the older you get?",
        "created_utc": 1675021324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you guys help me figure out this symptom?",
        "author": "The_Stellar_Boy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ofwi7/can_you_guys_help_me_figure_out_this_symptom/",
        "text": "Hi, it has been 3 months sense I started my research to understand autism and also find out if I'm one myself. So, I wanted to ask about the criteria A point 2, especially the part where it says:\n\n&gt; A total lack of facial expressions.\n\nHow does it work? Because I believe this happens to me, sense forever my family pointed that I have a face that looks like \"you are always bored\", same goes for my couple of friends, they say my face is scary when I talk because my eyebrows are the only thing that moves to express myself. I do notice I don't know how to smile, because during family pictures I feel my lips stretch like a smile but when I see the result is like a pocker face?? I can manage a selfie because I can see my face and monitor my smile easily.\n\nI honestly don't know, because I do smile while I'm laughing, I think I do a confused face or angry one when the situation requires it and while I mask I'm constantly smiling and (at least try to be) expressive.\n\nSo, knowing this, do you guys think I apply to that symptom?",
        "created_utc": 1675019965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just me or do some personalities bring out the worst of your autism?",
        "author": "itsrainingbluekiwis",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10oey7g/is_it_just_me_or_do_some_personalities_bring_out/",
        "text": "",
        "created_utc": 1675017684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lack of stimming and repetitiveness?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ocqtv/lack_of_stimming_and_repetitiveness/",
        "text": "Hey, 17 male ( ADHD, Suspected ASD ) I don't think I stim and I don't know if I have repetitiveness. I do not have none of the main forms of stimming, like ( Hand flapping, rocking, bouncing leg etc ) I don't do none of them. The only thing that comes to mind is this weird thing I do, it's very unsanitary but I use two fingers and push my top lip up against my nose to smell my top lip and do it repeatedly ( I know, weird ). When I feel bored or underestimated ( idk what to call it ) I start making weird gibberish noises or start repeating phrases I like using when I don't know if that counts. Idk if I've had repetitiveness my whole life ( I have bad memory skills ) but all I remember is I was fidgety, I'd repeat phrases I heard from the internet, I would stack or spin or flip objects. That's about all I can remember. Could ADHD hide or block stimming? And do you relate?",
        "created_utc": 1675012423,
        "upvote_ratio": 1.0
    },
    {
        "title": "not going to bother explaining autism anymore",
        "author": "emily_thehuman",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10oba2t/not_going_to_bother_explaining_autism_anymore/",
        "text": "When someone challenges me on details of my autism, I'm just going to refer them to some places to do their own research. If they're genuine they can teach themselves, and if not then who cares. \nAny recommendations for some reliable online resources to refer them to?",
        "created_utc": 1675008744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is telling a new partner I don't know how I feel about them helpful or hurtful??",
        "author": "idekwidek",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ob92u/is_telling_a_new_partner_i_dont_know_how_i_feel/",
        "text": "Been casually dating someone for a couple months now. We're both not looking for long-term, and he'll likely be moving out of province within the year. We agreed that we'd  like to continue to communicate as friends at that point.\n\nI really struggle with identifying my feelings about ppl and come from an abusive past where now everyone who is nice to me feels very boring. I really don't know if I like him just as a friend or if I want to continue going out. At times the coupley stuff feels forced but the nonsexual intimacy is really great for both of us.\n\nMy brain says I should be upfront about where I'm at emotionally with him, because I am confused and haven't been gaining any clarity on the matter. But then I considered maybe this would be rude and hurtful/unnecessary?   Any opinions much appreciated",
        "created_utc": 1675008673,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know how to approach the subject",
        "author": "platosaidmaybe",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10o57i6/i_dont_know_how_to_approach_the_subject/",
        "text": "Hello again, guys!\n\nI've (25F) been here before through a previous post questioning if what I see in my boyfriend's (25M) behavior may be related to autism. You were incredibly helpful and supportive. I even walked to my own therapist about these things and he agrees with me that there's something there (but of course he didn't diagnose him in any way, only agreed with me).\n\nYou see, my issue last time was our communication. It still is. I don't hold it against him, I'm not directly upset at him because I'm sure he doesn't mean to make me feel insecure and more. But it is something that isn't doing me well and I'm still too nervous to approach the topic.\n\nI know I have to be very explicit and direct. It should be easier and quicker, but I'm not one to talk about my feelings so plainly. Also, my insecurities also come from a place of fear of rejection so, despite being a super simple issue (he doesn't talk to me during the week, we only bond during the one day we see each other), I'm extremely nervous.\n\nI realized I have another issue too and that's more delicate. Always the next day after we see each other (in this case, we saw each other yesterday), I feel weird. Like something is missing. I'm pretty sure it's something to do just wanting to spend more time with him and knowing what lies ahead of me is a week of silence. And then comes the urge to just tell him how I feel about him (i.e. I think I'm definitely in love).\n\nWell, the problem here is that last time I tried to convey my feelings, it wasn't great. I sent a text that took over 12h to be replied and it just went like \"I don't know what to say\" plus a recognition of my feelings. By then I had just said how much I like him, I didn't use any scary words like love.\n\nI'm not one to talk too much about feelings but I do feel a lot and sometimes it overflows into words. I already know he's not one to talk about his so I'm very afraid of saying something that will scare him or shut him off. But it feels so not great to keep this inside. And it does feel one sided too if I talk about it alone.\n\nI'd wait for him on the topic, but I can sense it's not coming. I don't know what I do because I want to feel better about it and, also, loved (I know he likes me, but I don't know how or how much). Any tips about if I may or may not approach this topic?\n\nI'll already thank y'all for any possible comment. And again, still I don't proofread my posts haha.",
        "created_utc": 1674990064,
        "upvote_ratio": 1.0
    },
    {
        "title": "difficulty with touching people when appropriate",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10nxjgq/difficulty_with_touching_people_when_appropriate/",
        "text": "I'm not very big on physical touch (I do like it but it has to come from the right person, from most people I don't like it) and because of this I also assume other people aren't big on it and so I avoid touching anyone ever.\n\nI've realized touching to different degrees is important in relationships, whether it's a friendship or even when flirting. It creates a special bond and although it's not necessary, based on my experience I can say I have felt out of certain situations because of it. I've also had a few crushes over the last few years but because I never touched them they obviously didn't know. \n\nI did try to touch one of them when the situation allowed it (nothing bad. It was, for example, grabbing their arm when leaning for a kiss on the cheek, which is the typical greeting here) but I then felt bad about it. I understand that kind of playful touching is expected when you're flirting but is it okay for me to assume the other person is okay with it? Should I go for it and engage in physical contact? But, at the same time, this brings another dilemma: am I an asshole for only engaging in physical touch with people I find attractive? Like, I would never playfully lean on someone or rub my hand through their hair unless I found them attractive and was trying to get their attention. Does this make me a superficial asshole?",
        "created_utc": 1674962296,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might be?",
        "author": "RogueKhajit",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10nu1cd/i_think_i_might_be/",
        "text": "As a child I had to be pulled out of class for special education sessions. It started with showing me how to read as I would read thinks backwards. For example, I would read OK as KO. That progressed into being pulled out of class for speech therapy. First it was correcting my L sounds, showing me how to properly pronounce L words and sounds. Then it was the R sounds which I proceeded to struggle with for years. Seven years later I was dismissed from speech therapy and told they couldn't help me anymore.\n\nAs a teen I struggled a lot. I was bullied all my school years for either my speech or my lack of interest in having a boyfriend. I was attacked by groups of classmates for things I said or did that offended someone without my knowledge. School staff would take the attackers side and punish me instead.\n\nIn high school my family moved two counties over and the new school was a modern building that felt like a maze to me. I couldn't figure out how to navigate it and eventually dropped out at 17. During my early adult years I struggled even more. I couldn't control my emotions and would have panic/anxiety attacks. \n\nIt wasn't until I was 21 that I got a job, after escaping my stepfather who forbade me from seeking any employment. He went so far as breaking my bedroom door down to keep me from locking him out of my room when I wanted to be left alone.\n\nMy first employment was a disaster. The company was eventually sued for breaking overtime laws. I got in with temp agencies after that and didn't get a full time job until I was 25. I stuck with the company for years out of a false sense of loyalty even though they were toxic. The management blamed me when a coworker sexually harassed me. I was yelled at by management in front of customers just for following instructions of other management.\n\nThat is my life so far. I constantly struggle with keeping in touch with friends and family. My mother has to remind me to call my dad, if not I will go 6 months, a year, two years, without calling them. I have friends I love dearly I haven't spoken to in years. And it's not because I don't want to, but because I tell myself I will but either get distracted by other things or feel anxious at the thought of reaching out. If the person isn't physically around me daily I can't bring myself to call or text them.\n\nWhen I'm in a work setting I put on what I call my customer service mask where I act outgoing and friendly. My new boss seems to adore me because he says I have a bubbly personality. But it's just a mask. I have a dark, morbid, sense of humor. I'm antisocial. I hate talking to people and I always feel like I never say the right thing when I'm forced into a conversation. \n\nI have a fiance now and I feel like I'm a horrible partner choice because there are lots of times where I can't even stand having someone touch me. Many times I pull away from him when he tries to just grab my hand. It's not because I'm mad at him or don't love him. I just don't want to be touched. \n\nI will go weeks without doing things like chores because other things get my attention. I need to do that but I have to do this instead.\n\nI realize I am all over the place with this and I'm sorry. Last thing I will add is my mother refuses to believe that I might be on the spectrum despite all the special classes I had to attend for years. She says me and my sister were born \"normal\" but I don't feel normal and my sister was also diagnosed with MID.",
        "created_utc": 1674951745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books for NT family members?",
        "author": "nibbycat2022",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10nr7n9/any_good_books_for_nt_family_members/",
        "text": "My wonderful spouse is very supportive and compassionate, but I find myself struggling to educate him on how to support a ND person when I’m in the midst of a shut down or struggling to learn how to cope myself. Are there any good books for NT family members to help them understand ND issues? \n\nI was diagnosed at age 51, after 21 years of marriage, so this is a steep learning curve for both of us.",
        "created_utc": 1674944237,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am the captain. But does it make sense?",
        "author": "LivingtheAfterparty",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10nk0mf/i_am_the_captain_but_does_it_make_sense/",
        "text": "I was thinking about how I process memories like scenes from a movie and how what I am doing is different than what a neurotypical person would do when I thought of this.\n\nIf each person is a ship the brain would be captain and crew. For most of you say ship you are talking about the whole thing thing. When you think of ship crew do you not include the Captain? To me I am the captain my crew mostly does their jobs but my pilot is a lazy jerk (executive distinction). My engineering crew is on point though (good at math,  pattern recognition). \n\nI think maybe neurotypical have captain and crew level awareness. The boat/body goes where they want and does what they want and they mostly exist in the physical world.\n\nMy awareness is that of the captain always watching his crew and making corrections. My boat/body does what I want it to mostly, but only when the whole crew are doing their jobs. I still see the same world but through the eyes of the captain in his ship. I think most people just are a functioning ship on the sea of life all as a single unit.\n\nDoes this make sense? I might just be having too tired but can't sleep thoughts...",
        "created_utc": 1674925804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poker Face",
        "author": "kyrincognito",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10nc5a5/poker_face/",
        "text": "So I'm watching a show called Poker Face. And it's literally giving me flashbacks to being a kid. Idk if I'm right, idk how much my perspective is skewed, although I can acknowledge that statistically it's usually skewed less than I think it is. Take a ride with me so I can ask ya'll a question, please. \n\nThe premise of the show is that is that the main character ALWAYS knows when people are lying. She also has a sense of justice so strong it regularly proceeds to almost get her killed. \n\nThis reminded me of a childhood and young adult memory I fucking BURIED. B.U.R.I.E.D.\n\nI always knew when the people I'd bothered to get to know, were lying. Upset and telling me something different? Bullshit. I just knew. I always knew. \n\nAs a kid I had so little understanding of this that I accidentally harassed my mom into telling me about her own assault cuz she cried watching Oprah. \n\nBut the world slowly gaslit me out of this ability. Stole it. Told me I was wrong and made a point to get everyone else to tell me I was wrong too, until I didn't believe myself anymore. \n\nCan anyone else relate? \n\nIs anyone else watching this show?",
        "created_utc": 1674902112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reflecting on my childhood I guess",
        "author": "ii_GalaxyJZ",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10n6xhy/reflecting_on_my_childhood_i_guess/",
        "text": "As a kid I know I was socially \"weird\". I got bullied for what I'm suspecting was the way I approached people socially. Sometimes kids would obviously not want to play with me and I'd chase them down the street playfully, I could almost say obliviously. I was told by a friend of mine thatI would try to fit myself into conversations that I didnt actually know about. For example him and his friend were talking about some Marvel show or something, completely unrelated to Spiderman. I jumped into the conversation and said \"I like spiderman\" or something and they both just kinda turned and looked at me weird. I honestly can't remember my childhood the best due to how the bullying and other events during that time affected me, but I know I often was told by my peers that they didn't want to talk to me or they'd get extremely annoyed when I'd show up. I was constantly the person who had the \"cheese touch\" or whatever its called, and I would sometimes do weird things(like very socially inappropriate things that I tried to be sneaky about because I couldn't control the impulse) and this one specific time when I was 10 when I got lice, I blurted out \"I have to go home I have lice!\" to the whole class and got teased for years after. I would often try to do dances that other kids liked and were trending and I'd always be told I was doing them wrong and get picked on for it. I even looked up tutorials on how to do the dances, and still failed to fit in like other kids did. \nNot just that, but throughout pretty much my entire childhood I had pretty intense, sometimes odd interests. I learned rather quickly that I had no choice but to hide them(at the age of like, 7) and so I was masking already. One time in 3rd grade, I had a huge obsession with this channel called boomerang. The bumper commercials and shows fascinated me, and I would always watch hours of videos of these commercials and of people complaining about how the channel kinda got trashed by Warner over time. There was a point at which I wanted to dance to the theme song of the commericials at the school talent show.. (I didnt do it thank god) \n\nBesides this there were always the stimming behaviors. Early on they were pretty normal I guess. Jumping, hopping when I would sit in soft chairs, running around, tapping stuff, teething and chewing, possible repeating funny phrases I heard in videos or around school, etc. Around age 10, that changed to a degree. I began to find that rocking brought extreme joy to me. And so I would put on my music and do that. I would also daydream during this time(its probably maladaptive daydreaming honestly). Overtime I thought it would fade off as I became a teenager, but nothings changed. I still rock and listen to music, and drift into my dreamworld for hours a day to cope with my childhood and life. \n\nAs for everything else, between ages 9-12 I became what I joke of as a \"super masker\". I began to hide, or subconsciously force myself to eliminate a good bit of my stimming behaviors in public. I still have my intense interests of course, but for a while up until 2021 I kept them in a lock in my head to keep from getting bullied again. Socially, I studied people to fit in more, or I went quiet and began to not socialize at all with others(I still have friends of course but I usually dont make new ones unless they talk to me first or I'm introduced to them or they seem relatable off the bat by what I see of them) . Now I'm a sophomore in highschool, and I'm conflicted with my life. I can't figure out if I really am autistic and have learned to mask so well that the things I learned and the things that come to me naturally have kinda merged, becoming hard to tell the difference between. Or if I'm a very \"odd\" NT who was just weird and grew out of it. Hell, I can't tell exactly how to categorize the way I was socially as a kid. Like if the issue was social cues/norms (if social norms being interpreted wrong is an autistic thing) or just loneliness or something else causing me to act out. \n\nI've tried to teach myself to unmask properly again for both my own happiness and for whenever I get an assessment done so I can feel safe being myself around the clinicians. It's worked to a degree, such as me bringing my comfort plushies to school, allowing myself to stim more there, but even so I can't help but feel a part of me is almost locked up, unable to be unmasked freely no matter how hard I try. I do notice though that at school functions with more \"weird\" people I feel a bit more unmasked. \n\nBut anyway I'm not sure what my point with this post even was anymore. It was mainly to see about my social difficulties during childhood and what they could be labeled as (if that's possible) and also just addressing my imposter syndrome with my autistic feelings (even tho from what my therapist said I believe I'm technically soft-dxd and I've had multiple neurodivergent and autistic ppl say I'm most likely on the spectrum) , but any advice will be helpful. \nAlso idk if this matters at all but I'm nonbinary and have identified as trans since I was 12, and always felt like more of a \"boyish\" kid. \nAnyway, pls leave advice in the replies. Ty!! \nAlso jesus Christ this post is disorganized-",
        "created_utc": 1674882795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do images and songs get stuck in your mind?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10n1wlh/do_images_and_songs_get_stuck_in_your_mind/",
        "text": "Hey, ( ADHD, Suspected ASD ) Idk what this is but whenever I see certain images like disgusting images or certain gore it gets stuck on my mind. Like yesterday I saw a crime scene photo of jodi's husband ( stabbed ) and I was disgusted and I can't get the image out of my mind even though im able to handle gunshot photos. Same with songs, when I replay the song a few times and stop listening to music, the song gets stuck in my mind and it's annoying. It's kinda the same with certain movies or docs, after I watch docs like ( Missing person, Serial killer, or unsolved ) which is rare that I watch these but when I do, I get paranoid and whatever I watched is sketched in my mind for a day or 2. What is this phenomenon? Do you guys relate to this?",
        "created_utc": 1674868049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Service dog company recommendations?",
        "author": "chill_bongo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10myit4/service_dog_company_recommendations/",
        "text": "Would anyone kindly have recommendations on reputable companies that train and match service dogs for kids with ASD?",
        "created_utc": 1674859557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this a sign of a form of autism? Is it psychologically a thing or am I just weird lol",
        "author": "Zealousideal-Bug8217",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10mvsk2/is_this_a_sign_of_a_form_of_autism_is_it/",
        "text": "Since I was a child I’ve made connections between my favourite numbers, and colours. I don’t know why they are my favourite. To me the number 73 is purple and yellow, 32 is yellow and red and 48 is purple and orange. I then think of chocolate bars I ate when I was a kid with those colours on the packaging. Sometimes I also hear myself speaking in slow motion. Ive always been fascinated by what this is!!! :)",
        "created_utc": 1674852923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asian/2nd gen autistics?",
        "author": "juniapetunia",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10mu80m/asian2nd_gen_autistics/",
        "text": "Any other East Asian or second gen immigrant autistics have tips for how to differentiate between innate autistic traits and learned traits caused by racial or intergenerational factors?\n\nBackground: I’m a few months into my journey of figuring out whether I’m autistic. My therapist is wonderful and has been really open to listening to my thoughts and experiences because I don’t meet a lot of the “standard” autism criteria at first glance. through our discussions and my own internal reflections, I’ve started to see a lot of not so obvious autistic behaviors that are pretty heavily masked or fully internalized. Worth noting that I am confirmed diagnosed with ADHD as of last year, so definitely at least some neurodivergence going on. \n\nWe’re at the point now where my therapist is pretty sure that I have either some subclinical level of autism or am actually on the spectrum, but we’ve both been struggling to figure out the causes of certain behaviors. For instance, my whole life I’ve felt out of the loop about pop culture and celebrities. I’m very particular about what movies and shows I watch because violent/graphic/depressing content takes a huge toll on my mental health - maybe some hyperempathy going on. If I don’t find something interesting, I won’t put in effort to keep up with it, and I can never understand how people stay so up to date on celebrities’ lives. But I was also raised by first gen Chinese immigrants who very much didn’t know what was happening in American pop culture and therefore didn’t pass any of that on to me. I didn’t know any 80s music until my teens because while my friends’ parents were playing that music in the car, we were listening to random CDs we got from the library. The end result is the same - me feeling slow/ignorant/isolated when everyone else can follow a conversation about a supposedly “normal” topic except me - but I can’t determine to what extent this is caused by my specific upbringing versus autistic traits. \n\nSorry this is really long and rambly! Just looking for some other folks who are in this situation.",
        "created_utc": 1674849096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exams Where the Teacher Ruins the Testing Environment",
        "author": "MachoMachoMadness",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10mrvqi/exams_where_the_teacher_ruins_the_testing/",
        "text": "So frustrated so this is more of a vent than anything else. I’ve had ADHD diagnosed since I was a kid and have been on meds for it in the past. Im not on ADHD meds now because of a different med. Recently, I discovered I’m also on the autism spectrum as well and it’s made a lot of things in my life make way more sense. I’ve been taking college courses for a while and have multiple degrees and in all this time, with all these classes, I have NEVER had a teacher ruin a testing environment. Maybe it was the culture of the previous college (I’m transferred to a new one for a higher degree) but the other teachers here made every effort to keep a minimal stimulus environment and would even walk out into the halls to shush people who were loud outside the door. Yet, during our final semester, we have one teacher who insists on making announcements every literal 2 mins to the entire class ranging from instructions for people who came in late to “are you guys done yet?” despite telling us how to indicate we were finished so it was visible to her. \n\nI gave her leeway for the first quiz but there was no excuse for the second so I asked her to stop and explained every announcement was a break in focus that was hard to get back and every time the focus came back she’d make another unnecessary announcement which started the cycle anew. To which she scolded me for taking too long in front of the class (usually I’m one of the first people done in a good environment, and I still had a quarter of the time left) and stated how it was just a ten question quiz and there was no excuse. I’ve had some pretty horrible experiences as a kid with teachers but there’s something about a college setting where a grown adult is talking with the sheer amount of disrespect like that which is particularly frustrating. I ended up just half assing the last couple questions and leaving during her other announcement. Our class is pretty close at this point so immediately there were at least four others who had my back and I found a bunch of supportive messages when I checked my phone. I’m pretty thankful (for the support as well) because even though I had testing accommodations through the school, I haven’t had to use them yet but it looks like that will have to change for our last semester. But god damn this is something that’s such a basic standard, I don’t even know why it would require accommodations and at this point I think the teacher was just being an ass to be an ass.",
        "created_utc": 1674843635,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Many Facets of Quinni from Heartbreak High",
        "author": "NotKerisVeturia",
        "url": "https://aureliaundertheradar.wordpress.com/2023/01/25/the-many-facets-of-quinni-from-heartbreak-high/https://aureliaundertheradar.wordpress.com/2023/01/25/the-many-facets-of-quinni-from-heartbreak-high/",
        "text": "",
        "created_utc": 1674831509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird spread of autistic traits; curious what else could explain it better if not autism",
        "author": "Expensive-Abroad971",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10mg3aa/weird_spread_of_autistic_traits_curious_what_else/",
        "text": "I don't really know of a different place to post something like this. I am 19F (transfem) and over like the past 2-3 months I've been thinking about the possibility I'm autistic. But nothing seems to make sense about my traits, since it seems like the only traits I have are traits that *some* autistic people have (ie I don't really have the \"main\" traits). Namely:\n\n* I am very good at reading between the lines (this is a catch-all term I made up on the spot that basically just means I'm good or at least I'm pretty sure I'm good at reading facial expressions, body language, figurative language, etc.), and I at the very least have memories of understanding facial expressions very well ever since I was a child. I also do use facial expressions, body language, and especially figurative language a lot. I also respond emotionally to others' emotions and/or words (like affective empathy), and I have a decent ability to understand others' feelings based on how they are thinking (cognitive empathy) although this is more likely than not since I am good at making (conscious) deductions. Not entirely sure if this is okay to say but&gt;!I'm pretty sure that I tend to be judgmental to people who aren't particularly good with socializing and I'm guessing this is due to my recognition of social cues.!&lt;\n* Adding to that, I tend to do things being very socially aware of what could happen if I did them, or doing things specifically for other people's reactions (which is a very bad habit of mine). This also includes just, simply, using tone and facial expressions (as far as I know) very well, and understanding things like hierarchy (which does include wanting to have toys that everyone else has).\n* I am pretty good at imaginative play (well, some types, explained later), and I would play with my brother a lot.\n* I don't have meltdowns as a result of sensory problems. I have complaints sensory-wise (which I will explain a bit more later), but it's not enough typically to cause me to completely shut down.\n* I don't really have strict routines. Admittedly, I have (undiagnosed) ADHD, so I have extremely strong impulses and affinities for things that are appealing to me at the moment, so it's very hard for me to really keep a routine anyways, since I will always drag myself away to do other things.\n* I do have things that I will preoccupy myself with for a whole day/night (if I want), including some that are long-term, but I'm unsure of the root of it and whether or not it qualifies as a special interest, since the thing(s) in question are Geometry Dash and music production, for which a main motivation (do note: I still LIKE these things for the things they are) for me is to be \"good\" at both and at the very least for music production, to gain social recognition and potentially monetize my music. And of course, there are other things for me that are very temporary hyperfixations, such as passion projects. And also, there are things that I am interested in that I don't necessarily spend a whole lot of time on.\n\nBefore I mention some of the autistic traits I believe I have, I would like to mention a few things:\n\n* I believe I have Klinefelter's syndrome, which can cause problems early on, including ADHD, but also a tendency towards social isolation and \"being shy\", and dyspraxia. As of now, it probably manifests in having less energy (which could be a root cause of executive dysfunction problems, more details later) and still some motor difficulties (for which I've offset by playing video games).\n* Minus 3 years where I lived with my grandparents, I lived with my brother, who had developmental problems (although they had smoothed out over time) that was attributed to autism. My parents claimed he grew out of it, but I'm guessing that his development mostly just smoothed out over time to where he simply has very low support needs (which I do know since he is a college student with a job and as far as I know has mostly been doing very well), and so it is likely that there were (possibly many) non-neurotypical mannerisms that I picked up from him, since we got along very well when we were young (we did have a slight falling out due to moral conflicts, but that's irrelevant).\n* I have a not very great relationship with my parents and have always had qualms with them, even when I was young, since they are very strict, which can lead to some long lasting effects due to less attachment and can also explain some unusual emotional responses to things occurring with my parents.\n\nNow, with that in mind, let's begin:\n\n* I still spend a decent amount of time to myself (mostly at night, like right now), which does help me recover quite a bit. And often in long, drawn out social situations (that aren't us playing games for many hours straight, which I can handle since I am mostly focused on the game), I do often just tone out and do my own thing (although this is also likely due to ADHD). I actually don't really know of any situations where I've hung out with people without really doing anything (I do *enjoy* being around people, and I often will meet up with people because I like doing that, but without something to do the meetup becomes extremely dry).\n* I have some problems with relationships. I don't really desire strong emotional and mutual relationships with others (aroace) and if I'm not obsessing over/reminded of someone (usually because said person I know to be interested in a thing I am also very interested in, and so I can talk to them about it, although there are a few exceptions, such as a friend I just constantly hang out with just because I want to and because he makes me feel less lonely), I can go many days without talking to them (ie I don't remind myself of them instinctively, and sometimes I don't really care enough to talk to them). That being said, this is also confounded by things such as significant fallouts (fortunately, quite amiable as far as I know), so the reason could be a bit unclear. I've definitely had this issue since I was young.\n* Growing up, I would try my best to be social when I wanted to and try and make friends, but I could never understand why nobody would reciprocate anything to me, when I could very easily tell that it was as such for other people (ie, people would be nice to me talking to them/respond to me nicely, but nothing would stick, and we wouldn't really be \"friends\"). I would talk to certain people over and over again, but I could rarely get them to reciprocate back to me (ie talk to me without me having to talk to them), when it was clear at least to me that they did as such to other people (and yes, I started caring because I noticed this oddity about my interactions with people). Obviously, this could just be normal, but at the same time most people don't always have to start every social interaction they have themselves (which, admittedly, I am very happy to do it if it's about something I'm interested in talking about at the moment). This was especially pertinent on the forums I was active on (Hopscotch Forum, mainly, and yes I was a huge coder), where I felt I was fairly active, but still didn't really get any new friends. IRL, I was *extremely* shy and wouldn't really talk to people very often unless I knew them well, for which I can attribute my lack of friends stemming from clubs as a consequence of that.\n* I have a mix of strong immediate emotions and slow-to-come emotions that are also pretty strong. I remember crying quite a bit well until I was in 7th or 8th grade (when I just suddenly stopped crying, which could be due to puberty ~~for which, fuck you male puberty~~?) due to a variety of (not so good) reasons - yes, they aren't very good reasons, but as far as I can tell, this still is particularly unusual? I can recall an incident with my parents in 6th grade (no details, since it is particularly sensitive) that had a huge dramatic effect, but I can recall being a bit slow to emotionally respond (but again, my relationship with my parents is not very good). Other than that, I recall having another time when my grandma moved away after visiting for a bit where I was fine emotionally until a few hours later, when I broke down. That being said, I do also believe I have RSD (probably ADHD related though), so I will get very upset if I sense rejection.\n* I am dyspraxic as far as I know. I have really bad motor control (although, oddly enough, my handwriting was much better than others' handwriting growing up) and even with fine motor controls I have issues, especially with video games (I spend a lot of time playing games that require a lot of fine motor control, like GD, as I mentioned, but I am far worse than my peers). But again, as mentioned above, can be explained otherwise.\n* Going back to sensory issues, there were definitely some things that were too stimulating for me (some sounds although not necessarily loud sounds, food textures) to handle growing up (although I could handle it with difficulty), but a lot of those things got better over time. That being said, I have a habit of randomly feeling textures, such as rough walls on campus, since I like the textures a lot, and I will (probably - I don't really know what counts) overeat things that have either a great taste or great texture (and usually both).\n* I also have an auditory processing disorder as far as I know; it is hard for me to decipher what someone else is saying when there's a lot of background noise (and I know I can definitely hear them, so it is probably not a hearing problem). This is something that is comorbid with ADHD as far as I know.\n* I am always very eager to make lists of things or organize things and come up with routines to do. Unfortunately, they tend to very quickly get forgotten/scrapped since I have a very crap memory/I run out of energy very quickly with those things (thanks, ADHD). That being said, I do like the idea of having a consistent routine, but I don't get particularly upset (annoyed though) if there's like small or even some decently sized changes to that routine. That being said, it got exceedingly frustrating when I would try and have a schedule and then things would just get in the way of me trying to actually adhere to a schedule, and so I eventually just gave up and rolled with doing things on the fly, for which I think I'm able to manage fine as such.\n* Going back to special interests, I definitely will hyperfixate on things, and I have a set of things that are constantly in that set of things I hyperfixate on, which has perennially been music, and more recently has been Geometry Dash. When I was young, I had a fascination for my local transit system (and more specifically, one specific part of it) and I would spend as much time as possible poring over information related to it, and later on, highways systems and highway signs for whatever reason. I still do find those things intriguing, but I have so many things that have replaced them that they've been buried. That being said, and this may be due to my ADHD, I did have simultaneous strong interests, like for example at the time I was also into Card Jitsu.\n* With regards to imaginative play, I definitely feel like it's something where we have to be on the same wavelength, so to speak, for us to really have meaningful imaginative play (ie we have to have the same thought process). It's a bit hard for me to just intuitively come up with things that go along with someone else's thing, especially if I'm not expecting what they are coming up with.\n* I am a mixed bag with regards to familiarity. I tend to gravitate towards things that I find very familiar and am usually content with those things unless they somehow become unfun (prime example, Clash Royale, because the game's progression is absurdly slow), but it's not like I *can't* try new things, like new Geometry Dash levels, new genres of music, etc, and sometimes, I do actually have the temptation to try new things out, like restaurants, shopping places (although probably also ADHD motivated).\n* I am a very strong perfectionist.  I would obsess over certain details (and overlook other very obvious things). I eventually learned to focus on the big details though which kind of offset this, but I definitely will fixate on certain details, especially in anything artsy.\n* Most of the people I hang out with on a daily basis are autistic. I do interact a lot with some people who are not autistic though, and I do feel very comfortable around them (that being said, it doesn't help that I have gotten into the very bad (!) habit of noticing autistic traits and comparing them to my own behaviors, which I think generally just makes me feel anxious).\n\nThere is probably more, but I got so distracted typing this so I can't really think of any more. That being said, I think I touched on a lot of different things. So, the question remains:\n\n**What best explains the whole smattering of behaviors I have?**\n\nMy best guess is ADHD (it is also the only thing I am absolutely certain about) and some complications from Klinefelter's, but it just feels somewhat unsatisfactory to me, since I feel like my struggles are too bad to be really caused by ADHD and I don't really think Klinefelter's would do a terribly large amount without flat out being a comorbidity with autism (which is more common among those with Klinefelter's anyways).\n\nI don't believe I have Antisocial Personality Disorder or some sort of narcissistic disorder, but both are definitely possible (APD definitely was less likely). Borderline Personality Disorder seems like a possible explanation, but only for things I experience now. I highly doubt I would've had it ever since I was young, and it definitely only is a partial explanation. I could be a Highly Sensitive Person, but also I feel like I don't really get overstimulated.\n\nThere's definitely more disorders to differentiate, but I wouldn't know what they are. If you know any that could fit, please let me know!\n\n&amp;#x200B;\n\nAnyways, that was my very very long talk. If you read through it all, then I question your sanity lmao but also it will probably give you great insight into the situation. If you didn't, then I think you're sane, but also you probably will miss a few details that are important?\n\n(tl;dr i have a strange spread of autistic traits and it feels like i'm missing some of the most common ones, so why is that the case?)",
        "created_utc": 1674808502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autism Explains so Many of My Struggles",
        "author": "Dry-Establishment-45",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10mdfug/autism_explains_so_many_of_my_struggles/",
        "text": "      I want to preface this by saying I have been speaking to a therapist for most of my adolescence/early adulthood and the consensus is that I am on the autism spectrum. It is extremely difficult to be tested for autism where I live to get a solid 100% diagnosis.\n     Anyway, after finding out this information about myself, lots of things started to make sense. For example, the main one I’ve been struggling with lately is feeling like a complete outsider in every group scenario. Trying desperately to fit in and attempting to mask but coming off as awkward. It is lonely and difficult to navigate social situations. I am exhausted.\n     It is comforting to read posts and relate to others. I was just wondering, were there any particular things that finally made sense after you were diagnosed ?",
        "created_utc": 1674798289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Masking as hard as I can over here",
        "author": "Beginning-Society-51",
        "url": "https://i.redd.it/5rra5h6t1kea1.jpg",
        "text": "",
        "created_utc": 1674793791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discovery Over Link Between Tylenol and Autism, ADHD in Babies to Be Prioritized in MDL",
        "author": "itsrainingbluekiwis",
        "url": "https://www.aboutlawsuits.com/discovery-link-tylenol-autism-adhd-prioritized/",
        "text": "",
        "created_utc": 1674783672,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You are just an awkward, introverted and sometimes obsessed person\"",
        "author": "The_Stellar_Boy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10m61rc/you_are_just_an_awkward_introverted_and_sometimes/",
        "text": "So... yeah, this is kinda a personal story and I also need to take this out of my chest, because sense yesterday, the situation it's all I could think of. Also, I'm sorry if this is long, I want to express the situation accordingly with how my brain perceived it... if that makes sense.\n\nI wanted to tell my mom I might be autistic, so I waited for my dad and sister to go take a walk with the dogs, they usually go pretty far so I had like 20 minutes or more to talk with my mom. So when they left... I was paralyzed, I felt so nervous that I couldn't move or talk at all for 5 minutes. To feel more confident I opened my phone and read the symptoms of autism again and again in the google doc I made, just to make sure that suddenly they weren't magically changed and I couldn't relate to them anymore. \"I still relate to them, great, I just need to talk to mom\" that's what I thought.\n\nIt was a disaster, there was no yelling or discussion, but I couldn't get my whole point across, I was shaking the whole time.\n\nBasically, I asked to please don't laugh at me, to take me serious, so she did. I told her how I started informing myself about neurology (sense I was little, I loved physiology, I read a lot of books about it and it so damn interesting, so now I got interested in neurology). I explained her that I think I might be autistic and I've never felt so represented in my life while reading the symptoms and it could explained a lot of things going on in my head and in my childhood. \n\nShe asked for examples, and I gave her examples. She answered to all of them so here is kind of how the exchange went: \n\nI started saying I have many problems trying to communicate with people who aren't family, my difficulties with interacting and having friendships.\n\nShe said she doesn't see that I have difficulties with that, I'm just an \"awkward, introverted, and sometimes obsessed person\" and even then, I have plenty of friends now.\n\nI responded that I am very grateful for the friends I have now, but I am pretty lucky, I have them because I met one of them, and since then, the friend group just grew without me doing anything. (And most of them are also neurodivergent, I didn't say it, because I know she is going to point at them and think they are the reason of why I'm thinking I'm autistic). But I was very lonely before changing schools, she knows I had no friends, because both my parents went really worried about it for years. \n\nShe said that all the people on that school were bad people, that's why I had such a hard time.\n\n\"Yes, most of them were pretty mean, but in this school is the same situation, I like the people there, they are neat, but I don't feel like I fit, if I didn't met my first friend of the group during the first week, I assure you I wouldn't be able to make any friendships\" I said. \n\nI kept goingbecauseshe didn't know what to say \"And what about me being a picky eater? The texture of the food and the clothes I were where always a problem with me, if I don't liked them becausethe texture is horrible to me, my whole day is ruined, I'm not able to eat/wear anything when that happens!\"\n\nSo, after a few seconds of silence she answered \"You always had an obsession with things, just right now you started insisting that you feel a bug walking in your arm just because we pointed at one walking on the wall\"\n\nI replied that it's not the same thing, it's not a comparable thing. \n\nShe said that she knows that but she's trying to say that it's just my personality, I'm an insecure, introverted and sometimes pretty obsessed person, and that's okay.\n\nI asked to at least consider this because I really need a diagnosis, I really want one.\n\nAnd she ended the conversation with \"Talk to your therapist with this, if she finds something and says she thinks there's need for a diagnosis, we would search a psychiatrist that can give you a diagnosis\" \n\nThe problem is, my therapist also doesn't believe that I'm autistic and doesn't find a reason to ask for a diagnosis for now, so I'm stuck with this situation until I convince my therapist or I wait for my 18th birthday to do ir myself.\nI don't want to give up yet, I want this diagnosis, but I'll be lying if I said I didn't felt lonely. I spend everyday analyzing EVERYTHING and asking me \"Am I doing this because I'm autistic or I'm acting like one to fill a narrative for myself?\" It's hell, I tell you that much.\n\nGod I hope I'm not wrong in this.",
        "created_utc": 1674776065,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You are just an awkward, introverted and sometimes obsessed person\"",
        "author": "The_Stellar_Boy",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10m61kx/you_are_just_an_awkward_introverted_and_sometimes/",
        "text": "So... yeah, this is kinda a personal story and I also need to take this out of my chest, because sense yesterday, the situation it's all I could think of. Also, I'm sorry if this is long, I want to express the situation accordingly with how my brain perceived it... if that makes sense.\n\nI wanted to tell my mom I might be autistic, so I waited for my dad and sister to go take a walk with the dogs, they usually go pretty far so I had like 20 minutes or more to talk with my mom. So when they left... I was paralyzed, I felt so nervous that I couldn't move or talk at all for 5 minutes. To feel more confident I opened my phone and read the symptoms of autism again and again in the google doc I made, just to make sure that suddenly they weren't magically changed and I couldn't relate to them anymore. \"I still relate to them, great, I just need to talk to mom\" that's what I thought.\n\nIt was a disaster, there was no yelling or discussion, but I couldn't get my whole point across, I was shaking the whole time.\n\nBasically, I asked to please don't laugh at me, to take me serious, so she did. I told her how I started informing myself about neurology (sense I was little, I loved physiology, I read a lot of books about it and it so damn interesting, so now I got interested in neurology). I explained her that I think I might be autistic and I've never felt so represented in my life while reading the symptoms and it could explained a lot of things going on in my head and in my childhood. \n\nShe asked for examples, and I gave her examples. She answered to all of them so here is kind of how the exchange went: \n\nI started saying I have many problems trying to communicate with people who aren't family, my difficulties with interacting and having friendships.\n\nShe said she doesn't see that I have difficulties with that, I'm just an \"awkward, introverted, and sometimes obsessed person\" and even then, I have plenty of friends now.\n\nI responded that I am very grateful for the friends I have now, but I am pretty lucky, I have them because I met one of them, and since then, the friend group just grew without me doing anything. (And most of them are also neurodivergent, I didn't say it, because I know she is going to point at them and think they are the reason of why I'm thinking I'm autistic). But I was very lonely before changing schools, she knows I had no friends, because both my parents went really worried about it for years. \n\nShe said that all the people on that school were bad people, that's why I had such a hard time.\n\n\"Yes, most of them were pretty mean, but in this school is the same situation, I like the people there, they are neat, but I don't feel like I fit, if I didn't met my first friend of the group during the first week, I assure you I wouldn't be able to make any friendships\" I said. \n\nI kept goingbecauseshe didn't know what to say \"And what about me being a picky eater? The texture of the food and the clothes I were where always a problem with me, if I don't liked them becausethe texture is horrible to me, my whole day is ruined, I'm not able to eat/wear anything when that happens!\"\n\nSo, after a few seconds of silence she answered \"You always had an obsession with things, just right now you started insisting that you feel a bug walking in your arm just because we pointed at one walking on the wall\"\n\nI replied that it's not the same thing, it's not a comparable thing. \n\nShe said that she knows that but she's trying to say that it's just my personality, I'm an insecure, introverted and sometimes pretty obsessed person, and that's okay.\n\nI asked to at least consider this because I really need a diagnosis, I really want one.\n\nAnd she ended the conversation with \"Talk to your therapist with this, if she finds something and says she thinks there's need for a diagnosis, we would search a psychiatrist that can give you a diagnosis\" \n\nThe problem is, my therapist also doesn't believe that I'm autistic and doesn't find a reason to ask for a diagnosis for now, so I'm stuck with this situation until I convince my therapist or I wait for my 18th birthday to do ir myself.\nI don't want to give up yet, I want this diagnosis, but I'll be lying if I said I didn't felt lonely. I spend everyday analyzing EVERYTHING and asking me \"Am I doing this because I'm autistic or I'm acting like one to fill a narrative for myself?\" It's hell, I tell you that much.\n\nGod I hope I'm not wrong in this.",
        "created_utc": 1674776052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking things too far",
        "author": "Lettuceisforsalt",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10m09zs/taking_things_too_far/",
        "text": "I was always accused of taking things too far when I (F,45) was a young'un. Even as a young adult if I got over excited I would lose control of myself and I wasn't aware of acting strangely but, in retrospect, I guess I would turn more instinctive and less cerebral. It would present as a sort of violence (I never properly hurt anyone but I would push things to the point that people got angry) but I always thought I was just having the same fun as the people around me. \n\nI remember when I got over-excited I would sometimes get a pain in the back of my head - the occipital region. \n\nAnyway, I am making a list of all my ND symptoms and I wondered if this was a relevant one. I try to avoid getting over excited at all these days because I don't want to get out of control. \n\nDoes anyone else relate to this please?",
        "created_utc": 1674761563,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I never pegged you as autistic\"",
        "author": "FlockofWhales",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10lyxx8/i_never_pegged_you_as_autistic/",
        "text": "I haven't posted on this subreddit in a while because I received a negative diagnosis and I'm trying to accepted it. (I'm not giving up on a diagnosis entirely, but I'm giving it some time.)\n\nHowever, something has been happening a lot recently, and I can't quite put my finger on why it bothers me so much. When I mention to friends and family that I think/thought I could be autistic, they often have a very similar response: \"I never pegged you as autistic.\" (Similar: \"I haven't ever thought that about you\" or \"I don't see it.\")\n\nI know that \"high functioning\" NDs are often dismissed like this. I've seen it on this sub a ton already. But it feels even more off-putting to me now that I have a negative diagnosis. (I'm usually pretty open about the fact that doctors have already told me they don't believe I'm autistic.) Like, when I talk to people about believing I'm autistic, it is usually in the context of confiding in them that I have recently been through a psychological rough patch. So I don't understand why people feel so compelled to tell me they think I'm wrong. \n\nI'd like to understand where people's heads are at when they're saying this. Do they think it will make me feel better? The reply feels combative to me, especially since they rarely know the first thing about why I feel autism fits my experience. Plus, I'm trying to let it go, so I don't really want to get into more detail with them. But the people who keep saying things like this are people who otherwise treat me with respect, so I feel like I'm missing something...",
        "created_utc": 1674758257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of routines?",
        "author": "Shiny_cats",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10lubyw/examples_of_routines/",
        "text": "One of the reasons I’ve been doubting the possibility of having autism is because I don’t seem to have that many routines, which is such a common symptom. All the routine examples I’ve heard of are stuff like eating the same meals every day, or getting upset if you have to wear a different set of clothes on a specific day or something, which aren’t really great examples.\n\nWhat are some everyday examples of routines? I’m sorry if this is a stupid question.",
        "created_utc": 1674746726,
        "upvote_ratio": 1.0
    },
    {
        "title": "are we autistics more prone to receive more projections than NTs??",
        "author": "hikuri05",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10loj7f/are_we_autistics_more_prone_to_receive_more/",
        "text": "Someone online told me that because we are autistic it make us to be a good screen to receive projections from everybody (NTs or NDs), as if we were more prone to receive projections from everybody, I do actually understand the concept of projection, I do know what a projection is. But I don't get why being autistic means we are good screen to receive projections. Someone with a Jungian knowledge may volunteer some time to elaborate how true it is that because we are autistic it make us to be a good screen to receive projections from everybody ??? 🙏🙏\nPlease notice this is not a \"we vs them\" kind of post. I'm just quoting what other person told me.",
        "created_utc": 1674727667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is social battery real? If not, what is this?",
        "author": "anotherclown_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ldvjs/is_social_battery_real_if_not_what_is_this/",
        "text": "(This is more of a rant than i wanted it to be😥) This happens alot but i felt it today more than anything. I go to school 7-3 and im talking most of the time. I have some breaks, but im usually talking to atleast one person. Sometimes when im driving home with my mom, well be having a nice conversation, and then ill just snap. I dont want to be rude to her, but it just feels like ive expired and i just need to be alone in silence. If i have a good day, it feels like i come home and dont want to do any more socializing. It doesnt exactly drain me, but i feel like theres a limit on how much \"proper\" socializing i can do in a day. Sometimes ill talk to a person i love for so long, that it starts to become annoying. I feel guilty for turning this feeling into anger or frustration, but it feels like thats all i can push out.",
        "created_utc": 1674691154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t undo unmasking",
        "author": "LillianXo246",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10lb7qp/cant_undo_unmasking/",
        "text": "Do other people find that after unmasking, it’s difficult or impossible to start again?  I find this specifically in terms of who I mask in front of—I can make small talk, seem bubbly, and withhold judgements in front strangers, but once I’m comfortable and unmask around someone I can’t choose to mask again.\n\nSometimes even if I’m in sensory overload and completely shut down, I can make more movements or speak a bit if I need to in front of a stranger, but not at all otherwise.\n\nAlthough occasionally when I’m feeling down I wish that I could choose to mask again in front of certain people, overall I’m not too upset about it.  It weeds out anyone who doesn’t like the true me.  But I’m not sure why my experience is this way.",
        "created_utc": 1674684420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking the Aspie Quiz with long covid",
        "author": "His_little_pet",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10l8syp/taking_the_aspie_quiz_with_long_covid/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/0hag3n6vr8ea1.png?width=566&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=99ebae77637aafcaf275b66e903bf335c4639805\n\nEight months ago, I posted my results to the Aspie Quiz \\[[link](https://www.reddit.com/r/AutismTranslated/comments/urujp7/so_the_quiz_says_im_very_likely_neurotypical_but/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\\].  At that time, I took the quiz twice: once where I took everything literally, and a second time where I instead interpreted what I thought the questions were trying to ask.  This yielded me two pretty different quiz results.  I currently have long covid after getting sick about six months ago.  Long covid has made some of my existing autistic traits stronger and also brought out some that I don't recall ever expressing previously.  For anyone who is curious about how long covid caused this, I'm pretty sure it's all under the umbrella of brain fog.  \n\nSince I'm \"more autistic\" with long covid, I thought I'd take the quiz again to see if my results changed.  I tried to answer questions based on what I thought they were meant to ask (not just a literal interpretation), I left questions blank if I was confused, and I tried to not overthink it.  \n\nI wanted to compare my results from pre-covid to now, so I've overlaid them below (using my second result from before).  \n\nhttps://preview.redd.it/a37jvy80s8ea1.png?width=566&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6a2e310eccd24abcd4ae1bf58b06047dd4978658\n\nThe way I experience my autism is very different now than it was pre-covid and it's having a much bigger impact on my life, so I wasn't expecting see so much similarity in my quiz results.  The results I found most surprising were in Talent and Communication.  I'm less surprised by the Talent result now that I've thought about it because I believe it can be indirectly attributed to long covid, which limits my life in a lot of ways right now.  Engaging with my special interest (women's ice hockey) makes me feel more in control of my life and brings me joy, so I've been prioritizing it more.\n\nI'm less clear on what caused the Communication result.  For anyone unfamiliar with the quiz, Communication encompasses stimming and fidgeting as well as general communication skills.  I've always fidgeted, but only really started stimming after getting long covid \\[[here's how they're different for me](https://www.reddit.com/r/AutisticWithADHD/comments/10d3dup/courtesy_of_long_covid_i_understand_the/)\\].  I currently stim pretty frequently and my general communication skills have also gotten a bit worse, so I should in theory have a higher Aspie Communication score (and maybe a lower Neurotypical one), but in fact the opposite is true.  I think what explains this is actually what my criteria was for answering questions the last time I took the test.  When I took it the second time eight months ago, I answered as if I still struggled in all the ways I did as a teenager.  Because I've put significant work into improving my communication skills since then, I think those results weren't actually representative of my communication score pre-covid.  To get a more accurate picture of the change to my commutation with long covid, I think I need to compare to my very first set of test results (where I took every question entirely literally).  \n\nhttps://preview.redd.it/xhtw3sw9z8ea1.png?width=565&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ace7f7ef14254870653f55b6eded06baf5ce271c\n\nLooking at this comparison, I'm seeing results that more closely mirror the changes I've seen to my autistic traits since getting long covid.  It's interesting because, while my second set of results from before definitely gave a more accurate picture of me as an autistic individual throughout my life, I think this first set of results more closely portrayed the impact my autism was having on my life at the time when I took the quiz.  \n\nAs I mentioned in my previous post, this quiz (like any online autism test) has gaps and lacks nuance.  Just by comparing my three sets of quiz results, which represent me at three different points in my life, you can see that there are some pretty big differences even though I'm just one person.  For anyone else who is taking these types of quizzes, please remember that while they can be fun and may give you some insight into yourself, they're not an accurate diagnostic tool and you shouldn't take your results too seriously.",
        "created_utc": 1674678562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to work is so exhausting",
        "author": "Positive_Market_4324",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10l4wdv/going_to_work_is_so_exhausting/",
        "text": "I work part time for a month now, this is my 4th day in a row and I feel so drained. It's so hard masking all the time and I struggle with eye contact, I can feel they don't trust me or find me weird which makes it worse. \n\nPeople just tell me 5 hour shift isn't long but like I do closing shifts alone and I need structure, whatever the morning shift doesn't do gets put on me and I get really anxious because it sets me back. I just feel like no one understands and they think I'm overreacting.",
        "created_utc": 1674669417,
        "upvote_ratio": 1.0
    },
    {
        "title": "My psychiatric group home just threw me out",
        "author": "KuroNikushimi",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10kzf1z/my_psychiatric_group_home_just_threw_me_out/",
        "text": "My group home just threw me out because I'm too traumatised and too autistic and they can't deal with that. From the beginning on I was completly open about both of these things and they told me that it's fine. Then they wanted me to change and I tried my best to comply but it was not fine with them. Because I didn't know what they wanted me to do about it. They kept on reading things into what I said, that I never meant. And I kept on telling them I say what I mean and to just aks me. I got the usual \"your tone says sth else\" sometimes too. I'm just so done. I finally started to trust someone and now I'm left without anything. I have no therapist, no psychiatrist, no home. I don't know what to do. It hurts so much. No matter what I do I'll always be too much. I'll always be either too autistic or too traumatised. In the end I'm just too much and too hard to deal with. I try my best to find a mix between being myself and reading what they want and trying to do that, but no matter how much I mask I'm never normal enough. But then when I mean people as first they're always like \"you don't seem autistic at all. I have no idea why anyone would think that\" but then when they get a little bit cliser or spend more time with me I'm too weird. I hate this. I hate myself",
        "created_utc": 1674655659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Selective Mutism",
        "author": "Shiku35",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10ktk4e/selective_mutism/",
        "text": "I was wondering if anyone has faced this. So I noticed something over the last 11 months. I develop selective mutism at some specific situations. I have liked someone since last year. Trying to date them just really gave me a lot of anxiety and I started having meltdowns when I was around them. I would run away after a hangout to avoid meltdowns. I have out grown most of this but now I noticed I have started developing selective mutism with them. They say that I never say what I want especially after a few beers. It’s like am not able to express what am feeling. So we barely have any kind of sex because I don’t know how to go about the whole topic. I really like them but I think they maybe too NT for me. Any advise??",
        "created_utc": 1674633738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Infodump please!",
        "author": "neuro_curious",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10klp01/infodump_please/",
        "text": "Dear autistic redditors,\nYou are cordially invited to come to this post and infodump about a special interest or topic you are really interested in.\n\nHaving special interests and sharing them with people is one of my favorite things about being autistic and I just want to share that with some of you today - my wonderful, beautiful autistic reddit family!",
        "created_utc": 1674608154,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love this creator",
        "author": "Loud-Direction-7011",
        "url": "https://www.tiktok.com/t/ZTRpwCT3A/",
        "text": "",
        "created_utc": 1674597431,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with doubts and masking (Low Support)?",
        "author": "Mikethedrywaller",
        "url": "https://i.redd.it/v10bdgh0h3ea1.png",
        "text": "",
        "created_utc": 1674593087,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does sensory overload feel like?",
        "author": "Mara355",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10kfdwo/what_does_sensory_overload_feel_like/",
        "text": "",
        "created_utc": 1674592297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone “stuck” at an age?",
        "author": "letsjustscream",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10kf69o/anyone_stuck_at_an_age/",
        "text": "I’m not sure if this autism related or not but I’m just curious. I’m 28 years old but for the longest time I was “stuck” at 23. Whenever someone would ask me how old I am, 23 would come close to slipping out but I always managed to say 28. Now when I think about how old I am, I don’t think I’m any age. I don’t feel 28 but I don’t feel like I’m mature enough to be an adult like 90% of the time.",
        "created_utc": 1674591786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short Survey!",
        "author": "washingmachine-dork",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10kd99s/short_survey/",
        "text": " Hello! I am a high school senior in AP Research! My study will be used to determine if the regulation of estrogen during puberty will allow for the stability of neurobehavioral symptoms for young girls with autism spectrum disorder in order to increase efficiency of treatment.\n\nI am looking for women aged 9-18 to take a short 15 minute survey in order for me to collect the data I need - you DO NOT need to be formally diagnosed with autism spectrum disorder to particpate.\n\nThis survey is completely anonymous and no answer will be judged so please answer truthfully.\n\nThank you so much for your time, I appreciate you all so much!\n\nHere is the link: [https://forms.gle/HHHxyNBFNmMd5daY9](https://forms.gle/HHHxyNBFNmMd5daY9)",
        "created_utc": 1674587116,
        "upvote_ratio": 1.0
    },
    {
        "title": "'Now in a minute I'm going to ask you to get into groups'",
        "author": "Matrixblackhole",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10kd6ib/now_in_a_minute_im_going_to_ask_you_to_get_into/",
        "text": "Fuck that.\n\nI always wondered why I am always partnerless for these type of things and how the heck people seem to have already formulated their groups during the teacher speaks this sentence.\n\nThen I watch some tiktok skits of this type of situation and realise eye contact is how all that is done.",
        "created_utc": 1674586929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another Aha moment",
        "author": "beahmm",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10k6hur/another_aha_moment/",
        "text": "I am currently in the diagnosis process and I recently had an “aha” moment where I realized that anytime I chide, “I have a system for that,” it really just means I have a routine for it that someone is about to mess with. 🤷‍♂️",
        "created_utc": 1674569894,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel burnt out from just existing.",
        "author": "paladin_complex",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10jzilz/i_feel_burnt_out_from_just_existing/",
        "text": "For context, I also have a chronic illness that limits my energy generally, but this feels like it's more than that. I've felt burnt out for most of my adult life. _I feel tired of lugging my body around,_ of being a whole person inside the skin and bones.\n\nJust taking care of myself and managing household chores like an adult seems to take a lot out of me. Idk how I'm ever supposed to hold a job if being on top of cooking, home maintenance, etc. takes so much of a toll on me. \n\nAutistic therapist suggested I focus on resting, so I haven't held a full-time job since November. Been looking for my replacement get out of a shared apartment arrangement but that's about it.  I'm just so morose, but I don't want to engage in anything I usually like either. I don't know what to do.",
        "created_utc": 1674543181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe it’s all just ADHD",
        "author": "TropicalDan427",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10jw9f1/maybe_its_all_just_adhd/",
        "text": "\nI’m 26 years old, diagnosed since I was a little kid and my sister is also diagnosed.  I didn’t know of my autism diagnosis until 3 months ago and only thought my IEP(special Ed for those not in the US) was for ADHD despite learning things like how to tie my shoes(this was in my IEP) later than most kids and having problems with fine motor skills and just in general having poor coordination.\n\nI remember as a kid I hated fire drills due to the surprise of the noise but nowadays the only sensory issue I can identify within myself is Misophonia.\n\nMy social skills are definitely not great but they’re a lot better than they used to be although maintaining eye contact for more than like 10 seconds and keeping a conversation going past two sentences is still difficult.\n\nI definitely do stim quite often and tend to pick my skin when under-stimulated or stressed , rock forward and back while excited, hand wring while excited, and excessively rub my face when nervous. As a kid I remember this stim while playing computer games where if something exciting to me happened I’d quickly jump out of the chair, stand up and repeatedly tap my fingers into the palm of my other hand excitedly.\n\nI  also saw the doctor who diagnosed me with both ADHD and autism for 18 years of my life until she retired a few years ago. I saw this doctor once every few months.\n\nDespite all of these things I still sometimes doubt my autism diagnosis. I still sometimes feel like I don’t belong in this community and that I’m a faker.\n\nIs it possible that all these things are just from ADHD?",
        "created_utc": 1674531786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discover your neurodivergent masks- new video I watched really helped break it out!!",
        "author": "hellomynameissarita",
        "url": "https://youtu.be/HiU1WRPJa-4",
        "text": "",
        "created_utc": 1674526997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you feel like this?",
        "author": "Aggravating-Win-7875",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10jn85x/do_you_feel_like_this/",
        "text": "I recently had a talk with my little sister about something (9 year age gap between us) and I brought it up because we have similarities in terms of habits/traits. \nThis is the long series of questions I asked her:\n\nDo you feel like an actor in most social situations? Do you feel like a false human with no core personality and are constantly adopting traits based on the group you are with or are trying to “curate” one constantly? Do you feel the need to behave a certain way, with certain face expressions to appear the way you think you should or the way you feel inside but are having a hard time doing that naturally? Do you feel like you adopt or assimilate mannerisms from friends/YouTubers/Actors in movies &amp; TV involuntarily and then catch yourself doing it? Do you constantly hyper observe behavior/mannerisms/humor and log it mentally or find it fascinating? Do you have to strain to concentrate on staying in the present moment while talking with someone, but also drift mid-conversation involuntarily and have to pretend that you were listening, and have terror that you have offended them/that they might have noticed and think you are rude? Hard time making eye-contact and pre-plan, time, and practice making eye contact? Pre-plan social interactions, topics? 30 awesome ideas at one? Or brain fog that feels like it’s blinding you? Hyper focus while ignoring hunger, muscle pain, and need to go to the bathroom or zero focus? Certain sounds and smells make you angry and you’re not sure why because it isn’t normal to get that pissed off?\n\nHer answer was a horrified but also humorous “yes”. We had never talked about this before. I was describing her symptoms to a T. \n\nI also thought I was crazy that I needed to “act” in social scenarios to relate to people - I feel friendly feelings, but also feel the need to “perform” as friendly to match that?…. I tried looking this up, and got three possible answers, a. social anxiety disorder b. Personality type c. ASD masking… would love anybody’s opinion that felt willing to contribute, I’m not self-diagnosing here, I’d love to hear of everyone’s experiences if they feel the same way?",
        "created_utc": 1674507312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this feeling common with autism?",
        "author": "IndicationForward336",
        "url": "https://i.redd.it/4uhw7wpxbwda1.jpg",
        "text": "I've been learning about poetry and I really enjoy it however i fail to connect and understand a lot of it. Like even if I do or don't Relate it's harder for me to explain or build a proper explanation. \n\nI feel like poetry/writing is a great art form and I want to do some myself but I'm not having an easy time being sincere. I can't explain myself in a way that doesn't sound like I'm copying what I've already heard from others. \n\nA lot of things I do make me feel like I'm copying people I've met or charaters I've seen on TV or read in books or heard in podcasts. A spent a lot of time reading books and watching TV. And now I'm basically always playing music or podcasts in my earphones so I don't \"zone out\".  Even why I don't zone out I feel that I don't count as a person? Not in a low self-esteem \"I am nothing\" way. Just that I feel like I'm pretending to be human? Like I know im not an alien or anything buy like something feels off. \n\nWhen explaining myself to friends they have brought up that possibility that I am very likely nerodivergent with most thinking im autistic or have adhd or both. I know autism and adhd Co-exist in many people. \n\nI'm not sure if this is an autistic feeling though? I am 70% sure I have adhd and wasn't socialized properly which has lead to me being like this. Ontop of this the lockdown gap I had during my 2nd semester of grade 9 to my 2nd semester of grade 11 could explain it. My teachers have called me \"aloof\", \"socially awkward\", \"shy\" but I'm not sure if that's a sign. Pretty much every teacher has said some version of this and made note if it to my parents on report cards. However I never saw a doctor about this so it hasn't been that much as a concern.\n\nI felt that I was different but not in an \"we're all unique\" way for quite a bit. In grade 5 I tried to explain it to my parents but I couldn't do it correctly. I blanked out so the only way I could explain it was as like \" I keep watching crash course video's on books I don't have!\" And I couldn't explain that I had watched so many I now hated them but couldn't stop. I feel like my day isn't complete if I didn't watch those crash course videos. Like something would go wrong if I didn't. I felt bad because originally I started watching crash course: history to understand the world! I thought if I watched all the videos I would finally be able to be have the knowledge to be the others. I didn't care about being popular I just wanted to feel like I wasn't lost all the time! \n\nI brought up trying to see someone for my mental health in middleschool but my mom just gave me a book called \"don't stress\" with a smiley sun on it. I read the book but hated it so I vandalized it, then erased it, then vandalized it again with positive messages in case my parents found it. \n\nOver lockdown My \"zoning out\" got worse and I felt completely disconnected from the world. I think it was a mix of new levels of stress, sleep depervation, and \"Kats grungle juice\" (Cold black coffee I put in a 2l Fruité bottle with sugary candy and tangerines that probably got a little moldy.) I felt that I wasn't human like my parents where and that I was going insane because I could never go back to my \"normal\". \n\nLuckily I feel the most optimistic I've ever been right now but I still feel that something is missing. I had considered adhd before but then I started to look more into it. I looked into autism as well because nearly all of my online friends have either or both. I was worried I was faking it so I asked my grade 6-8 autistic best friend. She said she definitely thinks I'm autistic. I asked her a few more things then built a small folder full of printed out articles, most credtable free online tests that they took, notes, and a letter to my mom. \n\nI gave it to my mom and asked to get Screeded for adhd which she allowed. I planned on walking my doctor through my purple folder but he was only available over phone. Instead of calling in early noon he called right before closing and I spent most of the call running around looking for my purple folder. I put it away because it was Friday and he missed a call for another thing so I figured he'd call on Monday. The call went awful I was rambling and he mainly just wanted to know if my teachers brought up adhd. I said no but that my school work was being imparted but he thought it was just normal anxiety. When I asked if I could go through my answers on the tests he seemed pissed (in a professional manner) that I did online tests. I think he thought it was a buzzfeed thing or something? I just wanted to list things. The call ended and I felt so stupid because I thought he was being literal about teachers asking about adhd. I didn't know making comments about it like calling me \"aloof\" counted! I think he thought I was at best misguided and at worse trying to get drugs. \n\nI didn't even bring up the autism stuff because I'm still nervous if it will effect my ability to medically transition (I'm transmasc). \n\nMy note to my mother was titled\"I should get tested! (And that's not bad!)\" And I wrote: \n\n\"I think I am neurodivergent (“differing in mental or neurological function from what is considered typical or normal”) which means my brain is wired differently from most people! \n\nI have felt this way for a very long time but did not know the correct way to explain it. I have been doing more research which has led me to believe I may have ADHD or may be on the broad autism spectrum. I did a couple of online tests and the results reflect that I most likely have inattentive ADHD which is very different from ADHD portrayed in the media. I know this is not a diagnosis so I would like to get tested. In doing this I can hopefully understand myself more whether I have it or not. From that I can learn how to function better allowing me to deal with loud noises, lights, sensations, and lack of things I use to calm down such as earphones, gum, darkness, and blankets. I feel that there are many benefits that can come from being tested both interpersonally and in my education. Originally, I was planning on being tested in secret once I turned 18 but I want to be honest with you and I want to be able to finish high school strong so I can better think of my future. I know this will not be an easy or fast process which is why I want to start it as fast as possible. I do not want this to be similar to when I brought up my irregular periods for years before anything was done. One of the first people we can see about this could be our family doctor who could refer me to someone else so I would like to start there. \n\n\tIf I am not neurodivergent I am just not neurodivergent if I am neurodivergent then I have new information to work with. If a doctor leans more towards me having autism I may want to hold off because being medically diagnosed could affect my rights like access to medical care or if I want to travel or immigrate. It is hard to find good sources for this topic in Canada because google is more interested in the social impacts of this but I am sure we can find out more if it gets to that point. Autism can not be medicated while ADHD can but both of them can have strategies learnt to better adjust. This does not mean that I need to be medicated with ADHD but knowing if I have it would aid me in learning how to work with it. \n\n\tIn conclusion I would like to be tested to see if I am neurodivergent. I suspect inattentive ADHD to be the most likely thing which often includes “Lack of attention to detail, trouble staying focused,frequent spaciness,Difficulty following instructions, easily distracted, forgetfulness, often misplacing possessions,Difficulty sustaining mental effort.” I see no downsides in an ADHD diagnosis even if I am wrong and I am fine or it’s something else no harm will come from it. Thank you for reading. \n\nHere are some videos I relate to on this topic…\n\n\nTimes I should've realized I was autistic\n\nhttps://www.youtube.com/watch?v=i3Vy2BPmMS4\n\n\nADHD.\n\nhttps://www.youtube.com/watch?v=mSVCBbgnRdQ\n\n\nADHD: An Honest Review\n\nhttps://www.youtube.com/watch?v=EyfLG3Hd99M\n\n\nHow to Deal with Your ADHD ft. Mizkif\n\nhttps://www.youtube.com/watch?v=hRgSrEU2miE\n\n\nA Day in the Life with ADHD\n\nhttps://www.youtube.com/watch?v=t32CK5t8d2Q\n\n\njerma having adhd for 4 and a half minutes\n\nhttps://www.youtube.com/watch?v=tBV3-Y_VHDo\n\n\nADD &amp; ADHD | Media Misdiagnosis\n\nhttps://www.youtube.com/watch?v=bIm7OuNehrk\n\n\n\nSources\n\n\nSymptoms of Inattentive ADHD - Hill Learning Center\n\nhttps://www.hillcenter.org/symptoms-of-inattentive-adhd/\n\n\nADHD Inattentive Type in Adults: Symptoms, Diagnosis &amp; Treatment\n\nhttps://my.clevelandclinic.org/health/diseases/15253-attention-deficit-disorder-without-hyperactivity-add-in-adults\n\n\nhttps://www.leadingwithadhd.com/blog/2019/4/15/adult-adhd-isnt-what-you-think-it-is\n\nAdult ADHD Isn’t What You Think It Is-Leading with ADHD\n\nhttps://www.leadingwithadhd.com/blog/2019/4/15/adult-adhd-isnt-what-you-think-it-is\n\n\nSensory processing and ADHD: overstimulation vs. understimulation\n\nhttps://www.getinflow.io/post/sensory-processing\" \n\nAnd then I also had the online tests inside the folder. \n\nI also Relate to and enjoy lot to charaters that either \"have no emotions\" or don't show emotion because I feel that I don't express or process my emotions correctly. Even if other aspects of this characters like their intelligence is something I don't have. (Spock and data from star trek, charaters from the magnus archives, a few others I'm blanking on!) \n\nI'm worried I may just be copying things I've seen on TV to appear more human. Thing is that I watch a lot if TV with charaters people consider \"autistic coded\". I feel like the worst case of this is with their show I watched with an autistic main character and I noticed I started fidgeting more with my fingers after. It reminded me of when I started trying to calm down using a hand this I saw on jane the virgin in middleschool. \n\n\nThere's more things I do that could be reflective of autism  but I'm mainly concerned about the feeling of missing something thing that everyone else has? Could this just be a young adult or hermonal (I may have PCOs) thing? Or is this a sign of autism, adhd, or both? \n\nI fine with having autism and/or adhd I just want to know skills to help me better connect with people and the things around me! \n\n I want to hear more thoughts on this so any tips or advice would help. thanks!",
        "created_utc": 1674506631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this feeling common with autism?",
        "author": "IndicationForward336",
        "url": "https://i.redd.it/zeh56ayobwda1.jpg",
        "text": "I've been learning about poetry and I really enjoy it however i fail to connect and understand a lot of it. Like even if I do or don't Relate it's harder for me to explain or build a proper explanation. \n\nI feel like poetry/writing is a great art form and I want to do some myself but I'm not having an easy time being sincere. I can't explain myself in a way that doesn't sound like I'm copying what I've already heard from others. \n\nA lot of things I do make me feel like I'm copying people I've met or charaters I've seen on TV or read in books or heard in podcasts. A spent a lot of time reading books and watching TV. And now I'm basically always playing music or podcasts in my earphones so I don't \"zone out\".  Even why I don't zone out I feel that I don't count as a person? Not in a low self-esteem \"I am nothing\" way. Just that I feel like I'm pretending to be human? Like I know im not an alien or anything buy like something feels off. \n\nWhen explaining myself to friends they have brought up that possibility that I am very likely nerodivergent with most thinking im autistic or have adhd or both. I know autism and adhd Co-exist in many people. \n\nI'm not sure if this is an autistic feeling though? I am 70% sure I have adhd and wasn't socialized properly which has lead to me being like this. Ontop of this the lockdown gap I had during my 2nd semester of grade 9 to my 2nd semester of grade 11 could explain it. My teachers have called me \"aloof\", \"socially awkward\", \"shy\" but I'm not sure if that's a sign. Pretty much every teacher has said some version of this and made note if it to my parents on report cards. However I never saw a doctor about this so it hasn't been that much as a concern.\n\nI felt that I was different but not in an \"we're all unique\" way for quite a bit. In grade 5 I tried to explain it to my parents but I couldn't do it correctly. I blanked out so the only way I could explain it was as like \" I keep watching crash course video's on books I don't have!\" And I couldn't explain that I had watched so many I now hated them but couldn't stop. I feel like my day isn't complete if I didn't watch those crash course videos. Like something would go wrong if I didn't. I felt bad because originally I started watching crash course: history to understand the world! I thought if I watched all the videos I would finally be able to be have the knowledge to be the others. I didn't care about being popular I just wanted to feel like I wasn't lost all the time! \n\nI brought up trying to see someone for my mental health in middleschool but my mom just gave me a book called \"don't stress\" with a smiley sun on it. I read the book but hated it so I vandalized it, then erased it, then vandalized it again with positive messages in case my parents found it. \n\nOver lockdown My \"zoning out\" got worse and I felt completely disconnected from the world. I think it was a mix of new levels of stress, sleep depervation, and \"Kats grungle juice\" (Cold black coffee I put in a 2l Fruité bottle with sugary candy and tangerines that probably got a little moldy.) I felt that I wasn't human like my parents where and that I was going insane because I could never go back to my \"normal\". \n\nLuckily I feel the most optimistic I've ever been right now but I still feel that something is missing. I had considered adhd before but then I started to look more into it. I looked into autism as well because nearly all of my online friends have either or both. I was worried I was faking it so I asked my grade 6-8 autistic best friend. She said she definitely thinks I'm autistic. I asked her a few more things then built a small folder full of printed out articles, most credtable free online tests that they took, notes, and a letter to my mom. \n\nI gave it to my mom and asked to get Screeded for adhd which she allowed. I planned on walking my doctor through my purple folder but he was only available over phone. Instead of calling in early noon he called right before closing and I spent most of the call running around looking for my purple folder. I put it away because it was Friday and he missed a call for another thing so I figured he'd call on Monday. The call went awful I was rambling and he mainly just wanted to know if my teachers brought up adhd. I said no but that my school work was being imparted but he thought it was just normal anxiety. When I asked if I could go through my answers on the tests he seemed pissed (in a professional manner) that I did online tests. I think he thought it was a buzzfeed thing or something? I just wanted to list things. The call ended and I felt so stupid because I thought he was being literal about teachers asking about adhd. I didn't know making comments about it like calling me \"aloof\" counted! I think he thought I was at best misguided and at worse trying to get drugs. \n\nI didn't even bring up the autism stuff because I'm still nervous if it will effect my ability to medically transition (I'm transmasc). \n\nMy note to my mother was titled\"I should get tested! (And that's not bad!)\" And I wrote: \n\n\"I think I am neurodivergent (“differing in mental or neurological function from what is considered typical or normal”) which means my brain is wired differently from most people! \n\nI have felt this way for a very long time but did not know the correct way to explain it. I have been doing more research which has led me to believe I may have ADHD or may be on the broad autism spectrum. I did a couple of online tests and the results reflect that I most likely have inattentive ADHD which is very different from ADHD portrayed in the media. I know this is not a diagnosis so I would like to get tested. In doing this I can hopefully understand myself more whether I have it or not. From that I can learn how to function better allowing me to deal with loud noises, lights, sensations, and lack of things I use to calm down such as earphones, gum, darkness, and blankets. I feel that there are many benefits that can come from being tested both interpersonally and in my education. Originally, I was planning on being tested in secret once I turned 18 but I want to be honest with you and I want to be able to finish high school strong so I can better think of my future. I know this will not be an easy or fast process which is why I want to start it as fast as possible. I do not want this to be similar to when I brought up my irregular periods for years before anything was done. One of the first people we can see about this could be our family doctor who could refer me to someone else so I would like to start there. \n\n\tIf I am not neurodivergent I am just not neurodivergent if I am neurodivergent then I have new information to work with. If a doctor leans more towards me having autism I may want to hold off because being medically diagnosed could affect my rights like access to medical care or if I want to travel or immigrate. It is hard to find good sources for this topic in Canada because google is more interested in the social impacts of this but I am sure we can find out more if it gets to that point. Autism can not be medicated while ADHD can but both of them can have strategies learnt to better adjust. This does not mean that I need to be medicated with ADHD but knowing if I have it would aid me in learning how to work with it. \n\n\tIn conclusion I would like to be tested to see if I am neurodivergent. I suspect inattentive ADHD to be the most likely thing which often includes “Lack of attention to detail, trouble staying focused,frequent spaciness,Difficulty following instructions, easily distracted, forgetfulness, often misplacing possessions,Difficulty sustaining mental effort.” I see no downsides in an ADHD diagnosis even if I am wrong and I am fine or it’s something else no harm will come from it. Thank you for reading. \n\nHere are some videos I relate to on this topic…\n\n\nTimes I should've realized I was autistic\n\nhttps://www.youtube.com/watch?v=i3Vy2BPmMS4\n\n\nADHD.\n\nhttps://www.youtube.com/watch?v=mSVCBbgnRdQ\n\n\nADHD: An Honest Review\n\nhttps://www.youtube.com/watch?v=EyfLG3Hd99M\n\n\nHow to Deal with Your ADHD ft. Mizkif\n\nhttps://www.youtube.com/watch?v=hRgSrEU2miE\n\n\nA Day in the Life with ADHD\n\nhttps://www.youtube.com/watch?v=t32CK5t8d2Q\n\n\njerma having adhd for 4 and a half minutes\n\nhttps://www.youtube.com/watch?v=tBV3-Y_VHDo\n\n\nADD &amp; ADHD | Media Misdiagnosis\n\nhttps://www.youtube.com/watch?v=bIm7OuNehrk\n\n\n\nSources\n\n\nSymptoms of Inattentive ADHD - Hill Learning Center\n\nhttps://www.hillcenter.org/symptoms-of-inattentive-adhd/\n\n\nADHD Inattentive Type in Adults: Symptoms, Diagnosis &amp; Treatment\n\nhttps://my.clevelandclinic.org/health/diseases/15253-attention-deficit-disorder-without-hyperactivity-add-in-adults\n\n\nhttps://www.leadingwithadhd.com/blog/2019/4/15/adult-adhd-isnt-what-you-think-it-is\n\nAdult ADHD Isn’t What You Think It Is-Leading with ADHD\n\nhttps://www.leadingwithadhd.com/blog/2019/4/15/adult-adhd-isnt-what-you-think-it-is\n\n\nSensory processing and ADHD: overstimulation vs. understimulation\n\nhttps://www.getinflow.io/post/sensory-processing\" \n\nAnd then I also had the online tests inside the folder. \n\nI also Relate to and enjoy lot to charaters that either \"have no emotions\" or don't show emotion because I feel that I don't express or process my emotions correctly. Even if other aspects of this characters like their intelligence is something I don't have. (Spock and data from star trek, charaters from the magnus archives, a few others I'm blanking on!) \n\nI'm worried I may just be copying things I've seen on TV to appear more human. Thing is that I watch a lot if TV with charaters people consider \"autistic coded\". I feel like the worst case of this is with their show I watched with an autistic main character and I noticed I started fidgeting more with my fingers after. It reminded me of when I started trying to calm down using a hand this I saw on jane the virgin in middleschool. \n\n\nThere's more things I do that could be reflective of autism  but I'm mainly concerned about the feeling of missing something thing that everyone else has? Could this just be a young adult or hermonal (I may have PCOs) thing? Or is this a sign of autism, adhd, or both? \n\nI fine with having autism and/or adhd I just want to know skills to help me better connect with people and the things around me! \n\n I want to hear more thoughts on this so any tips or advice would help. thanks!",
        "created_utc": 1674506556,
        "upvote_ratio": 1.0
    },
    {
        "title": "what kind of comedy do you just not *get*",
        "author": "w0lfrun",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10jluan/what_kind_of_comedy_do_you_just_not_get/",
        "text": "I find that theres a certain type of satirical comedy that just doesn't compute for me. But not all satire? I find it hard to understand stuff like jerma or tyler1 (streamers) or long form content. I also (like most people tbh) can't get into stuff like Family Guy anymore.\n\nI'd be interested to know what kind of comedy other autistic/ND people find confusing and unfunny and why you think it might be.",
        "created_utc": 1674503971,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Can’t Take / Don’t Understand Comments on My Appearance",
        "author": "Turbulent_Card2370",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10jcut2/i_cant_take_dont_understand_comments_on_my/",
        "text": "I have a really hard time understanding comments in my appearance  - I tend to think they are always insincere or even mocking. \n\nAs I attempt to unmask I have consciously allowed myself to dress how I want and look how I want as a part of unmasking. I now have a long goatee and today I wore a very high-contrast black and white patterned shirt to work. High contrast things are like a stim to me, they just please me and make me calm. \n\n3 colleagues commented on my shirt - 1 said my shirt was ‘wow, that shirt is a cracker’, another said ‘you look great today’ the other said ‘you’re looking dressed up today, I like that shirt though it’s a bit dressy for me.’ \n\nA stranger said to me ‘that’s some beard.’ \n\nTo me, every one of these comments is sarcastic and mocking. The old insincere praise beloved of NT’s.\n\nAm I wrong?",
        "created_utc": 1674481611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, Why Did You Think Autistics Are So Drawn to Tech? 😂",
        "author": "Turbulent_Card2370",
        "url": "https://twitter.com/jousefm2/status/1616878021280993284?s=46&amp;t=0PiBhBT5eBAC2-9AYT8TPA",
        "text": "",
        "created_utc": 1674475153,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'd love to get some insight",
        "author": "Puzzleheaded_Lie9190",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10j7bvt/id_love_to_get_some_insight/",
        "text": "(WARNING: EXTREMELY LONG READ) \n\nHello all,\n\nI hope this is an appropriate post, I’ve been questioning the possibility of being on the spectrum recently, and wanted to hear from some individuals with a clinical diagnosis on the validity of my feelings here. I may ramble a bit, there’s \\*some\\* things I haven’t heard of being connected to ASD necessarily that I am wondering about other people experiencing.\n\nTo start off, I’m a 30M, diagnosed with depression, social anxiety, ADHD (unsure), with a couple other likely diagnoses later on. I’ve never in my life questioned the possibility of being on the spectrum, but until \\*very\\* recently, I knew absolutely nothing about it. My partner (24F) was diagnosed with Asperger’s, ADHD, and OCD about a year into our relationship. I am not exaggerating when I say I had \\*no\\* clue what Autism was prior to meeting her, I just knew sometimes more severe cases can sometimes be heavily rewarding (incredible talent at something and the discipline to excel) or heavily challenging (problems with basic function, communication, etc)\n\nEarly in our relationship, she’d often make jokes when she’d tell stories about social interactions that “maybe I’m just autistic and don’t know it 😂”. Well, that’s exactly what happened like 16 months ago. When she first got diagnosed, I felt like we were \\*so\\* similar that I should do a little exploring on my own, and quickly concluded it was unlikely. Fast forward to last month, my partner and I were at a local market event, and she mentioned that she felt like I might have ADHD, due to the fact that I was subconsciously swaying back and forth to the music at the same pace she was. I chalk that up to just the fact we spend all our time together. \n\nAbout a week ago, she made a comment about masking, and I decided I wanted to learn more, so I asked what exactly was the definition of masking, in her words. The short version, you act different around everyone, changing depending on the situation, or the people you’re around, how safe you feel, etc. She told me an example of me masking was how I act around my parents, but I was kinda shocked, because I thought \\*everybody\\* did all of that. I thought it was 100% normal to act a certain way depending on pretty much every factor. I act different at work, and I act different around individual people as well, my tone changes unconsciously, I either feel fine looking at them or avoid eye contact at all costs, etc. then I act different depending on where I go, if I’m in the grocery store, at a bookstore, at a restaurant, etc. I’m overtly polite at restaurants always. If I’m browsing as well, but I have a bit of a demeanor change if I’m shopping for something specific. Additionally, I act different depending on if I’m shopping with my partner or not. Growing up I feared being made fun of for my interests so I’d often not talk about them to people. I also changed my personality, as best I could, to make myself more “palatable”. Regardless, she validated the possibility enough for me to dive a little deeper.\n\nI decided to try and shut off my filter the last few days. Basically, I hesitate in pretty much much every part of my day before opening my mouth, moving, etc. I think I tend to hear or see something, process it, my brain has a reaction, I ignore that gut reaction and try to react based on how I feel I want to be perceived in that particular interaction. This tends to lead to a lot of silence sometimes, cause I react to something mentally, then some part of my brain decides my partner or whoever I’m with or around wouldn’t find it funny or interesting, so I just ignore the instinctual reaction my brain wants to have.\n\nSo I tried shutting that off as best I could, and just share the reaction my brain comes up with. I’ve noticed I make a lot more noises when I’m alone, my social interactions have been a little more disconnected, and I fidget nonstop, but I’ve felt SUPER happy. The social stuff has often been me saying something in response that only makes sense to me, or the timing didn’t make sense cause they were already walking away, they were actually talking to someone else, etc. After all that, I’m not necessarily convinced of anything, but it has honestly felt like a weight lifted off my chest to not over analyze my own thoughts and interactions 24/7, so that has felt good. My next step was doing some research on my own brain.\n\nWhen I was 25, I went into residential treatment for drug and alcohol addiction, specifically, prescription amphetamines. I started using them at 18 for school work, and I fell in love with how they made me feel. I could stay up forever, concentrate on anything, and I had a lot more confidence in social situations. This mixed with alcohol was the perfect combo for me to finally feel a little more like I fit in. So, I don’t think I have ADHD, because I definitely felt a \\*high\\* from the meds, for a little while anyway. Soon I needed it to function, addiction ensued, hence treatment. They did a full observation and psych eval, and after reading it last night, I’d like to get some thoughts. Jumping right in, on the WAIS-IV test, they wrote that my “unique set of thinking and reasoning abilities make his overall intellectual functioning difficult to summarize by a single score. His nonverbal reasoning abilities are much better developed than his verbal reasoning abilities. Processing complex visual information by forming spatial images of part-whole relationships and/or by manipulating the parts to solve novel problems without using words is a strength. Making sense of complex verbal information and using verbal abilities to solve problems are less developed”. Under the summary of verbal comprehension, it mentions that the discrepancy between my verbal and nonverbal scores occurs in 1-2% of the population. On the arithmetic subtest, my score was in the 99.9% percentile, and the discrepancy between that score and my others in the perceptual reasoning category, was again recurrent in about 1% of the population. I know these things can mean absolutely nothing potentially, I’m just trying to summarize what I think might be pertinent I guess.\n\nNext was the MMPI-2 personality test, which opened by saying that “his response to the items suggests a tendency to be overly self-critical, and he may believe that he has inadequate psychological defenses to cope with his current challenges. He may have responded to this inventory in a manner that suggests he needs to call attention to his difficulties and portray a less than favorable impression than is warranted.” This part trips me up a little because the it’s worded feels like it’s kinda saying I exaggerate my difficulties I think? I’m not sure how, I took it 5 years ago so I recall none of the questions, but oh well. It continues, “He produced numerous elevations on the clinical profiles, indicating that he experiences chronic psychological maladjustment. He likely feels overwhelmed with anxiety, tension, and depressive symptoms. He indicates feeling helpless, lonely, inadequate, insecure, and pessimistic about his future. While he attempts to control his worrying through intellectualization and self-analysis, these strategies are likely to be ineffectual. He is prone to mental disorganization, difficulty concentrating, poor decision-making, and chronic perceived stress. He tends to overreact to even minor stress, and he may show rapid behavioral deterioration when faced with normative life events. He also tends to blame himself for his problems, and this likely affects his self-efficacy. His high endorsement of general anxiety content is likely to contribute to functional distress.”\n\n“He endorsed having numerous thoughts that are relatively unusual and may alienate him from others. In addition, he endorsed items that suggest he is experiencing conflict with regards to his gender-role identity. Specifically, he endorsed interests and activities that are stereotypically Feminine, and indicative of discomfort in romantic relationships. His responses are highly suggestive of someone who experiences severe depressive symptoms. Specifically, he described a preoccupation with guilt, pessimism, low self-esteem, apathy, and mental confusion. In addition, he endorsed items that suggest he has a high potential for explosive behavior at times. He describes feeling somewhat self-alienated and expresses some remorse about past acts. He also tends to have problematic personal relationships, and he may struggle with basic social skills. He describes himself as an introverted person who has difficulty meeting and interacting with others. He is likely to be described as shy and emotionally distant. Individuals with similar profiles are often diagnosed with an anxiety disorder or depressive difficulties. However, his endorsement of bizarre and unusual mentation should be further explored. Despite overt denial of suicidality, his endorsement of suicidal ideation on this instrument is indicative of further monitoring.”\n\nThe next couple I’m just copying the bits that seem potentially relevant. Next was the MCMI-IV Clinical Profile.\n\n“He produced a valid MCM-IV clinical profile, and the following interpretation is likely to be a valid reflection of his personality functioning. His clinical profile is suggestive of someone who experiences significant ambivalence with regards to his emotional experiences and motivations. In addition, the template on which he uses to interpret his world is likely to be compromised, which can contribute to significant distortions. Although he is typically able to function adequately, periods of marked emotional, cognitive, or behavioral dysfunction are likely. Individuals with similar profiles have significant difficulty with anxiety, moodiness, irritability, and an ambivalent submission to the wishes of others, and may even tolerate mistreatment in an attempt to avoid rejection or ridicule. He likely experiences significant difficulties with anxiety and ruminative ideation. Lacking a secure foundation of self-esteem, he may feel hypervigalant to potential sources of interpersonal threat. While he may demonstrate respectful behavior outwardly, he likely holds rebellious and hostile feelings that occasionally break through his calm demeanor. Fearing exposure of these feelings and seeking to maintain control, he is likely to struggle to maintain his life of rigid self-discipline and restraint. He seems to strive hard to control his offensive thoughts or impulses for fear of retribution or a withdrawal of nurturance.”\n\nNext is the WISPI-IV Personality Disorder Test.\n\n“Results of the WISPI-IV indicate that he is exhibiting many characteristics of Avoidant Personality Disorder. In addition, he endorsed having minimal personality traits that are thought to be antithetical to these personality disorders. This diagnosis should be evaluated further.” Finally, the ASEBA Self Evaluation thing? which shared, “on the ASR problem scales, his Total Problems, Internalizing, and Externalizing scores were all in the clinical range above the 90th percentile for men aged 18-35. His scores on the withdrawn and rule-breaking behavior syndromes were in the clinical range above the 97th percentile. His scores on the Anxious/Depressed, Somatic Complaints, and Attention Problems syndromes were in the borderline clinical range (93rd to 97th percentiles). These results indicate that he reported more problems than are typically reported by men aged 18-35, particularly problems of anxiety or depression, withdrawn behavior, somatic complaints, attention problems, and rule-breaking behavior. The sum of his scores on the Critical Items was in the clinical range. These results suggest that he may meet diagnostic criteria for Avoidant Personality Disorder, Antisocial Personality Disorder, Depression, and somatic disorders.”\n\nSo after reading all of that, I’m kind of lost. When I googled “what disorders are most similar to autism”, the first example in the first result was Avoidant Personality Disorder. I know it’s not the most similar or anything, it was just an example of a potential similar disorder, but I was very surprised when I saw that. My biggest issue with figuring this out, is that I don’t feel I had the developmental issues early on in life, or many of the problems that are common in children on the spectrum. However, I have no \\*real\\* way to measure my social skills against a “normal” person, because I was homeschooled 2nd-12th grade. \n\nSo there’s all that. 😂 I have lots of memories from childhood popping up that I feel could be vaguely applicable but I don’t know if they’re just normal things kids do to a less extreme level. But this is essentially a stream of consciousness portion about anything I can recall unusual about my childhood. I do know that I had very restrictive food likes for a very long time growing up. If it tasted bad, get it away, if the texture was unpleasant or unexpected, that was just as bad. Actually, worse, texture was definitely what I took issue with most. I was the kinda kid that couldn’t eat the fries that touched the mayo cause I hated it, or if some juice from roasted vegetables or something got soaked up, I couldn’t eat those fries, even if I was still hungry. If I could taste \\*anything\\* other than fried potato and tomato sauce, I was spitting it out. I didn’t eat vegetables regularly until my mid 20s. I still can’t eat anything that comes from the ocean. The saltiness makes me want to vomit. I’ve tried oysters, various kinds of fried, baked, and grilled fish, grilled shark, calimari, crab, and lobster. As of now, I tolerate some things, like the occasional bite of salmon, but I don’t really enjoy it. The flakiness of the texture is off putting to me and I can’t focus on anything else when I’m trying to chew it. Crab and lobster, same issue, the texture freaks me out. I \\*hate\\* anything that makes noise against your teeth, like veggies or something that squeak against your teeth and you can feel the vibration in your whole jaw. If I DO have any genuine sensory issues, they center around food a lot of the time. 😂 I do remember having issues with certain clothing. Only certain shirts and materials felt good, and I couldn’t deal with tags. If my mom didn’t cut them out, I’d sometimes just wear my shirt inside out all day instead. Similar issue with socks, I almost exclusively wore them inside out because I hated the seams. I could never find comfy shoes, we’d usually spend like an hour and a half of me trying on 10-12 pairs before I liked something.\n\nSocially, early on is fuzzy. I don’t remember playing with kids in preschool, I remember playing “house” by myself with a doll and that’s my only memory from that time. When I was 7, my mom pulled me out of public school to homeschool me and my brother. She homeschooled us all the way through, and she tried her best. In the end, I think we got solid education. Obviously, the social issue arises. My mom would find groups of moms who homeschooled their kids for park days and stuff, but there was only a couple people we ever met up more than once or twice. I tried several team sports and quit all of them. I don’t think I ever worked well in groups. Generally, I take things super seriously, and get mad at others who don’t do the same. When I was 10 I started competitive swimming, I loved it. A theme I’m seeing begin to emerge is repetition, and swimming was perfect for me. You swam on a team but competed as an individual, scoring points. It gave my days more structure as well. I did that for 10 years, religiously, 6 days a week. I loved the sport, but it didn’t exactly offer an Amazing social outlet cause everyone’s out of breath the whole time, and there’s a lot less people than a public school. Anyway, I was just kind of okay at making friends, and I felt super nervous and intimidated approaching certain people for no apparent reason. I never really felt like I had a best friend, but I always did better in one on one interactions than in groups. My social life pretty much only existed cause of my brother by the time I hit 14. Around the same time, I learned how to solve a Rubik’s cube, and we also moved to a new swim team. \n\nI didn’t like many people on the new swim team. All my brothers friends gave me a hard time cause I’m the younger brother, and I guess I also occasionally made “feminine” gestures that warranted gay jokes and ridicule. Just general bullies. Well, big bro had just gotten his license or whatever so my only chances of going out and doing stuff were through him. A lot of times I didn’t go, a lot of times I wasn’t invited. The times I did go, it was hanging out with these “friends”. My brother was also always meeting girls and going on dates. He never liked hanging out with any of my friends. My closest friend was on the old swim team so I didn’t see him anymore, so around 15 I withdrew a lot. I made less attempts to socialize, I got incredibly absorbed into speedcubing and YouTube lets plays, and spent most of my time on video game and puzzle forums. I’ve \\*always\\* felt 10x more comfortable writing thoughts than verbalizing them, so I felt like I could communicate better online. I just enjoyed it more, no anxiety in my safe space. So a couple years pass, my cube collection fills several shelves and my game collection grew as well. At this point, I still haven’t had a successful relationship. I dated a girl when I was 15 for a year, and it was alright. I loved texting her and showing and receiving affection, but in person, I couldn’t approach her or talk to her, let alone make eye contact or have a conversation, for several weeks probably, if not more. 😂 Long story short, it was a very socially awkward relationship, I don’t think I’ve ever read romantic advance social cues well. Generally speaking, I’ll only show interest in someone who’s already shown concrete evidence they’re interested in me, and I have historically fucked up in that department, being told by others after the fact that the girl was trying to make an advance or that they liked me and I was oblivious. The possibility of rejection scared me a lot, so this method of operating felt safe.\n\nAnyway, I got to go to my first school dance with her. There is no place in the world more anxiety inducing for me than the catering halls and shit hotels rent out for things like that. Our swim team would have celebration events sometimes that there was music and dancing and I was terrified of being asked to dance. I can’t handle direct attention like that. So an event with a whole school of strangers who all know each other wasn’t my ideal environment. She saved me the embarrassment of being seen dancing, she spent the whole night speaking to the kid from her class who had a crush on her and was sad cause I was dating her, while I hung out with her friends at another table and just watched. She broke up with me the next day. Then she wanted to get back together, break up again, etc, it was a nightmare. After that, I had a couple relationships that lasted several weeks from 16-17, but that’s it for dating before 18. when I was 16, my brother and I, through some weird loophole, we’re allowed to swim on my local high school swim team. Most of them were super close friends, and they kinda welcomed us, moreso my brother. However, I think this is when I began seriously masking parts of my personality. My brother was more accepted cause he was in the same grade as everyone else, the grade above me. So again, the little brother treatment, but it was different here. The guys who bullied me from the other swim were mean shitty people, these people from the high school team were super cool! Until, even they began to get annoyed by me, I’d constantly be told to shut the fuck up, they started inviting just my brother to most of their hangouts, and I just didn’t know what to do. I know was pretty annoying, I had trouble controlling myself sometimes quoting tv shows or doing impressions, like a joke from Family Guy, for example. A lot of times I was the person who “killed the joke” for everyone else. This is a situation where I question if I do have “social cue” issues, because I could never seem to know when enough was enough, Is this a legitimate theory? \n\nRegardless, at that point, I had started smoking weed, and this seemed to help my social life a lot. Being way more chilled out while high, I was way less hyper and loud, I was also making new friends from my own grade at the high school, through attending the football games. They sucked though. I realize looking back that there was multiple times our “hangouts” were simply needing a ride but being unable to drive cause they’d all been arrested and didn’t have licenses. I distinctly remember one time I picked up one friend, we proceeded to pick up \\*three\\* more people from \\*three\\* different houses. Ok, it’s at least all people I know, that’s ok, where to next? Final location was some dealers house, the four of them asked me to drop them off. I was their personal taxi for hours and I didn’t pick up on it because I thought what I wanted was to come off cool to these people. I thought we were picking people up to go smoke together. I occasionally got invited to parties too, but again, looking back, I think I was \\*really\\* just there for transportation for the person inviting me. My senior year, I made a final move to a new swim team, this time with a different high school nearby. There, I met my first serious partner. I made some new friends via my new personality of “kid who smokes weed”, some good, some meh. My partner and her best friends, two twin brothers, became my closest people. They were the first people I felt totally safe around in years socially. I think I kinda opened up to them, and didn’t mask as much. For some reason, I had this irrational embarrassment of my love for video games, because everyone played Halo and Modern Warfare and I just wanted to play Banjo-Kazooie on my N64. Furthermore, I was collecting merchandise, and complete in box retro games, etc, building a collection of a couple hundred games, posters, systems, and pieces of memorabilia. I didn’t talk about that really to anyone other than those 3 people because I felt uncomfortable about it because I thought I’d be made fun of. Same with cubing, I had dozens of Rubik’s type puzzles I collected and learned to solve. Again, these were the people I felt totally safe sharing these things with.\n\nFinally, there’s a couple superficial factors that point towards a higher likelihood. The history of addiction, I was born premature, and I read complications can increase likelihood. I don’t exactly what happened, but I got air lifted from the hospital right after birth cause I couldn’t breath on my own cause my lungs were too weak or something, and they needed to take me to a different hospital. gastro esophageal issues are a sign and I have ulcers in my esophagus from GERD so that fits, mother has mental health issues, etc. Anyway, If you have actually read all of this, I genuinely appreciate you and your time very, very much. I’m sorry for wasting any of your time if this was dumb. I’m sure there’s more I’m missing but I’ll stop now. Feel free to ask questions if you have them, Thank you again!",
        "created_utc": 1674461150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Auditory stimulus - uncomfortable",
        "author": "pLeThOrAx",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/10j2t6z/auditory_stimulus_uncomfortable/",
        "text": "I've discovered I don't like a particular sound in the show Bones. In the lab of Dr Saroyan, there's a sound with a pitch and intonation that's like my microwave. I find it startling lol. Thought maybe someone could relate",
        "created_utc": 1674445152,
        "upvote_ratio": 1.0
    }
]