[
    {
        "title": "Does anyone else feel like that?",
        "author": "Neptunic_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zux074/does_anyone_else_feel_like_that/",
        "text": "I've heard many autistic people saying they feel like \"everyone has been given a manual except them\", I don't, but I feel something similar (yet not quite the same!)\n\nDoes anyone else feel like they were given a manual on how to communicate with people, just a different one, the one that works only with very specific groups of people?",
        "created_utc": 1671970308,
        "upvote_ratio": 0.99
    },
    {
        "title": "I don't know how to tell my family i might be autistic",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zusfp1/i_dont_know_how_to_tell_my_family_i_might_be/",
        "text": "I don't have a diagnosis yet, but i have autistic traits since i was a child, i suffered from bullying and depression all my childhood, it took me a lot to hide everything of me that could be seen as \"weird\" but i've reached it at 16 yrs old, now i'm not trying to hide it, at least just around my family and i'm much comfortable now, i thought all my life that i should try to act \"normal\" cause my personality annoyed people, but now i'm working at accepting myself, but my family doesn't wants to accept it, i don't know how to talk about it with them.",
        "created_utc": 1671950021,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've always wondered \"why\", and suddenly I feel like I've found my answer but then imposter syndrome crushes me.",
        "author": "InsuranceFront5326",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zuo7wl/ive_always_wondered_why_and_suddenly_i_feel_like/",
        "text": "Disclaimer: I don't EVER share like this (even though everyone says I overshare which has always confused me since I was just trying to make them feel seen or stating facts about my life), and this is really scary for me so if you don't want to read this or just have something dismissive or mean to say please just don't. I'm really just seeing if anyone can understand or if I'm just going down some rabbit hole again. I just really feel like I'm autistic and in a way, it has helped me reframe my life and forgive myself for a lot of things that have always weighed on me. If you don't feel like reading all of this just share with me your experiences. \n\nSo I'm a self-diagnosed (currently unemployed but really really want to be assessed, but also scared that I'm not autistic and it will crush me to be back at square one), female in her 20s. My mom was always \"different\" and it took others pointing out that she was abusive for me to accept that because I always felt like she understood me, and I her (but of course never said that). I've always searched for a reason why she was the way she was, and why every member of my family was the way they were because it was simultaneously easier to speak to and relate to my family members than it was to speak to or relate to other people (and I mean about literally everything). Still, they all separately (including me) seemed to have their own tragedies that made all of us isolate ourselves from each other physically and emotionally and over time it got harder to speak to one another. for background my mom had extensive trauma and was extremely stubborn. everything was a personal attack and when she'd lose it, it was like she'd shatter and become physically abusive or would melt down (over sometimes what looked like nothing). I thought it was extreme OCD mixed with schizophrenia (she started hearing voices at a young age) but five minutes later would lose herself in whatever she was (researching) at the time (I'm not saying she's not schizophrenic or something else but even before it got bad she'd do things like twirl a grape stem for hours while she talked and always interrupt people and say things like she never felt understood).  She was extremely intelligent and would only speak about or look at things that related to that interest which I never really thought about because I would do the same thing, and my brothers were the same way as well. She always told us that other people didn't understand us and that we thought too deeply for others to understand our answers. Appearances really mattered to her so we always looked \"proper\" and like \"everyone else\" even in the depths of poverty.  My father (very successful niche career without any education because he scores so high on all assessments) always told us he was bullied and emotional as a kid,  would correct teachers, and the dictionary was his favorite way to pass time, and to this day hates concerts and grocery stores (everyone in my family hates grocery stores we'd always go \"together\" even though we didn't necessarily agree we had to all go together it's just what we did). Also, when interactions would go well in my family (rarely but did happen) it was because we were deconstructing the state of the world over dinner or talking about books/movies/music, or artists that more than one of us loved. These kinds of conversations would even include a deep analysis of how we approached and thought about that subject not just about that subject, (I'm sorry for rambling I just think this is pertinent to the entire story). I know my oldest brother was extensively assessed as a child for his learning disabilities, speech impediment (which all of us had to a lesser degree and \"fixed\" ourselves), and eyesight (he has 20/20 vision but would miss things I guess), and my little brother would forget to eat for most of his childhood because he was walking in circles and making explosion noises because he said he was busy with his mind, which I never thought was weird because I have an entire world inside of me where I go sometimes to escape and then feel guilty.  Recently I learned that my mom had said (repeatedly) that my oldest brother was on the spectrum but as her (possibly schizophrenia) got worse she stopped trusting doctors entirely and had a meltdown when it was suggested that my little brother was on the spectrum. I remember her once saying that someone had told her she was on the spectrum and that people were stupid and didn't truly understand her or us (which for a long time I just excused as her being mentally ill). To me, autism was never even something I thought about because I didn't even really know what it was. We were all avid readers and were often told that we were gifted except I had to practice bringing food to my mouth and not bringing my mouth to food (but didn't tell anyone). Although I was reading (constantly) at a very young age and reading at a much higher level than my classmates, my father had to spend a week teaching me how to spell correctly because I was falling behind since there seemed to be no method to it.  Once he taught me his tricks I was able to do it as well as everyone else and to some degree better, but I've always been anxious that one day I'd forget how to. \n\nOver time my mom got worse and two of my brothers became addicts and would tell me that no one understands them and then self-isolate for weeks. My mom self-isolated and her finances got worse and worse even though she is the smartest person I know. My oldest brother just decided one day that he wasn't going to be him anymore (he would sit and play his instrument for hours and didn't really like to talk or be around people and was bullied a lot) and he became this stereotypical finance bro but he's really pushy, he sees everything in black and white and takes over conversations to talk about his interests and I never really thought about it until it became more apparent to everyone else, because I relate to him to a certain degree, and could always tell he was really embarrassed and felt guilty about it. At the beginning of this year, I had my mom committed to a psych ward because she was homeless, wouldn't eat for days and would bang her head against the wall and in the same breath tell me about how capitalism was ruining the world with a very well thought out argument that connected multiple facets of society. It was really traumatic for me and she cut me off because it was the ultimate betrayal and recently went missing which I'm trying to grapple with. And I haven't said this to anybody because people just see her as abusive but she was the only person that ever really listened to, understood, or saw me. \n\nNow I know a lot of this could be trauma but my siblings and I all either have one close friend or none at all, we genuinely enjoy being alone, but are really lonely, and never feel like we can communicate properly with others but have this intense longing to be liked. We were all popular in high school but I think it was because other people would tell us we were \"attractive\" and \"beautiful\" even though it took me a while to realize that that's something that matters to everyone (I'm not trying to boast I just wonder how much of a part \"pretty-privilege\" played into our social lives since we were all bullied but others would tell us we were \"cool\" even though when we were alone we'd talk about how weird we were). For me, most of the people that were my friends weren't particularly interesting or kind or even funny, but I really cared about being their friend, not really them (and it never felt like they really knew me anyway, I always had to change myself to make them more comfortable and remember to keep my face a certain way, etc. and then being their friend would just take too much effort and energy). As adults, my siblings and I all have different separate clinical diagnoses of, for example, depression (me) or BPD, PTSD, CPTSD etc. except all of us hate therapy and don't do it because therapists don't \"understand\" ( I know it's unhealthy it's just that I don't feel like explaining myself more to someone that doesn't think about all of the possibilities and variables or even say what they mean, which I already deal with daily) and we all have extreme anxiety. I've lost multiple close friendships throughout my life (the friends I really really really loved) and I  know we had issues but I don't know in the end why they stopped talking to me. While several of them have called me the R-word for moving wrong or experiencing numbers as colors or not being able to look at someone when I know they're mad at me, I would just brush it off by telling myself I'd just never tell anyone that again, or would work on \"fixing\" that about me. \n\nAgain, I know we might all be really traumatized (I've really only explained a small slice of my childhood) but I've always felt like there has to be a reason I only got close to people with diagnosed ADHD/ADD, or why my mom was so loving but also so hateful and there was no in-between, or why I feel like I could talk for hours but people still won't understand that my feelings are these massive waves that crush me more often than I can \"feel them\" the way I think others do -  why I don't miss people but still care about them, why I feel like I'm lying when I say what I (think) they want to hear, why I became proficient in javascript in only a couple of months and then when someone suggested monetizing that skill it became physically impossible to do it anymore because then I'd be expected to use it for the purpose of some evil corporation or personal gain. My interests feel like they are so much more than just a way to make money. They are me and they're my therapy and my comfort and the source of my ever-present guilt most of the time. I don't want to do them for someone or something else. \n\nThis is super long, I'm sorry, and if you've gotten this far I really appreciate it. Lastly, I wanted to mention that I came across autistic burnout and started crying because I have never related to anything more. I thought I was going insane because a few months ago while trying to finish my degree, spelling became really hard for me again, I'd actively avoid talking to people because I \"overshare too much\" and I couldn't control it anymore, or I had literally nothing to say and their faces would crush me cause I'd forget the entire conversation at that moment but still try to figure out what I did wrong (if that makes sense). During my last semester in college, I even had to memorize word for word a script for the presentations I had to do, but I never told anyone that my script would include a greeting and filler words so I could sound more human, but then I'd feel like the whole presentation was a lie. The delay between thinking about responding and what I should say and actually speaking has become longer and I feel like I can feel my toenails grow, and it takes me hours to shower because I sit on the bathroom floor and stare at the curtain and think about nothing and simultaneously everything and it never stops until I just end up sobbing. I had a meltdown the other day because of a misunderstanding and scratched up my entire face which is really embarrassing I just can't explain that I never wanted to hurt myself I just wanted to burst the bubble that was swelling inside of me (if that makes sense). When I started looking into autism it was like my entire body was floating because I had never seen myself or my brothers and parents described on a \"list\" because I thought we were too complicated to be summed up in such a way (introvert and extrovert just sound like a way to describe different moods even though I lean more towards introvert). When I spoke to my dad about it we really bonded over the different things on the list but he says he's at a place in his life where he just doesn't offer anyone explanations and sets boundaries with social settings because he can \"hear everything.\" My oldest brother got really angry when I brought up that I wanted to be assessed and said I should read this book he read on how to make friends and have conversations ( he's pretty successful in his field but as I said, it's kind of like he's LARPing a finance bro, but says that everyone feels like us and to just try harder to be liked). Anyways, most days I sit on my couch and stare at the wall or research whatever I'm most interested in (like autism right now) or listen to the same song over and over and over again and I feel useless and paralyzed and can't go anywhere without noise canceling headphones that only kind of help because I FEEL sounds. I have to extensively prepare myself to take my dog on a walk because of the noise and lights and cars and the necessity to watch strangers (I'm a woman so that's something we do but I don't have the energy to watch anymore and that gives me more anxiety, thank god I have a pit bull that looks like it will eat a man for breakfast). I know that my boyfriend is really supportive (he has severe ADHD and in his words \"probably a touch of the 'tism\") but I can't seem to get the point across that everything and everyone fills me up all at once to the point where I lose me and I have to spend hours just trying to sort through my actions and thoughts wondering if they're genuine or not, and who I am or who everyone is and why no one else cares that the earth is dying and people are being hurt by a world that didn't have to be this way. It feels like my world has finally ended and everyone else's just went on. I guess I just really accepted I was losing the motor skills that I had practiced and was slowly descending into madness like my mother and her family (mostly suicides). Because it's so hard to be understood and seen when I'm apparently either \"shouting\" or \"mumbling\".  I guess I am just wondering if we are all just neurodivergent and autistic and were undiagnosed and unaware and unconsciously masking (obviously that doesn't disclude trauma and other stuff but it would explain all the things trauma and other stuff can't). It's like the exhaustion of life that I've always run from has finally caught up with me and the thought of remembering to smile when someone says hello throws me into what I previously thought to be existential depression except I'm always filled with too much even though everyone else just sees me blankly staring at something. \n\nIf you actually read this thank you. If there are spelling and grammatical errors please know I did my best and thoroughly checked this multiple times but more stuff has been slipping away. I graduated summa cum laude but the thought of applying to jobs and working in a \"corporate\" environment or \"networking\" (vomit) with people, and having to pretend and shove down everything again is seriously debilitating. It sounds dramatic but I swear it's a lot. I don't want to end up like my mom but I feel really broken. My boyfriend suggested support groups for trauma but I don't want to cry in front of people and I feel like I can feel others' emotions and I'm already struggling to sort out which ones are my own. When I found this Reddit thread it felt like every post was written by me and everyone is so respectful and kind and assuring and intelligent and for the first time, I felt like I could relate to other people (usually I relate more to poetry, music, stories, and art). There's of course a massive list of reasons I have made for why I think I am on the spectrum, but I wanted to know if anyone whose diagnosed could relate to this since the RAADS-R test is extremely frustrating and doesn't give context or clarification for their questions so I feel like my answers aren't genuine (still scored a 189). \n\nThanks again if you got through this. I really hope someone understands. I really hope I'm right, I feel like this could really help me cope and live a somewhat meaningful life.",
        "created_utc": 1671933737,
        "upvote_ratio": 1.0
    },
    {
        "title": "hello! I’m the (adult) child of an autistic mom and a neurotypical dad, and I’m looking for advice for how to support my mom better",
        "author": "hja937",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zuhyev/hello_im_the_adult_child_of_an_autistic_mom_and_a/",
        "text": "My mom is in her 60s, and just recently revealed to me that she’s autistic (which she herself doesn’t know much about since she got diagnosed as a kid and never got support or information). She’s always had trouble with things like social interactions/social norms (which my dad is not good at being patient or understanding about because he doesn’t know) and sitting at places for long periods of time (like at church, which is too quiet, or at a restaurant, which is too loud for her). I want to help her find ways to feel more comfortable in those situations, and was wondering if anyone has any suggestions or advice. I’ve thought about finding a fidget toy or something, but I’m curious about other ideas too.",
        "created_utc": 1671913422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone get scolded by parents for not looking them in the eyes?",
        "author": "mother-demeter",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zuheaq/did_anyone_get_scolded_by_parents_for_not_looking/",
        "text": "I remember arguments with my mom when I was a kid, after I'd angered her in some way, and she'd be so insistent that I look her in the eyes. It felt difficult then, and often feels difficult now. Normally when I remind myself to look someone in the eyes, I spend so much time and focus on the task itself (\"look straight on, and hold contact, but not for too long\") that I lose the thread of conversation altogether (\"wait, what were they saying now?\")\n\nI'm just curious how many others have memories from childhood of being scolded for looking down/away from parents when they talked.",
        "created_utc": 1671911760,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t feel sad when anyone dies",
        "author": "theothesimp",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zuf6ry/i_dont_feel_sad_when_anyone_dies/",
        "text": "Or empathetic. Recently my school guidance counselor died and when I heard I felt no sense of sadness or empathy. When my cats died that I had know for my whole life and were my closest friends I didn’t feel sad. I didn’t even cry or miss them a bit. If my whole family or all my friends were to die I wouldn’t be sad even though I love them. I feel like a shitty person because of it.",
        "created_utc": 1671905221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scared of the dark/caves/dungeons in video games. Just curious if anyone else relates",
        "author": "fakeshay",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zueree/scared_of_the_darkcavesdungeons_in_video_games/",
        "text": "As mentioned caves, dungeon, deep underwater spaces, and dark spaces in general make me pretty unsettled and uncomfortable while playing video games. It’s the reason why I haven’t finished playing a lot of games I really enjoy, like Hollow Knight, Skyrim, Witcher 3, Bioshock, Elden Ring, and just most souls games in general. \n\nI was just wondering if this could be an ND thing or if it is just a me thing.",
        "created_utc": 1671903960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions for trans and nonbinary autistics - did you have trouble noticing you weren’t cis due to difficulty labelling your own emotions?",
        "author": "bwww22",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zuealy/questions_for_trans_and_nonbinary_autistics_did/",
        "text": "TL;DR: I had no idea I was trans until I was 23 because I misidentified my experiences of dysphoria as body image issues, hypersexualization of my ‘feminine’ body, and thinking I was a lesbian despite liking men (just in a gay man way not in a straight girl way). I wanna know if others had similar experiences (include examples if you’re comfortable!!) because I have a lot of imposter syndrome about being trans.\n\n———\n\nI’m autistic and only just (23) realized I might be trans. \n\nI’ve identified as nonbinary for the past year or so but never identified with the label trans. Over the past few months I’ve sort of had a revelation moment in which I realized I was transmasc and possibly a trans man. All of a sudden so many of my experiences growing up are being explained after years of never fully making sense.\n\nI think the reason it took me so long was because - well mainly my own internalized transphobia and transphobic family - but also because I am autistic and have a reallyyyyyyy hard time reading my own feelings. \n\nI can only notice my feelings based on guidelines I’ve memorized (ex. feeling shakey and restless and nauseous = usually anxiety) but because I didn’t suspect I was trans and didn’t have a guideline that matched my own experiences (cause even being transmasc and wanting to transition to male presentation, I’m still very femme and ‘girly’, instead of the uber masculine trans men I’d seen online).\n\nAnyways, I’m really curious if you guys have had any similar experiences where you completely missed the fact that you were trans because of autism and alexithymia?\n\nCurious about experiences, examples, and just anything you all wanna share! I have a lot of imposter syndrome based on how long it took me to realize I was trans and would love to know I’m not alone!",
        "created_utc": 1671902576,
        "upvote_ratio": 1.0
    },
    {
        "title": "None of my parents are autistic, so would it be impossible for me to be?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zub3tm/none_of_my_parents_are_autistic_so_would_it_be/",
        "text": "18 male ( ADHD, suspected ASD ) None of my parents are autistic, and it's causing me to doubt that im on the spectrum. Im the youngest in my family of 5 other siblings. We all have the same mom, 2 have the same dad and the other 3 have the same one. Im the only child to my dad in my family. My oldest brother has a Intellectual disability, but we have different dads but besides that none are autistic. My whole life I never lived with or seen my dad besides a couple visits with him, all I can remember is him being kinda awkward, struggling to finds words to say to me ( though english is his 2nd language ) , sometimes can't find a subject to talk to me about, and hard eye contact ( All part of what of what I struggle with socially, but I lack eye contact ) My mom is ADHD/BPD and im kinda the opposite of her. They had me when my mom was 37 and my dad was 42, I heard old age is a factor idk if that's my case. Do any of have parents or siblings that aren't autistic? Or is it all genetic?",
        "created_utc": 1671892786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do neon Lights bother you?",
        "author": "Eddo-The-Elephant",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztyuyr/do_neon_lights_bother_you/",
        "text": "I've been considering buying a neon light from an artist I follow for my apartment. I am unsure of how I would react to a neon light, though. I do not respond well to fluorescent lighting, and hum sounds typically bother me. \n\nThe artist lives pretty far away from me, so I couldn't really ask to spend time around the light to see how my body responds. I'm leaning towards not buying the light, but I'm curious what experiences others have had with real neon (not LED \"neon\").",
        "created_utc": 1671847092,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't miss people when they are away",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztyuuw/i_dont_miss_people_when_they_are_away/",
        "text": "When my grandparents are away for months i don't exactly miss them, sometimes i got a feeling of wantid to be around them, but most of the time i don't think about it, i don't get the meaning in missing someone that isn't at reach, it makes no sense for me, you just suffer, i don't understand why i can't miss them cause i love them, but i don't suffer when they aren't with me, my family is disgusted with me because of it and cause i don't send mesaages to them either, but i just can't do it, it's too much for me to send messages or calling people without an objetive, like talking to them about something in particular, i don't know what they expect from me and that makes me anxious.",
        "created_utc": 1671847084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today i feel icredibly uncomfortable",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztygrp/today_i_feel_icredibly_uncomfortable/",
        "text": "I don't know why, but even music can't make me feel better, i feel uncomfortable everywhere, i feel uncomfortable in my body, i don't exactly know how to explain it, do you feel this way sometines?",
        "created_utc": 1671845855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does?",
        "author": "OtherInvestment4251",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztxpd1/does/",
        "text": "Anyone have neurological and autoimmune issues? Iv been having a lot of random issues for about 6 years and just read something randomly that said many people with autism actually have neurological and autoimmune issues?\n\nIs it common in the autistic community?",
        "created_utc": 1671843574,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who know me well don't think I'm autistic. What should I make of that?",
        "author": "BlindAutismThrowaway",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztvgi0/people_who_know_me_well_dont_think_im_autistic/",
        "text": "So, I just had a conversation with my mum about autism, to which her response was “You’re not autistic”. I asked her why she thought that, and she said “you’re too gregarious”. ‘Gregarious’ isn’t the first adjective I’d think of to describe myself, but I can see why she thinks that of me. I do tend to joke around with her more than I would do with people I’m less comfortable with. It reminded me of a time a few years ago, before I’d got into intensively researching autism, when I raised the possibility with a friend who used to work with autistic people, and her response was “you’re not autistic, you’re too sociable”. I talked to her about it again more recently, and while she didn’t dismiss me in quite the same way, she did give me the “everyone’s a little bit autistic” line. Again, I can see why she thinks I’m sociable. I find her easy to talk to and she’s one of the few people I find it relatively easy to initiate interactions with. But I also know how much initiating, and social interaction generally, is a huge struggle for me most of the time.\n\nAt the beginning of my more intensive autism research journey a couple of months ago, I raised the possibility with a friend who is diagnosed with autism and has known me for many years. Initially, he said that while I do have a lot of autistic traits, I’m probably on just the wrong side of the borderline. We talked about it a bit more and I discussed with him that autism can often be less apparent in women. That seems to have made him come around to the possibility. He doesn’t really accept self-diagnosis, so I don’t think he’d be willing to say I actually am autistic, but he’d probably be willing to say I might as well be. He claims he never saw it in me in all the time we’ve known each other. I pointed out to him that over the years, he’s told me at various times that some comment or other I made sounded very autistic, or that I should get assessed, but when I reminded him of those comments he said that he’d been joking when he said that.\n\nI’ve raised the possibility with a couple of other friends, one of whom thinks he’s probably autistic but isn’t really interested in getting a diagnosis, another who’s doing academic research on autism. Those people at least listened to me without dismissing me outright. They didn’t make a definite judgement about whether I’m autistic or not, as far as I recall, but they at least seemed open to hearing what I was saying. Perhaps I should just remember that at least those people seemed to believe me.\n\nStill, I find it incredibly frustrating, and honestly upsetting, that I’m either utterly unable to communicate my reality to other people, or completely lacking in self-awareness. I’m in tears writing this. Have I got too attached to the autism label? Should I just accept that I’m not really autistic, based on what I’ve been told by people who know me better than I know myself? I never claimed to have every autistic trait to the maximum possible extent. I could easily write a list of autistic traits I don’t relate to, or that I don’t have to the same extent as some other autistic people do. Maybe I wouldn’t qualify for an official autism diagnosis. Fine. Whatever. Yet I know what a profound effect my research into autism has had on me. It’s brought so much old pain to the surface, and while that’s been uncomfortable, it needed to happen. It’s reminded me of so many ways I’ve been made to feel wrong or inadequate, and helped me to start accepting parts of myself I thought for so long were broken. It’s helped me to start allowing myself little bits of joy I’d forgotten or denied myself. I’ve felt half dead for years, and this is starting to make me feel a little more alive again. I’ve been looking for something that would explain my struggles, the ways I feel different, and the ways I’ve felt unable to bring my true self out into the world, as cheesy as that might sound. I don’t know if autism is exactly it, but it’s by far the closest thing I’ve found. If it would be wrong for me to describe myself as autistic, I can at least say that an autism/neurodiversity framework helps me make sense of a lot of things about my life. \n\nIf anyone wants more context, I made [another post](https://reddit.com/r/AutismTranslated/comments/yhl0x9/as_a_blind_person_when_would_it_be_appropriate/)) on this sub about my autistic traits. As I said there, I am also blind and that can cause traits that look like autism. So, maybe I’m confusing blindness things with autistic things. Maybe I’m completely wrong about myself. I just wish more people would be willing to listen, to say things like “I’m surprised you think you’re autistic, because I’ve always seen you as xyz which autistic people usually aren’t. What is it about autism that you see in yourself?” Rather than jumping straight to “you’re not autistic, you’re too..”. That way, they could either listen to me and maybe learn something, or they could correct my faulty self-knowledge. \n\nSo, I don’t know what to make of this. I don’t think it’s that I’m doing an amazingly fantastic job of masking because I’m no good at lying or acting. I do mask in the sense of hiding parts of myself, e.g. although I don’t always manage to suppress my stims in public, when I’m alone I’m constantly stimming in really obvious ways. And although I do talk about my special interests to an extent, (not all of them), inside my head I can get really intense about them in a way that might not be obvious to the outside world, sometimes so much so that the rest of the world feels sort of unreal. So, I can hide parts of myself, but I’m not really capable of acting like a totally different person or pretending to feel something I don’t really feel. \n\nAll the people I’ve talked about in this post are great in so many ways. I’m not at all complaining about terrible people here. I’m just frustrated that I’m either completely wrong or not able to communicate this part of myself, and not sure what to make of it.",
        "created_utc": 1671837089,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your special interests like?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztpjd8/what_are_your_special_interests_like/",
        "text": "\n18 male ( ADHD, suspected ASD ) I can't tell a special interest from a hobby, and it doesn't help me when im trying to find out if im Autistic or not. Idk if I had a special interest in childhood, but I had an obsession of Michael jackson ( Im embarrassed saying this ) I would watch a lot of his concerts, I would dance, dress, ( try ) to sing like him. This lasted for about 6 to 8 years. I also had an obsession on realistic and art in general, I used to draw very well. Then I stopped, that lasted for years as well. I can't draw shit now. Now my obsession is Mass shootings ( for a year and counting ) I create lists around the topic, and everyday visit the Masskillers sub reddit. And maladaptive daydream about them ( I know, weird ). Idk if these are special interests, im confused. Do you relate to this?",
        "created_utc": 1671821370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being a mother and autistic… am I a bad mother or is it the autism?",
        "author": "PL12345678",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztm18s/being_a_mother_and_autistic_am_i_a_bad_mother_or/",
        "text": "This is a really hard post for me. \n\nI never used to like kids. I didn’t know how to act around them and masking (though I didn’t know that’s what it was at the time) to pretend I liked them was EXTREMELY hard. Any and all interactions were noticeably awkward. When I was pregnant with my first, my mom asked me to babysit and I very honestly said “no, I hate kids” and she got very upset by it. \n\nAnyways, once I had my kids (both of them) I connected very deeply with them as babies and toddlers. One is still a baby. I like the baby more. Sometimes I worry I love the baby more, though I feel like that’s not true. I’m not sure if I really do and I’m forcing myself to think that I don’t.\n\nI constantly mask around my older child (10). I feel like absolute shit about it too. If I don’t mask, I know it’ll be very traumatizing for him because I hate unnecessary noise, I hate being touched, and I hate paying attention to things I don’t have any interest in (his type of video games and YT videos). So I pretend a lot. \n\nI’m not sure if I’m a really crappy parent or if this is common. It’s hard to research because this is really taboo for people to talk about, plus if you ever put “kids”, “mother”, and “autism” in the same sentence then it’s always things about the child. I’m wondering if this is the autism and my trouble interacting with kids or if I really am just a terrible mother.",
        "created_utc": 1671813916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Usernames (and the struggle of picking one out)",
        "author": "sparoace",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ztc7am/usernames_and_the_struggle_of_picking_one_out/",
        "text": "Is it common for autistic people to struggle with picking out a username? Please tell me it is because I don't understand how this could just be a me thing.\n\nSigning up on a website or a game is an awful experience because when it asks for a username, that alone usually takes quite a while. I can't come up with a username, and when I finally do, the username is taken 90% of the time. Thanks to this, I have very little accounts that share the same username as an account elsewhere. Again, please tell me if this is something that others struggle with - it would be greatly appreciated.",
        "created_utc": 1671791662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the compliment sandwich actually work?",
        "author": "HereToStayThisTime",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt8ddw/does_the_compliment_sandwich_actually_work/",
        "text": "Do you find it works on you? I feel like I can see right through it and it actually offends me. Just give me the criticism, I don’t need to be told softly. I’m thinking of someone who I’m going to have to have a conversation with about some of their choices affecting an animal. I’m debating how to do this and know my input or criticism have not been well received in the past. Does the sandwiching criticism between compliments actually work for people who are not autistic? I find it doesn’t work on me, and found many of my autistic friends don’t really find it helpful for taking criticism either.",
        "created_utc": 1671776843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between social anxiety with and without co-occurring autism",
        "author": "VibeClub",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt71mi/difference_between_social_anxiety_with_and/",
        "text": "This is a question I’ve been asking for a while, but I’ve always worded it a way that others misunderstood what I was asking.\n\nHow do I tell the difference between social anxiety-induced social differences and autistic social differences? And, how do I tell the difference between allistic social anxiety/masking and autistic social anxiety and/or masking?\n\nI’ve always been told that I “overthink” social situations. But my analysis of social situations doesn’t always correlate with the feeling of fear or thoughts of fear (e.g I might analyze a chance of someone meaning a certain thing with their phrasing but I don’t always use my analysis to consider fears like “what if they don’t like me?”) Over the past half a year I’ve been slowly exploring the idea of reframing my analysis not as a bad thing that needs to be fixed (i.e “too much anxiety”) but rather as the natural way that I fit into this world.\n\nI do experience anxiety when initiating interactions, but after the interaction has begun it’s mostly analysis to figure out what my conversation partner means or what the right thing to say is. I do experience anxiety if it seems that I’ve said something that is inappropriate in one way or another, but the analysis can definitely exist without the anxiety or without any thoughts (as opposed to feelings) of fear.\n\nI don’t know for sure if I’m autistic yet, but I definitely do feel disconnected and distant in many social situations. I just don’t know if that feeling is due to anxiety, or autism, or both. \n\nWhen answering, please try to focus on the questions themselves more than my experiences, because I can’t really fully describe my experiences 1. in such a short paragraph and 2. in a really fluent way, because I’m often not very good at communicating myself.\n\nI’ll reiterate the questions: How do I tell the difference between social anxiety-induced social differences and autistic social differences? And, how do I tell the difference between allistic social anxiety/masking and autistic social anxiety and/or masking?\n\nThank you in advance.",
        "created_utc": 1671772095,
        "upvote_ratio": 1.0
    },
    {
        "title": "sometimes I speak and people don't answer",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt67m9/sometimes_i_speak_and_people_dont_answer/",
        "text": "Basically what the title says. Sometimes I feel I talk in a frequency human ears cannot listen. I'd be home and ask/say anything that requires a response and no one answers back. Sometimes I think they didn't hear me, so I repeat it in a louder voice. Still nothing. Sometimes I think they're too into doing whatever they're doing, but 2 seconds later my sister asks anything and she gets a response and no one acknowledges I even spoke right before her.\n\nI know they're not ignored me because they wouldn't do that. Is the problem my voice? My tone? How I'm saying it? The words I'm using?\n\nIs this even related to autism? Can any of you relate or has my family just toned my out?",
        "created_utc": 1671769266,
        "upvote_ratio": 1.0
    },
    {
        "title": "fainting",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt63fd/fainting/",
        "text": "I think I faint a lot more frequently than the normal person. It started when I was 12, so right around puberty (I don't know if this has anything to do), and ever since then I've been fainting many times a year.\n\nIt's usually after I've been standing for quite a while. And I don't mean hours, I've fainted after being standing for only about 10-15 minutes. It doesn't matter if it's cold, hot, if I've eaten, if I've drunk, it happens regardless of these things. It's happen to me so many times that I can now tell when it's going to happen, so I take steps to make sure I don't actually faint, so I haven't fainted in quite a while now but I have experienced the dizziness and tunnel vision (even lost my vision) of the process.\n\nI've also fainted due to blood loss. It happened while getting blood drawn and when I got my wisdom teeth taken out (I did not faint at the sight of blood). In neither case I was scared or worried or anything. \n\nI have very poor circulation to the point where my feet get extremely cold and my legs turn red/purple when standing up. \n\nIt used to be a problem for me because I used to take the bus to go to uni every day and I would have to either get off at random stops or basically just collapse into a chair. Both of these were unsafe since I was travelling alone and I ended up in a very vulnerable stage. After COVID, my school pretty much stuck to online classes so I don't really use the bus anymore. \n\nDoes anyone else here relate? Do you have any tips? Is it related to sensory issues?",
        "created_utc": 1671768886,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find out if an idea/feeling has a name?",
        "author": "spacefacecadet",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt637x/how_to_find_out_if_an_ideafeeling_has_a_name/",
        "text": "It seems like that's supposed to be the point of the sub, right? But at a glance I don't see any questions like exactly what I'm thinking of. \n\nFor example I spend a lot of time struggling to find things like shoes and clothes that I want, but can't describe why I like what I do or even what it is. Same with things like flavors, music, movies. I've always assumed it was probably something arbitrary that only I notice, but now I'm not so sure. Several of my family members have this problem too, it's funny how similar it is.\n\nFor an extremely specific example: I hate \"pickles\" (American style pickled cucumbers for sandwiches,) but actually like a lot of pickled things. The biggest difference in flavor (I think??) is the presence of the dill, which I do dislike, but not nearly as much as I dislike \"pickles.\" Are there other differences, or is it maybe an unfounded aversion?\n\nOne more: I want to find winter boots with the combination of vibe/aesthetic and function that i like, but don't know how to call it. Something non-normie but also well made? How do I find if there's a name for the type of look I'm imagining? i can't put words to the attributes, but can say if something isn't right and KIND OF say why.\n\nTl;dr\n\n how do you start finding if there are words for the things you experience? Is it possible to find ways to talk about stuff you're not able to explain to anyone?",
        "created_utc": 1671768866,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a special interests like for you?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt5ey1/what_is_a_special_interests_like_for_you/",
        "text": "18 male ( ADHD, suspected ASD ) I can't tell a special interest from a hobby, and it doesn't help me when im trying to find out if im Autistic or not. Idk if I had a special interest in childhood, but I had an obsession of Michael jackson ( Im embarrassed saying this ) I would watch a lot of his concerts, I would dance, dress, ( try ) to sing like him. This lasted for about 6 to 8 years. Now my obsession is Mass shootings ( for a year and counting ) I create lists around the topic, and everyday visit the Masskillers sub reddit. And maladaptive daydream about them ( I know, weird ). Idk if these are special interests, im confused. Do you relate to this?",
        "created_utc": 1671766693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this happened to you?",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt4aaz/does_this_happened_to_you/",
        "text": "I remember that i was a \"weird\" kid (5-6 yrs old), i was loud, energetic, but in a strange way, i could change emotions pretty easily, i had a big imagination and i always created fictional wolrds and characters, i remember i went to dance classes as a kid and i didn't do anything the teacher said cause i was playing and distracted all the time, i also remember once in school i droped to the floor to read a book, i was there, lying on the ground and i couldn't understand why everyone reacted so surprised, my mother had take me to a psychologist cause she thought i could have had autism or maturational delay, but the psychologist told her i was just immature, that i needed to grow up, so my mother always told me i was too childish, when i was around 8 yrs old i didn't act like other children, i was calm most of the time, my family told me i speaked like an adult and acted like one, i was very sincere and said hurtful things but i didn't realized i was harming people saying it.\n\nThere were a lot of things i couldn't understand about social things, i still don't quite understand some of them, like once my grandma told me that she was with her friend seeing stores and she saw a dress she liked a lot but couldn't afford it, so the next weekend she goes to her friend's house and sees the dress she liked in her room, my grndma told me she felt it like a treason from one of her most loved friends and my mother said she did that because she was jealous of my grandma and i didn't understand what they said, like i can't feel it like treason or anything.\nI'm sorry this is all over the place, i'm not quite organized, so, do you think this could be me being autistic without anyone realizing it?",
        "created_utc": 1671763075,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obsessively pausing and unpausing videos",
        "author": "Mind_Fire",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zt0a2a/obsessively_pausing_and_unpausing_videos/",
        "text": "My daughter constantly hits the pause button on whatever she’s watching. Also watches the same thing over and over again. Does anyone on here have an insight on why ? Please answer according to your comfort level and thank you !",
        "created_utc": 1671751591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else (not in a special ed program) sent to take standardized tests with special ed kids in elementary school?",
        "author": "Megav16",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zswv3t/anyone_else_not_in_a_special_ed_program_sent_to/",
        "text": "So a funny memory that I have was back in elementary school, 6th grade specifically, was how I would always get sent to the special ed classroom to take my standardized testing. \n\nI didn’t have a diagnosis or anything as a kid, and I wasn’t in any special program or have any type of accommodations. I guess my teacher just didn’t want to have to stand over my shoulder the whole time and tell me line by line to keep going on my exams lol. \n\nDid anyone else experience similar situations?",
        "created_utc": 1671743204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to get the best/most accurate diagnostic evaluation? Recommended providers in the US?",
        "author": "Brittystrayslow",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zsuu63/where_to_get_the_bestmost_accurate_diagnostic/",
        "text": "I guess I’m just trying to figure out where to get evaluated for autism as an adult, but it’s not that simple because I’m picky. \n\nFor context, I’m 26, cis, afab, and live in the Midwest. I’m looking for a more comprehensive evaluation that can assist with differential diagnosis, rather than autism alone. I was diagnosed with adhd when I was 18. I’ve been in therapy on and off for the last 8 years for symptoms of anxiety/depression. I’ve had the same wonderful psychologist for 2 years that I see biweekly for the mood-related stuff. I brought up autism about a year ago, we let it go for a while, but she recently brought it up again when I was describing alexithymia. Since then, I’ve been obsessively researching, taking self-assessments, and we are reading Unmasking Autism together (well, I finished it already, but I’m reading all of the articles cited in the appendix).\n\nI’m honestly 50/50 about whether I’m autistic, and while my therapist is a clinical psychologist, autism is not her specialty. She sent me some referral options, but Idk…  I’m a school psychologist, which I use as an excuse to be extremely particular about the mental health providers I trust. Being a school psych also means that I probably use or am familiar with a lot of the assessments that a typical diagnostician might use for this kind of evaluation, which I think will interfere with the validity of the results. I’m very scared of accidentally “tricking” the evaluator into misdiagnosing me one way or another. I honestly don’t care about whether I get the autism diagnosis or not, I just want to be super confident in the accuracy of whatever determination is made. \n\nAll of that to say… do you have any recommendations? Is there a *gold standard* that I should look for in potential evaluators? Do you know of a provider experienced in cases “like mine”? I will literally consider trekking across the U.S. for someone reputable enough… \n\nThanks for reading ❤️ any other thoughts/ideas are appreciated as well",
        "created_utc": 1671737994,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Why do you always answer so sharp?!”",
        "author": "itsrainingbluekiwis",
        "url": "/r/AutisticWithADHD/comments/zstlmh/why_do_you_always_answer_so_sharp/",
        "text": "",
        "created_utc": 1671734910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big picture thinking vs detail oriented (humanizing weak central coherence theory) - ?",
        "author": "TypicalAppointment",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zstb0g/big_picture_thinking_vs_detail_oriented/",
        "text": "# How can you tell which you default to? \n\n1. I'm mesmerized by concepts defined as systems; ecology, bus routes, gender, economics. I can draw parallels between concepts other people don't think of immediately; which might be a sign of system thinking orientation? \n2. *However, when I'm cleaning, for example, I become bothered by the discoloration of my white walls or small objects being out of place. I can't surmise whether my house looks neat/clean or not because I'm so distracted by each detail. Similarly, I have trouble wrapping up the final elements of a project, sometimes this \"finalization\" can take longer than the project itself. I also can't clearly define or understand my gender because despite gender dysphoria and nonconformity, I have trouble summarizing what my gender identity is. (Mildly comical to me because I transitioned 7+ years ago now...!)*   \n\n\nWhat are some signs / behaviors you have noticed within yourself or others as it relates (to weak central coherence theory)?",
        "created_utc": 1671734105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you walk on your toes as a child? Do you still do it now? Why did you do it then and why do you do it now?",
        "author": "phel-phel",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zsqsis/did_you_walk_on_your_toes_as_a_child_do_you_still/",
        "text": "I found out that my step-mother had suspected autism for me when I was younger (my dad married her when I was 13/14) because 1. she suspected it in my dad, and 2. because I walked on my toes. I always have, for as long as I can remember, and still do to this day (I’m 36f), though not as often, mostly when I’m barefoot, or it’s just not as obvious, or nobody says anything anymore. \n\nI read that doing this can create gait and posture problems and I have always been slightly pigeon toed, but it hasn’t affected my mobility in the least, at least not that I can tell. But I also read that toe walking has been linked to autism. So I’m taking a survey. \n\nIf you do or did toe walk, do you remember why?   \n\nI have vague memories of not liking things digging into my heels and I wanted to reduce the risk of stepping on something sharp. But I was also obsessed with ballet and gymnastics. Nobody bothered to address it when I was growing up, so I never “phased out” of it. \n\nIf I’m completely off the mark, then please, kindly correct me.",
        "created_utc": 1671728055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Anyone Else half talk to themselves?",
        "author": "AnonimouseTransFtm",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zsqht3/does_anyone_else_half_talk_to_themselves/",
        "text": "Basically this post is the title explained. When I'm doing anything really sometimes I'll let my thoughts slip out of my mouth. It will be really quiet and sort of mumbly, you can only really make out \"s\" sounds but it's like I'm talking just without putting any breath into it. \nI was wondering if anyone else does this or if this is me sort of practicing talking? Also other people have noticed this and I don't know wether to stop or not but I mostly do it alone.",
        "created_utc": 1671727289,
        "upvote_ratio": 1.0
    },
    {
        "title": "CALLING ALL FELLOW AUTISTIC LATINOS",
        "author": "Ok-Pineapple3768",
        "url": "https://youtu.be/GmiwFEG5erg",
        "text": "",
        "created_utc": 1671722575,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone else…",
        "author": "Latter-Meringue-7661",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zsnf0j/does_anyone_else/",
        "text": "sometimes when someone comes to me with a problem, my face gives it away, like when im not interested in the conversation. most of the time i have this thought that nobody can see my expression other than me. for example my tone sounds angry when i thought it doesnt, when i am actually feeling angry. it’s like i can’t hide my emotion/facial expression even though i really want to. for example when im annoyed i roll my eyes a lot when i thought i was subtle and that the other person was oblivious to my true thoughts/feelings but it turns out they werent, and i get called rude a lot for that and that im really insensitive.",
        "created_utc": 1671719496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being unwell",
        "author": "jonathing",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zsmv9a/being_unwell/",
        "text": "I currently have a dreadful cough, sore throat, chills, etc. My wife is trying to convince me to come home from work and get some antibiotics. However the very core of my being is telling me that the safest thing to do is to keep on keeping on and maintain normal operating procedure. If it were anyone else I'd be sending them home but it's ok for them, they can do wild things like change their routine at will. This is that autism thing isn't it?\n\nPs. It's not COVID, I did a test",
        "created_utc": 1671717990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sign of autism or no?",
        "author": "The9thElement",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zscehb/sign_of_autism_or_no/",
        "text": "I don’t like seeing people outside of settings where they’re meant to be; for example, I don’t like seeing my teachers outside of class, I don’t like seeing my classmates outside of school, and I don’t like seeing my family members at school. (School and home are really the main settings in my life right now)\n\nI even avoid getting a job because I might see my classmates there, I avoid greeting my teachers outside of class and act like I don’t know them even if I get along with those people because it makes me feel weird\n\nNot that I hate them because of it, I still like and love those people the same, but I don’t like that because it feels weird and disconcerting to see people outside of the setting where they “belong” in my life if you get the point? Is it a sign of autism or am I just a strange person",
        "created_utc": 1671684065,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found some sensory-friendly professional-looking collared shirts made of knit cotton!! they're on sale right now!!!",
        "author": "crycrycryvic",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zs8ta3/i_found_some_sensoryfriendly_professionallooking/",
        "text": " hello!\n\nI promise i am not a corporate shill, and defs not being paid to advertise this, BUT\n\nI'm  gearing up to go on what's probably going to be an extended job hunt  (trying to switch fields), and \"professional\"-looking clothes are the  bane of my existence. It sucks to have to choose between \"looking  professional\" and \"being able to perform well because I am not being  slowly driven insane by my gd friggin shirt\", especially in a job  interview context!\n\nHOWEVER, this will no longer be a problem for me, becaaaause...\n\nI  found a company that sells long-sleeve collared shirts made of knit  cotton fabric, with a roomy collar! They call them \"shirtees\"??\n\nThey're  still not ideal for me (sleeves are annoying in any capacity, so I  still have to roll mine up), but they're a heck of a lot better than  anything else i've found. And they're having a huge pre-boxing day  sale!! 60% off!!\n\nhere u go: [https://peaudeloup.ca/collections/long-sleeve-shirtees](https://peaudeloup.ca/collections/long-sleeve-shirtees)\n\np.s.:  also they specialize in gender-neutral clothing : ) they started as a  shop for butch lesbians and slooowly transitioned (hehe) into serving  transmasc and non-binary folks!\n\nHope this helps someone!!",
        "created_utc": 1671674371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do neurutypical family members alienate us",
        "author": "BebeBleues",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zs8rbo/why_do_neurutypical_family_members_alienate_us/",
        "text": "I've noticed this with my family and almost all of my autistic friends.  \n\nFamily members are reluctant to invite us to things (it's kind of obligation only ). And when we come they won't include us in conversation,  talk over us.  Pretend we're not there or just walk away. \n\nEveryone in my friend group is kind and empathic and each one of have people  who are incredibly important to us in life. \n\nBut each person in my friend group have several to dozen of family members who just insist on treating them like they don't belong.\n\nI don't know where this toxic behavior comes from I really don't.",
        "created_utc": 1671674222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is always feeling too hot or too cold an autism sensory issue?",
        "author": "UnexpectedlyAutistic",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zs5dit/is_always_feeling_too_hot_or_too_cold_an_autism/",
        "text": "I have poor circulation (along with orthostatic intolerance and possibly POTS), and my hands and feet tend to get really cold in the winter.  But I also have issues all year where my entire body feels either too hot or too cold, and I find it very hard to stay at a comfortable temperature without having to constantly adjust the thermostat and switch clothing.\n\nIs not being able to maintain a comfortable body temperature an autism sensory issue?  Or are my struggles with that just due to my poor circulation?\n\nDoes anyone else feel too hot or too cold most of the time?",
        "created_utc": 1671665849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me decode \"Well, I just wanted to...\" at the end of the conversation.",
        "author": "Terrible-Trust-5578",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zrydco/help_me_decode_well_i_just_wanted_to_at_the_end/",
        "text": "That title probably made no sense, but let me give one example of something that happens a lot. \n\nMy admissions counselor called and asked to check in regarding my classes.  So we talked about my classes for a few minutes.  \n\nWhen the conversation started to die down, she said, \"Well, I just wanted to check in about your classes.\"\n\n.....\n\nDoes that mean she felt I was going off topic and wanted to make the conversation more specific?\n\nOr was she stating the objective of the conversation had been achieved and that she would therefore like to terminate it?\n\nOr was she feeling insecure, thinking I was expecting her to bring on the next topic when she had nothing?",
        "created_utc": 1671651140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does “partner” really imply the couple is not straight?",
        "author": "Aquarius265",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zrriv4/does_partner_really_imply_the_couple_is_not/",
        "text": "Overall, I like to refer to people in a relationship as partners… then it doesn’t matter if they are dating, engaged, long-term-but-totally-not-getting-married, or married. \n\nNot every time, but often enough, I find that (straight) people are taking this to be that I am implying those involved are not straight. Is this something unique to me struggling with or why isn’t that just the easiest way to indicate that people are together? It even works in a dedicated poly situation…",
        "created_utc": 1671637739,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with debates?",
        "author": "Alternative-Share68",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zrideb/how_do_you_deal_with_debates/",
        "text": "I self diagnosed as autistic and ever since then I realized I’m having so many problems with debates. I get very upset and frustrated when someone is weakening my arguments and I need a lot of time responding to their argument. That’s why I hate debates in real life because on the phone I have enough time to think. But even then I’m having a very hard time. For example today I had a debate with my friends about age gaps and how I think a big age gap is weird even if the younger person is over 18 (or 21 depending on your country) and it’s only okay when both people are let’s say 50+ and they have an age gap of 15 years or so. And they kept using examples from other topics why it isn’t weird or why the younger person is still accountable and it’s not only the older persons fault and it was very frustrating. I also realized often times I just agree to things because I don’t know what to say anymore and because I’m scared of the debate getting too intense. And most of the times I don’t even understand the other examples. And then a few days later I have like a really good argument in mind but then it’s too late. I don’t understand how everyone around seems to have no problems with debates and just shoots argument after argument at me (not in a mean way it just feels a lot) and I always stand there feeling like I don’t know anything about this world. I mean it’s like I know exactly what is wrong and why it’s wrong but I just can’t talk like other people. I want to change it but I don’t know how. How are debates for you? Would love to talk about this. The conversation was only half an our maybe but I feel so drained it feels like I can’t do anything anymore today.",
        "created_utc": 1671623488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding m autism",
        "author": "AbroadSome9708",
        "url": "https://www.youtube.com/watch?v=2OrFJHYstwc",
        "text": "",
        "created_utc": 1671622737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good places to get assessed in the UK? (Hertfordshire / London)",
        "author": "Potential-Click-364",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zrgxts/good_places_to_get_assessed_in_the_uk/",
        "text": "I’ve been trying to get an autism assessment, and I find the process a bit confusing and scary. I managed to get a referral for an autism assessment from my GP and I got sent a message from a specific clinic about making an appointment, and was also made aware of my right to choose an other clinic. I’m really scared that I will be dismissed, as I don’t want to involve my parents, I’ve been dismissed in the past, I can mask pretty decently I think, I am afab (nb), and from the outside I’m doing pretty ok as I am going to uni full time and have a job. So I wanted to make sure that I choose a good place, but I’m not really sure how to check that. I am currently in Hertfordshire, (Hearts) and wouldn’t mind traveling to London or somewhere with a similar distance, as I’ve been wanting to get assessed for really long and it’s something I really want. The place I was contacted by is potterells medical centre. I would love to know if anyone has had an experience with that place specifically, or in the general that area I mentioned previously, or any recommendations for other places",
        "created_utc": 1671619985,
        "upvote_ratio": 1.0
    },
    {
        "title": "“I miss you!”",
        "author": "Rcphotoguard",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zrbfz9/i_miss_you/",
        "text": "For those of you who, like myself, do not miss close family members when you are not physically with them: does it make you feel uncomfortable when they say “I miss you” and expect an obligatory “I miss you too” response? To me it feels dishonest and makes me feel fake.",
        "created_utc": 1671600623,
        "upvote_ratio": 1.0
    },
    {
        "title": "you're all lovely",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zraxru/youre_all_lovely/",
        "text": "I've been on this sub for quite a while now and I wanted to thank each and every single one of you.\n\nYou're all amazing, seriously. Don't ever let anyone tell you you're rude, or unsympathetic, or cold because none of you are. This sub has shown be extreme support, understanding, kindness and compassion. There's always the \"I understand\" comment, the \"I wish it turns out well\" or \"good luck\" comment. Even when I was wrong, I was never insulted. I was shown the right way in the most sincere and honest way possible. When I was right, I was celebrated. \n\nI understand the world out there can be challenging and difficult and things may never come out as you wanted them to, but just know you're good inside. You've shown me. I've never met more kind people in Reddit. Thank you.",
        "created_utc": 1671599047,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you feel about the terms low and high functioning",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zra93p/how_do_you_feel_about_the_terms_low_and_high/",
        "text": "I understand why they are controversial, but if we were to use those terms, I would be on the high functioning side of the spectrum. \n\nI know many people don't like those terms but I feel we should make some sort of distinction. I see autistic people online and they struggle a thousand times more than me. Some will never be able to speak or be independent or be in a relationship or form a family. I know I'm able to do all of that and more if I wanted to. I do struggle, of course, but it's nowhere near as much. I'd feel ashamed if I had to meet one of those people and tell them to their face we struggle the same. Because the truth is, we don't. \n\nI honestly could have gone the rest of my life without assistance, coping mechanisms or even suspecting I was autistic. It would not be ideal or the best thing but I was going to be fine in the long run. \n\nMaybe the terms high and low functioning are not the best to describe this, but a distinction maybe is needed. I know all autistics are disabled and they all struggle, but there is a reality we can't ignore",
        "created_utc": 1671596929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's the not really anticipated part 2! I couldn't really find much stuff on how to know if you're neurotypical so I mostly wrote whatever came to mind instead of researching. It was mostly made as a joke tbh but there are valid points on it too. Tried to be as unbiased as possible probably?",
        "author": "aaaaaaaaaahhshshs",
        "url": "https://i.redd.it/6iovrl8jf67a1.jpg",
        "text": "",
        "created_utc": 1671595976,
        "upvote_ratio": 1.0
    },
    {
        "title": "In case I had any doubts that I'm autistic...",
        "author": "ceret239",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zr88zt/in_case_i_had_any_doubts_that_im_autistic/",
        "text": "I joined Reddit nine days ago after stumbling across a post on autism during a Google search, and it is my new obsession (along with Squishmallows, which are awesome, BTW). Reminds me of something my naturopath once said to me when I was first wondering if I was autistic, but wasn't sure if I'd ever be able to distinguish between autism and C-PTSD - that lots of her clients have PTSD, but almost none of them wonder if they're autistic. As others have said in this sub, I feel like obsessing about it is its own sign.\n\nhttps://preview.redd.it/24xyy9yl067a1.png?width=696&amp;format=png&amp;auto=webp&amp;s=31759d392d472f3ff6a0f977151064fea55312d7",
        "created_utc": 1671591128,
        "upvote_ratio": 1.0
    },
    {
        "title": "im pretty sure i have autism but its confusing",
        "author": "luvtye",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zr6fl9/im_pretty_sure_i_have_autism_but_its_confusing/",
        "text": "So a while back i did a ton of researching and quizzing and stuff and based on childhood experiences and behaviours that have continued throughout my life i discovered that autism best describes me so i self diagnosed. \nThe issue is sometimes i feel like i have to act stereotypically autistic for my family to believe me, that not always the case, most of the time im my ‘normal self’. I just feel like i dont seem as ‘stereotypically autistic’ as others might do and that might make it difficult to get diagnosed. Maybe it’s because i have masked my whole life, sometimes i unmask and i notice my natural behaviour  when i unmask and it makes me feel valid in a way and then i mask again and i “forget” that i may have autism? I dont know if this sound offensive or if anyone will understand what i mean but sometimes i feel like im faking it (im not) im just really high functioning and that makes me feel like im not autistic enough yk? Sorry if this offends anyone i just wanna see if anyone feels the same way",
        "created_utc": 1671586149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autism and sensory issues",
        "author": "the_eggtastic_egg",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zr5wsz/autism_and_sensory_issues/",
        "text": "TL;Dr: I am struggling to understand my own sensory needs and need help figuring it out so I can access the right supports for them.\n\nThis might be a bit long so sorry in advance but recently I realised that I may be autistic and have been trying to process it. However, I'm really struggling to understand how my senses work and which parts of it are as a result of me being autistic. I really need help figuring/sorting through them because its hard to say what's a common (and neurotypical) experience and what is not. I think I am also synesthetic so it has only added to my confusion. \n\n(Also sorry, I am bad at words and tone so will use emojies and tags occasionally).\n\n1- I know that I have hyper-empathy, I've more or less known it as a child. I also feel emotions so incredibly intensely it is both amazing and horrible. Fear feels like getting a heart attack, sadness physically hurts so much but joy, excitement and love all feel so incredible and powerful. Even overwhelming sometimes 😅\n\n2- I know that my sense of touch and smell are very sensitive. I will expand more below (5, 6 and 7).\n\n3- I love bright lights (eventhough my eyes do not 😅) and vivid colours feel amazing to look at. However, my mum has told me that as a child I couldnt sleep if any lights were on and it is still the case today, even fairly dim lights. Ideally I need complete darkness or I can \"see\" them hit my eye lids.\n\n4- I can hear long range really well but struggle to hear short range. I can hear the entire house unless I put on my headphones and music and growing up, I could hear my mum in the kitchen asking someone to call me downstairs all the way from my room. But I still struggle to hear how loud my voice is and what someone next to me is saying especially if its noisy further away.\n\n5- My sense of smell is fairly keen and strong. I can smell other people's scent if they're about less than or 1 meter away (although with other smells, I can pick up as I am moving). A lot of smells are overwhelming for me too except for my own scent (I am used to it so it feels nice and helps me stim). However, I know that as a child, I would stim by smelling a particular object id wear around my neck at all times. Whenever I was stressed I would smell it to calm me down, my parents remember be doing this until I was around 6 or 7 apparently. I still kind of do it now but with my hoodies which im either wearing or have near me.\n\n6- My sense of touch is incredibly sensitive (except in some areas like my fingers which are used to touch on a daily basis). I can't have people close to me because i can feel them on my skin (explained in 7a and 7b) and become uncomfortable when touched (with a few exceptions of less than 5 people in my life). I have some textures I really like and I stim using my small magnet pair object item thing (I do not know what they are called 😅) as well as cuddling a specific object I designate as the \"thing i cuddle when stressed\". As a child it was a specific teddy bear I would take everywhere and now it's my hoodie which I need to cuddle to even fall asleep (a bit embarrassed about this one 😭).\n\n7a- This one is a doozy so I will break it down. My brain works through feelings (different to emotions which to me are specific feelings and 'states' my body exists on in response to stimuli). Everything has a feeling, every concept I can 'think', I must be able to feel. If I cannot feel it, I cannot think it in thoughtform even. Everything has a unique feeling too which describes that specific thing. So like 0 has a specific feeling to it. And so does the colour white. They feel similar (but not the same) so in my brain, the number 0 is white eventhough logically it should be black (in terms of HSV colour stuff). 1 is black for the same reason. Other numbers do not \"have\" colours associated with them as no colours feel similar. 0 isnt actually white for me. Its just 0. But it feels very similar to white, so I imagine it as white in my mind's eye. Same for 1.\n\n7b- As stated, everything (including concepts) has a unique feeling that describes it. This is sort of like a language spoken by my body to my body. But I've noticed (this is geniunely pseudoscience of someone trying to understand themselves better so I am sorry if this sounds nonsensical) that I can break down almost every feeling to two components: presence and essence. The presence describes its physical properties (e.g. shape, font, letters being used and how they are shaped) and essence describes the vibe of the thing and what it consist of (e.g. the day Wednesday has the same presence as Wednesday Adam's first name but different essence as one is a day and the other a name). I typically feel presence on my skin and outer parts of my body whereas I feel essence inside my body (typically the brain or my chest). So for example, if a box of toy were next to my right leg, I would feel its presence: physical proximity on the parts of my leg facing it, and its shape on the outside of my head/face. I would feel the essence (what the box itself consits of and the general content of the box) in my brain or chest (inside the chest, in the centre). Presence feels fairly simple as it describes simple physical information of whatever im focusing on but essence is usually a very complex and sometimes overwhelming feeling with several layers.\n\n7c- This is where it gets more confusing. Some things do not have a presence or essence but they will at least have one (otherwise I cannot think it or understand it, only forcefully store it in memory which is really draining). So ideas like shapes have only a presence. Completely abstract ideas do not really have a presence or really weak ones (as I feel the 'shape' of the letters the word for that idea consist of but they are different things to me). But presence and essence arent necessarily separate \"feelings\" per say. It's like how when you are scared you might feel various things in various parts of your body as a singular experience with all its component feelings united. So 0 feels like white to me because their essence feels similar. Their presence are different. White is a colour and has no presence (the concept of the colour white, not the word, these are separate). Specific things for presence tend to be felt in specific parts of my body too. I feel most presence on my face or head but words are usually felt on my tounge as pressure but like an illusion of it.\n\n7d- If I have not lost everyone reading this, I might now because this is where I am confused myself too. I can feel things on other people and things too (as well as myself). It is partially synesthesia (mirror touch). But if say someone were to touch a metal surface I would feel the pressure, the smooth texture of the metal as well as its coldness on their fingertips (fairly strongly) and faintly on my fingertips. If I focus on two people hug, I can feel the hug on both of these people. It works like tactile senses on my own body...except its on someone else's body. I sometimes feel this on items too as though they had the capacity to feel like I did. Its almost like a \"feeling-map\" (like a heatmap but feelings instead of temperature).\n\n8- Taste is arguably my most neurotypical sense. I like tasty food and will eat almost anything. I sometimes stim by eating varying flavours e.g. eating rich with like 3 different curries mixing all at once or adding random seasoning to things to vary the flavour. I struggle eating really sweet things but nothing significant. I also love the feeling of certain food textures in my mouth (like raw meat 💀😅)\n\n9- Senses like my sense of balance and proprioception are ok I guess but I am very clumsy and trip over my own feet, bump into things and cannot actually walk in a straight line 💀 I thought that might be worth mentioning, I don't know 😅\n\n10- This is not a sense but I have a very strong and very, very vivid imagination. I can see fairly clearly in my mind's eye as well as make myself hear things. I can induce feelings (see 7) in a similar way too but nowhere near as well or vivid. I can, if I focus, make myself feel things on my skin too (i.e. tactile sense) so like feeling the texture of metal on my fingertips. I can also like \"touch\" something with my 'mind's hands' and feel textures on it like I stated in 7d.\n\nTo conclude my VERY long post, I am really struggling to understand which parts are autism, which parts are synesthesia (not this subreddit's topic but I feel it's a factor worth considering for) and what is neurotypical and 'normal'. Especially with 7. I get the feeling that I am not using the right set of words here but I am hoping it conveys my question well enough still.\n\nAt the end of the day, 7 is the one I am confused about the most. I've spent 2 decades struggling to understand it and whether if other people experience the world in the same way. I feel as though I process the world VERY differently and as a result am forced to exist in a world not designed for me but this particular one is what makes me question my own sanity sometimes.\n\nI am so deeply connected to the world around me and get such a wonderfully rich experience as a result. To me, music might as well be drugs. And being able to think with my entire body in pure feelings (I call it feeling-form) is wonderful. But it also means that so MANY things are overwhelming for me and I struggle to communicate ideas to people because I either don't know the word for it or it does not exist. As a result, I am now in a situation where I don't even know how to ask for help. I struggle through life every single day and I don't even know how to say what's wrong. I already get support from my university for some other things so being able to understand how my own senses actually work means that I can make sure I (and even the university in some cases can help me) accommodate for it all.\n\nP.S Sorry if this all sounded like nonsense, I promise I did not intend for it to 😅",
        "created_utc": 1671584772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can masked autism traits reemerge!?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zr50t1/can_masked_autism_traits_reemerge/",
        "text": "\n18 male ( ADHD, Suspect ASD ) during my childhood I was social with mainly friends and family I was quiet or didn't answer to unknown family members. I had an obsession with Michael Jackson I would dress like him and dancing like him. I had this obsession for years. ( kinda embarrassed ). I had only friends but sometimes I didn't know what to talk about. In middle school I think I gain social anxiety, but I had social problems before that. Fast Forward, So around summer 2020 ( pandemic ) my life was like a turd slowly dropping into a toilet. I dropped out of school ( Energy taxing, Overwhelming work, social problems, boring shit ) and my family started pressuring me about it. Everyday it was that. I started doing routines and ritualistic things ( counting turns on doorknobs, sleeping routine, stopping microwave at a certain number, eating routine, favorite spoon to eat with ) and my social problems worsened, and I started noticing the possibility of me being on the spectrum. Do you guys relate to this? And could stress cause autism traits to worsen or unmask?",
        "created_utc": 1671582942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling the imposter syndrome rn, do you guys think gifted, autistic or both? As a side note, I don't know if I have(?) echolalia, I don't repeat words and sounds out loud but I do have a habit of repeating certain noises over and over again in my head, as well as images.",
        "author": "aaaaaaaaaahhshshs",
        "url": "https://i.redd.it/ocg5qwwob57a1.jpg",
        "text": "",
        "created_utc": 1671582577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brushing teeth",
        "author": "Rcphotoguard",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zr41r0/brushing_teeth/",
        "text": "Tw: personal hygiene\n*\n*\n*\n*\n*\n*\n*\n*\n Does anyone else struggle with brushing teeth? I hate it and usually don’t do it because of the sensory issues. I hate the way my teeth feel too rough and sharp against my tongue when they are clean. I also hate the taste of tooth paste and the way the flavor stays in your mouth afterwards and makes everything taste weird. Food is a sensory stim for me and having the flavors altered by the taste of toothpaste makes me mad. My teeth are also highly sensitive to cold liquids (probably from crunching ice constantly when I was young) and when my teeth are clean it is 10x worse. I’ve used sensodyn with limited results and find just not bridging to be more effective.",
        "created_utc": 1671580903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can masked autism traits reemerge?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zr3zem/can_masked_autism_traits_reemerge/",
        "text": "18 male ( ADHD, Suspect ASD ) during my childhood I was social with mainly friends and family I was quiet or didn't answer to unknown family members. I had an obsession with Michael Jackson I would dress like him and dancing like him. I had this obsession for years. ( kinda embarrassed ). I had only friends but sometimes I didn't know what to talk about. In middle school I think I gain social anxiety, but I had social problems before that. Fast Forward, So around summer 2020 ( pandemic ) my life was like a turd slowly dropping into a toilet. I dropped out of school ( Energy taxing, Overwhelming work, social problems, boring shit ) and my family started pressuring me about it. Everyday it was that. I started doing routines and ritualistic things ( counting turns on doorknobs, sleeping routine, stopping microwave at a certain number, eating routine, favorite spoon to eat with ) and my social problems worsened, and I started noticing the possibility of me being on the spectrum. Do you guys relate to this? And could stress cause autism traits to worsen or unmask?",
        "created_utc": 1671580766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth it to get a diagnosis if my symptoms were mostly present during childhood?",
        "author": "HLH_Sickosaurus",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqxljc/is_it_worth_it_to_get_a_diagnosis_if_my_symptoms/",
        "text": "**TW:** discussion of suicidality.\n\n***TL;DR:*** *I had very obvious symptoms during childhood but they don't seem to present as much difficulty now asides from emotional sensitivity, which could be attributed to something else, and I don't know if that would make it worth it to go through a diagnostic process knowing it's mostly oriented to accommodating medium or severe disability.*\n\nI've become a lot more confident in the idea that I might be autistic after asking other people about it and having things come up that I didn't remember at all or didn't think I did as often. These are things like tip-toe walking (enough for someone to recommend my parents to take me to a doctor for it), sitting in the dark for no reason, organizing and lining up miscellaneous objects like raw noodles, refusing to wear certain clothes or remaining upset when going somewhere while being forced to wear them, doing things over and over- all things that, if they had been noticed and connected, would have made a very obvious presentation of autism.\n\nHowever I don't feel like I struggle much with anything nowadays, and any possible symptoms appear to be mild or have little impact: apparent special interests switch within months and don't seem consuming enough to make me not talk about anything else, social difficulties can be worked around enough for me to have multiple groups of friends and be relatively talkative in those circles, sensory sensitivities and routines barely seem to be present or generate a response at all. Most of the time when I get seriously upset it's due to an emotional rather than sensory response, or because of a situation that could also be explained by something like social anxiety (not that I've been diagnosed with it or anything else really, but I have to keep other possibilities in mind). However these can be very severe reactions to minimally disruptive situations- things like considering suicide when getting stuck in a college assignment and not knowing how I'm expected to solve an instruction, or when having to carry some kind of legal or formal procedure involving forms and official papers and social interactions I'm not familiar with. So I end up feeling like I'm just generally sensitive and overreactive, which again may not necessarily be an autism thing and have more to do with anxiety.\n\nI asked a therapist I already knew (the best one I had had and the one I spent most time with, yet not great still) if my symptoms were worth getting a diagnosis, and he said that I had the traits but that because I didn't struggle it wasn't necessary or I shouldn't do it (I disregarded the \"not struggling\" part because this same therapist said he didn't see anything wrong with me even after seeing me break down crying because I was scared I couldn't stop myself from attempting). That's when it really dawned on me that in my country autism is intrinsically associated with medium to severe intellectual disability and that a diagnosis here is mostly for the purpose of getting a disability, certification? card? pass? I don't know what it's called. It made me feel guilty because I don't see myself as disabled (I'm also gifted which gives me a privilege that makes me feel pathetic for focusing so much on minimal or irrelevant difficulties) and I would feel like I'm cheating to get accommodations I don't need, or for issues I don't have.\n\nBased on that my immediate thought is that it's just not necessary to get it. I'm on holidays and in between switching careers, so having less social interactions and academical or formal activities I feel like anything that would normally be paralyzing to me is just not present, and thus it seems like I don't have any issues to worry about. However I know that small situations during this academical year (and previous ones as well) put me in a lot of risk and I'm scared it might happen again. I'm thinking I may actually do need accommodations and I just don't know which ones they are, and getting a diagnosis as early as possible would allow me to actually get through college without feeling like I'm in survival mode constantly.\n\nEssentially, I don't doubt that I could be on the spectrum and I definitely struggle, but  I feel like I don't do so in the way or areas that someone with autism would be expected to. Because of this I don't know what accommodations could a diagnosis give me access to that would actually be helpful for my case; I don't know what would be the process to help with just, being sensitive. I did also consider the possibility that I'm misattributing my responses to heightened emotions when those emotions themselves could be influenced by the overstimulation and sensory issues that I'm not noticing or taking into account, but honestly I'm just not sure about anything.\n\nBy the way: I know I should still seek therapy for the suicidal tendencies alone and I will, but that's not what this is about since I wouldn't need a diagnosis for that. I do feel like having a better understanding of how my mind functions and thus more self-empathy and accommodating things I thought weren't bothering me would help that to some degree, and in fact I think it's already having a positive effect just from me recognizing that I don't just struggle because I'm weak or lazy. I also know there aren't any external current or past events that would justify such a severe and lasting emotional impact, which is why I always knew I had something psychological going on.",
        "created_utc": 1671565366,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do i feel childish?",
        "author": "l1ghtn1ng_Flash",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqx9l6/why_do_i_feel_childish/",
        "text": "I often feel as if people are more unforgiving of me than others, as if they where looking at me as a child that needs to be taught. I'm so sick of it, it's to the point where i can't tell if it's others that make me feel immature, or if beep really am just immature and childish. But it's so frustrating as I'm 23 and it feels like I'm treated like a 12 year old, is it just my problem? Or are others cruel and intolerant.",
        "created_utc": 1671564569,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was recently diagnosed with autism (no formal assessment, just my therapist) and I’m going back and forth on whether it’s true or not.",
        "author": "phel-phel",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqubys/i_was_recently_diagnosed_with_autism_no_formal/",
        "text": "I’m 36f and have been diagnosed for a grand total of 2-weeks! And since then, it’s pretty much all I’ve been able to think about. I’ve been going over situations in my life thinking “oh is that why I did that?” and habits that I have, and there does seem to be a correlation. It explains why I had trouble socializing, why I tend to just pick a social group and stick with it for a couple years hoping that by doing so I’ll be integrated enough that friendships just ‘happen’.  It explains why I can’t understand a thing my mother says (she is very long winded and never gets to the point and I’ve had to ask her in the past to just keep it simple) or why my jokes tend to be more dry or morbid (I think I’m hilarious btw). \n\nThen I go over typical traits and think “no, that doesn’t apply to me” and then later realize it does because I’ve already developed a coping strategy for it so I don’t even notice it anymore. An example is light sensitivity, I prefer indoor lighting and bright, natural sunlight always bothers me. So I got transition lenses for my glasses and I tend to keep my car visor all the way down even when I don’t need to just to limit the amount of light, particularly that reflecting from the sky or clouds. I prefer to stay indoors which sucks because I actually do like being outside, but it’s often too cold or too hot or too windy (even the slightest breeze = too cold). \n\nBut then I start doubting due to my coping techniques, since they’re already long developed and have been for years. So I think, doesn’t everyone do this? Doesn’t this just makes sense to do? I look at some of my behaviors and cannot fathom why anyone else would do it differently.  \n\nThen I come to autism spaces online and people are describing their struggles, and I still can’t relate, because I’ve already long since found a means of coping with that problem that I don’t remember it was a problem at one point, or it simply doesn’t apply to me. So then comes the question of “am I autistic enough to to even fit in among autistic people” and tbh, that thought really scares me because it means I still don’t have a place to fit in and feel comfortable. I think, what if the diagnosis was wrong, and now I’m going down a rabbit hole I have no business being in? Like, how dare I try to relate my experiences to people who are clearly struggling. \n\nI don’t get it. I want to be happy that there’s an explanation, but then am I right to be happy about it? And if the diagnosis is wrong, then what? \n\nAnyway, I needed to vent and appreciate any feedback given or even just being able to post this, thank you.",
        "created_utc": 1671557567,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did you realize you actually DO have some similarities with allistics?",
        "author": "lizzyraexx",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqrqhr/when_did_you_realize_you_actually_do_have_some/",
        "text": "The reason I'm asking this is because I spent most of my life, especially childhood, being told that I was so different from everyone else, that I was the \"only one\" who did something or thought of something a certain way, that I was weird and that that was all somehow morally wrong, etc. So I spent a lot of energy over-analyzing everything to try to make sure I was doing it \"correctly.\" The particular instance that brought this question up is that I spent so much of my life making sure that I never stated an opinion unless I could back it up with facts, but I think I've gotten exhausted from doing that with every opinion I have (even simple things like why certain foods are better or worse) that I stopped doing it at some point and didn't realize. \n\nToday we were having a discussion about what the age of majority should be in another sub, and I said \"well if they were going off of science, it should be 27.\" I've heard so many times that 27 is when the brain is fully developed. But I didn't  realize until people started discussing it that I've never actually done the research to confirm whether that's true or not. I realized, \"Oh, this is what neurotypicals do, they just go off the first time or the most frequent time they hear some thing as fact\" (the availability heuristic I believe?). I never realized I did that in ANY situation because I spent so much of my life trying to never do it at all. But I'm exhausted of researching every single thing that comes out of my mouth. So now I wonder how many things that I've accepted as fact that aren't—not because I'm allistic/NT or \"lazy,\" but because I simply wasted so much energy researching everything that I burnt out. \n\nEverything in my brain is telling me right now that this is too oddly specific and no one else will share this experience. But I know that's wrong because I've found so many things where I thought I was the \"only one\" in this sub already.",
        "created_utc": 1671551193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ridgid thinking maybe?",
        "author": "Elentiyamoon",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqng9i/ridgid_thinking_maybe/",
        "text": "Possibly just me being stuck in my way of thinking but does anyone else struggle, like actually makes you annoyed as hell, when another person uses the completely incorrect word for something? This has to be the autism that it grieves me so severely. \n\nMaybe it's not even the incorrect term, it's actually just the one I heard first in some instances. \n\nTwo examples come to mind. \n\n1. Chuck - sentence \" I'm going to chuck that wrapper into the trash can\" \n\nOther word used- CHUNK - sentence \" I'm going to chunk that wrapper into the trash can. \n\nTo me, chuck is correct. It makes me twitch when I hear chunk. I actually rarely ever hear chuck.\n\n2. Scold - \"He scolded me about arriving to work late\" \n\nScald - \" He scalded me about arriving to work late\"  \n\nIn this case, when someone incorrectly uses scald, I can only literally imagine someone throwing hot liquid on the person to correct their behavior and I wonder if that's why they say it? Like they think that's what it means. \n\n\nI'm sure I've committed some of the same atrocities I'm complaining about in this post so feel free to scold me and my incorrect-ness",
        "created_utc": 1671540102,
        "upvote_ratio": 1.0
    },
    {
        "title": "could this just be social anxiety by itself?",
        "author": "Latter-Meringue-7661",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zql33z/could_this_just_be_social_anxiety_by_itself/",
        "text": "- easily distracted during class discussions and loses focus\n- doesnt participate in class discussions\n- stubborn, refuses to get involved in things they dont want to\n- very quiet\n- enjoys imaginative play\n- has friendships (around 8 years old) after this, no friends established later in life\n- sensory problems all throughout life, severe enough to be hospitalised\n- finds it hard to speak in front of others (5 years old) still has trouble with it\n- at 6 years old, will answer direct questions with encouragement (might be referring to class discussions)\n- can predict what will happen in books\n- can spend a lot of time with activities they want to do (4 years old)",
        "created_utc": 1671532345,
        "upvote_ratio": 1.0
    },
    {
        "title": "special interests and losing them",
        "author": "QuirkyWolfPup",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqits0/special_interests_and_losing_them/",
        "text": "Hello! \n\nHow do you guys deal with losing or \"moving on\" from a special interest? When the interest isnt your \"thing\" anymore.\n\nI have been an artist my entire life. Report cards from elementary school even note my \"artistic ability\" or interest. I went from doodles and comics in elementary, to obsessively improving myself in middle school, to working my way through high school with the hopes of art school afterwards. I lived and breathed art, and it was my everything. History, techniques, medias, expanding my style and trying everything I could. I was good at it too. \n\nI graduated high school just over a year and a half ago, and I havent picked up a pencil or have drawn anything since. I have nothing to do with art, even though its been my passion, my thing, for the last decade. I have no want or desire to draw, create. Ive almost entirely moved on and Im working on discovering new passions. \n\nHow have others dealt with this? Im almost sad that I dont do it anymore, but its to the point where I get paralyzed even sitting down with paper to try drawing again. My brain has the desire to doodle once in a blue moon, but its almost like my body doesnt want to? Ive come to terms with all of this, that it probably wont be a part of my life again, and have accepted this, but I still struggle with the whole \"this used to be all that I was, and its gone, so who am I supposed to be\" thing mostly. \n\nTIA!",
        "created_utc": 1671524350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being infantilized",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqfn2q/being_infantilized/",
        "text": "For reference I am 21 years old (and afab) and everyone I'll be mentioning is also 21.\n\nI am aware I am more childish than the typical 21 year old. I pretty much have a baby face, wear glasses, and graphic shirts. Most of the clothes I wear are loose on me, so it makes me looks tinnier and younger (since cis women at this age tend to go for more fitting clothing). I don't drink and even avoid it. I don't like parties or clubbing. I am aware my behavior and appearance is of a much younger person. Still, I do not think it allows people to treat me like a kid.\n\nEarlier this year I spent the night at my cousin's house with his girlfriend. At the morning I went into the kitchen and started having breakfast. The girlfriend came into the kitchen and made herself a drink. She took a few sips and asked me if I wanted a hot chocolate. Mind you, it was summer and here that's a drink that's for children. Also, offering to cook for me sounded weird too. It wasn't her house. She was a guest there too. I'd been to that house many more times than her. She was more of a guest than me.\nShe also wanted to keep me entertained (as one does to a child). It was pretty clear to me she was acting as a mother. She even asked me \"do you want more? I can bring you more\". Like if I wanted more I could have grabbed it myself.\n\nNow, I had to asked them if they were coming for Christmas. It's a long story, but I couldn't get in touch with my cousin, so I had to ask her. She told me she wasn't coming but he was. She said \"yes, he's coming so you guys can play and be entertained\". Play. We're 21. It's this sort of behaviour/language that they use. \n\nI may be painting her as the villain, but I don't think she is. I don't think she intentionally does this. It's just that, well, they're dating, they live almost together, they do on dates, they have sex. I've never gotten past having a crush. They know that. It's obvious. I feel this also adds to them taking the roles of parents and me of the child",
        "created_utc": 1671514275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working for organizations serving those with special needs",
        "author": "Tootoosies",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqcb9q/working_for_organizations_serving_those_with/",
        "text": "Has anyone ever done this before? What is your experience?\n\nI worked on call at in a school for special needs kids, they loved me, my coworkers seemed fine with me but I believed I received a contructive dismissal. There were complaints about me apparently but nobody ever talked to me about it. The principal said I wasn't there at the end of year (I was) so she could not talk to me. I wanted to return but she said I could not. Nobody gave me much feedback and told me what I was doing wrong at the moment. I am usually able to pick up on other people and in my previous jobs I usually get direct feedback and I know how to work and perform well. It was out of nowhere almost.. This job was not in my field and I just wanted to try. I want to volunteer at a special needs camp, not work because I don't trust myself anymore to be responsible or work with these kids but I'm scared that they'll pick up on something about me and I'll be out the door again.",
        "created_utc": 1671505081,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it with popular mean girls and knowing you’re on the spectrum",
        "author": "Thesdayday",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqavcz/what_is_it_with_popular_mean_girls_and_knowing/",
        "text": "I cannot be the only one that has had this happen to them. In highschool, when I was a freshman, these girls who say behind me somehow knew I was autistic before I even knew. I did not know them, had never spoken to them. I just simply sat in front of them in class everyday. I am a very quiet person and usually will not speak unless it’s necessary so it’s not like they had much to go off of but that means I hear everything they talk about. For some context I was taking sign language classes because my school offered them and finger spelling had become a massive stim for me I was always fingerspelling the alphabet knowingly or unknowingly it had become a habit and this meant I did it in class too. I’m assuming they noticed this and one day I overheard one of the girls asking her friends if I was special needs etc. I am not a confrontational person so I ignored this but it still hurt because of how they were discussing me. I assume the finger spelling is why they might’ve said this but it couldn’t have been the only reason because that’s such a wild conclusion to make i don’t know. I barely spoke to these girls but the few times I did I could tell they 100% thought there was something off with me by how they spoke to me. It just blows my mind now how they were right. mean but still right. this isn’t the only time something like this has happened to me so I know I can’t be the only one it just amazes me how easily they can tell.",
        "created_utc": 1671501411,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help!",
        "author": "imconfusingashell",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zqad1o/i_need_help/",
        "text": "Hello reddit! This is my first time ever posting on here so please be nice :) I am a 19 year old poc female and recently i’ve realized that I may have autism. There are so many signs I can think of. I have really bad sound sensory issues and have dramatic reactions when something is too loud for me. As a child I was forced to suppress a lot about myself due to growing up in an abusive environment. Now that i’m in college and *mostly* away from that, I find that i’m really struggling with my identity and how I’m supposed to act. I sometimes have days where I just don’t really feel like talking/don’t contribute much to conversations and my friends get upset and think that I am ignoring them. I’ve also noticed that I probably do a lot of masking. Whenever I have a full day of socializing, when I get home i feel absolutely defeated and tired, maybe even a little sad. In childhood specifically, I can remember being yelled at for being a “crybaby” and getting made fun of in school for doing/saying things i thought were normal. I also still have a really bad problem controlling my voice. How quiet/loud I am, my tone, and my pitch. Sometimes I speak in a sort of baby voice that I can’t control. I have to work really hard to not use it when I realize i’m doing it. I’m sure there’s more but I have a really terrible memory so I can’t remember much. \n\nCurrently, I’ve been dealing with really bad depression and anxiety that just doesn’t seem to get better. I wonder if not figuring this out may be contributing to that. I took some “credible” online quizzes and got pretty high scores but I know they can give out false positives. I also do have focusing issues and my friends are thinking I have adhd but idk.\n\nI haven’t told anyone about this because I don’t wanna be wrong and people think I’m looking for attention or anything like that. A few months ago, one of my close friends came to terms with the fact that she most likely has autism. She is a bit more of a “typical” autistic person based on the way she speaks and socializes with people. I fear that if I tell her and my friends they won’t see me as valid. She even said to me around that time and “I don’t think you have autism, probably adhd” (this conversation was completely unprovoked btw). Now, my friends are really understanding and supportive ppl, but I have a lot of experiences they just don’t relate to and understand. Between that and my really bad anxiety, It just makes me very fearful, to open up to them about this.\n\nAny thoughts or advice would be super helpful!!",
        "created_utc": 1671500129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do other's emotions stress you out!?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zq9rbr/do_others_emotions_stress_you_out/",
        "text": "18 male ( ADHD, Suspect ASD ) So you know how babies cry from someone yelling at or around it. Im like that but without the crying. Whenever im around someone yelling or mad or crying ( Mainly my mom ) I try to act fine but I lose appetite of whatever task I was doing and im just stressed and overwhelmed for a little while. Any of you guys relate? Is this ASD related or something else?",
        "created_utc": 1671498668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sensory seeking behaviour",
        "author": "goodbyemr",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zq4854/sensory_seeking_behaviour/",
        "text": "Possible TW for self harm but I don't know if it actually categorises as that.\n\nWinter isn't awfully cold where I live, temperatures rarely go any lower that 3/6°C during the day, but I still get really cold, to the point where my bones start aching. But sometimes, despite that, I'll be seeking out the cold. That means sometimes I'll under dress on purpose or just leave my coat at home. I refuse to turn the heating on, etc. I don't know if this is actually a form of self harm, but I believe for the most part it's a sensory seeking kind of thing. Anyone can relate?",
        "created_utc": 1671485561,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are all the autism subs?",
        "author": "rabbitfootkeychain",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zq3gh9/what_are_all_the_autism_subs/",
        "text": "I don’t really like the main r/autism one because it’s so big. I only know of that one and this one, are there any others? Specifically looking for autism ones, I don’t want any Asperger’s ones. Thank you if anyone knows of any",
        "created_utc": 1671483757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-Diagnosis Revisited: Addressing Recent Discourse and the Erasure of Higher Support Needs",
        "author": "NotKerisVeturia",
        "url": "https://aureliaundertheradar.wordpress.com/2022/12/19/self-diagnosis-revisited-addressing-recent-discourse-and-the-erasure-of-higher-support-needs/",
        "text": "",
        "created_utc": 1671482883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is being in your body a horrifying experience?",
        "author": "MonBonPon",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpzcnh/is_being_in_your_body_a_horrifying_experience/",
        "text": "I am strongly impacted by ASD, Complex PTSD and chronic pain. I am constantly aware of what my body is doing, and I have many physiological triggers for panic attacks.\n\nI often wish I could just get outside of my body and exist without it. Does anyone relate?",
        "created_utc": 1671474390,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm truly alone for the first time in 41 years, and I couldn't be happier!!!",
        "author": "PyroDrake",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpxwgl/im_truly_alone_for_the_first_time_in_41_years_and/",
        "text": "Some background first: I'm a 41 year old gay male that realized I was autistic over a year ago. Over the last year, I got diagnosed as autistic, and started fully unmasking around my partner of 12 years. All of the friends I had in my early 20's stopped talking to me years ago, and my partner was the only person from \"my old life\" left. Unmasking was scary, and I felt it would be the end of our relationship... I wasn't wrong.\n\nIn the process of unmasking, I guess my partner didn't want to deal with anything emotional, and ended up breaking up with me. Realistically, I should have ended it with him a long time ago over his drinking. Years ago, we made a promise to stick by each other through anything though, and I'm not the type to break a promise (even if it's for my own best interest). I tried to stay by his side, but between his drinking and my meltdowns (usually due to his drinking), I can honestly say he made the best decision in breaking us up!\n\nNow I'm 41, and living in my mothers attic with no where else to go. For all rights and respective purposes, I SHOULD be depressed as hell, sad about my failed relationship, and feeling completely alone with no one else to turn to... Except...\n\nI DON'T! For the first time in my life, I have NO ONE I need to mask in front of, impress, or work around! I have no one to tell me the way I move is strange, or laugh at me because I can't feel a specific emotion or feeling! For the first time, I FEEL FREE! I managed to find a job in IT that works around my needs, and I feel like I can finally save money! For the first time in a long, long time (if ever), I actually feel HAPPY!\n\nIn accepting I was autistic, I also came to terms with the various feelings and emotions that I either can or can't feel. \"Missing\" people is one of them. If I don't see someone for a while, I'm physically incapable of \"missing\" them. Most NT's don't understand this, and usually hold it against me (\"Why haven't you call me in weeks?!? I don't want to talk to you anymore if you're not going to reach out at all!\").  It took a long time to accept this: I actually felt worse about NOT being able to miss someone rather than feeling bad that I miss them! Simply accepting, \"I'm autistic, and that's okay!\", has made it significantly easier to deal with those feelings.\n\nThe reason I'm writing all of this out is to tell others, it's OKAY to be alone! If THAT is what makes you happy, then embrace it! You don't HAVE to physically get out to socialize! It's OKAY to take time for the things YOU want to do! I don't know the future, so it's very possible I'll get lonely or want to seek others for socializing. For now, though, I'm 100% alone with NO ONE who will call or text me to hang out, and I couldn't be happier! I can finally work on the things that make ME happy without interruption!\n\nI know we're all different, and many may feel things that I don't/can't. When my partner broke up with me, it felt like the last connection from my pre-autistic, fully masked days had finally been cut. Before he moved away, it felt like my world was ending. When he finally walked out the door for the last time, I didn't feel as distraught as I thought I would though. I felt relief. I felt free. I felt like there was no one else in my life I had to perform for! Honestly, I'm SO thankful I found out I was autistic! Otherwise, I'd have no clue why I felt this way, and I'd feel guilty and ashamed for it! After all, \"relief\" isn't something a normal human is supposed to feel after ending a 12 year relationship! Yet now, I can finally say, \"I'm autistic, I'm alone, and I'm happy, and that's ALL OKAY!!!\"  😁",
        "created_utc": 1671471204,
        "upvote_ratio": 1.0
    },
    {
        "title": "On my Autism Journey",
        "author": "Fiction52",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpxfgy/on_my_autism_journey/",
        "text": "Hello all! I’m brand new here. I’m 26nb and I learned about this community in Devon Prices book Unmasking Autism. I’ve been on this journey for the past year and finally got an assessment last Friday. Now I’m anxiously waiting on the results. \n\nI would call myself self diagnosed because I relate so closely to the experiences of other people in the community and I now can say the same Autistic traits in my family. But I’m also diagnosed PTSD and I’m recognizing how much that can overlap with ASD and I’ve been questioning a lot of my experiences and honestly feel like I’m crazy at times. In fact I’ve felt absolutely insane the last couple of months. I’ve learned about about the DSM diagnostic criteria and I’m afraid I didn’t adequately convey my experiences and how disabling it has been for me. \n\nI’m kinda brain dumping so I’ll pivot. I was told I should have the results sometime this week and my provider will call me when she’s ready but I now it’s all I can think about. I’ve been at work today and haven’t really been able to focus on anything else. I don’t know when she’ll call just that she will eventually. I am honestly hoping for a formal diagnosis because I feel like my experiences, struggles, and suffering will finally be validated. If not, we’ll then my therapist and I will have a lot to talk about lol. \n\nI don’t know why I’m even posting, but I’ve never interacted with the community so I guess I wanted to put myself out there. Thanks for reading.",
        "created_utc": 1671470159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cynicism",
        "author": "InvincibleSummer_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zptbp0/cynicism/",
        "text": " TW\n\nPeople just don't surprise me anymore. Most of them are just out for themselves and they don't care if someone else gets hurt as Long as they can rationalize it. I'm so sick of being mistreated and ignored by so called 'friends', of trying to be vulnerable only to be hurt and pushed more into avoidance because of people's behavior. Asking for help i don't get any support, so all i have left is post on reddit. (TW) my male friend sexually harassed me, i text my friends something has happened but they don't reply. I hate how men always take advantage of me and how i don't know what's going on and i freeze. I put in so much work to heal from trauma and my childhood and learn about the NT world but i can't do everything on my own and no one supports me. How am I supposed to learn to trust people when i am treated and ignored like this?",
        "created_utc": 1671460786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is my body language perfectly normal when I'm at home/around people I know, but not (almost) anywhere else?",
        "author": "ketchuppersonified",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zprhv1/why_is_my_body_language_perfectly_normal_when_im/",
        "text": "**By myself/with other neurodivergents/close family/quieter people/alone in public/high school class**: perfectly normal body language\n\n**Around new people/having to talk to anyone (who's not close to me) in public**: my body language either gets mechanical (I've to think 'I'm gonna sit *this* way now'), or it occurs without thought, but it just looks off.\n\n*It's like I have normal body language skills and they happen by reflex, but I somehow lose both the skills and the reflexes when outside.* I also believe I read body language and social cues very well, so the problem isn't connected to that.\n\nIs this caused by nervousness in social anxiety plain and simple or is this a trait of autism? Or maybe a thing caused by social anxiety, which is in turn caused by being autistic in a neurotypical world?",
        "created_utc": 1671456261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just took the aspie test, what does this mean? (I was confirmed to have residual adult ADHD if that helps any)",
        "author": "StarryLove1",
        "url": "https://i.redd.it/gnz8xf4ejv6a1.jpg",
        "text": "",
        "created_utc": 1671446095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure what to call this. I think burnout?",
        "author": "Lukostrelec17",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpnxk4/not_sure_what_to_call_this_i_think_burnout/",
        "text": "So I don't have any formal diagnosis and I am not sure if I am autistic or not, my friends thinks so and I score very high on the test. Every few months I kinda completely withdraw for a day or two. On those days I basically set in my room and just kinda calm down and recenter myself. I interact with the outside world as little as possible, where I use to live it about the only I would interact with was doordash. \n\nNormally during this time I am very irritable and just don't want to talk at all. I used to tell people not to be offended if I disappear for a couple of days every few months. I remember one incident in particular. The day before I was tired but not to unusual and the next day I did not want to talk or even be around people. Had a roomate that was trying to get me to come out and hang out with him and the other roomate and, while I can appreciate that he probably sensed something was wrong and was worried it really pissed me off. I finally just sat in my room with nothing but my fan on for a good 30-45 minutes before even turning on my TV. Just curious what you think.",
        "created_utc": 1671445399,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cried at everything as child",
        "author": "Blizzard_style_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpcb65/i_cried_at_everything_as_child/",
        "text": "My response to every feeling was crying, if i was too sad, happy, mad, annoyed or tired i busrted into tears, my family told me all my life i was too \"dramatic\" or \"sensitive\" so i tried everything to stop it and when i managed to stop crying for almost everything, they were stranged out, i still get the urge to cry at times, but i don't do it, i don't want to be a \"crybaby\" like my family called me when i was a child.",
        "created_utc": 1671408003,
        "upvote_ratio": 1.0
    },
    {
        "title": "ND support group for those in 12-step programs meets on Sundays at 1 PST",
        "author": "PlasticMix8573",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpc7dw/nd_support_group_for_those_in_12step_programs/",
        "text": "Hi, if you are interested in an ND secular support group for those in 12-step recovery (AA, NA, OA, etc) DM me and I will give you the info.  It is public info on the web, but I don't want to attract opportunistic Zoom bombers from Reddit.  We meet for an hour on Sundays at 1 PM Pacific time.  \n\nRead from Scattered by Gabor Mate or Unmasking Autism by Devon Price for 15 minutes and then open the meeting for sharing.  We have been meeting for a year.  It is going well. Have ~10 regulars and another 10 rotating through.",
        "created_utc": 1671407708,
        "upvote_ratio": 1.0
    },
    {
        "title": "8 year old son cannot stand wearing socks. Anyone have a similar experience?",
        "author": "dimebag42018750",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpb3h2/8_year_old_son_cannot_stand_wearing_socks_anyone/",
        "text": "Did you ever start wearing them? His shoes are starting to stink.",
        "created_utc": 1671404664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else kinda suck at analyzing media? Or thinking deeper about it?",
        "author": "thoraxed",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zpaxxo/anyone_else_kinda_suck_at_analyzing_media_or/",
        "text": "Despite the title, it us something I do try to do. It takes a lot outta me though and gotta look up a lotta stuff. But, I'm not really good at it is the thing. I know I don't have to be good at everything but I'll be honest it makes me feel a bit dumb. Like, I take things very literally okay and it's silly but I had to have someone point out to me characters can Lie in a story. I dunno how it slipped my mind yeah of course people lie. I dunno, I've been thinking about this because I'm in a honors English class and my teachers kinda sick of my shit. I take things at face value amd even though they aren't explicitly rude they probably think \"this dudes kinda dumb whyd they put him in here?\" Also, critically thinking about things is very important to me, I can't tell you if I'm good or bad at it but I try everyday to improve at it.",
        "created_utc": 1671404280,
        "upvote_ratio": 1.0
    },
    {
        "title": "facial expressions test",
        "author": "Latter-Meringue-7661",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zp9zeo/facial_expressions_test/",
        "text": "when taking a facial expression test, do you choose the choice that makes the most sense to you or by thinking about it carefully (for example by focusing on the facial features and taking your time)?\n\nI’m scared that the person who will be doing the assessment will ask me to take a test and i’m not sure which way i’m suppose to do it by. i will ask if i do end up doing a test like that but i want to be prepared just in case they give a vague answer \n\nany comments appreciated",
        "created_utc": 1671401688,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had no filter, and idk why!?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zp929n/i_had_no_filter_and_idk_why/",
        "text": "18 male ( ADHD and suspected ASD ) So when I was a kid I would say socially unacceptable things mainly around my friends to make them laugh or like me more. I would joke about immigrants, rape, racist things, homosexual jokes. And I had a Mexican American friend I would tease about his nationality ( Im NOT proud none of this btw ) but I wasn't like that at home, it was just around them. They laughed most of the time, but sometimes I would take it a bit further then needed without understanding that Im taking it to far. There was also a time where I was in class and it was the teachers birthday, so I asked her \" How old are you\" out loud and most of the class yelled at me for asking that. I had no clue that it was a rude thing to ask, I still don't see how it is. That's all I can think of right now, sorry I got bad memory skills. Does anyone else relate, and why was I like that?",
        "created_utc": 1671399271,
        "upvote_ratio": 1.0
    },
    {
        "title": "need advice. Germany, Berlin",
        "author": "niemniemnieeem",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zp87zf/need_advice_germany_berlin/",
        "text": "so i've been finally fully diagnosed after two years and last hope of having mood/personality disorder to be able to correct with medication is gone. bittersweet. \n\nbut yeah, Charité hospital sent me an email with recommendation about therapy and various centers but most of it is for children and no adult counseling whatsoever. very short list of therapists also and none of them offering appointments in English(also some not even having an email, only phone number as if they don't work with autistics) and there is no way i could be able to express myself in detail in German yet. i also can't even get enough practice because anxiety doesn't allow me to verbally converse with people in German. English isn't my first language either but i know it well enough to explain things in detail. i also wouldn't be able to have therapy in my native language cause i can't talk of things that happened to me in it, it's some weird block. \n\nwell.. uh... does anyone have any advice for my situation? :( \n\nthe whole \"autism journey\" started because i went to get therapy in Berlin and therapist said she can't help me because i'm most likely autistic and she has no training. i am mentally completely paralyzed and trapped and i don't know how to move on with my life. i can't work, can't study, i'm in severe burnout and i constantly think about suicide. i fully depend financially on my husband who's working and studying and it makes me feel like a burden. before i moved i didn't think i'm such a mess. i worked since 17, studied. it was hard and i visited mental hospitals and dropped out/quitted jobs multiple times but i thought i'm normal and just lazy or something D: so i thought maybe in Germany where human life actually has worth i'll be able to be something maybe but as soon as i felt safe i completely fell apart.   \ni don't know what to do.",
        "created_utc": 1671397116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone get the urge to hurt people?",
        "author": "Sunshinefake",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zp4mzr/anyone_get_the_urge_to_hurt_people/",
        "text": "Intrusive thoughts.\n\nSo I basically bought up work. My mistake for bringing this up cuz it then gave my dad and grandma an invitation to demean me and my goals. E.g. \"I told you to be a teacher yada yada.\" What I want to do for my career is my business. And what annoyed me is my grandma guilt tripping me and then she teasingly touched my leg and I felt like slapping the crap out of her.\n\nEven recalling this makes me want to beat her up. Granted I won't, but it's triggering. Its the way she is; the years of being bullied by her and power tripped too.\n\nI won't go into details, but does anyone feel this way. I usually have to leave the room, to hold myself back from yelling and shit.\n\nThey know I have meltdowns and it takes every ounce of me to hold back from screaming and crying, but they still push my buttons.",
        "created_utc": 1671387579,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have some questions",
        "author": "TheGhost0000",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zp3t0i/i_have_some_questions/",
        "text": "\nCould this be autism or something else.? \n\nNote: I have been diagnosed with ADHD  OCD, GAD, Depression and a learning disability. \n\n\nI find it difficult to greet people and engage in a conversation, when I do greet someone I repeatedly use the same sentence such as \"how are you\" I also pick up and mimic what other people say in a conservations and also repeatedly use the same words over and over, here is an example  \"How are you? \"I am doing good\" \"ok\" and \"cool\" as my response. My friend noted that I interrupt a lot and pointed out my mimicry. I mostly use a passive voice as I was told but in other situations I catch myself speaking in monotone, I was at a store and I saw someone bring in a dog and I asked to pet it but I was anxious to ask and I ended speaking in monotone.\n\n\nI find it difficult to express my thoughts in words so I usually shorten what I want to say too, here is an example \"thank you for helping me out\" but instead I would say \"thanks\" lol In some cases I would type on my laptop or phone instead.\n\n\nI don't feel like I fit in anywhere, I am often daydreaming and in my own world. \n\n\n I am highly sensitive and emotional, note i'm not sure what this is, is it like a panic attack?\n\n\nI am feeling overwhelmed, I'm triggered, I feel my emotions rising, it's overwhelming me, I don't know how to calm down, I feel the tears, they ask \"are you ok\"? \"why are you crying\"?, I picture images of the past in my head and it hurts, I can't think correctly what I say is nonsense. I am hyperventilating, my senses heightened. I am burning, my temperature is rising. I have the urge to hit my head but I don't. \n\n\n\n\n\n\n\n\n\n\n\n ",
        "created_utc": 1671385111,
        "upvote_ratio": 1.0
    },
    {
        "title": "struggles with academia and general learning?",
        "author": "xavdil",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zp07je/struggles_with_academia_and_general_learning/",
        "text": "hello hello all. im brand new here so very sorry if ive misunderstood the way this subreddit works or anything.\n\nim at the very beginning of my autism journey and have been considering different things about me/things i do through this lens for the first time (a lot of things are starting to add up lol)\n\none thing i cant stop considering (but im not even sure is an autism thing), is that since i was young ive always struggled academically, from the actual learning itself being a chore, to doing any tests/essays and having extreme difficulty verbalising the passion, opinions, thoughts, and understanding I know I have, but can't figure out how to express. It's like my thoughts get trapped in mollasses, they're very much there, but theyre stuck and impossible to get a clear view on - like I can only think in concepts, and not actual thoughts and then I'll either go blank, or heavily over explain but never feel satisfied that ive actually explained myself properly. Sometimes I've managed to somehow contribute to discussions/write essays succesfully and the few times I was able to get an A were some of the happiest moments I've ever had, but for the most part its been a confusing, messy mess filled with lots of teachers asking me why i dont just put in more effort. \n\nIt happens as well with fixations/special interests/i dont know what the right term for this is sorry - things i get so overwhelmingly obsessed with but i just cant verbalise to anyone why, i cant share the different analysis i have on them even though i know i have them, i barely find the words to say that i love them and i find researching them further to often not be something im interested in doing. \n\nive just only really heard of people who love learning, are academic geniuses, or struggle in academia but still love to learn about their fixations. anyway. idk if this even makes sense, but yeah. its just always bugged me because i love academia, analysis, discussion, and all that good stuff, but I've always been at best average at it and i guess im lowkey hoping its an autism thing - and dw i will be discussing with my psychologist about this i just dont see her for a while and i wanted a little bit of input in the meantime i guess.\n\nThanks!!\n\n(im sorry for the garbled mess that was this post)",
        "created_utc": 1671374784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gulping vs Sipping Drinks?",
        "author": "funkysyringe",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zorp4f/gulping_vs_sipping_drinks/",
        "text": "\n\nEver since I was little, I was told to stop gulping my drinks. And I've tried to not do it but it's difficult not to. Even if I reduce the amount of the beverage I take in, I end up swallowing it much more aggressively than I need to. And if I try to sip and swallow not as aggresively, I have to really focus.\n\nI'm not formally diagnosed (but I have an eval soon).\n\nJust wondering, does anyone else experience this?",
        "created_utc": 1671343835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autism and the Enneagram- thoughts?",
        "author": "izzmyreddit",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zoqcys/autism_and_the_enneagram_thoughts/",
        "text": "Hey y’all! So I was bored and did an enneagram test (I used to like Myers Briggs before I learned the dude was a eugenicist, for reference I was an INTJ/INFJ it varied) and I’m a type 5. Reading the description and this just sounds like ~common autistic experiences~ I often discuss with other autistics. Anyone else seen a correlation? If this is wildly ridiculous to propose don’t roast me, this is not a knowledgeable area for me.",
        "created_utc": 1671339213,
        "upvote_ratio": 1.0
    },
    {
        "title": "posting in a NT sub and got hate",
        "author": "Humanarmour",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zopdz8/posting_in_a_nt_sub_and_got_hate/",
        "text": "Hey so I recently made a post on a sub that's mainly frequented by NT people and got absolutely demolished in the comments.\n\nI was recently part of a bootcamp and I decided to make a post about my experience there. How the thing was, the dynamic, everything. I ended it with some tips I wish I'd known before going on it. One of the things I talked about was about how I hadn't participated enough and hadn't really talked through it. I encouraged people to do otherwise because of the feedback I got. I also asked people to not ask stupid questions, or to not talk more than needed (the bootcamp was 8 hours a day, for two weeks. I was exhausted each day after hearing people talk non stop for 8 hours). So, I was basically telling them to think about what they wanna ask and to not extend the classes by talking too much.\n\nI mostytgot hate on the comments. People calling me rude, a know it all, stuck up, saying they never wanted to work with someone like me, etc.\n\nI was only talking from experience and giving my opinion. I made the psot because there wasn't a post that went in so much depth about this Bootcamp. \n\nMost of the hate came from people telling me I was wrong to claim other people shouldn't ask stupid questions, or that they shouldn't talk too much. I don't really know tbh. Maybe NTs don't feel as if someone's \"talking too much\" or they don't see it as a problem. \n\nBut let me ask this sub: how would you feel if you're sitting for 8 hours in front of a computer (with 3 or 4 20 minute breaks) and there's people talking non stop (the professors teaching the material and students talking, asking questions, etc)? Because I was exhausted. I wanted to get up and leave. I couldn't really sit there. This is why I asked people to not talk more than needed, because I didn't want other people feeling as I did (which I thought was most people, but maybe NTs don't feel this way?)",
        "created_utc": 1671336038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Irritated by inconsistencies in other people?",
        "author": "thedumbestdeer",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zomzdf/irritated_by_inconsistencies_in_other_people/",
        "text": "First time poster here, suspected autist and formally diagnosed with ADHD. I have one of those “is this an autism thing, or just a personality quirk?” kind of a questions, so here we go!\n\nI have this thing where I get upset when people express inconsistencies in their beliefs/ideas about the world. One recent example was when I asked a relative if they like a certain food, and they reply *emphatically* with “Noooooo, that’s too fattening!” Yet literally a few days ago, they joked about not having room for dinner because they stuffed themselves with chocolate??\n\nAnd this is a perfect example, because the inconsistency between their statement and actions has literally no impact on my life. I could just be mildly confused/annoyed in the moment, then move on with my life. But of course, I don’t. I’ll keep thinking about it for a *long time* afterward, just stewing on it and wondering why they either 1: have zero self-awareness/introspection, or 2: lied for some reason I can’t figure out. (If I can figure out the “reason” for the inconsistency, I usually stop perseverating shortly after that.)\n \nAnyway, just wondering if any autistic folks connect with this experience? Like, is this my brain spinning its wheels trying to figure out why neurotypical people act the way they do? Or is this just a personality quirk with no neurological explanation lol",
        "created_utc": 1671328609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Storytime to when I though this emoji \"😘\" was blowing away the heart lol",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zokcmb/storytime_to_when_i_though_this_emoji_was_blowing/",
        "text": "18 male ( Have ADHD and suspect ASD ) when I was a kid my friend was at my house and he was texting a girl he liked in the neighborhood, so I thought it would be funny to try and troll by grabbing his phone and sending this 😘 emoji. I thought the emoji was blowing the heart away as in \" not interested \" but it's the opposite lol. She blocked him. The end.",
        "created_utc": 1671321753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting tired of speaking",
        "author": "michelfmc30",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zoarot/getting_tired_of_speaking/",
        "text": "I just would like to know if it happens to anybody else. Do you guys get tired when you talk for some time to the point that you need to catch your breath? I’m not in a bad shape and I have no respiratory problems but when I speak for a long time I feel that I’m pushing my body. It feels like I’ve been walking for quite some time. And when I say”talking too much”, I sure it wouldn’t be considered too much for most people.",
        "created_utc": 1671296679,
        "upvote_ratio": 1.0
    },
    {
        "title": "People forget I'm autistic and I'm over it!",
        "author": "boba-boba",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zoaa3z/people_forget_im_autistic_and_im_over_it/",
        "text": "My therapist, mom, psychiatrist, even my husband - they all forget I'm autistic because per them I'm \"sociable\", \"concise\", \"clear\", etc. People generally find me pleasant enough, if not a bit quirky or weird. My shyness and quietness is often attributed to social anxiety and not the fact that I'm just taking in information or have absolutely nothing to say. I am extremely empathetic to the point that I feel people's emotions very hard. It's really annoying, especially when I'm in therapy. I have major problems with transitions and sensory issues, socializing is extremely draining on me. A lot of my \"typical\" autistic traits I grew out of or they aren't stereotypical. Sure, I have special interests, but I understand that most people don't want to sit there and listen to me talk about them. I even went to get a formal diagnosis so people would believe me, and people still don't believe me.\n\nAnd before I get told to find another therapist and psychiatrist, it's not happening. It took me forever to find this person and I'm not in a place mentally where it's safe to spend time trying to find a provider.\n\nI'm starting to be exhausted by it. People who need to understand that I have deficits (and there's nothing wrong with that) aren't able to accept it because I don't fit the idea of what an autistic person should be like.",
        "created_utc": 1671295349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hyposensitivity vs hypersensitivity - Is it possible to shift from one to the other over time?",
        "author": "reallybiglizard",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zo8405/hyposensitivity_vs_hypersensitivity_is_it/",
        "text": "I’m questioning self-diagnosis (possibly ASD and ADHD combined), as my sensory difficulties and overwhelm have been getting worse recently. The more research I’ve done, the more I relate to the experiences of other women with late diagnoses. As one does, I’ve been trying to evaluate these sensitivities going back over the course of my life. I realized that I didn’t really struggle with the same sensory issues as a child. In fact, it’s like I was hyposensitive to the very things that bother me so much now. \n\nExample: I often become overwhelmed by the sensation of walking on a dirty floor. I can feel all the little bits and it just sends me. As a kid though, I could run barefoot on a gravel road as if I couldn’t feel anything at all. Same with sound. As a kid I could sleep through anything. Now, I wake up from the sound of my dog walking around the room. \n\nGoogling has yielded virtually no helpful results on this question. Has anyone experienced or heard of this?",
        "created_utc": 1671289349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Edging a meltdown?",
        "author": "Mortico",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zo2cha/edging_a_meltdown/",
        "text": "Does anyone else get really upset and cry but maybe not go full meltdown?\n\nI have had a number of full meltdowns, but it seems like most of the time I just get upset, cry, hide my head under a blanket and just sort of hover at that level of meltdown for a while.  It usually lasts like 30-60 minutes and I can't really do anything productive while it's happening.\n\nI talk and complain to myself about all the things that are bothering me, and usually just start ranting to no one.  If someone were to walk in on me like this, I might yell at them or tell them to leave me alone.\n\nThe meltdown and the fear of it getting worse just takes ahold of me and I can't do anything about it.  I'm still very much aware of what is going on around me, I never really lose sight of reality or anything.\n\nI'm just so tired of feeling like this.  I've been trying to keep to myself more, not go out to public places, not try to talk to other people and so on.  I'm using noise cancelling headphones everywhere I go.  but once a week, at least, I jusr break down.\n\nThe stupid thing is I deliberately avoided interacting with others for over a week to recharge.  But I went out on Friday night, because I just want to be around other people.  I got a great burger and a beer, but that was it.\n\nThere was some live music but it wasn't very good or interesting.  Tons of people were there all laughing and having a good time.  But I just sat there by myself, with my earbuds in, and no one noticed me other than the wait staff.  Because it's their job.\n\nI started feeling a meltdown coming on, so I paid my bill and left.  I wanted to stay out longer, but I guess I just can't handle it.  I went home, tried to play some games on my computer, but I just lost every game I played, everything was a struggle to play.  Games I used to be good at were seeming impossible.\n\nI feel like this is \"just\" autistic burnout, rearing it's ugly head again.  I'm miserable.  No one wants to be around me because I'm miserable and lonely.  So I have failed time and time again to make friends.\n\nPeople seem to enjoy talking to me, they might even take my contact info.  But they never contact me, no one does.  I have cousins like 100 miles south of here, but they've never visited me.  We've lived in the same area for 20 years now, and they don't reach out at all.  I text them and they reply but it's all one-sided.\n\nInteracting with people is so stressful that I just don't want to do it anymore.\n\nBut I am also very lonely, not just in the romantic sense, just that I haven't seen hardly anyone I know for years. We were all shut in for years due to the pandemic, but it seems like most people are reconnecting now.  Just when everyone picked a few friends to reconnect with, I never made the cut, I guess.\n\nOne of my oldest friends got in touch with me, we met once, and we've been texting non stop for a month.  But she doesn't seem to want to meet up anywhere, or hang out with me.  I really just miss human contact of any kind at this point.\n\nMy ex-wife is coming to visit tomorrow, with my son.  I don't think she's taking very good care of him.  He's always upset, angry or stressed out.  He's ASD, too, but she doesn't make any accomodations for him.  She has no understanding of it and doesn't seem interested in learning, or getting him diagnosed.\n\nI'm worried about him, but I am not in a position to help him, and she won't take any of my parenting advice. I was the one who raised him, really, she didn't help much.  My son and I are very close, but I'm just not able to do it anymore.  I'm too worn out.  That's the main reason I left her, she wouldn't help me with chores or parenting, cooking, cleaning, fixing things, nothing!\n\nUgh.  I just feel awful.  I need to be up at a decent hour but it's already 4am.  My head is hurting and it's so noisy.  I can't get my mind off of all the people I know and how none of them seem to give a shit about me.",
        "created_utc": 1671267942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autistic or Gifted",
        "author": "aaaaaaaaaahhshshs",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/znvne1/autistic_or_gifted/",
        "text": "Please help I am going through a crisis rn. So basically when I was about 9 my mom was like \"my child sure is special let's get them a little IQ test\" and so we drove out and got a little IQ test. I'm gifted. Yay. I do fairly well in school till later on in middle and high school my grades aren't very good, to say the least. I develop an obsession with psychology. I pour hours into researching mental illnesses. I stumble across autism. \"Damn that sure is like me\"... All of a sudden my \"autistic traits\" are so clear and I notice tiny things I do. I do the silly little aspie-quiz test thing and get 141/200. Maybe I really am autistic. But now I'm thinking back on it, maybe I just tricked myself into having these traits. Maybe I wasn't suddenly noticing these traits because I was more aware, but instead I was playing it up to trick myself into believing I'm autistic. After all, I never even thought about these things before last year, and wouldn't the psychiatrist have noticed something was off? Or maybe not. I don't know.",
        "created_utc": 1671243181,
        "upvote_ratio": 1.0
    }
]