[
    {
        "title": "Does anyone else tend to \"jolt\" or \"jump\" as if being surprised, if you don't stim enough?",
        "author": "Megav16",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zfknne/does_anyone_else_tend_to_jolt_or_jump_as_if_being/",
        "text": "Sometimes when something starts to get intense, either like sensory experience or a \"powerful\" thought in my head, it feels like energy or lightning start to build up in my body and I can either release it via stimming or if I don't it just kinda bursts out. This usually results in a reaction similar to like shock/surprise as if being startled by someone touching you from behind. \n\nIt's not a tic since I can feel it and just stim instead, or if I am stimming or not experiencing any intense internal or external stimuli then it doesn't happen. \n\nPlease let me know if you experience anything like this, thanks!",
        "created_utc": 1670462651,
        "upvote_ratio": 1.0
    },
    {
        "title": "wrestling with my lack of empathy",
        "author": "BossJackWhitman",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zfbitd/wrestling_with_my_lack_of_empathy/",
        "text": "During the past few months, since realizing I'm Autistic, I've been making a series of discoveries based on reflecting on my past, my mindset now, and the lens of Autism. \"Oh, I have some face blindness,\" and \"Oh, there are socks I can wear that actually make me less nervous,\" etc. \n\nI am now realizing that I might lack empathy, and this really bothers me. I noticed this only when I was sitting with my partner recently, and I was being intentional about \"unmasking\" and \"letting my guard down\" and \"being myself.\" I've been working on that recently, in safe spaces, and for the past week I've had several moments that I've struggled to put into words.\n\nWhen I let my guard down (if that's what's happening), and within my mindset of \"feeling vulnerable,\" I noticed a **glimpse of this sensation that my partner was vulnerable, too**. That she was/is *the same as me* \\-- a human being sharing this space with me. \n\nThe feeling didnt last long. I couldn't hold it (I tried). I love my partner in the sense that I like being with her, she interests me (her interests are intriguing to me), I am physically attracted to her, I feel comfortable with her unlike any other person (this is my 3rd marriage), and I feel very attached to her in the sense that if anything were to happen to her, I would be upset. I definitely need her more than I've ever needed anyone, and I trust her much more than I trust anyone else, other than my kids (we each have two kids from previous marriages).\n\n**But, shit: I think I lack empathy**. This is a week or more of wrestling with this. My therapist helped me describe it as this bubble that I occupy, and that everyone else occupies NOT their own bubble, but a shared bubble that I'm not in. And this sensation feels a little like light or cracks coming thru my bubble for just a moment. \n\nThis is really upsetting. I'm compassionate, but I think I actually engage in compassionate acts without feeling the emotion behind it, because I \"know\" \"logically\" that behaving with compassion is what you do with the people you \"love.\" When my father had serious surgery a few years ago, I took it upon myself (and enjoyed) calling him every day to give him company, hear him vent, and just be there for him. At the same time, I will avoid calling my parents if I'm just not feeling up to it, and I will have no remorse about it and even though I know they want to hear from me, I just \"don't care enough\" to do it until I'm ready. That's just one example.\n\nHere's what's driving me to post: have you found that you are capable of developing real, \"felt\" empathy? Are these glimmers just a reminder of what I can't really access, or is there a way for me to develop true empathy as a middle aged adult? Do I just lock into compassionate behavior and hope for the best? Is there another way to get there?\n\nI asked my partner, \"if it turns out I do lack empathy, would that be a problem?\" and she says that she knows me enough to know I love her regardless, and that was a conversation that gave me permission to keep exploring this idea. \n\nAnd now that I'm in the \"now that I think about it\" stage...I can turn off from a person/friend QUICK. once my 2nd marriage ended (we had no kids), it was SUPER EASY for me to just never speak to or think about her again (she made some bad attempts to get back in touch, but I didn't feel any emotion at all about ignoring them). I do find that I like some people more than others, but I don't feel an emotional connection to them -- to anyone, I don't think. To my kids, yes -- like, I get physically and emotionally unstable if I have reason to worry about them. \n\nSo here I am, a 50+ year old grown ass man with a job and a family, asking what does empathy feel like and can I ever feel it or does it even matter.",
        "created_utc": 1670442437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t stop shaming myself",
        "author": "HereToStayThisTime",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zf8g89/cant_stop_shaming_myself/",
        "text": "I can’t stop criticizing and shaming myself for having my safe foods and movies etc. All my life, growing up, I was relentlessly criticized by literally everyone for always eating the same food or liking the same movies, etc. Especially food. I was told I was boring or scared or childish, or close minded for not wanting to try new things. Now that I understand these are my safe places I’m trying to stop bullying myself but it’s so difficult. I don’t like to share parts of myself with people, I don’t tell my favourite movies or music or drinks because I don’t want judgement. When I look at myself I use language like “pathetic” and “cowardly” even though I know it’s not true and I’ve never felt this at about other people who have favourite things. I don’t share my interests. I don’t let people get to know me. I can’t afford therapy but I know I need it. I’m wondering if others are struggling with this as well and if you’ve been able to work through it.",
        "created_utc": 1670436209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music, emotion and cognition",
        "author": "muddokippers",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zf7b5u/music_emotion_and_cognition/",
        "text": "Hey guys, I’m an Autistic researcher hoping to become an Educational Psychologist. I'm currently researching the positive effects mood-matching music can have on Autistic people and was wondering if anybody (ages 18-65) would like to participate? It’s a quick 15-minute max interactive survey you can withdraw from any time.\n\nHere's the survey if you want to check it out:\n\n https://mdxl.eu.qualtrics.com/jfe/form/SV\\_3xvW3l431tL9lVY \n\nYour participation could give really valuable information about what the Autistic community is like rather than what is portrayed in academics/ media. Your feedback would also inform our understanding of different cognitive styles. Thanks so much for your time, and have a great day! :)",
        "created_utc": 1670433928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why exactly does life need to be so hard?",
        "author": "cherrryghost",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zf46h3/why_exactly_does_life_need_to_be_so_hard/",
        "text": "I feel like I’ve always accepted that life is hard, but recently I’ve been really struggling with this idea. Of late I decided that it makes sense that some aspects of life can/should be challenging, but i find myself thinking, “shouldn’t some things be easier? like to balance it out.”\nI’m 33 and I had my “holy shit I’m autistic” moment earlier this year. The first person I told I’ve known since I was 17 and has always been a mentor/older sibling kind of friend. He responded, without pause, “yeah I know… didn’t you already know that?”\nAnyway, to get to the reason for my post I’ve always survived with wicked routine and structure. At the daycare I went to we ate the same thing for lunch everyday, in the same order (sandwich, lays potato chips, two chewy chips-ahoy cookies, and a glass of kool-aid) for like 7 years. I every-other-week-ed between divorced parents from age 3 to 15. I had to make my bed every morning and ask to be excused at dinner. I didn’t realize it til years later, but the structure and predictability of that time would be something I would try to recreate week after week as an adult. \n\nLast year, I did all my household chores on Sundays. I just didn’t have the bandwidth to do much after work so I crammed it all into one day. Then I moved. And for the last six months I haven’t had plumbing. So laundry is now done at a laundry mat or my boss’s house. Dishes I try to do one load a week in the dishwasher at my office. Water jugs I typically fill every two weeks at one of those places. \n\nYesterday morning it was like 8° and my car wouldn’t start. And I just shut down. I think I officially reached a point where everything is difficult. Nothing is easy. Like the little things have all compounded to make this constant feeling of apathy/wtf/seriously?!/shut down. \n\n10° this morning and really trying to figure out what to do to make existing slightly less impossible. \n\nWhat do you do when your options are so limited and you just try to survive day to day?",
        "created_utc": 1670427559,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm seeing a specialist soon for the first time. I've been putting together a list of what I believe are my symptoms. Thoughts?",
        "author": "kerghan41",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zf3jkj/im_seeing_a_specialist_soon_for_the_first_time/",
        "text": "Some background, I am a 36 year old male. I've never seen a therapist, counselor, or anything. I'm hoping to get diagnosed or at least a professional's opinion. I don't need assistance or anything like that... but I've always felt different and would LOVE to know why.\n\n\n* Eye Contact - Have always had trouble making eye contact... with anyone. Even my closest family members. I can force myself to do it with people close to me (All 6 of them), but that's it. Eye contact with a stranger is extremely difficult. \n* Posture - Have been told that I stand awkwardly. Always stand in an 'L' shape with my feet. Made a post about this the other day.\n* Motor Skills - Had very poor coordination as a kid. Has gotten slightly better as an adult, but still subpar. Also have extreme trouble trying to mimic movements such as dancing or exercise routines. I was picked last every time in gym. \n* Outsider - Have always felt like an outsider my entire life. Every once and a while I would have one, maybe two, friends who were large extroverts. I would attach myself to them and be introduced to a few other people. This allowed me to have a small grouping of friends in school. Since adulthood however my list of friends has shrunk to one. \n* Bullying - Throughout school the bullying was intense. Physically attacked, spit on, punched, kicked, etc. It was because of this that I grew obsessed with body building. (Gained 70 pounds in a year and a half) \n* Speech/Hearing - I had multiple ear infections and surgeries as a child. I was in speech therapy from kindergarten to sixth grade where I decided to quit against their recommendations. (It was singling me out for bullying even more.) I am very well read but today I still don't know how to pronounce a lot of words so I just avoid them at all costs. Along with that I have the hardest time hearing ANYTHING if there is a lot of noise going on. Everything just blends together into one loud roar. I can't make out any sounds or anything that people are saying. Because of this I try to avoid those areas as much as possible. If I am at a work function with a large group of people I usually don't say anything and just sit in the back as far away from the noise as I can. I also tell people that I'm deaf in one ear as it makes them speak louder and clearer and I can then begin to hear them above the roar.\n* Special Interests - My interests have changed over the years. In childhood it was video games, reading, and drawing. I would create very complex custom scenario maps in RTS games. I would build elaborate towns with Legos or Lincoln Logs. I've always been fascinated with horror and was reading King books in 5th grade. I've been obsessed with fitness and weights since I was teenager and keep up on it today. Today though I would say my special interest is my career. I've spent almost twenty years in the same industry specializing in business intelligence, sales operations, and digital landscape. I don't believe there is anyone else in the industry who has my experience/knowledge. Because of this I am paid VERY well. (Over $200k). Also, not the most relevant, but my nickname at work is 'Rain Man.' I love building complex formulas in Excel, VBA, or SQL. \n* Special Interests (2) - There was a time a few years back where I was obsessed with writing novels. It's practically all I did. I wrote 5 novels and multiple short stories in the span of 12 months.\n* Special Interests (3) - I documented every possible detail I could on the various types of refrigerants used throughout the world. I went back in time, modern day, and future. I created a blog for this and exceeded over 1 million written words and 500 published articles. The site today is referenced in Wikipedia and in US Senate legislation. The site brought in a revenue of over $1 million dollars. I sold it last year due to a divorce.\n* Special Interests (4) - I've been playing the same video game for almost twenty years now. (DOTA). It's mostly all that I play. I watch the same shows and movies over and over again and listen to the same songs on repeat every day.\nDivorce - My wife of 14 years left me because I had no passion, no empathy, and was cold and emotionless. This is what led me on the path of thinking that I have autism.\n* Stimming - I never really noticed stereotypical stimming in my part. None of the hand flapping but I do obsessively bounce my leg/knees especially when I am in unfamiliar territory. I also pace quickly back and forth in unfamiliar places. Along with that I am constantly clearing my throat or making other 'throat' noises. No idea why I do this and don't know if this counts as stimming. \n* Scripts - To get as far as I have in my career I have developed social scripts that I used every day when engaging with co-workers. I have honed these over the 20 years in my career where they are almost automatic... but I have to remember not to say my reply too fast or else I'm looked at as strange. \n* Scripts (2) - I had ALWAYS struggled making small talk and getting to know people. I read in a book years back to use the 'FORD' acronym to get to know people. First ask about their family. While they are talking look for areas that you can identify that are similar to yours or that you can relate to. Expand conversation from there. If family doesn't work then move to Occupation. What line of work? Can you begin a conversation off of it? If not occupation then try Recreation. Same approach. Lastly, 'Dreams' is the last option. I honestly haven't had this fail on me yet. Talking about the weather always ends up in a dead end so I try to avoid it.",
        "created_utc": 1670426032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noise cancelling headphones and flappy ears - tips needed",
        "author": "mlemcat11",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zf102r/noise_cancelling_headphones_and_flappy_ears_tips/",
        "text": "Hi everyone, actually autistic 38 year female here, on the road to diagnosis. \nSo, my sensitivity to noise is getting worse lately, especially since I had surgery a few weeks ago, and all my spoons seem to be constantly depleted. I couldn’t even handle my partner typing on his keyboard today, it’s gotten that bad.\nI have loops, and those foam thingies for in the ears, but am considering noise cancelling headphones to sometimes truly hear nothing. Only issue; I have flappy ears, and having them bent back against my head at some point always hurts. In winter I just let my ears freeze rather than wear something over them even.\nAnyone have tips for a brand I could look into, or are there headphones that fully cover the ear, instead of push it back, sort of? Thank you in advance!!",
        "created_utc": 1670419290,
        "upvote_ratio": 1.0
    },
    {
        "title": "dx without a formal assessment?",
        "author": "Repulsive_Comedian_9",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zf0jm5/dx_without_a_formal_assessment/",
        "text": "i brought up autism to my therapist a bit ago, and the past couple weeks i've shared tons of info and stories relating to traits and difficulties. they've never doubted me, and suggested thinking about a diagnosis from the beginning. most recently, they said they'll need to ask a few more clarifying/childhood questions and they'll be able to type up a diagnostic report. \n\ni didn't know that was possible without the long and expensive process lol. we talked about school accommodations a bit and what a dx would help with. does a diagnosis from observation hold the same weight as a formal assessment? they do specialize in neurodiversity, i just haven't heard that many similar stories. \n\nthere's still a nagging doubt that i'm not officially autistic because they haven't outright said it haha. i was also recommended Unmasking Autism, which i've heard a lot about so i'm excited to start that.\n\npretty much DAE? if it can be used for school purposes it seems good to me.",
        "created_utc": 1670417956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this autism?",
        "author": "NoAssistant1829",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zeug9n/is_this_autism/",
        "text": "\nFor context: I already have ADHD and am regardless getting tested for autism in a couple of months to rule it out. Also because adhd and autism often occur together and have overlap.\n\nRather than list all the reasons I’m sure I’m autistic, I’d like to discuss the reasons I think I may not be autistic and see if I could still qualify for autism regardless. (Even though I’ll know soon enough anyway I want second opinions here)\n\n1.) socialization \nI have always been socially weird for one reason or another so I don’t doubt the fact I probably have defects in how I socialize (more prominent as a child) but eventually matured enough to behave socially appropriately, for the most part. \nHowever I don’t recall ever struggling with these things \n\n- eye contact (I instinctively look at others eyes or more specifically the bridge of their nose but never once found it uncomfortable to look into the eyes)\n\n- and reading others. In fact I have the opposite problem, I read people too well, to the point it was an ongoing joke that I could predict the future based on how well I read situations. I can’t tell if this still counts as autism though because I figured out why I’m so good at it recently. First I’m always obsessively people watching and  listening in on others or examining them I always have done that. Second, I picked up patterns in people even as a child from watching and analyzing people. In general this lead me to be able to tell when social situations weren’t gonna end well for others.  I can also often tell when others are hiding things from me, even if they think I don’t know, and even at points I can analyze people’s behaviors and emotions better than they can. In fact at points friends have joked I should be a therapist because of that. Adding to this I am sometimes almost too logical when analyzing others, and put logic above emotions. Also if it means anything I love writing realistic character driven stories, so often I do a lot of research on emotions and how others behave for my writing, and even in school for certain courses.\n\n- understanding social rules but still failing to follow them?\nIf someone asked me for advice on social situations I could perfectly tell them exactly and mostly correctly what to do, but if someone asked me to follow my own advice i’d probably fail.\n\n- facial expressions \nI don’t think there’s an autistic look but I know I have normal facial expression for the most part that I can tell. \n\n\n2.) anxiety/emotions \n\n- Well technically not a required symptom of autism most autistics have some form of high emotions or anxiety. Me not so much. I have good self confidence and don’t particularly care if I fit in so long as I don’t hurt anyone. I usually feel things less than others. I’m not overly emotional like at all? I Almost never cry, for emotional reasons, and honestly very little gets to me. I do experience high energy and happiness, and I do eventually have emotional outbursts, but I don’t often panic, or outwardly express my emotions. Some autistics feel too emotional and are called ‘sensitive’. Very unlike me, I feel cold hearted sometimes, because I don’t feel very high negative emotions most times, and if someone comes to me with emotional problems my gut instinct is to usually give them advice to fix their problems rather than comfort them. Ironically my diagnosed autistic girlfriend told me the way I give her advice instead of comforting her upsets her.\n\n \n\n  That’s it.\nThanks for coming to my Ted talk opinions welcome.",
        "created_utc": 1670395835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impending doom and hopelessness",
        "author": "kokoakrunch",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zeso1m/impending_doom_and_hopelessness/",
        "text": "No matter what everyone says and how much they warn you, there is just absolutely zero way to prepare you for just how fucking lonely this all is. I follow this thread often, trying to continue research on myself. I heavily suspect that I am on the spectrum. I believe self diagnosing is valid, I’m just the type of person that wouldn’t be able to accept it about myself unless it’s out on paper proven to me. I’d doubt myself too much otherwise. (Ironic since much of evaluations don’t truly speak from a neurodivergent person’s perspective but based off neurotypical observation). It gets really, really rough on this journey to figure out why I just can’t function. It’s so exhausting knowing that I want the confirmation, yet from an internal ableist view of myself, I would be in so much denial at the same time. I don’t even know what I want anymore. I don’t know if a professional diagnosis would truly benefit me, and I’m so scared that I won’t be able to answer anything truthfully and “miss my chance”. I’d feel too discouraged to try again or find another place, spend all that time and money even when I know testers can be wrong sometimes.\n\nI’m at a point where I sort of know already. But there’s so many days where I’ve masked myself so well that I just start to doubt myself. What if the neurotypical Frankenstein that I’ve become is really my personality? I’ve changed so much of myself that people think nothing’s wrong, and if that’s true maybe that’s just who I am. Maybe it’s just the depression that makes me tired, or the anxiety that makes me premeditate everything, or the trauma that gives me all the sensory issues.\n\nIt gets to my head so bad trying to do something for myself, trying to understand myself because no one else wanted to, that I just want to give up sometimes. It’s exhausting when no one sees you when you’re a kid and having to pick up the pieces yourself.",
        "created_utc": 1670389589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autistic?",
        "author": "Washingtonbones",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zepq4h/autistic/",
        "text": "My partner says I could possibly autistic and he's no expert but their sister does have autism and is no doubt informed on it. I remember being a kid and having a t-rex arms as a kid and having some traits from what ive heard, for me i also get sudden energy and do odd moments which ive heard could be stimming?, I've always been quite and have struggled to make friends due to being different and non social, but also do well in school (mainly reading). I have gone through therapy for my mental illness which is presumed to be MDD. Being mentally ill could be why my partner or some may think I have autism/ autistic traits. I've been doing research on getting an evaluation but my parents despise it and try to deny I have anything( especially autism). Besides going through with maybe more on a diagnosis I'm not sure how I should approach this. I don't know if I'm autistic and it's confusing to me.",
        "created_utc": 1670380463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, it's official.",
        "author": "Lanky-Beyond-6767",
        "url": "/r/AutisticAdults/comments/zenbcx/well_its_official/",
        "text": "",
        "created_utc": 1670373462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disability applications woes",
        "author": "wocket-in-my-pocket",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zejudr/disability_applications_woes/",
        "text": "Completing a disability application feels like it broke me a little bit. The problem isn’t that I have to apply, I get that I’m in need and I accept that. It’s just…I work so hard not to fall into self-doubt and anger over my past, but seeing it all laid out on paper feels horrible. You can track my decline from successful kid with visible potential for a thriving future to someone barely holding a part-time job, unable to live independently.\n\nThe application itself wasn’t unkind, just your standard bureaucratic paperwork, but the more I filled out the worse I felt. Seeing the traits that hurt me most laid out so bluntly with no way to qualify them with the “good parts” of autism or the ways I’ve worked to improve—social issues, rigidity requiring extreme workplace accommodations, sensory issues, lifelong disability—hurt. I’m lonely, I’m scared, I’m in pain, and this is going to be a part of me forever. I feel sick. I just want to stay in bed for the rest of the day and cry.",
        "created_utc": 1670364929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you mimick things you hear and see!?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zeishb/do_you_mimick_things_you_hear_and_see/",
        "text": "Hey 18 male ( Not diagnosed, Suspect ASD ) Im a chameleon I think. 3 months ago I saw a video about autistic kids and one kid was pounding his chest like a gorilla and I thought that was pretty silly. A month later out of nowhere I started pounding my chest as well. I do it when Im in a good mood, and feels good on my chest 🙉 about two weeks ago I heard this phrase \"You better lawyer up asshole!\" ( In a country voice ) I found it funny and catchy, I've been saying it ever since, normally when im in a good mood ( I've always mimicked funny phrases since I was a kid ). I also started making noises like the clown from \"emily wants to play\" a horror game. I was wondering if you guys mimick things as well, is it a feature on the spectrum!?",
        "created_utc": 1670362443,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's really hard for me and I don't know what to do",
        "author": "cattocrackers",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zeid2g/its_really_hard_for_me_and_i_dont_know_what_to_do/",
        "text": "For my whole life I had social struggles ( always left out, constant bullying, etc. ) and my parents weren't really there for me either because they always told me to just go through with life and school which was terrible advice looking at it from now... Luckily, my brother was always filming me as a child since I have no memory of me even though I'm still in school. I recently started digging deeper into autism because mental health and psychology are one of my favorite interests and found out that I relate to a lot of symptoms and have a lot of proof ( videos from my brother ) showing that I always had symptoms, which I realized just now. The last three days was nothing but searching for information and doing test and trying to connect with the community. I finally come to the conclusion that I might be autistic, which has helped me understand a lot of my past. I was happy to finally get an answer to my questions until I found out about masking. I have a hard time describing how I feel because I usually have a picture of my \"mental state\" / feelings in my head. My whole life, I've been unknowingly masking and wondering why I always felt so disassociated from myself. After looking into the negative effects of masking, a lot more than I liked to admit became clearer. The constant anxiety, stress, exhaustion and my loss of identity was explained. I talked with my parents about the possibilities today and about my social struggles as well my mental and school ones. I was never confronted with this much ignorance. My parents were constantly saying that kids my age were the same and that they never saw signs. Didn't event want to listen to half of the evidence, but at least agreeing to see a psychologist. They completely disregarded my difficulties I face every day and told me to just get through school and now is the time to learn and not to worry about his stuff. I feel my situation getting worse, and I don't know what to do...\n\nP.S I live in Germany",
        "created_utc": 1670361435,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m bad at fast paced video games. Is it just me?",
        "author": "dillthepill",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zei3ut/im_bad_at_fast_paced_video_games_is_it_just_me/",
        "text": "I play enough video games that you think I’d be better at them. But I seem to have a skill ceiling that is what it is. What I can’t do is take in all the sensory input, process it, and quickly map my reaction to lots of button actions.\n\nLet’s take the most recent God of War. I was able to do the main story on default difficulty. It was challenging for me. No way on the optional boss fights. Also no way on advanced compact with lots of weapon switching and utilizing the full array of skills.\n\nI’m pretty sure that most people who sink as many hours as I do into it will play at a higher difficulty to have a challenge. A lot of games I need to play on the easy setting until well into the game and I’m over leveled. I always stick with a small move set. I always need to take the skill that increases parry/dodge timing. I dread games with “deep” combat because that is another way of saying lots of buttons and fast situational processing.\n\nI’m curious if this difficulty in processing and coordination is common with Autistics.",
        "created_utc": 1670360827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multi sensory museum",
        "author": "SizeOrganic6669",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zebojd/multi_sensory_museum/",
        "text": "[removed]",
        "created_utc": 1670345611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished testing, defeated, second guessing",
        "author": "Jtk2719",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zeb46p/just_finished_testing_defeated_second_guessing/",
        "text": "I finished testing this morning. I did three hours last week and two hours today with the dr, plus three packets at home. It was ALL test after test, exhausting and draining. I made sure I went with someone who could properly dx autism. I went in and instead worked with a dr still in his fellowship. He works under the main dr. I don’t know if this is ok. Will he have enough experience to dx an adult? I’m worried it will come back as negative and I’ll always wonder if he made a rookie mistake. I meet in two weeks for the results.",
        "created_utc": 1670344262,
        "upvote_ratio": 1.0
    },
    {
        "title": "The coffee machine scream...",
        "author": "lanternmaple2136",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ze71oh/the_coffee_machine_scream/",
        "text": "DAE hate hate hate the coffee machine scream when they froth milk? \n\nIt's just the worse sound in the world...\n\nI'm having to wait at he hospital for Reasons and forgot my headphones so my options are 1) warm coffee shop with The Scream TM or 2) Sit in my freezing but blessedly quiet car.",
        "created_utc": 1670333929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t use my mask any more. It broke.",
        "author": "MirrorInternational1",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ze6st0/i_cant_use_my_mask_any_more_it_broke/",
        "text": "I realised I’m trans a few months ago, and very soon after that have worked out that I’m autistic. I’m 33. \n\nThe realisation set in after a big psychological breakthrough. I had been exploring all this confusion I had about sexuality and intimacy, and suddenly all the cracks that had been slowly forming on the damn wall gave way and a huge amount of repressed emotion burst through.\n\nIt was like being reborn overnight, I felt like I had a ‘new brain’ in many respects, the way I was seeing the world and experiencing myself shifted dramatically. \n\nIt took me a while to sort through all the data and understand these feelings, but eventually I worked out that I’m trans. \n\nThe thing is, I know realise that it was my Autistic mask stopping me from realising I was trans, and it was making me act in this artificial (and wrong gender) way\n\nAnd it got pretty much smashed when the damn wall broke. It just doesn’t fit anymore. I’m not that person.\n\nIt’s very liberating but I also feel so naked and awkward, like a baby dear.\n\nI don’t really know what to do.",
        "created_utc": 1670333249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diagnosed yesterday, now what?",
        "author": "ljubenica2",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ze5fwz/diagnosed_yesterday_now_what/",
        "text": "Hi, is there a manual for autism here?",
        "created_utc": 1670329717,
        "upvote_ratio": 1.0
    },
    {
        "title": "DAE feel weird when you're ill?",
        "author": "TeaWellBrewed",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ze5b3v/dae_feel_weird_when_youre_ill/",
        "text": "I've got a bad cold. I'm sleeping poorly because of the coughing and I think this is part of the problem. \n\nEverything is too light and noisy and I feel less real and like I'm moving through an unreal place if I'm not at home. I don't think my words are doing this justice. \n\nWondered if anyone else had similar and if its autism related?",
        "created_utc": 1670329358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Despite its association with Autism esp Aspergers, why do so many NTs bad at non-verbal language?",
        "author": "EvaWolves",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/ze2qo8/despite_its_association_with_autism_esp_aspergers/",
        "text": "People with Asperger Syndrome are infamous for its unbelievable ability to understand someone's intent with something as simple as posing muscular arms to show they are threatening to beat you up. However one of the complains about modern society is how many young men are becoming socially inadequate in communication that subtle changes in tone of voice are difficult now.\n\nI mean so many men have difficulty for example looking for a female partner who is interested through gestures. Which makes me wonder if asperger is more prevalent in modern generations?\n\nAdding more to why as this- a lot of normal people have already been clinically diagnosed as NT. Yet they have so much difficculty reading body gestures, tone of voice, etc to learn indirect communication esp non-verbal.\n\nI mean plenty of neckbeardish people are classified as NT and no Aspie (even if nerdy subcultures do attract more autistic people than the general populace) is why I ask this.",
        "created_utc": 1670322206,
        "upvote_ratio": 1.0
    },
    {
        "title": "First step in diagnosis gone poorly. Looking for thoughts, advice, or anecdotes.",
        "author": "DommyUmami",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zds27m/first_step_in_diagnosis_gone_poorly_looking_for/",
        "text": "I (23F) have been looking into autism as a potential diagnosis for myself for over a month now and have posted here once before. I finally gained the courage to mention this to my therapist and she referred me to her colleague, an LPC. Her profile online states \"Uniquely, (Name) helps those with Autism/Aspergers\". Not a specialist, but somebody who has worked with this demographic for a fair amount of time. I saw her today for an hour.\n\nAlthough I am not surprised due to the amount of horror stories I had heard, I am still severely disappointed, confused, and exhausted even though the visit wasn't horrific like some of the stories I had heard. I really don't know where to start but I guess to give some background on the visit, it was very unstructured - no questionnaires, and started by asking me to tell her a bit about myself. The conclusion was that she thinks that I have \"quirks\" and tendencies, further suggesting that it may be more likely that I have OCD, ADHD, but the most likely just anxiety. I am already diagnosed with GAD, and have a mother who actually has OCD and know for certain I do not have this. (For more context, I am in school to become a licensed professional counselor). Furthermore, I had already discussed ADHD with my therapist and I am fairly certain this is not the case either. \n\nWhat really left a bad taste in my mouth was how much of what she said overlapped with the horror stories I had heard. The main one being that I was functioning too well basically (I can't remember the exact words) as I work 34 hours a week along with 3 grad school courses per semester - which I am not functioning well in emotionally. I had even asked where do you draw the line? Just because I'm not getting reprimanded at work or failing classes doesn't mean I am functioning well and plenty of people with autism do well in life. Everything felt incredibly surface level as I have been doing extensive research into this for the past month: reading books, reading articles, watching TedTalks, watching videos from autistic creators, etc. and learning about how difficult it is for women to get diagnosed. She never mentioned masking or asked if I did any compensatory behaviors, and really didn't ask further details about the examples I gave her. She also mentioned that my language was too colorful? So many of the autistic creators and advocates I had watched were not only successful, had colorful language, etc. all things that she deemed indicated I did not have autism. \n\nI just feel deflated, tired, and like an imposter. I was finally starting to come to terms that I may be autistic and was finding solace in the community but now I'm not sure how I feel. I understand that not everyone in the field is an expert but how could she advertise working with autistic individuals when it seems to me that she has very little knowledge. Towards the end of the visit she even brought out the DSM-5 to make sure she wasn't missing anything and due to the well known issues with the autism diagnosis in the DSM also put a bad taste in my mouth. I'm scared to tell my therapist how I feel because they're colleagues and I'm also afraid of the fact that I may be wrong and will just waste money, time, and energy if I try to pursue this further. \n\nSorry for the rant, I just don't really have anyone I can go to about this and feel so confused.  Any thoughts, advice, or personal anecdotes would be appreciated.",
        "created_utc": 1670293028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aspie with APD looking for friends to practice ASL with over video apps(AND other ASPIES TOO!)",
        "author": "tatorpole1",
        "url": "https://v.redd.it/8my624wkd64a1",
        "text": "",
        "created_utc": 1670287831,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the morning",
        "author": "Lanky-Beyond-6767",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zdpt8q/in_the_morning/",
        "text": "I have my asd evaluation and OMG OMG OMG OMG OMG I'm so nervous. Like, I'm autistic as frick, but I just can't suffer anymore disappointment this year! My neck and shoulders feel like stones because I'm so tense. I need to hear it from the psychologist or whatever they're called just for the sake of comfort. \n\nI have some notes compiled on my phone to help me keep my thoughts organized. I will also supply my results for the aq test and rrads as well. \n\nIn my mind I feel like it's very obvious that I'm autistic.  But in my heart I'm worried I'll be humiliated.\n\nOkay I'll not do the rambling thing. Y'all please wish me luck and send good vibes or pray for me. I'll take all the love I can get right now!",
        "created_utc": 1670287142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imposter Syndrome in Regards to Autism?",
        "author": "Thebig01984",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zdhfls/imposter_syndrome_in_regards_to_autism/",
        "text": "Does anyone ever feel an imposter syndrome when it comes to being autistic? Sometimes I feel that I’m “not autistic enough” so when I self-disclose then people don’t believe me. I’m very good at masking and have been able to segue my special interests into a career. I feel fortunate in this way but really get frustrated when people I self-disclose to want to dismiss my autism—which feels so much a part of myself (often in a positive way) that part of me feels rejected as well.",
        "created_utc": 1670269823,
        "upvote_ratio": 1.0
    },
    {
        "title": "With this results should I go an have a proper diagnosis?",
        "author": "YakkeMC",
        "url": "https://i.redd.it/8848uge8v54a1.jpg",
        "text": "",
        "created_utc": 1670263602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quentin Coldwater’s Brain is Sideways",
        "author": "NotKerisVeturia",
        "url": "https://aureliaundertheradar.wordpress.com/2022/12/02/quentin-coldwaters-brain-is-sideways/",
        "text": "",
        "created_utc": 1670252464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you guys had your friends/ family take the RAADS-R?",
        "author": "deerwithwings",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zd79ik/have_you_guys_had_your_friends_family_take_the/",
        "text": "In short, I wanted to know weather I got a score higher than my social circle, which is made up of rather nerdy, introverted, anxious people. Also I heard NTs get very low scores in this test.\n\nResults: I got 161, while most my friends that didn't think are autistic got around 100-130.\n\nTwo diagnosed friends did the test. One got around 100 the other got 200\n\nSome people talked of how it felt it was anxiety that made them relate to social aspects. Some were about being Black and people telling them they're rude for being themselves. For some it was ADHD. \n\nAnyway it's interesting. Bc the test infos say above 60 there are grounds to be investigating autism but also some autistic people score lower. \n\nAny thoughs or analysis of your experiences with the test?",
        "created_utc": 1670248313,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I’m Not Autistic What Could It Be?",
        "author": "usagibryan87",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zd6e8s/if_im_not_autistic_what_could_it_be/",
        "text": "My therapist does not think I'm autistic, just that I have anxiety. Her reasoning is that I \"wouldn't have gotten this far in life.\" I posted about this \\[here\\]([https://www.reddit.com/r/AutismTranslated/comments/zbjpu2/therapist\\_doesnt\\_think\\_im\\_autistic\\_because\\_of\\_how/](https://www.reddit.com/r/AutismTranslated/comments/zbjpu2/therapist_doesnt_think_im_autistic_because_of_how/)) and the consensus was that is ableist and that I should probably seek another therapist, which I may consider doing as much as find that task distressing, but in the meantime I also have to consider the possibility that I'm not on the spectrum. I was hoping for a diagnosis because it would have put my struggles into context. Here are some reasons why I thought I might be on the spectrum (I don't know how to get bullet points to work) and I could use some help coming up with leads for other theories:\n\n* As a kid I had trouble paying attention in class and they diagnosed me as having ADD, then they said \"no we were wrong he has OCD,\" then they wanted to test me for autism but my mom didn't go through with it because she didn't want me put on anymore meds. I had an IEP and was considered \"emotionally handicapped.\"\n* I'm positive I have OCD (I get the impulse to touch things then have to wash my hands after touching them, etc), but I also have an obsessive personality and like to deep dive into topics. I spent years teaching myself Japanese and have wasted hundreds of hours on Wikipedia. I had to learn how to stop obsessively talking about whatever subject I was interested at the time or risk boring people.\n* As a kid I preferred to be alone and rejected play with other kids, I was practically a hikikomori in my 20s.\n* I did not like to play outside or get dirty, I preferred indoor activities. I'm a Florida kid but I hate heat, the sun, sand, sweatting and getting wet. Other kids would get bored and want to do something else but I could just play Mario Kart by myself for hours. I still have nightmares about being pressured to \"just get in the pool\"\n* I did not show any emotion when opening gifts and hated being observed when opening gifts. I rarely smiled even if I was happy.\n* Other kids always seemed much more excitable, expressive and \"aware\" than me.\n* I am very unobservant, this was a problem in social situations and I had to train myself to pay more attention to other people. I had to train myself to look at people and nod, etc. I still miss subtext that other people have to tell me about afterwards. I have to be told things directly.\n* It's impossible for me to focus sometimes, I struggled in school and could not pay attention to lectures. I zone out and my mind wanders when people talk to me (I hate that I do that and I know it's rude but I can't help it)\n* I like things the way I like them (this is my spot on the couch) and get upset if this gets disrupted, I had to learn how to cope with that because it's not socially acceptable to be that rigid, it's still distressing though\n* I hate last minute changes to plans, or last minute social events (\"hey we're all at the mall drop what you're doing and come join us RIGHT NOW\") it messes up my whole day, sometimes my week, but sometimes I don't have a choice as these are social obligations and I have limited excuses.\n* I hate lying, it's very uncomfortable for me. I cannot play games that involve bluffing.\n* 'm clumsy, I don't always look at things I interact with, I am bad at estimating my strength and reach. I've always hated sports but even when I was forced to attempt my peers were baffled at how bad I was.\n* I am strongly emotionally affected by the sensations in my own body, if I feel dirty, if skin is exposed and air is blowing on it, if I have the slightest stomachache. I can't handle sweat and I hate my body hair (not just the way it looks but how it feels too).\n* I HATE that stores don't put prices on things or does stuff like (by 3 for $10), other people think I'm nuts for caring so much. I hate it when people treat rules like guidelines or do things that don't make sense, then get upset at me for not making sense (you said 4PM not \"around\" 4PM, it's 4:10PM, you're 10 minutes late, etc).\n* I like to organize information into spreadsheets (thank you Google Suite), including fun things like movies I've seen, but this is also how I approach my job and people here are \"impressed\" by this which tells me it's probably not normal even for techs.\n* I can't multi-task to save my life\n* My memory is garbage and I need to write everything down, I have tons of notes and lists.\n\nLastly, and this is the biggest issue I have right now at this point at my life, all the other things either went away or I can cope with now... I need structure and can't focus if there is a lot happening in my environment. Strong smells make me sick, loud noises make me anxious, if someone is talking to me and I hear another voice whether it's a TV, music or people in the room talking, I hear NOTHING. I can't read anything if someone is talking to me. If my walkie goes off and there is chatter I have to stop what I'm doing and wait until the chatter stops before I can continue my task. I prefer to follow a rigid sequence of steps to solve problems and in a perfect world users would submit tickets and follow instructions, but they prefer to stop me in the hall, call me on the walkie (supposed to be only for emergencies), knock on my door, and they don't want to follow troubleshooting steps or procedure they're prefer I go to their noisy smelly classroom room and try to solve their problem amidst the chaos, or try to keep talking to me while I'm trying to think. It feels like other people have this super power where sounds, voices and other sensations in their environment don't affect them and they can adapt easily and multitask. I can't, my brain is like a train and any distractions, interruptions to the routine or intrusive sounds and smells derails the train and it takes a while to get it back on track, and I can't do that if someone is talking. This is affecting me very negatively at my place of work, not that I can't do my job I just hate it so much and it's giving me anxiety.\n\nWithout an autism diagnosis I feel like this is just a laundry list of issues. Is it possible have OCD, ADD, Executive Dysfunction, social anxiety, sensory processing disorder and bad propioception all at the same time? Can these things just be personality traits like introversion? Does it have to be debilitating to be a diagnosis? Please tell me if there is a better subreddit to post this.",
        "created_utc": 1670245831,
        "upvote_ratio": 1.0
    },
    {
        "title": "And yet I still highly question whether I am or not every day",
        "author": "monkeyluvrxoxo",
        "url": "https://i.redd.it/81x7chdkh34a1.png",
        "text": "",
        "created_utc": 1670234793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleeping/hiding in odd places",
        "author": "monkeyluvrxoxo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zd2ui8/sleepinghiding_in_odd_places/",
        "text": "Hellooo I am back yet again to dissect my life long behaviors. Today is special because it's one of the only things I can remember doing as a kid. \n\nSo, when I was younger, and my parents have confirmed this as a behaviour of mine, I would sleep in very strange, seemingly uncomfortable spots. The most common I remember would be on one very narrow step on the staircase at our old house. I would barely be able to fit on it but as soon as I did, I could sleep comfortably. I also remember sleeping on the hardwood *underneath* my old trundle bed, with the roll out bed part pulled in after me to kind of 'trap' me. When I got a bit older and we moved, I would sometimes hide in my closet in the dark and watch shows. Sometimes under my desk as well. Or I would sit on the really hard floor in the middle of the hallway for hours on end because I liked the heat from the vent. \nI also have a very bad habit of falling asleep in concerts. Like.. every concert I've been to, even for artists I really like or ones with very loud energetic music. \n\nThese memories just flooded back so I'm wondering if any of y'all do this, if it could be connected to autism or if it's \"normal\" behaviour? Thanks!",
        "created_utc": 1670234463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Princess and the Pea?",
        "author": "SmokyBaconCrisps4Eva",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zd0guh/princess_and_the_pea/",
        "text": "I've masked all my life (largely due to childhood trauma) , so successfully, that I don't actually know how to unmask. \n\nI'm not on social media but I do have reddit and one other message thing I read\n Even then, I'm masking. \n\nSo this is my attempt at starting to unmask. \n I'm terrified. \n\nI wondered if anyone shared my weird sleep hygiene /bed issue. I **need** the blankets all to be straightened out and nice/uncrinkled. I make it so nice and neat, then slide under them like a bed ninja - they have barely move. .\n\n I don't move a lot in my sleep and wake-up to turn (for unrelated reasons), so I could get out of bed and you would barely know it just been slept in. \n\nIt's become more apparent over the years, especially my husband noticing these things. He's the only person who sees me unmasked and it's taken almost 15 years.... \n\nIt's 8am here and he's just got up for work. I've just got up to remake the whole bed perfectly. It's all straightened out nice. I then get back in all smug and comfortable. \n\nAs I get back in, the feeling of peace and harmony once its all nicely made. Its so.... Comforting. The cat comes up and sleeps with me so his blanket is prepped beside me, ready waiting for him. \n\nIt's winter and we have layers of blankets so I have to straighten them all out, there can't be any hidden folds/wrinkles or disharmony at all. \n\nPlease don't judge me for being in bed, I've been awake all night /yet to sleep. \n\nMy husband finds it endearing and is my biggest supporter. If he's messing around, he will turn a corner over and watch me squirm. He does fix it 😂, but it's so compelling. I HAVE to fix it. When he's asleep beside me, I still try to keep my side as near and beautiful as it can be. \n\nI just wondered if this was potentially autism related, or perhaps OCD (diagnosed). Does anyone wise have this strange compulsion, and take do much comfort from a perfectly straightened bed? \n\nTLDR - Princess and the pea book. That's me. Anyone else?",
        "created_utc": 1670226065,
        "upvote_ratio": 1.0
    },
    {
        "title": "book about developing social skills",
        "author": "gamerlololdude",
        "url": "https://docdro.id/kXF0KTz",
        "text": "",
        "created_utc": 1670208356,
        "upvote_ratio": 1.0
    },
    {
        "title": "inspirational quote about people with ASD",
        "author": "gamerlololdude",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcsshb/inspirational_quote_about_people_with_asd/",
        "text": "\"People with ASD bring unique perspectives and different ways of thinking to the workplace. These strengths can often include extraordinary concentration capabilities, exceptional attention to detail, excellent problem-solving skills and ability to ‘think outside the box’, exceptional memory, specialized skills or interests, heightened abilities in logical reasoning and pattern recognition, reliability and honesty, and ability to excel in tasks that involve a high degree of precision and repetition.\"\n\n[https://docdro.id/Jja6iJr](https://docdro.id/Jja6iJr)",
        "created_utc": 1670204084,
        "upvote_ratio": 1.0
    },
    {
        "title": "no clue why this made me laugh i literally couldve said that",
        "author": "she-they",
        "url": "https://i.redd.it/cxlpjj01ex3a1.jpg",
        "text": "",
        "created_utc": 1670203399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overthinking",
        "author": "michelfmc30",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcsf1v/overthinking/",
        "text": "So I’m gonna tell a little story. I live in Canada and I will be moving to another province at the end of the month. I have everything planned: I will pack two big bags and call a taxi to take me to the airport. And then I was struck by a very specific fear: what I there are no baggage carts in the airport? I will travel by myself, I won’t be able to carry two big bags to the check in area by myself. Then I started to do a research to make sure the airport offered carts. I got the confirmation it did. What that a relief? Yes, for a minute. Another thought struck me. What if the airport will be too crowded and all carts being used? It will be the holidays. Many people travelling to see their families. So long story short, today I went to the airport just see if there were carts available. There were plenty, and now I feel stupid.",
        "created_utc": 1670203207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not referring to people by their names?",
        "author": "AikoHeiwa",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcrxbw/not_referring_to_people_by_their_names/",
        "text": "Just wondering if anyone else finds it incredibly difficult to use someone's name when either talking to them directly or just in conversation with them present?\n\nLike this is something I've noticed I avoid doing even before I began this whole journey of self-discovery and research. I'll almost always refer to others by their pronouns or just like more general terms like 'you'.\n\nIt just feels...I don't really know how to describe it properly...awkward and wrong to use people's names when they're present? That's the best way I can put it, really. And this isn't just in real world conversations, I'll even avoid using my friend's names (or online handles, in some cases) when chatting on Discord (using text chat because I don't like to voice chat because of vocal dysphoria).\n\nI can manage to refer to someone by name when talking to a third-party (and the person I'm talking about isn't present), but even then I prefer not to and really only do it when I absolutely *have* to (like if I need to see/talk to someone specific so I have to ask 'Where's Jane Smith \\[example name, obviously\\]?' to someone)\n\n(Amusingly enough, I actually like it when people refer to me by my chosen name - but that's probably because I'm trans and closeted and that gives me euphoria like 'Yes, others are using the name I chose for myself - I'm valid and my identity is valid too')",
        "created_utc": 1670202028,
        "upvote_ratio": 1.0
    },
    {
        "title": "This feels impossible",
        "author": "Even-Post-6004",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcr1wx/this_feels_impossible/",
        "text": "How do you guys who have been on the quest for years handle it? It's been like 2 months for me and I've already had it. It's constantly 1 step forward, 2 steps back. (vent incoming btw)\n\nLast time I made a post on here I was confused about the dsm requirement that the autism causes impairment in functioning and was trying to see how to find out whether that applied to me. I still haven't figured that out yet but that's not why I've returned. \n\nRecently I've been more heavily considering alternate diagnoses because I've had trouble determining whether I have some kind of impairment in functioning. I've about ruled out ocd, PTSD, and am almost sure it's not ADHD, but I've considered both generalized and social anxiety disorders.  \n\nLooking through the dsm criteria for both of those, I found things I was surprised by and things I wasn't surprised by. Of course, both require that the symptoms cause clinically significant impairment in functioning. For social anxiety, criteria (i) states that the symptoms aren't better explained by panic disorder, body dysmorphia, or, you guessed it, autism. Even better though is the fact that criteria (f) for generalized anxiety states that the disturbance is not better explained by another mental disorder and then in the examples lists social anxiety. I'm fairly sure I meet all of the criteria for all three with the possible exception of the one that requires significant impairment (and I guess that they're not better explained by each other), so basically I've gone from trying to differentiate between gifted with autism and gifted without autism to now trying to differentiate between gifted with autism vs gifted with social anxiety vs gifted with generalized anxiety vs gifted with both types of anxiety vs gifted with all three vs gifted with none of the three. That plus determining whether I'm impaired in some area of functioning to a degree of clinical significance and then determining whether it's my symptoms of social anxiety, generalized anxiety, autism, or some combination of the three feels impossible. It feels like I'll never find the answer to my question of \"why am I the way that I am\" or at this point, maybe not even \"what is the way that I am\". \n\nCan anyone relate or does anyone know where one would even begin to try to start this process? According to my math there are eight different possibilities as to what disorder/combination of disorders I could have and can't figure out whether I have any of the three independently, let alone considering how they relate to each other. I could of course just give up but that's easier said than done, I even spend time at school trying to figure out this whole thing. It's pretty much the only thing I'm able to think about nowadays and I can barely do anything at all without wondering \"is that autism\" or \"is that anxiety\" or worst of all \"is this all in my head/am I faking\". I don't think I can take much more of this, let alone years of it. Like I said, does anyone relate or does anyone have anything that might point me in the right direction or any direction for that matter? \n\nbtw ik this post was way vent-y and might seem pointless (and I'll admit it's very close to pointless but I did at least ask for advice) but I like to write out my thoughts so I can have them to read back over later, I can take this down at any point if necessary.",
        "created_utc": 1670199995,
        "upvote_ratio": 1.0
    },
    {
        "title": "unsure where to go from here",
        "author": "fairytaledamsel",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcox3z/unsure_where_to_go_from_here/",
        "text": "So I have taken every test, multiple times, I have read the DSM-5 requirements, I have asked family members and all the symptoms point towards there being a correlation here. I have been obsessing over the topic the last month and read Unmasking Autism. I relate to a lot of symptoms, and realized the things I had done to accommodate myself so far. \n\nBut I am 19 years old and my family thinks I have made it far enough and I am \"just fine\" and think there is no point in seeking out a psychiatrist. What should I do? Is it likely or should I just drop it?",
        "created_utc": 1670195052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Read 'Unmasking' and here I am",
        "author": "PlasticMix8573",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zco7lu/read_unmasking_and_here_i_am/",
        "text": "Joined an Zoom ND support group earlier this year.  We are reading *Unmasking.*  It suggested checking out this sub-reddit.  Here I am.  Probably lurk for awhile.  Self-diagnosed as being mildly on the spectrum.",
        "created_utc": 1670193450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keeping time",
        "author": "nessamonsterjr",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcn0ws/keeping_time/",
        "text": "Hello! This coming week at work they are asking us to keep time on the tasks that we do. I can't possibly remember to do this while also having to do all the other things that I do. I'm already overwhelmed just trying to figure out how I'm going to manage to remember to to do this. Anybody have any advice on an easy way to keep time?",
        "created_utc": 1670190889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books for parenting autistic baby/kid?",
        "author": "sammark99",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcm8wq/books_for_parenting_autistic_babykid/",
        "text": "Hello everyone! I’m (23f) pregnant and due aug 1, 2023 (woohoo!) and I’m looking for recommendations on parenting books on the (very likely) chance we have an autistic kid. Spouse (23m) is unofficially diagnosed autistic and I’m diagnosed ADHD but we suspect autism too, just isn’t anyone in my area that does autism assessments.\n\nSo anyways, I know there tons of books out there, but I specifically want ones that are recommended by autistic people. Don’t want to waste money on a shitty book or accidentally traumatize my kid by following a bad book. Thanks in advance!",
        "created_utc": 1670189198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else?",
        "author": "she-they",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcg036/anyone_else/",
        "text": "Does anyone else have this feeling you get sometimes that it's not the right time for you to do something in that moment (especially when you had planned something in your mind and now things have changed but you prepared yourself to a different time already) so you just don't do that? Such as I was able to prepare work earlier than expected and could drive to my dorm but I prepared myself mentally and physically to tomorrow so I can't make myself get up and go..",
        "created_utc": 1670175567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weighted blanket?",
        "author": "vract",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcf7px/weighted_blanket/",
        "text": "I’ve been reading about the benefits of weighted blankets and how they can really help people with autism. But there are so many options. Does anyone have recommendations on picking one? Or one that they really like? Any suggestions are much appreciated!\n\nI sleep hot, so I want to find one that isn’t warm. And I prefer one that’s either easy to wash or has a duvet cover. I’m also particular about texture and prefer cotton (I’m not sure how to describe the textures that bother me. They tend to be cheaper, synthetic materials). I also would prefer one that won’t slide off of me easily when I’m sleeping.",
        "created_utc": 1670173799,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm confused as a fish",
        "author": "speeds3",
        "url": "https://i.redd.it/6ha5few7yw3a1.png",
        "text": "",
        "created_utc": 1670173649,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is it for an entire family to be undiagnosed autistics?",
        "author": "mother-demeter",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcbiwj/how_common_is_it_for_an_entire_family_to_be/",
        "text": "I just finished reading *Unmasking Autism* and the degree and specificity to which it described so many things I've struggled with in life blew my mind. I recognize so many autistic traits within myself and, also, within my immediate family.\n\nNo one in my family is diagnosed, but we all struggle communicating and expressing emotion. I've been frustrated with my family in the past, wishing we would interact in the more \"normal\" ways I observed my friends' families interacting. Learning about autism has helped me feel a lot more empathy for myself and for my family in the unique ways we struggle. I feel like I am recontextualizing my entire life.\n\nHave any others have experienced one family member's diagnosis triggering a diagnosis for an entire family? How common it is for parents of autistic children to be masked/undiagnosed autistics themselves?",
        "created_utc": 1670165241,
        "upvote_ratio": 1.0
    },
    {
        "title": "it's been a month and i have things i need to get out of my head",
        "author": "blaurascon",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcamb4/its_been_a_month_and_i_have_things_i_need_to_get/",
        "text": "I'm sick and kinda fevery so I'm sorry if none of this makes sense, but I've been learning and progressing a lot the past few weeks and wanted to talk with yall about some of it. I really really value outside eyes on things because I tend to miss a lot of details that others end up catching\n\nI had my first couple appointments with my new psychiatrist (see em for depression management, old psych left the practice). Told her I want to get screened for autism. She isn't able to give me a formal screening or formal diagnosis but she agrees that I have a lot of the traits and that I might be \"high functioning autistic or Aspergers\" \n\nwhich leads to another point: she unfortunately seems to be running off of pretty outdated info with autism, and relying on autism speaks for a lot of info. And gives the vibes that it's something to be treated to get to a \"normal life\". Which is really unfortunate, but given autism / autistic adults aren't something she deals with regularly I can kinda understand. I sent her a few sites with better info and stuff to check out and she's been reading up on em.\n\nI've almost exhausted my local screening options; I found a place about 30min away that does adult screenings, but I'm nervous. I'm planning on contacting them after the holidays to see if they take my insurance. Alternatively there is a neuropsych dept in my local hospital, I think my psych might be able to get me a referral if I fully exhaust all other options \n\nHonestly running on self diagnosis for the past month has changed my outlook on life so much and just running with that that would be fine with me, but 1. I feel like my close family wouldn't agree unless I get a formal dx and 2. apparently there are local orgs that help folks with formal dx with looking for jobs and whatnot that line up better with how our brains work and I think I could benefit a lot from that service. \n\nBut like... realizing I'm autistic, keeping that in mind, trying to look at myself and my past through that lens, so much makes sense now. And I actually feel good about myself! I feel warm and like I want to care for myself now, there's so much new and exciting to learn! The future is uncertain but I actually actively want to be there for it now!\n\nIt's kinda turned into a hyperfocus / special interest. Learning about autism, looking at myself and things I do through that lens, looking back at when I was a little kid (or trying, those memories are old) and trying to see if I showed signs back then too. (The exam I had in like 2nd grade was just to see if I could be moved forward a grade apparently, not for autism or anything else)\n\nI want to be more open about my autism. Like, right now, I only really talk about it here on reddit and with like one other friend (who is also autistic, who noticed the traits in me, that i've been talking to about all this). Thankfully my online and offline lives are pretty separate; online I feel folks will be understanding, offline not so much. So I can kinda take things in stages as I'm comfortable. But it's still kinda scary.\n\nBut I'm also starting to notice more how folks not familiar with the spectrum treat us, and how outdated most folks' ideas of autistic folks are. It's... saddening? Uncomfortable? Like they see us as something broken that needs fixed, or something like that. Like an inconvenience. It's jarring going from neurodiverse spaces to largely neurotypical spaces. \n\nBut yeah I just really needed to get some things out of my head and onto paper (well, pixels). Sorry for the wall of text but I had Many Thoughts stuck in my head that wanted to get out. thank you all for everything ;o;!",
        "created_utc": 1670162977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Autistic or ADHD?",
        "author": "Sansette2076",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zcajmj/autistic_or_adhd/",
        "text": "So I have suspected that I am ADHD for the longest time. I have trouble focusing, I can’t stay still, I forget things so fast and my tasks alway multiply. I’m a standard definition of ADHD. \n\nRecently, I’ve suspected I might be autistic, and my one of my friends who really likes psychology has told me that she suspected I might have autism from as long as she can remember. I stimulate and fidget alot, which might be an adhd trait, If I don’t pay attention to my face, my parents will ask me ”what’s wrong” Because I apparently have this resting bitch face. I rarely react to things because I don’t understand them, i have memorized certain dialogue to say in certain situations, If I’m being scolded or am upset I go semi-nonverbal or nonverbal completely. Also certain sounds bother me and too much sound can overwhelm me. I also have strong special interests. Recently, I’ve had a dance performance all planned out and I had asked everyone to come and I rehearsed it to perfection, and I had a breakdown two days before because of the possibility of certain people not coming ( they did in the end), and I had a small panic attack when i messed up one of the dances badly ( I wore a mask onstage when I wasn’t supposed to because I didn’t have time to take it off, and the scarf I was using had gotten stuck on my foot) and UGH, all my special people I have invited saw that.\n\nBut for example, when I’m listening to music ( I listen to it all day in the background with my earbuds) sometimes my ears will just hurt and the music is very annoying, but I still listen because It‘ll be quiet if I don’t. Another scenario Is I love having an extremely repetitive schedule (not making it, having it) and I love making lists  (especially on Amazon) but the problem is I can’t follow my lists or schedules.   \n\n\nAlso sometimes I feel like I’m conciously swimming, and I’ve noticed the “gamer hands” more often ( think Skyrim and how you can see your characters hands). I don’t want to be one of those fake people on tik tok who purposefully stim.\n\n&amp;#x200B;\n\nAlso I kinda self diagnosed myself with both ADHD and autism but please please tell me if I’m wrong or how to tell someone I am self diagnosed…\n\n&amp;#x200B;\n\nsorry that’s a lot, thanks for reading this all",
        "created_utc": 1670162758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you have hyperfixations/special interests without being autistic?",
        "author": "Mission_Disaster7768",
        "url": "/r/autism/comments/zc8dst/can_you_have_hyperfixationsspecial_interests/",
        "text": "",
        "created_utc": 1670158019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walk in doctor suggested I get formally assessed",
        "author": "Little_beep",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zc3a8x/walk_in_doctor_suggested_i_get_formally_assessed/",
        "text": "I'm Afab 16. \nI just moved to where I am and have been going to a walk in doctor to manage medications because I don't gave another option. I've seen this doctor one time before this for an unrelated reason.\n\nI go into the office because I've been having increased sensory issues and I'm wanting to go up on my adhd meds. So I explain to him the issues I've been having with sensory and he asks me if I'm talked to my old phycatrist about possibly being on the spectrum. \nI have no issues with the idea of it, i have actually considered brining it up myself once I got a doctor but if this man is suspecting it within 10 minutes talking to be between both my appointments I'm second guessing if how I present myself is as nerotypical as I thought- I ready mask because there are things I do with my adhd that I have to make sure I don't do just out of the blue like facial expressions, tapping things, waving/shaking my hands, clicking my tongue, saying things(my therapist told me saying what's on my mind all the time was a adhd thing) and stuff like that. I've been trying to be really careful with that stuff because previously I was picked on for not being \"normal\" or rather doing annoying or rude things. And now I'm curious about but you all consider things that once your got diengnosed looked back and were like \"...well that explains that.\"\n\n(To be clear I'm not at all saying the thing I do are things that could say I'm on the spectrum these ate just things I do that I often mask that aren't \"nerotypocal\" I'm told and are likely from my adhd I'm told)\n\n(Ps I'm sorry about my terrible typing this is a new phone and my hands aren't used to where the buttons are and I type fast.)",
        "created_utc": 1670138042,
        "upvote_ratio": 1.0
    },
    {
        "title": "i hit my head a lot during a meltdown and now i have a bump on my forehead",
        "author": "bugfart123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zc12lv/i_hit_my_head_a_lot_during_a_meltdown_and_now_i/",
        "text": "and i'm freaking out lol\n\nbrethren please.... tell me of the times you've hit your head really bad and survived. i'm scared to sleep :')\n\nor just other times you really hurt yourself",
        "created_utc": 1670130290,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might be autistic… I think. Or maybe not. I‘m so confused.",
        "author": "YoSoyElContador",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbvls7/i_might_be_autistic_i_think_or_maybe_not_im_so/",
        "text": "Hey y‘all! First off I want to thank you all for sharing your experiences in this community! This has been very helpful so far. \nI (24m) am currently questioning my recent self-diagnosis of ASD. While there are sufficient clues that hint towards me being autistic, I feel very insecure about assuming the label of autism. I started thinking about the possibility of ASD after talking to a neuropsychiartrist about getting assessed for ADHD (which I‘m pretty sure I‘m having). After listening to my symptoms he told me that I‘m likely to be a, in his words, “high functioning autist“. After doing some research of my own, including countless self-assesments, I started to get more comfortable with the thought of me being autistic. The strongest indicators of ASD in me include\n\n* Stimming: heavy stimming sessions of running around the house when alone, and the stereotypical happy flapping, restless legs, making every object in my sight my toy, visual stimming, listening to music on repeat\n* Sensory difficulties: Sensitivity to high-pitched noises, sensitivity to light. Both can induce a lot of pin. I didn‘t eat veggies until adulthood and still avoid most of them for their texture\n* Social difficulties: difficulties finding freinds or talking to strangers (unless there is no way to avoid them), difficulties in dating, understanding sarcasm is a 50/50 chance, tendency to take things litterally\n* Some doctors and/or mental health professionals suggested that I probably have ADHD in childhood, but I was never properly assesed due to my mother and my pediatrician being sceptical toward Ritalin etc. My ergotherapist suggested I might have autism on a sub-clinical level, and one psychiartrist diagnosed me with „sensorimotor processing disorder“\n* Special interests: long-lasting fixations on trains, history, politics and other topics of interest which I love to infodump about\n* Posture: I‘m often told my posture is weird, as I have a tendency to tip-toe while walking and usually sit weirdly\n* Giftedness: despite of average grades I was always included in my schools programme for gifted kids.  I don‘t percieve myself as above-average intelligent, but I‘m certainly percieved as smart by some people for my above-average rethorical qualities and understanding of certain topics\n* Meltdowns: when something doesn‘t work the way I expect it to, or a plan I‘ve made is changed to my disliking, I can get uncontrollably angry and might destroy things, even things that are valuable to me.  I never get violent towards people and try to hide it in public\n* Shutdowns (?): I experience periods of being imcredibly tired sfter being overwhelmed where I just want to go home into my bed and cry / soothe myself. I don‘t go entirely nonverbal im these episodes, but I certainly prefer not to speak and need to be left alone\n* Repitition: I usually listen to the same music, watch the same shows, eat the same meals and buy the same items at the store. Whenever I find something new I like I feel like I add it to my collection of acceptable things. If I for instance need to eat something and nothing out of my collection is available, it will be difficult for me to pick something to eat\n\nThis and some high scores on the rdos Aspie Quiz (165 the fist and 134 the second time, while I tried to skim towards me being allistic the second time), the Autism Quotient (159) and some other tests were other indicators, and most of my freinds weren‘t surprised when I told them about my suspicions. Least surprised was my best freind from childhood whom I know for 22 years now. I then started to become more comfortable with things that I‘ve been embarassed to admit in the past, like sleeping with a plushie every night, using sunglasses in the morning, using stimming toys in public and buying a weighted blanket. This all improved my life to some degree, in combination with removing myself from overwhelming stimuli. However, there remain some reasons I hesitate to call myself autistic, which include:\n\n* I‘ve not yet been properly assessed for ASD. My psychiartrist evaluated me on an empirical basis (his brother is autistic). Although a lot of autistic people see self-diagnosis as valid I am still doubtful about that (regarding myself only)\n* I don‘t share a lot of the struggles other autistic people do. For instance, I have been excluded in school and was some kind of an outcast, but I was never bullied, at least not as severely as many other people whose experiences I‘ve read on this and other autism subs. I feel like while I do share a lot of the difficulties other autistic people do, they‘re not as severe as theirs and therefore I kind of feel like I don‘t struggle enough to call myself autistic. Also I‘ve managed to have one long time relationship in the past and have made myself a circle of great close freinds (although most of them are neurodivergent or at least present ND traits). I have experiences similar to meltdowns/shutdowns, but I don‘t think they‘re as severe as described in most ressources I‘ve found so far. I know everybody experiences autism differently, and that there certainly are more mild presentations of it, but me experiencing my symptoms not as severly as other autistic people makes me feel incredibly insecure\n* Impostor syndrome. I feel like since I‘ve learned that I might be autistic, my symptoms present way more severly as they did before. I‘ve already read a lot about this kind of impostor syndrome, and I know that this might be due to me being more aware to my symptoms and triggers, yet I can‘t shake off the feeling that I‘m faking or overexaggerating my symptoms, whyever I would be doing that\n* I can socialize. Not all the time, and way better when I‘m drunk, but I have some charisma and can talk very well, so I usually leave a good impression with people. This hasn‘t always been the case tho, and this is certainly something I learned or improved\n* I don‘t think I‘m masking, at least not intentionally. While I have a hard time with a large set of social norms, I have internalized them to the point where I can perform them naturally, at least a lot of them. My biggest goal in human interaction is to stay peaceful and not to offend anyone, but to also stay engaged in the conversation and be as interesting/funny as possible until my energy runs out. I don‘t feel like I have to monitor everything manually, although I certainly have to actively watch over certain things like oversharing, interrupting people or wether a joke is appropriate to the situation\n* Socializing with certain people actually gives me energy. Whenever I spend time with my closest freinds, I find myself to be more energetic than before. I just love spending time with them and will always go out of my way to do so\n* I usually excel at presentations. Whenever I‘m nervous, some kind of automatic mode takes over and I become this energetic, talkative person that tries their best to explain complex matters to anyone. While I don‘t particularly enjoy being the center of attention, I like holding a well prepared presentation and being rewarded for it with compliments / a good grade\n* I can suck up my sensory difficulties. Yes, it can be exhausting to do so, and allowing myself to retreat to a toilet stall to have a little breakdown has made it easier for me to return to a place with a particularly bad stimulus, like a loud noise. But still I read about so many autistic people who simply can‘t overcome their sensory triggers (I‘ve often read about the touch that can feel like a burning sensation). I certainly do have some sensory issues, but it seems to be easier to me to ignore them. Sometimes I only percieve a sensory trigger way after it started, and sometimes I can comcentrate on something else. I feel like this is not so typical for autistic people, but I might not be properly informed on this point\n* I struggle with routines. While I manage to manifest some routines, I sometimes skip them intentionally if I feel like it\n\nAll those things make me insecure about \nmy self-diagnlsis. I might be a little hard on myself and try to find things that don‘t fit, but having clarity about this has become very important to me. I feel like this label would help me to explain my difficulties and why I am the way I am. At the same time the last thing I want to do is to assume a label that just isn‘t made for me, exspecially regarding something as serious as a medical disgnosis. I guess the only real way to know is to wait for an assessment, but my wish for clarity about this topic remains strong. \n\nSince this is a very long text, I doubt that anyone will read this in its entirety. I’m sorry if this post is too long or doesn’t fit into this sub. I guess I just needed some place to articulate what has been going on inside of me for the last three months. But I would like to hear about the experiences of some people who were late diagnosed, maybe even with a mild presentation of autism / low support needs. I hope I didn‘t offend anyone with the contents of this post and wish the best to all of you! Also, sorry if my writing has been weird at some point in this text, I‘m not a native speaker. \n\nTl;dr: I have symptoms that imply autism but I remain doubtful wether I‘m autistic since I don‘t think I struggle as much as other autistic people. I would like to hear some experiences of other people who were diagnosed in adulthood and if they doubted themselves after learning they might be autistic.",
        "created_utc": 1670114072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay, so what's the deal with Santa and the Tooth Fairy (or whatever it is where you live if your region does stuff like that)?",
        "author": "Fickle-Nectarine-155",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbupxp/okay_so_whats_the_deal_with_santa_and_the_tooth/",
        "text": "I just for the life of me don't understand why allistics in my part of the world (who celebrate Christmas in the case of Santa) treat this as such a sacrosanct thing and what unspoken social purpose these things serve. For me, they just continue to instinctively feel like meaningless lies in need of correction for those who believe in them and I can't figure out why I'm supposed to keep a kid believing in them as long as possible. I can't buy, at least on a literal level, that it \"ruins their Christmas\", at least not for very long. To me, correct information is always positive.\n\nI stopped believing in both of these very young, before I even started school. My parents said that the Santa thing was over once I saw them one day putting gifts under the tree when I was maybe 3-4 and I called them out on lying to me. I went along with the Tooth Fairly a tad longer just for the money.\n\nOnce I started school, I was that kid who tried to convince everyone else that Santa didn't exist. No one would believe me because I wasn't very popular to begin with and also didn't hold the social clout that all of the adults who tried to keep it going did. Older kids and adults would get upset with me and get weirdly protective if I was telling their own sibling or someone else in their immediate family the truth about all of this.\n\nIs this some ritual like asking \"How are you?\" that has some kind of phatic, non-informative social purpose I'm not picking up on or just can't get the expected innate warm and fuzzies about?",
        "created_utc": 1670111702,
        "upvote_ratio": 1.0
    },
    {
        "title": "People think I’m giving them an attitude when I’m not :(",
        "author": "itsrainingbluekiwis",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbts2a/people_think_im_giving_them_an_attitude_when_im/",
        "text": "So some people think I answer them in a sharp way. Idk that just how I speak? I wouldn’t harm a fly and I mean no harm. I don’t mean to come across as rude. People think I’m in a bad mood or being mean to them? Especially at my job it’s frustrating….",
        "created_utc": 1670109215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone thinks I’m giving them an attitude when I’m not. I’m tired of this and it makes me want to hide :(",
        "author": "itsrainingbluekiwis",
        "url": "/r/AutismInWomen/comments/zbt9l5/everyone_thinks_im_giving_them_an_attitude_when/",
        "text": "",
        "created_utc": 1670108018,
        "upvote_ratio": 1.0
    },
    {
        "title": "So some people think I answer them in a sharp way. Idk that just how I speak? I wouldn’t harm a fly and I mean no harm. I don’t mean to come across as rude. People think I’m in a bad mood or being mean to them? Especially at my job it’s frustrating….",
        "author": "itsrainingbluekiwis",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbtaik/so_some_people_think_i_answer_them_in_a_sharp_way/",
        "text": "",
        "created_utc": 1670107973,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a relationship, what's your personal concept of quality time?",
        "author": "rawr4me",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbs13w/in_a_relationship_whats_your_personal_concept_of/",
        "text": "Imagine you're in a great stable long-term relationship that works well for you. Forget about practicalities and assume that however you would like to balance the time you spend with your partner and what that time is spent on is entirely up to you, your partner is receptive and they will be happy and fulfilled and secure no matter what you decide.\n\nWhat does your quality time and quality activities look like?",
        "created_utc": 1670104832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plz fill out my survey on autism spectrum disorder treatments for a school project",
        "author": "Hagenbd12",
        "url": "https://uofmississippi.qualtrics.com/jfe/form/SV_9XYtAhV51G2vvFA",
        "text": "",
        "created_utc": 1670097880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello. I would love to share my link with you. My name is Asher Grey and I vlog my experience as a transmasculine nonbinary Autistic person. 🖤 I hope it's ok to post here. Nice to meet you all.",
        "author": "Fluffy-Tumbleweed772",
        "url": "https://youtube.com/@ashergreyvlogs",
        "text": "",
        "created_utc": 1670096159,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought I never intentionally masked really, but I realized I actually might just use a different word to describe it! Does this sound like masking?",
        "author": "moody_fangirl_1966",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbniog/i_thought_i_never_intentionally_masked_really_but/",
        "text": "Basically, I thought “I never intentionally went, ‘let me just pretend to be normal’, so maybe I don’t mask.”\n\nMaybe I took it too literally.\n\nBecause, as it turns out, I *have* always done what I call “being on”. Essentially what I mean by that is when I am out and social, I feel like I have to perform- though not in the acting sense, but in the sense that I am under stress and often need to monitor myself to make sure that I am performing to standards.\n\nI have had this tendency for as long as I can remember, and always say that I am tired from being “on” - because for whatever reason it is emotionally and physically tiring. I never realized that perhaps other people don’t feel the pressure to be “on”, but like when I am at home I know I’m not “on”.\n\nAnyway I have just now realized that that seems to fit the description of masking quite well, but wanted to ask - does this sound like masking? Do you have the same experience?",
        "created_utc": 1670093663,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if I'm unconsciously faking autism",
        "author": "Ihavenolife0-0",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbm1xb/how_do_i_know_if_im_unconsciously_faking_autism/",
        "text": "For context, i have suspected being for example a sociopath/psychopath but it turned out to not be true since it was majorly just the \"not being able to read faces/emotions\"-part. \n\nLately I've been getting a lot of \"my experience as an autistic person\" and I relate to all of it. Well, most of it at least, there are of course individual traits and stuff like that. I've been looking into both it and adhd and I relate to pretty much everything? But at the same time I know myself well enough to realise that the \"symptoms\" I'm noticing might just be my brain making it all up. I know that this has happened before, for example i watched only like half of the first episode of Wednesday (Netflix) and talked similar to her the rest of the day, and it has been like that with characters i relate to for most of my life, when I was younger and had just watched a movie/film in English (non-native English here) I would speak English for the rest of the evening. Or at least i tried to but yeah i wasn't that good at English until a few years ago when i started watching YouTube more frequently and... Yeah, you get it. \n\nIf I have adhd then I've heard it counters a lot of autistic traits and stuff so that it wouldn't be as noticable, so that'd explain a lot. But in order to get an adhd diagnosis, then I'd have to present symptoms at the age of 6-12 years old, given I'm 14 at the moment would none of the symptoms I'm experiencing now count. But i cannot for the love of my life (which isn't much but it's a saying at least) remember a thing about how my life was at that point. I have always had bad memory and i can only remember feelings if i thought something specific about the feeling or expressed it verbally. Which wasn't that much. Plus due to trauma when i was around 8-9 years old(can't even remember that lmao) I actively try to not remember all of that, and since it is pretty much in the middle of that a lot other non-trauma related stuff comes with it.\n\nAnyways is it possible to gaslight yourself into actually changing your behaviour without meaning/wanting to?? \n(I also has a friend who probably is autistic and I don't want to seem rude or trying to be \"unique/copying\" vers. I started suspecting autism (about myself) before ve expressed it but refused to even think about it at that point, so in a way i kind of used ver as an excuse to research about autism. I just don't want to come across as rude/annoying since I've already brought up the whole \"might be autistic\" thing and i just don't want to act like i am more special than ve when i am not since we're all individuals)",
        "created_utc": 1670089935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking at my results I don’t think I have autism.",
        "author": "AnswerOdd7319",
        "url": "https://i.redd.it/zqj1hzt8cr3a1.jpg",
        "text": "",
        "created_utc": 1670087720,
        "upvote_ratio": 0.99
    },
    {
        "title": "Therapist doesn't think I'm autistic because of how far I've gotten in life?",
        "author": "usagibryan87",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbjpu2/therapist_doesnt_think_im_autistic_because_of_how/",
        "text": "As a kid I had trouble paying attention in class and they diagnosed me as having ADD, then they said \"no we were wrong he has OCD,\" then they wanted to test me for autism but my mom didn't go through with it because she didn't want me put on anymore meds. I had an IEP and was considered \"emotionally handicapped.\"\n\nI'm now in my 30s and started seeing a therapist for anxiety. At the end of the first session she asked me to create a list of \"all the things I think weren't normal growing up.\" After reading this list at the second session she said it sounds like \"a lot of trauma, OCD and aspergers.\" I used to wonder if I might be on the spectrum as it would explain so much, and this triggered me into doing research on it again.\n\nTwo weeks later I have my third session with this therapist and she says \"a lot of what we talked about sounds like it could be autism but I don't think you would have gotten this far in life if that was the case, so I'm going to say it's anxiety.\" Now I'm very confused.",
        "created_utc": 1670083709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paradoxical effects to medication due to serotonin differences?",
        "author": "Actually_Meow",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbg60w/paradoxical_effects_to_medication_due_to/",
        "text": "While in the process of getting diagnosed I watched quite a few YouTube videos.   \nIn one there was mentioned that Autistic humans can have paradoxical reactions to medications I believe due to serotonin differences.   \nIs this true and what kind of medications would this be?",
        "created_utc": 1670073669,
        "upvote_ratio": 1.0
    },
    {
        "title": "aspie test?",
        "author": "heavy-snuff",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zbeyz9/aspie_test/",
        "text": "I'm having an identity crisis right now so bear with me\n\nHow trustworthy is the aspie test? I scored 135/200 for Aspie and 82/200 for NT score. But there were a lot of odd questions like trouble to read clocks?? Or fascination for slowly flowing water?? (Which I both weirdly enough have) \n\nI also don't know if I answered these questions correctly because I could be interpreting them wrong or maybe I just convinced myself of certain struggles.\n\n\nI'm in the process of getting diagnosed for adhd and just now discovering that I might have autism is sending me into a spiral. :(",
        "created_utc": 1670069784,
        "upvote_ratio": 1.0
    },
    {
        "title": "My brother is autistic and my mother refuses to tell him",
        "author": "faloopaoompaloompa",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zb8g05/my_brother_is_autistic_and_my_mother_refuses_to/",
        "text": "My brother is in his 20s and is very obviously on the spectrum. He struggles with voice modulation and sometimes hurts his friends’ feelings and can’t understand why. He stims constantly and feels troubled by symptoms of “ADHD”, which my mother has just dismissed without giving him any additional information. \n\nMy mother has everyone under an EXTREME “secrecy” pact. She thinks it will hurt his feelings. Him not knowing that he’s autistic in my opinion has really hurt our relationship in the past. My mother kept his diagnosis from me until my brother and I cut off contact with each other for two years due to this huge barrier between us. \n\nI really think she is wrong for keeping this from him, and I resent her for keeping it a secret from me as well. What do you think?",
        "created_utc": 1670044588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you guys know there's an ND specific dating/social app?",
        "author": "facesintrees",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zb76v6/did_you_guys_know_theres_an_nd_specific/",
        "text": "It's called hiki. I just joined it yesterday but it's good so far, there's very little small talk lol",
        "created_utc": 1670040464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can autistic social communication styles manifest mainly as awkwardness rather than misunderstood rudeness?",
        "author": "who-even-am-i-_-",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zb76bp/can_autistic_social_communication_styles_manifest/",
        "text": "",
        "created_utc": 1670040416,
        "upvote_ratio": 1.0
    },
    {
        "title": "What/when did you first hear about ABA? From an Autistic ABA worker.",
        "author": "ayame400",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zb175h/whatwhen_did_you_first_hear_about_aba_from_an/",
        "text": "Wanted to know went people first heard about ABA and how it was described to them. I didn’t hear about ABA until I graduated undergrad and had it explained as as a teaching method that can be used for teaching skills or changing behavior for the better in anything/anyone with autism just being 1 focus so I got into it in grad school and actually did very little with autism (the focus of a lot of internship and labs were anxiety management and skills training for high stress caregiver type jobs.) \n\nI didn’t hear about any of the pushback until right before graduation and my school actually took care to include neurodiversity as a component to a lot classes (we had excercise on how to change stims like eye poking and skin picking into other stims but not remove stimming) and as a worker I think I do a good job teaching skills without disrespecting client autonomy (any more than needed to teach a skill they don’t want to learn like dressing themselves) or neurodiversity needs. I also have rarely come across issues with colleagues about how to address issues in a respectful manner to the kids and when I do I have never gotten push back (maybe because I’m the autistic bcba)\n\nThat said it’s naive to assume I am not unintentionally doing any practices that could cause harm so I am constantly watching what I’m doing and questioning the end goal and motives when I’m trying to change something. I’m not sure I to feel about ABA because I’ve been able to make a lot of kids a lot more independent and also feel and be heard by myself and their caregivers and often when I describe what I do to autistic people I get a positive response but if I say I do ABA the response is negative. I believe I’m helping kids who were like me growing up but I am also looking to see if I can do something else in the future like OT.",
        "created_utc": 1670022950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noise cancelling headphones recommendations?",
        "author": "Ok-Log-5062",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zayngj/noise_cancelling_headphones_recommendations/",
        "text": "I'm looking for a good pair of noise cancelling headphones to ask for for Christmas, and need opinions!  I have been using Loop earplugs for the past year and while they're good at making noise less abrasive, I find it overstimulating to have them in my ears. I'm Looking for headphones that are good quality noise cancelling. Also ones that are comfortable and don't put a lot of pressure on the head, but also won't fall off. (I have a small head). So far I've seen a lot of support for the Bose Quiet Comfort 45, but they're on the pricey side so if anyone has suggestions that are of similar style and quality I would love to hear them!\n\n(side note, I'm willing to ask for more expensive ones since I'll probably be using them every day, but want to get a good idea of what else is out there.) \n\nThanks!!",
        "created_utc": 1670017265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noise-canceling earplugs not helping, actively making me feel worse?",
        "author": "ac199510",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zawa4m/noisecanceling_earplugs_not_helping_actively/",
        "text": "So I just recently got two pairs of the Loop earplugs, the Quiet and Experience Plus ones, and I was so excited! I get super overstimulated by background noise and from what I’ve read, both pairs were good options. My issue now that I have them is that I’m feeling overwhelmed by the fact that I can’t hear what’s going on around me - and obviously that should be a good thing, but as someone who also likely has PTSD, I’m hyper vigilant and feel the need to constantly be aware of my surroundings. For instance, I’ve always been a one headphone in, one out kind of gal when I’m listening to music at home, and never feel safe listening to music when I’m taking walks alone out when I’m at work, out of fear of not hearing someone approach me. \n\nSo I guess my question is, how can I mitigate this? It really sucks being simultaneously overstimulated by sound but also prone to becoming very agitated/feeling unsafe if I can’t hear my surroundings. This obviously may be a weird/impossible situation to give advice on, but I figured I’d put it out there ✨",
        "created_utc": 1670012040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any suggestions as to what could be up with my mom??",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zau9zy/any_suggestions_as_to_what_could_be_up_with_my_mom/",
        "text": "So hey, 18 male. I have ADHD and suspect Autism. So im trying find out what could of possibly caused me to be born with ( hypothetically ) autism. I don't know my dad like that, since my parents are separated and live far from each other. I've always lived with my mom since birth. I got a couple of visits from my dad, all I remember was he was kinda awkward like me and struggled to find words when talking to me, also like me. But my mom is more complexed, she isn't highly intelligent ( like me ) But she's great at cooking, knows how to get money, and is very hard working. She's nice ( most of the time ) but she gets pissed off easily, when a minor problem happens she always tries to blame someone. She always forgets where she put things and sometimes starts crying while mad when she cant find it ( but then finds it in the most obvious place ) time where she would come home pissed off for no reason. When something breaks she either blames me or my sister, or thinks someone broke in our house ( when that's obviously not what happened ) in public she would sometimes stare down people for no reason ( either out of curiosity, or suspicion ), and she used to think some dude was harassing and following her ( when that wasn't the case ) her emotions switch on a dime. I think she stims as well, I always see her shaking her legs and sorta bouncing on the couch while watching tv. She has eye contact though, but to much eye contact lol. She always ask what's wrong with me, probably cause I don't show Im feeling or my emotions ( I think she's trying to read me or something ) and sometimes I would try to talk to her but she would give me a half assed response like she's distracted or something ( usually when she's watching tv or on her phone though ) last week her mother passed away she was sad and crying for a bit, but seemed fine and normal after that day. Other then that she's pretty nice lady, and I care a lot. And im scared she might he schizophrenic or early dementia or something. What's your guy's opinions?",
        "created_utc": 1670007472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Group home question",
        "author": "idk09807651",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zaqyd2/group_home_question/",
        "text": "Anyone here that’s on the high functioning and lives in a group home? If so how much freedom do u have in a group home? Like can u stay up anytime u want. Or can u have ur phone in ur room. Or can u eat or cook anything u want? I’ve never been to one. But I’m keeping an open mind about a group home. Im just curious. I have a job n everything. Still lives with my parents. Im just sacred to move out cuz I feel like I fail everything. Like I know nothing about bills. N stuff like that. Literally not a single thing. And I’m already 22. Normal 22 person would know those things about paying ur bill. Or taxes or audit or stuff like that. As u can see from my text here I know nothing. So I’m open minded about group home.",
        "created_utc": 1669999646,
        "upvote_ratio": 0.99
    },
    {
        "title": "Discussing Weaknesses in Interviews",
        "author": "Sergeant_Static",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zaqkhw/discussing_weaknesses_in_interviews/",
        "text": "Job interviews in general can be difficult for us, but one of the main things I have trouble with is being asked to discuss my weaknesses. I feel like I'm put in a position to either sabotage myself or lie.\n\nIn theory, it's good to be aware of the things we struggle with, but I have no idea how honest the other applicants are being, or how unforgiving the interviewer may be about whatever I admit. If I talk about ADHD and time management, will they think that I'm just lazy and will be spacing out during work? If I talk about difficulty in customer service jobs, will they think I'm completely incapable of politely interacting with clients? I feel like there's no way to be an honest applicant without making myself seem like an untrustworthy or unreliable worker.\n\nThe alternative is to make up a trivial weakness that could easily be remedied, or is inapplicable to the job in question. You could even list weaknesses that could be spun into a positive point, like calling yourself a 'perfectionist,' and implying you try 'too hard' to do your work perfectly. I'm reminded of a scene in The Office where Michael Scott said his weaknesses are that he works too hard, cares too much, and is too invested in his job. It just seems so transparently dishonest, but I almost feel like it's expected of me.\n\nDoes anyone else struggle with this? Please feel free to share your own stories and experiences.",
        "created_utc": 1669998664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would these scores mean i'm on the spectrum? help appreciated",
        "author": "speeds3",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zapxl2/would_these_scores_mean_im_on_the_spectrum_help/",
        "text": "I just did several ASD tests, and I got :\n\n\\- Aspie Quiz:\n\nYour broader autism cluster (Aspie) score: 122 of 200\n\nYour neurotypical (non-autistic) score: 89 of 200\n\n\\- Cat Q: 134\n\n\\- Raads-r: 106\n\n\\- AQ: 37\n\nAnyone familiar with those tests can give me some feedback please? i'm a little confused on what's going on",
        "created_utc": 1669997058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Magellan Healthcare admits that they hope to use genetic testing to PREVENT AUTISM",
        "author": "tatorpole1",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zaoct4/magellan_healthcare_admits_that_they_hope_to_use/",
        "text": "Screenshots of the information page about autism and genetics.  They don't want to cure, **they want to prevent autism.**\n\n\\-This is what Google shows about Magellan Healthcare.- \n\nMagellan Health *manages the fastest growing, most complex areas of healthcare*, bringing solutions to health plans, employers and state and Federal programs.\n\nMagellan Health *provides a comprehensive suite of clinical programs that drive down costs and improve health outcomes, while focusing on the whole patient*.\n\nMagellan partners with the states of **Florida, Louisiana, New Mexico, Virginia and Wyoming** and local governments in Pennsylvania to manage behavioral health services for more than a million Medicaid beneficiaries.",
        "created_utc": 1669993090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that I have Schrödinger's autism or \"\"hidden\"\" autism?",
        "author": "DeckOfUnoCards",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zanfl7/is_it_possible_that_i_have_schrödingers_autism_or/",
        "text": "i 16(FtM), suspect that i might be autistic but the way it \"shows\" just goes under the radar or usual symptoms way too much to be considered \"autistic enough\"\n\nive been taking A LOT of different online tests since 1, nobody irl believes me when i speak out about my suspicions of being autistic or neurodivergent and 2, i dont have enough money nor time to go to a professional to do a screening. and even if i do go do a test then its probably REALLY modified by my parents (they refuse to believe or even hear me out abt things regarding mentality/mental disabilities, disorders/similar stuff). Every test ive took has said that i am autistic and have a high possiblity of being autistic\n\nmy symptoms, as said in the first paragraph, are way too \"normal\" to be austictic but too \"weird\" to be considered normal. i struggle to talk to other people or make friends because i usually get nervous and anxious when talking to them and tend to play w/ my hands (i think you call that stimming, i usually feel better if i do them in a stressful situation/any high intensity emotion), look a different direction (i dont like eye contact AT ALL, it makes me wanna cry), i become less verbal and only nod, shake my head, shrug or just little \"uh, yeah\"'s/similar. all of those just get seen as disrespect or that im \"trying to avoid them\" when im not! i really want to let them know im listening to them and im there, its just that i cannot stand focusing on them(?). its hard to explain. i want to socialize but when i do i just become anxious and dont know how to interact w/ people or the world. i struggle with communication if its w/ an adult/older person or anyone who isnt my friend.\n\ni am extremely sensitive to foam or smooth foamy textures and just become near-unresponsive when im in contact w/ it for too long. styro foam (or just any kind of foam for that matter) has made me unable to interact or do stuff normally on multiple occasions. i get nervous and shake uncontrollably if the feeling of discomfort near it gets dragged out for too long. ive not seen anyone else (irl) that have a problem with them, its has always been only me. this has been happening when i was in kindergarten (or at least when i was able to remember things around me). i would always want to cry when i have to walk into a room w/ foam matting, every chance i got i would ALWAYS try to run to a wood or plastic surface to avoid the foam.\n\ni am also sensitive to socks. wearing them makes me feel uncomfortable and just want to cry. /shrug\n\ni sometimes(a lot actually) \"stim\" to get the stimulation i need to function or just not lose focus. i play around w/ my hands: counting each one of them over and over again, intertwinning them together in weird ways, rub them against each other repeatedly or just admire them for long periods of time; i also just like to fiddle w/ whatever object that is near me, it could be as simple as a roll of tape but it would still,, mesmerise me so much.\n\nfrom when i was a kid to now, ive just always felt that i interacted with the world so differently yet so normally. time and time again ive been in a loop of \"im def autistic\" and \"im not autistic, im \\_\\_!\"\n\nnow for some things that makes it seem that im \"too normal\"; i like to socialize w/ my FRIENDS and sometimes (ive kinda just learned to, shut up, abt it :( yeah) infodump abt my silly interests, i am quite productive in things like drawing and writting about the things i LOVE (not school projects, not needed essays, not important stuff but i would literally sit down and right countless paragraphs about my love for \\_\\_\\_\\_\\_\\_ \\_\\_\\_\\_\\_, and other goofy stuff) i can befriend almost anyone regardless of their personality! (i can put up w/ a lot of stuff! kind of a trauma response :(.)\n\nanother thing that i think might be considered autistic is my absolute OBSESSION w/ my interests that i refuse to infodump abt it to people i dont trust in fear of them getting into the same things i love. its like, \"you may like the same things i do. but you will never like it as deeply and autistic as i do.\" :3\n\nif you have any advice it'd be greatly appreciated! thank you in advance.",
        "created_utc": 1669990630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a common thing to end up speechless and end up saying nothing?",
        "author": "rawr4me",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zan22d/is_it_a_common_thing_to_end_up_speechless_and_end/",
        "text": "I have a friend with diagnosed ADHD and autism. One unusual behavior I consistently observe is that in particular situations where I speak freely and vulnerably, they often end up saying \"I don't know what to say to that\" and never end up giving a real response. This is quite jarring for me because these are the exact situations where I would like to receive validation and pretty much would reliably receive it from most people in that kind of situation.\n\nThe two scenarios that draw such absent responses are: 1) after I share my heartfelt love and appreciation for them, or 2) after I share that I've experienced hardship as a result of their behavior and I'm seeking empathy.\n\nIn the first case even when I know they enjoyed what I said, it literally seems beyond them to say something as simple as \"I appreciated hearing that\" or a thank you.\n\nIn the second case they might physically acknowledge my hardship by holding my hand or hugging me yet be unable to offer any basic form of verbal validation like \"I'm sorry you went through that\".\n\nWhat might they be thinking when they blank out and what stops them from being able to say literally any affirmative comment?",
        "created_utc": 1669989665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Benefits of being clinically diagnosed?",
        "author": "viridianthetired",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zamqfw/benefits_of_being_clinically_diagnosed/",
        "text": "I'm discussing with my parents the fact that I want to be tested for autism (I'm fairly confident that I *am* autistic, I've done a lot of research, and I've looked through the diagnostic criteria and am decently sure I'd qualify for a diagnosis). \n\nOne of the biggest protests my mom has is that a diagnosis would not benefit me at all. I've managed to do decently well in school, except for one year that I was deep in autistic burnout and a major depressive episode, and high school is extremely overstimulating but I've been doing an online program ever since then and plan to finish high school online as well (I'm 16 and have a year and a half of high school left).\n\nBeing allowed to wear headphones/have a fidget with me during tests would benefit me greatly, but I don't technically *need* them in order to pass and get good grades, it's just a matter of working through the distress and trying not to let it distract me. It *does* cause me a lot of distress though, I've just learned to work through it. I've also always tended to take a long time on tests, but the time limit used by the online program is long enough that I'm able to finish. \n\nI don't know that this will be true during college though. But my mom is not sure the diagnosis would be worth the time and effort that the process will take. I don't know how to adequately explain it to her. Is there any advice you guys could possibly give?",
        "created_utc": 1669988865,
        "upvote_ratio": 0.99
    },
    {
        "title": "Does one normally go through a Therapist/Psychologist for an evaluation or a Psychiatrist. (In America)",
        "author": "bellstarelvina",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zal9rg/does_one_normally_go_through_a/",
        "text": "",
        "created_utc": 1669985271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I tell my son he’s autistic?",
        "author": "ablue_dog",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/zaj6sg/should_i_tell_my_son_hes_autistic/",
        "text": "I (35f) have a son (8m) we self-diagnosed as on the spectrum. Like many of you, in researching his condition I discovered I am on the spectrum as well. I told my parents, who confirm I was identified as autistic by teachers in kindergarten and third grade, however my parents decided not to tell me ‘unless I began to struggle’. Also like many of you, this diagnosis has come as a relief. \n\nOn one hand I am thankful that my parents didn’t tell me I was different in grade school, but I’m wondering if this is the right approach for my son. Part of my gratitude is timing - autistic kids were treated and understood very differently in the 90’s versus today.  Given the progress that has been made, what is the best timing for revealing my son’s diagnosis to him?\n\nFor context, he can ‘pass’ socially. No teachers have identified him as on the spectrum yet, though I think his current teacher might soon.  He has trouble understanding what can hurt his friends feelings and gets overwhelmed by a full day of socialization at school, as well as by noise. We have set up our home life to be sensitive to his needs and we coach him through social situations; at home the only thing that would change after the revelation would be him knowing his label.  At school, the potential positive outcome could include getting permission for him to wear nose reducing headphones, though he is offered them daily by his teacher already (his teacher has a sensory overwhelm station available to all kids and the school has multiple sensory sensitive hallways for those who need it - PA schools are fantastic!). The negative I am most concerned about is him seeing himself as different and that influencing his socialization. We are of the mindset that masking is a necessary evil to get by in the world today. I believe it is important for him to learn this skill and then learn how to turn it on and off, based largely on my own experiences. Additionally, I’m concerned that if we reveal his autism, he won’t learn to mask properly. Not sure if that’s a valid concern. \n\nTLDR: what is the cost/benefit analysis on revealing my son’s diagnosis to him now in elementary school versus later in life?",
        "created_utc": 1669979617,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like a robot that someone forgot to program commands for.",
        "author": "QuestionsAtNight",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/za61jh/i_feel_like_a_robot_that_someone_forgot_to/",
        "text": "I’ve been told that I might have autism and I seem to check off all the boxes of the DSM-5, but haven’t been formally diagnosed yet. I’m not even sure if Autism really affects my life in a negative way like a lot of other Autistic people are affected, other than getting burned out easily, especially from social interaction. But another thing I noticed is that I crave the need for structure in daily life- even though I would struggle with it because of ADHD.\n\nSince I’ve been without a job again, I’ve felt like I don’t know what to do with my life. I’ve told people this, and they say that I shouldn’t worry, because I’m still young (23). But what I mean is that I don’t know what to do in the day-to-day. I feel knowing what to do was easier when I had the structure of school- even though I wouldn’t go back because of how much I struggled there. But now that I have somewhat of a choice of what to do, I’m not sure what to do. I feel like a robot that someone forgot to program commands for. Ive thought about joining the military in the past, because I feel like I would have more purpose with a strict schedule and a goal. I’ve been looking for an easier job, and I know most of what I want to accomplish in my life, but when I wake up in the morning, I feel like I don’t know what I’m supposed to be doing. That’s as best as I can describe it.\n\nCan anyone relate to this feeling? Or is this maybe just what all young people feel, or people with ADHD?",
        "created_utc": 1669942461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does someone saying your name feel intrusive, somehow?",
        "author": "moody_fangirl_1966",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z9uulz/does_someone_saying_your_name_feel_intrusive/",
        "text": "Just curious. Experiencing this reminded me of how I’ve heard it said that eye contact can feel invasive/intrusive, but instead it’s more when someone uses my name. \n\nLike, I like it but it’s uncomfortable and feels invasive at the same time, and I don’t know if this is related to a different social style or maybe it’s just because im not used to it. \n\nJust curious how other people feel about someone using your name! \n\nThanks in advance!",
        "created_utc": 1669918079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have no sensory issues or Hyposensititve?",
        "author": "Hellofre123",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z9u3uw/do_you_have_no_sensory_issues_or_hyposensititve/",
        "text": "Hey people, 18 male ( Not diagnosed, Suspect ASD ) I don't know if I have any sensory problems or if im just hyposensitive, idk how any of this sensory stuff works! I don't know if Im sensitive to sound, but small or big sudden sounds make me jump, and loud vehicles like motorcycles and trucks kinda make me panic and scared from the loudness, I remember I used to cover my ears in fear from the sound of trains when I was a kid, now I wear earphones when I go to train station. But I love listening to loud music. I have a heat intolerance as well, I get itchy from heat and start feeling pokes. When my house is hot I slow down and feel tired. I used to sweat pretty quick even when I didn't feel hot. I wear shirts when it's cold, I love feeling cold. I put our house at 67 to 69 Fahrenheit at nighttime, and my mom and sister complain to me about it even though I need it to sleep. Sometimes it doesn't feel as cold the next day. Taste, I can't use a spoon if I taste the metallic. I can't stand the taste of metallic or metal. I love drowning my food in hot sauce though, makes any food taste better. And Pain, I feel pain and it hurts, but for some reason I like feeling certain pain. Like last week I sorta tore my back from jumping, and I would stretch that part or press on it to feel it and Liked it ( idk how to explain ) also remember I used to do this as a child, whenever I would get a shot and a band-aid, I would press on the band-aid repeatedly to feel the soreness and slight pain of it, it felt good. Do you guys relate to this? And could this be hyposensitivity?",
        "created_utc": 1669916545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Undercover Autism",
        "author": "Autilistic",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z9qgrp/undercover_autism/",
        "text": "Did your clinician offer any postdiagnostic support?\n\nMine didn't, and after the initial euphoria of self-recognition, I spiralled into a full identity crisis. Without support I floundered around on the internet getting more and more confused and depressed by the mixed and often negative messages.\n\nOnce recovered from this, I wrote down all the useful things I had learnt, tricks and tools, as well as describing the concepts I had finally got a handle on. May aim? To share this practical knowledge with others. Energy Accounting was a game changer for me for example.\n\nI would be very interested to know how many people have found their diagnosistic experience to be a supported one. I hope my experience is unusual, but from the many blogs I have read, I suspect it is not.",
        "created_utc": 1669907925,
        "upvote_ratio": 1.0
    },
    {
        "title": "self dx love",
        "author": "Low_Fishing722",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z9d6jt/self_dx_love/",
        "text": "just wanted to express how much i appreciate that self diagnosis is fine here. i’m used to ppl (my sister LMAOAO) telling me that i can’t say anything is for sure unless i hear it from a doctor or psychologist first but considering i am an afab black minor i think it’s unlikely that i’ll even be taken seriously. and then there’s things like twitter where a bunch of people think like “self diagnosis bitches are ruining the economy” and whatnot but u all are so nice. i’ve only been scrolling thru this sub for like two minutes but u have made me comfortable with claiming my neurodivergency. i am in fact autistic. i am in fact the silly funky little brain man. and i do not need it invalidated or validated tbh by a tall white man in a lab coat who has never ever experienced what i be experiencing. i am the realest. thank u",
        "created_utc": 1669866045,
        "upvote_ratio": 0.98
    },
    {
        "title": "What should I look for in a therapist?",
        "author": "jetson0",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z9baq2/what_should_i_look_for_in_a_therapist/",
        "text": "What should I look for in a therapist to find one who will work on my issues in depth ? I don’t think my new therapist is doing her job poorly. I think it might be too early to start looking for someone new, and I feel guilty. I feel like I’m just avoiding commitment and don’t really want to get better if I do try to switch.\n\nI tried talking about my sensory sensitivities around taking a shower, brushing my teeth, and washing my face, and I might’ve (I don’t remember) alluded to the fact that trauma plays a role in my avoidance of hygiene. I make myself late by procrastinating until my ADHD brain kicks into overdrive, and I ignore all of the negative emotions I have around hygiene. This is a self destructive cycle and anxious spiral that repeats itself everyday. She asked why I don’t do it in the morning because that’s what she does, and suggested I do that. I just think we didn’t really discuss why I have such strong emotions and avoidance around things people don’t have second thoughts about.\n\nThat’s just one example, but from the three or four things we spoke about, I basically heard “don’t do that, I wouldn’t do that.” But I don’t understand WHY I do certain things and why I have a preoccupation with certain topics. It’s affecting my life.\n\nI just ended a brief relationship with another therapist who was stoic and said the same thing, “you shouldn’t feel that way, that’s bad.” But we don’t go into the psychology of it and develop new patterns so I can stop being so restrictive and obsessive. I guess I’m just really frustrated I’m not doing well, and want to find the right type of help.",
        "created_utc": 1669861319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with meeting new people.",
        "author": "Mortico",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z993h8/struggling_with_meeting_new_people/",
        "text": "I've been trying to make new friends for 15 years.  I've been trying MUCH harder lately, trying all sorts of different ways to get people interested in me.  I've been trying harder because I recently found out I was autistic, so I am more aware of my deficiencies.\n\nI've tried just playing it cool and waiting for people to approach me.  This never works.\n\nI've tried just chatting with people but not being pushy about introductions or contact info.  \"Add me on discord!\" I usually have a nice conversation but it goes nowhere.\n\nI've tried chiming in if a conversation topic crosses one of my special interests.\n\nI've tried just being my authentic self, and that doesn't work either.\n\nSo I'm at a loss.  I haven't made a new friend in like 15 years, and I'm getting rather lonely now that I'm divorced.\n\nI am basically starting from nothing.  I don't have any friends that could include me or introduce me to new people.  I have to go out in public and just talk to people.  Is there some key thing I'm missing?\n\nHow do you start literally from scratch to build a social life?\n\nI'm kind of aware that I need to create a persona for public consumption, and I'm working on that, but in the meantime it would be nice if I had at least one person in my life that actually wants to be around me.\n\nEdit: I don't really have time for hobbies at the moment, nor do I have much money.  I'm hoping to meet people IRL.  I have lots of online friends but no one locally.  It's just not the same.",
        "created_utc": 1669855790,
        "upvote_ratio": 0.86
    },
    {
        "title": "possibly autistic? confused",
        "author": "wasteyrself666",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z97ylm/possibly_autistic_confused/",
        "text": "got results back on an autism screening (not a diagnosis just to see if it was possible i hade it) and the psych told me it was possible but i needed more screening. i forgot what screening it was, but for a \"definite\" most likely your result had to be a 70 or above and i got a 66. im wondering if i should go for more testing. i have very strong interests in certain things (longest has been going for around 7 years) but i dont really have sensory and social issues? i have a hard time talking and becoming friends with people but i feel like i understand social cues. i took that pinned quiz and got \"Your broader autism cluster (Aspie) score: 103 of 200 Your neurotypical (non-autistic) score: 123 of 200\". a lot of my friends are autistic and they say they could see it and wouldnt be surprised, idk i just want to talk about it/get an answer",
        "created_utc": 1669853013,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are people's experiences with challenging masking?",
        "author": "Moon_Sister_",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z92zpp/what_are_peoples_experiences_with_challenging/",
        "text": "I've decided to self diagnose after about a year of research and self-exploration. I can't afford an evaluation, but it has felt like I'm in limbo, hinging the continuation of my journey on whether or not a doctor says \"yep, i have decided to validate you\". I still struggle with impostor type feelings, but I think I will gradually move into a place where I can confidently live as a person on the spectrum. \n\nOne challenge I'm facing is whether or not to unmask, how to even do it, and figuring out where the delineation lies between my true self and my socially acceptable self. I'm worried about hurting, offending, or annoying people if I confuse masking with things that it isn't. Like if I say what I want without agonizingly nitpicking over my tone, facial expression, and choice of words, would that be wrong? Because I have decades of historical data that I can tap into to be able to know if something I say will be taken wrong and exactly what tone inflection I need to use so that my words will be interpreted the way I intend them to. And while it's exhausting to do all that mental labor, does that make me an asshole if I choose to not do it?",
        "created_utc": 1669841831,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with my little sister!",
        "author": "1tsJustQ",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8zybp/i_need_help_with_my_little_sister/",
        "text": "Hello! I do not have Autism but my 8 year old sister does. She was diagnosed when she was around 3 I think, I don't really remember. I wanna help her but I don't know how. My parents loves her, but they fight a lot and work a lot. They don't really have time with me or any of my siblings. I wanna help her the best way I can. I have bonded with her a lot more recently, she loves horses, cats, babies (She gets really excited when she sees a baby it's adorable) and she looooves talking! I know Autism is when you have a hard time communicating but she loves talking even tho I don't understand what she's talking about. I just pretend I listen, I can understand her sometimes. But most of the time I don't understand anything she says. She gets extremely shy when guests comes in our house and she mostly stays in her room or my parents room (I'm always with her when guests are coming) and we just start talking. I have read that kids with autism is usually \"cold\" but I find my sister to be very loving, caring and she has a lot of empathy. But is there any way I can help her? I've been trying to get her to write her name for the past 3 years, a little progress as been made. She can write an half \"A\". I don't wanna force her into doing stuff but sometimes I have to or else she's just not going to learn. My parents have been trying to send her to a school that is specifically for kids with Autism, ADHD, etc... But we're still waiting. I just want the best for her, do you guys have any tips? I would greatly appreciate if you shared some tips and tricks on how to get her to write or name or I don't know, anything! I just want her to have a bright future. (I'll of course always be there for her in the future).",
        "created_utc": 1669834997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing too little/too much, what is the right amount?",
        "author": "HummingbirdHawkMothx",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8yom8/sharing_too_littletoo_much_what_is_the_right/",
        "text": "I feel like I constantly run into this issue with NTs, see I do not really like sharing my issues with other people and my parents were a big influence in that. I also really don't like burdening people, especially since there is a lot of heavy stuff going on. \n\nIt has been an issue since forever.   \nI would have schoolmates that I barely interacted with complain and be in a mood that I wouldn't tell them why I looked sad and then call me an attention seeker if I had a meltdown in the bathroom (in private! Like, let it make sense!)  \nWhen I told my (ex) best friend of 5 years that I was really struggling with eating, I essentially got ignored by her and our shared friends for half a year because she didn't like that. Like straight out running away from me during lunch break for trusting her with this.\n\nThe same people that tell me I don't trust them enough will literally turn around and berate me for Trauma dumping (I really hate this term!) in the same breath and I just don't get it. It's not that I ever get into details of stuff that happened either. \n\nSomehow I just can't make it right for NTs, with my ND friends I have never had an issue with about this.   \n\n\nIs this actually an autism thing? Is there a secret formula? Does anyone understand this logic?",
        "created_utc": 1669832319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neurotypical Social Interactions",
        "author": "InevitableCucumber53",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8wg5a/neurotypical_social_interactions/",
        "text": "  On the [decoding autism in the DSM-V criteria](https://embrace-autism.com/decoding-autism-in-the-dsm-5/) page of Embrace Autism she asks;\n\n* Do you like/love small talk?\n* Do you use small talk to indicate your class, education, income, religion, and political views without saying it directly?\n* Do you like being in social gatherings for extended periods?\n* Do you prefer speaking superficially and generally, rather than about your areas of interest?\n* Do you choose to hang out and socialize with people rather than interact for a purpose?\n\nFollowed by, \"If you said NO to most of these bullet points, ya ain’t behaving like a neurotypical, and you check the boxes for autism.\"  \n\n\nI'm finding it really hard to believe that anyone, let alone the majority of people \"like/love small talk\", \"prefer speaking superficially\", and use small talk to indicate things about themselves without directly saying those things. Sure, I guess I can understand people enjoying 'hanging out' and being in a social setting for extended periods. Clearly they would just be extroverts. But come on, who loves small talk and prefers to speak superficially? Is that really a thing that most people enjoy? I thought that everyone just faked their way through those boring, mind numbing, draining interactions.",
        "created_utc": 1669827129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did an autism diagnosis as an adult do anything for you?",
        "author": "Geek1979",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8sj3o/did_an_autism_diagnosis_as_an_adult_do_anything/",
        "text": "I was diagnosed with ADHD when I was 8. I guess now I would be diagnosed as ADD mixed- inattentive and hyperactive. For the past year or two I have wondered if I may also be autistic. I’m just wondering what that would do for me and how that has affected others.",
        "created_utc": 1669817599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sensory processing disorder vs ASD",
        "author": "barblovesbirbs",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8q06q/sensory_processing_disorder_vs_asd/",
        "text": "So I've been very sensitive to sensory stimuli every since I was a child and it has gotten worse with age (I also connected some dots and realized that some of my behaviors that others considered weird also stemmed from that). Loud noises make me want to cover my ears and disappear into the ground, it's borderline painful. Bright/flashing lights are anxiety-inducing and completely disorienting. Some textures can be absolute hell to deal with (wool and that stiff velvety material can go die in a ditch; ever since I was a kid eating anything resembling minced meat or biting into a tendon/bone/cartilage immediately makes me nauseous and I can't eat anything anymore). Smells seem to affect me more than people around me (I used to be freaked out by the smell of coffee, which many find nice?? Now it's pretty much all stronger scents that almost make me want to escape whatever situation I'm in.) The other day I literally started shaking and having an anxiety attack plus not knowing where to put my hands (kinda flailing around) after touching a bag with cucumbers that have gone bad (they were soft, and I was not expecting that). While talking to my friends and family I also realised that it's not as common as I thought to have strictly the right sock and the left sock, or to want your clothes to fit you in the exact right way (if the seam or shape is unusual, I'll feel it until I fix it and it can be very distracting, even anxiety inducing). Every time I would mention any of that to my psychiatrist or therapist, they would chalk it up to anxiety. After my last therapy session, where I stood my ground and explained to my therapist how bad these sensory issues really are and how far they go, she has suggested that I might simply be a Highly Sensitive Person. Now that makes sense to some extent (although I was bummed out to find out that sensory processing disorders are rarely recignized as actual disorders, so it's difficult to get treatment, especially as an adult). But I'm left wondering if that's the actual underlying issue here.\n\nI've always been an awkward kid, trying to craft personalities that would match whoever I had to talk to at the time, by observing everyone else's behavior and reactions. Socializing has never been easy and would constantly make me feel drained due to all the masking (even with people that I'd consider close to me). These days, since I need to be a functioning adult, I put on this carefully manufactured persona (which I call my Customer Service mask lol) to try and be polite to everyone and seem like a functioning member of society. I try not to talk as much as possible or at least not to get too into the conversations to avoid bluntly saying what's on my mind or info-dumping. I'd say I'm not too bad at reading emotions or people's intentions, but I do tend to perceive them as negative and need to be reassured a million times that people are not angry or annoyed with me just because they said something more neutral or didn't express their emotions strongly. For example, when my friends are too tired to be enthusiastic, I tend to overthink it and follow them around asking if they hate me, because it's difficult for me to read their emotions if they're somewhere in the middle of the spectrum.\n\nThinking back, I also used to info-dump a lot until I started being too anxious that it's annoying for others and that I'm being a nuisance. I used to sit my mom down in the kitchen pretty much every day after school and spend hours talking about whatever I found fascinating at that point. I still sometimes start spilling facts about opossums or my current favorite game lol (did you know that opossums have 13 nipples???).\n\nSo I've been treated simply for depression and GAD for the past 4-5 years, but I feel like nothing is helping or the approach is wrong. I've tried different therapists and a ton of different medication, but I'm starting to feel really helpless. I recently started suspecting that my diagnosis might not be completely correct, and god, I really want to get these issues sorted out or at least learn how to deal with them, because it's interfering with my life in a major way.\n\nAnyway, if you read this far - what do you think? Should I focus on hyper-sensitivity and call it a day? Are the behavior that I've described \"normal\", or are they more like what people on the spectrum experience? Maybe you can even relate to some of these things and can advise me on how to deal with them?",
        "created_utc": 1669810564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Using Alcohol To Unmask",
        "author": "OptimumPringles",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8p7bv/using_alcohol_to_unmask/",
        "text": "Hi guys, I’d like to preface this by saying that I’m not diagnosed as neurodivergent, but reevaluating my past experiences and how I feel the world have made me strongly suspect that I am.\nLast night, I went to a club that was doing an indie night with some of my friends. I always wear earplugs because the loud music hurts my ears and makes me very anxious. Usually when we go out I get drunk beforehand to make the clubs tolerable, and I feel it helps me mask and “fit in” with more ease.\nWell this time I decided that I wouldn’t drink and that I would just have fun as myself; to say it went disastrously feels like a bit of an overstatement. \nBeing sober, I wasn’t anywhere near comfortable enough to dance extravagantly. When I’m alone, I flail my arms like crazy, but when I’m with others I feel strongly judged, so I was focusing more on the music and just dancing my tapping my foot and swaying slightly. I was genuinely having fun, even if I wasn’t outwardly expressing it.\nWell my friends didn’t take it this way. To them I wasn’t having fun, and so they grabbed my arms multiple times to try and get them up in the air. I wasn’t comfortable with this so I returned them to my pockets but multiple times they told me to “bust a move,” even after they said they would stop.\nAfter telling them multiple times that I didn’t want to, their insistence made me feel a but violated in all honesty. I was having fun by just enjoying the music, but that wasn’t good enough for them. They took away my fun by trying to make me have fun in their way, and in doing so ruined my night. \nFurthermore, everyone kept forming smaller groups on the night, and I was excluded. I was left standing on my own. All of this pressure from others made me feel very anxious, and I was overstimulated from everyone bumping into me (it was very busy), which accumulated in me leaving shortly after.\nI ended up crying on the walk home. I realised that I can’t fit in with others when I’m sober - I stick out like a sore thumb (never understood that expression). I can only fit in and meet others standards when I’m drunk. Basically, I feel as though I’ve always stood out and am almost destined to be alone in some way. \nI’ve also decided that I’m going to take a break from drinking alcohol. I don’t want to go down a slippery slope of drinking as a coping mechanism, and I suppose the only way to get better at functioning sober and masking is to be sober.\nI was just ranting really, but also wondering if others have similar experience. Thanks for reading, everyone.",
        "created_utc": 1669807962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't REMEMBER feelings",
        "author": "monkeyluvrxoxo",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8oy08/cant_remember_feelings/",
        "text": "ive been trying to understand my identity and if I fit on the spectrum for a couple years now and I can say I'm pretty confident. but I still like to come on here and get insight into some of my behaviours. the problem is, I have the hardest time recalling how I usually feel or think. I've been thinking of bringing up a behavior of mine on here for weeks and just went to write a post and forgot every detail of how I feel in those moments. \nsame thing happens when I'm trying to communicate with my family or partner about things that bother me. I will have it all worked out in my head but the moment I need to type it or say it out loud to them, I blank. \nwhenever I need to communicate something that's really bothered me to my dad or... for example... why I believe I'm on the spectrum, I forget every single detail and end up just bursting out into tears of frustration... or he will completely misundeestand what I'm saying. as soon as I start crying, it ends in him not believing me or thinking I'm asking for attention. \n\nit's very very upsetting. does anyone else experience this? is this ND behavior or just a human thing? any tips on working around it?",
        "created_utc": 1669807111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latest Mini-Blog Entry: \"Balenciaga\"",
        "author": "KingRandor82",
        "url": "https://www.reddit.com/r/AutismTranslated/comments/z8l0w2/latest_miniblog_entry_balenciaga/",
        "text": "**https://gettingrealwithautism.wordpress.com/2022/11/30/balenciaga/** \n\nAre you ready for the de-stigmatization and vindication of Autism? This begins that; how so? Read on :)",
        "created_utc": 1669793561,
        "upvote_ratio": 1.0
    }
]